{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "softwarecw.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Elizabeth Drewek",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T15:43:17.000Z",
          "Titre": "I have been corresponding with agent…",
          "Contenu": "I have been corresponding with agent trying to get my print shop to run. I have no license key number to open app. They were supposed to let me know after several attempts what to do. I’ve asked how to.get a credit since I can use. No reply. I would like a credit"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sherise Ulmer",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T15:24:13.000Z",
          "Titre": "These people are terrible and liars",
          "Contenu": "These people are terrible and liars. They intentionally charged me when I wasn’t supposed to be charged. They are the biggest liars and fraud company.. stay awayUpdate:They have very bad customer service just read the reply. Don’t worry we will stay away as well as others should . They are POS and rude. Terrible terrible people.. go learn customer service a&$hole"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 2,
          "Date": "2023-09-01T17:05:23.000Z",
          "Titre": "No support or even response for purchase that doesn't work",
          "Contenu": "Purchased a copy of Dragon NaturallySpeaking 15 after having a computer meltdown.  I am paralyzed from the shoulders down, so I needed immediate access. SoftwareCW had a great purchase price, so I purchased and downloaded it on my new computer ASAP. It did not work properly from the word go. I reinstalled it and continued to have the same problems. I reached out to SoftwareCW to ask for support and got no reply. There isn't even an option for a refund but you have open the download. You will never have any idea whether the software works until you open the download, so if it doesn't work, you're screwed, just like I was for $452.60 I will never see again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Annemarie Kleinhans",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T03:12:21.000Z",
          "Titre": "Beware: Tried to buy Microsoft 365 Personal",
          "Contenu": "Tried to buy Microsoft 365 Personal; credit card was charged but no download, no order listed on website, and no response to my email. Second attempt at support email--link non-functional. Poor service or fraud???"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steve Burgess",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T23:42:46.000Z",
          "Titre": "Purchased the Turbo Cad package and…",
          "Contenu": "Purchased the Turbo Cad package and never got a download link from the company. No customer service ever joined the chat bot and no phone number listed on the site for customer service.  Product paid for and never received.  I don't recommend buying for this group04/47"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bertrand",
          "Nb_Reviews": 2,
          "Date": "2013-10-14T12:54:50.000Z",
          "Titre": "Integrity",
          "Contenu": "Bought MS Office 2010 2 licenses. Installed 2 on 1 laptop and 1 on a work computer. Desktop gave me MS office registration issues. Called MS Support and checked on license. They conveyed that the license have been used by too many users and could not being reactivated. Bottom line I got ripped off , end up with only 1 usable license overly popular."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian P.",
          "Nb_Reviews": 1,
          "Date": "2013-05-23T15:06:57.000Z",
          "Titre": "Unbelievable Price- Too Good to Be True",
          "Contenu": "The price for Microsoft Office was great.  Paid the bill and tried to follow the instructions to download.  No luck after hours of following instructions.  Finally gave up.  The next day I receive an email saying a customer service case has been opened.  Never talked to anyone, what's the problem?  We had a pricing error and won't be able to honor the price.  We have however refunded your card.  Seems there are laws regarding false advertising.  Maybe the feds need to be involved in internet sales."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "atelm",
          "Nb_Reviews": 2,
          "Date": "2017-01-23T03:42:14.000Z",
          "Titre": "Be cautious",
          "Contenu": "I received an item in error. They so far have refused to accept a return saying that the item has been opened. When I refered to their return policy it appears as though my item falls within the parameter.  Pricing was very fishy as my item was stated as being a special promotional price only to see it radically cheaper on the website now. I am skeptical about the ethics of this vendor."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "R Bruce Martin",
          "Nb_Reviews": 2,
          "Date": "2014-01-23T17:38:38.000Z",
          "Titre": "Return policy is not fair!!!!!",
          "Contenu": "I am retired. My income is from Social Security, no pension.\r I use Windows X P. I have upgraded five time my Microsoft Widows XP without any problems. Late last year I inadvertantly deleted my \"Office\" software.. I searched for a replacementand found Software CW. Iboughtand downloaded the 2013 edition of \"Office\". When I trid to install it in my computer I was notified that the 2013 version is not compatible with Windows XP. Accordingly, I asked the distributor for my money back. They have refused1\r My complaint is that there should be a disclaimer associated with the purchase, not after the fact.\r SoftwareCW shouldewilling to refund my money since they have lost knothing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rob Wallace",
          "Nb_Reviews": 1,
          "Date": "2013-04-01T15:18:46.000Z",
          "Titre": "I CAN'T INSTALL LOGIC THAT I BOUGHT OVER 2 WEEKS AGO",
          "Contenu": "I CAN'T BELIEVE THE HASSLE IT'S TAKEN TO GET THIS PRODUCT TO WORK. I'VE BEEN SHIPPED THE WRONG VERSION AFTER THE FIRST VERSION DIDN'T EVEN MAKE IT PAST INSTALL BECAUSE THERE WAS NO SERIAL NUMBER WITH THE PACKAGING.\r I am very close to disputing this purchase.\r I am frustrated."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "AS1234",
          "Nb_Reviews": 1,
          "Date": "2014-10-27T17:58:38.000Z",
          "Titre": "Mailed item to wrong address and customer service said oh well :(",
          "Contenu": "I have a separate shipping and billing address on Paypal, they shipped to my billing address.  When I called customer service, they claimed it was correct.  Double checked with Paypal, not to mention received about a dozen other Paypal items prior few weeks and nothing was changed.  Customer service pretty told me I was on my own to get the item to me.  Game was cheap, but now I'm out the game and my money.  No good :("
        },
        {
          "Note": 1,
          "Lieu": "IS",
          "Pseudo": "Cheryl Pimental",
          "Nb_Reviews": 13,
          "Date": "2023-08-19T01:42:35.000Z",
          "Titre": "Reseller could give more warnings and more help",
          "Contenu": "This is a software reseller.  They offer NO support.  You MUST go to the company whose software you bought to get any support.  There's a link telling you to check for key details.  I didn't see that.  I bought the software because I only planned to use it once so I bought Corel Paintbrush X9.  It's ONLY compatible with Windows 7 and 8.  Other companies have that in the body of the description or, better yet, in the NAME of the title \"Paintbrush Pro x9 for Windows 7 and 8 ONLY.  I spent FIVE hours trying to find help.  I finally found Corel's number and have started getting help.  She told me how to find the download that came with the link.  There's NO instructions in the email.  It was in a tiny box in the upper right corner of my search page.  It didn't work.  Again, my problem for not reading the \"key \" page that is mentioned in the link.  Go directly to the seller.  Any company that doesn't highlight their warnings isn't a company I want to do business with.  I have actually had POP UP PAGES that said\"  Are you sure your computer is compatible with this (old) software?  That type of warning  is too hard to miss.  I am also uncomfortable with their refund policy.  I really don't understand it.  To me, it's ambiguous and leans very heavily in their favor.  I know they may have people who take advantage when they have no problem, but an honest mistake should qualify for a refund.  It appears the onus is on the buyer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kristen Rebert",
          "Nb_Reviews": 1,
          "Date": "2013-12-01T05:13:17.000Z",
          "Titre": "Never got my download",
          "Contenu": "I purchased my product tried to download it and my computer exited out of the program and started having issues the download was no longer available to me and when I tried redownloading it Microsoft told me it was an invalid account number. Total waste of money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anne",
          "Nb_Reviews": 1,
          "Date": "2015-12-09T22:36:07.772Z",
          "Titre": "They don't play fair.",
          "Contenu": "I ordered in good faith $300 worth of software on or about 11/25/15.  According to the website there was one copy available of what I ordered.  I received confirmation of that order.  The next thing I know I received an email that the item was out of stock.  Tough luck.  So I went on the website and searched again for the item, and lo and behold, there it is for $999 !!!\rJust looked now (12/9/15) and it's still for sale.  They should have accepted my order when they had it instead of getting greedy...\rNot at all happy with them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Milford Prater",
          "Nb_Reviews": 1,
          "Date": "2022-09-24T04:54:01.000Z",
          "Titre": "I purchased from Software CW",
          "Contenu": "I purchased from Software CW .  Architect program, that was three days ago and still don't have program"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2017-01-31T22:44:28.000Z",
          "Titre": "Wrong tax year",
          "Contenu": "I thought I was ordering TurboTax for 2016 when in fact it was 2015. I did not notice it in your confirmation.My bad."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shaun Johnson",
          "Nb_Reviews": 1,
          "Date": "2017-01-06T03:41:45.000Z",
          "Titre": "Terrible Online Order Experience",
          "Contenu": "This was probably the most frustrating online purchase I've attempted in over 20 years on the web in transactions numbering in the hundreds. At the conclusion of numerous failed attempts to complete a simple order I got a message from Google saying they were interested in feedback regarding my purchase with Software CW.  However it's taken over two weeks for Google to give me this opportunity, and I no longer recall the specifics regarding at least 8 failed attempts to make a simple one item purchase. I was required to completely re-enter all or most of the order and personal info after every failed attempt with no indication from the system as to which items it found objectionable. Based on my experience, the Software CW order application is completely broken. I emphatically recommend that Google do not  endorse Software CW until they fix their unacceptably buggy and completely user unfriendly online order system."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scott Monroe",
          "Nb_Reviews": 5,
          "Date": "2017-04-12T19:47:09.000Z",
          "Titre": "I ordered and purchase TurboTax Home …",
          "Contenu": "I ordered and purchase TurboTax Home and Business for the year 2015 and sent me 2012"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jephunneh Mecate",
          "Nb_Reviews": 1,
          "Date": "2017-03-09T09:41:59.000Z",
          "Titre": "Internet Purchase Experience",
          "Contenu": "Ordered an item from the website, and hours later, I was told that they no longer had the item on-hand."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jerry",
          "Nb_Reviews": 1,
          "Date": "2014-01-15T18:22:36.000Z",
          "Titre": "selling a product that doesnt work  it just wont download",
          "Contenu": "stay away from this product.  can't download  might as well throw away two hundred dollars"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark R.",
          "Nb_Reviews": 1,
          "Date": "2014-11-06T18:09:04.000Z",
          "Titre": "I NEVER GOT MY SOFTWARE!",
          "Contenu": "Any chance I could ACTUALLY get what I paid for?  Please advise."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eugene Holland",
          "Nb_Reviews": 1,
          "Date": "2014-09-01T01:50:07.000Z",
          "Titre": "We were so slow that, I had given up on my order",
          "Contenu": "After i place the order, it took 3 to 4 weeks to my order."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Cunningham",
          "Nb_Reviews": 1,
          "Date": "2016-08-17T00:17:20.000Z",
          "Titre": "Wrong order",
          "Contenu": "I received 2012 turbo tax and I  ordered 2015"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Charles Kessler",
          "Nb_Reviews": 1,
          "Date": "2016-12-10T01:33:40.000Z",
          "Titre": "I paid for next day shipping but received my software three days later.",
          "Contenu": "Liars, liars,liars"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Abbas Taghavi",
          "Nb_Reviews": 2,
          "Date": "2023-01-30T17:34:06.000Z",
          "Titre": "I do not like to give more information…",
          "Contenu": "I do not like to give more information abut to purchase of this software, why you asking so much question."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Derrick Miller",
          "Nb_Reviews": 2,
          "Date": "2022-12-27T10:05:49.000Z",
          "Titre": "Buying Digital Software",
          "Contenu": "My major complaints is are that I couldn't use a Visa Gift Card, to pay part of the bill.  I had to use my personal debit card to pay for it all.  I couldnt tell when I had paid for it because the next window says Buy Now, and for a more expensive price.  The previous review is no longer effective.  I have had nothing but PROBLEMS TRYING TO BUY, AND DOWNLOAD THIS SOFTWARE PROGRAM.  Now I have to wait another 6 hours, until customer support opens to get help.  I've purchased and used this program before.  About 7 years ago, and I LOVED IT.  The difference is that then, I bought the physical disc and installed it myself.  This time I'm getting the digital copy, and it's a major pain in the butt.  I will never do this again!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David Winialski",
          "Nb_Reviews": 1,
          "Date": "2017-07-27T14:23:13.000Z",
          "Titre": "Product sent was literally covered in dirt",
          "Contenu": "Product I received was covered with dried mud; as if they dropped it in a mud puddle and let it dry before sending it.I suspect they get their merchandise from distributors that are dumping stuff they cannot sell and SCW just turns around and sells it to unsuspecting customers.  Will NEVER purchase from them again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Charles",
          "Nb_Reviews": 1,
          "Date": "2013-12-03T00:31:02.000Z",
          "Titre": "good program with bad support",
          "Contenu": "The program saves a great deal of time and really worked better than expected.  Once I understood that I had to disable the virus protection, it worked very well.\r The technical service is the worst that I have ever known.  They are too busy trying to sell some program to fix some non existent problem on your computer to help with the program that you have already bought."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Katie Strauss",
          "Nb_Reviews": 1,
          "Date": "2017-01-04T19:19:25.000Z",
          "Titre": "Their mistake, my problem",
          "Contenu": "I recently ordered Smith Micro Clip Studio Paint EX from SoftwareCW through one of several retail marketplaces they use as auxiliary vendors for their merchandise. I did not know them as a company but knew the reputation of these marketplaces to be sound so I took a chance. The program was listed at a fantastic price, and there was a countdown for how long the deal would last. I ordered it. I even signed up for the free purchase protection from Google because this was a Google Trusted Store. That is the level of faith I thought I could have in them.This purchase was a Christmas present for my partner. It's not SoftwareCW's fault that we're struggling students, I get that. But I bought a product at the advertised price from a company.I received Clip Studio Paint Pro. The Pro version lacks several key features of EX. I figured it was a mistake in shipping, every order confirmation I received indicated that I had purchased EX. In my package there was a paper slip directing me to address any issues with my order by contacting the SoftwareCW support team. I emailed them requesting a return label and the product I purchased. Credit where credit is due, the response time was excellent. The response, however, left a bad taste in my mouth.\"SoftwareCW Customer Support (SoftwareCW Customer Support)Dec 29, 11:56 AM CSTHi, please find attached a return label for you to use to return the software. You will be refunded in full once the item is received. I am very sorry for the inconvenience, the [marketplace] product page is mislisted and should have said Pro, not EX.If you have any other questions, please let me know!Regards,SoftwareCW Customer Support\"The problem I have here is that this was the advertised price. This was the price listed for the marketplace I shopped through and it was initially provided as a link it through Google's shop feature. I honestly believed I could have faith in this purchase. This was their listing error.  I don't want a refund, I want the product I ordered. I worked extra shifts to have Christmas money and I could afford the price I paid. I might even have been able to afford more, before I finished allocating Christmas money, but having made a purchase in good faith from a seemingly reputable company I didn't save extra for them to tell me I have to pay for their mistake. My partner's excitement has become significant disappointment and I had to figure out what to do. This wasn't just a Christmas present, it was also something he needs for school. We can't have no software, so their offer of a refund is something I can't take. I just now have software that I will have to replace later instead of software that will last him throughout his classes as I intended.I expect better from retail companies. I expect companies to pay for their own mistakes and then fix them, not pass that burden on to their consumers. My living situation might not be their fault, but it's not an uncommon one for their prospective clientele. I know that I won't be recommending them to anyone I know."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Nancy",
          "Nb_Reviews": 1,
          "Date": "2013-10-09T05:46:59.000Z",
          "Titre": "no product",
          "Contenu": "I have read to receive the Quicken program I ordered"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Olga Garcia",
          "Nb_Reviews": 1,
          "Date": "2012-07-04T17:53:33.000Z",
          "Titre": "I got the wrong software, tell me how I can change for the version that include IDVD",
          "Contenu": "i orden the iLife version that include iDVD, if I have to pay more, let me know."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert 89",
          "Nb_Reviews": 3,
          "Date": "2023-07-31T21:32:02.000Z",
          "Titre": "Softwar Delivery",
          "Contenu": "I guess it is as much fault mine as it is ZSoftwareCW's. I stll can't get used to software delivery by email and still like to see a CD in a box with a mahual. By the time I noticed SoftwareCW;s email the link to the software had expired. Well they sure are not the easiest people to get hold of and thought the charge is on my card I do not have the software, So maybe they will read this.Robert"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James Markley",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T22:57:47.000Z",
          "Titre": "I guess it's my fault I wanted to get…",
          "Contenu": "I guess it's my fault I wanted to get the one that came with the templates and got the one that looks almost like word perfect,!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "from AngryTech",
          "Nb_Reviews": 1,
          "Date": "2012-10-30T13:49:13.000Z",
          "Titre": "Where is my Software?!?",
          "Contenu": "I received the email with the links to download and see the invoice, but none of them worked! The company's Domain is down! Contact attempts via email (the only contact information available) have been unsuccessful.\r Ultimately I was able to locate a phone number through Trust Pilot, and left a Voicemail which was responded to via email containing the download link and product key I needed. My issue was resolved, but I would not exactly call it a timely manner."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Henry Mulnik",
          "Nb_Reviews": 1,
          "Date": "2023-01-26T02:17:12.000Z",
          "Titre": "Did not like paying extra for software…",
          "Contenu": "Did not like paying extra for software protection.  I don't like giving you so much information.  I reaaly would like a DVD that I can download for life, since that is what I am paying for."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shirley",
          "Nb_Reviews": 1,
          "Date": "2013-07-02T19:44:45.000Z",
          "Titre": "Speedy Service",
          "Contenu": "Service was speedy.  However, the entire transaction would have been much smoother if the merchandise were described in detail such as with what systems the software could be used."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2013-08-02T15:55:50.000Z",
          "Titre": "Customer service was less than what I expected considering the ratings online",
          "Contenu": "Software trial period had expired when purchased so I could not use the software right away.  I had to request the key code after waiting for e-mail for two days."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Troy",
          "Nb_Reviews": 1,
          "Date": "2014-01-26T23:21:29.000Z",
          "Titre": "First time purchaser, have not decided to use again or not.",
          "Contenu": "The purchasing of the product on the website was straight forward, the time delay from purchase to receiving the product was long.  I purchased a Microsoft Office product and would have preferred to complete the purchase process at one time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Roy Leggitt",
          "Nb_Reviews": 1,
          "Date": "2017-01-23T14:47:15.000Z",
          "Titre": "Wrong Version",
          "Contenu": "I searched for 2016 Turbo Tax and inadvertently ordered the 2015 version."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark Rooney",
          "Nb_Reviews": 1,
          "Date": "2023-03-08T17:35:23.000Z",
          "Titre": "03/08/2023 Can't find file",
          "Contenu": "Don't know because I can't find file,"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Joyce Brooks-Krushelinski",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T01:13:25.000Z",
          "Titre": "The service was great",
          "Contenu": "The service was great. Unfortunately the software would not download on my computer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Craig A",
          "Nb_Reviews": 1,
          "Date": "2012-08-03T02:13:12.000Z",
          "Titre": "Great prices on older software releases",
          "Contenu": "Could use a little more communication, and the software I ordered arrived a little later than I was expecting, but it did arrive and was exactly what I was looking for.  If you're in a hurry you may want to pay more elsewhere, but if you don't mind waiting an extra week or so this is a great place to get your software.  I would have liked to get an e-mail saying that there was a delay, but in my case it didn't cause any problems."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joseph",
          "Nb_Reviews": 1,
          "Date": "2013-07-20T13:30:24.000Z",
          "Titre": "Did what they said, plus they use paypal",
          "Contenu": "So not much to say, Everything worked as it was supposed to. I did a digital purchase so I can't speak on their delivery service, but everything did work without a hitch.\r I tip my hat to the company for allowing the option to pay via paypal. It is really welcoming not having to give out your credit card number to every store from which you buy from. this was the main reason why I chose this service over places like amazon.\r The only con that I have is that the don't tell you in your that you have to wait up to a day for your transaction to go through to recieve your product key. I immediately thought I just was scammed, until I looked at their FAQ.\r Overall relatively paid free experience"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dalton",
          "Nb_Reviews": 2,
          "Date": "2013-08-14T15:22:20.000Z",
          "Titre": "Great price and professional service",
          "Contenu": "I purchased a digital download version of software and was given a link to download the software. However, the original download link didn't work. I emailed customer service and within an hour I had a new working link.\r I would have no reservations buying from this company again. Although the broken download link made me a bit nervous to start with, it was quickly and professionally resolved."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matthew Bettwy",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T17:29:04.000Z",
          "Titre": "Hi   I am wondering if there is a Quick…",
          "Contenu": "Hi   I am wondering if there is a Quick way to DRAG the drawing on the screen. Im very ust Autocad 2023 and it allows me with a right click and hold.  I may be overlooking something. But other than that i am pretty happy with the software. Heck back in the 90s i used  Tirbocad. Ty for your help"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "EC",
          "Nb_Reviews": 2,
          "Date": "2016-02-22T23:16:33.210Z",
          "Titre": "Very good, not perfect",
          "Contenu": "Purchase experience was great.  Great price, software was as described.  Had a slight issue with delivery.  There was a two day delay in shipping the product initially.  When I requested, they immediately refunded the expedited shipment fee (for  USPS express delivery) that I paid."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "daches",
          "Nb_Reviews": 1,
          "Date": "2012-09-19T16:28:34.000Z",
          "Titre": "Wrong Product Key",
          "Contenu": "Everything went smoothly with the purchase and download, but when I tried to activate the product I kept getting an error message that the key was invalid.\r The problem was quickly resolved with online support -- apparently the key was mistyped when it was sent."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 3,
          "Date": "2017-01-31T20:02:13.000Z",
          "Titre": "Be careful!",
          "Contenu": "I ordered TurboTax on physical disk at a very good price. The merchandise was delivered promptly. Unfortunately, I didn't notice until after the package was opened that it was the previous year's product. I went back to the order page, and only then did I really notice it said 2015 in the description instead of the 2016 product I wanted. It was my error; I should have read (and thought about) the description more carefully. In my defense, tax prep is always for the previous calendar year, and I probably thought \"2016, so 2015 is right\", and kept going. Since the package was opened, it's non-returnable and I'm just writing it off to experience. A prominent banner stating \"PREVIOUS YEARS\" or something like that, making it more obvious, would have been appreciated, though.They quickly delivered exactly what I ordered. Just make sure you're ordering what you really want!"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Claire M.",
          "Nb_Reviews": 3,
          "Date": "2017-05-30T01:22:31.000Z",
          "Titre": "Came on time and as exactly how it was described",
          "Contenu": "My Microsoft Office Home and Business 2013 came on time and as exactly how it was described. I like the product overview information as it was detailed and organized and made it easy for me to confirm that my computer specs meet the software requirement."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shanna",
          "Nb_Reviews": 3,
          "Date": "2014-01-13T20:01:31.000Z",
          "Titre": "Great service!",
          "Contenu": "I had a great experience and wanted to order more software but you were down this last weekend.  Bummer!  I had to go to a different supplier.\rI'll be back if your still up."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anthony Richardson",
          "Nb_Reviews": 1,
          "Date": "2012-09-19T13:38:50.000Z",
          "Titre": "99.9% - One, quickly rectified, problem. Otherwise - Perfect!",
          "Contenu": "The key didn't work. I bought the MS Office Pro package at night, so no one was in the office. I downloaded the software, received the key and *crunch*; the key didn't work. Aw, man! I was ready to rock and roll. I left an email with them and the next morning at opening time before I could get the follow up started, I had a replacement key that worked fine, and a note of apology just that fast! Kudos to the sales team!\rThe bad key is the only reason for not quite getting that 5th star."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Derek Schroeder",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T15:18:03.000Z",
          "Titre": "Good customer service",
          "Contenu": "Resolved my installation/membership problem quickly. Can’t wait to use it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "trustpilot123456!",
          "Nb_Reviews": 1,
          "Date": "2014-01-30T02:07:52.000Z",
          "Titre": "Purchased from SoftwareCW several times and only once has been problematic. (5 of 6 Office 2010 Product Keys were already activated--unusable)",
          "Contenu": "Let's get the bad part out of the way. In December 2013, I purchased six copies of Office 2010. Five (5) of the six (6) product keys would not work. I received an \"already activated\" error when using them.\r The first product key worked, the remaining 5 did not. When I tried to use the 2nd product key a month after purchase, I notified SoftwareCW of the problem and they got back to me with a new product key 2 days later. I only allocate one Office license every few weeks, so I did not know anything was wrong until a month after purchase. So far, SoftwareCW has issued me one (1) new product key.\r Now, it's near the end of January 2014 and I just noticed that the remaining 4 unused product keys were invalid (i.e., got the already activated message after installation). I trust SoftwareCW will provide me with 4 unused product keys, but we shall see.\r Over the past year, I have purchased operating systems, database software and a few other miscellaneous software packages from them and have not had an issue with those purchases. Overall the experience has been okay.\r So far, they have been trustworthy and have responded within 1 or 2 days to inquiries.\r Here are some additional thoughts...\rSoftwareCW often appears to be the price leader for big-name software.\rAll questions, comments and problems must be communicated via e-mail.\rThey do have a toll-free number (888-973-0315), but it immediately goes to voice mail with a recorded message saying that they do not offer support via the telephone.\rThey are slow-to-respond compared with the big-name online stores like NewEgg and Amazon."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2013-10-24T15:38:12.000Z",
          "Titre": "easy way to get good software",
          "Contenu": "i have purchased several software items (all Adobe) and they have installed and worked well.  the only issue was that Premiere Pro only worked with DV and not HD.  i found this out after the purchase.  However, since most of my work is DV it has worked out."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Geoffrey",
          "Nb_Reviews": 2,
          "Date": "2023-08-05T08:53:03.000Z",
          "Titre": "Fine Under Pressure",
          "Contenu": "I've been looking for a quality software that would allow me to make cards, posters, banners, etc. I was in a real pinch. I'd purchased a program that I thought was for the Mac but, come to find out, it was for a PC. My aunt had passed away and I was making a program for her service. I researched different software that day and ended up choosing the Hallmark one. The price was right, and so was the program. Everything has a learning curve and this was no exception. I chose to make a card as it would give me four pages to type on. The first, her picture, date of birth, death and a nice verse. The second  page, a poem, third page the order of service and the fourth page, the eulogy. During the time that I was working on it, I became very frustrated. Looking back now, I realize it was because I was in a bind to get it done that night so that I could send it to my cousin in Oklahoma and I was exhausted.  I was able to put it together exactly how I wanted it. I'd like to see much more clipart but I haven't had the time to play with it again to look and see if I just missed it. I ended up going online and downloaded what I needed. After I chose the font I wanted, I tried to print it and ended up with what looked like hieroglyphics.  i ended up having to use the basic Times Roman. It looked fine, just not what I wanted. I still need to go back and research what happened and why. My cousins were delighted with the program and I was pleased that it has a low learning curve and I picked up on how to use it quickly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Terry....BSMS Inc.",
          "Nb_Reviews": 1,
          "Date": "2013-09-26T15:14:05.000Z",
          "Titre": "got what I paid for",
          "Contenu": "No problems. . Delivered on time. They claimed to sell a full version of office for a low price. That's exactly what I got . Cant ask for anything more. I wish all other co. would\rdo the same. Will buy again..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "carlos Curtis",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T22:30:47.000Z",
          "Titre": "It was easy to order but I know I…",
          "Contenu": "It was easy to order but I know I bought this software before, but could not reload it after my laptop died . So I bought it agin. Not happy about that. But the software works as it should"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Katherine",
          "Nb_Reviews": 2,
          "Date": "2023-06-27T23:24:52.000Z",
          "Titre": "Printshop",
          "Contenu": "I bought the new version of Printshop, and it was easy thru Software CW."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Earl Stone",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T20:42:53.000Z",
          "Titre": "It was easy to use and the download was…",
          "Contenu": "It was easy to use and the download was easy. It would be nice to have a CD to refer to if something were to happen to the software."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 7,
          "Date": "2014-01-06T02:14:10.000Z",
          "Titre": "It was my first time experience with SoftwareCW and it will be the first place I go for IT stuff.",
          "Contenu": "I successfully downloaded a Microsoft product and everything ran very well!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 1,
          "Date": "2016-01-18T13:33:51.842Z",
          "Titre": "VB 2013 Disk Version",
          "Contenu": "Product came in a reasonable time and worked (installed) just fine."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Claude Saint-Martin",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T21:23:53.000Z",
          "Titre": "It was straightforward and quick."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "from SoftwareCW",
          "Nb_Reviews": 1,
          "Date": "2012-10-03T02:45:11.000Z",
          "Titre": "Helpful service",
          "Contenu": "I received some guidance and good manners."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lyle L.",
          "Nb_Reviews": 3,
          "Date": "2023-01-26T19:25:37.000Z",
          "Titre": "ALL OF THE INSTRUCTIONS WERE SPELLED…",
          "Contenu": "ALL OF THE INSTRUCTIONS WERE SPELLED OUT STEP BY STEP."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ken",
          "Nb_Reviews": 1,
          "Date": "2012-09-10T15:15:08.000Z",
          "Titre": "Got what I needed and quickly",
          "Contenu": "Ordered software that came quickly with no issues"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alfred Chiaverini",
          "Nb_Reviews": 1,
          "Date": "2023-02-05T20:40:25.000Z",
          "Titre": "easy to understand product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2015-09-02T16:26:19.269Z",
          "Titre": "Windows 7 Home Premium",
          "Contenu": "Very satisfied.  Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T17:09:56.000Z",
          "Titre": "They did their job."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2016-09-19T16:33:23.000Z",
          "Titre": "Good",
          "Contenu": "Good treatment."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-07-04T12:35:37.000Z",
          "Titre": "Practical",
          "Contenu": "Practical; easy software performance; Excellent value"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Duenna Ignacio-Kawanishi",
          "Nb_Reviews": 1,
          "Date": "2017-03-07T15:14:33.000Z",
          "Titre": "Turbo tax 2015",
          "Contenu": "The price was great and was shipped promptly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Maddox",
          "Nb_Reviews": 1,
          "Date": "2023-01-20T12:53:08.000Z",
          "Titre": "Great",
          "Contenu": "Everything was great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Malcolm Sexton",
          "Nb_Reviews": 3,
          "Date": "2023-12-12T22:12:37.000Z",
          "Titre": "Right software. Right price. Great service.",
          "Contenu": "I found exactly the software I was looking for and the price was surprisingly less than I was expecting. Downloaded flawlessly, installed and was ready for work in a matter of minutes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Sanders",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T15:40:24.000Z",
          "Titre": "Turbocad is exactly what I was looking for.",
          "Contenu": "I am very pleased with the TurboCad software. The customer support team has been very responsive also. Installation was easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Beazt Master Solomon labs",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:14:20.000Z",
          "Titre": "Greatly appreciate there customer…",
          "Contenu": "Greatly appreciate there customer support, very fast. They give useful information"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Wheeler",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T15:37:52.000Z",
          "Titre": "My problem was fix in less than a day…",
          "Contenu": "My problem was fix in less than a day when I was provided a new download link."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JLW in WBL",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T02:37:15.000Z",
          "Titre": "Great Experience",
          "Contenu": "Great price.  Easy purchase.  Hassle-free install"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kenn Pizza? Please",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T00:53:37.000Z",
          "Titre": "Not a scam",
          "Contenu": "I had my doubts that this was a legitimate storefront. I received the product license that I purchased and was able to add it to the Microsoft account. Would definitely consider buying for SoftwareCW again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeffd",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T00:20:37.000Z",
          "Titre": "Everything worked exactly as advertised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mr. Roy",
          "Nb_Reviews": 2,
          "Date": "2023-07-26T16:50:53.000Z",
          "Titre": "My laptop crashed",
          "Contenu": "My laptop crashed, right when finis quickly purchased the Microsoft 365 package: Saved my contract, all work perfectly. Thank you!!   The updating 365 software is easy to use, solves the problems: FAST!I highly recommend the Microsoft 365 package, a life saver! The software downloaded easy, no technology required, just download, and done, that easy!i"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brenda Ewin",
          "Nb_Reviews": 2,
          "Date": "2023-07-03T05:26:21.000Z",
          "Titre": "Updating older version",
          "Contenu": "I used the download to correct issues I was having with older version of Print Deluxe I've used for years. The download corrected all issues and is working perfectly once again. I have enjoyed and am still enjoying using Print Deluxe. I have always received praise for the various projects I've produced using this product!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larry Stocks",
          "Nb_Reviews": 3,
          "Date": "2023-07-03T18:30:16.000Z",
          "Titre": "I don't actually use the software my…",
          "Contenu": "I don't actually use the software my self but install it for other users.  The process to purchase and set up the software was easy using this site.  It would be good if the software worked better on Windows 10, I have to run it in compatibility mode which complicates the setup."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phillywolf",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T14:24:59.000Z",
          "Titre": "Because I have a relative who has…",
          "Contenu": "Because I have a relative who has difficulty hearing, so I can't speak with her on the phone. Dragon allows me to let my thoughts flow as though we were speaking directly. Thank You Nuance"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Doug",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T00:58:36.000Z",
          "Titre": "Quick download and the software worked…",
          "Contenu": "Quick download and the software worked perfectly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "The Aviation Planning Group",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T01:07:11.000Z",
          "Titre": "We have been thrilled with our software…",
          "Contenu": "We have been thrilled with our software purchases. Straight forward and easy purchase and download."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "curtis",
          "Nb_Reviews": 1,
          "Date": "2013-05-26T16:58:03.000Z",
          "Titre": "Fast shipping and easy retuen",
          "Contenu": "Ordered streets and trips 2011  would not auto load on windows 8 or XP  tried to use code off internet  to load and just like the disc would get to the end and stop and exit with out down load .Return product foe a full return don't know what the problems were but on the internet with year 2011 there were page after page with same problems."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barry",
          "Nb_Reviews": 5,
          "Date": "2014-01-18T11:15:17.000Z",
          "Titre": "Great Price and excellant service",
          "Contenu": "SoftwareCW had the best price I was able to find while searching online. I ordered the Microsoft Office Pro 2010 - 2PC Download, within 30 minutes I received an email containing the Microsoft product key . Downloaded the software, entered the product key and everything worked perfectly all in less than an hour. I will order again from SoftwareCW when I need additional software."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cory Robare",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T05:24:16.000Z",
          "Titre": "beginning to end",
          "Contenu": "From start start to finish staff was ontop of any questions I had before purchasing the CAD software I settled with which worked best for me and my need and goals. would highly recommend to anyone in the market for a good CAD program thats easy to use with almost seems like endless possibilities"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Satiafied Customer",
          "Nb_Reviews": 2,
          "Date": "2023-10-23T22:24:28.000Z",
          "Titre": "Glad I ran across your website",
          "Contenu": "Glad I ran across your website.  I was able to renew my subscprtion for 3 devices of Malwarebytes 4.5 Premium for less than the list price from their website for 1 device.    Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sharon",
          "Nb_Reviews": 1,
          "Date": "2014-08-25T17:04:40.000Z",
          "Titre": "Thank you for not being a scam",
          "Contenu": "I almost bought Office software from other online sources but saw reviews online that some were scams. Folks had been sent keys that had already been used from those other companies. Software CW had good reviews and did not disappoint. The software was cheaper than retail prices and works great. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen H.",
          "Nb_Reviews": 1,
          "Date": "2012-09-09T23:22:12.000Z",
          "Titre": "Straightforward and",
          "Contenu": "They had the best price and ordering online was easy. The package arrived earlier than promised (with free delivery option) and was exactly what I wanted and ordered.\rSince everything went smoothly, I didn't need to contact customer service so I have no opinion about that at this time.\rBased on this experience, I would definitely use SoftwareCW again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 2,
          "Date": "2014-01-08T23:29:29.000Z",
          "Titre": "Outstanding service and easy to compleat download and install.",
          "Contenu": "I ordered Microsoft Office from SoftwareCW  because all the reviews I could find were high marks. I had just had an experience with software I bought from Ebay was counterfeit. I needed a legal copy of office, and  SoftwareCW had a good rating with the Better Business Bureau. Also it cost less than than the bootleg copy from Ebay."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Smellie",
          "Nb_Reviews": 1,
          "Date": "2012-08-27T04:08:37.000Z",
          "Titre": "Good Job!",
          "Contenu": "I experienced good pre-sale support.  I asked one question about the software by e-mail and it was answered in much less than a day, even though it was a weekend.  The order was accurately filled, quickly shipped, well-packed and arrived on time and in good condition.  The software was as-described and installed without a problem.  That's all you can ask for.  There were no problems with the order so I don't have anything to say about post-sale support."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "EvaL",
          "Nb_Reviews": 1,
          "Date": "2014-01-01T17:52:15.000Z",
          "Titre": "Best Price, Great Service",
          "Contenu": "I needed a few more copies of Office 2010 for various work and home machines.  SoftwareCW had the best price, significantly lower than other suppliers. And when I had a question for their Support team, I got an answer within the same work day. Wow! I'd go back to SoftwareCW for any of my future software needs. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike De",
          "Nb_Reviews": 3,
          "Date": "2016-09-19T02:22:28.000Z",
          "Titre": "Yes, I will buy from SoftwwareCW again!!!!!!",
          "Contenu": "Perfect condition, brand new, factory sealed Quickbooks 2015 Software.I verified it's authenticity with Intuit and I was give a Validation Code.Very fast 2 day shipping.No problems, no issues.   I will buy again!!!!!!!Thank You,"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "from SoftwareCW",
          "Nb_Reviews": 1,
          "Date": "2012-07-25T13:59:58.000Z",
          "Titre": "Want MS Office Home & Business 2010? Get it here!",
          "Contenu": "I received Microsoft Office Home & Business 2010 as ordered. Shipping was very fast - it arrived before the computer I purchased it for! \r It installed just as easily; we're very happy with our purchase - great software at an amazing price. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RYD Cocoa Beach",
          "Nb_Reviews": 1,
          "Date": "2015-08-10T15:59:48.870Z",
          "Titre": "It was such a great deal I wondered if it was a scam!!",
          "Contenu": "I wanted a screenplay software that was too expensive even when on sale.  I found SofwareCW.com and found it for half the price.   I've been scammed before by fake software downloads, but read the entire website and finally decided to go for it.  It is a real site with real software, and the software download was perfect--not just FAST, it was literally IMMEDIATELY!   I thank you for a great place to find software I need that I can afford."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carolyn Lassiter",
          "Nb_Reviews": 2,
          "Date": "2013-11-19T03:51:31.000Z",
          "Titre": "I downloaded my product on 10-25-13 and the product key was emailed soon after.",
          "Contenu": "When I downloaded the item I purchased, I thought  the download information stated the product key would be mailed to my house as soon as the background check had been downloaded but have since learned it was only emailed.  I will definitely order from Softwarecw in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Craig Hunter",
          "Nb_Reviews": 1,
          "Date": "2022-12-22T06:28:53.000Z",
          "Titre": "I never heard of SoftwareCW",
          "Contenu": "I never heard of SoftwareCW but checked around and found they were a reliable company.  I did have problems with downloading the program but one of their Techs sent me a link to where a download was and now everything is working great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer Phyllis Dendy",
          "Nb_Reviews": 1,
          "Date": "2016-04-11T07:17:27.000Z",
          "Titre": "My mistake not your's!!",
          "Contenu": "I was looking for tax software, found your site, made a purchase quickly & just as the purchase screen exited my view I noticed it said the year I had purchased was the wrong year for the taxes I wanted to do.  I sent an email to the company explaining all this and incredibly they quickly refunded the purchase money back to my account and I did appreciate that as it allowed me to then purchase the software I needed.  Great bunch of people & obviously square shooters too!!  Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shlomi U",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T16:06:37.000Z",
          "Titre": "Order was fast and received the item I…",
          "Contenu": "Order was fast and received the item I bought. Honestly, couldn't be happier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terry",
          "Nb_Reviews": 1,
          "Date": "2014-01-02T14:31:12.000Z",
          "Titre": "Fast assistance, product as described",
          "Contenu": "I was wary of ordering software online as it appears pirated software can be purchased unbeknownst to the buyer, and I wanted to make sure I received an original license-able product.  I went with Software CW after reading their reviews and have not had any trouble. Software CW quickly answered my questions"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill Roberts",
          "Nb_Reviews": 1,
          "Date": "2014-11-23T14:58:34.000Z",
          "Titre": "Fast service - great price!",
          "Contenu": "Bought PowerPoint 2010 home edition, 3-user license.  The price was actually cheaper than a single user business version.  I received the package in just a few days and am happy with both the service from SoftwareCW and the Microsoft product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Herb",
          "Nb_Reviews": 2,
          "Date": "2013-12-04T14:07:47.000Z",
          "Titre": "I was initially concerned due to the low price, but everything was perfect!",
          "Contenu": "Lets face it, we are all looking for a bargain when we shop. Because the price was so low on the MS Office 2012 Home & Business, I figured there would be some glitch. I received the license key quickly, activated the software and Microsoft validated it. thanks for the bargain!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda K.",
          "Nb_Reviews": 2,
          "Date": "2015-04-22T17:24:47.000Z",
          "Titre": "Great Service!",
          "Contenu": "I was looking for a software program for my home laptop computer that I also use at my office.  I found it at SoftwareCW.  Great service, I placed my order and because I wanted it within a couple of days, I choose 2nd Day Delivery.  It came right on time with no problems.  I had it installed on my computer and it is great.\rI would check with SoftwareCW first before looking anywhere else for my software purchases."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chian Nelson",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T00:29:49.000Z",
          "Titre": "Bought software from this company and…",
          "Contenu": "Bought software from this company and the transaction was smooth! Everything went great, will definitely be making another purchase next time I need something!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robin from SoftwareCW",
          "Nb_Reviews": 1,
          "Date": "2012-07-28T19:02:45.000Z",
          "Titre": "Great price, free super fast shipping - would shop here again!",
          "Contenu": "We wanted a previous version of a popular software package and found it at a great price at SoftwareCW.  The shipping was free and it arrived even earlier than we expected.  Would definitely shop at SCW again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Craig",
          "Nb_Reviews": 1,
          "Date": "2013-08-16T12:51:12.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "After I received my order, there was an email explaining a change they had to make (in my favor).  I had a couple questions which were quickly answered.  This was my first time purchasing from SoftwareCW and I am very willing to continue buying from them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2016-04-26T13:58:03.000Z",
          "Titre": "Quality product and discription.",
          "Contenu": "Software was exactly as described and works great.  I think thI customer needs to be smart enough to figure out what they need and what will work with their setup.  It wasn't easy to get my purchase to work.  However, I believe that the company and product were of high quality, quickly delivered, priced fairly, and described very well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeffrey C. Lancaster",
          "Nb_Reviews": 1,
          "Date": "2014-09-04T23:26:58.000Z",
          "Titre": "My first purchase with SoftwareCW and no problems!",
          "Contenu": "Since this was my very first purchase I do not have a lot to say.\rJust glad that it turned out to be easy, accurate and problem free!\rWhether or not I will ever make another purchase with SoftwareCW \rdepends on their having products in which I am interested in buying."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CRobert Zepedaustomer",
          "Nb_Reviews": 1,
          "Date": "2013-07-24T14:09:03.000Z",
          "Titre": "Received software as advertised and on time.",
          "Contenu": "I was happy with my purchase.  I bought Microsoft Office for Mac, received it on time and had no trouble installing it.  Though I haven't used all the applications yet, they all seem to be functioning effectively.  This is my first purchase from CW, and based on this single experience, I give them full points!  Thanks, CW."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 1,
          "Date": "2013-05-21T21:05:16.000Z",
          "Titre": "Great price. No shipping charge. Fast delivery.",
          "Contenu": "I have recommended this site to friends. First time doing business with SoftwareCW so a little concerned but everything went perfectly.  Lowest price by a lot for my purchase.  They will be my go to site for all software purchases."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debra",
          "Nb_Reviews": 1,
          "Date": "2016-07-01T17:36:12.000Z",
          "Titre": "TurboTax CD",
          "Contenu": "Best price of anywhere I looked. Was new in original packaging as advertised. Shipped and delivered faster than I expected at no additional charge. Would definitely buy again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "VicGodfrey",
          "Nb_Reviews": 1,
          "Date": "2015-11-18T00:40:27.127Z",
          "Titre": "Norton 'Security' . . .",
          "Contenu": "Was directed to your website through a Google search and ordered the Norton 'Security' program.  Product was delivered promptly and in good order.  Would definitely purchase from Sofvtware CW again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gayleen Wilde",
          "Nb_Reviews": 3,
          "Date": "2023-07-26T14:59:39.000Z",
          "Titre": "I have never been a fan of Adobe so…",
          "Contenu": "I have never been a fan of Adobe so when I was introduced to Nuance which has now changed to Kofax I will never go back to inferior PDF programs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 4,
          "Date": "2013-12-03T13:49:37.000Z",
          "Titre": "Excellent price and service.",
          "Contenu": "I was concerned purchasing software from a company I had never heard of at a price that seemed a bit \"too good.\" However - this was an excellent transaction with no issues whatsoever. Software CW gets my highest recommendation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jage",
          "Nb_Reviews": 3,
          "Date": "2012-09-24T20:57:55.000Z",
          "Titre": "Transaction was fast, with no surprises",
          "Contenu": "This was my first OEM software purchase, and it went like a charm. I didn't need all the bells and whistles of Acrobat X, so bought the OEM version of Acrobat 9 at one third the price. It installed normally, was registered easily, and has been updated twice. I'm a happy camper!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill Groves",
          "Nb_Reviews": 2,
          "Date": "2023-09-12T21:45:05.000Z",
          "Titre": "Works perfectly",
          "Contenu": "I have looked for this download for a long time and am grateful to have found it.   It downloaded easily and has worked perfectly ever since.  No glitches or problems."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill Groves",
          "Nb_Reviews": 2,
          "Date": "2023-09-07T19:03:04.000Z",
          "Titre": "Everything went perfectly..",
          "Contenu": "Everything went perfectly... the purchase, the download, and the program has functioned flawlessly ever since."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Len from NYC",
          "Nb_Reviews": 2,
          "Date": "2012-09-24T17:09:27.000Z",
          "Titre": "Easy transaction and great price.",
          "Contenu": "I purchased a downloadable copy of MS Office 2010 Pro. I was immediately able to d/l the software after paying. The price was almost $20 less than the closest competitor."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Norm",
          "Nb_Reviews": 2,
          "Date": "2013-10-13T08:33:06.000Z",
          "Titre": "Exactly what I ordered.",
          "Contenu": "Software came within the specified time.  Perfect condition, no problems.  Installed and working just fine.  What can I say?  It's doing what it's supposed to.  Good price too!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "L. Will",
          "Nb_Reviews": 2,
          "Date": "2017-02-05T13:21:09.000Z",
          "Titre": "Excellent Customer Service",
          "Contenu": "Unfortunately I ordered the wrong product but the return process was easy, hassle free and fast. Original delivery was quick. Will definitely use for future software needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brad",
          "Nb_Reviews": 1,
          "Date": "2012-09-18T03:16:52.000Z",
          "Titre": "Great price and service",
          "Contenu": "I purchased software at a very good price.  At first I had trouble activating it on one of my computers, but then in a quick reply from customer service the issue was resolved."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jane F Miller",
          "Nb_Reviews": 1,
          "Date": "2014-11-06T01:22:11.000Z",
          "Titre": "I had a good experience from the ordering through the shipping.",
          "Contenu": "My laptop was in for repairs with HP.  There was a possibility that the techs might have to replace the hard drive.  I didn't have the disk for Quicken so I felt it was prudent to buy it.  HP did not erase my programs so I have merely looked inside your packaging.  I feel this was a good decision in case I might need to reload Quicken in some future time.  The price was right too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeffrey",
          "Nb_Reviews": 2,
          "Date": "2013-10-07T14:48:29.000Z",
          "Titre": "Exactly as promised and quickly delivered",
          "Contenu": "I ordered software from SoftwareCW.  It was delivered quickly and was exactly what I expected to be getting.  The price was the lowest I found on the internet from a reputable seller!  Perfect transaction!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2013-02-11T18:59:53.000Z",
          "Titre": "What a great company.",
          "Contenu": "I ordered a product and  had some problems with delivery but SoftwareCW took care of it immediately.  Order from this company with no reservations..   Thank you so much"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 1,
          "Date": "2013-09-03T20:24:52.000Z",
          "Titre": "Fantastic",
          "Contenu": "i was looking for Adobe Creative Suite and some of the places were wanting 1200-1300 for it, which my boss would not sign off on. however after looking at softwareCW.com, i showed the price to my boss who signed off.  it was a rather lengthy download process, but it was worth it.  the product key was emailed an hour after it was purchased, which made installing it on my users computer even more effective.  Thanks Guys."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ginger L",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T13:58:39.000Z",
          "Titre": "Microsoft Windows licenses",
          "Contenu": "Software CW was excellent to work with, very responsive and reliable.  I highly recommend them."
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Paul Boswood",
          "Nb_Reviews": 3,
          "Date": "2014-10-02T16:33:58.000Z",
          "Titre": "Would certainly buy from the company again",
          "Contenu": "Smooth purchase on the web site.\r Timely emails once purchase had been processed and when dispatched for delivery.\r Item delivered as expected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 1,
          "Date": "2014-01-20T14:21:17.000Z",
          "Titre": "Delivered as Promised",
          "Contenu": "Purchased Office 2010 Suite license for two computers.  Software CW had the best price I could find on the web, and they delivered a quality product as promised."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "James Gilbert",
          "Nb_Reviews": 2,
          "Date": "2017-03-16T06:56:24.000Z",
          "Titre": "Excellent service",
          "Contenu": "This company were responsive, offered fantastic pricing, and delivered faster than expected to the other side of the world. Wow team.Well done."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark I",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T11:56:40.000Z",
          "Titre": "Aggressive support and Quality Products",
          "Contenu": "I purchased a product that didn't meet the expectations nor did my system meet the necessary requirements though my system was actually in alignment with the system requirements listed on the site.I reached out to support immediately and expressed my concerns and was given a very reasonable and acceptable resolution without any hassle.I was very pleased with both the aggressiveness of support to professionally address the problem, the no hassle attitude and their response.Would definitely do business with them again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "from SoftwareCW",
          "Nb_Reviews": 1,
          "Date": "2012-08-12T00:55:54.000Z",
          "Titre": "Very pleased with this purchase",
          "Contenu": "They offered a very competitive price for the software I needed. And when I had a problem with the website during the time of the purchase, they returned my call immediately and were very nice and helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Norman",
          "Nb_Reviews": 1,
          "Date": "2014-01-10T16:18:59.000Z",
          "Titre": "Great Prices and Good Service",
          "Contenu": "Thank you for your site that provides customers a quality product at a reasonable price.  In addition, I used your customer support with great success."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edna Oeltjen",
          "Nb_Reviews": 4,
          "Date": "2023-07-01T05:50:45.000Z",
          "Titre": "I think it is a very helpful program",
          "Contenu": "I think it is a very helpful program, we do our return labels, and cover letters with your program, and love it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patrick",
          "Nb_Reviews": 1,
          "Date": "2013-12-03T00:40:38.000Z",
          "Titre": "Excellent Pricing",
          "Contenu": "No surprises, just excellent pricing and even better customer support. Took a look at MS Office 360 after ordering, did'nt like it, cancelled the that order and reordered MS Office 2010. No hassel service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TYSAN",
          "Nb_Reviews": 1,
          "Date": "2013-11-26T19:34:48.000Z",
          "Titre": "Thumbs up; rapid order execution/delivery",
          "Contenu": "This is a great vendor for software.  Order handled well/shipping very quick/delivery  within 2 days to CA.  Overall great online software vendor."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2015-10-07T21:29:14.832Z",
          "Titre": "Right software... fast & well prices",
          "Contenu": "Needed an extra Windows xp license and SoftwareCW delivered quickly and at a great price.  Next time I need software they  will be on the provider short list."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew",
          "Nb_Reviews": 1,
          "Date": "2013-08-29T18:35:18.000Z",
          "Titre": "I will now check SoftwareCW FIRST for all software meeds.",
          "Contenu": "Very quick delivery of download code at the best price on the web.  This is a serious software company!  Highly recommended.  Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alex",
          "Nb_Reviews": 2,
          "Date": "2016-10-27T14:46:57.000Z",
          "Titre": "Windows 7 Professional  64 bit retail/Prompt Customer Service",
          "Contenu": "I purchased Windows 7 Professional 64 bit (retail version)DVD,not OEM, from SoftwareCW on October 4, 2016 for a custom build PC that I planned on building a few months  from now.  After receiving the product in the mail, I got kind of skeptical about whether or not I will discover that the OS was genuine, so I emailed customer service about returning the product and the reason I decided to do so.  They reassured me that if I discovered that I was unable to use the product key for this OS I would get a full refund for the purchase, which wasn't cheap.  That gave me some peace of mind and I highly appreciated customer service prompt response to my concern and resolution option should any issue arise with this purchase.  Besides that, it's a plus for me that any company is still offering Windows 7 Professional for purchase, which I believe is suppose to end on Oct. 31 for both retail and OEM versions.  I will update this review upon completing my custom build."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2016-09-17T06:23:59.000Z",
          "Titre": "Very happy with products & shipping",
          "Contenu": "SoftwareCW ships surprisingly fast! I have no complaints. I was pleased that they offer Microsoft Office 2013, since it is so hard to find these days. Overall I have no complaints."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AGGE MB",
          "Nb_Reviews": 1,
          "Date": "2014-08-26T13:41:39.000Z",
          "Titre": "Very good customer service.",
          "Contenu": "The SoftwareCW Team is very professional and quick to respond to your e-mail, once they receive it.  This is what makes their customer service so great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2013-08-30T19:04:14.000Z",
          "Titre": "Customer service beyond expectation",
          "Contenu": "I had a problem with my MS Office Home and Office product key. Not only did I get a response within 1/2 a day on a Saturday, I was upgraded to MS Office Professional!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adam",
          "Nb_Reviews": 1,
          "Date": "2013-11-27T14:46:44.000Z",
          "Titre": "Fast & Reliable!",
          "Contenu": "I've purchased from SoftwareCW a couple times now and the process has been very streamlined.  Always receive the products/keys in a timely manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Danny D.",
          "Nb_Reviews": 1,
          "Date": "2013-08-04T03:25:24.000Z",
          "Titre": "Unbelievable price and service that can't be beat!",
          "Contenu": "I did run into a problem with my download, however, customer service quickly answered by email and resolved the issue.  This was my first experience with softwarecw but definitely not my last."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen",
          "Nb_Reviews": 1,
          "Date": "2013-12-06T23:03:18.000Z",
          "Titre": "Trustworthy Supplier Sells Good Software at Good Price",
          "Contenu": "I was looking for a product no longer sold by the manufacturer.  This company had the product.  They were not seeking to rip anyone off, they didn't up the price.  It was a fair deal.  And they delivered what they promised in 24 hours.  I would do business with this company anytime.  They can be trusted."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alma Carrizosa",
          "Nb_Reviews": 16,
          "Date": "2014-08-12T20:56:33.000Z",
          "Titre": "Best purchase ever!",
          "Contenu": "My new device has allowed me to operate with a new freedom that my files will be saved no matter what happens to my computer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "C. Boling",
          "Nb_Reviews": 1,
          "Date": "2012-08-16T01:13:30.000Z",
          "Titre": "Prices are great, delivery on time, A+",
          "Contenu": "At first I wasn't sure about ordering from SoftwareCW, but 13 licenses later I am beyond thrilled at the job and service they provided."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debbie Buchanan",
          "Nb_Reviews": 1,
          "Date": "2013-10-02T00:07:33.000Z",
          "Titre": "Quick and easy!",
          "Contenu": "I ordered my software, got my confirmation very quickly.  The key code was emailed to me, but I must have deleted it by mistake.  I emailed the company and got a response very quickly.  I will order from them again.  Great customer service,"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John And Faith Ward",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T21:18:14.000Z",
          "Titre": "Program installed a whole lot quicker…",
          "Contenu": "Program installed a whole lot quicker than the AutoCAD program I used for over 20 years until I couldn’t afford the exorbitant subscription rate any more."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "sarat",
          "Nb_Reviews": 2,
          "Date": "2017-02-04T21:49:41.000Z",
          "Titre": "Refund",
          "Contenu": "I accidentally ordered 2015 software and realized it only after opening the package and removing the security seal.  They refunded my money w/o any hassle."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donny",
          "Nb_Reviews": 1,
          "Date": "2013-12-03T21:39:35.000Z",
          "Titre": "Create software at a low price",
          "Contenu": "Make sure you read in full which programs come with the software so you don't have to double on price.  SoftwareCW had the best prices on Adobe Software that I could find online."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob Taurence",
          "Nb_Reviews": 1,
          "Date": "2016-06-24T20:53:13.000Z",
          "Titre": "Prompt no hassle refund",
          "Contenu": "I made a mistake - ordered wrong product.  Emailed softwarecw, they sent a 'code' for me to use on my return mailing with no quibble or hassle. I mailed wrong product back and got a very prompt refund of full amount!!!  Can't expect any better than that!!  Very trustworthy company!!  Kudos!!Bob T.  Hopewell Jctn, NY"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "chris sherman",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T02:01:18.000Z",
          "Titre": "The software was great and service was…",
          "Contenu": "The software was great and service was amazing"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gene Senderak",
          "Nb_Reviews": 1,
          "Date": "2023-01-23T10:25:05.000Z",
          "Titre": "Trust IMSI software",
          "Contenu": "I've purchased IMSI products for a number of years and have been generally pleased with the quality."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CJ",
          "Nb_Reviews": 1,
          "Date": "2012-08-30T05:49:48.000Z",
          "Titre": "SUPERB SERVICE, FAST AND GREAT FOLLOW-UP",
          "Contenu": "ORDERED THE ADOBE ACROBAT AND RECEIVED IT FAST. EFFICIENT AND EXCELLENT SERVICE AND FOLLOW THROUGH - WOULD DEFINITELY CONSIDER BUYING FROM AGAIN IN THE FUTUREq"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "David Duke",
          "Nb_Reviews": 2,
          "Date": "2017-01-26T17:15:40.000Z",
          "Titre": "On time and as described. Thanks",
          "Contenu": "I received my package by the date expected. It was in new condition with no damage.Completely satisfied with my purchase!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom D.",
          "Nb_Reviews": 2,
          "Date": "2013-09-24T13:17:44.000Z",
          "Titre": "Everything went smooth and as expected.",
          "Contenu": "Everything went exactly as promised.  The file download went perfect and the key was emailed well within the stated timeframe."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zebraman",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T21:33:49.000Z",
          "Titre": "Easy to use website and fast…",
          "Contenu": "Easy to use website and fast transaction."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cheryl Inman-Lee",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T21:31:49.000Z",
          "Titre": "Kofax Power PDF 4.0",
          "Contenu": "Ordering was easy, download went without a hitch and using software.  Using the software for credentialing purposes and itw wonderful!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Imelda",
          "Nb_Reviews": 1,
          "Date": "2013-07-30T18:57:11.000Z",
          "Titre": "Great service!",
          "Contenu": "After my purchase of the Microsoft program,  I had some questions about the program and they answered  in a timely manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2013-09-20T17:26:21.000Z",
          "Titre": "Product was as stated and works perfectly.",
          "Contenu": "The software was as it should be, original and in sealed package; easy to install and worked as expected; will trust this site again for my software needs; price for original was better than anywhere else and was shipped fast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 1,
          "Date": "2016-07-10T16:08:32.000Z",
          "Titre": "Turbo Tax Premier",
          "Contenu": "Order arrived when scheduled, in perfect condition.  Best price I could find for this software.  Overall opinion - very satisfied with this order/distributor."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jenny",
          "Nb_Reviews": 1,
          "Date": "2013-09-02T13:34:59.000Z",
          "Titre": "excellent customer service",
          "Contenu": "I am very happy with my product. When my product key would not work I sent them an email and received a fast response. They worked with me to resolve the issue quickly. I am very happy wih the software I purchased. I have been using it for 2 weeks now and am very satisfied with it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 4,
          "Date": "2014-01-15T18:02:44.000Z",
          "Titre": "SoftwareCW Can't Be Beat!",
          "Contenu": "Not only was their price the best, but they were very timely in providing the authorization codes. I am very pleased with the service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cheri",
          "Nb_Reviews": 2,
          "Date": "2013-10-12T16:50:54.000Z",
          "Titre": "Exactly what I wanted and expected",
          "Contenu": "Ordered Publisher 2010 and got it quickly. It was packaged right,  the program installed and registered just fine."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jack Morris",
          "Nb_Reviews": 2,
          "Date": "2023-10-28T01:12:32.000Z",
          "Titre": "Patience",
          "Contenu": "I was able to create 2D and 3D models for my 3d printer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kipp True from SoftwareCW",
          "Nb_Reviews": 1,
          "Date": "2012-08-08T05:29:45.000Z",
          "Titre": "SoftwareCW is the TOPS",
          "Contenu": "I found the site user friendly; navigation was clear and simple.\rI placed my order securely, and I stood in awe of the speed in which my order was received! And it was Free!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "FERN",
          "Nb_Reviews": 1,
          "Date": "2014-01-17T14:32:18.000Z",
          "Titre": "excellent support!!",
          "Contenu": "The support that I received when I had difficulty in installing was excellant!.  The response was timely, courteous and helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "mikeandmikedabest",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T00:37:04.000Z",
          "Titre": "Service was great",
          "Contenu": "Service was great however, my laptop suffered from screen failure of some sort."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leah W.",
          "Nb_Reviews": 4,
          "Date": "2023-06-28T00:02:45.000Z",
          "Titre": "Happy with our software purchase from…",
          "Contenu": "Happy with our software purchase from software CW. easy purchase and easy download."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cory Kirchert",
          "Nb_Reviews": 1,
          "Date": "2023-01-22T19:06:55.000Z",
          "Titre": "Bought two separate programs and both…",
          "Contenu": "Bought two separate programs and both downloads were easy. Programs are perfect."
        }
      ]
    }
  ]
}