{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "ssls.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Gonzalo Ramirez",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T22:46:18.000Z",
          "Titre": "Not well supported",
          "Contenu": "I purchased a ssl certificate that should take 2-2-20 mins to be issued now over 3 days"
        },
        {
          "Note": 1,
          "Lieu": "ZA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T03:04:40.000Z",
          "Titre": "TERRIBLE.",
          "Contenu": "Purchased an ssl from them, still haven't received. My users are being served on an unsecure site. Terrible service and experience. LOUSY. No obvious way to get a refund."
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "Alfonso",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T00:52:24.000Z",
          "Titre": "I don´t have option to change the…",
          "Contenu": "I don´t have option to change the email. I can't recieve the confirmation mail because the error I made when I wrote it."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "GS",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T17:42:44.000Z",
          "Titre": "It was the most frustrating experience…",
          "Contenu": "It was the most frustrating experience I've had.  Only having chat as a means of support for mission critical items.  They need screenshare or phone call.  I will be switching vendors as soon as our terms are up.  The documentation for Exchange is outdated to 2013.  I asked for 2nd level support but was assured the current tech could help.  It would be more helpful if the tech can see what I'm doing and let me know if it's right.  I am still not quite sure if what I did was right or not regarding renewing an ssl for Exchange."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Josh Buckle",
          "Nb_Reviews": 3,
          "Date": "2023-06-27T22:46:10.000Z",
          "Titre": "Extremely Rude and Unprofessional Support",
          "Contenu": "Fearing my account had been hacked following a payment from namecheap.com. Which has since turned out to be a sister company of ssls.comI have been dealing with Oleh K has been extremely rude and patronising towards us. After we first witnessed the issue we contacted PayPal as we wasn't sure. Our account is now being held ransome as they're demanding a $10 fee. Despite evidence the charge back from PayPal is no longer open. We have sent clear screenshots of emails and direct from PayPal to show the case has been dropped now. However Oleh K is unable to understand this resulting in hours of wasted time and stress."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "abhay Sashtri",
          "Nb_Reviews": 1,
          "Date": "2021-12-17T16:43:15.000Z",
          "Titre": "Never go with these people",
          "Contenu": "Never go with these people. what we understand they are selling certificate from some one else. so they collect payment from you and other company generate certificate. They have made it so hard to get and install an SSL.After payment certificate generation open for month and no one bother from SSLS.com side. finally we brought certificate from another India Company and all up and running in 10 min."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Manuel Porter",
          "Nb_Reviews": 2,
          "Date": "2021-08-04T03:19:22.000Z",
          "Titre": "Complete waste of time",
          "Contenu": "Complete waste of time. I purchased a cert. Never received it. Requested a refund, they are requiring a pin that is suppose to update every 24 hours that doesn’t. Will not provide me a refund without verification from some fictitious pin that allegedly updates every 24 hours. Stay far away."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Steve O",
          "Nb_Reviews": 2,
          "Date": "2021-10-18T22:55:07.000Z",
          "Titre": "Unfortunately, a no go.",
          "Contenu": "Unfortunately, I won't be extending my free trial as the Certificate was just too difficult to install. I am not an expert but I do create my own websites, so I'm familiar with HTML and the file structure. The links to an instruction page just led to blank pages, so I tried finding instructions elsewhere. Got close, but couldn't make it happen. Ended up paying a lot more for an automated Certificate Installation through my service provider."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Aksana Karolik",
          "Nb_Reviews": 2,
          "Date": "2021-06-15T15:45:57.000Z",
          "Titre": "Terrible experience",
          "Contenu": "Terrible experience. I have purchased their SSL certificate due to a lower price. Unfortunately, it turned into a very time consuming and frustrating experience. They were not able to verify our company and requested us to get listed on some private directories first. We don't have any need to get listed in any private directories. We owned the domain for three years and only needed to renew the certificate. The customer support was very rude. I requested a refund. Will continue using Godaddy."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lee Klocke II",
          "Nb_Reviews": 4,
          "Date": "2022-04-19T21:42:08.609Z",
          "Titre": "I would rather get a root canal",
          "Contenu": "I just wanted an SSL so that my website would look secure, they came up in the search they looked inexpensive so I said what the heck.  Gosh I wish I would have paid any amount more to get a company that actually has real-time customer service not when we in America are sleeping.  Everything is intentionally cryptic so that you have to hire them to install the certificates.  After 9 days of messing with them and offering money if they would just get it done.  I signed up for Bluehost paid almost same price it was completed in 2 hours, You get exactly what you pay for.  I would rather just sell things door to door then ever deal with this company again.  They just do not even get the idea of customer service...It is probably intentional I don't know but I paid twice for an SSL certificate."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Michael",
          "Nb_Reviews": 22,
          "Date": "2021-12-16T15:50:11.000Z",
          "Titre": "Truly awful.",
          "Contenu": "Truly awful.They have made it so hard to get and install an SSL by changing the way they work from 1 email telling me to do something to the next saying sorry we have changed that now.Then they fail to issue the key file and because of that the certificate has to be reissued which means I have to make another DNS change.I have now been passed through 3 customer service staff all of whom take 10 minutes to read notes (30 mins) then say I will have to get someone else to help.Cant even get their own systems to work.In reply to ssls' reply.This just shows what I mean - according to customer support http based validation is no longer available. That is how we started this journey - uploading the directory/file as requested. Validation DID NOT work.Now in response to a complaint more incorrect information is given out. And no I will not provide my phone number etc as I have wasted too much time on this already."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T15:37:16.000Z",
          "Titre": "i didnt expect to get ads for reviews…",
          "Contenu": "i didnt expect to get ads for reviews via email.  I get enough junk as it is, searching for likes is not what i want."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gino",
          "Nb_Reviews": 1,
          "Date": "2022-10-05T23:10:31.000Z",
          "Titre": "Seems like in incompetence to me.",
          "Contenu": "After waiting 3 hours for a reply to my request for help, they could not help me and did not communicate clearly as to why they couldn't help me. Then they told me they could not find my server! I'll be getting a refund. What a waste of time."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "MONJAL",
          "Nb_Reviews": 1,
          "Date": "2022-09-08T10:02:00.000Z",
          "Titre": "my ssl certificate does not work on my…",
          "Contenu": "my ssl certificate does not work on my wordpress website installed on my pc I manage it with apache from xampp"
        },
        {
          "Note": 1,
          "Lieu": "SC",
          "Pseudo": "Gembell Vietnam",
          "Nb_Reviews": 1,
          "Date": "2022-03-15T19:20:16.000Z",
          "Titre": "Worst service ever used for SSL",
          "Contenu": "Worst service ever used for SSL! They stole my money for issuing certs referred for technical issues!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Doug Smith",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T19:46:44.000Z",
          "Titre": "Unable to install it and can’t get…",
          "Contenu": "Unable to install it and can’t get help. Beginning to think I was scammed."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Terry Clarke",
          "Nb_Reviews": 8,
          "Date": "2022-03-11T19:27:47.000Z",
          "Titre": "Service not working",
          "Contenu": "The crt file supplied is not being recognised is a valid file. I have contacted support and had no response."
        },
        {
          "Note": 1,
          "Lieu": "RU",
          "Pseudo": "Artem Razin",
          "Nb_Reviews": 5,
          "Date": "2022-03-17T12:58:14.000Z",
          "Titre": "They are rasists (confirmed)",
          "Contenu": "They wrote me that they decided to stop providing their service to me because of my nationality. I have not chosen it. I was born here, in Russia. This company may use money earned from Russian customers to help people in UA. But instead they have chosen to way of discrimination. They wrote that my guilt is that I have to pay taxes to Russian government. Well, a lot of western companies do the same; they pay taxes to Russian government. Apple, just for instance. But they are not Russians and that's alright. They wrote that my guilt is that I have to pay taxes to Russian government. Well, after this company stopped providing their service to me, do they really believe that I stop pay taxes. Sounds strange.PS After the answer of the vendor (see below) it is clear that they just banned _all_ Russians because as they write \"we made a mistake by overlooking those free media organizations... We hope you can understand that we were acting quickly\".The vendor acted quickly and just banned all Russians no matter if they are against the war or not. Only because such a customer is Russian.The vendor confirmed that they are rasists acting quickly to discriminate people just because of their ethnicity.They stupidly believe that a banned customer will \"fight against this tyranny\". Lol, what?! Such a customer will of course just start using another service and that's all.In the answer below you will not find anything about western companies that continue working on Russian market and that continue paying taxes. Do you really think SSLs.com ban them? Absolutely, no. Why? It is clear. They are western companies, they are not Russians - that is why.EU buys Russian gas and Russian oil. They pay to the Russian government. Do you think SSLs.com is going to ban such buyers. Of course, not!Distilled racism."
        },
        {
          "Note": 1,
          "Lieu": "PL",
          "Pseudo": "Tomek",
          "Nb_Reviews": 2,
          "Date": "2021-05-17T20:09:24.000Z",
          "Titre": "This company wanted a honest review",
          "Contenu": "This company wanted a honest review - so there's one. They spam people and want reviews from them. I don't recommend !"
        },
        {
          "Note": 1,
          "Lieu": "AE",
          "Pseudo": "UAE business",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T14:17:32.000Z",
          "Titre": "Certificate is still not issued after…",
          "Contenu": "Certificate is still not issued after almost half a year!!"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "CB",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T08:03:17.000Z",
          "Titre": "I cancelled my order and am yet to…",
          "Contenu": "I cancelled my order and am yet to receive a response or a refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alfredo Ortiz",
          "Nb_Reviews": 1,
          "Date": "2022-10-31T16:59:36.000Z",
          "Titre": "I couldn’t download it and they want to…",
          "Contenu": "I couldn’t download it and they want to charge $25 to install it, ridiculous"
        },
        {
          "Note": 1,
          "Lieu": "SG",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T11:06:28.000Z",
          "Titre": "could not set -up wasted my money"
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-03T15:48:43.000Z",
          "Titre": "It didn't work for me",
          "Contenu": "It didn't work for me, it can't be activated"
        },
        {
          "Note": 1,
          "Lieu": "UA",
          "Pseudo": "Pavel Pavlenko",
          "Nb_Reviews": 1,
          "Date": "2020-05-30T13:25:46.000Z",
          "Titre": "We purchased a number of certs from…",
          "Contenu": "We purchased a number of certs from SSLs.comToday one of our certs suddenly expired, though it shows as active till Jan 2021. We got no notification about the expiration and therefore our service was down for 30 minutes.When I contacted their support - they refused to refund any amount for the broken cert. I don't recommend this service."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Carlos J. García.",
          "Nb_Reviews": 5,
          "Date": "2021-02-16T18:54:11.000Z",
          "Titre": "Avoid the SSLs + Sectigo couple",
          "Contenu": "Buy your certificate at SSLs who passes the purchase to Sectigo... and probably you will get stuck in an absurd and never ending validation process.Despite you do not get your certificate, their refund is made in \"SSLs credits\". No thanks, I have had enough with my first (and last) time!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Alasdair",
          "Nb_Reviews": 3,
          "Date": "2019-12-16T17:31:57.000Z",
          "Titre": "Avoid this company obfuscates its prices and products",
          "Contenu": "Purchased what I understood at the time was a multi domain SSL and the prices from the way back machine support that as being the appropriate product given the price paid.  However what was supplied was a single domain SSL even though original the form asked for a primary and secondary set of domains.  Avoid this company and buy from somewhere that clearly indicates product throughout the transaction and in all receipts"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jon",
          "Nb_Reviews": 3,
          "Date": "2020-05-19T17:28:05.000Z",
          "Titre": "Fraudulent company",
          "Contenu": "I bought an SSL certificate from SSLS.com.  They emailed me 24 hours later saying that payment had failed, and that they would revoke my certificate if I didn't log in and make the payment again.  I did so.  I then saw that the first payment had not failed, and that they had now charged me twice.  They are refusing to refund the first payment.  I have now spent multiple hours dealing with this.  It is not worth my time, but the principal of the matter.  Would never use them again."
        },
        {
          "Note": 1,
          "Lieu": "MY",
          "Pseudo": "Ricky Wijaya",
          "Nb_Reviews": 1,
          "Date": "2020-10-25T06:33:05.000Z",
          "Titre": "Never buy SSLS company from here and…",
          "Contenu": "Never buy SSLS company from here and Sectigo. They will always ask you for 3rd party databases company that can verify your company phone numbers, the worst part if your company, not in the US, the choice that they can suggest are all useless. Would you spend USD 120 for SSL cert but USD 300 plus for a letter from a lawyer? That also not guarantee you get the SSL for the company. I had asked for support for roughly one month and they still can't provide any solution. Well, when the cheap price comes with the cost too."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "TotalExpo, Inc",
          "Nb_Reviews": 2,
          "Date": "2021-05-17T16:45:02.000Z",
          "Titre": "This was much more complicated that it…",
          "Contenu": "This was much more complicated that it needed to be. We were told by Trustwave that if the certificate expired, it would be a simple process to renew it. That was NOT the case. In the future, we will use another provider for this service."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Søren Fryd",
          "Nb_Reviews": 2,
          "Date": "2020-03-06T05:17:40.000Z",
          "Titre": "First of all you do not get your ssl…",
          "Contenu": "First of all you do not get your ssl without get in personal contact to their supplier (they are not doing ssl by them self) on my case supplier needs a confirmation on some homepage (like google business etc.) where they can see your phonenumber. I registered with my private mobilephonenumber (to get easy support if needed) but they do not accept that I do not want to register my own phonenumber to google etc. They have no other way to get confirmed that I am they owner of the order. It is simply just rediculess and I will need to buy somewhere else and not get my money back."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Roman Anin",
          "Nb_Reviews": 1,
          "Date": "2020-07-16T08:18:22.000Z",
          "Titre": "It's been almost a month since I…",
          "Contenu": "It's been almost a month since I purchased the certificate and I still can't get it. Guys, you should never buy a certificate from them, especially if you buy it for a company.They will ask you to register the company in third party databases and then constantly check it so that they will be able to verify the phone number. They will also ask you to send sensitive information like banking statements. And even if you do everything there is no guarantee that you'll get the certificate. And the support will not help you because they are just resellers of certificates from Sectigo."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "IMB LLC",
          "Nb_Reviews": 2,
          "Date": "2020-01-17T01:31:49.000Z",
          "Titre": "This company is a sister company of…",
          "Contenu": "This company is a sister company of namecheap.com and they both are scams!  I bought from both companies and both times they couldn't get the SSL Certificate to me via email.  I finally demanded that they give me contact info for their supplier Sectigo and was told by Sectigo customer service, (they have a phone # you can actually speak to a human) that there is nothing that they can do, they do not send emails like SSLs.com and Namecheap.com says they do.  I do not have access to the other ways they tell you to validate your SSL Cert so the only way is via email.  DO NOT BUY FROM SSLs.com or Namecheap.com!!!!  BUYER BEWARE!!"
        },
        {
          "Note": 1,
          "Lieu": "AE",
          "Pseudo": "broca",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T10:45:54.000Z",
          "Titre": "vbad experiance and complicated platform"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Hastings Chikuse",
          "Nb_Reviews": 1,
          "Date": "2021-04-29T23:49:42.000Z",
          "Titre": "I purchased multi-website package and…",
          "Contenu": "I purchased multi-website package and nothing was installed.  Communication with support was never responded to. I have a feeling I was scammed"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Carol Devine",
          "Nb_Reviews": 2,
          "Date": "2021-05-11T19:19:01.000Z",
          "Titre": "Not happy with renewal process",
          "Contenu": "Not happy with renewal process.  Very confusing.  Not clear in what I have to do.  Not tech savvy. Make it very simple for people like me."
        },
        {
          "Note": 1,
          "Lieu": "PH",
          "Pseudo": "Andy Gee",
          "Nb_Reviews": 8,
          "Date": "2021-05-11T16:15:49.000Z",
          "Titre": "SSLs was ok, well that's what I thought.",
          "Contenu": "Since learning about the significant differences between SSL and TLS I'm shocked that SSLs describe the difference as: \"TLS is a little more secure, so businesses like banks will insist on it, but for most websites it doesn’t make much of a difference\"That's a big WOW right there. TLS which superseded SSL in 1999 - so 22 years of cryptographic advancements \"doesn't make much of a difference\" - that's not only unprofessional, it's dangerous advice and that's why I will never use SSLs again.Also I don't really see the point in paying $100 for something that has an easily superior free certificate via lets encrypt. I was originally persuaded by their \"Get exactly the same products for better prices\" table on their homepage which conspicuously completely neglected to mention Lets Encrypt - a CA which issues around 2,000,000 certificates daily didn't make the comparison table. So that's the second reason I'll never use SSLs again. Dangerous advice and deceptive advertising."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Seth Rosenberg",
          "Nb_Reviews": 1,
          "Date": "2021-05-11T17:48:24.000Z",
          "Titre": "Renewal process was a nightmare if…",
          "Contenu": "Renewal process was a nightmare if disorganized and broken Systems"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-03T18:39:43.000Z",
          "Titre": "Robotic saved answers."
        },
        {
          "Note": 2,
          "Lieu": "AE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T15:25:50.000Z",
          "Titre": "We still did not receive the SSL…",
          "Contenu": "We still did not receive the SSL ceriticate"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T09:02:35.000Z",
          "Titre": "Slow support",
          "Contenu": "The support is very slow and even the issuing of certificates is extremely slow. They will acknowledge your request, but then leave it there. I am still waiting on my certificate and can't seem to progress further."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Eric Rohner",
          "Nb_Reviews": 2,
          "Date": "2022-03-31T16:09:07.000Z",
          "Titre": "Your site had an incorrect step by step…",
          "Contenu": "Your site had an incorrect step by step instruction on importing the files. I finally say at the bottom of a page on how to I could combine the public and private key into a PFX file. You need to fix your step by step web page for IIS server."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Retro RobNY62",
          "Nb_Reviews": 4,
          "Date": "2023-08-06T21:04:03.000Z",
          "Titre": "The instructions I get did not allow me…",
          "Contenu": "The instructions I get did not allow me to install it right"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert Kost",
          "Nb_Reviews": 1,
          "Date": "2021-05-11T17:14:58.000Z",
          "Titre": "Opaque purchase and process",
          "Contenu": "There is very little help with the purchase decision making process. It’s difficult to know which kind of certificate provides what kind of benefits for the purchase. It’s very hard to distinguish among certificate alternatives. There’s a little explanation of the differences between certificates.  Little explanation of the process involved in purchasing. The handoff to Comodo was horrible, as was the experience with Komodo in dealing with and EV certificate and validation requirements."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 7,
          "Date": "2020-06-30T05:50:01.000Z",
          "Titre": "Annual reinstall required, not noted",
          "Contenu": "They do NOT make it clear that you'll have to do the whole cert reinstall every year before purchasing.  If you look closely, they hint about this for 3+ years, but not for 2 years.  I specifically bought a 2 year cert instead of a 3 year cert in hopes of extending the time I had to hassle with reinstalls, only to find out AFTER they took my money.  UGH.+1 star because at least they include the openssl command line so I don't have to look it up."
        },
        {
          "Note": 2,
          "Lieu": "NE",
          "Pseudo": "Ibrahim Daouda Hamani",
          "Nb_Reviews": 1,
          "Date": "2021-05-17T16:15:33.000Z",
          "Titre": "The SSL lock sign does not appear on…",
          "Contenu": "The SSL lock sign does not appear on our URL on our web site I was told by your technicien that our web master suppose to made it appear.When I contacted him, he said he could not do it."
        },
        {
          "Note": 2,
          "Lieu": "TZ",
          "Pseudo": "Samuel Severua (Sam)",
          "Nb_Reviews": 3,
          "Date": "2021-01-08T11:28:29.000Z",
          "Titre": "They just sell titles",
          "Contenu": "They just sell titles, but the service after purchase is @#$%^&. They assume everyone is a techie...."
        },
        {
          "Note": 2,
          "Lieu": "FR",
          "Pseudo": "ekkier",
          "Nb_Reviews": 146,
          "Date": "2019-08-27T12:32:50.000Z",
          "Titre": "Too long to receive files for SSL certificat : lost of time..",
          "Contenu": "Too long to receive files for SSL certificat : lost of time, lost of money .. dont choose them !"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sol O",
          "Nb_Reviews": 2,
          "Date": "2023-07-02T16:46:42.000Z",
          "Titre": "POOR CUSTOMER SERVICE"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Karl Hoener - ComTech",
          "Nb_Reviews": 4,
          "Date": "2023-10-27T17:35:10.000Z",
          "Titre": "There was a system issue on this one",
          "Contenu": "There was an issue where the system reported a correct validation of an uploaded file, but the certificate never appeared.  Apparently, the validation had to occur on port 80 or 443, but it happened on another port.  The system reported that was OK, but it was not and I had to contact support to find out why.  After that everything was resolved properly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charlie Morgan",
          "Nb_Reviews": 5,
          "Date": "2022-08-22T20:27:00.000Z",
          "Titre": "No help",
          "Contenu": "I received certificate and no help installing it On on my website. When I purchased it last time it was installed automatic and I didn’t have to do anything. I thought since I was renewing my certificate it would continue as normal . You can’t talk with anyone"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 2,
          "Date": "2022-02-24T20:18:44.000Z",
          "Titre": "Purchasing the ssl package was easy",
          "Contenu": "Purchasing the ssl package was easy. Setting up the ssl package difficult and misleading on the site. The instructions were for a open source linux or apache server only and not for a windows server. I could not generate the ssl request on the site following the direction listed. I spent several days off then on to figure it out. For windows servers just go to the setting for adding the ssl and they walk you though it. Then after the ssl is issued there are no instructions for installing it on the windows server. I had to serch the internet to find how to do that. Even after finding it is was difficult to figure on which files to enter as there are 3 sll files to put in on a 3 server purchase. After several days I was able to get it installed and working."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeff Hall",
          "Nb_Reviews": 1,
          "Date": "2022-07-06T18:29:15.000Z",
          "Titre": "Getting certs was easy",
          "Contenu": "Everything involved with getting the certs was smooth and easy. However I can't seen to install it in a SonicWall nsa 2400 and there doesn't seem to be about to contact anyone to see if I can get help."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "kirk benjamin",
          "Nb_Reviews": 1,
          "Date": "2021-10-25T16:27:41.000Z",
          "Titre": "economies of scale of docuumentaion",
          "Contenu": "So I had a problem where the file name you sent me via email and the one from your site had a slightly different name.  Yes the cert was the same but when I used an identical config file on test and prod machine I got an error.Your price for the ssl was said to be 3.74 but the price when I pick it up will be 5 something.Your email made it dificult to see my cert download.I did not have access to documentation on how to install a cert on windows.All of this seems trivial.  But you are selling a service and you make money when your audience is larger and happier.So your procedures don't make it as easy as it could be for a novice.  You spend 3.74 on a cert and hundreds on research time.So now you could make a great explanation of certs and installation for novice.It must anticipate the readers knowledge , and then it would in \"ironically\" be worth a \"bundle\""
        },
        {
          "Note": 3,
          "Lieu": "DK",
          "Pseudo": "Klaus Bojesen Nielsen",
          "Nb_Reviews": 22,
          "Date": "2022-09-09T21:31:18.000Z",
          "Titre": "have had trouble getting login info for…",
          "Contenu": "have had trouble getting login info for the 3rd day now otherwise ok"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Pierre R",
          "Nb_Reviews": 1,
          "Date": "2021-05-18T09:45:56.000Z",
          "Titre": "Service was not available in french."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tina Compton",
          "Nb_Reviews": 2,
          "Date": "2021-04-29T18:43:07.000Z",
          "Titre": "frustrating waste of my money",
          "Contenu": "while purchasing your product was easy. your customer support was not helpful and your instructions for someone like me were very vague. i was unable to use/implement my purchase from you on the website i bought it for leaving me very frustrated and making me turn to a different option- this is as honest as i can be."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Carol Devine",
          "Nb_Reviews": 2,
          "Date": "2021-05-17T17:42:53.000Z",
          "Titre": "Instructions could have be clearer for…",
          "Contenu": "Instructions could have be clearer for those of us who are not up on all of this."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T14:18:49.000Z",
          "Titre": "Very user friendly and affordable",
          "Contenu": "I got me, my professor and my client to buy ssls from you because you have the most affordable price I found on the internet. My professor and I were also very impressed with your documentation and the very clear written and video instructions on how to solve various issues."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Rushikesh PAtel",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T16:09:59.000Z",
          "Titre": "Awesome Support thanks to help me…",
          "Contenu": "Awesome Support thanks to help me configure SSL on different droplets for my one domain."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "Sylvain",
          "Nb_Reviews": 1,
          "Date": "2022-07-11T03:15:07.000Z",
          "Titre": "It's hard to generate a pfx from the…",
          "Contenu": "It's hard to generate a pfx from the files received to install on Windows server.Would be nice to have instructions regarding OpenSSL + the right parameters for Windows Server 2016 (on 2019 it was a bit easier).EDIT: I should have looked more into the SSLs.com documentation, everything was there. I did not notice the online converter mentioned, it would have saved me a lot of time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LDH",
          "Nb_Reviews": 1,
          "Date": "2022-01-06T20:55:01.000Z",
          "Titre": "Positively surprised by this service.",
          "Contenu": "The process was a lot smoother than i had expected and the overall web site experience is quite nice. Only quibbles are:- it took me a while to figure out the difference between Positive vs Essential certificates.- it took some time for my DNS to refresh and SSLs.com kept on showing an error instead of telling me that waiting 10mn or so was common. The instructions for the testing tool weren't clear either.- the SSL files (key, certificate and chain) came in what i felt were non-standard names, so i had to rename them with .PEM extensions and so on to make this work in some environments."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Tom Wisman",
          "Nb_Reviews": 3,
          "Date": "2021-07-13T20:14:43.000Z",
          "Titre": "SSLs certificate works on Hostnet.nl subdomain",
          "Contenu": "I have a website(joomla) in a subdomain hosted by \"hostnet.nl\".I bought an SSLs.com certificate and I installed the certificate within one hour. Yes I made mistakes such as wrong mailadres, trying the installation advices from Hostnet.nl. But if you follow the SSLs.com directions you will get there."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Marc Assayag",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T00:28:48.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service.  Process is a bit confusing but they walk you through it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Terry LaGrone",
          "Nb_Reviews": 2,
          "Date": "2021-05-17T17:54:50.000Z",
          "Titre": "SSL certificate for accessing local OpenVPN server",
          "Contenu": "I needed an SSL certificate to locally access an OpenVPN server. The SSL certificate provided me access; howver, I did not complete all the steps to make the certificate useful for external access. Each of my devices I use to access my OpenVPN server had to have the three certificates installed as trusted. Operates fine at this time. Later, I might install the certificates in a manner which will allow me to access web pages on my server using https protocol.Hosting OpenVPN on Ubuntu using Apache. Acessing from MacOS, iOS, Windows, Android and linux."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dr. Petersen",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T14:48:52.000Z",
          "Titre": "Excellent customer service.",
          "Contenu": "It was smooth, efficient and an excellent value. I made an error and need a refund. I requested it and received it quickly. I redid the order and now everything is working perfectly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "adel sidky",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T19:30:22.000Z",
          "Titre": "easy to flow the topics i needed",
          "Contenu": "i was able to get the information i was looking for without any issues. Thanks"
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "Joao Ribeiro da Silva",
          "Nb_Reviews": 1,
          "Date": "2022-05-02T19:19:35.000Z",
          "Titre": "Simple and efficient",
          "Contenu": "I've worked you your company before for some of my old clients.I just have one point where you could improve.Sending with all file a certificate that already has de full stack for us to avoid having to do cat public.key public.bundle.crt  > public.bundle.key and then verify if the line creak between the first file and the bundle is there.The rest everything is quite nice in your service.RegardsJoao"
        },
        {
          "Note": 4,
          "Lieu": "CO",
          "Pseudo": "Halain",
          "Nb_Reviews": 1,
          "Date": "2021-05-18T01:55:28.000Z",
          "Titre": "Is very good",
          "Contenu": "Is very good. Pretty costly and if you don’t have anual certificates, is time consuming task, but, anyway, good service."
        },
        {
          "Note": 4,
          "Lieu": "MG",
          "Pseudo": "Riana",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T14:09:23.000Z",
          "Titre": "Explanations on how to set everything…",
          "Contenu": "Explanations on how to set everything up are very clear and straightforward. Everything went smoothly and very fast."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Doe",
          "Nb_Reviews": 2,
          "Date": "2022-02-17T15:19:07.000Z",
          "Titre": "Scammer website (Resolved)",
          "Contenu": "Scammer websiteOrder #73408829I paid for the order on 14 Apr 2021. Their payment processor was being a pain for whatever reason and for that reason, my money got debited from my bitcoin wallet, but the order was never marked as completed. I opened a ticket at their support - #VHR-714-40320 and they told me that my transaction was missing confirmations. The transaction was confirmed over a day or so ago at that point and they still refused to manually review my payment or give me the bitcoin transaction hash so that I could monitor the transaction on my end too. When asked for bitcoin hash, I was provided \"The transaction ID in question is 5NwcP2D5YZrrvUoe2U9KQz. \" as response. To this date, my order has not been completed and I still have not received my SSL certificate. Overall, I definitely would NOT recommend this website for your SSL certificate needs. Mind you, this was my second order with this website, and well, I am disappointed to waste 60 bucks over nothing.PS: And my ticket has been marked as resolved and their support staff is not helpful at all and do not understand my concern.------------------------------------------------------It took some time but thank you, this issue was resolved, apologies for not updating the feedback on time. I was refunded back to my wallet. I am unhappy with the experience and the fact that I had to use trustpilot to have this issue resolved but whatever."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Joost den Boer",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T09:47:40.000Z",
          "Titre": "Fast response.",
          "Contenu": "Fast response.Problem solved."
        },
        {
          "Note": 4,
          "Lieu": "MU",
          "Pseudo": "Cedric - e-tickets.io",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T11:55:05.000Z",
          "Titre": "Very straight forward & Easy to use",
          "Contenu": "Very straight forward & Easy to use, but timely process to verify.Still waiting"
        },
        {
          "Note": 4,
          "Lieu": "CO",
          "Pseudo": "Luis",
          "Nb_Reviews": 2,
          "Date": "2023-10-17T14:53:25.000Z",
          "Titre": "It is not instant cert delivery"
        },
        {
          "Note": 4,
          "Lieu": "AE",
          "Pseudo": "Shameem",
          "Nb_Reviews": 2,
          "Date": "2021-05-18T05:23:09.000Z",
          "Titre": "The Best price and easy to use",
          "Contenu": "SSLS.com offered the best price and the process was also so easy. NAy one can use the website to buy the SSLs."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mr ANDROID",
          "Nb_Reviews": 36,
          "Date": "2021-05-02T05:39:47.000Z",
          "Titre": "Product ID \tStatus \tcheck status /…",
          "Contenu": "Product ID \tStatus \tcheck status / switch DCV method#em3xm7Pending \tWaiting for order ID... SSL: error:0B080074:x509 certificate routines:X509_check_private_key:key values mismatch)cannot sync keys, stalled activation, etconly 365 days validdegradation of the serviceinfinite loop of mismatching and chasing private certs with public key"
        },
        {
          "Note": 4,
          "Lieu": "CO",
          "Pseudo": "wapa",
          "Nb_Reviews": 1,
          "Date": "2021-05-17T16:13:07.000Z",
          "Titre": "ssls.com - a first choice",
          "Contenu": "At first, ssls.com has a fancy GUI, and it's easy to use. Instructions are very clear and although we are on Cherokee-webserver (some kind of NGINX-derivate) it was easy to install. Only one thing to think about: The \"organization validation\" should not be with a \"public database\" where the original source is unknown and in some cases, the public data is somewhat outdated (addresses, phone numbers).In comparison with other SSL providers (and not at least by price), ssls.com is the best so far."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pavel Ivanchenko",
          "Nb_Reviews": 1,
          "Date": "2021-05-17T16:04:35.000Z",
          "Titre": "Not so bad as described in old posts",
          "Contenu": "I wanted to try this service because of value/money but unfortunately read a lot of negative feedbacks about great delay in certification issued process for most high verified type of certificates. In my case everything was reasonable and I've received cert as expected"
        },
        {
          "Note": 4,
          "Lieu": "SE",
          "Pseudo": "Valentin",
          "Nb_Reviews": 3,
          "Date": "2021-05-11T17:28:39.000Z",
          "Titre": "They are ok as a shop mabe not very…",
          "Contenu": "They are ok as a shop mabe not very explicit on how to install the certificate but the support is absolutely fabulous they help you out every time you need, so no worries your certificate will get installed, prices are ok.Happy shopping"
        },
        {
          "Note": 4,
          "Lieu": "BG",
          "Pseudo": "Yordan Danailov",
          "Nb_Reviews": 1,
          "Date": "2021-05-11T15:52:21.000Z",
          "Titre": "Price is the best thing about these…",
          "Contenu": "Price is the best thing about these certificates. The good thing is that they get \"green lock\", but it's not like there are no problems. There was a problemcertificate chain. It took me a few hours to figure out."
        },
        {
          "Note": 4,
          "Lieu": "MA",
          "Pseudo": "Jaaboub lhoussain",
          "Nb_Reviews": 1,
          "Date": "2021-04-29T22:17:02.000Z",
          "Titre": "No problem",
          "Contenu": "hello I have bought an ssl certificate. There is no problem for the moment.Only, it's difficult to find your website and it's not easy to use it. I think it will be better if you improve UI/UX interface.Cordially"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "C Coxon",
          "Nb_Reviews": 6,
          "Date": "2020-05-16T16:53:04.000Z",
          "Titre": "Amazing Value - Only slightly complicated",
          "Contenu": "I was dubious about buying such cheap SSL certificates from an unknown source, but as they were so cheap (4 years for less than £15) I thought I would give them a go, half expecting it to be a scam. When I passed the certificates on to my webmaster, they got back to me saying that the certificates were invalid, at which point I was pretty sure I had been scammed, especially as I had since read a few scathing reviews. However, I'm glad I persevered, as it was just a problem with the validation process. It took a few emails back and forth between my webmaster and SSls.com before we finally got it sorted out, but it was worth the little bit of extra work to get SSL certs at such an amazing price. SSLs.com customer service team were really quick to respond to my emails and sort it out as well. If you're willing to put in the work, I would highly recommend."
        },
        {
          "Note": 4,
          "Lieu": "LB",
          "Pseudo": "Albert Zakhia",
          "Nb_Reviews": 1,
          "Date": "2021-05-12T08:09:20.000Z",
          "Titre": "Support is good",
          "Contenu": "Support is good, processing time is slow... if you are renewing at the end of your period, know you will be disrupted for many days..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Lumpp",
          "Nb_Reviews": 2,
          "Date": "2021-05-11T15:52:20.000Z",
          "Titre": "SSLs.com is a great resource for…",
          "Contenu": "SSLs.com is a great resource for reasonably priced certs. Service is excellent and the purchase process is hassle free."
        },
        {
          "Note": 4,
          "Lieu": "AE",
          "Pseudo": "ARULRAJ KARUPPASAMY",
          "Nb_Reviews": 1,
          "Date": "2021-05-11T16:20:08.000Z",
          "Titre": "Very good",
          "Contenu": "Very good. Easy to install and more helpful with cheapest one. Customer support team are more friendly"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Kuldeep John",
          "Nb_Reviews": 1,
          "Date": "2021-05-17T16:02:39.000Z",
          "Titre": "We are using this service from past one…",
          "Contenu": "We are using this service from past one year and we have enjoyed it. Keep it up"
        },
        {
          "Note": 4,
          "Lieu": "ID",
          "Pseudo": "zainul",
          "Nb_Reviews": 1,
          "Date": "2023-02-09T14:34:57.000Z",
          "Titre": "fast delivery and simple operation"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Michel Matthey",
          "Nb_Reviews": 3,
          "Date": "2021-05-11T16:06:10.000Z",
          "Titre": "Very easy compared to others I tried to…",
          "Contenu": "Very easy compared to others I tried to use, Well done!"
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Gerard Schrago",
          "Nb_Reviews": 2,
          "Date": "2021-05-12T06:49:28.000Z",
          "Titre": "Things went on accordingly"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Avni K",
          "Nb_Reviews": 3,
          "Date": "2021-04-30T10:20:18.000Z",
          "Titre": "good experience"
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Patrick Ho",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T18:06:34.000Z",
          "Titre": "Very competitive price, superb support",
          "Contenu": "Very speedy response to help me get up and running - even when I was just on trial.  So I made my decision to switch to full version shortly after 24hrs, as everything was running smoothly as intended.  Thank you SSL team for the quick act and support.  Awesome job!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T07:59:14.000Z",
          "Titre": "Easy, smooth and inexpensive",
          "Contenu": "Easy, smooth and inexpensive, should have looked up ssls.com sooner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Heather Morris",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T23:41:48.000Z",
          "Titre": "Have been satisfied purchasing certificates for at least 5 years.",
          "Contenu": "We've been using SSLs.com to purchase certificates for all of our client web applications.   It has ALWAYS been a great experience and the couple of times I got hung up over the years, their chat support was very helpful."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Quande",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T05:43:52.000Z",
          "Titre": "You make the complex task very simple",
          "Contenu": "You make the complex task very simple! I like your way of dealing with customer needs!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Simon Carter",
          "Nb_Reviews": 31,
          "Date": "2023-12-01T20:45:54.000Z",
          "Titre": "I have bought several certificates…",
          "Contenu": "I have bought several certificates through this company, always good value and comes with great support.I know I will use them again and wouldn't hesitate to recommend them"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Carl",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T13:57:47.000Z",
          "Titre": "SSL certificates at a great price!",
          "Contenu": "SSLs at a great price! Get a basic SSL certificate at a great price as long as you know how to hook it all up, I'm very glad I stumbled upon this site! Thanks"
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Roman",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T08:49:44.000Z",
          "Titre": "Good service with minimal user involvement.",
          "Contenu": "I found a quick solution to the problem, and the technical team helped me get through all the difficulties that arose in the process. support is sufficiently qualified in this environment. thank you."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "PennyWasher",
          "Nb_Reviews": 28,
          "Date": "2023-11-16T12:25:24.000Z",
          "Titre": "Great Price - Great Support ( unlike zero ssl! )",
          "Contenu": "after terrible customer service from zero ssl - I first tried these guys on a less critical website and it was super easy ! now running 2 other business sites and the price is great, and the support is excellent"
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T09:34:09.000Z",
          "Titre": "Amazing",
          "Contenu": "Your on-boarding process for buying and setting up a new cert was incredibly fast and easy to use. It's so rare these days to find a top-tier experience matched with rock bottom prices. Keep up the great work!"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Eoin",
          "Nb_Reviews": 2,
          "Date": "2023-10-04T09:15:32.000Z",
          "Titre": "Affordable, responsive and secure!",
          "Contenu": "Really helpful with my SSL certificate needs. Their instructions were clear enough for me to be able to carry out the necessary steps myself, but as I was very busy and wanted to make sure I made no errors, I opted for the option to pay them for installation. It was secure and extremely quick - they responded and had it done within minutes! Both the SSL cert and the optional installation service were very affordable. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T12:36:46.000Z",
          "Titre": "Great effort",
          "Contenu": "Great effort, ease of useRegardsVikram Agarwal"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T18:10:45.000Z",
          "Titre": "Simplistic way to get an SSL / TLS Certificate",
          "Contenu": "The most Simplistic way to get an SSL/TLS Certificate.This was the easiest way by far. I will be getting all my Certificates from SSLs.com in the future.Thanks You...."
        },
        {
          "Note": 5,
          "Lieu": "HR",
          "Pseudo": "David Blažević",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T23:00:40.000Z",
          "Titre": "Fast, secure and works great on networking equipment",
          "Contenu": "Fast, secure and works great for routers and firewalls, installed a cert on my Cisco ASA running AnyConnect in 10 minutes from ordering, works great. I would suggest SSLs.com for everyone having a need above of entry level Let'sEncrypt certs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "FranzG",
          "Nb_Reviews": 4,
          "Date": "2023-12-16T08:54:11.000Z",
          "Titre": "A+ Service",
          "Contenu": "A+ Service, Fast and Reliable"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Rafael Soffer",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T04:04:04.000Z",
          "Titre": "Perfect and quick service!",
          "Contenu": "Perfect and quick service!Thank you for your help!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Musumeci",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T05:05:26.000Z",
          "Titre": "Very receptive and had the knowledge to…",
          "Contenu": "Very receptive and had the knowledge to quickly assist me. Much better than the past"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Riccardo Finotti",
          "Nb_Reviews": 4,
          "Date": "2023-11-02T15:43:02.000Z",
          "Titre": "Great and Customer Service",
          "Contenu": "I've contacted the Customer Service via Chat  and they promptly respond.it is always great because they will resolve any issue for sure."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T20:49:52.000Z",
          "Titre": "easy",
          "Contenu": "easy, fast and affordable"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T00:54:53.000Z",
          "Titre": "Easy purchase",
          "Contenu": "Easy purchase, straight forward installation, reasonable price.  What more could you ask for!  :)"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Happy VPS Man",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T17:29:27.000Z",
          "Titre": "Straightforward",
          "Contenu": "Very easy and straightforward to setup, and cost-effective.  I have no idea why I would go back to my old provider at this point."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Chris",
          "Nb_Reviews": 6,
          "Date": "2023-03-03T10:07:41.000Z",
          "Titre": "Without any doubt THE best help desk…",
          "Contenu": "Without any doubt THE best help desk session in c.35 years. Patient, tolerant, persistent, creative even.  I was more than ready to give up, it had turned into one of those seemingly bottomless pits of unrelenting errors; it happens sometimes with even relatively 'simple' procedures.  But the help bloke soldiered on. All credit to him."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeas",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T06:41:31.000Z",
          "Titre": "Quick and efficient",
          "Contenu": "I recently used SSLs.com for securing my website, and I must say that I was highly impressed with their service. The process was quick and efficient, and the quality of service was excellent. I had my SSL certificate up and running in no time. Overall, a great experience with SSLs.com!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "GURUPRITSINGH SAINI",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T14:11:13.000Z",
          "Titre": "Best SSL Certificate Provider",
          "Contenu": "Best SSL Certificate Provider and I always selecte SSLs.com for my own websites and all of our clients' website and easy to use and very good experience working with them."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Peter Thomas",
          "Nb_Reviews": 2,
          "Date": "2023-10-19T12:29:32.000Z",
          "Titre": "Staff are always great and well…",
          "Contenu": "Staff are always great and well informed.Would recommend every time. Only problem is expensive when letsencrypt is free."
        },
        {
          "Note": 5,
          "Lieu": "HR",
          "Pseudo": "Drazen",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T14:27:43.000Z",
          "Titre": "Very good experience",
          "Contenu": "Very good price with great, simple and useful guidelines for certificate implementation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Allen",
          "Nb_Reviews": 3,
          "Date": "2023-06-01T01:42:05.000Z",
          "Titre": "I have used SSLs.com in the past to get certs.",
          "Contenu": "I have used SSLs.com in the past to get SSL Certs for websites I have managed. Getting the cert is easy and they have plenty of documentation on the various server installs. Customer service support is the best. Anyone needing SSL for your website should definitely look into SSLS.com"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Maurice Bent",
          "Nb_Reviews": 1,
          "Date": "2022-05-16T18:40:45.000Z",
          "Titre": "Great for Tomcat servers",
          "Contenu": "I have previously been installing 90 day free certificates and - being a Tomcat user (Java) I've always had to manually install the certifcates so am well versed in the process. I took the free trial of SSLs 1 year cerificates - which was a brilliant idea. I may have had second thoughts if I'd have had to pay for 5 years upfront with an untested cert.Anyway - long story short, the new Cert was installed in under 10 mins from receiving the download and now I don't have to worry about anything for a whole 12 months - pure bliss for under $4/year. Get yours now before the offer price ends (assuming it will end at some point)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Barcelon Lee",
          "Nb_Reviews": 1,
          "Date": "2023-09-17T20:41:19.000Z",
          "Titre": "Two words",
          "Contenu": "Two words. Great Support!I really appreciate the patience that they showed me resolving the issue of now knowing how to install the certificate I bought!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "A Kerr",
          "Nb_Reviews": 3,
          "Date": "2023-08-13T22:38:30.000Z",
          "Titre": "Issue with the Certificate",
          "Contenu": "I had an issue with the issuance of a certificate which turned out to be because I had not followed the instructions. EMailed Support at 21:30 on a Sunday night and the issue was resolved in 10 minutes.Amazing Service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keynon Lannom",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T20:25:54.000Z",
          "Titre": "Good price and great service - support always rocks!",
          "Contenu": "Have used SSLs.com for years and have always had excellent customer service. When needed support has always been quick to respond and got the job done. Use SSLs.com for all my SSL needs - Thank you team for such a great job! Good price, great service!"
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "TB",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T21:52:43.000Z",
          "Titre": "Very helpful guys and with a lot of…",
          "Contenu": "Very helpful guys and with a lot of patience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rocky Castaneda",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T17:32:59.000Z",
          "Titre": "The process was totally painless",
          "Contenu": "The process was totally painless.  They have examples on how to implement it on different web servers as well.  It is like having them handhold you every step of the way."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ross",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T15:11:36.000Z",
          "Titre": "I would SE this company religiously",
          "Contenu": "I would SE this company religiously. Awesome no issues at all. Tech support is very active"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JC",
          "Nb_Reviews": 6,
          "Date": "2023-08-01T16:45:55.000Z",
          "Titre": "Fast!",
          "Contenu": "Great simple website to get your SSL certificate in minutes. No fluff no upsale and customer service was fast and friendly.For sure will use their services again in the future"
        },
        {
          "Note": 5,
          "Lieu": "TZ",
          "Pseudo": "Jafari Ndembo",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T19:45:08.000Z",
          "Titre": "Supportive",
          "Contenu": "They are active to help you anytime"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Eric Girard",
          "Nb_Reviews": 3,
          "Date": "2023-03-02T02:16:29.000Z",
          "Titre": "Fast, easy and enjoyable experience",
          "Contenu": "One of the easiest site I used to buy and create an SSL certificate.  Fast, easy and quick processing made for a great experience.   This is the first site that I use that allow online CSR generation and the step-by-step procedure to enter a DNS challenge, validate it and get the certificate is super easy to follow"
        },
        {
          "Note": 5,
          "Lieu": "CZ",
          "Pseudo": "PaWell",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T22:09:34.000Z",
          "Titre": "Great service & support",
          "Contenu": "Some minor issues with my CSR were promptly and greatly addressed by SSLs's support team. Thank you for quick and awesome help."
        },
        {
          "Note": 5,
          "Lieu": "MU",
          "Pseudo": "Fawrez Baboo",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T09:52:17.000Z",
          "Titre": "The assistance was very polite and…",
          "Contenu": "The assistance was very polite and solution provided reply to my request"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Michael Brown",
          "Nb_Reviews": 2,
          "Date": "2022-01-25T17:24:42.000Z",
          "Titre": "Security you can trust",
          "Contenu": "I was introduced to SSLs.com from a tech guy and I appreciate now the different levels of protection an SSL Certificate can provide my web site. There are different levels of security and with the precautions and care that SSLs.com uses I know that they take my business and protection seriously"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T17:51:50.000Z",
          "Titre": "SSL certificates from SSLS vs NetworkSolutions",
          "Contenu": "I purchased SSL certificates from Network Solutions and from SSLS.  I had questions I used Chat for and the level of support and ability to solve my issues was much better experience with SSLS"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Olivier Dujardin",
          "Nb_Reviews": 4,
          "Date": "2022-04-07T16:16:33.000Z",
          "Titre": "Prompt and clear assistance",
          "Contenu": "Prompt and clear assistanceI needed some advice on the type of SSL certs I needed to get my HTTPs going thinking I had a self signed, but the support replied promptly with precise info and a clear video showing me how to complete the SSL activation on cpanel. Sure enough, I got it right then. Your support could have sold me a more expensive cert and it did not. So for all of this, I rate 5 stars. Great job :)"
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Kevin",
          "Nb_Reviews": 8,
          "Date": "2022-01-27T18:37:30.000Z",
          "Titre": "Much easier than expected!",
          "Contenu": "I've been meaning to install an SSL certificate for a while now on my Wordpress website, but the yearly price from Godaddy and the difficulty put me off.I finally decided to bit the bullet and did it, and the purchase and procedure with SSLs to install was really easy, much easier than expected due to helpful video and instructions, so thanks.Of course, the price for 5 years makes it a pretty good deal and i'm sure the yearly certificate renewals won't be too difficult"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joel Levin",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T22:03:40.000Z",
          "Titre": "Extremely helpful technical support",
          "Contenu": "My assistant (Iryna Polishko) was extremely patient and helpful, which made the process that I usually dread a pleasant one."
        },
        {
          "Note": 5,
          "Lieu": "SI",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T10:32:13.000Z",
          "Titre": "It is great that they offer free trial…",
          "Contenu": "It is great that they offer free trial - no credit card is needed for trial to start at all."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Jo Gon",
          "Nb_Reviews": 2,
          "Date": "2023-09-30T01:38:58.000Z",
          "Titre": "Excellent support",
          "Contenu": "Excellent support, congrats to Vladyslav Shevchenko for all your effort in helping me... Best regards!!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Rushikesh PAtel",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T20:52:21.000Z",
          "Titre": "Awesome step-by-step guidance"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hang Five Paragrip.com",
          "Nb_Reviews": 1,
          "Date": "2022-12-31T22:40:33.000Z",
          "Titre": "Very fast and easy to setup",
          "Contenu": "Very fast and easy to setup. My site was secured within minutes. The price is better than I can get from hosting provider. Excellent communication via email during the generation of SSL certificate & key, to installation."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "gewoondemax",
          "Nb_Reviews": 24,
          "Date": "2022-02-21T19:00:05.000Z",
          "Titre": "SSLs.com a good support",
          "Contenu": "While banned from ZeroSSL free account due to exceed the max of 3, I had to go to basic for 10 dollars a month. For a hobby this is to much! So I started my search for a cheap and trustworthy SSL company which brought me to SSLs.com! The differences… All you can think of!A good aftersales, they do understand you! A perfect and FAST Support! And this all for almost nothing … 5 dollars a year … I hope they keep it as good as is!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T19:26:41.000Z",
          "Titre": "I needed some help from Support and…",
          "Contenu": "I needed some help from Support and they were quick to reply and helped me solve the problem.I do think that the install steps are a little confusing. When I copied the email confirm code to my clipboard the site asked if I copied it. I said yes and it went green. But the code was on my clipboard not pasted into the form on that site. I thought the site just saw it on the clipboard.If it goes green, it should actually run a check. Maybe the language could change to not say Copied, but say did you complete going to the form and paste the code or something more clear. I waited about 3 hours for the page to \"authenticate\" and it was just not a clear message. That said the price and support was excellent."
        },
        {
          "Note": 5,
          "Lieu": "TH",
          "Pseudo": "MIKE",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T06:09:24.000Z",
          "Titre": "The support team is very helpful and…",
          "Contenu": "The support team is very helpful and ready to support all kinds of problems faced by the customers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom B.",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T18:11:42.000Z",
          "Titre": "A complicated task made much simpler",
          "Contenu": "I was new at setting up ssl and your team helped me correct my mistakes and get the results I was looking for."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Clif Edwards",
          "Nb_Reviews": 2,
          "Date": "2022-01-26T17:11:34.000Z",
          "Titre": "I was on hold with my hosting company…",
          "Contenu": "I was on hold with my hosting company asking for hundreds of dollars to add an SSL and added this SSL while on hold and bypassed the expense... worked immediately (after propagating for an hour) and was a great experience."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T09:59:37.000Z",
          "Titre": "Excellent Customer Service",
          "Contenu": "Customer Service worked with me to ensure I had the correct SSL Certificate for my needs. I appreciated the effort."
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "genmi",
          "Nb_Reviews": 1,
          "Date": "2022-04-28T18:45:08.243Z",
          "Titre": "Installed SSL using online help",
          "Contenu": "Installed SSL using online help. Helped very professionally and quickly. The certificate works, the site opens via https without any problems."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andy R",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T19:03:32.000Z",
          "Titre": "Very simple for what can be a complex…",
          "Contenu": "Very simple for what can be a complex subject, and the free trial was very useful to make sure everything was compatible with my configuration"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Oz Review Style",
          "Nb_Reviews": 9,
          "Date": "2022-11-02T23:17:41.000Z",
          "Titre": "Fantastic service from Anastasiaa-…",
          "Contenu": "Fantastic service from Anastasiaa- Quick responsive, had my SSL certificate purchased and installed in under 30 mins. Such a great service and the secure installation service was huge bonus.Thanks- will use you again, Highly recommend SSLS.com"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-02T21:04:48.000Z",
          "Titre": "24/7 tech support walked me through…",
          "Contenu": "24/7 tech support walked me through every single step of the process! When I say every single step, I mean every single step! I was amazed with the 1 on 1 personal support you guys gave me. 2nd to none! I am a customer for life and will always recommend you to other looking for SSLs! Thank you SO MUCH!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pablo Cedeño",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T21:59:19.000Z",
          "Titre": "Good job",
          "Contenu": "I congratulate you, you have very affordable prices, especially for those professionals who are starting their own business where they cannot afford expensive certificates. Then as the company grows or carries out renewals with better certificates, I will postpone doing it with you."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Nick",
          "Nb_Reviews": 23,
          "Date": "2022-02-15T17:04:27.000Z",
          "Titre": "Good price and effortless interface",
          "Contenu": "Purchased and deployed a new wildcard ssl certificate today, and with the web interface being well thought out, the process was painless and straightforward. Prices are in the right ballpark compared to others. Recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Clint C",
          "Nb_Reviews": 3,
          "Date": "2023-11-09T07:43:06.000Z",
          "Titre": "SSLs.com is super easy to use!!",
          "Contenu": "SSLs.com is super easy to use and you can’t beat the price!  I purchased a cert and it installed on my site in less than 10 mins."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "JImmy",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T15:31:08.000Z",
          "Titre": "Everything was perfect",
          "Contenu": "Everything was perfect.  This was the simplest quickest without any need to beg and jump through hoops experience."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Sergio",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:56:28.000Z",
          "Titre": "Fast",
          "Contenu": "Fast , big help"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T23:46:00.000Z",
          "Titre": "Piece of Cake for DIY",
          "Contenu": "Pretty easy to get it taken care of ... I have limited knowledge, but following the video guides made it very easy for installing.  Saved me about $150 over other \"managed\" systems.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Nico Vanhouttem",
          "Nb_Reviews": 1,
          "Date": "2022-06-03T16:55:07.000Z",
          "Titre": "Nicely explained how to install the…",
          "Contenu": "Nicely explained how to install the certificate on the website in steps. After that, my SSL certificate worked fine. I am very satisfied with it."
        },
        {
          "Note": 5,
          "Lieu": "NO",
          "Pseudo": "Dag Einar",
          "Nb_Reviews": 2,
          "Date": "2023-09-18T09:36:12.000Z",
          "Titre": "Worked well and the pricing was much…",
          "Contenu": "Worked well and the pricing was much better than the last supplier could offer."
        },
        {
          "Note": 5,
          "Lieu": "QA",
          "Pseudo": "yasser",
          "Nb_Reviews": 2,
          "Date": "2022-05-24T20:01:50.000Z",
          "Titre": "im happy With new SSL certificate",
          "Contenu": "im happy With new SSL certificate I advise everyone to secure their sites for confidenceIn addition, the price is very cheap and reasonable for everyone"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T16:36:09.000Z",
          "Titre": "Very easy process to create the…",
          "Contenu": "Very easy process to create the certificates."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "David Levi",
          "Nb_Reviews": 3,
          "Date": "2023-09-28T13:55:31.000Z",
          "Titre": "A Shoutout to Alex Kovalov from SSls.com for Exceptional Service",
          "Contenu": "I wanted to take a moment to express my heartfelt appreciation for the outstanding service I received from Alex Kovalov today. It's not every day that you encounter such dedication and professionalism, and I wanted to ensure that Alex's exceptional efforts are recognized.Alex went above and beyond to assist me with my truck pilot needs. His knowledge, attention to detail, and willingness to answer all of my questions made the entire process incredibly smooth. He truly embodies what it means to provide top-notch customer service.I was particularly impressed by Alex's ability to promptly address any concerns and provide me with comprehensive solutions tailored to my requirements. His dedication to ensuring my satisfaction was evident throughout our interaction.Alex's exceptional service today not only resolved my immediate needs but also left a lasting positive impression of SSls.com. I'm delighted to have had the opportunity to work with him, and I will certainly recommend SSls.com to others based on this outstanding experience.Please extend my sincere gratitude to Alex Kovalov for his remarkable assistance. His professionalism, expertise, and dedication reflect positively on your organization.Thank you once again for providing exceptional service, and I look forward to engaging with SSls.com in the future."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "DB",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T05:33:53.000Z",
          "Titre": "Very cheap SSL Certs",
          "Contenu": "Very cheap SSL Certs. Yes Lets Encrypt is free, but the amount of trouble to setup machines to create an LE cert vs a few dollars a year. Excellent! Will use again!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T16:51:57.000Z",
          "Titre": "very fast to get ssl also very…",
          "Contenu": "very fast to get ssl also very affordable price compared to others."
        },
        {
          "Note": 5,
          "Lieu": "TW",
          "Pseudo": "蔡文宗",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T05:08:31.000Z",
          "Titre": "Good Services",
          "Contenu": "Quick response, emphasis on customer feedback."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Jorge Arenas",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T19:27:25.000Z",
          "Titre": "Fast and Efficient",
          "Contenu": "Fast and Efficient , this is how chat support must work ever! Thanks for the help! Artyom Garanich and Kateryna Zubko"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Danie",
          "Nb_Reviews": 1,
          "Date": "2022-07-18T18:48:49.000Z",
          "Titre": "What a pleasure",
          "Contenu": "What a pleasure. Easy, straight-foward, no hassles. Able to generate the necessary certificate within a minimal time window (given I was in a position where a needed it soon)."
        },
        {
          "Note": 5,
          "Lieu": "KE",
          "Pseudo": "David Junior",
          "Nb_Reviews": 1,
          "Date": "2022-02-15T13:16:13.000Z",
          "Titre": "Amazing Service!",
          "Contenu": "Amazing Service!This is a great website to purchase an SSL certificate from. It is fast, affordable, user-friendly, and has great customer service. I would definitely recommend it to everyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pawan Kumar",
          "Nb_Reviews": 2,
          "Date": "2022-10-13T03:03:51.000Z",
          "Titre": "Cheap and awesome",
          "Contenu": "I have used them twice. Very cheap certificates. Smooth process. I was paying ten times for exactly the same certs earlier."
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Nkemakonam",
          "Nb_Reviews": 3,
          "Date": "2023-11-20T13:59:08.000Z",
          "Titre": "Its a good one i recommend",
          "Contenu": "Its a good one i recommend. It's 5yrs is of great value and helps you save"
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "Martin",
          "Nb_Reviews": 8,
          "Date": "2022-03-15T16:13:25.000Z",
          "Titre": "The easiest way to have an SSL cert'",
          "Contenu": "Why oh why did I not buy my SSL certificate from SSLs.com before, I've saved so much money and it was so simple with their easy to follow video."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T22:03:33.000Z",
          "Titre": "Great price fast issued and good…",
          "Contenu": "Great price fast issued and good support articles"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Raj Dutta",
          "Nb_Reviews": 2,
          "Date": "2023-11-18T03:39:58.000Z",
          "Titre": "Quick suppert",
          "Contenu": "Quick suppert , no waiting , great understading of issue .Best resolution"
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "Arik",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T11:11:11.000Z",
          "Titre": "Worth every dollar",
          "Contenu": "Great price, amazing technical (human chat) support!Thank you...."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "sf",
          "Nb_Reviews": 3,
          "Date": "2023-11-13T10:04:22.000Z",
          "Titre": "Perfect service, as always.",
          "Contenu": "Everything perfectly OK. Kind & fast response!"
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "Francisco José Reis Costa",
          "Nb_Reviews": 2,
          "Date": "2022-03-18T16:56:40.000Z",
          "Titre": "Security above all",
          "Contenu": "I bought an SSL certificate, once you buy the certificate you will need to prove that you own or have at least some administrative access to the site where you will install the certificate, the instructions for that are provided, but these steps prove how this company is worried about security.Instructions for the installation of the certificate are also provided."
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "Shimon",
          "Nb_Reviews": 1,
          "Date": "2023-06-04T08:07:17.000Z",
          "Titre": "Best cert at lowest price",
          "Contenu": "The purchase was quick and intuitive, and the cert price seems to be the lowest possible.Thanks a lot!"
        },
        {
          "Note": 5,
          "Lieu": "LK",
          "Pseudo": "Supun Nimantha",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T17:44:07.000Z",
          "Titre": "I had great support from customer…",
          "Contenu": "I had great support from customer support service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Martín Zabala",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T19:00:19.000Z",
          "Titre": "Easiest and cheapest",
          "Contenu": "That is very sheap and very easy in the implementation. Thanks team!"
        },
        {
          "Note": 5,
          "Lieu": "SA",
          "Pseudo": "Nabil Mulla",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T14:09:02.000Z",
          "Titre": "Great buying experience",
          "Contenu": "Great buying experience, tried the certificates first and then went on to purchase it."
        },
        {
          "Note": 5,
          "Lieu": "VN",
          "Pseudo": "Thierry",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T07:15:31.000Z",
          "Titre": "Very Good and Reliable Site for SSLs",
          "Contenu": "Very Good and Reliable Site for SSLs. I have not been looking elsewhere since then."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Merbin Joe",
          "Nb_Reviews": 1,
          "Date": "2022-06-30T19:12:43.000Z",
          "Titre": "This is very good",
          "Contenu": "Thank you very much for this much cheaper price. I was searching long time for this much price, but lately only I found it.I am using this for my website on GoDaddy and this is very easier to install."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Projeto Mybets",
          "Nb_Reviews": 1,
          "Date": "2022-06-06T19:28:40.000Z",
          "Titre": "Objective, Simple and Very Well Documented",
          "Contenu": "The service, could not be better!!!Objective, Simple and Very Well Documented...Thank You so much"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ernest",
          "Nb_Reviews": 5,
          "Date": "2023-08-06T13:14:38.000Z",
          "Titre": "Great user experience!",
          "Contenu": "Great and user friendly experience in buying my various SSLs. A++"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Unknown",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T19:13:30.000Z",
          "Titre": "The ability to trial an SSL cert is…",
          "Contenu": "The ability to trial an SSL cert is fantastic."
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "home_user",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T17:37:44.000Z",
          "Titre": "Quick and Simple",
          "Contenu": "A quick and simple way to get a certificate. Process works exactly as advertised."
        },
        {
          "Note": 5,
          "Lieu": "HR",
          "Pseudo": "Tom",
          "Nb_Reviews": 3,
          "Date": "2022-04-15T21:09:34.000Z",
          "Titre": "A really good experience",
          "Contenu": "A really good experience. There are some steps to do, but each step is explained very clearly and in detail."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T19:04:03.000Z",
          "Titre": "The actention from support",
          "Contenu": "The actention from support, patient tô explain for solution and quickly tô response"
        },
        {
          "Note": 5,
          "Lieu": "MY",
          "Pseudo": "Saad",
          "Nb_Reviews": 2,
          "Date": "2023-01-04T04:54:31.000Z",
          "Titre": "SSL was a set back for me",
          "Contenu": "SSL was a set back for me, SSLs made it easy affordable.I wish SSLs make clear instraction how to install the SSL"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Pater Lane",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T01:03:06.000Z",
          "Titre": "The interface was intuitive and when I…",
          "Contenu": "The interface was intuitive and when I ran into a slight problem, do to a choice I had made, the support online was almost instantaneous and had the problem resolved in minutes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard D",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T22:44:13.000Z",
          "Titre": "Outstanding Service and Support!",
          "Contenu": "They were very knowledgeable about my PositiveSSL Wildcard certificate and helped me to figure out the issue with the Intermediate Certificate Chain. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T19:01:21.000Z",
          "Titre": "It just works!",
          "Contenu": "Easy, cheap and quick"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Marcus Kim",
          "Nb_Reviews": 1,
          "Date": "2022-05-19T21:59:08.000Z",
          "Titre": "Having a chance of domain validation before payment as a free use",
          "Contenu": "I am satisfied with having a chance of domain validation before payment as a free use. It was a very importance step for my confirmation procedure"
        },
        {
          "Note": 5,
          "Lieu": "BH",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T12:16:30.000Z",
          "Titre": "Great...anf...really sim0le of…",
          "Contenu": "Great...anf...really sim0le of configuration and attached"
        }
      ]
    }
  ]
}