{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "supercraft.host",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anthony Williams",
          "Nb_Reviews": 2,
          "Date": "2023-11-05T19:07:53.000Z",
          "Titre": "PLEASE READ BEFORE YOU BUY",
          "Contenu": "Server worked for 3 days before issues started, Tried to do the support by email, and they don't respond back until a day later and didn't help with the issue really. Tried to do a support ticket through the discord server and they couldn't even find out why one of the issues was occurring (the server wouldn't start). I had to go in myself and find a fix for 2 out of the 3 issues. The 3rd issue was the biggest one and they asked a senior support person for help. That person never responded and 7 days went by without a response or a fix to it and they just closed and deleted the ticket. I emailed them asking for my money back and they told be that since 7 days already went by of using the service, I cannot get a refund back. I responded with, we only used the server for 3 days before issues started happening and we couldn't even log on to the server and it takes forever to get a respond back just for y'all to not fix the issues I am having with the server, and then you delete the discord ticket I had. I have yet to get a follow up email about the refund. One of the worst experience I have ever had and it was very stressful. I was never once mean or had an attitude with them but at a certain point I had to get a bit assertive to try and get some kind or resolution, which I did not get. Do not use them. So many other better hosting site out there. If you do use them I wish you good luck, and Supercraft I wish you well."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jon",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T03:09:56.000Z",
          "Titre": "If you want a server that crashes…",
          "Contenu": "If you want a server that crashes everyday and where they don't respond to any tickets, this is your host!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Justin Mead",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T02:50:00.000Z",
          "Titre": "Servers have been down for multiple…",
          "Contenu": "Servers have been down for multiple days. Tech support not available during North America peak gaming hours.  Support staff tell you that there is nothing they can do till the tech support staff wakes up...all while their entire community is offline."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gizmo",
          "Nb_Reviews": 1,
          "Date": "2021-10-29T07:40:38.000Z",
          "Titre": "I had the worst experience with the…",
          "Contenu": "I had the worst experience with the hosting company, By far the most disrespectful unprofessional service out there. I'm very glad I chose to get a refund, definitely won't be returning!You say it like it took place for a hour or something it was instant  literally seconds after I made the ticket you guys forced closed the server and kicked me out of the panel and no warning or anything just blocked me from the files so I couldn't grab a file I made. No one even attempted to talk to me about why I was wanting a refund or anything. Very unprofessional in the support emails all in all terrible service provider."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian Burow",
          "Nb_Reviews": 2,
          "Date": "2022-08-06T01:31:01.000Z",
          "Titre": "Extremely disappointed that I have to…",
          "Contenu": "Extremely disappointed that I have to purchase a premium server in order to have ftp or file manager access.  I found another host that is about the same price and gives me both ftp and file manager access for no extra fees."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-06-05T09:05:17.000Z",
          "Titre": "I never used the service....",
          "Contenu": "I never used the service..... I couldn't get the server to work with mods and immediately asked for a refund (which was annoying enough to figure out how to do.) and never received any email in return."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jake",
          "Nb_Reviews": 1,
          "Date": "2022-02-15T07:13:57.000Z",
          "Titre": "Service email was never responded to",
          "Contenu": "Service email was never responded to. Server was unable to load the single mod i had installed, when i purchased a server that was supposed to be capable of installing and loading said mod."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mojo",
          "Nb_Reviews": 1,
          "Date": "2021-04-28T10:27:17.000Z",
          "Titre": "Pathetic",
          "Contenu": "Pathetic ! No one that runs a honest 7 dtd server wants your service! Boycott would better idea"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-05T00:39:18.000Z",
          "Titre": "Couldn't get past the first blood moon…",
          "Contenu": "Couldn't get past the first blood moon without the server crashing"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-04-13T02:16:02.000Z",
          "Titre": "Can't login and have submit and tried…",
          "Contenu": "Can't login and have submit and tried to contact with no help"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-12-31T23:27:34.000Z",
          "Titre": "I could not get help setting up a server"
        },
        {
          "Note": 1,
          "Lieu": "SK",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-06-04T23:41:33.000Z",
          "Titre": "Bad servers",
          "Contenu": "Bad servers. Lags"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carlh",
          "Nb_Reviews": 4,
          "Date": "2021-12-20T18:05:41.000Z",
          "Titre": "not able to use botman or csmm."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-10-18T11:54:22.000Z",
          "Titre": "Never got it to work"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "jourdon",
          "Nb_Reviews": 1,
          "Date": "2023-01-02T16:08:30.000Z",
          "Titre": "Everytime I go to play my ping says…",
          "Contenu": "Everytime I go to play my ping says 150ish, log in and the lag get tremendously worse. As I get off my ping says 1600 or higher. Makes the game unplayable."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-10-26T05:00:34.000Z",
          "Titre": "Lagging on every blood moon - 6 players on M plan",
          "Contenu": "Been renting a server with the M plan for the past few weeks. Very easy to set up. Playing on the Navezgane map. Things ran fine for the first two weeks, but in the last week we (up to only 6 players) have been experiencing consistent server lag during the blood moons (client FPS is fine, but zombies are unresponsive/walking in place). Looking at the server status during those periods, it seems to be rarely above 6% utilization.Looking at the support channel on discord, it seems like people complaining about lag are pretty much ignored, which is not encouraging. Will cancel my subscription"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-10-22T17:39:54.000Z",
          "Titre": "Okay",
          "Contenu": "Okay. Here is the strait and narrow. Usability is easy and great, however, support is awful. Tried discord, tried email, nothing. Server was down and lost some progress somehow, then boots me out during blood moons so I had to dial down the difficulty. Once my data is saved and transferred, I’m out."
        },
        {
          "Note": 2,
          "Lieu": "JP",
          "Pseudo": "Jay Sea Jay Sea",
          "Nb_Reviews": 1,
          "Date": "2021-07-29T16:52:33.000Z",
          "Titre": "This review relates to 7 Days to Die…",
          "Contenu": "This review relates to 7 Days to Die set-up.Supercraft provides a solution for users who want a simple and hassle free experience but...- There appears to be no crash script or timed server restart option. This is an absolutely fundamental requirement for 7D2D. Performing a shutdown prompt typically initiates a server host restart script but this was not the case.- While it is acceptable that the Web Control Panel Port is turned off as other options are available, it would help to know the port number that was set for it to enable an option like Allocs Map.- It is not possible to upload Prefabs for custom buildings. Running them via a Mod can cause some severe instability and RAM spikes.- Not all of the server configuration settings are available or properly configured such as reserved Client/Admin slots. These are fundamental for communities.I bought into two statements on the website:1. \"In our custom-built panel for 7D2D we expose all configuration parameters available in game files.\"'ALL' infers 100% of what is typically available and this was clearly incorrect and totally misleading.2. \"Use File Manager in our Control Panel to manage files on the server.\"File Manager is an upload feature which allows Mods and a World to be uploaded. Once they are uploaded it is not possible to 'manage' the files on the server beyond deleting them. A File Upload Manager that allows a client to Upload files to the server is a better description.I appreciate this is a relatively new service for Supercraft BUT please ensure what you say is what clients can expect.A 24 hour trial would have allowed these issues to be apparent as they are certainly not documented or clearly introduced on the website. Less than 6 hours into subscribing, I have deleted further subscriptions and deleted my account in the knowledge there will be no refund or fitting solution within an acceptable time frame. I recommended potential clients to visit the Discord advertised on the website and ask the most basic and fundamental questions before subscribing as there are some fundamental features that need to be implemented for even the most casual users."
        },
        {
          "Note": 2,
          "Lieu": "JP",
          "Pseudo": "arramus",
          "Nb_Reviews": 3,
          "Date": "2021-08-06T03:38:50.000Z",
          "Titre": "This review relates to 7 Days to Die…",
          "Contenu": "This review relates to 7 Days to Die set-up. This is an identical review of a previous one, where this has been prompted by an email, and the prior was unprompted.Supercraft provides a solution for users who want a simple and hassle free experience but...- There appears to be no crash script or timed server restart option. This is an absolutely fundamental requirement for 7D2D. Performing a shutdown prompt typically initiates a server host restart script but this was not the case.- While it is acceptable that the Web Control Panel Port is turned off as other options are available, it would help to know the port number that was set for it to enable an option like Allocs Map.- It is not possible to upload Prefabs for custom buildings. Running them via a Mod can cause some severe instability and RAM spikes.- Not all of the server configuration settings are available or properly configured such as reserved Client/Admin slots. These are fundamental for communities.I bought into two statements on the website:1. \"In our custom-built panel for 7D2D we expose all configuration parameters available in game files.\"'ALL' infers 100% of what is typically available and this was clearly incorrect and totally misleading.2. \"Use File Manager in our Control Panel to manage files on the server.\"File Manager is an upload feature which allows Mods and a World to be uploaded. Once they are uploaded it is not possible to 'manage' the files on the server beyond deleting them. A File Upload Manager that allows a client to Upload files to the server is a better description.I appreciate this is a relatively new service for Supercraft BUT please ensure what you say is what clients can expect.A 24 hour trial would have allowed these issues to be apparent as they are certainly not documented or clearly introduced on the website. Less than 6 hours into subscribing, I have deleted further subscriptions and deleted my account in the knowledge there will be no refund or fitting solution within an acceptable time frame. I recommend potential clients to visit the Discord advertised on the website and ask the most basic and fundamental questions before subscribing as there are some fundamental features that need to be implemented for even the most casual users."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JWW",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T23:07:37.000Z",
          "Titre": "great company. all options not available",
          "Contenu": "I like the ease of the interface. the random generation preview doesn't work. I can't upload a personal map. I don't know why this is an issue. you don't have all the functionality you get from working in the game directly such as advance terrain choices in a21. I wish all the server options were available. please update these items and I'll update my score."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jumper",
          "Nb_Reviews": 6,
          "Date": "2021-10-20T00:38:23.000Z",
          "Titre": "Great For Beginners",
          "Contenu": "The set up and use is easy for beginners and the price is damn near unbeatable but the fact that they do not support BotMan is making me think of going elsewhere.I sent them an email saying \"Hi  I am having trouble installing the Botman mod.  There are console errors.  It has an extra dll called 0harmony.dll that goes in 7daystodieserver_data/managed but I am unable to install that there.  Can you please install the Botman mod and that dll from this zip?(and provided the link to the zip), thank you\" and they responded with \"Hi, Unfortunately we don't support custom mod's installations.\""
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Travis",
          "Nb_Reviews": 1,
          "Date": "2021-11-02T11:45:30.000Z",
          "Titre": "Had difficulty uploading a pregenerated maps",
          "Contenu": "Had difficulty uploading a KingGen map, and the website’s KingGen map generator wasn’t available. Ended up using one of their maps from the drop down menu."
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-07-16T19:22:50.000Z",
          "Titre": "The servers are really good, but",
          "Contenu": "The servers are really good, no lag, no save problem, nothing at all. It works very good and setup really fast.The \"problem\" come when you want to mod server. For some mod pack YOU HAVE TO buy the hightest plan. You don't need 64 slots ? Shame, buy it or you can't play with your mods. They do say that they can make personnalized plan but when asked they say \"No, this modpack is really heavy you have to buy the biggest plan\". I can understand the need for ram and CPU and the price that come with that, but then don't say you do personnalized plan if we can't have the choice to pay a bit less (Like 5 euro) to just have lesser slot.Most of others site propose things like this.I don't know how to answer, i don't even know if it is possible so i'll edit this message.What i was saying is that it is possible on a lot of other providers, to have less slots and then pay A BIT less. I don't want to pay 6$ but 30 a month for a small group of players is a bit too much. We did found an other provider that has a better offer for us, and are happy about it. Maybe i wasn't really clear whith the \"Like 5 euro\" if was meaning 25$ instead of 30$ for the month. English isn't my first language.Well even if it wasn't very clear about it there was no need to be this aggressive with your answer. I'm pretty happy that we moved to another provider if that the way you answer your client."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John slone",
          "Nb_Reviews": 2,
          "Date": "2023-06-14T18:38:10.000Z",
          "Titre": "no ftp access unless u pay more",
          "Contenu": "Well I do not the concept of I have to buy a expensive plan in order to use ftp I am the type like to edit my own files and use ftp but the lower plans don't offer that so the only thing it let's me do is download the world file and not the configuration if I want to move everything or use it on my PC to test a few things  sorry people"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cyborg Warlock",
          "Nb_Reviews": 3,
          "Date": "2023-11-04T19:10:39.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good. I wish I had a better understanding of how to upload mods to my server. Overall everything is running smoothly. No complaints thus far. If someone could get back to me on how to install mods onto my server that would be great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T05:07:21.000Z",
          "Titre": "Great support team",
          "Contenu": "Fast and timelyVery helpfull"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T22:22:56.000Z",
          "Titre": "Hosting is fine but your map generator…",
          "Contenu": "Hosting is fine but your map generator doesn't work properly. Tested it like 10X and still couldn't get the elevations correct and the Trader enclaves were not fully fenced. Had to generate on my PC and upload."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ian B",
          "Nb_Reviews": 2,
          "Date": "2022-02-14T03:46:03.000Z",
          "Titre": "Turnkey implementation of 7 Days to Die…",
          "Contenu": "Turnkey implementation of 7 Days to Die with some of the major Mods makes getting a server stood up super easy. Only things missing that would make this 5 starts is:a) Ability to register secondary admin accounts by Server so that others could log in to administer the serverb) Web based text editor of some key XML files for customization. Currently need to make mod changes locally and then re-upload which, for some mods, can be very time consuming."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-10-03T19:13:16.000Z",
          "Titre": "Very easy to setup and get running",
          "Contenu": "Very easy to setup and get running. I do have the 16 slot for 7d2d running the mod darkness falls. I've been playing for a couple of weeks on the server and yesterday I started to notice that towards the the end of the blood moon it starts lagging really bad maybe it's with the settings but I've never had issues before. I also have it to restart at 23:00 every day but it doesn't seem to be restarting. Other than that it's a pretty decent for $9 a month"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Merak",
          "Nb_Reviews": 1,
          "Date": "2022-02-16T15:46:28.000Z",
          "Titre": "Solid service, good price.",
          "Contenu": "Can't really give it a full five stars due to some mixups in setting up the server (I got charged for it twice, and I had to contact support on Discord to get it up and running - and to their credit, they got the issues sorted within minutes), but you can't beat it for the price, and it's been pretty much 100% uptime with low ping.  Would recommend!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 3,
          "Date": "2022-06-07T00:05:12.000Z",
          "Titre": "Overall server and gameplay is great, but...",
          "Contenu": "Overall server and gameplay is great. There has been a few times where the server kicked players out and made them restart. As all the players have gaming computers and we all live near each other, I don't know why it would hit one or another and not the group."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Android User",
          "Nb_Reviews": 1,
          "Date": "2022-10-15T16:02:12.000Z",
          "Titre": "Outdated site page was misleading, but customer service made it right.",
          "Contenu": "One page I found was advertising Undead Legacy servers for cheaper than the current rate. This was corrected by customer service, but disappointing that it didn't offer what I wanted for the price. UI on their hosting site is solid and very easy to use."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Anikaang",
          "Nb_Reviews": 1,
          "Date": "2022-09-20T03:38:51.000Z",
          "Titre": "Server plan upgrade small snag",
          "Contenu": "Upgrading my existing server plan did go well, however there was one small issue when I upgraded my server plan a new server was created instead. So I had to cancel the new server that was created. I am hopeful that in the future that upgrading an existing server won't end up creating a new server."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "NQQBY",
          "Nb_Reviews": 1,
          "Date": "2022-08-01T22:24:25.000Z",
          "Titre": "The server setup is quick and fairly…",
          "Contenu": "The server setup is quick and fairly simple. My only issue is that we do experience some lag pretty regularly. East coast server, most of us are based east coast or central."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Derek Y",
          "Nb_Reviews": 3,
          "Date": "2022-01-04T21:26:46.000Z",
          "Titre": "Overall fantasic service and I love the…",
          "Contenu": "Overall fantasic service and I love the interface. I would give 4.5 stars. In order to get 5 as a user I would like the ability to simply add a seed from the interface without creating it offline and updating it.Cheers,"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-05-07T18:38:05.000Z",
          "Titre": "Great service indeed",
          "Contenu": "Great service indeed! Server has never crashed and support always gets back with you! 4/5 cause I believe nothing is perfect and can always improve ☺️"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DaddyCrimson",
          "Nb_Reviews": 1,
          "Date": "2021-07-01T23:08:00.000Z",
          "Titre": "The reason I'm not giving 5 stars is…",
          "Contenu": "The reason I'm not giving 5 stars is due to the limited use of having overhaul mod packs. Other than that this is an amazing host and great price!"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "MotzyOF",
          "Nb_Reviews": 1,
          "Date": "2022-01-10T12:49:17.000Z",
          "Titre": "only thing we dont like is trhe fps…",
          "Contenu": "only thing we dont like is trhe fps drops in big buildings, not sure if thats on your side or the game but still 4 stars is very good"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joshua",
          "Nb_Reviews": 3,
          "Date": "2023-02-08T05:39:24.000Z",
          "Titre": "Great service",
          "Contenu": "Great service, but a bit pricy for the higher tiers considering a majority of mods won't run on the medium tier plan."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-02-07T16:04:44.000Z",
          "Titre": "The prices are fair and the support is…",
          "Contenu": "The prices are fair and the support is really fast.  I started off with the lowest tier server but it does not support mods so I will upgrade to the next tier soon."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Gaspard",
          "Nb_Reviews": 1,
          "Date": "2021-07-22T19:32:23.000Z",
          "Titre": "Quick, easy, painless",
          "Contenu": "Renting a gaming server isn't a life changing experience. But it sure is nice that it was easy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-02T16:47:48.000Z",
          "Titre": "A very good experience",
          "Contenu": "A very good experience. Purchase and setup is simple. Interface is easy to use. My only complaint is the lag spikes from time to time."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Molson Canadian",
          "Nb_Reviews": 1,
          "Date": "2022-06-27T13:40:04.000Z",
          "Titre": "not bad",
          "Contenu": "perfect cept for war of the walkers im getting errors when i load in"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "snafu",
          "Nb_Reviews": 2,
          "Date": "2023-09-01T16:22:02.000Z",
          "Titre": "Good Service well priced"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Timothy Wood",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T22:13:00.000Z",
          "Titre": "Cheap reliable"
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-10T00:16:01.000Z",
          "Titre": "Good value for money."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Scott Goddard",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T03:00:52.000Z",
          "Titre": "Great server & great service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas Disney",
          "Nb_Reviews": 2,
          "Date": "2023-11-14T16:36:36.000Z",
          "Titre": "No lag!",
          "Contenu": "So far I am extremely happy with the server. I had a Halloween Live Stream session with a few of my friends and had no lag issues at all. I have not changed the mod yet but I am seeing that doing so is very easy to do. Everything has been very user friendly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Squigga",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T23:01:19.000Z",
          "Titre": "Everything worked pretty flawlessly…",
          "Contenu": "Everything worked pretty flawlessly except for the day/night cycle, it’s daytime all the time. Once it hits 00:00 the sun rushes to the East, already rising, making it look like a time lapse. Night doesn’t exist but time still works for bm! Other than that, 10/10 would recommend 🙌🏼💯"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "FknDonnie",
          "Nb_Reviews": 2,
          "Date": "2021-07-16T17:45:05.000Z",
          "Titre": "Solid server and responsive support",
          "Contenu": "I use the server for streaming vanilla gameplay with multiple users (from around the world) using Twitch integration. Canadian serverMap size 8kmax 16 playersAny questions or concerns I have are usually hashed out within an hour through their discord.Price is fair, latency is low"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mike grundy",
          "Nb_Reviews": 3,
          "Date": "2022-08-02T18:08:11.000Z",
          "Titre": "Superb experience from start to finish",
          "Contenu": "Superb experience from start to finish.  The server installed insanely fast and was ready to play within ten minutes from the start of filling in the details and then paying. The server is fast and responsive and the cost is superb for what you get.  They have also made is SO SO simple to install popular mods and also add modlets directly from the Server GUI interface on their dashboard.  Total Genius.  110% recommendation."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Steise",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T06:55:06.000Z",
          "Titre": "Jon is a Star!!",
          "Contenu": "Jon was super helpful and friendly when I was trying to set up my Undead Legacy server, even going so far as to livestream for me, so I could see what he was doing - to get everything just right!!  Thanks Jon... very patient and helpful!  Excellent Customer Service!!!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Anon Customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T07:12:16.000Z",
          "Titre": "Straight forward 7D2D vanilla/modded",
          "Contenu": "I used this service because shockbyte put me on a waiting list for a server which I found odd. Wanted to jump in with friends right away and this site was actually easier to manage and change settings than shockbye. Happily surprised and I will use it for future 7d2d servers"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Adam Guerin",
          "Nb_Reviews": 3,
          "Date": "2022-05-21T13:38:00.000Z",
          "Titre": "Have to say its awesome when you find a great product and team!",
          "Contenu": "Have to say, I am extremely happy with every aspect of the service so far. Pricing is fair, sign up is easy, and my server is up and running within 15 mins of signup. Love the UI/UX of the admin control panel and it's designed to be easy. Great experience so far - thank you.The little things make a huge difference too like the effort that went into styling the webpage to handle server configuration. Most companies just assume we're all comfortable editing and FTPing txt files but you went the extra mile.Again, thank you! I'm happy to have found your service."
        },
        {
          "Note": 5,
          "Lieu": "FI",
          "Pseudo": "La Hex",
          "Nb_Reviews": 1,
          "Date": "2021-12-28T08:39:16.000Z",
          "Titre": "A great 7d2d server host!",
          "Contenu": "A great 7d2d server host!Servers are low-cost, and the support is great. You need absolutely no IT/Linux/Server -knowledge to get started, and the ease of configuration blew me away. I just paid up, and literally within minutes I was able to connect with my friend. We noticed we had some unwanted settings, so I logged in to admin panel, few clicks and our server was configured the way we liked it.Their support is really active in discord, and usually you'll get answers within minutes.Heavily recommended!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher Kelley",
          "Nb_Reviews": 1,
          "Date": "2022-05-20T04:10:20.000Z",
          "Titre": "Magic!",
          "Contenu": "The team at 7D2D really pulled the rabbit out on this one. Best pricing for server hosting, with all of the incredible features built right in, it's super convenient to make the adjustments to improve your experience or change up your style. Enjoy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Heather Bunn",
          "Nb_Reviews": 1,
          "Date": "2022-01-03T15:33:59.000Z",
          "Titre": "Finally a server I can count on!",
          "Contenu": "Went through a few options with servers for 7 Days to Die, finally found one who was quick to help me. Well worth the price! I have already upgraded my server plan because I have more friends joining me than I thought would. Really appreciate everyone behind here making magic happen! (:"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kay B",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T19:32:12.000Z",
          "Titre": "Super easy interface",
          "Contenu": "Super easy interfaceIt is so easy to change whatever settings you want for the world. I never had any problems with ping. I did have a few issues with lag during horde night, but we only had the basic package and my computer is not a giant rig that can handle lots of things. The support team is excellent, and I will definitely return to this server site!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Koz",
          "Nb_Reviews": 1,
          "Date": "2022-05-05T23:09:36.000Z",
          "Titre": "Very Easy to use",
          "Contenu": "Very Easy to use. Love the simplicity. UI looks great too.  Some minor mis-naming errors when dealing with file deletions. FAQs could be a bit more detailed for those with no experience.  The Chat system (FAQ help robot) is actually very good and can answer things really well."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ilie Scodrea",
          "Nb_Reviews": 1,
          "Date": "2022-05-12T05:43:03.000Z",
          "Titre": "Best host for 7dtd u could have",
          "Contenu": "This host is probably the best host I ever had there is nothing to say bad about them the only suggestion I have if u could add support for server tools in the future that will probably make the best host on the market for 7dtd with out question, thank you .Never run out of resources."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Duh Wolf",
          "Nb_Reviews": 2,
          "Date": "2023-07-22T15:33:50.000Z",
          "Titre": "This pricing and performance is incredible!",
          "Contenu": "I rented a server when of the alpha 21 7 days to die went live. It was a little bumpy but the server specs and the price is amazing. Small team on the customer server end but they get it done. Pings are low all across the U.S. and they run smooth as soft butter on toasty horde nights. I just rented my second server and am still paying less than I was at my previous host for a single eight slot. -Duhwolf Gaming"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "XxScootalooxX",
          "Nb_Reviews": 1,
          "Date": "2022-07-26T04:03:15.000Z",
          "Titre": "Excellent server host",
          "Contenu": "Excellent server host, never had any problems. A good price for a 7 Days to Die server. Easy set up, and easy to manage. Their map generator seemed a bit wonky, but other than that everything was amazing.Overall, one of the best server hosts that I have used. Highly recommend them."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Scott",
          "Nb_Reviews": 2,
          "Date": "2023-08-14T14:29:44.000Z",
          "Titre": "Its a great server",
          "Contenu": "Its a great server and we have created a small community on, however it dose crash quite frequently but sorted fast, however we have only been using for 2 weeks so you can expect small teething issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2022-05-11T04:22:47.000Z",
          "Titre": "Supercraft has been a great host",
          "Contenu": "Supercraft has been a great host. I'm running my second 7d2d server now. Installing server-side mods, making config changes, and backing up worlds has been simple."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 1,
          "Date": "2021-03-27T17:25:13.000Z",
          "Titre": "A+ support",
          "Contenu": "The team at Supercraft was very helpful in resolving a couple issues I had with getting my custom map and world set up on their hosting site. The team was responsive and helpful through their discord server. I look forward to continuing my service as they expand their world customizing features! Would recommend. Very reasonable pricing packages, user-friendly web-interface."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "HashBroGames.TTV",
          "Nb_Reviews": 1,
          "Date": "2022-09-13T01:24:51.000Z",
          "Titre": "Great service!",
          "Contenu": "So far, it's been the easiest server host I've ever used. My only complaint is ftp access is behind a pay wall, but that isn't worth deducting a star."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jig",
          "Nb_Reviews": 1,
          "Date": "2023-01-03T19:41:09.000Z",
          "Titre": "Super fast and easy to setup",
          "Contenu": "Super fast and easy to setup, you can be online gaming in 5 minutes.Easy to use config settings for someone that has never used a server hosting system."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joshua",
          "Nb_Reviews": 2,
          "Date": "2023-02-20T22:56:33.000Z",
          "Titre": "Trusted by Barfool.Com",
          "Contenu": "The setup is quick and easy. adding mods and changing settings is intuitive and painless. Thanks for such a great platform for gamers!7D2D.net is the ONLY hosting service trusted by Barfool.Com!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Nick",
          "Nb_Reviews": 1,
          "Date": "2021-06-15T15:50:16.000Z",
          "Titre": "Got this for hosting 7dtd modded…",
          "Contenu": "Got this for hosting 7dtd modded (Darkness Falls). It is very fast - melee works very well, unlike other providers I tried before, and we had no problem so far."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paula A.",
          "Nb_Reviews": 3,
          "Date": "2022-05-13T17:29:21.000Z",
          "Titre": "Easy to set up",
          "Contenu": "Easy to set up, adding mods is much easier than other servers I have used. So far no downtime or server interruptions. This is a solid choice for a 7 day server."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-08T09:05:52.000Z",
          "Titre": "Fast Repsone, Easy Setup, Nice Support",
          "Contenu": "No Problems with setup besides my own inability to read instructions...Seems like the support discord is very active and short response time.11/10 would do again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-11T10:28:03.000Z",
          "Titre": "It's just that easy",
          "Contenu": "Everything was easy and well laid out. Navigating the menus and settings was super simple and every option had examples of what they did. Highly recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-10-07T16:10:47.000Z",
          "Titre": "Can't use in game commands through…",
          "Contenu": "Can't use in game commands through command console but other than that it's easy to use. I found I could use commands on the manage page for my server and the only thing that sucks is you can't use Self commands this way."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BigTexGaminGG",
          "Nb_Reviews": 2,
          "Date": "2021-04-28T16:30:59.000Z",
          "Titre": "Love the servers",
          "Contenu": "Love the servers, so easy to configure and add nice things like mods to intensify the game and make it more fun for my friends and I to Stream. Would recommend these services to anyone!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Kseniya",
          "Nb_Reviews": 3,
          "Date": "2021-08-10T20:18:09.000Z",
          "Titre": "Never had my own server set up but…",
          "Contenu": "Never had my own server set up but this was easier than I imagined, the customer support is quick and friendly. At a competitive price can't ask for more!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "grimcreaper",
          "Nb_Reviews": 3,
          "Date": "2022-04-09T17:35:36.000Z",
          "Titre": "Excellent server so far with no issues…",
          "Contenu": "Excellent server so far with no issues at all.They are priced well and the server functions as expected. Have not needed to contact the staff for any reason."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Azriel J",
          "Nb_Reviews": 1,
          "Date": "2021-10-22T20:36:47.000Z",
          "Titre": "Great Service",
          "Contenu": "Great Service, I've been renting from them for 4 months now with no issues. Have yet to try using mods on my server but I did use Darkness Falls for a month and had no issues. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rochelle",
          "Nb_Reviews": 3,
          "Date": "2022-10-14T05:23:08.000Z",
          "Titre": "Everything is working great",
          "Contenu": "Everything is working great, no issues. A lot of tutorials that were very helpful and easy to follow directions to add mods."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew Scoggins",
          "Nb_Reviews": 1,
          "Date": "2021-12-31T18:19:40.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "Excellent customer service, incredible team, if I could give them more stars I would.  5/5 is an understatment.  The UI for upgrading and updating your servers is a breeze."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maximo Valadez",
          "Nb_Reviews": 1,
          "Date": "2022-04-20T18:49:09.534Z",
          "Titre": "actually easy to use",
          "Contenu": "actually easy to use, who would've thought that's what people actually fkn wanted. Nice work guys, making life easier for the plebs <3"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roydz",
          "Nb_Reviews": 2,
          "Date": "2023-01-08T06:52:32.000Z",
          "Titre": "Fast service",
          "Contenu": "Fast service, easy mod installs, and the fact it auto backs up without me needing to add a schedule is even better."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-05-17T06:23:53.000Z",
          "Titre": "Great service!",
          "Contenu": "Easy to use and setup 7 days to die server. I initially had a few issues, but the support team was extremely quick to help and solve the problems. Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lawrence LoSchiavo",
          "Nb_Reviews": 1,
          "Date": "2022-03-10T22:10:24.000Z",
          "Titre": "Service was great",
          "Contenu": "Service was great. Easy setup with a lot of configuration options. Very easy to cancel as well. Never experienced downtime or lag."
        },
        {
          "Note": 5,
          "Lieu": "DK",
          "Pseudo": "Simon Christensen",
          "Nb_Reviews": 21,
          "Date": "2023-02-23T17:17:11.000Z",
          "Titre": "Can only recommend.",
          "Contenu": "Needed a server for 7d2d. Their site helped me set it up quickly, and modify settings of the game to my liking, without problems. Can only recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "dylan952008",
          "Nb_Reviews": 2,
          "Date": "2022-01-01T07:35:57.000Z",
          "Titre": "Great deal",
          "Contenu": "Not really much to say other than it's probably the cheapest host for 7 days 2 die.Almost 1 week into my server and I've had no issues yet."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Paul Jensen",
          "Nb_Reviews": 2,
          "Date": "2021-08-09T23:44:47.000Z",
          "Titre": "Great hosting and works well",
          "Contenu": "Great hosting and works well. It's  ice to finally have found a great service. Hopefully they fix the issue where I got the server as 19.6 alpha but it some reason gave me 19.5 but other then that little glitch its well worth the money I'm paying. Chwers"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Steven St-Martin",
          "Nb_Reviews": 1,
          "Date": "2021-07-10T23:53:20.000Z",
          "Titre": "Awsome service",
          "Contenu": "Awsome service. I just wish i could modify the files without having to download a backup editing it then loading the backup online."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Martin Rowland",
          "Nb_Reviews": 3,
          "Date": "2022-04-10T05:38:44.000Z",
          "Titre": "I had no experience running a server",
          "Contenu": "I had no experience running a server. It was up as quick as they advertise and I was creating custom maps.  So easy.  Love it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-13T01:23:56.000Z",
          "Titre": "Amazingly beautiful guidance and very…",
          "Contenu": "Amazingly beautiful guidance and very helpful. I recommend to everyone! They even help with deals like a percentage of of a product"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-06-16T13:27:38.000Z",
          "Titre": "Leasing this server to play with a…",
          "Contenu": "Leasing this server to play with a friend has been a great experience. Support is very responsive and prompt. I heartily recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "NHCaptain",
          "Nb_Reviews": 1,
          "Date": "2022-06-11T12:31:16.000Z",
          "Titre": "The service is outstanding",
          "Contenu": "The service is outstanding.  They are quick to try to respond to support issues as soon as they can and are striving to improve their operations and support operations as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-08-06T13:43:40.000Z",
          "Titre": "Server runs smoothly even with lots of…",
          "Contenu": "Server runs smoothly even with lots of zeds and even on the simple cheap package the customer service is really good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Doc Wurm",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T21:45:09.000Z",
          "Titre": "Company does a great job",
          "Contenu": "Company does a great job, and is incredibly helpful. I've had a zero issues with even the largest of overhauls."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sean Willett",
          "Nb_Reviews": 1,
          "Date": "2021-12-29T12:30:56.000Z",
          "Titre": "Great server hosting company for 7 Days…",
          "Contenu": "Great server hosting company for 7 Days to die. They deal only this game for hosting. I would recommend this company to my friends and family"
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "Lilchar",
          "Nb_Reviews": 1,
          "Date": "2021-11-09T10:10:16.000Z",
          "Titre": "First time rent a server for gaming",
          "Contenu": "First time rent a server for gaming. So easy and simple to use. Even dont need tutorial. All in one with several clicks and its done. Ofc gonna rent again to keep my gameplay with my friends because the ping is so damn low. It worked very well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-10-21T14:17:06.000Z",
          "Titre": "Good server perform with no downtime",
          "Contenu": "Good server perform with no downtime. The checkout process could be better. Paypal would be easier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Derailed",
          "Nb_Reviews": 1,
          "Date": "2021-06-16T06:07:13.000Z",
          "Titre": "Great customer service and helpful…",
          "Contenu": "Great customer service and helpful support. I would use again. I’m running 7day WAR3ZUK launcher mods."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "David Clennell",
          "Nb_Reviews": 2,
          "Date": "2023-01-04T22:04:45.000Z",
          "Titre": "Great Experience",
          "Contenu": "All been good and experience over a couple of weeks has been good a little Lag but great over the distance!!!;-))))"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "It's pronounced zed.",
          "Nb_Reviews": 2,
          "Date": "2022-03-19T18:55:30.000Z",
          "Titre": "Much better than not using a server",
          "Contenu": "Other than the odd latency issue, particularly when the action gets hectic, the server has been wonderful for our group. Will definitely recommend. 🙂"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "FirstTimeUserTom",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T20:52:07.000Z",
          "Titre": "It was easy to set up my dream server…",
          "Contenu": "It was easy to set up my dream server and I’m no where near a computer nerd. Great help and good performance for 10 Euros."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin Y.",
          "Nb_Reviews": 3,
          "Date": "2021-04-03T04:32:36.000Z",
          "Titre": "Super easy setup and configuration",
          "Contenu": "Super easy setup and configuration. Adding the ability to easily set up the darkness falls mod makes it a fantastic server service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nathan Piper",
          "Nb_Reviews": 1,
          "Date": "2022-07-03T18:53:37.000Z",
          "Titre": "absolutely perfect",
          "Contenu": "absolutely perfect, i've tried a few server services, this one works flawlessly and puts ISPs to shame with it's reliability and service (and i am not unhappy with my ISP)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-07-01T11:45:35.000Z",
          "Titre": "I was able to setup my 7D2D server with…",
          "Contenu": "I was able to setup my 7D2D server with an upload from my old server. It works perfectly! The old server was just my own system, but now my friends and I play without any issues. As we were able to load the files we didn't have to start over! It's been great! Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nate",
          "Nb_Reviews": 1,
          "Date": "2022-09-09T04:53:21.000Z",
          "Titre": "Customer support is awesome",
          "Contenu": "Customer support is awesome, helped me fix my problem with the server and transfer our data to the new server!"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T19:04:49.000Z",
          "Titre": "Easy to use server",
          "Contenu": "Easy to use server, with a good explanation how to set up the server. Easy config, smooth server"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-08-16T02:00:28.000Z",
          "Titre": "For a first experience getting my own…",
          "Contenu": "For a first experience getting my own server, was very straight forward and easy. And the server was up so fast. Very happy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "llFGEllToxinll",
          "Nb_Reviews": 1,
          "Date": "2022-06-21T07:13:25.000Z",
          "Titre": "Very easy to setup and manage",
          "Contenu": "Very easy to setup and manage, and ive had no issues. Setver was up and running withing a couple minutes of payment."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "uzzy",
          "Nb_Reviews": 1,
          "Date": "2022-05-15T14:02:28.000Z",
          "Titre": "Best server hosting I've found for 7d2d",
          "Contenu": "Super easy to setup and with mods for 7d2d! Server ran smooth and the squad and I had no problems. Definitely will use again in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-08-04T03:17:52.000Z",
          "Titre": "7D2D server",
          "Contenu": "Got a 7D2D server from them. $10/month was a good deal. UI is easy and intuitive. Only tried vanilla server so far but everything has been smooth so far"
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Loksiu",
          "Nb_Reviews": 2,
          "Date": "2022-10-02T19:33:26.000Z",
          "Titre": "supercraft is very good hosting",
          "Contenu": "they give money back for the inconvenience!almost no lag!nice price!good menu config!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Boompa",
          "Nb_Reviews": 1,
          "Date": "2021-09-26T22:17:48.000Z",
          "Titre": "I am a total nube but it was quick and…",
          "Contenu": "I am a total nube but it was quick and easy to get a server running.  Played a day horde night with my son and granddaughter in no time at all."
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Maciej Kraus",
          "Nb_Reviews": 1,
          "Date": "2021-03-27T17:25:57.000Z",
          "Titre": "I rent a 7 Days to Die server via…",
          "Contenu": "I rent a 7 Days to Die server via 7d2d.net. No lags, etc. Web panel is great. Support on a Discord channel is awesome."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maria Kilburn aka Phuri",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T01:06:56.000Z",
          "Titre": "Actually got to talk to someone about…",
          "Contenu": "Actually got to talk to someone about our needs"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-04-03T21:14:52.000Z",
          "Titre": "Server is running great",
          "Contenu": "Server is running great. Price is reasonable. Questions answered quickly. Couldn't be happier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T17:01:44.000Z",
          "Titre": "Exactly as advertised",
          "Contenu": "Exactly as advertised. Easy to use dashboard and tools."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 1,
          "Date": "2021-12-31T16:07:29.000Z",
          "Titre": "Best Hosting Experienced",
          "Contenu": "The server was up and running in seconds, easy setup, easy Mod setup.  Server has been running, as MK would say it Flawlessly.Very happy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-10-23T04:10:24.000Z",
          "Titre": "Server has been very good so far only…",
          "Contenu": "Server has been very good so far only hiccups have been client induced"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sav",
          "Nb_Reviews": 2,
          "Date": "2023-01-13T19:04:39.000Z",
          "Titre": "Great 7 Days to Die Host",
          "Contenu": "Great 7 Days to Die Host! I spent a lot of money and time trying to find the best host, and after 4-5 sites I came across this one. It was very simple and easy to setup and ran flawlessly. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-08-09T00:13:32.000Z",
          "Titre": "Great server",
          "Contenu": "Great server. Some minor connectivity issues sometimes but still great."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "wonderteam",
          "Nb_Reviews": 3,
          "Date": "2022-12-04T17:31:05.000Z",
          "Titre": "Very nice +rep !",
          "Contenu": "very nice hosting server for 7DTD no performance issue very nice !!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Adam",
          "Nb_Reviews": 1,
          "Date": "2022-10-22T06:20:19.000Z",
          "Titre": "Fast and Simple",
          "Contenu": "Fast and simple. Easy one-click installation of mods. Fantastic!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-07-14T21:43:29.000Z",
          "Titre": "Excellent",
          "Contenu": "Super fast to get going an not a single issue with the server"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Scott Arthur (ToxicSpectra)",
          "Nb_Reviews": 6,
          "Date": "2022-03-10T17:53:26.000Z",
          "Titre": "Simply amazing fast setup and cheap had…",
          "Contenu": "Simply amazing fast setup and cheap had no issues would reccomend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-02-02T15:13:14.000Z",
          "Titre": "Great server hosting",
          "Contenu": "Great server hosting. No problems & it never goes down."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-03-09T01:10:56.000Z",
          "Titre": "I am enjoying the game and playing with…",
          "Contenu": "I am enjoying the game and playing with my friends and granddaughters"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nick",
          "Nb_Reviews": 1,
          "Date": "2022-01-01T06:43:12.000Z",
          "Titre": "Support was super helpful",
          "Contenu": "Support was super helpful, even on New Years Eve. Got me up and running. Thanks a bunch."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Lotusflower",
          "Nb_Reviews": 1,
          "Date": "2022-01-11T18:48:36.000Z",
          "Titre": "Good server stability and easy to use",
          "Contenu": "Good server stability and easy to use. No notepad to modify."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Laulin",
          "Nb_Reviews": 1,
          "Date": "2022-01-01T16:50:03.000Z",
          "Titre": "Just the best",
          "Contenu": "I tested many dedicated servers for 7d2d ans clearly, it is the best !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alex G",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T20:58:35.000Z",
          "Titre": "Great all around!",
          "Contenu": "Great options for 7DTD Servers and VERY responsive support!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Monty",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T13:03:57.000Z",
          "Titre": "Love it!",
          "Contenu": "I love that it’s actually user friendly. My friends and I love our server."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "January Brown",
          "Nb_Reviews": 1,
          "Date": "2022-05-21T03:23:01.000Z",
          "Titre": "Definitely recommend",
          "Contenu": "I had good luck with the server. It was very easy to use. Never needed to use the support. The price was perfect. I have not a single complaint."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Michael Groenestein",
          "Nb_Reviews": 2,
          "Date": "2021-08-12T03:50:46.000Z",
          "Titre": "Easy and simple to set up",
          "Contenu": "Easy and simple to set up, use, and manage. Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tony Quintero",
          "Nb_Reviews": 3,
          "Date": "2022-03-14T03:32:34.000Z",
          "Titre": "Servers run great",
          "Contenu": "Servers run great, they have a discord for quick help with any issues. good prices!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 3,
          "Date": "2021-12-31T18:19:34.000Z",
          "Titre": "Nearly instant support when needed",
          "Contenu": "Nearly instant support when needed.  Also easy to add mods to your server."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Xenu",
          "Nb_Reviews": 1,
          "Date": "2022-06-02T04:10:08.000Z",
          "Titre": "Works great",
          "Contenu": "Works great and is exactly what I would expect of a server"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "CustomerA",
          "Nb_Reviews": 1,
          "Date": "2022-07-13T03:21:17.000Z",
          "Titre": "Quick to setup my 7D2D server",
          "Contenu": "Quick to setup my 7D2D server, customize as required and fairly intuitive interface. Would recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-08-01T20:41:02.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good. Easy interface and very easy for an old man like me to Mod my server. Thank you folks. Keep up the good work,"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Smith",
          "Nb_Reviews": 2,
          "Date": "2022-12-09T04:55:21.000Z",
          "Titre": "Works perfectly",
          "Contenu": "Works perfectly. And supports Xbox pc version"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-06-26T10:31:25.000Z",
          "Titre": "Very easy to setup and use!",
          "Contenu": "Very easy to setup and use. Have had for a few weeks now and have had absolutely no problems at all."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-07T21:30:30.000Z",
          "Titre": "Servers worked well",
          "Contenu": "Servers worked well. Easy to navigate"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Jason Scott",
          "Nb_Reviews": 1,
          "Date": "2021-04-18T04:24:09.000Z",
          "Titre": "Excellent Game servers",
          "Contenu": "Excellent Game servers. Best ive ever used !!!!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "XBIGJOHNQCX",
          "Nb_Reviews": 1,
          "Date": "2021-05-03T21:32:43.000Z",
          "Titre": "Great server host",
          "Contenu": "Great server host, no lag. Perfect for gaming with a couple of friends."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Tim Andrews",
          "Nb_Reviews": 2,
          "Date": "2022-09-13T11:20:55.000Z",
          "Titre": "Good fellas",
          "Contenu": "Good fellas. I asked them to do something because I’m blind, they did it."
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-11-26T18:02:02.000Z",
          "Titre": "Fair price",
          "Contenu": "Fair price, fast startup , solid provider"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-05-07T23:25:47.000Z",
          "Titre": "It’s awesome to have server to play on…",
          "Contenu": "It’s awesome to have server to play on and the setup was quick and easy."
        },
        {
          "Note": 5,
          "Lieu": "NO",
          "Pseudo": "Jakki Dakk",
          "Nb_Reviews": 1,
          "Date": "2022-12-01T20:50:59.000Z",
          "Titre": "No complaints.",
          "Contenu": "Im not sure on what you did great, but i've got no complaints. Everything runs smoothly."
        }
      ]
    }
  ]
}