{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "targus.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lucas Nápoli",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T14:38:59.000Z",
          "Titre": "\"Not return, contact us\" BS",
          "Contenu": "So... I bought a (new) Targus notebook power charger from Target. After the first month it started to show some issues which stopped me from using the notebook while charging. I called Targus and they delayed replies and kept dragging the \"do not return, call us\"-BS. So, long story short, the contact with Targus took so long that Target's return policy expired. After that, the customer service said that my notebook was the problem and they couldn't do anything about it. So, when I ask for warranty, they refused to enforced it. By the way, the exchange emails took two whole months for them to realized that problem. VERY DISAPOINTING! And they even tried to give me a coupon with some % off to try to make up for it. Even when I said that if they didn't honor my first purchase, why would I ever buy anything from Targus again?? Targus lost a customer!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Rose",
          "Nb_Reviews": 8,
          "Date": "2023-02-22T14:00:45.000Z",
          "Titre": "Faulty bag and no resolution",
          "Contenu": "I received a gift voucher from my previous employer which I used to purchase the backpack circa August 2022.  It has been less than a year and the zip is faulty. I was unable to provide a receipt for a bag of such value, I would have appreciated some sort of assistance for example a voucher of some sort to go towards purchasing a new backpack. If my claim was not genuine, I would not have gone back and forth with the team to request for a solution. Really disappointed and with the quality and value of the bag, I thought they could help."
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "Avi Frydman",
          "Nb_Reviews": 1,
          "Date": "2021-08-27T11:41:34.000Z",
          "Titre": "I bought an I pad  cover by targus",
          "Contenu": "I bought an I pad  cover by targus, paid a lot but  after a year and half started to br plastic cracks and  upper cover  to peel out , I called the customer service  ,  got  poor answers  sending me away with no solution.  I jus bought myself another cheap cover  and throw away the expensive targus,      I. Do. NOT  recommend  buying from them and I will never buy any. Targus product"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Sam",
          "Nb_Reviews": 2,
          "Date": "2023-09-21T20:45:36.000Z",
          "Titre": "Customer service in Canada is dead",
          "Contenu": "Customer service in Canada is deadI have been waiting for a response on their behalf for over two weeks. I asked for a replacement in a ticket, and tried to reach them with their supposed \"Live chat\" one week later. The result? I waited an hour on \"An agent will be with you in a moment.\"I have yet to hear from them.The strap on my topload Corporate Travaler snapped after barely one year of use. All I wait is a replacement for the strap only. We are talking about a +110$ bag. The strap seemed to be heavy duty, only to disappoint in the end."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Paul Harvey",
          "Nb_Reviews": 3,
          "Date": "2020-07-15T14:36:31.000Z",
          "Titre": "Targus Executive Premium Roller Bag",
          "Contenu": "Targus Executive Premium Roller Bag - the wheel came off, did all they asked, but due to it being a gift - no receipt. NO exchange. Fair as its there policy, just show a total lack of customer service.Just thrown it in the bin along with my other one, now have a different companies on order. will no longer recommend this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "OMPBL",
          "Nb_Reviews": 6,
          "Date": "2021-03-21T04:28:14.000Z",
          "Titre": "BEWARE OF THE WARRANTY POLICY!!!",
          "Contenu": "So... I bought a (new) Targus wireless keyboard from an Ebay shop. After a coupe of month it started to show some mechanical issues which got worse overtime. I called Targus and they refused to enforced their one year warranty because I didn't buy that keyboard from their OWN Ebay shop!! Really?? VERY DISAPOINTING!! Targus you lost a customer, and count on my word of mouth too!!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "SA",
          "Nb_Reviews": 1,
          "Date": "2022-10-22T02:19:23.000Z",
          "Titre": "Backpack covered in mold",
          "Contenu": "I purchased a backpack from this site. It got mailed home and was covered in mold. I contacted customer service who 4 days later send a shipping label. I received the replacement bag 7 days later and once again the backpack is covered in mold. I called customer service and am waiting for a reply. I would like a refund as the backpacks seem to be stored improperly in the warehouse. Customer service says they cannot guarantee a refund and will get back to me. Not a reliable site to purchase from. Go elsewhere or instore."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Blair A Niewoehner",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T13:07:33.000Z",
          "Titre": "Negative stars",
          "Contenu": "If I could give Targus 0 stars, I would. Targus does not fix their mistakes or honor their lifetime warranty. I sent a broken backpack in and despite the correct address being sent with the bag, on the box, and on the messages prior to sending it in, they shipped the backpack to an old address I haven’t lived at for years. Instead of fixing their mistake, they told me to go to the other house and ask for the package. I am not going to someone else’s house I don’t know to demand a package that I don’t even know if they kept. They probably returned to sender, if Targus actually sent it to begin with! Completely unreasonable request when Targus made the mistake! In the messages back and forth, which took months, they just said, “We won’t be shipping a replacement.” Don’t purchase anything of theirs; Targus doesn’t know the meaning of customer service, especially when they’re at fault and they won’t honor their lifetime warranty!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ebrahim Seyedebrahimi",
          "Nb_Reviews": 1,
          "Date": "2022-09-13T21:15:56.000Z",
          "Titre": "Overcharged/Don't buy from them, buy from amazon because you'll return",
          "Contenu": "Buy from amazon because you'll return.I was overcharged $11 the second time I tried purchasing because of an unknown issue that they canceled my first order. The backpack was received, and it is not looking as advertised. The back of the backpack looks as if the bag has been used fresh out of the box for at least two years. The sewing does not look and stand straight at all. I went ahead and tried returning, and as they don't provide free returns, I'd be charged $47 if I wanted to return, so I'm stuck with this garbage thanks to Targus's fair return policy."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Efe Ozcanli",
          "Nb_Reviews": 3,
          "Date": "2022-11-30T01:31:45.000Z",
          "Titre": "I ordered one item and used the…",
          "Contenu": "I ordered one item and used the discount code but they didnt applied. Tried to reach them but said use it for another order. Then I wanted to return the item and they said pay for the return shipment. I really dont recommend anyone because of their attitude."
        },
        {
          "Note": 1,
          "Lieu": "CZ",
          "Pseudo": "N smith",
          "Nb_Reviews": 1,
          "Date": "2022-02-08T21:26:51.000Z",
          "Titre": "Very disappointed in their customer…",
          "Contenu": "Very disappointed in their customer service. 😣 I tried calling this company because my order confirmation went straight to my spam but I never reached anyone even though their recording said they were open.  Then I had to return one of the backpacks I ordered and I had to pay over $35 for the return shipping. I knew I had to pay for that so that was cool. However, I didn’t know and didn’t expect that they would take money out of my refund for the original shipping charges! I guess it was in the fine print and but it sure doesn’t leave a good impression with me. I contacted them but didn’t receive any helpful resolutions."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Frontline Electrical",
          "Nb_Reviews": 1,
          "Date": "2021-02-19T04:00:49.000Z",
          "Titre": "Absolutely shocking delivery time",
          "Contenu": "Absolutely shocking delivery time. Ordered a Microsoft Surface Pro Case 7/01/21 and it’s still not arrived. Tracking shows the parcel on hold in their UK delivery centre where it’s been since 15/01/21."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Nicoleta",
          "Nb_Reviews": 6,
          "Date": "2022-09-12T23:35:06.000Z",
          "Titre": "I have ordered 2 backpacks almost 2…",
          "Contenu": "I have ordered 2 backpacks almost 2 weeks ago and still waiting for...no information provided at all...tried to contact the customer service team twice, get in hold for about 2 hours...hopping to receive in the end"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Fujii:",
          "Nb_Reviews": 2,
          "Date": "2021-11-05T04:50:06.000Z",
          "Titre": "Power plug sizes are a guessing game.",
          "Contenu": "I bought a new Asus laptop VivoBook 17.  Wanted a new plug for my docking station.  The descriptions of the plug sizes are vague and all models are not represented on the site.  Targus should just offer a complete set of plugs."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Perry",
          "Nb_Reviews": 1,
          "Date": "2023-02-02T00:34:01.000Z",
          "Titre": "I ordered an IPad cover and it was the…",
          "Contenu": "I ordered an IPad cover and it was the wrong size.  I tried to return it but was advised it wasn’t returnable because it was a close out. I didn’t realize this until I was informed.  I’ll never buy a targus iPad cover or any targus product again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Efe Ozcanli",
          "Nb_Reviews": 3,
          "Date": "2022-12-14T23:08:22.000Z",
          "Titre": "No answers no help and I paid for the…",
          "Contenu": "No answers no help and I paid for the return item. Which costs almost the item cost.Update: They deducting also for free shipping if you return worst customer service I ever seen"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "KESKB",
          "Nb_Reviews": 1,
          "Date": "2022-10-07T00:53:26.000Z",
          "Titre": "Poor Customer Service for Defective Item",
          "Contenu": "I ordered a backpack for my son.  He hadn't used it or even looked through it until today, when he needed it.  When he looked inside, one of the pockets wasn't attached--- the fabric was loose.  I contacted customer service.  Provided pictures of the obvious manufacturer defect and the tags being still on the pristine backpack. To get a replacement I have to do the following: Wait up to 48 hours to recieve a return label. Ship the package. Wait until they determine if this issue is \"covered.\"If it is, they will send a new product. With other similar items, the manufacturer has always sent a new one immediately (since it was a defect and there is no determinination needed) and then wait for me to send the defective product back.  Sometimes they state they will charge for a new item if the original is not returned, which is fine.   No options with this company.  Simply, \"It's your problem, now you need to wait another 7-10 days before getting your item.\""
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "KC",
          "Nb_Reviews": 1,
          "Date": "2020-11-09T20:00:36.000Z",
          "Titre": "Worst Service & products ever!",
          "Contenu": "I thought the case I bought would be like leather but instead when I got it, the case was very cheap & plastic like. I talked to a service rep to do a return & he said I would get $5-7 for shipping taken out of the refund when I was fine with. But when I did get refunded You guys took $16.45 out which was more than Double! I will never buy from Targus ever again! Super misleading & taking money away from me!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pamela Banks",
          "Nb_Reviews": 1,
          "Date": "2020-12-02T01:59:19.000Z",
          "Titre": "Placed an order using the NEWPOETNU",
          "Contenu": "Placed an order using the NEWPOETNU.  But when I paid with my amazon pay card the bag went back to regular price.  So I call amazon to cancel pay.  Amazon said they sent a message to Targus to cancel order.  But the order was fill anyway.  So I call Targus Tuesday afternoon about sending the order back explained all of this to the person that took my call.  And still wanted to charge me to send this order back.  When I asked about a return label.  She seen to get agitated with me as if I was not speaking the truth.  I had to have someone at Amazon Pay to call Targus back to help in assisting me in this matter.  I don't feel that should have to lose money to return this item,  when I cancel this order before it was shipped."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "C. Wisniewski",
          "Nb_Reviews": 1,
          "Date": "2021-04-05T18:32:44.000Z",
          "Titre": "Poor execution",
          "Contenu": "I paid for 3 day shipping and it arrived in 8 days when I was no longer home.  I needed to take it with me before I left, so it didn't help me at all and left me scrambling.  Customer service is/was non-existent."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Valenta",
          "Nb_Reviews": 2,
          "Date": "2021-01-04T17:56:57.000Z",
          "Titre": "Wrong size suggested by Targus",
          "Contenu": "I ordered this case based on the Targus website recommendation.  I clicked on the iPad model number (on the Targus website), and I ordered the first case shown.  Turns out it was the wrong one.  My iPad is 9.7\" the recommended case was for 10.5\".  I called Targus and was told I can send it back but I have to pay for shipping even though it was their fault for suggesting the wrong size.  So a one star rating is based on the above."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "The Conscientious Shopper",
          "Nb_Reviews": 13,
          "Date": "2020-08-11T15:24:42.000Z",
          "Titre": "Poor customer service and faulty Cooling Pad",
          "Contenu": "Got in touch with customer services to complain about the Targus Cooling Pad, which became faulty (foam has literally bent out of shape and fan is loud and not quiet as advertised) within one day of opening it and was told they would not be able to replace it under warranty and that I should contact the retailer I bought it from as it has been less than 30 days. Quite disappointed with Targus's customer service and this product. I have other Targus products and the quality is excellent but this one is quite poor given its RRP and how much I paid for it. I'll definitely look elsewhere when I need to buy computer accessories in future - plenty of other decent companies that appreciate their customers."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Fnu Raheela",
          "Nb_Reviews": 1,
          "Date": "2022-01-20T17:08:32.000Z",
          "Titre": "Don’t waste money here there are lots of other sites",
          "Contenu": "Horrible .don’t buy if any doubt in item they will charge you double shipping charges they Don’t have any fair return policy I have to return the item it was a miss fit with my laptop .I have to pay return charges double  .where most of the sites offer you free retuns.they had the case back and took my 18$ for giving me head ach.see some other sites for your needs"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Towns",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T22:25:28.000Z",
          "Titre": "Have not received it yet"
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "F. D.",
          "Nb_Reviews": 29,
          "Date": "2022-08-11T19:51:43.000Z",
          "Titre": "Awful customer service",
          "Contenu": "Customer service doesn't care if you have a problem with your product. Very bad experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Samantha Riggs",
          "Nb_Reviews": 1,
          "Date": "2021-01-04T17:39:11.000Z",
          "Titre": "Shipping is absolutely awful",
          "Contenu": "Shipping is absolutely awful. Ordered over two weeks ago and still haven’t received my item."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "D.K.",
          "Nb_Reviews": 1,
          "Date": "2022-12-28T00:50:13.000Z",
          "Titre": "Customer satisfaction not important to Targus!",
          "Contenu": "Neither customer support nor the corporate director of customer service were interested in customer goodwill or satisfying a loyal, repeat customer who had a poor experience with with a newly-purchased product.The gesture of offering a discount toward a future purchase (which was slightly greater than what any customer could easily get), while better than nothing, would have been more meaningful if Targus refunded the shipping cost (a mere $9.99), per my request, as I never would have purchased the product in the first place had I known that an expected feature (that all other competing cases support) was absent!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kathy Stenlund",
          "Nb_Reviews": 1,
          "Date": "2022-08-01T19:08:26.000Z",
          "Titre": "Can not return the iPad cover I…",
          "Contenu": "Can not return the iPad cover I purchased to replace the old one. Size numbers changed. A 12.9 cover should be 12.9 not 10.8. Call it what it is!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Satish Kumar Jooluri",
          "Nb_Reviews": 1,
          "Date": "2021-02-02T15:57:20.000Z",
          "Titre": "The bag doesn't meet the website…",
          "Contenu": "The bag doesn't meet the website description. I wish to return the bag and buy others"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MG",
          "Nb_Reviews": 1,
          "Date": "2022-01-11T21:40:09.000Z",
          "Titre": "No response to my request to return",
          "Contenu": "No response to my request to return. Disputing with my credit card company."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "MP",
          "Nb_Reviews": 1,
          "Date": "2022-04-12T11:49:22.000Z",
          "Titre": "1 star - item still missing 2 months later",
          "Contenu": "... and customer support are not responding... I rate them 1 star for customer service, the paid but missing item, and my wasted time. I will explain below. I ordered 2 items at the end of January, just over 2 months ago, a backpack and a roller suitcase. The items were paid for immediately, and they were supposed to be delivered by courier, which is fast way to deliver, meaning within a couple of days or so. They were sent as 2 separate orders for some reason. Item 1 arrived on time within days, item 2 was stuck in the courier depo (using their online tracking). I contacted Targus, red flag number one, they told me to wait, when it was clear the item was blocked/lost in the courier. Several days later, I contacted them again, they asked me to wait again. After about a month (?!) I contacted them again, and I said this is clearly stuck and it's not being delivered, so I asked for a refund or a replacement. They agreed to a replacement, but they made a mistake and send me a backpack again, which is clearly not the right item as that was already delivered, the missing item was the roller. I raised this with them immediately (even before I received it as I could see from the emails that this was the wrong replacement) and asked them for the correct replacement. A few days later, and nothing happened, I called them again and they told me they escalated to their support team but I had no contact from them. I had to chase them again a few days/weeks later, and after a while, they stopped picking up their phone on my calls, and this happened on several repeated attempts. Funny enough, as soon as I called from a different phone number, the support phone was picked up immediately, this leads me to believe they have black-listed my number now because I am following up with my complaint. So when I managed to get through to their support (from my different phone number), they said they are going to \"escalate\" my case (again)... of course nothing happened after than. I emailed them giving them one week to sort this out either by a replacement or a refund, or else I will start the chargeback process. I had no reply more than 1 week later, so now taking this with my bank for a charge back. Be warned if you are ordering from this company, you might not get the item you promptly paid for more than 2 months later, and you might have to deal with shady blocking number practices and waste a lot of your time chasing their support and dealing with the charge back procedure. Better choose a reputable supplier for your items."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Robert Saxon",
          "Nb_Reviews": 19,
          "Date": "2022-07-06T03:27:24.000Z",
          "Titre": "Targus Chill Mat AWE81EU Simple design. Unsustainable unrepairable product. Awful customer service. Ecologically unsound company.",
          "Contenu": "Targus Chill Mat AWE81EU  is one of many handy dandy little platforms designed to run  off USB power and keep your laptop cooler than it usually runs. Like all such It's a plastic board with a couple of standard cooling fans usually found inside computer cases or strapped onto video cards bolted to the underside of the resting surface. Most come with at least one USB port to make up for the one used to power the mat. This one has 4 and unusually they are robust and fast. Plus point. It's a good hub. The whole kit is not cheap for what it is. They generally retail between £45-60 depending on who you shop with. There's a warranty of a sort that lasts for a year. After that you're on your own. Targus don't repair out of warranty or sell spare partsIt's a spectacular example of \"disposable tech\" designed for a limited lifespan and priced to allow for grudging replacement.Which is an environmentally unsound waste of money, especially when the most common failure is an easy fix. Or should be.The bit that WILL go wrong is the fan assembly. The fans are regular 8010 brushless case fans. Fast, quiet, efficient movers of air. But they are known to fail after prolonged use. It's what happens when you run a small motor constantly, which is why in computer cases and on video cards where they are most often used they are easy accessible and replaceable. Which is what you want to do when they start to fail. The bearings wear and not only does that stop them shifting air and heat, they sound like your laptop is sitting on an industrial vacuum cleaner. These fans are cheap. From everyone's favourite online auctioneer they can be had for as little as £3 each. So under a tenner to fix over fifty quid to replace. Tough choice.The problem is, on this kit, you can't get to the bloody fans.You can see the screws holding them in place but the design of the sealed plastic supports makes free access impossible unless your hands are the size of a five year old child's. Another common swizz of tech companies is to make products that cannot be repaired. You MUST replace them. And all that plastic goes off to landfill. Forget recycling. 90% of all that's collected ends up dumped or exported to a third world country to add to their plastic mountains. This could easily be avoided in the Chill Mat AWE81EU  design by holding the supports in place with a simple nut and blot assembly  and allowing the hinge to open beyond it's restricted 30° angle to give us access to the fan assembly. Not doing this is about making any attempt to open the unit up a destructive one.There are fairly new laws in EU & UK called \"Right To Repair\" that compel companies to reasonably provide parts and advice to fix malfunctions. Swapping out a couple of plug in fans that require unfastening a dozen screws falls squarely into that category. If you can put a plug into a wall socket and know how a screwdriver works you can do this repair.So I contacted Targus for parts and to ask how to open the case without destroying it to effect this repair. What I was confronted with was a cut and paste nightmare of obstructionism that was designed to be as unhelpful as possible. A multi email exchange of them willfully ignoring and evading these simple requests while presenting me with a useless warranty claim form [\"Just out of warranty. Sorree\"] demanding the level of personal information usually extracted in a dark concrete room with extreme prejudice.I eventually figured it out myself accessing components with cranked precision tools and applying a great deal of patience. Most people will simply scrap the plastic brick and buy another. Save the planet my perfect peach of a bottom.Targus clearly don't believe laws apply to them and they don't give a hoot about their company's \"green credentials\". Their designs are entirely in the realm of disposable tech. They want you buying an endless supply of unsustainable plastic toot on a regular basis. That's their business model. Their staff are cut and paste polite but incapable of actual discussion and deliberately of no help whatsoever if you stray in any way from their business model,Because I'm a contrary type and somewhat resourceful I'll repair the kit for as long as it's practically sustainable to do so. What I won't do is buy another new Targus product.From now on any similar kit will be sourced from everyone BUT Targus.These companies will never change unless we force them to change by giving our business to those with a more globally responsible customer friendly approach. I suggest more of us do just that."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Louis Smaldino",
          "Nb_Reviews": 1,
          "Date": "2022-09-12T16:54:52.000Z",
          "Titre": "Case is too big",
          "Contenu": "Case is too big, does not fit properly, would like to return"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Fred Costa",
          "Nb_Reviews": 1,
          "Date": "2021-10-26T14:09:40.000Z",
          "Titre": "This company has the worst customer…",
          "Contenu": "This company has the worst customer service.  I was lied to twice about a product I needed.  They told me twice that It had been shipped then after not receiving it after two months they told me the part had been discontinued and I would have to purchase it somewhere else.  I have the transcript of the chat.  Dear Fred, Thank you for contacting Targus Customer Support. I apologize for any inconvenience. I am happy to assist you. Unfortunately we do not have anymore of these cables. In order to process the Return Authorization, I would require the following information:  1. Purchase date             2. Place of purchase of the item   Horrible customer service.  Please respond to this email with the requested information. Please feel free to contact me with any questions or concerns. Thank you, Tarfari JonesTargus Customer Support  Chat By Chat (Kimberly) (09/09/2021 01:12 PM) Hi, my name is Kimberly. How may I help you?Fred Costa: I am looking to purchase a power supply for a Targus ACP70USA.Fred Costa: ACP70USZKimberly: I am sorry that you are having any issues.I would be happy to assist you with this, Fred.Kimberly: Are you located in the US or Canada?Fred Costa: USKimberly: Thank you. What is the SKU or Item # of your item, please?Fred Costa: Model is ACP70USZ Item# 50Kimberly: Thank you.Kimberly: One moment, please.Kimberly: I would be happy to set up a free part order for the part you would need. In order to process the part order, I would need the following information:-shipping address           -phone number-date and place of purchase  Would you be able to provide this information, please?Fred Costa: Shipping Address: NSC Information Technology GroupFred Costa: 12335 Kingsride Ln., Suite 410Fred Costa: Houston, TX 77024Fred Costa: Phone #713-974-3889Fred Costa: 832-868-7614Fred Costa: Purchased 01/07/21Kimberly: Thank you for the information. The part order will be processed upon the conclusion of the chat session. The part order will also be sent via United States Postal Service. Would there be anything else I can assist you with today?Fred Costa: No.Fred Costa: Can you send me a link to the part so I know it's the right one?Kimberly: I apologize, this part is not for sale. We do not have a link for it.Fred Costa: OkKimberly: Would there be anything else I can assist you with today?Fred Costa: No, thank you.  So it will be shipped.  Will I get a confirmation number?Kimberly: The incident number is 210909-000064.Fred Costa: And I will be able to track shipping from that number?Kimberly: Once the part has been processed, it can take up to 4 business days for us to receive the tracking number. Yes, you can use the incident # to get the tracking number.Fred Costa: And you will ship that for free?Kimberly: Yes, that is correct.Fred Costa: Thank you so much.  Have a wonderful day.Kimberly: You are welcome. Would there be anything else I can assist you with today?Fred Costa: No, thank you.Kimberly: Thank you for contacting Targus Live Chat. Have a wonderful day.'Fred Costa' disconnected ('Concluded by End-user').Do not use this company for any reason.  Find a better alternative."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Janet Lee",
          "Nb_Reviews": 1,
          "Date": "2021-10-04T18:33:46.000Z",
          "Titre": "I have not yet received the item I…",
          "Contenu": "I have not yet received the item I ordered, so I'm not happy yet.  The money did leave my bank account.  What gives?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Frances Bastos",
          "Nb_Reviews": 1,
          "Date": "2022-02-03T19:20:11.000Z",
          "Titre": "I never received the Targus styluses."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MDR",
          "Nb_Reviews": 1,
          "Date": "2020-04-01T19:01:39.000Z",
          "Titre": "Return policy is convenient.",
          "Contenu": "I ordered a laptop docking station and asked to cancel before it got to me. They said they would do a refund and then told me it wasn’t eligible. I. Hadn’t. Even. Received. It. Pretty convenient for a company to be shady when many of us are trying to buy these items forced to work from home. We have over 20k of their units at work. Next time we upgrade our systems we might be going to Dell. I ordered this on Apple Pay. It wouldn’t let me see what the total cost was before I had to select and it took my payment a page early."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Peter Hilario",
          "Nb_Reviews": 3,
          "Date": "2021-08-31T02:32:09.000Z",
          "Titre": "Smartver is a FRAUDULANT company and a Scammer!!!",
          "Contenu": "The item was NEVER DELIVERED. It was a SCAM of Smartver’s."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Gary Heien",
          "Nb_Reviews": 1,
          "Date": "2021-04-18T19:14:20.000Z",
          "Titre": "Not Happy☹️",
          "Contenu": "The case didn’t lie flat when closed. And you charged me $20 to return it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Donoghue",
          "Nb_Reviews": 1,
          "Date": "2020-05-04T18:53:34.000Z",
          "Titre": "I was trying to wait till my case…",
          "Contenu": "I was trying to wait till my case actually arrived before I reviewed it... especially since the world is in a weird place right now and we can't expect normal delivery. However, I have now waited double the standard delivery time and my case has yet to arrive. Perhaps this is a fed ex issue but I haven't been able to get an answer on that. I switched from Otterbox to Targus on a recommendation for my new device and now I am starting to regret it. I'm trying to use my device to take videos to teach online and I am stuck leaning it against things because I don't have a case or stand. Bummed."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Truthsayer",
          "Nb_Reviews": 7,
          "Date": "2019-06-26T11:21:21.000Z",
          "Titre": "Targus = Poor Quality, Even Worse Aftercare Service, AVOID",
          "Contenu": "A Multi Connector, little used.Warranty support Nil.Best advice is do not be tempted to buy this cheap substandard brand.TARGUS Product and Aftercare responses Not Fit for Purpose !"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tom Lang",
          "Nb_Reviews": 1,
          "Date": "2020-03-03T23:07:09.000Z",
          "Titre": "worst",
          "Contenu": "Continues to not enter the first number. Totally useless.When the unit has been untouched for a while the first number entered does not register. Using on a chrome book."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ricky Santor",
          "Nb_Reviews": 1,
          "Date": "2020-03-10T20:02:20.000Z",
          "Titre": "When i received my order and put my…",
          "Contenu": "When i received my order and put my laptop on the side of the cover is not match. I can’t put power cord and adjust the volume. I’m so Disappointed."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Roz Giblon",
          "Nb_Reviews": 1,
          "Date": "2019-04-13T22:53:49.000Z",
          "Titre": "Targus response to broken brief case",
          "Contenu": "I bought a Targus pulley brief case 3 years ago; After a year, the handle broke, Targus would not let me drop off the briefcase at their warehouse in Mississauga for repair even though I was close to it but said UPS deliverered it there.  I paid $15 for shipping +5 dollars for a box from UPS to ship it in and they replaced the briefcase. Now, two years later, the same thing happened to the handle. I told Targus that I believed that they should pay for 2 way shipping as this appeared to be a regular problem due to poor quality with their product. The customer service agent agreed to discuss my request with her manager. I received an email that I had to again pay for shipping which was their policy.  I agree with a previous reviewer that Targus product quality  has gone downhill. Buyer beware, you may be spending a lot on postage for regular repairs of your Targus product!  Targus should take lessons from Lululemon on good customer service!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dissatisfied customer",
          "Nb_Reviews": 1,
          "Date": "2020-03-28T13:01:38.000Z",
          "Titre": "Terrible",
          "Contenu": "Terrible.  Product does not fit...Targus won’t take it back.  What kind of BS company doesn’t take returns.  I hope they go out of business."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jorge Piche",
          "Nb_Reviews": 1,
          "Date": "2020-03-03T21:41:33.000Z",
          "Titre": "I emailed customer service regarding a…",
          "Contenu": "I emailed customer service regarding a question with my return and I have not received at response. It's been more than a week."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carl Jones",
          "Nb_Reviews": 1,
          "Date": "2020-03-03T18:31:17.000Z",
          "Titre": "I just wanted a regular stylus without…",
          "Contenu": "I just wanted a regular stylus without any ink pen. I have bought them there before but I don't see them anymore"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Maro Posigian",
          "Nb_Reviews": 1,
          "Date": "2020-06-02T18:33:14.000Z",
          "Titre": "Extremely excessive delivery time",
          "Contenu": "It’s been two weeks and I still haven’t received my order so I can’t review your product why is it taking so long"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John R Stenstrom",
          "Nb_Reviews": 1,
          "Date": "2020-03-28T14:17:08.000Z",
          "Titre": "My order should have shipped on…",
          "Contenu": "My order should have shipped on 3/13/20. According to the tracking status it still hasn’t left the warehouse."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ethan Summa",
          "Nb_Reviews": 1,
          "Date": "2020-05-09T04:24:23.000Z",
          "Titre": "Unfortunately one person told me they…",
          "Contenu": "Unfortunately one person told me they would send a replacement then I was told 20% off so i was dis"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John B",
          "Nb_Reviews": 4,
          "Date": "2020-03-03T19:18:10.000Z",
          "Titre": "I am very disappointed",
          "Contenu": "I am very disappointed.  My previous Targus product was a 5, compared to this one.  Poor quality."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tracie Anderson",
          "Nb_Reviews": 3,
          "Date": "2020-03-04T01:18:32.000Z",
          "Titre": "Not the Targus of 2005",
          "Contenu": "Not the Targus from 2005! Quality has gone down and customer service is pointless. I was a superfan. I ordered my daughter one for college but I loved my old one so much I couldn't get her one without getting myself another! HUGE MISTAKE. The partitions were paper thin. The threading was starting to unravel. The design was strange. The pics looked like the front part was a pocket with a zipper but it's just a flap! Def. wasn't  worth $100. (After I received it, I found the same bag on overstock for $50) I had to pay $25 to return it only to have them send it back to me telling me it was used. I told them that when I called them to get a return label (Don't be fooled, the return label is just the address-again, i had to pay the shipping costs myself). If by used they mean I put things in it and lifted it-sure. But I never took it out of the house or \"used it\" properly like a bookbag should be because I hated it! It wasn't dirty or anything. I just didn't have the original plastic it came in because my daughter had excitedly opened the box to get her bag and thrown the plastic away. I didn't notice initially because I didn't NEED a Targus, I just WANTED one. Targus doesn't stand behind their products. And I no longer stand behind them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "lindsay",
          "Nb_Reviews": 2,
          "Date": "2020-03-12T14:38:26.000Z",
          "Titre": "This bag has great features BUT BREAKS EASILY AND TARGUS MAKES YOU PAY TO GET A REPLACEMENT EVEN UNDER WARRANTY",
          "Contenu": "UPDATE: I take back my positive review. About two days after writing it, the cord of the drawstring started coming out at the seam. This is how you close the backpack, so having a broken drawstring basically renders this bag useless. I contacted targus as I have not even had this bag for 2 whole months. I HAVE TO PAY TO SHIP THE BAG BACK TO THEM TO REPLACE IT. I ALSO HAVE TO SHIP IT BEFORE I RECEIVE A REPLACEMENT SO I HAVE NO WORK BAG FOR SEVERAL WEEKS BEFORE THEY SHIP ME A NEW ONE! THIS IS TERRIBLE CUSTOMER SERVICE TARGUS. I SHOULDVE RESEARCHED IT BEFORE I PURCHASED FROM THIS BAD COMPANY!!!! BIG REGRET! This bag has great features! Everything you want--a separate laptop compartment, secret compartment in the back for your phone or wallet so it doesn’t get stole out of the front pocket on the subway, a few interior pockets but not TOO many and the luggage strap. It’s great for daily commute and work travel and looks professional. The negatives are the orange color interior lining that I do not care for, the drawstring rope material is starting to twist a little bit after daily use for a few months, and the shoulder straps could be slightly wider for a more comfortable fit -- maybe 1/2” wider. For the price point of the bag, I can overlook the negatives, they are pretty minor. The quality of materials is high and the bag overall is stylish and performs well."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2019-04-12T15:23:29.000Z",
          "Titre": "Targus sucks",
          "Contenu": "Targus sucks! Product quality has gone downhill and customer service is the worst!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jennifer French",
          "Nb_Reviews": 1,
          "Date": "2020-03-04T06:53:25.000Z",
          "Titre": "Refused to honor their  own return…",
          "Contenu": "Refused to honor their  own return policy."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andre Parham",
          "Nb_Reviews": 1,
          "Date": "2020-04-07T20:06:11.000Z",
          "Titre": "Great job all around",
          "Contenu": "Great job all around.  Love the product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scott Langer",
          "Nb_Reviews": 1,
          "Date": "2020-05-11T16:35:02.000Z",
          "Titre": "Not what I thought I was getting"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mr Richard Kronrad",
          "Nb_Reviews": 3,
          "Date": "2023-11-06T22:50:24.000Z",
          "Titre": "I have a generation 5 I pad",
          "Contenu": "I have a generation 5 I pad. I ordered a new cover t replace my old Targus cover. The cover I received is adjustable but much too large. I don’t know what to do because your website does not offer a replacement that is specifically for the generation 5 iPad   Please help"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "SH",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T16:48:36.000Z",
          "Titre": "Don’t like it at all",
          "Contenu": "I was very pleased with my previous Targum iPad mini cover so I bit the bullet on the hefty price tag on this newer version but it is thin and floppy. If I could alter my original cover I’d go back to it. New design is flimsy."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "SRB",
          "Nb_Reviews": 1,
          "Date": "2022-09-05T19:40:38.000Z",
          "Titre": "Very underwhelmed and disappointed",
          "Contenu": "The product description on the targus website gives the impression that this is a bag to securely carry a 15 inch laptop.Upon receiving the item I discovered that it has virtually no padding to protect the laptop.  The highly vaunted sling system also appears to offer no real protection in the event the bag is dropped vertically.Also all the strap hooks are made of plastic... Shameful for a bag at this price point. This was my first targus purchase and will probably be my last."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kathy Sampaga",
          "Nb_Reviews": 7,
          "Date": "2022-01-04T22:14:37.000Z",
          "Titre": "I still have not received it",
          "Contenu": "I still have not received it, my shipment is delayed again. I wish I could have ordered this from BestBuy or Amazon, it would have arrived quicker."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alex Radcliffe",
          "Nb_Reviews": 1,
          "Date": "2022-02-10T18:12:20.000Z",
          "Titre": "The design of the commuter backpack is…",
          "Contenu": "The design of the commuter backpack is done well. The reason for the low rating is that the connecting strap that is used to pull together the main L & R larger straps, pulled completely away from the base where it slides for adjustment. It's impossible to put it back and is impossible to repair, and essentially nonfunctional. My question is, how is it that for decades and decades on other brands of backpacks that this same feature has never failed yet on the first use with your brand this feature has been designed to malfunction? I'll tell you how... it's based on the economics of decay. For decades the American Economy was built on producing quality goods and services but has now changed to a society that draws its identity from consuming crapified goods and services where everything has worthless warranties, products are designed to fail, and products are designed to be impossible to repair, and by using the lowest-quality, lowest-cost components, manufacturers guarantee that the entire product will fail once the lowest-quality component fails. You cannot expect to get repeat customers or stirling recommendations and reviews when as a corporation you are committed to crapified goods. When the $1 component fails the entire product becomes unusable. So we now have another poorly made product for the landfill. Ugh!"
        },
        {
          "Note": 2,
          "Lieu": "QA",
          "Pseudo": "Ali  Saadat",
          "Nb_Reviews": 3,
          "Date": "2023-07-20T10:50:03.000Z",
          "Titre": "I had a very bad experience with this…",
          "Contenu": "I had a very bad experience with this company, as I was advised by their customer service to buy a specific tip for my universal laptop charger because all the tips that were included didn't fit my laptop and when I received the tip it was completely the wrong part it didn't even fit the charger or my laptop and when I Informed them about this mistake they didn't do anything or provide any solution"
        },
        {
          "Note": 2,
          "Lieu": "DK",
          "Pseudo": "Finn Christiansen",
          "Nb_Reviews": 8,
          "Date": "2019-01-11T17:50:19.000Z",
          "Titre": "Poor customer service",
          "Contenu": "Poor customer service. Have a expensive roller fra targus, almost like new, but handle is broken. Wrote to targus, but they wont do anything without a receipt. Got it as a present, and don't have the receipt. Not good :-(."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kathleen wozniak",
          "Nb_Reviews": 1,
          "Date": "2020-03-27T14:19:38.000Z",
          "Titre": "Your iPad overs are terrible",
          "Contenu": "Your iPad overs are terrible! Very cheaply made"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Aakash Shah",
          "Nb_Reviews": 1,
          "Date": "2020-03-15T20:16:12.000Z",
          "Titre": "The bags stitches  are already coming…",
          "Contenu": "The bags stitches  are already coming out."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert Jacobs",
          "Nb_Reviews": 3,
          "Date": "2023-07-13T10:46:30.000Z",
          "Titre": "I lie the protective features of the…",
          "Contenu": "I lie the protective features of the case, but you can not charge your pencil without removing the iPad from the case."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Vince S.",
          "Nb_Reviews": 1,
          "Date": "2021-05-03T00:17:13.000Z",
          "Titre": "I purchased a laptop bag and…",
          "Contenu": "I purchased a laptop bag and immediately wanted to exchange it for a size down. Targus informed me they don't do exchanges, but that I could return it at my expense for a refund. I did that, but when they issued the refund they deducted what they initially spent to send it to me. Other companies offer free shipping and returns, but Targus does not. Given the difficulty and loss of money trying to make an exchange I decided to not buy from them online again. I'll buy from a brick and morter store in the future and maybe another brand."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 2,
          "Date": "2020-11-02T17:43:32.000Z",
          "Titre": "Pro-Tec Rotating Case for iPad Air 4th Gen",
          "Contenu": "Purchased two new cases for our two new iPad Air 4th Gen that just came out but when the case is on it is very difficult to access the Touch ID button and the volume buttons! It is the Pro-Tec Rotating Case $44.99 Not happy at all!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Connor L",
          "Nb_Reviews": 3,
          "Date": "2021-01-12T00:30:31.000Z",
          "Titre": "Good but pretty major flaw",
          "Contenu": "I ordered a case for my brand new iPad Air 4th generation. While I do like it, there is a serious design flaw that seems to have been overlooked. On the new iPad Air, the Touch ID is done on the power button itself at the top of the iPad. On the case, there is a huge plastic bumper on the corner that makes it nearly impossible to use the Touch ID function while the iPad is in the case. Fortunately, I’m pretty handy with an exacto knife and took the plastic bumper off on the corner in question, but I shouldn’t have needed to.Given that my case purchase was advertised to be compatible with the iPad Air 4, I’m slightly disappointed in this product. It’s a great case and it’s done its job so far, but I’d worry it might fail if I dropped it on the corner in question. For 50 bucks a pop you’d think they would think about these things before manufacturing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Altrecia Jackson",
          "Nb_Reviews": 1,
          "Date": "2021-01-03T15:31:04.000Z",
          "Titre": "I received my order in record time only…",
          "Contenu": "I received my order in record time only to learn that customer support is offer Monday thru Friday 7 am-4 pm. What are working customers to do for assistance?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "J. Allen",
          "Nb_Reviews": 1,
          "Date": "2022-06-07T23:45:02.000Z",
          "Titre": "Good product except that closure…",
          "Contenu": "Good product except that closure magnets are not strong enough—it flops open."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Hazel Austin",
          "Nb_Reviews": 1,
          "Date": "2022-02-08T22:32:05.000Z",
          "Titre": "I got the wrong cord to hook up my fan…",
          "Contenu": "I got the wrong cord to hook up my fan foe my laptop. i talk to a lady about getting the right one. she said she would get back to me in 24-48 hours.I need Model AWE 61. my cord got lost. Please check it out for me"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Quentin Newsome",
          "Nb_Reviews": 1,
          "Date": "2020-03-03T18:40:40.000Z",
          "Titre": "I purchased an awesome backpack with a…",
          "Contenu": "I purchased an awesome backpack with a warranty. When the back pack failed ( shoulder strap unraveled from the backpack body). I was offered a lesser quality back pack as a replacement. I'm glad they are sending me a replacement. But I have to deal with an unproven one verses the one I purchased and loved by the way. Oh yeah. I still have not received my replacement."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brian Heilgeist",
          "Nb_Reviews": 1,
          "Date": "2020-03-03T20:01:19.000Z",
          "Titre": "The orginal package was shipped in…",
          "Contenu": "The orginal package was shipped in material that did not protect the product and it arrived damaged.  They did replace it pretty quickly and sent it the second time in a sturdy box that the protected it.The turn around didn't take too long (about a week for the second delivery) but this was a time sensitive shipment so I think a 3 star is fair."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gayle in Minnesota",
          "Nb_Reviews": 3,
          "Date": "2020-03-03T21:14:56.000Z",
          "Titre": "YOU did fine!",
          "Contenu": "YOU did fine!! Unfortunately for me, I cannot use this device on my laptop. Evidently it is too old, or does not have a driver, or something it should have, but ONLY the non-numeric keys work on my computer. I've tried it on my grandson's school notebook when he brought it home and it works!! Any suggestions would be appreciated."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeannie Rudd",
          "Nb_Reviews": 1,
          "Date": "2020-03-03T19:52:11.000Z",
          "Titre": "I really loved my old Targus i pad…",
          "Contenu": "I really loved my old Targus i pad cover, so ordered from you again for my new i pad.  The new one was not near as nice or as sturdy as the old cover.  The swivel is very hard to turn and the leather is of a lower grade.   Wish you would go back to the previous construction, It would be well worth it, even if you had to raise the price."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "bl",
          "Nb_Reviews": 1,
          "Date": "2020-03-04T01:22:13.000Z",
          "Titre": "Good Product, Bad Site",
          "Contenu": "The product is very good. Love the brand. However, the site is not very good. Filtering to try the backpack for my needs was cumbersome and time consuming. Product pictures are good but impossible to get a sense of scale. The product names are overdone. Why not have a urban/city category instead including it in the product name."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marie Giles",
          "Nb_Reviews": 1,
          "Date": "2020-03-03T22:32:09.000Z",
          "Titre": "substantial but closure needs help",
          "Contenu": "this cover is substantial and i am confident it will protect my iPad, however i am having a difficult time with the clasp.  Each time you attempt to close it you need to purposely visualize the connection, than it still needs a forceful push to close the clasp.   The front flap tends to shift just enough so as to hamper the closure"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tom Woodward",
          "Nb_Reviews": 1,
          "Date": "2020-03-04T04:30:02.000Z",
          "Titre": "Not a home run this time !",
          "Contenu": "Overall, the Targus quality is there, but I was led to believe that the item I purchased included the ability to have Screen rotation from landscape to portrait...unfortunately not with this case...In addition, it took forever to find a Targus case that would fit my new 10.2” IPad...I am still a fan, but would gladly trade this case for the one I thought I was buying mentioned above...actually, I am not sure Targus has produced that style yet for the 10.2” size IPad...Bummer !"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Karen",
          "Nb_Reviews": 2,
          "Date": "2020-03-03T19:26:26.000Z",
          "Titre": "I searched for travel size laptop mice",
          "Contenu": "I searched for travel size laptop mice.  The one I chose turned out to be a standard size mouse -- very nice mouse, but not the small travel size I wanted. (I did have one previously years ago that was real nice, but was wearing out.)  The next one I purchased (MS) had a flat cord which broke within a year."
        },
        {
          "Note": 3,
          "Lieu": "PH",
          "Pseudo": "Brea",
          "Nb_Reviews": 1,
          "Date": "2022-03-01T13:20:21.000Z",
          "Titre": "Happy with the purchase",
          "Contenu": "Happy with the purchase. thanks"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kevin Nelson",
          "Nb_Reviews": 1,
          "Date": "2020-03-03T21:40:43.000Z",
          "Titre": "It’s not anything like the older one i…",
          "Contenu": "It’s not anything like the older one i bought 4 years ago. So I’m not even using it. Bought a different brand."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Danah Harper",
          "Nb_Reviews": 2,
          "Date": "2020-03-03T19:10:15.000Z",
          "Titre": "Cover",
          "Contenu": "Like the cover itself, color is lacking"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "PJ",
          "Nb_Reviews": 2,
          "Date": "2023-08-04T02:06:58.000Z",
          "Titre": "Website structure made it easy",
          "Contenu": "Thoughtful approach in grouping your product made it easy identify the bags best served my need."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul Mainville",
          "Nb_Reviews": 2,
          "Date": "2021-07-06T21:47:09.000Z",
          "Titre": "My order came early which was great",
          "Contenu": "My order came early which was great. Only thing was delivery person spoke very little english and called me to inquiry on apartment number. Took several tries to make me understand and for him to comprehend. Fortunately I was able to pullover while driving and get this cleared up.Thank you."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "theoldandgrey",
          "Nb_Reviews": 14,
          "Date": "2022-02-22T09:31:24.000Z",
          "Titre": "A little redesign would improve things",
          "Contenu": "Love the case and quality after I had stood on. my head to put my iPad in it. Disappointed however that it is so difficult to activate on/off and sound switches as the case makes them so recessed.  A little design change would be good and if it does come about a discount on a new model please😀😀 in order to trial it for those with arthritic hands etc."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephanie",
          "Nb_Reviews": 1,
          "Date": "2021-04-09T11:06:59.000Z",
          "Titre": "This bag is well made and looks fashionable",
          "Contenu": "This bag is well made. I am a teacher and have so much to carry home and it fits everything.  It is comfortable wit padded straps, a padded compartment for my computer and room for binders and papers.  It is a great size but also sleek enough to look professional."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Janina B.",
          "Nb_Reviews": 2,
          "Date": "2021-01-04T18:10:45.000Z",
          "Titre": "I’ve used Targus iPad holders for years…",
          "Contenu": "I’ve used Targus iPad holders for years now because they’re strong and reliable and I love being able to swivel from portrait to landscape easily. This holder is for my 4th gen iPad Air. As usual, it was a bit of a struggle to put the device in place, but the snug fit is good and protective. It did take me a while to realize the design change that removed the disc that used to turn. Now there’s just an open circle, through which the Apple logo shows. A note about that on the package would have been helpful. Great product!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ray Good",
          "Nb_Reviews": 1,
          "Date": "2022-10-21T19:35:59.000Z",
          "Titre": "very tight fit",
          "Contenu": "My iPad mini 2 would only fit when I removed the screen protector I had on my iPad otherwise this would have been a 5 star review."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "oldnfast",
          "Nb_Reviews": 2,
          "Date": "2022-01-11T21:29:04.000Z",
          "Titre": "Quality is better than expected",
          "Contenu": "Quality is better than expected, only found one issue of note.It is very difficult to access the “home” button on the side of the IPad."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brendan",
          "Nb_Reviews": 4,
          "Date": "2021-03-04T07:56:21.000Z",
          "Titre": "Wonderful store",
          "Contenu": "Wonderful store, they have a variety of electronics to offer. Great customer service as well. Will buy from them again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Geo Howard",
          "Nb_Reviews": 2,
          "Date": "2022-10-12T00:28:20.000Z",
          "Titre": "Shopping on your site was pretty easy…",
          "Contenu": "Shopping on your site was pretty easy and all went well until I tried to enter a discount code I had been provided by you. The code would not work and I wound up paying full price. But the price was OK so I did not mind too much."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marion Helms",
          "Nb_Reviews": 1,
          "Date": "2021-07-06T18:46:22.000Z",
          "Titre": "I really like your laptop chill pads, but,...",
          "Contenu": "I really like your laptop chill pads, but, after about 6 months they start making noise and I have to buy a new one. Is there some way to lubricate the fans?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dennis A. Rogers",
          "Nb_Reviews": 1,
          "Date": "2021-05-03T19:06:47.000Z",
          "Titre": "Quality product but delivery was late…",
          "Contenu": "Quality product but delivery was late by 3 days and tracking was not reliable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel Ramirez",
          "Nb_Reviews": 1,
          "Date": "2021-10-05T16:53:00.000Z",
          "Titre": "Great quality",
          "Contenu": "Great quality, enough space and comfortable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mary Stevenson",
          "Nb_Reviews": 2,
          "Date": "2021-04-07T22:07:21.000Z",
          "Titre": "4 Stars",
          "Contenu": "I would give you 5 stars but since I had to pay for shipping only 4"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jacquelyn Weber",
          "Nb_Reviews": 2,
          "Date": "2022-01-05T00:46:55.000Z",
          "Titre": "Better directions would be nice."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dennis Webb",
          "Nb_Reviews": 1,
          "Date": "2020-06-27T16:06:30.000Z",
          "Titre": "I desired a choice of color."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Frank Zeak",
          "Nb_Reviews": 1,
          "Date": "2020-05-05T00:04:16.000Z",
          "Titre": "I knew exactly what I was ordering...",
          "Contenu": "I liked my original Targus case for my iPad.  Sadly, the clasp broke.  So when I saw the same case on sale for about 70% off, I bought it again.  My expectation is that it will last a year and the clasp will break again, but for the price, it will be worth it.  I'm hoping the new case will surprise me..."
        },
        {
          "Note": 4,
          "Lieu": "UZ",
          "Pseudo": "Roman",
          "Nb_Reviews": 1,
          "Date": "2020-11-03T03:31:25.000Z",
          "Titre": "The long delivery from 35"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Haberman",
          "Nb_Reviews": 1,
          "Date": "2023-02-09T02:59:40.000Z",
          "Titre": "Very nice product",
          "Contenu": "Enjoyed  my new bag very easy to carry"
        },
        {
          "Note": 4,
          "Lieu": "TH",
          "Pseudo": "Scott Stufflebeam",
          "Nb_Reviews": 1,
          "Date": "2020-03-03T18:28:51.000Z",
          "Titre": "I wish it were as good as it used to be....",
          "Contenu": "Many changes have been made to this bag, I assume to remove costs from the production.  The zipper pulls are cheaper, the internal tablet pocket uses velcro now instead of a zipper. It is still a good bag, I just wish it was as good as it used to be."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mathieu van den Bergh",
          "Nb_Reviews": 2,
          "Date": "2020-03-16T22:17:49.000Z",
          "Titre": "OK on time",
          "Contenu": "OK on time, but driver tossed package over the property gate. Fortunately, you notified us that delivery had been made, so we could go to the gate and pick it up.Next time, I would appreciate that the driver at least rings the bell at the gate"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "llpac",
          "Nb_Reviews": 1,
          "Date": "2020-03-10T18:38:08.000Z",
          "Titre": "Overall I am happy!",
          "Contenu": "Arrived promptly and fits correctly. It's a bit unwieldy for around the house. I wish the cover detached from the case for times when I'm not hauling it around. Overall I am happy with it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rosemarie Lee",
          "Nb_Reviews": 1,
          "Date": "2020-03-03T20:21:51.000Z",
          "Titre": "I love the case",
          "Contenu": "I love the case. It is my second one.  It keeps my iPad secure and protected.  However the clasp is difficult to open and close."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Roland Pangu",
          "Nb_Reviews": 1,
          "Date": "2020-03-03T19:14:12.000Z",
          "Titre": "My overall experience was great.",
          "Contenu": "My overall experience was great.The representative I talked too, seemed knowledgeable and was able to answer all my questions."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Brea",
          "Nb_Reviews": 1,
          "Date": "2022-02-15T02:46:25.000Z",
          "Titre": "Happy with the purchase",
          "Contenu": "Happy with the purchase. thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "C. A.",
          "Nb_Reviews": 1,
          "Date": "2020-03-21T00:30:25.000Z",
          "Titre": "Checkout process was good",
          "Contenu": "Checkout process was good. A compare feature between some of the products would make product selection much easier."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steven Kennedy",
          "Nb_Reviews": 1,
          "Date": "2020-04-09T19:47:12.000Z",
          "Titre": "Shipped fast and love the ease of…",
          "Contenu": "Shipped fast and love the ease of switching between laptops with just one plug. I would recommend this product"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Timothy J Taylor",
          "Nb_Reviews": 1,
          "Date": "2021-12-08T23:53:32.000Z",
          "Titre": "Very good sum’s it up",
          "Contenu": "Very good sum’s it up. Nobody is great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Will",
          "Nb_Reviews": 2,
          "Date": "2020-06-02T18:08:04.000Z",
          "Titre": "Order was fulfilled very promptly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "pasogal47",
          "Nb_Reviews": 4,
          "Date": "2020-04-03T05:55:03.000Z",
          "Titre": "Fast service have to get screen fixed to use screen protector I ordered.",
          "Contenu": "Fast service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "One of Santa’s elves",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T17:45:16.000Z",
          "Titre": "Successful Christmas shopping visit",
          "Contenu": "The site interface was good. I was able to find what I needed and browse without trouble."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Philip Harrison",
          "Nb_Reviews": 2,
          "Date": "2023-11-14T18:49:29.000Z",
          "Titre": "Targus had the protective tablet cover…",
          "Contenu": "Targus had the protective tablet cover I was looking for. It is the third Targus cover I’ve had, one for each iPad I’ve owned. The covers have been great, protecting well, and are also durable. Plus, my order arrived on the date promised."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Gaetan",
          "Nb_Reviews": 2,
          "Date": "2023-10-26T17:47:23.000Z",
          "Titre": "Serious & reliable company",
          "Contenu": "I buyed the Gamer Strike I backpack 2 years ago. The product is very well designed and good quality, but the zip has broken few days ago (I've been using it literally every day in various conditions). The customer support has been kind and reactive, and is sending a replacement bag to me. I recommend this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "G Bush",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T17:46:03.000Z",
          "Titre": "Good service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "K smith",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T04:03:18.000Z",
          "Titre": "Well made",
          "Contenu": "Easy transaction on the site. Good communication for shipping. Laptop bag is well made and good quality. Not like some others out there"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BANKY",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T12:09:49.000Z",
          "Titre": "PACKAGE WAS DELIVERED WELL AND ON TIME",
          "Contenu": "PACKAGE WAS DELIVERED WELL AND ON TIME. THANK YOU."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bruce Nayowith",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T19:05:53.000Z",
          "Titre": "quick shipping, good fit",
          "Contenu": "I had bought a Targus charging adapter kit for my Acer notebook about 2 years ago after the original one died.Over the past weeks, I noticed that the tip was not seating as well as it used to, and was not consistently charging. I figured that the tip was worn from my repeated plugging and unplugging it into my laptop.I bought a replacement tip, and it fits very snug - works great now. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marvin",
          "Nb_Reviews": 6,
          "Date": "2023-10-11T23:51:48.000Z",
          "Titre": "I received the Targus sale promotion…",
          "Contenu": "I received the Targus sale promotion while I was out of town for work.  I took View of the product description and decided to go for it.  When I arrived back home the package was there and the product worked just fine.  It’s not fast but it does the job."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pilar Romero",
          "Nb_Reviews": 3,
          "Date": "2022-06-30T21:24:30.000Z",
          "Titre": "Thank you Hyrun",
          "Contenu": "Thank you Hyrun! You are an outstanding CSR, I appreciate your patience and the time yo spent guiding me step to step to find the model of my old IPad, to find the right case for it. You went the extra mile with exceptional courtesy, knowledge, professionalism and your voice demeanor it was always friendly. I like to take the time to speak with a manager or write a review when I get superb service. Thank you again and keep doing an excellent  job! By the way my Targus old case retired after  more than a decade and was able to survive  the pandemic. Great product!!!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Michael from London.",
          "Nb_Reviews": 23,
          "Date": "2020-08-05T14:00:02.000Z",
          "Titre": "Quite unsual Company in today’s…",
          "Contenu": "Quite unsual Company in today’s climate.Not only great quality product at very reasonable price,their’s Customer Support is second to none.They contacted me twice with the latest updates on delivery to put my mind at rest that parcel will arrive before I go away on holiday,as DHL tracking system was slow on updates.What a contrast to so many firms with good products to sell but failing on Customer Service area.Thank you Targus."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DaNice D. Marshall",
          "Nb_Reviews": 2,
          "Date": "2021-05-05T19:45:31.000Z",
          "Titre": "Targus Bag #NewportCollection",
          "Contenu": "Great bag! Well padded, compartments and expandable.  The only problem was the color selections are limited, a bit drab for my outgoing personality during a pandemic!  My solution was to paint the bag.  So, I did and now it’s truly fabulous!!!  Even @Targus has liked my Twitter post of my bag :)You can check out the photos of my Targus bags on my social media platforms, over 7k followers like what I’m doing.  It’s refreshing to know that @Targus likes it too :)I’m interested in partnering and would love to know your thoughts.  Read the review, check out my bag & let me know.  Thanks in advance!Instagram: @danice_d_marshallTwitter: @danicedmarshall"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary Ann Treutle",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T00:49:37.000Z",
          "Titre": "This is my third target purchase",
          "Contenu": "This is my third target purchase, my first two being covers for my iPads. This third purchase is a briefcase to hold my apple notebook and its assorted items. I love that the color. Is dark gray so it won’t show dirt very well and should look  nice for a very long time. but that is all incidental. the targets products are so well constructed and intuitive.I just love your products, and I would love them even more if they were made in America!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pilar Romero",
          "Nb_Reviews": 3,
          "Date": "2022-07-08T05:55:58.000Z",
          "Titre": "Thank you Tafari/ great product!!",
          "Contenu": "Targus customer service...you did it again!!! Two times in a row, thank you Tafari for your outstanding help. I’m impress with CSR at Targus, very knowledgeable, professional, polite, patient and friendly people. I got the case for my IPad mini 2 (5th.generation),OMG is even better than the original, I love it, I love it so much that I went ahead and order a second one, just in the event they discontinue it in the future. Waiting for the arrival of my order. Thank you Targus for the CSR and your products!!!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Simon Crowe",
          "Nb_Reviews": 49,
          "Date": "2020-12-30T12:41:55.000Z",
          "Titre": "Thank you Helene!",
          "Contenu": "Excellent customer service.I screwed up when placing an order, entering the wrong delivery address.  I phoned the number on the website and spoke to Helene.  Not only did she fix the problem, but along the way I found out that she knew and could use the UK Phonetic Alphabet.  There's not much of that about...."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joel B.",
          "Nb_Reviews": 1,
          "Date": "2021-06-08T17:53:57.000Z",
          "Titre": "Great Laptop Case at a Fair Price",
          "Contenu": "Surprisingly, the only case offered by Targus without wheels capable of handling a 17\" laptop. Case is high quality, well put-together, great lifetime warranty, at a fair price when the 15% off coupon is applied."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sue Seitz",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T23:29:44.000Z",
          "Titre": "Website was easy to navigate",
          "Contenu": "Website was easy to navigate. Timely delivery notification. Only minor concern is cover doesn’t rotate like my previous covers from Targus."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Daniil",
          "Nb_Reviews": 2,
          "Date": "2020-08-26T15:43:25.000Z",
          "Titre": "Great customer service and support! Great products, too!",
          "Contenu": "I had great experience with Targus! Their customer service agents were all absolute starts! They were kind and sympathetic and were always ready to help out, also I have never waited more than 1 minute before an advisor answered!!! I had shipping problems with the delivery company(they lost my parcel, containing their lovely backpacks) and Targus were nice enough to send replacement ones just right before my holiday! I’ve already had the same backpack 5 years ago, so I decided I need to get myself the same one, because they are very durable, sleek and versatile. 10/10 would recommend and will definitely shop with them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elizabeth",
          "Nb_Reviews": 2,
          "Date": "2023-11-06T17:54:21.000Z",
          "Titre": "Timely delivery",
          "Contenu": "Timely delivery, good quality.  But, exchanging for nest size up."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DaNice D TechnyGal Marshall",
          "Nb_Reviews": 4,
          "Date": "2021-06-09T13:48:47.000Z",
          "Titre": "I love my Targus bag!",
          "Contenu": "I love my Targus bag!  Made from superior material & quality craftsmanship, my Targus bag protects all of my our devices.  But, it’s also just black.  And that’s a problem at the airport or train station, because everyone’s bag looks exactly like mine.  Nowadays traveling is hectic enough, who needs added anxiety over whose bag is which?  Not me, I’m already running late lol. I’m an artist & I’ve embarked on a new journey to paint Targus bags!  It’s just the way I roll.  Do you like it?  Let me know, you might just snag one for yourself. btw I’m an independent artist.#ThinkingOutsideTheBag"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott M.",
          "Nb_Reviews": 5,
          "Date": "2022-01-11T20:24:11.000Z",
          "Titre": "Best Ipad Covers Ever",
          "Contenu": "I've been using Targus ipad covers since the first generation of ipads. I buy them because they're built to last, and have protected my gear through drops, spills, and thousands of hard travel miles. It's the only cover I'll ever use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GardenGal",
          "Nb_Reviews": 1,
          "Date": "2022-02-03T19:15:51.000Z",
          "Titre": "I looked everywhere for the features I…",
          "Contenu": "I looked everywhere for the features I wanted in my laptop case.  Finally found what I wanted on the Targus website.  Much easier and knew I would get what I expected if I ordered straight from the source.  I couldn't be happier with my purchase and will recommend the Targus brand to any friends or co-workers looking for the perfect laptop case.  It is sturdy and the material is of good quality.  It is also lightweight which was one of my must-haves.  The strap is just wonderful - it is excellent quality, doesn't slip on my shoulder and is not bulky at all.  Best of all, my Surface keyboard can stay attached and when ready to travel, fold it up, secure it with the cord, and go."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Federico Lopez",
          "Nb_Reviews": 1,
          "Date": "2022-04-04T19:14:41.000Z",
          "Titre": "I give them a high five",
          "Contenu": "I give them a high five, because I been purchasing computer accessories and backpacks with  Targus received recently. The package was sealed and secure with the delivery. I don't have any problems receiving delivery. Thank you Targus. F.L."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TJ Hundley",
          "Nb_Reviews": 2,
          "Date": "2021-09-01T19:44:45.000Z",
          "Titre": "I'm impressed with my Newport Drawstring Backpack",
          "Contenu": "The size and construction of my new 15\" Newport Drawstring Backpack is what I'm impressed with at first glance.  I plan on using my backpack to hold my Business books and school supplies while attending the local junior college for  the Spring semester."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brent Sherman",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T19:33:13.000Z",
          "Titre": "I mistakenly ordered the wrong case for…",
          "Contenu": "I mistakenly ordered the wrong case for my tablet. I was assisted with the return of the one I ordered in error, and received in a very timely fashion the replacement I purchased as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa Melonçon",
          "Nb_Reviews": 1,
          "Date": "2020-11-02T23:06:34.000Z",
          "Titre": "Long time fan of targus products…",
          "Contenu": "Long time fan of targus products because of the quality and durability. This one fits that mold. The color red is also perfect. Ordering and delivery was timely and worked as promised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pilar Romero",
          "Nb_Reviews": 3,
          "Date": "2022-07-10T03:56:34.000Z",
          "Titre": "Ten stars for Product,CSR and fast delivery",
          "Contenu": "Yayyy!!!! I got my second mini2 IPAD, I love it. It came super fast, faster than I expected. I will give 10 stars for Great Product, outstanding CSR and super fast an furious delivery, many thanks Targus. ⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patricia Sanchez",
          "Nb_Reviews": 1,
          "Date": "2021-01-04T22:36:12.000Z",
          "Titre": "My sons music teacher is the one…",
          "Contenu": "My sons music teacher is the one actually who has used your products and recommended your cover for my son's iPad pro 11. It was on sale was the best part The product is very durable flexible and will last a lifetime. I was able to search other products that I can use. They are worth the price due to the durability of product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KP",
          "Nb_Reviews": 1,
          "Date": "2020-11-02T21:17:17.000Z",
          "Titre": "Universal Laptop Charger",
          "Contenu": "I purchased this unit to replace a Targus universal charger that failed. Even though it is almost twice the price of other chargers, I believe it's one of the most reliable on the market. The previous unit lasted 5 years, including dozens of domestic and international trips. I almost always carry 2 laptops and carrying one universal charger (with a USB charging port) makes my backpack a little lighter."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Bateman",
          "Nb_Reviews": 2,
          "Date": "2023-02-14T11:39:32.000Z",
          "Titre": "Targus adapter",
          "Contenu": "lI purchased this adapter so that I could use it for my cpap machine and to charge my phone while in New Zealand. It works great and since it is compact it takes up very little room in my backpack."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vickie",
          "Nb_Reviews": 1,
          "Date": "2020-08-03T18:11:05.000Z",
          "Titre": "Great job from placing my order to…",
          "Contenu": "Great job from placing my order to shipping and delivery in a timely manner. Following my order on your tracker was fun. I wish everyone did it like you do.Count me in for future orders. Vickie.  Sunnyvale ca. 🐈🐈🐈🕊🥰"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amanda  Vinson",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T20:11:45.000Z",
          "Titre": "Order process a breeze & fast delivery…",
          "Contenu": "The order process was a breeze & delivery was fast! Product quality is great. My go to brand for totes & work supplies."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Victoria Victor",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T00:39:10.000Z",
          "Titre": "Quick response to my email providing…",
          "Contenu": "Quick response to my email providing links to the type of product I was looking for and couldn't find on the website. Product was exactly what I was looking for. I ordered it and it arrived within a few days. Excellent work, Targus!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donald",
          "Nb_Reviews": 1,
          "Date": "2020-12-01T05:03:39.000Z",
          "Titre": "Site was great, excellent products.",
          "Contenu": "Site was good, choices well understood; I was able to make a selection and answer my own questions because of the descriptions and photos. Happy with the excellent value and quality.  Thank you very much!  Don"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janis",
          "Nb_Reviews": 1,
          "Date": "2022-12-05T21:35:51.000Z",
          "Titre": "When Traveling by Plane",
          "Contenu": "It's the perfect carry-on when traveling by plane to accompany my carry-on suitcase.  Everything fits - my laptop, my purse, snacks, etc.  Plus, the shoulder straps come in handy.  Love it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "S Jones",
          "Nb_Reviews": 2,
          "Date": "2023-03-03T16:37:29.000Z",
          "Titre": "This Targus case is best",
          "Contenu": "This Targus case is the third one I have purchased for three different iPads.  I am very pleased with the design, quality, and convenience.  Yes, I will purchase a Targus for the next iPad.  Thank you for making the just right case."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T00:15:35.000Z",
          "Titre": "This is my second purchase with you and…",
          "Contenu": "This is my second purchase with you and your product, and I was pleased the first time and pleasantly pleased with your service with the second purchase. Thank you for such wonderful customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "S McCay",
          "Nb_Reviews": 2,
          "Date": "2022-12-05T22:51:57.000Z",
          "Titre": "I own a Targus back pack I have had for…",
          "Contenu": "I own a Targus back pack I have had for YEARS.  Guessing 8-10.  It is stuffed full of work items and wieghs about 21 lb.  Before this I have purchased computer bags, brief cases, laptop accessories, you name it.  Never a problem.  Began looking for a travel backpack with a luggage dolly strap.   My exisitng BP did not have one and proved to be awkward on flights.  I just bought the Targus Conquer.  It is expandable so I can use it on hikes in a minimal state, and its \"stuffability\" looks to be great when on a flight. I DO NOT like the fact that the products by Targus are all made in China.  However, my history with the company has been so good...I had to come back."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "A Targus Fan",
          "Nb_Reviews": 1,
          "Date": "2021-12-06T22:27:04.000Z",
          "Titre": "I wanted a new cover for my IPad just…",
          "Contenu": "I wanted a new cover for my IPad just like the last one I had.  Was able to order directly from Targus and got it quickly.  It is the perfect cover, rotates 360 degrees and is durable.  Love it!  That's why I wanted a replacement and was lucky enough to find it on Targus website."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DaNice D TechnyGal Marshall",
          "Nb_Reviews": 4,
          "Date": "2021-06-09T19:00:44.000Z",
          "Titre": "My Targus laptop bag is great!",
          "Contenu": "My Targus laptop bag is great!  But I was just thinking, after a pandemic who wants just a basic black laptop bag?  Not me.  So I painted my Targus bag & now look!  I’ll be able to find my bag at the airport.  Pretty cool, right?  Yup, I think so too.  Hey Targus, let me know what you’re thinking, you might be able to snag one of these bags. #LookOutsideTheBag #ampainting"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Ramirez",
          "Nb_Reviews": 4,
          "Date": "2020-11-05T19:08:14.000Z",
          "Titre": "Tough to get on to the iPad Air (latest…",
          "Contenu": "Tough to get on to the iPad Air (latest model)It was a bit of a struggle getting the case on to the iPad. However I feel confident that this case will protect my iPad Air. I really enjoy that I can use this case with my iPad in Horizontal and Vertical mode. I would recommend to any one needing a case for their iPad."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joshua Cheney",
          "Nb_Reviews": 1,
          "Date": "2021-02-09T00:03:12.000Z",
          "Titre": "I order a Microsoft surface safety case…",
          "Contenu": "I order a Microsoft surface safety case and it was a perfect fit for my device. It was sent in a neat package and the order was set in a timely manner the sale was also easy to conduct but could have used a bit more of a selection amd some online customer service associates would have been a great touch but the price was right amd it was well worth the money because my device is protected thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Juan Sebastián Echeverri",
          "Nb_Reviews": 1,
          "Date": "2020-07-01T18:51:32.000Z",
          "Titre": "Great product",
          "Contenu": "Great product, a great evolution of a previous case for an iPad that I had around 2012. Now this version for the seventh generation feels so good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ROMEO MARZSO",
          "Nb_Reviews": 3,
          "Date": "2021-11-08T19:22:37.000Z",
          "Titre": "Excellent product for my new 12.9 IPad…",
          "Contenu": "Excellent product for my new 12.9 IPad 2021 . I had a Targus for my old 12.9 IPad 2016 wit was perfect. This new case is even better…better material,better feel. Thank y"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brett Ferrel",
          "Nb_Reviews": 1,
          "Date": "2022-08-03T21:47:26.000Z",
          "Titre": "Thank you Targus for a great customer…",
          "Contenu": "Thank you Targus for a great customer service experience with my return.  Everyone I've spoken to was courteous, polite and very helpful.  I'll continue to use and recommend Targus products in the future"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fred Kinney",
          "Nb_Reviews": 1,
          "Date": "2022-12-05T20:09:29.000Z",
          "Titre": "Had a small issue with the original…",
          "Contenu": "Had a small issue with the original delivery customer service was excellent especially Holly Johnson.The stylus pen works really well I will definitely be using Targus again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dianne Cermak",
          "Nb_Reviews": 2,
          "Date": "2022-04-12T16:36:07.000Z",
          "Titre": "Protective, secure, handsome",
          "Contenu": "It holds my iPad securely, seems to protect it when dropped (although it does not stay closed), the color and finish are attractive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Margie Kirkendall Customer",
          "Nb_Reviews": 5,
          "Date": "2021-02-08T19:45:24.000Z",
          "Titre": "Good product and very prompt service",
          "Contenu": "Good product and very prompt service.  However, I've ordered twice and each time I have received an email saying I have left things in my shopping cart. Since both items were delivered, I answered one email telling them that."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jenny",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T04:34:42.000Z",
          "Titre": "Fantastic product",
          "Contenu": "Fantastic product. I can now play games with intense graphics on my lap, without the laptop overheating."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rodney Meyer",
          "Nb_Reviews": 1,
          "Date": "2021-02-02T20:50:53.000Z",
          "Titre": "Delivery never",
          "Contenu": "Delivery never received.  Fedx indicated via a text message that it was delivered at 1:27 PM.  Checked.....no delivery.  Checked neighbors.....no delivery."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephan Helgesen",
          "Nb_Reviews": 2,
          "Date": "2022-06-01T18:31:07.000Z",
          "Titre": "While I was unable to register my…",
          "Contenu": "While I was unable to register my newly-purchased backpack (Urban Expandable) on the website because it didn't recognize the product number I WAS able to do so with the help of a very able support person. She was friendly and quick and I appreciated her style and problem-solving."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eduardo Arango",
          "Nb_Reviews": 6,
          "Date": "2022-05-02T17:56:13.000Z",
          "Titre": "VERY COMFORTABLE AND PROTECTS AGAINST GERMS",
          "Contenu": "HAVE NOT SEEN MY TARGUS COVER YETBUT IT SEEMS VERY COMFORTABLE WILL LET YOU KNOW LATER IF YOU SEND ME ANOTHER SURVEYTHANKS"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carolyn King",
          "Nb_Reviews": 2,
          "Date": "2023-05-11T22:19:24.000Z",
          "Titre": "I am happy I bought this bag",
          "Contenu": "I am happy I bought this bag, even loaded up it is not to heavy. I also like the ability to organize with the different pockets. I wished it came in navy, then I would have two."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda Halpern",
          "Nb_Reviews": 2,
          "Date": "2023-05-02T18:16:46.000Z",
          "Titre": "I have bought a Targus cover each time…",
          "Contenu": "I have bought a Targus cover each time I bought a new iPad. I like the way it protects my iPad and turns 360 around so I can view the screen in all directions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Actual human review",
          "Nb_Reviews": 1,
          "Date": "2023-02-03T18:54:01.000Z",
          "Titre": "Cover for IPad Air 4th gen",
          "Contenu": "Cover for IPad Air 4th gen - good product at a good price, delivered in a reasonable amount of time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sharon Burleson",
          "Nb_Reviews": 1,
          "Date": "2021-10-07T01:46:25.000Z",
          "Titre": "I’ve always used Targus products to…",
          "Contenu": "I’ve always used Targus products to protect my iPad. Second time ordering direct, I can’t find the correct sizes out in the stores. I have the iPad Pro and the Air. Both are well protected! Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephanie",
          "Nb_Reviews": 1,
          "Date": "2021-04-06T04:43:43.000Z",
          "Titre": "Amazing product and they shipped super…",
          "Contenu": "Amazing product and they shipped super fast! I received my case within a week. I will definitely order from Targus again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sanghyon Kim",
          "Nb_Reviews": 2,
          "Date": "2023-07-10T23:20:55.000Z",
          "Titre": "It has a good quality  and the beg's…",
          "Contenu": "It has a good quality  and the beg's protection is better than other back packs"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TG Terry",
          "Nb_Reviews": 3,
          "Date": "2021-09-10T09:44:18.000Z",
          "Titre": "Works much better than the similar…",
          "Contenu": "Works much better than the similar Samsung docking station for the Note Smartphones. I would recommend this item."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris D",
          "Nb_Reviews": 1,
          "Date": "2020-12-02T11:02:53.000Z",
          "Titre": "Absolutely love love my tablet case",
          "Contenu": "Absolutely love love my tablet case, but wrong size and you guys don't carry my size..Just wished it was refundable and wasnt.."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T17:53:08.000Z",
          "Titre": "Docking Station",
          "Contenu": "Great support to determine the correct product. Very knowledgeable of products.Easy ordering and fast shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Moss",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T00:25:33.000Z",
          "Titre": "Nice backpack",
          "Contenu": "Nice backpack, very well made.  Seems smaller than it is (a good thing).  Exactly as described, and a great value, if it holds up…"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greg West",
          "Nb_Reviews": 2,
          "Date": "2022-06-07T19:49:13.000Z",
          "Titre": "Amazing products at great price!",
          "Contenu": "Always my first choice in companies because of their amazing products at great prices!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leslie Marshall",
          "Nb_Reviews": 4,
          "Date": "2021-07-13T19:02:55.000Z",
          "Titre": "I ordered three Targus adapters…Excellent quality!",
          "Contenu": "I ordered three Targus adapters recently. All three shipped the day after I ordered them and all arrived within a week. They are really nicely made and I hope they will last for a long time.  Les (Dripping Springs, Texas)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jane",
          "Nb_Reviews": 2,
          "Date": "2023-03-12T00:07:35.000Z",
          "Titre": "The I pad cover was the wrong size and…",
          "Contenu": "The I pad cover was the wrong size and I was able to return it and get a credit without any problems ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 7,
          "Date": "2020-07-08T19:58:04.000Z",
          "Titre": "The Ipad cover I ordered came promptly",
          "Contenu": "The Ipad cover I ordered came promptly, was exactly as described and the price was excellent.  The quality is very good and I am happy with it.  Glad to have found Targus!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Shipherd",
          "Nb_Reviews": 1,
          "Date": "2020-09-08T15:55:21.000Z",
          "Titre": "The AirPod cover I bought for my wife…",
          "Contenu": "The AirPod cover I bought for my wife was very well received. It is a bit bigger than the one we bought four years ago. It is much easier to keep clean than the earlier model. She loves it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debora Davis",
          "Nb_Reviews": 2,
          "Date": "2020-09-03T17:21:52.000Z",
          "Titre": "Product as advertised",
          "Contenu": "Product as advertised, cost was great and really appreciated the updates on shipping.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edward Anderson",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T21:00:35.000Z",
          "Titre": "The product was as described",
          "Contenu": "The product was as described.  It looks amazing and is highly functional for what I need.  Best product I have used of this type.  I would not use anything else."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RICHARD",
          "Nb_Reviews": 4,
          "Date": "2023-01-03T20:02:08.000Z",
          "Titre": "Website simple to use",
          "Contenu": "Website simple to use. Easy to learn product specifications  and compare products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edwin Lerner",
          "Nb_Reviews": 2,
          "Date": "2022-07-11T17:31:40.000Z",
          "Titre": "Doesn't fit!",
          "Contenu": "The iPad mini 5th generation does not fit in this case–totally disappointed!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Waclo",
          "Nb_Reviews": 1,
          "Date": "2020-12-01T20:54:19.000Z",
          "Titre": "Excellent price and shipping",
          "Contenu": "Excellent price and shipping. Replaced an older Targus model and noted shortcomings have been addressed.👍👍👍"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Letta Lopez",
          "Nb_Reviews": 1,
          "Date": "2020-12-01T23:46:07.000Z",
          "Titre": "The shipping was extremely fast and I…",
          "Contenu": "The shipping was extremely fast and I love the bag. Couldn’t have asked for a better experience!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nadia Castro",
          "Nb_Reviews": 1,
          "Date": "2020-08-03T18:07:52.000Z",
          "Titre": "Order with confidence",
          "Contenu": "Easy to place the order, fast delivery, not a single problem, everything smooth, thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shawnda",
          "Nb_Reviews": 3,
          "Date": "2021-06-15T17:42:02.000Z",
          "Titre": "This was a gift and they absolutely…",
          "Contenu": "This was a gift and they absolutely loved it!! I first purchased one for myself and when others saw it, they wanted one as well!!Now I can give as gifts! A win, win!Great purchase!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gary Kwock",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T20:57:38.000Z",
          "Titre": "It was easy and comprehensive to order.",
          "Contenu": "It was easy and comprehensive to order.Tracking was excellent, received in a better that timely manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ted",
          "Nb_Reviews": 7,
          "Date": "2021-12-13T06:30:56.000Z",
          "Titre": "Targus works well on my iPad 12",
          "Contenu": "Targus works well on my iPad 12. 9. I can comfortably rotate it from vertical to horizontal"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Victor Carroll",
          "Nb_Reviews": 1,
          "Date": "2021-01-05T03:36:50.000Z",
          "Titre": "The service was outstanding",
          "Contenu": "The service was outstanding, kept me informed on the status of my order.  I have one of these for my ipad at work and love it. My wife loves her since I put it on today."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alexia",
          "Nb_Reviews": 1,
          "Date": "2022-09-05T23:51:09.000Z",
          "Titre": "This is exactly what I was looking for",
          "Contenu": "This is exactly what I was looking for, except better price than even Amazon. This case is very well made."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "mmm",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T02:52:54.000Z",
          "Titre": "Just what I wanted",
          "Contenu": "Just what I wanted. A firm cover for my iPad mini that would serve as an easel when viewing and had the go to sleep feature when closed. This is it. Turns on with opening, turns off when closed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Connie  Johnson",
          "Nb_Reviews": 1,
          "Date": "2021-06-02T15:31:07.000Z",
          "Titre": "Product was as described and just like…",
          "Contenu": "Product was as described and just like the one I bought several years ago. It was started to look a little ragged after about 6 years.  Love this case! It’s the best. It even arrived a day early. Thanks for the good service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elizabeth Pouncy",
          "Nb_Reviews": 1,
          "Date": "2020-07-08T20:10:50.000Z",
          "Titre": "I really like the easy order process",
          "Contenu": "I really like the easy order process. Just received my product yesterday and was pleased with that as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Clayton Chandler",
          "Nb_Reviews": 1,
          "Date": "2021-08-02T21:43:46.000Z",
          "Titre": "Monitor support",
          "Contenu": "Monitor support is stable, well measured, attractive, and enhanced with a sliding Tray.  Delivery was timely."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Hopple",
          "Nb_Reviews": 1,
          "Date": "2020-08-08T13:01:27.000Z",
          "Titre": "The briefcase ordered for my new laptop…",
          "Contenu": "The briefcase ordered for my new laptop is exactly what I needed. Ordering was simple and the product arrived as specified. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter Mans",
          "Nb_Reviews": 4,
          "Date": "2023-03-03T17:05:20.000Z",
          "Titre": "Targus ships very quickly",
          "Contenu": "Targus ships very quickly. I usually get my order in 3 business days."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda Helmbrecht",
          "Nb_Reviews": 4,
          "Date": "2020-10-05T14:21:42.000Z",
          "Titre": "Love my iPad case",
          "Contenu": "Love my iPad case. Good quality!Quick delivery, reasonably priced!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2021-04-09T13:56:11.000Z",
          "Titre": "The products I purchased were delivered…",
          "Contenu": "The products I purchased were delivered timely, had great prices, and are made with good quality."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "david brooks",
          "Nb_Reviews": 2,
          "Date": "2020-11-03T22:01:32.000Z",
          "Titre": "The iPad case/cover was everything…",
          "Contenu": "The iPad case/cover was everything advertised and it go t here before the iPad!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Pizzi",
          "Nb_Reviews": 1,
          "Date": "2021-02-01T15:06:42.000Z",
          "Titre": "Fantastic protective  cover / stand for…",
          "Contenu": "Fantastic protective  cover / stand for my iPad Air2!Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bruce Yorio",
          "Nb_Reviews": 3,
          "Date": "2022-04-12T18:56:35.000Z",
          "Titre": "Targus Quality",
          "Contenu": "Fast shipping. Usual high quality & well-designed Targus product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Lux",
          "Nb_Reviews": 1,
          "Date": "2022-04-06T00:21:36.000Z",
          "Titre": "Targus has always delivered my products…",
          "Contenu": "Targus has always delivered my products on time. Very good service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sam Murchison",
          "Nb_Reviews": 1,
          "Date": "2021-04-07T20:22:57.000Z",
          "Titre": "The web site is just fine no issues and…",
          "Contenu": "The web site is just fine no issues and they did address my return very quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Hoebelheinrich",
          "Nb_Reviews": 1,
          "Date": "2021-03-08T20:37:16.000Z",
          "Titre": "All wonderful",
          "Contenu": "All wonderful, my second business backpack.  Love it.  Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathleen D.",
          "Nb_Reviews": 1,
          "Date": "2020-08-03T21:07:46.000Z",
          "Titre": "Product was as advertised",
          "Contenu": "Product was as advertised.  Shipment came in a timely manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chip Uricchio",
          "Nb_Reviews": 1,
          "Date": "2022-01-04T22:08:30.000Z",
          "Titre": "Great product",
          "Contenu": "Great product. Durable, lightweight, easy to use. I highly recommend it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nedra",
          "Nb_Reviews": 4,
          "Date": "2022-06-07T20:55:58.000Z",
          "Titre": "I Love my back pack",
          "Contenu": "I Love my back pack. It is well worth the price. So many compartments. It is streamline but still plenty storage!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vince Johnson",
          "Nb_Reviews": 2,
          "Date": "2021-09-03T17:02:23.000Z",
          "Titre": "Good quality bag",
          "Contenu": "Good quality bag. Perfect size and I just love the color 😍. I got mine on sale and it was shipped and delivered on time. Good bang for the buck!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gokhan Karasu",
          "Nb_Reviews": 1,
          "Date": "2022-03-03T02:39:09.000Z",
          "Titre": "High quality bag with attention to…",
          "Contenu": "High quality bag with attention to detail for a reasonable price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PAM Anderson",
          "Nb_Reviews": 5,
          "Date": "2020-07-06T12:45:42.000Z",
          "Titre": "Good quality & appearancegreg",
          "Contenu": "Good quality & appearance. Efficient device for holding an IPad in horizontal or vertical position.Great product at reasonable price"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Don Phillips",
          "Nb_Reviews": 1,
          "Date": "2020-08-04T02:07:37.000Z",
          "Titre": "Great Product",
          "Contenu": "The case is very well made and was on sale. Shipping was super fast. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Don",
          "Nb_Reviews": 4,
          "Date": "2022-03-03T03:55:19.000Z",
          "Titre": "Quick Shipping",
          "Contenu": "The service in terms of shipping and packaging was fine and on time."
        }
      ]
    }
  ]
}