{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "taskrabbit.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:18:00.000Z",
          "Titre": "The 2nd tasker Mihal was great",
          "Contenu": "The 2nd tasker Mihal was great.  HOWEVER, it appears Taskrabbit willfully does not wish to be contacted via phone or website an AI product is used instead.  If this is correct, this is modeling poor customer service.  My 1st tasker cancelled at the last minute and there was no one to contact for reparations.  Why is it that a tasker can cancel at the last minute, but a customer cannot and will be charged?  How about answering that question?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T00:15:03.000Z",
          "Titre": "The task rabbit guy scammed me",
          "Contenu": "The task rabbit guy scammed me. He told me I owed him an extra $50 to use his truck, and charged me additional money every flight of stairs he had to carry an item, and it wasn't even like he was doing it alone... I was helping carry the item, which also wasn't heavy. He didn't show these additional fees anywhere in the listing, so I was completely blindsided. Just felt very taken advantage of after the task was completed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ralph Cramdon",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T20:28:55.000Z",
          "Titre": "Their communication sucks leaves you scared.",
          "Contenu": "After having problems with my debit card ONLY with Taskrabbit I was told by their support they no longer take debit cards for security purposes. My bank so nothing even trying to come in. They say my card is fine and normal. Money to cover fees are there.I consider this insane and very disappointing. I have given them and IKEA many chances leading to even more frustration. I am dropping the issue at best effort and then some.I will not do business with IKEA and TaskRabbit (supposedly owned by IKEA) again.Have a nice day."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T23:49:11.000Z",
          "Titre": "The tasker took an entire hour just…",
          "Contenu": "The tasker took an entire hour just unboxing and setting up stuff to put together a dresser. It’s unacceptable! She was OCD about placing every little screw in perfect position just as she organized the stuff out of the packaging. Unbelievable! Prepare to pay $60 for an hr of unboxing!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gregory Ledger",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T19:53:12.000Z",
          "Titre": "Tristan D cancelled our first…",
          "Contenu": "Tristan D cancelled our first appointment as he was in a far southern neighborhood. I agreed at  his suggestion to reschedule. He said  he was available all day. At the last minute he cancels again, and then Task Rabbit offere another more expensive tasker but he nor any other tasker was available (so much for the \"same day\" marketing ploy.Customer service had me on hold for over thirty minutes. What kind of clown operation is this?Don't have this problem with Thumbtack. Never going to use Task Rabbit again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T22:28:56.000Z",
          "Titre": "Task rabbit tool lacks \"equipment…",
          "Contenu": "Task rabbit tool lacks \"equipment needed\" support to complete a job.My tasker showed up without a ladder needed to climb in the attic and I ended up paying for that hour. After calling customer support, they said its customer's fault that they failed to mention about ladder needed. How would a customer know beforehand if a ladder is needed or not for that job? Lost $100 and I deleted my account here. Never coming back and not recommending anyone to use it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T22:30:12.000Z",
          "Titre": "Paid for Work that Wasn’t Done",
          "Contenu": "Hired an electrician to repair or replace outlets.  He did not have knowledge to do it and instead screwed in a loose outlet casing.  Nonetheless I was charged the full fee."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T16:44:15.000Z",
          "Titre": "Disappointed",
          "Contenu": "My Tasker had a great personality, however, was not prepared for the job, which was to install five IKEA curtain rods and two photos which took him over 4 hours to do which is absolutely ridiculous. Then got charged over $350. Taskrabbit should have the task check in with photos on hourly projects to eliminate this issue as they’re being paid per hour very slow and inconsiderate. At one point he was literally standing on the ladder where my mom was handed him, his tools and the curtain rods for placement, unprofessional. The job was originally scheduled for one hour where they asked to start an hour before, and never left till after 4 PM where I then missed my appointment based on neglect of time and customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "M.",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T04:12:52.000Z",
          "Titre": "Still haven't heard from claims..",
          "Contenu": "Still haven't heard from claims... First time using Taskrabbit and after having two shelves mounted one ripped out of the wall within 30 minutes. More damage than I could ever believe. The second was pulling out so I had to take it down. Now I have to find a contractor to repair the wall... yet nothing from Taskrabbit..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "The Regal One",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T12:54:56.000Z",
          "Titre": "Got Bamboozled.",
          "Contenu": "There's decent aid on this site for almost any project you can conjure. The matter is the hidden fees are outrageous, and you don't find out how terrible it is until the job is already done. I'd have been better off hiring day laborers and paying the \"flat rates\" they quote. I'd rather had directly paid My worker the extra fees, than have it go to the site. I feel robbed."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T20:32:45.000Z",
          "Titre": "Horrible horrible experience with Task…",
          "Contenu": "Horrible horrible experience with Task Rabbit and their customer service. Feel scammed. Messages with support get no response. Waste of time and money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris Whitehorn",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T22:12:12.000Z",
          "Titre": "The Tasker’s are unresponsive",
          "Contenu": "The Tasker’s are unresponsive. The Tasker’s aren’t honest about the work they can perform. After having 3 different taskers to my home the light on my balcony still aren’t installed. I work in property management. I referred task rabbit to my clients. Not anymore."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T21:29:03.000Z",
          "Titre": "Tasker did not follow the instructions…",
          "Contenu": "Tasker did not follow the instructions provided for assembly. A portion of our couch is permanently damaged. The entire thing needed to be disassembled and reassembled."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "EMILY",
          "Nb_Reviews": 5,
          "Date": "2023-12-14T02:58:34.000Z",
          "Titre": "The person could not do the job",
          "Contenu": "The person could not do the job, left holes in the wall that I now have to pay someone to fix. He was specifically told by the handyman in the building exactly where to drill to hang curtain rods, and he ignored the advice, botched the job and was nasty and rude."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vashti",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T20:21:45.000Z",
          "Titre": "This taskrabbit did not complete the job",
          "Contenu": "The taskrabbit did not complete the job.  he didn’t know how to install the thermostat.  I sent him the make and model before he came and he said he was familiar with the thermostat and would be able to complete the job. I was frustrated because I waisted money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "E. Sheen",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T20:51:31.000Z",
          "Titre": "Been trying to book a task and it keeps being canceled",
          "Contenu": "Been trying to book taskers for a last minute moving job. Have majority of my items ready to carry, have a van I rented from uhaul parking downstairs for 36 hrs now and even though the system shows me available taskers, the job somehow get cancelled. Cancellation takes place about 45-60 minutes after booking - which leaves fewer options for available taksers and so I’m pushed 1-2 hours later each time until there are no more taskers available . Service seem neat and useful but it is simply unreliable. I wouldn’t recommend it for urgent tasks and for last minute tasks. I’m now 2 days late in my moving with expenses on rented van I could easily avoid."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T21:07:46.000Z",
          "Titre": "My task rabbit was a CREEP",
          "Contenu": "My task rabbit was a CREEP. Tried to get personal information from me. Was invasive, talked WAY too much. Literally interrogated me about who else lives in my home. Couldn’t wait to see him leave."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T21:10:22.000Z",
          "Titre": "The pull out bed is broken",
          "Contenu": "The pull out bed is broken. It was not put together properly and subsequently broke the beam. It was clear that the individual putting it together had no idea how to do this and ruined our new couch"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Carmen Eskesen",
          "Nb_Reviews": 3,
          "Date": "2023-12-08T00:22:57.000Z",
          "Titre": "I had a tasker come to my house to…",
          "Contenu": "I had a tasker come to my house to repair the rollers on the bottom of my sliding door. When he arrived, he didn't fix anything- instead, he sprayed WD40 everywhere for 15 minutes and charged me $100. When I went to task rabbit support to dispute this charge, they only gave me a partial refund of $40. I could have gone to the store to pick up WD40 myself to do this work for $15, instead I'm out of pocket $60 and still have a broken sliding door. Absolute garbage company, CUSTOMER BEWARE!!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T23:46:26.000Z",
          "Titre": "Completely overpriced with no option to…",
          "Contenu": "Completely overpriced with no option to select moving for inside the home. Spent $85 for someone to carry a desk up stairs because I’m unable. Incredibly limiting with types of tasks."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Luis Ardin",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T00:24:00.000Z",
          "Titre": "100% dissatisfied",
          "Contenu": "I am not at all satisfied with the company's service.  They do not have qualified personnel. I hired a service to install some IKEA furniture. The recommended duration was 5 hours, the person lasted 9 hours 30 minutes and did not know how to install them.  They charged me for the 9 and a half hour service and my furniture is still on the floor.  The company has not responded for the poor service provided.  I DO NOT RECOMMEND THEM AT ALL"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jenia Hurt",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T23:52:32.000Z",
          "Titre": "Charged for a service not rendered",
          "Contenu": "This was by far the worse experience.  After I contacted this company for assistance and texted on a regular to the Technician.  He arrived without the proper screws needed to fix my Eliptical and said he’s not able to completed the job and don’t want to mess up the machine and I would not be charged.  Approx 1 hour after the Technician left I received an email, my card was charged for an incomplete job and the invoice had been closed.  I am in the same boat as I was before calling this company.  I was all excited about doing business and had been telling everyone before service was supposedly rendered to me, now I have to retract it. Poor service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T00:09:09.000Z",
          "Titre": "Disappointed with everything",
          "Contenu": "I am sorry i am really disappointed with the service. The task person came spend 4h for a job of 3h, and he didn’t even finished the task. Now I call the customer service they keep telling someone will reach out even though I sent them pictures of the unfinished task"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vinod",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T18:05:32.000Z",
          "Titre": "Frustrated with high support and trust…",
          "Contenu": "Frustrated with high support and trust fees. It is almost 30% of amount that I paid to tasker. I never expected high trust fees. I never use the task rabbit again in future. Good bye."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Osla",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T19:52:02.000Z",
          "Titre": "All of the fees are not displayed",
          "Contenu": "All of the fees are not displayed. Shows only the hourly rate with a 2 hour minimum but all of the taskers have a $60 or more extra charge for vehicles and gas!! That should be included in the initial booking and not after booking!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Slk3rd",
          "Nb_Reviews": 5,
          "Date": "2023-12-12T23:17:42.000Z",
          "Titre": "Don’t waste your time.",
          "Contenu": "3 of the takers that I confirmed contacted me an hour prior to the appt. to change the appt. to a later time. Unacceptable!!!! I understand running a bit late, but delaying the appt by hours is a joke. The quality of these taskers is extremely poor. I will not use this service again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T19:52:19.000Z",
          "Titre": "We will not use task rabbit again",
          "Contenu": "We will not use task rabbit again. We did not understand that there is a 36% markup of the prices for each worker/service. In the future we will use other services or contact work people directly, Please know this very poor rating is not a reflection on the worker who served us. He was excellent,"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "CHERISS",
          "Nb_Reviews": 2,
          "Date": "2023-12-22T00:12:28.000Z",
          "Titre": "Terrible",
          "Contenu": "I paid $70 for an hour for an item that cost $85 to buy. I was told it would be $30. He got there and told me it was a two hour minimum plus fees. Never again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T05:43:57.000Z",
          "Titre": "Problems with quality of work",
          "Contenu": "Problems with quality of work.  Paid for assembly of a dresser & partial assembly of a chest of drawers.  Chest of drawers is fine.  The dresser has 2 out of 6 drawers that won’t open as they should.  The top drawer on the left overhangs over the middle & bottom drawer.  Also, there’s a gap between the left bottom drawer and the bottom molding.  Tasker billed for an additional half hour as well.The resolution was to refund me 25.02.  Very dissatisfied & won’t use service again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T03:44:36.000Z",
          "Titre": "Your tasker damaged my property",
          "Contenu": "Your tasker damaged my property. Ruined a wall, broke my entertainment center, my curtains he mounted fell the next day and he said he was coming back to complete the task then never returned. He was dripping sweat all throughout my house and smelled strongly of tobacco. The worst experience I’ve ever had. Your claims process is very inconvenient and complicated on top of all of that and you shouldn’t be charging people when a tasker does not complete a task or damages property."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jessica",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T21:27:10.000Z",
          "Titre": "The tasker was great, app is trash",
          "Contenu": "The tasker was great. The app was annoying. Allowed me to do Apple Pay but kept having issues around my payment. I had to reach out three times for an error that wasn’t mine. Additionally I’ve tried to use Taskrabbit two previous times and the taskers cancelled moment of and I wasted my time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scott Kincaid",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T20:29:27.000Z",
          "Titre": "Borderline Criminal Fraud",
          "Contenu": "I don't like the way Task Rabbit added almost $5 to the worker's hourly rate plus another $15 for your fees. I understand the fee for Task Rabbit, however, adding almost $5 to the worker's rate is borderline criminal fraud. You're saying that the worker charges $44.37 a hour, when he said his rate is $40 a hour. I TOTALLY UNDERSTAND YOUR FEE OF $15 FOR SAFETY, BUT RAISING THE WORKER'S FEE $4.37, WITHOUT HIS KNOWLEDGE COULD COSTS HIM JOBS. SINCE PEOPLE HAVE DIFFERENT RATES FOR THEIR EXPERIENCE."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T04:00:41.000Z",
          "Titre": "Tasker completely ripped me off",
          "Contenu": "Tasker completely ripped me off. Charged me an hour of time while he left my house to go buy a saw. Also the tasker was completely incompetent."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alyssa Roulund",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T18:41:25.000Z",
          "Titre": "Left us with more issues to fix instead of less....",
          "Contenu": "We were really disappointed with our experience. We purchased closets through IKEA and were matched with a local task rabbit person to help install them. The estimated time for install was 15 hours however the installer only scheduled us for just under 5 hours. He left the empty boxes for everything all over our bedroom floor, trash on our bathroom floor, the closets weren't put together all the way (just some of the frames) and he didn't even put them in the correct places, even though I gave him the renderings and specific codes for each closet component. My husband came home and was really unhappy and said he just created a bigger mess to clean up than anything. I hired a task rabbit handyman to help take something off my husband's plate because of how busy he's been lately, but instead I just created a bigger issue. Really frustrating, disappointing experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T00:04:12.000Z",
          "Titre": "No-Show Dec. 19",
          "Contenu": "This time Youssef called a half hour before arrivalto say he wasn't coming."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T09:41:56.000Z",
          "Titre": "The tasker overcharged me by 1.5 hours…",
          "Contenu": "The tasker overcharged me by 1.5 hours for time worked. I messaged the tasker several times to question the charge and he never responded, then communication is blocked after 24 hours. My suggestion is that every charge should be confirmed by tasker and then person hiring before submitted as final. Also that communication should be allowed for 48-72 hours after work is completed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Perry David-Preston",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T22:03:35.000Z",
          "Titre": "TaskRabbit does not vet their Taskers",
          "Contenu": "TaskRabbit does not vet their Taskers, and when a task goes off track or fails in some way, you still have to pay the full amount for the task. TaskRabbit denies any responsibility for the Taskers they publish on their platform."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Adam Haft",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T22:13:56.000Z",
          "Titre": "Last Time with Taskrabbit",
          "Contenu": "The tasker did not complete the job, as he did not have enough time. While he did a solid job, I would have appreciated if he said that he didn't think we would have been able to complete the task in time. I would have paid him for a few hours but still saved some money. I ultimately had to hire another vendor, which cost me more money in the long run.  This will likely be my last time using task rabbit."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "aylin hosseinchi",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T22:12:00.000Z",
          "Titre": "I am very unhappy and so sad I hired…",
          "Contenu": "I am very unhappy and so sad I hired the man for assembly my IKEA closet that closet work just 2 or 3 hours he wants to get more money from me and he did very slow 7 hours and 30 minutes also he charged me $395Taskrabbit doesn’t care I contact the support no one answered me you should be return that extra money to me and never put some people something like that he just cheated me"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nasim",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T22:14:10.000Z",
          "Titre": "TaskRabbit deleted my first review…",
          "Contenu": "TaskRabbit deleted my first review since I criticized them. I asked for dissembling a bed frame and drop off to Goodwill. I mentioned first the task is easy, less than 1 hour and the person needs a car. They sent me a bill for $34. After the job done, they sent another one for around $100 since the person needed to rent a van. This is very unprofessional and everything needs to be clear from the beginning."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dunya Abdelqader",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T08:35:39.000Z",
          "Titre": "Horrible Tasker",
          "Contenu": "Tasker told me he lied about his skills and he ruined my rentals wall. Left with holes on my wall and set up my dresser wrong. Need a full refund"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Samantha",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T00:24:23.000Z",
          "Titre": "The tasker was very inexperienced and…",
          "Contenu": "The tasker was very inexperienced and lacked the skills to complete the task. I booked another tasker initially and I was referred to this tasker by Task Rabbit after the original tasker was canceled. Be careful when they offer a replacement. I was busy and did not look thru the reviews."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T05:53:23.000Z",
          "Titre": "This task was never completed - BUT we were CHARGED!!!!!",
          "Contenu": "This task was never completed!!!!! The worker was supposed to be at our house by 5 PM for a 6 hour job but agreed to come at 3. At 3 PM he let us know that he would come closer to 5 PM, which is fine since that was the original agreed upon time. At 5:30 we started calling him since we STILL had not heard from him since 3 PM. Around 5:37 PM he said that his phone had died and that he could still come to our house it would just be another 30 minutes. I agreed that was okay. At 7:05 PM he still wasn’t to my house (two hours after the scheduled time) I messaged him and he told me that he got pulled over for having expired tabs and no break lights. I let him know at that time we wanted to cancel his services. Just this week we got a bill for ONE hour of work, which was about $45. I would like this refunded as he did no work for us, and it was not our fault for the cancellation. We are very unhappy with task rabbit and don’t plan to use your services in the future"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T21:11:23.000Z",
          "Titre": "I already sent lengthy information via …",
          "Contenu": "I already sent lengthy information via  survey of what went wrong. In addition- after the Tasker left the job unannounced and unfinished- we found he had assembled the project wrong. Put doors where drawers should have been and jammed the mounting hardware backwards.  Really awful experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T15:22:47.000Z",
          "Titre": "Misleading task rabbit",
          "Contenu": "Instead of charging by the hour as indicated on your website, the guy I chose decided to charge by the project even after he told me that he would require a 2 hour minimum commitment. This was very misleading and unprofessional."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MandM",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T22:04:04.000Z",
          "Titre": "Falso Advertising",
          "Contenu": "I was quoted a 2 hour job time, and a cost of $101 to put together a bed.  The job took 3.5 hours, and cost me almost $300.  I will never use your service again.  You have to be more honest in your estimates."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chase",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T22:29:38.000Z",
          "Titre": "Horrible experience",
          "Contenu": "Horrible experience, handyman milked the clock on purpose, didn’t even finish the job after taking twice as long as expected."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T00:18:47.000Z",
          "Titre": "Although the description of work…",
          "Contenu": "Although the description of work experience and abilities made it sound as though the person could do what we needed, when he showed up he could not do anything and we spent $50 for someone to come say they couldn’t help us. We won’t be trying this service again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T18:20:21.000Z",
          "Titre": "The idea and being the middle man is…",
          "Contenu": "The idea and being the middle man is great good job BUT \"trust and support\" fee is absolutely RIDICULOUS! Try and be reasonable I stead of charging an arm and a leg"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T07:04:30.000Z",
          "Titre": "The person did not show",
          "Contenu": "The person did not show.  I took off 4 hours at work.  He didn’t even response to either come or not."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Janet",
          "Nb_Reviews": 8,
          "Date": "2023-11-24T06:55:09.000Z",
          "Titre": "VERY UPSETTING",
          "Contenu": "I have tried every possible way to reach my taster post job to try and find out where my$35 level and mydrill bits are . I suspect he inadvertently took them BUT NO WAY TO REACH HIM  NO RESPONSE not by text, through this site nor from TASKRABBIT who I have asked 3 times to reach out to tanker"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T15:11:21.000Z",
          "Titre": "Too expensive",
          "Contenu": "Too expensive. I paid $50.00 for a couch and ottoman and had it hauled five miles to my apartment. I was charged almost $200.00. Not worth it. I will never use this service again and will not recommend it to anyone else. Lesson learned"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T00:19:57.000Z",
          "Titre": "How to Hire Someone w/out accountability",
          "Contenu": "Our experience(s) with Taskrabbit were rather good pre-pandemic. Our first experience since was an utter fail.  Honestly, I’m happier putting it behind me.  I’m not going to relive it all here.  If you want details, you have my contact info."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T13:46:06.000Z",
          "Titre": "Do not use this company.",
          "Contenu": "Do not use this company.**ETA: Resolution was a credit for a service towards a new tasker - are you kidding?**This service is awful. The tasker was late and ended up spending more time here than necessary and STILL didn't do what they were supposed to do. I disputed invoicing and they STILL have yet to resolve because I couldn't provide pictures but they sure did charge my credit card for the full amount.  My husband and I spent 2 hours cleaning what the tasker didn't. Poor service - poor communication - poor customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T18:17:14.000Z",
          "Titre": "The gentleman who came and put up my tv…",
          "Contenu": "The gentleman who came and put up my tv he came late than charged me extra to do it after he finished instead of telling me before he started."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anonymous Customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T19:07:49.000Z",
          "Titre": "Would NOT recommend",
          "Contenu": "Individual I hired claimed to be great at moving furniture and appliances. Well he was no better than having your every day friend help you move. My refrigerator now has MULTIPLE dents in it because he obviously did NOT know how to move appliances. I was also quoted and signed for his fee at the end of the task for $230 but when the final charge came from TaskRabbit he submitted his fee as $275. Will definitely NOT use TaskRabbit again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T00:29:53.000Z",
          "Titre": "Tasker sent someone else and he was a complete amateur",
          "Contenu": "Tasker sent someone else. That someone else was a complete amateur. They overcharged me and refused to send me an invoice that shows the actual work performed. Contacted support but they basically didn't do anything to try and address my issues. They couldn't even get me a corrected invoice."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T21:20:33.000Z",
          "Titre": "The worst experience.",
          "Contenu": "My tv was damaged and the tasker lied to customer care about assessing the tv for damages after moving it into my new home. The move also took a lot longer than needed because the mover did not bring his trailer and he stopped often to talk with my brother and boyfriend."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "never again a customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T04:29:12.000Z",
          "Titre": "Beware! Do not Taskrabbit",
          "Contenu": "The Tasker Aryan arrived, worked on the light in the kitchen, it worked, left after 20 minutes. 2 hours later when my husband turned the switch the light didn't work again, we didn't touch the light on the ceiling, only the switch. I messaged Aryan on the chat feature of the App and he said it's probably the wire, then he said he will come back and fix it the next day, however my husband and I are both working, we couldn't meet him until Friday, Aryan said ok to coming back 1 pm Friday, without charging us again. On Friday, at 1:30pm when he wasn't at home, I called the customer service line, twice, total of 30 minutes and did not get a live representative. I went on the App chat with customer support and finally \"chatted\" with Ed who tried to reach out to Aryan, who is UNRESPONSIVE, so I asked for a refund instead, I was charge $234.48 for a 20 minute botched job. I was offered $117, for a credit towards another Tasker, and I asked who will that be and they said ARYAN. I said no way is that guy stepping back in my house, first of all he's a no show when he was supposed to \"fix\" his inadequate work. I will never use task rabbit again in my life. I did not accept this stupid credit, and I expect to get a full refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T20:20:00.000Z",
          "Titre": "My sofa arrived soaking wet.",
          "Contenu": "My tasker drove an hour in the rain with the back window of his van missing. My furniture was soaked and damaged. When I expressed my disappointment that he didn't cover the furniture with a tarp, he minimized my concerns and made excuses. I then reached out to Taskrabbit, for some kind of remedy. They did not agree to refund the $250 fee, and instead told me I had to go through a lengthy claims process.  I'm not sure how to find taskers on Taskrabbit who have basic common sense, and I don't think I will use the service again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gary Conner",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T23:21:55.000Z",
          "Titre": "Task rabbit is a terrible company to do…",
          "Contenu": "Task rabbit is a terrible company to do business with because some of your taskers are total crooks a d frauds. I would not hire you for anything again after I was over billed for moving my furniture."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Derek Simon",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T21:22:15.000Z",
          "Titre": "fees are psychotic",
          "Contenu": "It’s a good app with reliable handymen but the Taskrabbit fees make it pointless to use unless you’re in a dire emergency."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pam Jones",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T18:11:39.000Z",
          "Titre": "TaskRabbit Overhead Charge Too High!",
          "Contenu": "The TaskRabbit Overhead Charge is Prohibitive. I don't understand how TaskRabbit incurred so much extra expense because I hired the guys for 5 hours rather than 2. Next time, I'll find help elsewhere. But I wish I could contact those guys - they were great!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T03:30:00.000Z",
          "Titre": "Tasker estimated the time to complete…",
          "Contenu": "Tasker estimated the time to complete the job way off. Walked away with work just started. Spent time texting the next client while putting together the furniture. What an disappointment"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T17:12:33.000Z",
          "Titre": "my phone number is incorrect in you…",
          "Contenu": "my phone number is incorrect in you system, so there is no way that i can update my profile."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ana",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T19:43:34.000Z",
          "Titre": "The tasker broke our furniture and…",
          "Contenu": "The tasker broke our furniture and asked for money via Zell. First, he asked that we pay him through his cell phone number but later changed that he receives it through email. Fred V. was double-paid one hundred dollars and has not refunded one of the payments, plus the service fee on TaskRabbit. We tried to contact him, but he is not responding to our messages. Taskrabbit is unsafe, and I would not recommend it to anyone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "eliana adhami",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T16:47:16.000Z",
          "Titre": "Very bad quality of service and…",
          "Contenu": "Very bad quality of service and overstated hours by the installer. I have writen dy other reviews that were deleted But i never had such a bad experience in my lifetime"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brandi Redo",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T18:12:06.000Z",
          "Titre": "The fees make it not worth it",
          "Contenu": "The fees make it not worth it. Also, the tasker can charge for as many hours of work as they want. This tasker charged for 7 hours of work for an empty, mostly clean, 750 square foot appartment. They did a good job but were slow just to run up the tab. I will not be using them or task rabbit again. I feel swindled."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jay C",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T22:40:05.000Z",
          "Titre": "Complete waste of time",
          "Contenu": "They sent a person that arrived late and didnt really understand how to perform the required task which meant that HOURS were spent by the rep calling other tech support only to finally say he had to leave because he had ANOTHER job to go to. Thats completely unacceptable."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T17:35:30.000Z",
          "Titre": "The tasked assembled the dog house…",
          "Contenu": "The tasked assembled the dog house inside of my home I could not get it through the door. I had to disassemble the dog house which defeated the purpose of me paying for this task. When I reached out to him about a solution to getting the dog house through my doors he just said turn it side ways.The tasked split the wood assembling my bed and didn’t even mentioned it to me when he assembled my table he just left the light strip on the table."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Helen Dannelly",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T07:03:58.000Z",
          "Titre": "Horrible experience!",
          "Contenu": "Mover left all of my belongings on the stairs and sidewalk outside my new apartment on a busy street on a cold evening! The door to my building was left propped open with boxes!  Left me high and dry!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T17:27:44.000Z",
          "Titre": "Can’t “unsubscribe “ from your annoying…",
          "Contenu": "Can’t “unsubscribe “ from your annoying emails. When I need service I will find you so stop littering my email inbox!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Diane",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T17:09:48.000Z",
          "Titre": "Ghosted me!",
          "Contenu": "Anthony came and it took the entire 5 hours to put together the bed with drawers. Ikea estimated he would put (2) nightstands together as well. Ikea sent the wrong bracelet so I went to the store to get the correct one and Anthony was scheduled to come the next day.  That day he sent a note that he wasn't coming. I contacted him 3 times and asked for him to reschedule and he completely ghosted me! He should of told me why he wasn't going to finish the job!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T21:30:50.000Z",
          "Titre": "Worked very slow and arrived very late",
          "Contenu": "I saw a five star rating only for someone who I booked. Then it turned out she was unreliable came 1 and half hour late. Then she didn't even reply until after 1 hour when I reached out. Also she took 3 hours just to do my kitchen. Waa clean ok but not professional like I expected. I think she worked very slow on purpose. She didn't clean the oven properly.  She put things in place that became hazardous. I am a mother of four including a newborn so I wanted help to clean up throughly. She didn't even go into the bathroom or mop floors and she left garbage in house."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Theresa Swain",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T23:20:13.000Z",
          "Titre": "Terrible experience",
          "Contenu": "Terrible experience.  The gentlement we hired to move a table canceled at the last minute, and we were given a substitute.  The new guy had no tools and only a minivan.  The table arrived gouged, and the whole process ended up taking an entire day.  He said he would pick the table up at noon, and did not arrive until 12:47 - will not be using Task Rabbit again - ever."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T01:59:00.000Z",
          "Titre": "Too expensive and not clear in the…",
          "Contenu": "Too expensive and not clear in the charges"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Karie Son",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T04:27:16.000Z",
          "Titre": "Very hard to communicate and charge…",
          "Contenu": "Very hard to communicate and charge undisclosed fees."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Claudia",
          "Nb_Reviews": 3,
          "Date": "2023-11-13T06:58:07.000Z",
          "Titre": "I absolutely hate TaskRabbit",
          "Contenu": "I absolutely hate TaskRabbit. Their customer service is completely non-existent. Their policies on a customers balance are not posted. Their tipping policy is also unclear when you have a balance. Their ‘fee’ is extremely high. I will never use them again. I also would never recommend them to anyone. I have filed complaints with the BBB and Attorney General in my state. Avoid them at all costs."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Baga",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T02:02:41.000Z",
          "Titre": "Overcharging/hidden fees",
          "Contenu": "Master didn't finish building the desk completely, there was a part left that didn't get fixed properly and charged more than time spent.Taskrabbit also charged an unannounced \"Trust & Support\" fee of $25.65, so what was expected as a $50 max spend of 1 hour of service, turned out into 1.5 hour charge and overall $95 bill."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jan",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T20:55:07.000Z",
          "Titre": "Last minute cancellation from TaskRabbit had me Scrabbling",
          "Contenu": "The person I hired to move heavy items cancelled on me at 9 pm the evening before he was to show up. I had to go online and scramble to find someone else for the next day thru TaskRabbit. I ended up finding someone but paid twice the amount for the last minute booking. No accountability from TaskRabbit. Clearly not dependable and offered no help."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T06:14:15.000Z",
          "Titre": "Taskrabbit does not make good on improper work by their Taskers.",
          "Contenu": "You have already been informed and I have received your extremely inadequate offer.  This company does not make good when one of their taskers improperly assembles Ikea furniture leaving it unsafe.  See my claim Taskrabbit."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "August K",
          "Nb_Reviews": 7,
          "Date": "2023-11-10T17:09:49.000Z",
          "Titre": "Job was incomplete and they refused to refund or remedy the situation",
          "Contenu": "Scheduled to have a handyman come out to hang two window shades and a floating shelf; all of which fell down in exactly one month. Task rabbit refused to refund me as the service was clearly fault and inadequate, I will never use this service again. There’s no warranty or recourse for customers when the handymen they allow on the platform don’t perform accordingly. Not to mention that same handyman told me to reach out immediately if there was an issue, and then ghosted me. 0/10 don’t bother, just get a referral from a trusted friend or learn to do it yourself on YouTube."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vania C Flowers",
          "Nb_Reviews": 2,
          "Date": "2023-11-13T02:06:31.000Z",
          "Titre": "They overcharge",
          "Contenu": "Cleaners did a decent job however they were an hour late: In my initial conversation with the cleaners, they mentioned that it would take approximately 5 hours to complete cleaning for a 3 bedroom, 2.5 bath house. It only took 4 hours and somehow I was charged for 6 hours.  Customer service gave me a partial refund. I didn’t have to pay for hour 6 but was still charged the for hour 5 plus the trust and support fee for the hours 5 & 6. Never using this app again. Customer service sucks too"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T21:41:36.000Z",
          "Titre": "Probably my last time using taskrabbit",
          "Contenu": "the tasker left without fully finishing.  I then contacted them to come back. They finished in less than an hour and a half but billed me for two hours and forty-five min. They also charged me for hardware without telling me. (Way overcharged on top of that).  I did call customer service and they were able to help. But had I not seen the charge hit my credit card I wouldn't have known."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T10:25:11.000Z",
          "Titre": "Tasker did a really poor job assembling…",
          "Contenu": "Tasker did a really poor job assembling desk. I'm nerve using this service again. I had to go disassemble half the desk to fix the mistake he made (I was wearing a armsling so I was more than furious to had to deal with this nonsense). I also had to realign the door to the cabinet and tighten the drawer. Worst part is, he took more than the predicted hour to finish and come up with that joke of a job."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T18:25:40.000Z",
          "Titre": "You guys left without installing two of…",
          "Contenu": "You guys left without installing two of my items. Now I’m stuck with the things I bought just laying on the floor. Appreciate the service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T01:04:17.000Z",
          "Titre": "Not enough knowledge so took so long to…",
          "Contenu": "Not enough knowledge so took so long to finish job."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marcus W",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T00:20:44.000Z",
          "Titre": "A costly, unpleasant experience. Makes no sense to use TaskRabbit for your business.",
          "Contenu": "Potential savings with using TaskRabbit were quickly gone once we started committing to their platform. Their search filter does not work. You will have to comb through people who cannot do the job and waste time verifying this. To make this worse, you can only ask 1 person at a time. Booking system only goes 2 weeks out, so if you plan 1month+ out like we did, you have to remember to manually adjust the job date multiple times or risk being automatically charged. Our company was almost scammed by this. A top-rated tasker used this poor system to block our ability to schedule the correct date at the last minute. Their actions could be easily flagged in a better system, but TaskRabbit said nothing until I contacted them. Their \"sorry\" was an insulting 3.5% discount.In the end, using a different company would save us time, risk, money, and stress. Even without their highly reputed scammer and poor site functionality - savings are not worth the uncertainty and risks."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T02:57:03.000Z",
          "Titre": "Platform doesn’t accommodate “I can’t help with this”.  You still get charged",
          "Contenu": "It was a waste of time for him and me because I my wires didn’t work.  For me it was also a waste of money.  Next time I call someone else it will again be a wash if I don’t have the right equipment.  It would be nice to FaceTime and he can ask a few questions.  He comes out and stays for five or 10 minutes and it was a waste.  Not his fault but the way it’s set up is not conducive to account for preparedness and needing follow up.  He was a nice man, nothing against the handyman."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ben Mueller",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T22:05:59.000Z",
          "Titre": "Such a lousy experience",
          "Contenu": "Such a lousy experienceNeeded somebody to install a dishwasher (admittedly a more complex job than the standard procedure). Involved cutting a hole in some drywall. Picked a guy off TaskRabbit who was highly rated, with lots of reviews. Guy shows up. After about 15 minutes, it's clear he has no idea what he's doing, but rather than just admit he's in over his head, he stays for another 90 minutes screwing around (with me attempting to help him every step of the way), didn't manage to install the dishwasher at all, and still charged me $236. The faulty water cap he gave me to plug the end of the dishwasher line failed overnight and flooded both my kitchen and basement, warping the wood and laminate floors respectively.I called TaskRabbit support to complain. They said the first step for them is to contact the Tasker to get their side of the story. That was exactly the last thing I wanted, since that guy knows where I live, and I wanted him nowhere near me again. By some miracle, TaskRabbit decided to refund about half the total cost, but holy cow, that whole visit probably added $500 to the entire installation process.If I'd picked somebody who wasn't rated at all, then maybe I'd understand that I got a dud, but this guy was _very_ highly rated. How am I supposed to trust TaskRabbit if those are the sorts of people they send out.Never never never never again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rachel M",
          "Nb_Reviews": 2,
          "Date": "2023-11-12T22:51:27.000Z",
          "Titre": "Paid for Job Half Done",
          "Contenu": "He didn’t actually diagnose or fix the faucet which was half of the purpose of the visit. He hung a mirror and toilet paper holder, which took the full hour and then charged me additional money for the anchors in the wall and a “new rate” for the work. I don’t think that was fair at all. I shouldn’t have had to pay that amount for the service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lynette O",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T21:16:44.000Z",
          "Titre": "The tasker wanted to overcharge me for…",
          "Contenu": "The tasker wanted to overcharge me for time he did not spend. I had to keep on refusing to pay. Your payment system is terrible -- kept on asking me to verify my credit card details. The chat system is so cumbersome, have to log in every time the task send a message, and to reply."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "KF",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T23:51:18.000Z",
          "Titre": "It took over a month to get website…",
          "Contenu": "It took over a month to get website updates implemented after it was approved."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T16:08:22.000Z",
          "Titre": "Service fees are absurd and not clearly…",
          "Contenu": "Service fees are absurd and not clearly disclosed. I will not be using this service again and will not be recommending to anyone"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Johnathan McFarlane",
          "Nb_Reviews": 4,
          "Date": "2023-10-20T19:29:19.000Z",
          "Titre": "Used task rabbit a few times in the…",
          "Contenu": "Used task rabbit a few times in the past and it was fine. Most recently, the app was so buggy it was almost impossible to use. It also kept rejecting my payment method - I tried 2 different cards (both valid) and it rejected both. I don't have any other payment method available, so that's a hard delete and goodbye to task rabbit."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T21:11:02.000Z",
          "Titre": "The tasker that came to my house told…",
          "Contenu": "The tasker that came to my house told me to pay by Venmo or cash. I did and was then charged the same amount on my card. After complaining about it to customer service, I get blamed. I closed my account after being scammed on the first time using this shady platform."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ms Smith",
          "Nb_Reviews": 2,
          "Date": "2023-11-18T04:36:25.000Z",
          "Titre": "I’m less than a week new to Taskrabbit…",
          "Contenu": "I’m less than a week new to Taskrabbit my first Tasker took a break and was late. I didn’t know that he wasn’t supposed to take a break and then the second task did not do the job correctly promised that he would come back and he did not come back and he disabled the chat and I have screenshots of the conversation so now I have to file a claim and I’m finding that, I’m still going to have to come out of my pocket again for a job that I paid for ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Murali",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T20:42:20.000Z",
          "Titre": "Charged additional 40% for various…",
          "Contenu": "Charged additional 40% for various fees. It’s a lot of money, not going to use or recommend taskrabbit to anyone. Thank you!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sam Naparstek",
          "Nb_Reviews": 2,
          "Date": "2023-11-09T03:10:12.000Z",
          "Titre": "Tasker cancelled 1 hour into the task…",
          "Contenu": "Tasker cancelled 1 hour into the task time before even showing up. I had to pick up an emergency tasker for 5x the price of the original. Could not find a customer support line to help."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T02:07:59.000Z",
          "Titre": "Non STOP spamming after first task",
          "Contenu": "Non STOP spamming after first task. Unreal. deleted account."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Carol Elstien",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:58:48.000Z",
          "Titre": "IKEA Estimate was completely inaccurate",
          "Contenu": "Estimate was an hour and a half tasker worked 2 hours and got about 2/3 through. Then there were additional fees on top. Tasker took a while to understand closet system rather than being familiar. All in all it was twice my estimate and not completed because I told the Tasker he had gotten enough done. For a service owned by ikea and an estimate based on my ikea cart with fully designed closets I was disappointed"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Not At all Happy Customer.",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T03:15:02.000Z",
          "Titre": "My experience with Taskers in Task…",
          "Contenu": "My experience with Taskers in Task Rabbit was between Horrible and Really bad.Hired 3 taskers to perform tasks, only 1 out of 3 showed up. At least one tasker had the courtesy to inform me he will not be coming in at least 24 hours prior. The other tasker did not even show up and did not inform that they will not come. The tasker who showed up was good and I have no complaints about him."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Angela",
          "Nb_Reviews": 2,
          "Date": "2023-12-22T01:21:19.000Z",
          "Titre": "Too expensive",
          "Contenu": "Too expensive. $60 trust and support fee?2 hour minimum for 30 minute job. Probably won’t use again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "DC",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T20:56:00.000Z",
          "Titre": "TASKRABBIT FEES ARE TOO HIGH, WON'T USE THEM AGAIN.",
          "Contenu": "I didn't understand that the additional fees were per EACH hour that the Tasker was here. I had to come out of an additional $40+  dollars ON TOP of the hourly plus the $20 tip I gave him before he left. I won't use Taskrabbit again because although my Tasker was good, your fees are entirely too high. I did not budget for the additional money."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gustavo Moreno",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T22:41:47.000Z",
          "Titre": "It is very bad that the commission that…",
          "Contenu": "It is very bad that the commission that taskrabbit charges is also applied to each hour, it is very expensive"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "No",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T23:46:10.000Z",
          "Titre": "Task rabbits poor resolution to a fixable mistake.",
          "Contenu": "Booking someone was smooth and easy and he arrived on time and was responsive and helpful. However after he left I realized the job wasn’t done as we decided it would be. There was no way for me reach out to him after and task rabbits resolution was a partial credit to rehire someone to fix it. Which will cost me more money (even with the credit) to fix the mistake. I’m totally disappointed in the resolution and was excited about this app but now I don’t have any confidence in booking people on task because of task rabbits policies."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T22:36:52.000Z",
          "Titre": "Bad interface & no access to providers",
          "Contenu": "Bad interface, too many smoke-piped channeled inputs before you can ever see providers and rates. This also no way to schedule multiple dates and times all in one project. Another company that blocks off all channels of communication forcing you to go through their FAQs instead of direct help when you need it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T19:04:23.000Z",
          "Titre": "Our tasker did not know how to do the…",
          "Contenu": "Our tasker did not know how to do the job, showed up, wasted time for 4 hours, went to lunch and then quit! We were still charged for his time. Very disappointed!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T21:35:25.000Z",
          "Titre": "Made a wrong hole in my wall",
          "Contenu": "Nice guy. However, made a wrong hole in my wall and acted as if it was no big deal. Suggested it would be fixed years later when they come back to patch up… But let’s be real, you aren’t coming back years later to fix and you probably just cost me $300+ to fix the error you made."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Foster",
          "Nb_Reviews": 3,
          "Date": "2023-12-10T23:44:39.000Z",
          "Titre": "Should have done it myself.",
          "Contenu": "This is the third time I’ve used taskrabbit and the second time I have been really disappointed. The appliance installed had clearly not done this before and for some reason was not interested in following the installation manual. As a result, he missed a few important steps and may have damaged my brand new dishwasher."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T15:21:59.000Z",
          "Titre": "Way overcharged and not sure it will be made right",
          "Contenu": "I hired a tasker to do a simple job. He was at the site 30 minutes and instead of charging us his minimum, he charged us for 5 hours. Blocked text when I asked for explanation. Elevated to TaskRabbit and they may be still working on it? But suffice it to say there are some dishonest people out there and as on any all digital platform you may have very little recourse."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T23:48:56.000Z",
          "Titre": "I do not appreciate being hit with an…",
          "Contenu": "I do not appreciate being hit with an additional fee when I was ready to use your website. All fees should be clearly displayed at the front end of the process."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T03:39:02.000Z",
          "Titre": "Kind and determined but wouldn't recommend for more complex jobs",
          "Contenu": "He was very kind, and had no issue putting in the extra time and effort to make sure the job was completed. However he was determined to a fault. I would recommend for simple jobs but I had a complicated kitchen faucet that needed to be replaced. I'll give him the credit he never gave up and really put in the work to get it done. However that was at the expense of destroying the old faucet and chipping my kitchen counter in the process. What I struggled with is that he was not equally horrified that he chipped the counter but said it would be covered up. I felt like I just wanted the whole experience to be over. I wish we could have pressed pause and said here's the situation, here's the risks, and made a decision. Everything is working fine and the chips are technically covered but it was a stressful experience for me and I hate there was damage to my new home."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Renee Morel",
          "Nb_Reviews": 3,
          "Date": "2023-12-11T21:49:24.000Z",
          "Titre": "TaskRabbit does not have specific Taskers for fridges",
          "Contenu": "This is NOT about the Tasker, who was great (I gave Nassim 5 stars), but about the system and your partnership with IKEA. I first attempted to hire Saif F. to assemble a fridge. He asked for a picture, so I sent him the IKEA link with a photo, measurements et specifications. Again, he asked for a picture, saying he was \"not comfortable\" w/o a picture. What (other) picture? Of the fridge totally wrapped? He answered my queries with ???, said that if I could chat, I could also text (no true, I don't have a cell phone). I believe he has never installed a fridge before. Tellingly, the IKEA site does not have an \"Appliance tab\" for kitchen installation. The second tasker, Brett, accepted the task, but after I gave him my address (Lower Haight, in SF), the chat was terminated. I had no phone number, no e-ddress. How can I contact a tasker back under these conditions, a one-way street?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T04:46:48.000Z",
          "Titre": "No deal",
          "Contenu": "Slow workers, extra fees that are not disclosed ahead of time. Won’t use the service again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T19:15:43.000Z",
          "Titre": "I spent a full day messaging back and…",
          "Contenu": "I spent a full day messaging back and forth with two taskrabbits for an admittedly small job. After multiple texts back and forth the first decided he couldn’t do it and the second said he would get back to me and never did. Far from the responsiveness I expected from their promotions."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T15:39:11.000Z",
          "Titre": "The service is very expensive",
          "Contenu": "The service is very expensive. I don’t think next time I will use taskrabbit. Getting someone local is way cheaper than hire a taskrabbit"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Christine",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T19:29:46.000Z",
          "Titre": "Not easy",
          "Contenu": "The website isn't easy to navigate, I had to call 3 times for help.  I booked one installer and he never responded to my request.  I booked another installer and, she was running late, and I had to reach out to her for an update.   I finally booked an installer that showed up (I was told, when I called for help, I needed 2 installers), I had a big order.  I finally had a guy show up that was only available for 2 1/2 hours.  I indicated on the website it was a big job, 4 hours for 2 installers.  We ended up putting the rest of the furniture together, ourselves."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ryan Beebe",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T04:03:50.000Z",
          "Titre": "Poor experience, bad communication, more expensive than expected.",
          "Contenu": "Final cost was over $300 more than what we were originally quoted and the entire installation took a week longer than what we were told. We were told at one point that several items needed for the installation were “not included” in the kit that arrived and we were then forced to travel over 3 hours to pick up or purchase the replacement items only to come back and have the builder say he had misplaced it and just found them. Furthermore, he also invited a friend to the worksite without asking for permission and also made purchases that he deemed were “necessary” without communicating to us beforehand, resulting in us having to reimburse him for those items he bought without permission."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T21:29:09.000Z",
          "Titre": "Not professional didn’t really know…",
          "Contenu": "Not professional didn’t really know what he was doing! Took way too long for a small tasks and he didn’t clean up his mess just left!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T13:04:32.000Z",
          "Titre": "All the extra charges",
          "Contenu": "All the extra charges. Ended up costing way more than it is worth. I’ll use Craigslist next time to find someone. You got my money but not my business."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T17:18:40.000Z",
          "Titre": "My tasker charged the incorrect time",
          "Contenu": "My tasker charged the incorrect time, I corrected him via text chat. My invoice was never adjusted to reflect the correct time. I reached out a second time. The tasker did not respond. The dresser was put together to my satisfaction. However, the lines of communication was not great, and my invoice remains incorrect.  I will have to rate my experience as a 2."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T00:12:56.000Z",
          "Titre": "1st tasker was a no-show",
          "Contenu": "1st tasker was a no-show.  On the morning of the task, we received an electric message from Taskrabbit that the tasker was no longer available.  bad form!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Selma Selena Gladney",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T03:35:04.000Z",
          "Titre": "He had NO experience.",
          "Contenu": "My task rabbit was NOT experienced in anything I asked him to do. He messed up my drywall and I ended up doing it myself. He also did not complete the second drywall task that I asked him to do. He also did not bring any of his tools. He asked me for whatever tools I had (screwdriver, etc) I don't like to get people in trouble because I know he probably needs the money but geez! This was my first experience with task rabbit and it was not positive. Although I did receive some of my money back, I should have received a full refund. He did nothing I asked for. It seems as if anyone can say they can do a task with no experience and become a TaskRabbit. I am Very disappointed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T21:04:09.000Z",
          "Titre": "Insanely high service fees",
          "Contenu": "The insanely high service fees, charged hourly on top of the taskers' rates, are robbery. They should be included on the rates shown for each tasker so customers know in advance what they're going to pay.I've had a bad experience with Taskrabbit two of the three times I've used it. When you say, \"...our fee supports the safety of our community,\" you aren't really saying anything. Why is your fee different for every tasker? What are you paying for with that fee that is more costly to your customers when the tasker has a higher rate???"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Elizabeth Dickinson",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T23:00:59.000Z",
          "Titre": "The experience with the app and the…",
          "Contenu": "The experience with the app and the Taskrabbit process was great.  My taskers were not great.  Came late reeked of pot improperly assembled furniture and damaged it.  Tasker was highly rated so ho figure"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T17:07:26.000Z",
          "Titre": "My Tasker was unprofessional and made me uncomfortable",
          "Contenu": "My experience with the Tasker I selected was negative. He agreed to a 2-3 time slot to put a bed and bed frame together and immediately upon his arrival said he would not be able to complete the job. This was because he overbooked himself and needed to leave early to make it to his next appointment. While he was working in my home he acted very unprofessional, cursing loudly while building the frame. I posted my experience when I reviewed him and he messaged me directly to rebuttal. He insisted that his inability to complete the work was a miscommunication on both our ends. He said I didn’t tell him the exact type of bed I had and for him it was a complicated build. He also said voicing “vocal frustrations” is common in handyman work. I replied and said I selected the correct type of furniture I needed assembled, a storage bed to be exact. He knew he was assembling a storage bed, if there are certain types of storage beds he struggles to assemble, then he should have reached out and asked for more detail when he accepted the job. Not show up and then communicate that it’s a hard build for him. I also said his language went beyond “vocal frustrations”, it was vulgar, loud, and continuous. Overall he completely half of the assembly, but I realized that Taskrabbit does not screen these people and you should be wary of who you invite in your home. I won’t be using Taskrabbit again due to this experience."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T01:10:47.000Z",
          "Titre": "Beware the added Fee!!",
          "Contenu": "Loved the Tasker and how easy it was to locate him.  Hated the additional nearly $100 charged on top of the rate paid to the tasker.  The fee should have been made clear from the get-go and I probably wouldn’t have used Taskrabbit."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "TRCistomer",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T22:15:06.000Z",
          "Titre": "I have had multiple Taskers cancel…",
          "Contenu": "Last Tasker I had, said his wife would help out so he could get the cleaning done quicker and then expected me to pay double since his wife was helping.  I said no, your wife helping means you get the same pay as if it was just you. As you can do more jobs that same day.  He said 2 workers times the hours spent as if it was just him it would have taken longer to do.  Taskrabbit needs to se guidelines for this type of manipulation."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Handy Customer",
          "Nb_Reviews": 4,
          "Date": "2023-11-27T22:59:57.000Z",
          "Titre": "It cost significantly more than I was…",
          "Contenu": "It cost significantly more than I was quoted and I don't think my Tasker was as qualified in Ikea specific build outs as he claimed. It was supposed to take 1.5 hours tops and it took 3.5. I want to be reimbursed for the additional time that I had to pay."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Garry",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T23:34:59.000Z",
          "Titre": "It took 3 hours to complete setup",
          "Contenu": "It took 3 hours to complete setup. Everywhere I checked was showing me max 1.5 hours to setup so why I paid so much extra?Taskrabbit estimate was 1.5 hours. I checked many reviews of customers (non professional) buyers had it setup for themselves in 1.5 hours.I ended up overpaying."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer: Joanie Cesano",
          "Nb_Reviews": 2,
          "Date": "2023-11-21T22:56:35.000Z",
          "Titre": "Don't assume anything...",
          "Contenu": "I was assuming the tasker was doing the assembly properly, but there were a number of screws left over after he had left the job (and I'd paid w/ a tip) and I only found the pieces while getting ready to dispose of the cardboard box the car came in. Fortunately, my son in law said they were not necessary pieces, but I would have expected him to show me the pieces...not make me find them by chance.Then I asked him if he had the ability to take care of a towel bar and toilet paper holder that had come loose from the wall after recent papering; he looked at the situation, and I left him to it - then announced it was all done. I assumed the job had been done correctly, when, in fact, he did move the hardware over ONLY to leave the large gaping holes that I was asking him to fix!I contacted him immediately after and he asked if the holes were very visible! At that point I was done with him and Taskrabbit. Won't be using them again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T22:06:05.000Z",
          "Titre": "How could that go wrong",
          "Contenu": "How could that go wrong?  Everything went wrong, they were late....the drilled extra holes in my wall.  The original person I hired brought another person to assist..he did not know what he was doing either.  The hanging storage shelf was not even level.  A TV mount and a hanging storage shelf too two people more than 3hrs to complete.  Not a good experience at all"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-17T23:20:15.000Z",
          "Titre": "They did not finish the task",
          "Contenu": "They did not finish the task. Wasted time and money on Task Rabbit  IKEA recommend a task rabbit to assemble their closet systems. He seemed to very knowledgeable about how  they are assembled. He knew the scope of the task prior but did not allot enough time to complete it. He left it 90% complete because he said he had another appointment.  I’d give him a B- on the part he completed. Per IKEA, task rabbit is supposed to align and secure the closets. I had to hire someone else to finish the job properly. Would not hire Task Rabbit again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lori Miller",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T23:37:48.000Z",
          "Titre": "The movers were great",
          "Contenu": "The movers were great! I don’t appreciate the extra fees now associated with this company and will look for private contractors"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Winona",
          "Nb_Reviews": 10,
          "Date": "2023-11-13T21:20:11.000Z",
          "Titre": "The Tasker? Great! Website? Nope!",
          "Contenu": "Tasker was great. Please tell me where the additional charges such as Trust and Support fee are written along with an explanation about “Reimbursement” fee of $50 Unless I hear I will NEVER use nor recommend TaskRabbit."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T00:03:36.000Z",
          "Titre": "this company does not make it easy to…",
          "Contenu": "this company does not make it easy to connect with several tasters for the same job to choose amongst them. you have to schedule with a taster to speak to them and cannot schedule with multiple takers for the same job."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T01:57:00.000Z",
          "Titre": "That extra fee cost me like 60 dollars…",
          "Contenu": "That extra fee cost me like 60 dollars unreal"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ashleigh",
          "Nb_Reviews": 3,
          "Date": "2023-11-22T20:06:51.000Z",
          "Titre": "Accidents happen - Taskrabbit doesn't help",
          "Contenu": "Accidents happen. My tasker picked up a couch for me and delivered to my apartment. A window cracked when moving the couch (which I did not see). Filed a claim and taskrabbit denied it. Happiness pledge is garbage."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "stella m",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T17:42:10.000Z",
          "Titre": "extra fees",
          "Contenu": "although the people on task rabbit are good and handy, task rabbit itself charges so much in fees, and they really avoid telling you about extra fees when you go to book. In a way the final bill is blind sights you."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T19:08:06.000Z",
          "Titre": "Task -Rabbit",
          "Contenu": "Tasker was great slow but great. He finished the job that should’ve taken around 3 hrs in 6 but was at my home for over 6 hours… took forever to arrive & left at 2am … 3/10 & don’t recommend… probably will just put my own furniture together next time"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "J. McIntosh",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T02:53:33.000Z",
          "Titre": "I wish Brad would have been honest…",
          "Contenu": "I wish Brad would have been honest about his ability level.  I asked to have two holes drywalled closed, a wall built with drywall hung puttied and taped.  As he worked, I asked to make revisions. He agreed to do the work. After 3 visits, the work still wasn't completed - the framing was great - the drywall, not so much.  I've hired someone else to finish. Additionally, instead of asking about purchasing supplies, he would just go to the store and billed me at the end of the day. I never got a reciept. He would never announce his departure, I would just get a message thru this app.  I gave him 2 stars because he generally arrived on time, communicated thru the app and got the framing done. Advice: only agree to things you are truly skilled at."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T23:57:50.000Z",
          "Titre": "Disappointed in the service I received",
          "Contenu": "My most recent experience is what is prompting my latest review. I hired a Tasker to mount 2 TVs for me. As a lot of Tasker's had \"2 hours min\" on their public profile, the tanker I chose did not. Once the task was done (I also have some complaints on my tasker's work) in a 1 hr time frame, I was charged for 2. The Tasker messaged me and told me he charged me the 2 hour min, I asked why as it was not noted anywhere in his profile and he told me \"idk sorry for the confusion.\" I reached out to Taskrabbit support, the first person I talked to said she would look into my dispute and send me an email with an update. I never received one. I reached out to the support team again today for help. Angelo is who helped me. He offered to refund the hour I was charged, less the Taskrabbit fee they now charge on all tasks per hour. Even though I only had an hour service. I asked if there was anymore he could do since the charge error was in the tasker's error, not mine. I also asked when I should expect the refund on my account. He ended the chat without a response. Extremely rude, esp for a paying customer who is NOT at fault. Makes me want to reconsider using this app."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T18:38:41.000Z",
          "Titre": "The hourly rate charged from TaskRabbit…",
          "Contenu": "The hourly rate charged from TaskRabbit which is not mentioned until after selecting your tasker is ridiculous. Also, one should be able to see the taskers schedule and all reviews before selecting them. My tasker himself was great though"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T19:11:57.000Z",
          "Titre": "Unclear info leads to high unexpected costs",
          "Contenu": "1) 37% service fee (\"trust and support\") is far too high. 2) Depending on how Taskers list their rates, the final price may not be known until after the job is completed and the charge is put through. This is a price listing issue -- not an issue of a task taking longer than expected and additional time being charged. Given how much the price can vary, plus the service fee amount and how it is charged, clients might opt to use a different Tasker or service if the full information was known upfront."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T15:25:40.000Z",
          "Titre": "The easiness of booking was superb",
          "Contenu": "The easiness of booking was superb; however, the trust fee being per hour is simply ludicrous. I somehow thought it was a one time fee but when I saw the total, I could not believe it. I also had to pay the parking, plus the guy had no clue how to install the rod, I had to tell him where to place the brackets. This error cost me an extra hour. It’s a convenient service but don’t think it will be my first choice moving forward 😢"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T00:13:16.000Z",
          "Titre": "Misleading Fees",
          "Contenu": "The website is very misleading about their fees - it looked like the fee would be around $15 (flat) but, TaskRabbit wound up charging us an extra 36.5% of the total just for their own fee. We will not be using them again. Thankfully the tasker did an okay job; however, if we had understood all the fees upfront we would not have used them."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T14:49:40.000Z",
          "Titre": "Bad installation",
          "Contenu": "I had 3 blinds installed. Today one of the valances fell and cracked. I'm so disappointed in the services that were rendered."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ME",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T01:14:59.000Z",
          "Titre": "Exorbitant 40% Fees!!",
          "Contenu": "Other than finding us a great handyman that did an excellent job on our sink, I would not recommend TaskRabbit. Their ridiculous fees were nearly 50% of the cost of the project!!!!! If we would have known this up front. We would have never used them. This \"trust and support fee\" is a complete scam. Save your money and use one of the other apps or hire someone directly. I would have rather given that money directly to the handyman instead of to this greedy company!Update:  I cannot find anywhere what the trust and support fee actually provides, it's impossible to find the answer. Please feel free (TaskRabbit) to post here publicly what this 40% extra per hour fee goes towards!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T16:58:25.000Z",
          "Titre": "Disrespectful behavior",
          "Contenu": "Mediocre. Task rabbit allowed their tasker to curse me out and be rude to me even with evidence of the behavior. I was promised a $25 promo for my next task — nothing was applied to my account."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Worker good Taskrabbit not",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T22:30:16.000Z",
          "Titre": "Taskrabbit's quote was half of the final cost",
          "Contenu": "The person I hired did an excellent job.  However, Taskrabbit did not include its fees in the quote.  When I got the final bill, it was twice what I had been estimated, and the work was done in the estimated time.  The bad estimate is not the worker's fault; it's definitely the fault of Taskrabbit.  I will think hard before using it again due to the surprise fee structure.  It feels like the \"resort fees\" that hotels don't include in the estimate, but do when a client checks in."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "E N",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T21:09:33.000Z",
          "Titre": "The pricing strategy is off",
          "Contenu": "The pricing strategy is off. Taskers are incentivized to work slowly due to hourly rate.*update after TaskRabbit's reply*I don't think the Tasker is at fault so not sure what there is to contact support about. The tasker took just a little more time than the 'average time' estimate for the IKEA items I asked to be assembled on TaskRabbit's website. Based on my personal experience assembling many IKEA items and observation of the tasker's progress, I was expecting a faster pace from someone who assembles IKEA furniture every day. I would prefer a pricing model that bills per item completed and is more upfront about the final cost. The current business models incentivizes the Taskers to 'fill up the time' that is estimated and have no reason to work faster."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T21:07:35.000Z",
          "Titre": "Talk directly to insure clear communications",
          "Contenu": "It is probably better to speak directly.   I didn’t get what I needed probably due to lack of clear communication."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Marcus",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T19:51:05.000Z",
          "Titre": "Misleading",
          "Contenu": "There were definitely fees from Task Rabbit that I was unaware of. I had the impression that those fees were included in the quoted rate for work. Additionally, who is the quantity control person. I was quoted 6 hours of work and he was here 9.5 hours. If the request or underestimated the time frame, then there should still be a conversation before continuing to work. Or who monitors that the hired contractor is working efficiently?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T21:33:35.000Z",
          "Titre": "the price of corparate task rabbit is too high!",
          "Contenu": "the tasker i hired is great! she's perfect for the office admin task i hired her for.and while i loved using task rabbit years ago, the newer corporate version of task rabbit since the purchase by ikea will mean that i am unlikely to work with them again due to the imposition of a 25-30% upcharge. frankly it is insane and not sustainable. if this upcharge were to lessen with each repeat use of the same tasker, that would be great, down to 5-10% for repeat scheduling of the tasker. alas they don't. it just feels like greed personified. and that i am not interested in."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Maybe not...",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T21:41:39.000Z",
          "Titre": "Outrageous 41% fees!",
          "Contenu": "The fees they charge are simply outrageous. On top of the hourly rate for the tasker, TaskRabbit tacks on an additional service fee of up to 41%.  I hired someone at $20/hour and ended up paying $28.20 per hour after TaskRabbit's fees. That's highway robbery!I won't be using TaskRabbit anymore with fees this high. I don't mind paying fair prices, but 41% on top of hourly rates is absurd. They are taking gross advantage of customers in my opinion. I know Taskers deserve to be paid for their time, but TaskRabbit is lining their own pockets with crazy fees too. I can't recommend using this app until they lower their fees to a reasonable level."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rayon Williams",
          "Nb_Reviews": 3,
          "Date": "2023-08-06T11:28:49.000Z",
          "Titre": "The Task Rabbit was 2 hours later than…",
          "Contenu": "The Task Rabbit was 2 hours later than the appointment time and failed to complete the task correctly. He did not secure the middle bracket of the curtain rod, leaving the fabric to sag and inadequately covering the window in the bedroom. DISAPPOINTED! On top of that, he spent merely 20 minutes on the task and charged two hours worth of service!!!!!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T09:07:56.000Z",
          "Titre": "I think Taskrabbit taxes way to many…",
          "Contenu": "I think Taskrabbit taxes way to many fees the app should be more transparent on total cost for the time you need for your task sort of how air bnb finally start doing that can make customers not come back after a task is complete like myself I don’t know if I’ll use again will try the competition"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mattie Triplett",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T01:22:56.000Z",
          "Titre": "First Time w/Task Rabbit",
          "Contenu": "From the very beginning I explained I needed to know if list of To Dos would be completed before 11:30am, welp that didn’t happen took 2 more hours than planned…not sure if that’s intentional or not however not only did the list not get completed but it took twice as long for MORE MONEY…Alsooooo I have a ton of EXTRA screws and such left over from the assembly…Doubtful I would use this service again"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T02:48:35.000Z",
          "Titre": "Booked tasker several times who…",
          "Contenu": "Booked tasker several times who canceled out on us on multiple occasions. Finally one who helped us with the task needed lot of help from us and we had to hire another person to help her to finish the job! Costed us double the amount suggested by the Taskrabit!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Avram",
          "Nb_Reviews": 2,
          "Date": "2023-11-12T04:24:21.000Z",
          "Titre": "TaskRabbit is stressful to use.",
          "Contenu": "This review is about the TaskRabbit service, not the Tasker who did my job - he did a good job. I find TaskRabbit's process frustrating. As a customer, the very first step is for me to put myself at the mercy of before interacting with him: I have to choose somebody based only on his reviews; I have to pick a specific day, time, and my personal estimate of how long the job will take; I have to describe what I need. Then it is up to the tasker to decide whether to take the job or not. He can take the job without ever responding to a single question I may have asked. Once the job is less than 24 hours away, I have to pay for it even if I cancel - and even if that is before I've been able to determine if the Tasker really is a good fit for the job. Twice, I have had the tasker send me one message asking for \"more detail,\" and then I didn't hear from him again until the cancellation window was about to close. The first time I cancelled. The second time I decided to take my chances, and ultimately the Tasker did a good job. However I was stressed the whole time because I had not had an adequate conversation with him until a few hours before the appointment, and I had already put my tenants through the inconvenience of scheduling their lives around the appointment."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Theth Ward",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T01:29:22.000Z",
          "Titre": "TR fees are outrageous",
          "Contenu": "Used for a cleaning service. The person was incredibly nice and on time. Cleaning job took an hour longer than same site by other cleaning crews but was less thorough. The main cause of frustration though is the TR fee which ended but being $70+ on a $180 job, so essentially a 40% add-on. And you're expected to tip. Never again, thanks!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-09-26T19:58:07.000Z",
          "Titre": "I chose a taster who took on the job…",
          "Contenu": "I chose a taster who took on the job but said he’ll be a few minutes late, than an hour late than another hour and after the third hour had passed as I’m waiting for him in an empty apartment with nothing to do, he canceled. He then got out of the chat leaving me with no recourse. Task rabbit should ask me what happened when a job is canceled and allow me to leave a review for the tasker. This guy walks around with only five star reviews. That’s on you guys!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "E.A.",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T20:54:09.000Z",
          "Titre": "Disappointed",
          "Contenu": "I felt like the responsiveness of the person I hired was quite slow, and when we finally nailed down a time, it was changed from the initial request and then they were late. In addition, the trust and service fee was 25% of my final charges which felt really steep, I wasn't expecting that. Though the final product was good, the process just wasn't. I won't be using this service again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T17:34:56.000Z",
          "Titre": "Paid $341 and expecting something more…",
          "Contenu": "Paid $341 and expecting something more professional. This task is for an empty house. In given detail states clearly that need to wipe windows and cabinets bathrooms as well. Improper equipments. Lot of unwipe surfaces left behind. We need to wipe all inside cabinets in kitchen again. Didn’t clean windows which we didn’t know that we need to inform. Curtain holder didn’t been touch. I chose because the good review taskers was unavailable and wanna give a try. There was a misunderstanding about charge. I asked how much it cost for 2 persons. The response was “it is the same” which actually meant will be charged same rate = double. They was nice guys but for job, not recommended."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brad Ross",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T15:10:18.000Z",
          "Titre": "When you get payed by the hour….",
          "Contenu": "Well, Donald was a very nice man or he would get a one star.  The estimated time to build these pieces was 2 hours so I allotted twice that when deciding to use this service just to be safe.  It took Donald 12.5 hours.  I went down to ask him if he needed help multiple times, only to find he had started building something and hanging it in a different way than we had clearly described, or had made arbitrary decisions without us and had to redo multiple steps.  We had to cancel our family dinner plans because he was here until 830pm.  I’ve built many IKEA items and it looks like I’ll be building more in the future."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "DeAnya Moore",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T15:56:01.000Z",
          "Titre": "Clay repeatedly delayed my scheduled…",
          "Contenu": "Clay repeatedly delayed my scheduled appointment. This conflicted with my schedule for two days. He ended up not showing up at all on Friday, was two hours late on Saturday and my television has to be replaced!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "KB Hughes",
          "Nb_Reviews": 7,
          "Date": "2023-12-14T21:08:57.000Z",
          "Titre": "Not the best first experience!",
          "Contenu": "The tasker was late and left a mess behind."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T18:36:51.000Z",
          "Titre": "the fees are really high",
          "Contenu": "the fees are really high , the handyman came and said minimum is 2hrs , when they didnt put that way on the website, ( some of them did).  Also i had to pay the amount right away even though i needed the part to be ordered and then the handyman said he will come back to repair, so that is not a flow that is done well in the system"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T18:22:14.000Z",
          "Titre": "too Slow",
          "Contenu": "The person who came for assembling the stuffs was so slow and assembling a bed and just half a sofa took 5 hours.If he was proficient enough, it should took 2 hours at most and I had not to pay extra 150 USD for his slowness."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Disappointed customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T20:42:20.000Z",
          "Titre": "Unfortunately",
          "Contenu": "Unfortunately, the doors were put on upside down … need I say more."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-09-17T23:02:11.000Z",
          "Titre": "Very UN-user friendly",
          "Contenu": "Very UN user friendly.  Back and forth and 'round in circles. Email text phone app I gave up  then you sent someone out thinking they were doing another task than I eventually needed. Helpful and kind I found other tasks to fill the time. I will not use task rabbit again.PLEASE CANCEL ANY UPCOMING TASKS ASSIGNED TO HIM OR ANYONE ELSE."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "jar",
          "Nb_Reviews": 2,
          "Date": "2023-09-28T23:57:51.000Z",
          "Titre": "So far, unimpressed",
          "Contenu": "So far, unimpressed.  The TR website is clumsy and, for me, unnavigable.  If something is unclear, there is no live person who can help me; I just get sent back to the website.  I did finally manage to get an appointment for yesterday, 9/27/2023.  Meanwhile I had other things I wished to add to the list but was unable to do so on the website.  When Paul arrived I showed him what else I needed done.  He said that since he was heavily booked for that day, he would get the necessary parts and I could then make another appointment.  This was fine, and he advised me that there might be a nominal charge for his having come and assessed the job.  I then received a bill for the full hour, to which I replied that the job had been cancelled.  I have not heard back one way or the other."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T22:12:12.000Z",
          "Titre": "First Tasker (Mehdi) canceled me on the…",
          "Contenu": "First Tasker (Mehdi) canceled me on the morning of scheduled job after confirming and rescheduling more that 3x without any explanation or notice.  He had expected to add 1 more tasker to help, which he should have told me he was not experienced enough to do the job.  He should not be described as “elite tasker”on his profile.Second tasker (Nageb) came on time and was efficient with completing job.  He charged 1.5 hours more so the total cost was $500+ for assembling an Ikea Pax, which is kind of pricey considering it is 42% of the cost of the Pax system.  But the main complaint was that the handles on the doors were installed crooked and misaligned.  He only eyeballed it and hurried to leave.  I only discovered this after he left and he ghosted me afterwards when I asked if he could fix it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T23:27:49.000Z",
          "Titre": "BE TRANSPARENT WITH FEES",
          "Contenu": "BE TRANSPARENT. Put ALL IN pricing UP FRONT. When someone is shopping for a service within a budget it is not helpful and takes much more time than needed to search through taskers you THINK are within your budget only to find that taskrabbit adds all their fees at the end."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "F W",
          "Nb_Reviews": 3,
          "Date": "2023-08-09T01:51:48.000Z",
          "Titre": "Tasker is fine- the app could use…",
          "Contenu": "Tasker is fine- the app could use improvement.My taskrabbit was great- unfortunately, I was not able to apply the credit previously offered by Taskrabbit for the last service I'd used that did not go well. I chatted with the bot and submitted my concern for review and a week later, nothing was done about it and no one has followed up."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lucille",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T20:51:45.000Z",
          "Titre": "Tasker Cancelled last minute!",
          "Contenu": "Hired someone, Matt, for a moving job. They cancelled at 8:15 pm the night before the 11:00am move the next day!  I had to scramble to find someone else and had to pay $22 an hour more than the original guy. Task Rabbit penalizes people who book someone and then cancel but they have no consequences for Taskers who cancel or don’t show up."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T18:22:12.000Z",
          "Titre": "Incomplete,unstable,missingnails",
          "Contenu": "Incomplete,unstable,missingnails. Notices after the tasker left that the mount is not aligned correctly in the floating desk and nails were missing that would make it fully secure. Table unstable in use."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T23:36:09.000Z",
          "Titre": "Took way too long",
          "Contenu": "I’m thankful for the help in putting my furniture together; however, I felt like it took WAY too long to get the job done. I was not expecting nor did I plan for her to be at my house for 5.5 hours. I estimated it to be a 2-3 hour job, which it was accepted at, and what I expected it to be done in. It just felt like she took an excessively long amount of time. Additionally, I didn’t like some of the conversations I overheard with my older daughter where she was talking about the patriarchy and then made a blanket assumption that I didn’t work. At that point I was just too tired to say anything and knew she was finishing up, so she could head out of my house."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Val",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T21:20:43.000Z",
          "Titre": "Lacking quality.",
          "Contenu": "Needs higher skilled people - more quality assurance checks. My \"moving help\" task resulted in a damaged, very expensive dresser. I would use Lugg next time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T02:32:23.000Z",
          "Titre": "I was charged $110 by TR on the top of…",
          "Contenu": "I was charged $110 by TR on the top of payment to the movers. Movers were great and professional but I am surprised by 30% surcharge by TR. this was not communicated with me before hand and appears largely disproportionate."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T02:20:45.000Z",
          "Titre": "My experience was unfulfilling",
          "Contenu": "My experience was unfulfilling. My tasker did not complete the task. He gave every excuse and no solution. He was too talkative prior to arriving and still was too talkative while here when he arrived 15 mins late."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ALClark",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T15:21:45.000Z",
          "Titre": "Tasker great, service fee insane",
          "Contenu": "The Tasker was excellent, and did a great job.  This review is not about that individual.  The outrageous fee imposed by Taskrabbit per HOUR of the job increased the project cost by an unexpected, unnecessary amount. Probably will not use the service again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "LH",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T23:20:50.000Z",
          "Titre": "The cabinet doors were installed too…",
          "Contenu": "The cabinet doors were installed too high causing an open gap on the bottom"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jake Mastrud",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T19:47:56.000Z",
          "Titre": "Terrible App messaging system",
          "Contenu": "The taskers were constantly late or trying to reschedule. The Messages I sent to taskers to coordinate another meeting time, showed up as sent. Then when I would go back into the app to check a response, my message would be gone like it had never been sent. Sometimes the message would appear as orange, but there was no indication key or error message associated with what that meant. This happened multiple times and I ended up just having to cancel with the taskers because it became to hard to communicate a time to reschedule."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Saguaro .",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T05:52:40.000Z",
          "Titre": "Plumber we hired did great job.…Then",
          "Contenu": "The plumber that we hired did a great job in October 2022 when we first moved in putting in a restaurant style faucet in the kitchen so we hired them to change the filters in our reverse osmosis, filtered water tank The job was left partially done & follow-up was disappointing // We were hoping to hone in on him for all of our long term plumbing needs….."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sharon",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T02:54:49.000Z",
          "Titre": "Fees too high",
          "Contenu": "We used TaskRabbit (owned by IKEA) for a small light carpentry task. An old microwave needed to be removed from a wooden cupboard and replaced with our new microwave.The carpenter was excellent and did the job in less than an hour. However he had a 2-hour minimum, and I thought that it would take at least that long. So he kindly refused a tip. My complaint is that TaskRabbit has very poor disclosure of how much their fees will be added until you get the invoice. My payment to the carpenter was $134.20 and TaskRabbit added $49.41 (36.8%) to the bill for a “Trust & Support Fee” which I feel is far too high."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T18:38:18.000Z",
          "Titre": "I hired my first tasker to mount a…",
          "Contenu": "I hired my first tasker to mount a TV, install new blinds and mount a couple small shelves. Blinds look great, TV mount was installed in a creative way, and one of the shelves fell down after they left. I noticed multiple holes in my wall that they did not tell me about. Now I’m worried about how the TV was mounted. I relied on reviews to pick my tasker, but if I ever choose to do this again I will ask for more examples of work and maybe even a second opinion. I hired through here because I am not an expert nor do I have the time and tools to hang stuff. Was hoping for a better experience."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Unhappy customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T18:21:57.000Z",
          "Titre": "Bad experience…3 taskers cancelled the appointment before one showed up.",
          "Contenu": "We booked a tasker that agreed to a weekend time, the delivery of furniture was delayed and he agreed to move the appointment time and then simply cancelled after he was supposed to be there. Then we tried to book two more taskers to assemble furniture and they both canceled after accepting the job. Taskers book various jobs at a time and don’t show up and I see that there are no consequences.  Just an unhappy customer left hanging with unassembled furniture. I am sure that if I cancelled last minute or after appointment I would be charged for taskers time. I was then able to get someone to help the next day “Rafig”, and this tasker was very helpful and communicated well over the app. Task Rabbit takes my credit card and I don’t get any notification if I was charged for the cancelled appointments. Would not use the platform again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T17:21:07.000Z",
          "Titre": "I should be able to select multiple…",
          "Contenu": "I should be able to select multiple taskers for a job.. it’s difficult to select only one and chat with the person. If that person doesn’t fit your job description then again you have to start new search and add all the details again"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T14:36:27.000Z",
          "Titre": "The guy wasn’t very nice",
          "Contenu": "The guy wasn’t very nice! He refused to take down the boxes to the garbage dumpster. I had recently had surgery & wasn’t allowed to do any physical labor. I also asked if I could pay him extra to hang a few pictures & he said no - he’s furniture assembly only."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Deborah Schauffler",
          "Nb_Reviews": 3,
          "Date": "2023-08-24T17:03:25.000Z",
          "Titre": "Difficult to use the app",
          "Contenu": "Difficult to use the app - suddenly it tells me my chat has been disabled - no idea why or how to get it back . Really liked my first tasker and she said she’d cone again  but now can’t contact her. This is my first experience and doesn’t make me want to use again ."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dr. Green",
          "Nb_Reviews": 2,
          "Date": "2023-10-03T21:46:06.000Z",
          "Titre": "Okay but, will not use again....",
          "Contenu": "The hiring process is great, quick, and efficient.  However, the $50+ dollar service charge on top of an additional per hour charge seems like a rip off."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kimberly M.",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T05:40:40.000Z",
          "Titre": "Bad 1st time experience!",
          "Contenu": "My tasker was not on time, I had to call him to see if he was even coming.  Also, when he did arrive, he didn't bring all of the parts, even though I sent him pictures of the damaged parts.  Also, he didn't even apologize, say he was sorry, or anything about his lateness.  Lastly, after half doing the job, he tried to finagle me on the price and to top it off, my sink still isn't fixed correctly!!  Won't use them again!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T17:24:03.000Z",
          "Titre": "Not trustworthy",
          "Contenu": "I wish I was aware of the fees before I agreed to the service. There is no way to track when the tasker is finished with the work unless you’re there. It was my first time and I didn’t know what to expect. The tasker wasn’t communicating at all. He didn’t let me know he was finished until I asked him about the task then 2 minutes later he stopped the charges which charged me 5 hours just for a cleaning on my apartment that I already had cleaned."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brandon Kline",
          "Nb_Reviews": 3,
          "Date": "2023-08-18T00:24:22.000Z",
          "Titre": "Maybe good for very easy tasks",
          "Contenu": "I have attempted to use Task Rabbit for three tasks and I have never successfully had a task completed.In each case, the Tasker came, tried, but was unable to complete the job.None of the jobs was particularly involved or complicated."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Martin Gutmann",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T22:19:56.000Z",
          "Titre": "Tasker was great, but outrageous hidden fees.",
          "Contenu": "The actual tasker was great, but the hourly \"Trust and Support fee\" on top of the task's rate is a joke.  An expensive joke.  Nowhere is this clearly disclosed.   Not when you sign up for the task, and in the confirmation email it is only in tiny, grayed out print.  I, and apparently many others, only became aware of this when hit with the giant bill after the task.  For me, it added $226 (37 percent) to the tasker's hourly rate.  For what?? I understand the taskers don't see any of this.  I called TaskRabbit, and all I got was a useless $80 credit for a future task I will never book unless this fee gets at least partially refunded.  Would love to use this service again, but only if they fix this."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T21:33:41.000Z",
          "Titre": "High service fees and an incomplete project",
          "Contenu": "I chose a very well reviewed tasker with 100+ tasks completed for my type of project, painting, and spoke with him in advance of the work including photos of what I needed pained. He estimated 3-4 hours. At 3x the estimated amount of time and needing to come back for a third time I sent him home with the project incomplete. At this point, I was well over budget for the project given the original estimate. For what he did accomplish he did a good job but unfortunately the project wasn't completed and I spent 3x more money than I expected to and still have to finish it myself. Additionally, I was charged for materials that I wasn't expecting to be charged to as I offered to provide everything he needed and $19/hour in taskrabbit fees which I wrongly thought was a $19 charged by the job not per hour. Taskrabbit could be more clear on their service fees including what they're for. I was left with a bad taste in my mouth after my first taskrabbit experience and will not be using the service again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T19:44:06.000Z",
          "Titre": "Electrician didnt had much clue on hiw…",
          "Contenu": "Electrician didnt had much clue on hiw to do the job. It took him 1.5 hrs to understand voltage is low and wire is cracked. Aftet 5 mins of intraction, IAaked if he has done ceiling speakers before and he said yes. Job was not done and i am charged 150$ which is ridiculous!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jerome chambers",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T20:42:49.000Z",
          "Titre": "Your charges for truth and support of…",
          "Contenu": "Your charges for truth and support of $24.00 wasn't expected and it is not a service. As a consumer we shouldn't be responsible for training your employees. I will not be using your services in the future.  I will also write a review for all to see.  Very disappointed with these charges"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T00:49:44.000Z",
          "Titre": "Taskrabbit’s fee is too high",
          "Contenu": "My cleaner was wonderful and did excellent work and that wasn’t the issue. The issue is… as a customer newly signed up all expenses should be listed. A agency fee for using Taskrabbit was added and that was very expensive. Luckily I had the extra or I would’ve had a real problem on my hands. For 6 hours of work that was about $100 extra that I was not aware of until you download the app and scroll through. Id rather given that to the tasker to be honest. Going forward, people probably won’t use this service as much considering it’s such a high fee and that’s less work for the taskers. Make it make sense for everyone in the mix."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:40:07.000Z",
          "Titre": "Just okay...",
          "Contenu": "We didn't start communication off on a good start. She had a conflict, so timing had to change. I was moving the day of and was late to meet her at the old apartment. She kept texting me asking when I was going to arrive. I was driving. I finally told her to leave and charge me as I didn't know my exact ETA and was getting frustrated. She ended up staying. When I returned to leave the keys etc., I was not impressed with the job she did. In fact, I cleaned up some additional areas. Grateful nonetheless, but it could have been done a lot better. Thanks."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T22:46:56.000Z",
          "Titre": "tasker would take longer than expected…",
          "Contenu": "tasker would take longer than expected and anticipated as they are paid by hour. for 10 mins talk they will take 1 hour.Plus taskrabbit would charge a service fee per hour which can be 20 to 30 dollars"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:06:53.000Z",
          "Titre": "Based on my ordered items",
          "Contenu": "Based on my ordered items, the time for assembly will take 3 and half hours, which I agreed online. But the tasker took 4 and half hours, and the cost was calculated based on the tasker's time, which was not agreed initially."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T06:08:36.000Z",
          "Titre": "My tasker canceled ten minutes before…",
          "Contenu": "My tasker canceled ten minutes before we were supposed to meet. TaskRabbit matched me with another person, but they were twice as expensive and only available 3 hours after I intended to start my task"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "carol T",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T03:55:15.000Z",
          "Titre": "Tasker was excellent",
          "Contenu": "Tasker was excellent. Don't like that there was a 3 hour minimum regardless of how long the job took and then $35 service fee that you are not aware of until you get the bill."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T04:51:38.000Z",
          "Titre": "Used Taskrabbit to book a cleaning…",
          "Contenu": "Used Taskrabbit to book a cleaning service, thinking that I would be hiring a cleaner at a reasonable price.  But with Taskrabbit’s trust & service fee, it was costlier than I anticipated.  And I chose a person with five star reviews, but with the amount of work she completed in the time frame allotted, I would have gotten more for my money if I’d hired from a cleaning service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T00:57:42.000Z",
          "Titre": "Found the website very unfriendly",
          "Contenu": "Found the website very unfriendly. Things disappeared (parts of messages). My Tasker was excellent so it was worth persevering with the wretched website. Sometimes it is not with going through a 3rd party like this."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T00:39:31.000Z",
          "Titre": "I have used this service many times…",
          "Contenu": "I have used this service many times before and it was also excellent.  The service now has some kind preservice fee that is crazy.   It not advertised as part of the price when you choose the associate for the work.  The associate I choose to change 3 electric switch's took almost 2 1/2 hours to do so."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T04:17:40.000Z",
          "Titre": "The extra fees was a surprise",
          "Contenu": "The extra fees was a surprise. It should be included as an addition $$ to the hourly rate so it is clear and up front. The work performed by the handyman was good but I ended up paying more with fees than if I would have contracted a licensed plumber directly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Meekalicious",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T21:52:33.000Z",
          "Titre": "I think the task should have taken less…",
          "Contenu": "I think the task should have taken less time as we had the same furniture assembly with a different company assembled it in less than an hour!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T00:57:51.000Z",
          "Titre": "The person I connected with texted me…",
          "Contenu": "The person I connected with texted me in English. I assumed she would be the person coming to my house. Instead, she sent someone else, one with a tough time communicating in English. It seems as though the person who was my Tasker was subcontracting work by sending another person."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T00:05:36.000Z",
          "Titre": "While the platform is user friendly…",
          "Contenu": "While the platform is user friendly while requesting for work, but there is no if the task is accepted etc. also there is no way for the user to review the hours the actual work is done .The platform charges are per hour of work which is not at all acceptable. And the fees are not clearly mentioned upfront.Just curious the platform fees is so high to be per hour based. I would use this service if the platform charge is per task .Charging 50% charge as platform fee is too much"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T19:13:04.000Z",
          "Titre": "I was charged for what??",
          "Contenu": "A professional technician contacted me. He was on time and very knowledgeable. But we only had a meeting. No estimate.right now he’s very busy. The only time he can start the project is next year ( January 2024). He spent about 15-20 minutes at my place. I was charged over $70 the next day. There’s no place to communicate with representatives to respond that that task has not began/ has not been completed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shanycole",
          "Nb_Reviews": 4,
          "Date": "2023-12-05T18:33:36.000Z",
          "Titre": "Good Assembly but Miscommunication in Payment",
          "Contenu": "Tasker did a good job assembling the items from IKEA.  Taking off 2 Stars for miscommunication about payment. Tasker extended the job to a second day without my knowledge and after I paid him in cash for an additional task he agreed to you.  When asked he said he canceled task but did not.  In the end, I paid twice for the same work.  Taskrabbit customer service is horrible and could not resolve the issue."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ora Somech",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T16:43:16.000Z",
          "Titre": "Your charges...",
          "Contenu": "The guy that intalled my wardrobe was wonderful. When I booked him, the price was $28 an hour. The total bill was supposed to be about $190 and instead I my credit card was charged $263!! That is a big diffrence. I don't like surprises like that."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ramona V",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T22:11:23.000Z",
          "Titre": "Who are you?",
          "Contenu": "I've only used the service once. I was very puzzled and unhappy that there is no real descriotion of your company, how its organized. Easy to find information about your taskrabbiters licensing, etc. What you really offer  in \"Happiness\" promise. All your descriptions are airy and blithe. Honestly, I wouldn't have used your service if I wasn't so desperate. I had to google the company and read articles to even have a clue about you.  That  said, the tasker that helped with my move was excellent"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "California custoner",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T00:50:15.000Z",
          "Titre": "Cancellations…",
          "Contenu": "I scheduled jobs for two locations and it looks like  both takers accepted and then later declined. So it’s not very easy and people don’t get to see if the takers have good or poor follow-through after scheduled"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T20:23:58.000Z",
          "Titre": "Too expensive but I was impressed by…",
          "Contenu": "Too expensive but I was impressed by the work performed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "beverly mouttet",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T01:33:12.000Z",
          "Titre": "Inconsistency among providers .",
          "Contenu": "Inconsistency among providers .. 1st guy was a dud but the 2nd provider was a gem .  Not sure how you weed thru the lists other than use a ‘super tasked’. .  Price is not a good indicator as my first guy was double the price of the second .."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lee LaFrese",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T22:31:24.000Z",
          "Titre": "My tasker was very good, fees were nuts.",
          "Contenu": "My tasker was very good. He completed the task in a reasonable amount of time. He was careful and did a quality job. However, the price was way too high. I had no idea there were extra fees tacked on to the hourly rate. And the fees were high. I spent about 30% more than I expected. Will not use TaskRabbit again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Milo",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T05:32:42.000Z",
          "Titre": "The guy I hired was very lazy.",
          "Contenu": "The guy I hired was very lazy.Since it was under an order of access supervised by NYPD cops they didn’t let us work for more than ten minutes (10mns) so actually your guy’s presence wasn’t needed for more than 10mns"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DJ in NJ",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T20:56:23.000Z",
          "Titre": "Great service IF you have hundreds of extra dollars to burn.  Sadly, I do not.",
          "Contenu": "The process was easy and the assembly was fine. However, it took several hours longer than the anticipated time estimate (which resulted in more money) AND I was not aware that there would be additional costs added on by Taskrabbit in addition to the hourly rate.  These additional costs totaled ~ $150.00!!!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T23:13:59.000Z",
          "Titre": "Job was good but not unique to Taskrabbit / fee is insane when there are other services",
          "Contenu": "Job was good. Trust and Security fee (33% of the rate, scaling with each hour) caused me to delete my account."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-12-10T16:11:47.000Z",
          "Titre": "The hourly rate was heavily inflated…",
          "Contenu": "It was not the tasker rates I’m complaining about they were reasonable it was all the extra add ons that were not part of the quote it amounted to over $100 which is not acceptable"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T23:46:16.000Z",
          "Titre": "No-show",
          "Contenu": "My first Tasker was a no-show even when I reached out 30 minutes prior and then continued too for an additional 30 minutes post appointment time. I was able tonreschedule with someone available the same day but it was not convenient amd did cost a bit more. The new Tasker was great and I rated him such."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T01:08:22.000Z",
          "Titre": "Great service BUT.....",
          "Contenu": "Great service and my Tasker was awesome...BUT the cost was prohibitive!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T21:27:23.000Z",
          "Titre": "There were fees charged to the total…",
          "Contenu": "There were fees charged to the total that were not communicated on the app or with the person completing the task. When I asked the tasker they said at least they didn’t drag out the job. The job was completed so that’s good. I would be worried to use the app again because it feels like an open tab with my credit card. I hit no response from the customer service because they said it was too soon."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T16:55:05.000Z",
          "Titre": "It's hit or miss",
          "Contenu": "I like being able to find help for tasks. I have had a lot of issues with no-shows, last minute cancelations, and lateness! The booking fee is also very high, especially when the taskers aren't the most reliable. The work done is usually good, but sometimes I feel like it's purposely dragged out to get more hours/money."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T02:05:36.000Z",
          "Titre": "Tasker was awesome, Taskrabbit fees were crazy",
          "Contenu": "The Tasker himself was awesome! Finished my job beautifully and efficiently. Would definitely hire again. That said a nearly 40% “trust and support fee” is ASTRONOMICAL. I don’t object to paying for the app, I don’t object to paying into an “insurance” fund to cover bad experiences, but 40% is absurd. Had the task rabbit fed been a flat fee or even a more reasonable 20-25% I wouldn’t have minded. But 40% is crazy town. I will be shopping for a less costly booking service  in the future."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Su C.",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T01:36:01.000Z",
          "Titre": "My experience with the tasker was fabulous.  It's the app that's the problem.…",
          "Contenu": "My experience with the tasker was great.  When I called to let him know that the tasker that he was suppose to work with had cancelled and that none of the other taskers that task rabbit said were available at the time previously arranged for my job were available, he told me he could handle the job and would bring an assistant.  He arrived on time and did an excellent job.My problem is with the app itself.  I was notified the day of the job a couple of hours before he was to arrive that my tasker had cancelled, but the app says no problem this other tasker is available to do your job.  Just confirm.  When I confirm, I am then told sorry he isn't available.  Try one of these other taskers.  When I try those, I can't even check availability for the day of my job.  Since the task involved two taskers, changing to a different day would be complicated.  I was just lucky that the second tasker was so helpful and also able to handle the job.I also had a lot of trouble hiring 2 taskers, even though I was told I needed two.  Once I hired the first, the system wouldn't allow me to search for a second person available on the same day and time.  It took two conversations with live chat customer assistance to get the second person confirmed.  I had a lot of trouble just getting the first person to understand my problem.  As much as I liked the tasker I did work with I will probably not use task rabbit again because of the complexity and the unreliability of scheduling a tasker."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T23:03:00.000Z",
          "Titre": "Very difficult to find someone that…",
          "Contenu": "Very difficult to find someone that wants to do the project proposed. Went through four taskers before finding someone. The first three backed out at the last minute. Very inconvenient process and very time consuming. The person that ultimately performed the work was very professional and did a great job."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Perla",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T22:51:05.000Z",
          "Titre": "Taskrabbit user fees are getting out of…",
          "Contenu": "Taskrabbit user fees are getting out of hand. Also, I was charged for a full hours work when the Tasker was here less than 10 minutes. I think that is completely unfair as past Taskrabbit employees have charge me per 15 minute increments. Needless to say this last experience that cost me well over $300 to put up five curtain rods and to hang a picture is definitely not worth the money. The service has gotten out of hand and too expensive. The user fees are abusive."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T05:55:37.000Z",
          "Titre": "I like being able to find a provider",
          "Contenu": "I like being able to find a provider. But I do not like not having the ability to post their hours. We are sick relying on the tasker to be honest. Also taskers can easily shirk responsibilities in order to get extra hours."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T21:14:24.000Z",
          "Titre": "The taskrabbit fee ended up being…",
          "Contenu": "The taskrabbit fee ended up being outrageously high and not justified. Coming in around 30% of the project cost is not appropriate.  I will hesitate to use their platform again and suggest other to pay close attention to the fees they plan to attach to projects."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "whitegold03",
          "Nb_Reviews": 3,
          "Date": "2023-11-14T02:32:29.000Z",
          "Titre": "Would be better if the taskers could be…",
          "Contenu": "Would be better if the taskers could be able to communicate before hand off the task or at least put specifics for what they can do.  And even after chatting they must be able to communicate how much time it will take before they take on the task."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T01:25:48.000Z",
          "Titre": "good job assembling; really messy though",
          "Contenu": "already filled out - good job w/ the time and assembly but made a giant mess of packaging and parts (screws, etc) and did not clean any of that up. Also did not attach the wardrobe to the wall - just left w/o saying anything. I would have told him where we wanted it and had him affix it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ms. Trent Sickles",
          "Nb_Reviews": 2,
          "Date": "2023-11-13T04:24:22.000Z",
          "Titre": "A TEACHING MOMENT OF GOOD ADVICE.",
          "Contenu": "I was pleased with the work done for me at a price i could afford. Unfortunately, all of my tasks could not be met due to lack of proper equipment to get it done.  However, I was given good advice to ask for a person that has \"drill hammer\" that drills into a cemented type ceiling. Great to know in the future when I would need this work to be completed"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ted Meek",
          "Nb_Reviews": 2,
          "Date": "2023-11-26T17:51:19.000Z",
          "Titre": "He was a very nice man",
          "Contenu": "He was a very nice man, but he lacked the proper tools to complete the job. It is difficult to drill holes into brick and masonry, but he was only able to hang 2 signs in 2.5 hours. I had another Tasker hang 5 signs a year ago on the same building in less than an hour."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Leo S.",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T18:45:55.000Z",
          "Titre": "The tasker was awesome",
          "Contenu": "The tasker was awesome, but I dunno about TR fees, probably wouldn't use again"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michele",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T22:11:44.000Z",
          "Titre": "The tasker was fine, Taskrabbit’s extra fees weren’t.",
          "Contenu": "The person I hired was fine but charging $21.75 per hour on top of his fee is ridiculous. A vetting fee makes perfect sense but charging 50% PER HOUR on top of what the tasker charges is TOO MUCH!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "SHARON KAISER",
          "Nb_Reviews": 4,
          "Date": "2023-11-14T16:03:35.000Z",
          "Titre": "Good news and bad news",
          "Contenu": "The good news: I was happy with the promptness and quality of work from the guy I hired.The bad news: I initially thought your \"fee\" was for covering administration and the worker's background check or whatever. No problem. But I was SHOCKED to see it got added to every hour of work duration! That's ridiculous. Will not be doing this again.More bad news: it was nearly impossible to figure out how to pay the guy through your app. If anything, that should be the easiest. No option to customize a tip amount either when I finally figured it out. Overall: Waaaay too hard to conclude the transaction, although easy enough to start one."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T20:13:07.000Z",
          "Titre": "Our Tasker was great the fees are HUGE!",
          "Contenu": "Our tasker was great and really got us out of a bind.  The portion that goes to Task Rabbit is astronomical! The site isn't always the easiest to use and the totals including the task rabbit portion of the fee is not clear when a bid is offered."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 3,
          "Date": "2023-11-21T22:43:12.000Z",
          "Titre": "Task Rabbit Fees are exponentially high!",
          "Contenu": "The communication between the \"Helper\" and I was great and he did a good job! BUT, the more than 20% Task Rabbit fees are much higher than expected and so for that I won't use the service again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Krystal Perez",
          "Nb_Reviews": 3,
          "Date": "2023-11-14T17:55:53.000Z",
          "Titre": "Task rabbit is too expensive",
          "Contenu": "Task rabbit is to expensive if I didn’t need my shelf to be mounted ASAP I would had found someone else cheaper. It was a 10 min job that cost me over a 100 dollars which isn’t okay. I appreciate the work, but won’t be using the services again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T17:37:41.000Z",
          "Titre": "Experience was so so",
          "Contenu": "Guy was kind of weird, he said he had a hearing disability so it was hard communicating with him. Job took longer than expected but he was nice for the most part."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Micah",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T03:09:00.000Z",
          "Titre": "I wanted to love it. But it stressed me out",
          "Contenu": "I thought I had booked a tasker. After 10pm the first tasker I booked for “$17 an hour” (after he confirmed he could do it earlier in the day) all of a sudden said his rate was over 3 times that. It felt like a bait and switch because he knew that everyone that was available at that late of notice had a similar rate. With less than 24 hours to book someone else I had to pay a much higher rate to find a tasker last minute after he gave me the runaround. That tasker was amazing, but the whole process felt weird up until then.   I don’t really trust it anymore And I wanted to love it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T20:15:40.000Z",
          "Titre": "The fees are not straightforward or…",
          "Contenu": "The fees are not straightforward or made clear before scheduling. The fees are too high (35%), making using this service not an option.Edit: true, there is a tiny $$/hr when you go to book your task. I had estimated my task to take about an hour but it took longer due to traffic. So when I got the final bill I was shocked. Billing a “trust fee” per hour seems arbitrary.  Why would a two hour service require more trust fees than a 5 hour service? Adding an hourly fee, especially one as significant as $21 per hour, makes no sense. I had also clicked on the “i” link to read more about the service fee and nothing was mentioned there about it being hourly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T18:14:03.000Z",
          "Titre": "The app worked well",
          "Contenu": "The app worked well, and I found a handyman that I was happy with.  But the add-on fee of 36% by TaskRabbit to the handyman's rate seems exorbitant. It's a real disincentive to finding workers through the app."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T22:10:05.000Z",
          "Titre": "Your computer program doesn't work very…",
          "Contenu": "Your computer program doesn't work very well. So far I've booked 2 tasks both of the dates were initially canceled, leaving me to need to change a lot of plans."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T23:29:29.000Z",
          "Titre": "Difficulty getting to right taskerFound negotiating to find and…",
          "Contenu": "Found negotiating to find and communicate with the right tasker challenging. Felt very lucky to have hit on excellent person but am not sure I would be so lucky next time. Am elderly and find the automated approach challenging."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T04:57:42.000Z",
          "Titre": "The app is good. The extra charges are not.",
          "Contenu": "The app is good. The service is good. Very professional. I was not happy with the surcharge on every hour. I can understand a service charge on each job, but not every hour of work. That’s really out line in my opinion,"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lakecia D",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T18:41:28.000Z",
          "Titre": "Quality of work was good, however the charge ended up being more than originally quoted.",
          "Contenu": "The quality of work was very good, however I was charged for 2 hrs of service, that actually took less than 1 hour"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "S. Novak",
          "Nb_Reviews": 2,
          "Date": "2023-11-16T15:28:04.000Z",
          "Titre": "I needed to have furniture taken to the…",
          "Contenu": "I needed to have furniture taken to the local Goodwill who advertised that they utilize taskrabbit for pick ups. I am out of town. I booked 2 men and Goodwill refused to take the items. The items had to go to the dump. The cost of the dump and 2 men was almost $600!!  I was stunned! I think that in the future taskrabbit needs to contact Goodwill prior to the drop off. I had assumed that taskrabbit partnered with Goodwill and all details would be worked out."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T05:31:26.000Z",
          "Titre": "I like a lot about it",
          "Contenu": "I like a lot about it, up front prices, people who want to work and a selection of experiences. The one thing I dislike is the additional fee that is tacked on. Most people on this are now out of my price range. I need to save up to use it now."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charlie C",
          "Nb_Reviews": 2,
          "Date": "2023-09-11T21:58:17.000Z",
          "Titre": "Our first time using Taskrabbit",
          "Contenu": "Our first time using Taskrabbit. Had small-small job consisting of moving one king-size mattress, 2 lightweight twin bed frames from our house downstairs to out house upstairs.  First tasker reported he was running late and then subsequently cancelled.  Second tasker had 2 hour minimum and he was here less than 10 minutes.  I think we live too far from the taskrabbits."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T05:53:42.000Z",
          "Titre": "Company charges too much $$ on fees and…",
          "Contenu": "Company charges too much $$ on fees and additional charges."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Coach",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T04:10:53.000Z",
          "Titre": "Service Fell Short",
          "Contenu": "Well, I love the concept of Taskrabbit, and the door-to-door assistance, I was not impressed with the service provided"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T17:11:45.000Z",
          "Titre": "Your agent did an excellent job with…",
          "Contenu": "Your agent did an excellent job with the furniture assembly over 2 days. However, he arrived 2-3 hours later than the scheduled appointment time, causingnus some trouble innplanning our days. On his first day, he seemed taken aback by the task at hand, as if he was unaware of the specific furniture he was supposed to assemble."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Angel",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T07:53:06.000Z",
          "Titre": "Cost a lot",
          "Contenu": "Cost a lot, like the same amount as the cost of the items that I got from Ikea. The first tasker (Janet) I made a scheduled cancelled twice. She did not consider the value of time for the costumer. The second tasker that I got was very efficient but his hourly rate cost more than my hourly rate. So if somebody is trying to save, better do it yourself."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sheri GB",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T19:37:16.000Z",
          "Titre": "I took several cancelations from…",
          "Contenu": "It took several cancelations from Taskers until I finally got a Tasker to actually keep their appointment and do the work.  While the Tasker himself was wonderful, doing an excellent job on our repair work, the problem remains with the other task I still need to find someone to do. I am not satisfied with all the Taskrabbit cancelations and unresponsiveness."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DMJ",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T21:17:04.000Z",
          "Titre": "Ridiculous Trust & Support Fee",
          "Contenu": "The $40.25 Trust & Support Fee is ridiculous. There is no indication of this fee anywhere in the quote. You're only given an estimate in advance, which you must assume it's dependent on the actual time spent on the task.This is seriously misleading at best."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patricia Bethel",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T16:22:34.000Z",
          "Titre": "FIRST TIME USER",
          "Contenu": "I really like how easy it is to schedule service.  The workers have been prompt in their responses and work has been completed.  The fee to use the service is apparently based on the hourly rate of the worker.  I don't feel that it should be this extreme.  It causes a job much more expensive than it should be."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T20:57:13.000Z",
          "Titre": "Loved the service and our helper hired…",
          "Contenu": "Loved the service and our helper hired was awesome but the fees you tack on are too high."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bellur Ravishankar",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T14:12:45.000Z",
          "Titre": "It was easy to schedule an appointment…",
          "Contenu": "It was easy to schedule an appointment using the web. Mr. Mohammed was very professional and did an excellent job assembling the Love-Sac Sactional sofa. My only comment is you should not charge $25/hour (approx) your service fee, in addition to hourly rate charged by Mohammed! You should only charge one $25 for your service!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T18:42:36.000Z",
          "Titre": "I signed up for two taskers and one…",
          "Contenu": "I signed up for two taskers and one canceled leaving quite a load for the one tasker that did show up. It was a costly day as a result"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T00:56:51.000Z",
          "Titre": "Sort taskers by specialties",
          "Contenu": "The company is good. I guess I didn’t look closely enough at the bios because I chose a tasker who mostly does hauling and moving and I needed assembling. It was the wrong guy. He was lovely and professional but should probably not have accepted the request. I would suggest categorizing your tasters by job type"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Annabb",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T20:50:00.000Z",
          "Titre": "So the tasker  I FINALLY booked was…",
          "Contenu": "So the tasker  I FINALLY booked was great! I booked him again BUT it was very frustrating trying to book someone: one tasker never responded and I wasted two hours waiting; the next tasker went back and forth for another hour then declined the jobI was only able to book someone by paying a two hour guarantee for a 45 minute job so it has been extremely expensive."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dinonerd",
          "Nb_Reviews": 2,
          "Date": "2023-09-26T21:07:43.000Z",
          "Titre": "Also-ran software; excellent Tasker",
          "Contenu": "Task Rabbit is something of a mixed bag. Their software lacks all kinds of features that would have made scheduling my task a lot easier. Perhaps not coincidentally, this lack of features caused them to offer me only a single Tasker, who charged about 4 times as much as their lower priced competitors; fortunately I was able to bypass this nonsense and pick someone else.They've \"punished\" me for using their services by subscribing me to \"Taskrabbit's Email Marketing Channel\", and I don't yet know what else they may have subscribed me to, or whether their unsubscribe link does anything useful. But the Tasker I hired did a great job, and I'd hire him again in a heartbeat. And a service like this is invaluable e.g. for older people who simply can't assemble furniture themselves."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T22:55:52.000Z",
          "Titre": "As a customer",
          "Contenu": "As a customer, we get penalized a one hour's fee if we cancel an appointment within 24 hours of the appointment time...but taskers can cancel anytime. I had 2 taskers cancel on me last minute back to back on separate days. I had certain things scheduled around these appointments and had to work around them, and then they canceled for no reason and I had to rework it all again. Its really quite unfair as a paying customer to allow taskers to use us that way. I should have been offered a discount on my last appointment due to the previous 2 cancelations."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "aardy",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T00:33:48.000Z",
          "Titre": "Great work done by provider, Ridiculous fees by TaskRabbit",
          "Contenu": "Provider did a good jobWhat is Ridiculous is the trust and support fee. 37% charge of actual work? for referral? I will use other sites like Thumbtack in the future. At this rate it is better to use yellow pages :)Also time for using this site."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T00:30:52.000Z",
          "Titre": "Was able to find electrical help after…",
          "Contenu": "Was able to find electrical help after few cancellations. The one I found charged me twice since he got one more person with him. He did not mention this before he visited home. Experience would have been great if I knew beforehand."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "D A McP",
          "Nb_Reviews": 2,
          "Date": "2023-09-26T02:16:49.000Z",
          "Titre": "Good service but hidden fees",
          "Contenu": "The contractor was careful, attentive, courteous, and did not waste time. The pricing however was confusing, and always is because Task Rabbit adds on its fees and it always comes out to way more than what is advertised as the hourly rate. Which is why I hesitate and rarely use this service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T22:25:23.000Z",
          "Titre": "left with a half put together couch…",
          "Contenu": "I disliked that he did not verify that he had all the parts to assemble the ikea couch first!  Instead, he left me with a half put together couch with missing parts that needed to be ordered and worse- put the couch together without the covers on that need to be attached with each piece so I had to take it all apart and reassemble it myself.  I will never use this service again!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DB",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T01:09:05.000Z",
          "Titre": "Surprised by additional charges",
          "Contenu": "I was very happy with the work done by Fatima and her daughter. They were wonderful and professional. The negatives - I did not appreciate the extra charges. The fee for TaskRabbit was high and I did not know I would be charged for her cleaning supplies. Although she asked me if I prefer her to use her products or mine, there was no mention of the additional $24 to use hers."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ms. Jones",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T15:38:30.000Z",
          "Titre": "Sorry, Jose won’t be able to complete",
          "Contenu": "I booked multiple taskers. After a few chats describing my needs they just canceled the booking and I was informed that I had to find new taskers. It was very weird. The application should require them to explain why they are unable to the job or at least warn the customer that they’re no longer available or interested in the job. Also, the additional fees you all charge that have increased tremendously are ridiculous."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T18:57:55.000Z",
          "Titre": "woulda been a better overall rating",
          "Contenu": "woulda been a better overall rating, except as a first-time user, at the end of the process -time to pay- i find out that I am also contributing% to maintain YOUR website and workforce. I like the Advertisers Pay model better.  so not only do I pay for the HandyMan services,  taxes, I am also paying for this white page I am typing on."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T10:22:32.000Z",
          "Titre": "Actual cost vs Fee",
          "Contenu": "The actual work was fine to include cost.  I think the additional fee from TaskRabbit is too high."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T15:11:16.000Z",
          "Titre": "Please rethink your customer service! I think the system needs to be…",
          "Contenu": "I think the system needs to be improved. The app required me to give my credit card information and requirements right away and then I chose a worker, selecting the available hours listed. A half hour later someone repsonded they were not available! Finally someone accepted the job then on the day of our move we got a message saying \"cancelled.\" This is unacceptable and unprofessional. We tried 3 times, got cancellations and the last person did show up but a half hour early and we weren't prepared. He acted very entitled and expected we would drop everything and start to suit his schedule. I would hesitate before using TR again and would not recommend to friends/family."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-09-19T03:35:11.000Z",
          "Titre": "What I dislike is the fees Task rabbit…",
          "Contenu": "What I dislike is the fees Task rabbit is starting to charge now they're crazy high. I understand needing to have money to run a website but some of your fees are just out of this world high. And some of the Taskers are looking for some ridiculous hourly rates and demanding minimum 2 hours"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Raghav Tallam",
          "Nb_Reviews": 5,
          "Date": "2023-09-27T00:16:07.000Z",
          "Titre": "Very Convenient But Expensive after Charges",
          "Contenu": "Very Convenient and Easy to find a Handymen. But Charged $30 as \"Trust & Support Fee\" is too much. this made me think about using TaskRabbit again. For sure I am going to find another Alternative that charges reasonable fees."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T01:01:40.000Z",
          "Titre": "TaskRabbit could benefit from some improvements",
          "Contenu": "1) The trust and service fee is very  high.  I was also surprised that it changed after I made the initial booking.2) The website isn't intuitive.  It wasn't clear to me whether I could cancel a task once I had booked it.  The information about cancelations needs to be better communicated."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rolando P Nieves",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T21:14:18.000Z",
          "Titre": "Beware the reimbursement fees",
          "Contenu": "I like Task rabbit however, I was charged for a reimbursement fee of $100.- which, I do not understand. I even helped with moving a few things including a mattress down 3 flights of stairs and all these add-on charges doubled the agreed upon price. Reeks of scamming the clients.Thank you"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kitty Kat",
          "Nb_Reviews": 3,
          "Date": "2023-11-20T22:10:35.000Z",
          "Titre": "Unnecessary fees",
          "Contenu": "I really dont like the trust and support fee being so high. It will definitely deter me from using this app"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T18:55:14.000Z",
          "Titre": "Taskers can fail to show & you’re just out of luck",
          "Contenu": "I hired two Taskers. One was great. The other didn’t show up. The project (moving large and heavy furniture) required a second person. I ended up paying the first guy while I waited for someone to show up as a last minute hire. TaskRabbit didn’t do anything to make up for the guy that didn’t show. Not even an apology email. When I contacted them, they told me I wouldn’t get charged for the person that didn’t show up. Of course I wouldn’t. That would be crazy. They shouldn’t have done something (discount, credits). This was my first time using TaskRabbit.The “Trust & Support Fee” is also excessive. Almost 40% on top of what you pay the Taskers. I understand they have to make money but almost 40% feels excessive."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T17:07:03.000Z",
          "Titre": "Time and $ estimates Completely underestimated",
          "Contenu": "The communication and ease of scheduling prior to the visit was excellent. The tasker reached out immediately and asked what the job was. And I communicated the IKEA furniture they would be assembling. They arrived on time. They were friendly, and worked independently asking questions only when necessary such as specific placement in the room, and about some pieces we received that we damaged in some way. The specific concern was the estimated time (4 hours) and related cost ($450 or so) was severely underestimated. The tasker spent 8 hours on the job, and we were charged over $1000. That was a huge surprise to us. It is for that reason only that we will never hire Taskrabbit again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "People good tech not so much",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T22:46:18.000Z",
          "Titre": "People good, tech not so much",
          "Contenu": "The tasker providing service gets a 4.5. Down from 5.0 only because he had to re-schedule which required me to change some of my schedule.The web site works reasonably well, but could be better. It looks like a mobile app migrated to a bigger screen. The company really pushes the use of their smart phone app. In my experience, the Android app just doesn't work. I tried troubleshooting, but no luck. Also, it's not my job. Very frustrating."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David M",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T21:14:11.000Z",
          "Titre": "Platform flaw in ratings",
          "Contenu": "I booked a painter and he was a no-show twice. I did rebook with another painter (who was great), but I was never able to rate the first painter. So essentially, he gets away with being a no-show with no consequence to his profile. No other users will ever know that he is not dependable. He has probably done this before to others, but I would never know because of this platform flaw."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Walter Jawor",
          "Nb_Reviews": 1,
          "Date": "2023-09-17T21:18:44.000Z",
          "Titre": "Hidden charge",
          "Contenu": "Hidden charge. Christian your tech was excellent and knowledgeable. But disappointed when I got my recipe and found a charge for $38.01 (Trust & Support Fee) which was never mention when I book your service. It should have been stated at that time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T01:51:17.000Z",
          "Titre": "Taskrabbit charges way too much in…",
          "Contenu": "Taskrabbit charges way too much in support fees—I can understand a fixed charge/finder’s fee, but per hour? Seriously? Once set up, cleaner is doing the actual work, not Taskrabbit."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T18:36:25.000Z",
          "Titre": "Not up front about charges & fees.",
          "Contenu": "The person which did my task was very kind, stayed on task ,& did a great job, however I feel like Task Rabbit prices were very misleading. You charged me more per hour on the website than my Tasker charges per hour.  On top of it, I did not know there would be a \"trust & support\" fee until the job was finished. The over charge & hidden fee made me feel like I was lied to. You should be up front & honest about your fees & charges. If you were honest, I would've given more stars. The only reason I gave 3 stars is because the Johnathon was a good worker."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T13:41:17.000Z",
          "Titre": "Mixed experience",
          "Contenu": "This was my first time using Task. I needed help moving between cities and scheduled one Tasker at my origin city and a different Tasker at my destination city. It was unclear to me when a booking is confirmed. Then, the Tasker at my origin canceled at the last minute and I was left without any help. However, the Tasker at my destination was on time and very efficient."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T22:03:47.000Z",
          "Titre": "The first two taskers scheduled for my…",
          "Contenu": "The first two taskers scheduled for my project canceled last minute. One kept me waiting three and a half hours, kept saying he was coming then suddenly canceled. Major waste of my time. Third time we scheduled a tasker he was on time and did a good job."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "LC",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T02:38:26.000Z",
          "Titre": "We really liked our tasker",
          "Contenu": "We really liked our tasker, Edi. He had a great personality and did a great job. If this review was solely based on Edi, it would be five stars. However, the fees added on above what Edi  charged made our bill much higher than we expected. For that reason we may not use the service again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brian R. Patt",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T20:15:37.000Z",
          "Titre": "The trust fee is a bit excessive",
          "Contenu": "The trust fee is a bit excessive. Perhaps a one-time fee per task, instead of added per hour."
        },
        {
          "Note": 3,
          "Lieu": "SG",
          "Pseudo": "Jen",
          "Nb_Reviews": 2,
          "Date": "2023-09-02T22:25:01.000Z",
          "Titre": "Surprised that Tasker can cancel last minute without penalty",
          "Contenu": "I was surprised that the tasker cancel less than an hour before job time. He could not find the location on GPS and text me but I was in school and not allowed to respond to msg. In the system is my address but no apartment name. Also if I do a cancellation within 24 hrs I am charged for 1 hr, but a tasker can cancel without penalty. This is not a good system!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Roger Gursahani",
          "Nb_Reviews": 2,
          "Date": "2023-10-05T17:15:34.000Z",
          "Titre": "taskers overcharge on hours spent…",
          "Contenu": "taskers overcharge on hours spent working and also add additional charges. don't know if tasters are a honest bunch to be honest. also Tasker lied on what was completed after the job."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Melissa",
          "Nb_Reviews": 2,
          "Date": "2023-09-27T15:41:51.000Z",
          "Titre": "I liked the app and the concept",
          "Contenu": "I liked the app and the concept.  I didn't have the best experience with the person I hired.  He tried to double the price upon arrival even though I described the job exactly.  I also provided pictures prior to him coming to my home.  He agreed to do the work on the original price but it left me feeling uneasy about the job."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T19:47:01.000Z",
          "Titre": "The prices are way too expensive to…",
          "Contenu": "The prices are way too expensive to assemble Ikea furniture and not all taskers are well versed with Ikea furniture. It’s a shame that Ikea doesn’t offer a service to assemble their own furniture."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T23:39:59.000Z",
          "Titre": "Taskrabbit fees are horrible",
          "Contenu": "Taskrabbit fees are horrible! The process to select and book someone for the task is great and extremely helpful. The person I booked with was professional, efficient, and did a fantastic job! Paying the fees per hour is ridiculous and I will probably not use this service again because of it.  I give the three stars because of the ease of use and my task was completed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donna",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T01:55:16.000Z",
          "Titre": "David was exceptional; corporate fee hidden",
          "Contenu": "David, our task rabbit person, was superb. His work and demeanor were spot on! I would hire him again without hesitation. He was also very clear re: his fees and I paid them gladly along with a tip for going above and beyond. Your ( the task rabbit company) additional fee of approximately $41 was not clearly stated, on the other hand. I was surprised by it, and not in a good way."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mary W.",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T00:31:02.000Z",
          "Titre": "The tasker was very familiar with IKEA…",
          "Contenu": "The tasker was very familiar with IKEA products and was very quick to assemble the unit in under 30 mins. For him, I would give 5 stars.The reason I am giving 4 stars has to do with TaskRabbit, the organization.  I like that the Tasker can set his/her own hourly rates because they should be fairly compensated.  I can understand the additional fee imposed by the organization.  What I find objectionable is that you are asked to give a tip for a job well done when I feel that the hourly rate is more than sufficient.  By not adding a tip implies that the job was not well done which is not the case."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patricia Wallace",
          "Nb_Reviews": 6,
          "Date": "2023-12-18T21:15:27.000Z",
          "Titre": "New Taskers Need Facts Not Irrelevant Matters",
          "Contenu": "Among a small sampling of contractors I curated I used a yardstick of experience, amount and types of skills, and personal presentation to pick my tasker.  My advice for improving taskers' profiles is to stick to the facts:  what you can do for the customer, forget about:  you need to schedule the appointment so I won't be traveling on my motorcycle; that can be taken care of after you've been hired.  In my mind you just placed an impediment to my hiring you.  There are taskers on the site who say virtually nothing about what they can do.  If you're new you can still point to what you're good at and talk about things like commitment and focus; that's something every customer wants to hear.  If you haven't already, you could mention these points as the difference between being hired or not.  I have an upbeat attitude, things of a positive nature, all important if you're new."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RALPH",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T03:45:35.000Z",
          "Titre": "Prompt response to request.",
          "Contenu": "Prompt response to request. Helper good at making the most of the allotted time. Would use helper in future."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T01:21:03.000Z",
          "Titre": "Deny and his wife has is so professional even tho they aren't fluent with their English but they understood well,they were so humble and on time,he follow thru with me right until they got to my house",
          "Contenu": "This is such a good idea to think this thru and implement such useful techniques Thanks to you guys,no favors ask just have your money"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T23:25:54.000Z",
          "Titre": "She did a great job",
          "Contenu": "She did a great job! Had to take a star off because it was complicated at the start trying to set everything up with her, but I'd use her again for sure!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Y. Moore",
          "Nb_Reviews": 3,
          "Date": "2023-12-15T01:32:25.000Z",
          "Titre": "Great Experience",
          "Contenu": "Saed was excellent.  Showed up early, and worked VERY quickly.  Very easy to book my appointment online.  My only complaint is the fees.  That was 25% of the actual charge!   But pretty satisfied overall."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "wcharlesgo",
          "Nb_Reviews": 4,
          "Date": "2023-12-14T01:39:56.000Z",
          "Titre": "Watch out for the added fee.",
          "Contenu": "The Installation Pro was great. I've hired him before and am more than satisfied with his work.  What got my goat was the additional $45.00, whatever fee.  I am on a limited income and that means I do without."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "NanJ",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:16:26.000Z",
          "Titre": "My Experience",
          "Contenu": "On time and very professional. I will schedule again in the future."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CHERYL LEE",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T21:40:28.000Z",
          "Titre": "Well worth it!",
          "Contenu": "The Knowledge and efficiency of the technician was remarkable.  Although the service took longer than anticipated and therefore increased the expense, the service was well worth it!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Linda Lyon customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T01:19:28.000Z",
          "Titre": "excellent work, but a bit slow ..",
          "Contenu": "easy to set up and use Task Rabbit.  Worker was friendly, competent and cleanup everything.  Only downside was that he was slower than I expected, so labor was a bit higher than expected."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T07:07:25.000Z",
          "Titre": "Tasker was great, billing not so much.",
          "Contenu": "My tasker was very helpful. However the $15/hr fee charged by TaskRabbit on top of the tasker's fee was unexpected. I figured there would be an admin fee or something on top of the cost, but $15/hr?! That seems excessive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Betsy",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T21:11:00.000Z",
          "Titre": "Wonderful Move But Poor Communication",
          "Contenu": "My tasker was great but I don’t like that you can’t talk to them and confirm extra fees without booking the task. I needed help with a move and my taker advertised a truck but I could not contact him to discuss what kind of truck he had or the fees charged to use it without booking and putting a hold on my card"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Peggy Moran",
          "Nb_Reviews": 7,
          "Date": "2023-12-09T16:14:38.000Z",
          "Titre": "Taskers great; Task Rabbit fee high",
          "Contenu": "All your taskers are wonderful.  But your $15.20/hour fee on top of their rate is too high.  And why would your fee be per hour?  There is no extra work for you if the task takes one hour or several hours. Just one fee instead of an hourly fee would be good.  Plus you really should mention the fee before we choose a tasker.  Wish you had some cheaper taskers, too, for extremely simple tasks.  However, all works smoothly and, as I said, your taskers are terrific."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lady Bag",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T20:20:15.000Z",
          "Titre": "The tasker was prompt and professional…",
          "Contenu": "The tasker was prompt and professional and got the job done"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "S Vaz",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T23:31:25.000Z",
          "Titre": "Great Tasker…but almost didn’t happen",
          "Contenu": "We loved the tasker and the work they did. So 5 stars to the tasker. However we got close to not having the job done because of lack of insurance. We begged and pleaded the building super and were allowed. It would be nice if TR got some sort of collective insurance for the taskers."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anne Mackin",
          "Nb_Reviews": 4,
          "Date": "2023-12-12T23:24:11.000Z",
          "Titre": "Bad website, Great Workers",
          "Contenu": "The limitations of the website and customer support are pretty awful. But I found two people who did  excellent work for the furniture-moving job I had."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T19:52:57.000Z",
          "Titre": "Lovely people and they got the work…",
          "Contenu": "Lovely people and they got the work done and made it fun. But billing wasn't transparent and some taskers changed rates after booking. That needs to be improved."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tracey",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T21:39:06.000Z",
          "Titre": "I had a great experience considering it…",
          "Contenu": "I had a great experience considering it was my first time using the service.  My person who came was punctual, friendly and knowledgeable. The only thing I didn’t like was the surprise charge of $10.95! I believe it was a Trust & Support fee that I wasn’t aware of! Apparently this fee is part of the Happiness Pledge and goes to protect customers and training.  I will use Task Rabbit again regardless"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jade",
          "Nb_Reviews": 4,
          "Date": "2023-12-07T20:42:36.000Z",
          "Titre": "Tasker great… service expensive.",
          "Contenu": "The tasker was great but I think it’s a bit expensive. The taskers can just move slow on a job to rack up hours. Also, I believe the trust and reliability fee was too expensive. But hey, that’s New York. Again, the tasker did a great job."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tee",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T01:58:11.000Z",
          "Titre": "Love task rabbit",
          "Contenu": "My tasker was GREAT I have booked with him more than once and refereed him to friends . I didn’t like the new trust and safe fee thats like 22$ on top the fact his prices went up"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T21:33:50.000Z",
          "Titre": "Okay",
          "Contenu": "While I like that the company provides plenty of services and decent work, the charges are extremely high and not affordable for students at all."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T23:40:03.000Z",
          "Titre": "RJ was great",
          "Contenu": "RJ was great.  Very friendly and helpful. Did not get my full allotted time as RJ was concerned about next task job in another town. RJ came back (with another person requested) and helped  move bigger items but had to pay Cash App for extra time and person, instead  of handling everything through the app. I would recommend getting all information from client about what all may be needed for job (dolly or extra person) before service time."
        },
        {
          "Note": 4,
          "Lieu": "SE",
          "Pseudo": "Cecilia",
          "Nb_Reviews": 2,
          "Date": "2023-11-26T22:19:18.000Z",
          "Titre": "TaskRabbit was able to provide the…",
          "Contenu": "TaskRabbit was able to provide the service I needed at the end. At one point, I had several cancelations from TaskRabbit until Souhail H. responded to my task request at the very last minute. He was able to assemble my IKEA bed frame with storage and a standing desk. Overall, Souhail did a great job where he was very fast with his time and friendly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amélie",
          "Nb_Reviews": 7,
          "Date": "2023-11-19T08:44:35.000Z",
          "Titre": "A first-rate service call",
          "Contenu": "Great plumber! Wonderful person, work attitude, quick access to assistance.My only criticism is that the TaskRabbit app on my phone would not let me enter a tip or a review--it just defaulted to a thank you for receiving my input.  I didn't get to tip him or praise him."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T00:17:58.000Z",
          "Titre": "Great first experience",
          "Contenu": "Very easy to schedule and communicate with the person doing my task. They were an hour late but did keep me aware of where they were. The task was done even better than I had anticipated"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T21:35:44.000Z",
          "Titre": "Overall it was great",
          "Contenu": "Overall it was great. The only thing I would say could be better is the messaging system. Getting a text and then having to follow a link isn’t very efficient. But not terrible"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nikki",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T01:56:14.000Z",
          "Titre": "Easy to use just one suggestion",
          "Contenu": "The people on task rabbit seemed very creditable. The app was easy to use and the reviews look real. I didn't like I couldn't chat about the project and price with the Tasker before booking with them. When I canceled with a Tasker it was cause we didn't agree on the final price and that wasn't an option to choose during the cancelation process. Even so I will use this app again and again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T23:20:59.000Z",
          "Titre": "Some complication to estimate and…",
          "Contenu": "Some complication to estimate and actual pricing for assembling task. it need specific"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JENH",
          "Nb_Reviews": 2,
          "Date": "2023-11-09T23:17:53.000Z",
          "Titre": "The last Tasker I had was very friendly…",
          "Contenu": "The last Tasker I had was very friendly and helpful - but unfortunately when he got here he couldn't complete the work because I needed some additional parts that I'll have to get from the hardware store.  It would be helpful to be able to set up a consultation so the tasker knows what's involved and whether the job can be completed.  In this instance I paid for 2 hours of time and still don't have the work done."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Debbie Latham",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T17:26:40.000Z",
          "Titre": "Excellent service by our taskers",
          "Contenu": "Excellent service by our taskers. Reason for the 4 star review instead of 5?is the trust and support charge. It’s not clear how that is levied when looking at the rates. It should mention it’s hourly, not a fee."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 3,
          "Date": "2023-11-25T17:46:38.000Z",
          "Titre": "I have used Task Rabbit twice now and…",
          "Contenu": "I have used Task Rabbit twice now and have experienced very positive results with the person selected. The only negative I have with Task Rabbit is that the Task Rabbit fee is excessive and will cause me to think about not using Task Rabbit in the furure."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Phenomenal assembler",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T15:24:19.000Z",
          "Titre": "Phenomenal Assembler Michelle",
          "Contenu": "My experience with the assembler Michelle was phenomenal. What the site needs is to show the additional fees up front. It’s like they are trying to hide them.Overall I was happy"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "BJW",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T20:04:00.000Z",
          "Titre": "Prompt response",
          "Contenu": "Prompt response. Nice results"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JC for B",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T13:46:53.000Z",
          "Titre": "It did not start off as a great…",
          "Contenu": "It did not start off as a great experience. I had scheduled and confirmed with a tasker. Thought I was all set to move forward with my project only to have him cancel after confirming. I was lucky to have found Otis whom came in right away and put everything together without issue. I will be using him again and he gets 5 stars for his service communication and completion of job in a good amount of time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T20:56:37.000Z",
          "Titre": "Good App Exorbitant Fees to Use",
          "Contenu": "The app is easy to use and the people I have hired have always been professional, on time, and very helpful. The one downside is the fee that Taskrabbit charges per hour - it seems exorbitant. For instance, I needed help moving something, and the tasker had a two hour minimum, so even though it only took an hour, I paid for two, which is fine, but then I had to pay taskrabbit an extra $25 per hour - why? What are they doing that wouldn't be covered by a flat rate per task?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T23:17:08.000Z",
          "Titre": "On time",
          "Contenu": "On time, professional and friendly.No solution for packaging material. Now, one week later, I am still cutting cardboard to meter into our household recycling bin."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ed C.",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T23:54:16.000Z",
          "Titre": "Hourly admin fee excessive",
          "Contenu": "Our Tasker was wonderful. Gave him 5 stars. The Task Rabbit app could be easier to navigate chats.  I was also charged over $20 per hour for administrative fee. Far too expensive and unjustified.  I will be avoiding Task Rabbit for that reason"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Judith Greenwell",
          "Nb_Reviews": 2,
          "Date": "2023-11-11T18:49:31.000Z",
          "Titre": "First time user",
          "Contenu": "I was remolding my bathroom. After removing the tile floor revealed problems with the subfloor, I turned to Taskrabbit for a solution. I had a very limited time before the next trade was scheduled to come in, but the floor had to be fixed first. Taskrabbit did not disappoint. Found the tasker I was looking for. He was available. He did just what I asked and did it well. I also like that I get to see all the  choices cand only contact who I choose. Will use again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dorothy",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T19:54:19.000Z",
          "Titre": "TaskRabbit is a Good Emergency Service",
          "Contenu": "It's a good service for finding quick short-term job repair assistance.  Communication by email and text much appreciated for the hearing disabled.  The tasker was reliable and did a good job.  However, I did not care for the Trust and Service Fee applied to the bill.  It was almost a third of the billing.  I skimmed the service agreement and there's a long list of stuff TaskRabbit accepts absolutely no responsibility for."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T21:28:15.000Z",
          "Titre": "I wish I could give 4.5",
          "Contenu": "I wish I could give 4.5. I reserve 5 for zero things pointed out. The job done was amazing. We did notice the inside top rim of our toilet was still dirty, but everything else was spotless. We were also in the mist of doing our own de-cluttering and cleaning and we appreciate the non-intrusivness and \"let's get straight down to business\" approach. Very appreciate of the effort and in many ways, went above and beyond."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marie-Rose",
          "Nb_Reviews": 2,
          "Date": "2023-09-17T19:22:06.000Z",
          "Titre": "The service from the tasker was…",
          "Contenu": "Great service, however...The service from the tasker was stellar. The use of technology to shield users experience was also great.  the additional fee charged to users was not really understandable.  It felt like one of these obscure added fees.  It was very high and it is difficult for the user to plan for the extra cost added at payment.  There should be a sample before hand explaining what the final cost will be."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T21:11:41.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experienceOnly thing is added code of Task rabbit which is not accounted for and is a lot."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Person",
          "Nb_Reviews": 3,
          "Date": "2023-08-31T20:51:06.000Z",
          "Titre": "Taskrabbit is great in principle",
          "Contenu": "Taskrabbit is great in principle. However, sometimes it’s a little hit or miss with the Tasker. I’m not sure how some Taskers become elite who aren’t so great. But overall, my experience was positive. It’s an affordable option usually, although when they’re doing electric or things like that, sometimes I worry what their background is, and what kind of licensure they do or don’t have."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T20:57:02.000Z",
          "Titre": "Skilled workers.",
          "Contenu": "Levi brought a helper and they worked well together. We have a switchback stair and a large cabinet had to moved downstairs on hardwood floors. We added couple things while they were here and they took it in stride as well. Would recommend based on my experience with them!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "no name",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T02:42:08.000Z",
          "Titre": "Handy app",
          "Contenu": "The experience was great because the tasker was great.  That said, I like the app because it showed me reviews and allowed me choices based on other customer experiences.  I would have preferred knowing the extra fee on top of the tasker’s hourly fee/minimum before choosing.  This did not make a difference but I always prefer transparency up front.  Good app will use again. Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T16:37:30.000Z",
          "Titre": "Was a good experience",
          "Contenu": "Was a good experience. The person I found wasn't able to do 100% of the jobs I needed done.  however it was for very cheap."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mary R",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T22:15:55.000Z",
          "Titre": "The hidden costs",
          "Contenu": "The web site was easy to use and the person I hired was extraordinarily good and responsive.,What surprised me was the fairly sizable trust fee that was tacked on to the person’s hourly rate by Task Rabbit. I think more transparency on the all in cost per hour is called for. I did not contest it as I’m sure it’s in the fine print somewhere but wash not readily evident to me at the time of booking.,"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-09-04T23:25:52.000Z",
          "Titre": "GREAT referrals but watch out for the fees.",
          "Contenu": "I'm finding GREAT referrals on TaskRabbit.  I'll keep coming back BUT.... you never see the TaskRabbit fees until WAY at the end.  Wow... sometimes those are a surprise.  However... the quality of the service I've been receiving is outweighing the fees."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Caroline Buster-Brown",
          "Nb_Reviews": 2,
          "Date": "2023-09-14T22:11:30.000Z",
          "Titre": "The 1st use was great, fees are high",
          "Contenu": "The task rabbit I used was really outstanding. I have only used task rabbit once. However, the fees for task rabbit service are unusually high, being hourly instead of a flat fee. It makes me choose less hours of work. Still, it was a great experience. I have no other task rabbit jobs so far, I can only compare it to services like Thumbtack for looking up workers. In that respect I'm going down one star just for the fees."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shirley Scott",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T22:35:52.000Z",
          "Titre": "James was prepared for hooking up my…",
          "Contenu": "James was prepared for hooking up my Apple TV to the television. He went through many different receiver channels to find the right one. This took time to do. The second hook up was a lot easier. I would recommend James to any customer looking for satisfaction."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T16:00:56.000Z",
          "Titre": "Price was more than expected",
          "Contenu": "Price was more than expected, but that may be more of a function of Ikea underestimating the time it takes to put together certain units (i.e., wardrobes). We feel that the worker was professional and skilled, and we are very satisfied with his efforts."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Barbara",
          "Nb_Reviews": 3,
          "Date": "2023-09-24T16:58:08.000Z",
          "Titre": "Service fees are exorbitant",
          "Contenu": "I liked that I could see the different levels of experience and costs. You are also upfront about the additional fees, but I think they're exorbitant! Why charge them per hour instead of having a flat service fee!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Denise Belyavsky",
          "Nb_Reviews": 3,
          "Date": "2023-09-12T18:48:39.000Z",
          "Titre": "John was fantastic and did a great job",
          "Contenu": "John was fantastic and did a great job.  Scheduling was not perfect since I scheduled him for 4pm and got a message from him after that (maybe 4:30?) that he wasn't going to make it till 5:30 since a previous job took longer than anticipated.  It all worked out in the end and he was unfailingly careful, polite and patient.  The job took about 1.5 hours more than I thought it would, so it was more expensive than I budgeted. I probably miscalculated the time involved and I'm glad he was careful and completed the picture hanging with care and preciseness, rather than rushing through.  I would gladly call on John again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ZL",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T00:09:28.000Z",
          "Titre": "Found a highly experienced tasker but beware of high task rabbit fees!",
          "Contenu": "My experience with my first tasker was great! He got the job completed in great time! Very efficient! I’m sure I can find other great taskers but task rabbit charges an arm and a leg in fees to profit.  Not worth it for me to use this site often. Only once in a while."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Unhappy customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T03:24:55.000Z",
          "Titre": "To check workers",
          "Contenu": "The product (a bookcase from IKEA) that I invited TaskRabbit to work on, happend to be defective: on one of the shelves there are several very noticeable red spots. The assembler definitely should have noticed this, but for some reason did not bring my attention to this problem. This shelf was assembled almost at the very beginning (on step2). Now I'm filing a complaint with IKEA. Looks like they are ready to replace this shelf, but everything that has already been assembled and this work was paid to TaskRabbit, now must be disassembled back to the initial phase"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cathy Johnson",
          "Nb_Reviews": 2,
          "Date": "2023-09-27T12:46:37.000Z",
          "Titre": "Nice process structure, what is trust and support fee?",
          "Contenu": "I was pleased with procedures to contact our Tasker and the chat communication. I did assume the additional 15% trust and support fee was a tip for the Tasker, and was puzzled by the option to include a tip after payment. I want to support my Tasker- he did a great job. But would like clarification as to the purpose of and who gets the 15%"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T21:23:39.000Z",
          "Titre": "I liked the service",
          "Contenu": "I liked the service .  The man was very communicative with me .  The app reminded me when they were coming .  I trusted the Taskrabbit guy . My only thing was the quote was way off."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "BridgetE",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T14:36:38.000Z",
          "Titre": "Great until the fees",
          "Contenu": "The process was easy to find the suitable tasker. Andre was prompt and energetic. I had to give this four stars because the final bill to tack on $119 for some ridiculous protection and customer service fee is absolutely nuts. I would have to reconsider using the site for that reason alone."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T23:03:36.000Z",
          "Titre": "Tasker didn't brace the furniture to…",
          "Contenu": "Tasker didn't brace the furniture to the wall.  After chatting, he agreed to come back but never did and then chat was closed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T19:31:36.000Z",
          "Titre": "I would give my tasker 100 stars",
          "Contenu": "I would give my tasker 100 stars, but an error on my part entering my address sent my tasker to the wrong apartment. You should please make sure that there are fields for street and city for the location of the task. I entered my street address but not my NYC borough, and my tasker went to Manhattan rather than Brooklyn."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nancy Pesce",
          "Nb_Reviews": 3,
          "Date": "2023-10-03T12:16:45.000Z",
          "Titre": "I love your services however",
          "Contenu": "I love your services however, I was recently charged $34 in addition to $90 to have someone come and remove two specialized screws out of a wall. He was there for less than five minutes! You should probably make the fee YOU charge more prominent."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T17:17:26.000Z",
          "Titre": "I was really excited about this concept…",
          "Contenu": "I was really excited about this concept and booked someone for a job. He confirmed and 25 minutes out from his scheduled time texted me his ETA, which was terrific. Then 15 minutes later I receive a message from task rabbit that he could not do the job. ???When I tried to rebook, the task managers that were suggested to me were all more expensive and had a 2 hour minimum. I wan’t able to book someone until the next day. I took time of work to be home, only to be told, last minute that he would not be here.The following day my task manager was excellent! Timely, polite, respectful, and communicative. If it weren’t for the first day cancellation, I’d give 5 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Susan Foster",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T22:43:19.000Z",
          "Titre": "I do not want to pay the additional fee…",
          "Contenu": "I do not want to pay the additional fee of $30+ for ‘good feelings’.  I called your number immediately after seeing it  added to the bill and was on hold for over 4 minutes so I disconnected the call. Please contact me.  I was not told by IKEA that there is an added fee for the service. Just the assembly $ estimate. Josh did a good job, arrived on time, worked efficiently and neatly. Satisfied with Josh, but please reimburse the added fee to my credit card. Kind regards, Susan FosterIKEA Elvarli shelf installation"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ANDREW THOMPSON",
          "Nb_Reviews": 2,
          "Date": "2023-10-02T17:05:57.000Z",
          "Titre": "Unclear on charges",
          "Contenu": "I was unaware of whatever fee the website is charging for connecting this with the assembler. Maybe I didn't read carefully enough, but they could have been more clear. The person sent to us was wonderful and I have no complaints about him."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T18:56:15.000Z",
          "Titre": "Time changed, previous customer added last-minute projects",
          "Contenu": "The whole experience was great. Jessy was amazing and kept me up to date when his arrival time changed. I would have given five stars, but the customer before me added two projects to their list which impacted my schedule by 90 minutes. Wasn’t a deal breaker this time, as my schedule was flexible. That may not always be the case -"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carol",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T12:39:33.000Z",
          "Titre": "Cyrus was great BUT TR app misleading",
          "Contenu": "Cyrus was great!  The problem is that I selected him based on reviews but also because I had a small job that would only take 30 minutes.  His profile did not state 2 hour minimum but I was charged for 2 hours instead of 1 hour when the job only lasted 30 minutes"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carole Williams",
          "Nb_Reviews": 2,
          "Date": "2023-09-01T17:01:16.000Z",
          "Titre": "The work was done efficiently but…",
          "Contenu": "The work was done efficiently and the bookcases looked good when completed. The task rabbit said he couldn’t attach the bookcases to the wall because the studs needed to be exactly in the middle of each bookcase. This did not seem right to us but the bookcases are not attached. Let’s hope they don’t fall over. One bookcase required a cutout to accommodate a light plug. The task rabbit cut the whole in the wrong place, so we have a hole in the right place and a patched hole in the wrong place. Otherwise we appreciated the service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T22:17:07.000Z",
          "Titre": "Watch out for tacked on chargers, which could be significant and could change your mind about whether you want to hire this person.",
          "Contenu": "Tasker was great, but I think it’s somewhat slippery to advertise the already inflated rate of $50 an hour or so and then tack on an additional $20 an hour that makes $70 an hour which is a damn sight different than $50 an hour. That’s way too much for a simple cleaning job."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Penny Tallis",
          "Nb_Reviews": 3,
          "Date": "2023-09-22T23:03:02.000Z",
          "Titre": "I needed to upgrade the app and it would freeze",
          "Contenu": "I needed to upgrade the app and while it would allow me to select upgrade and login it would freeze.  I finally removed the old app installed the new one and changed my password and seems to work as expected. Joe, the task person was great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T19:58:45.000Z",
          "Titre": "The tasker was great and willing to…",
          "Contenu": "The tasker was great and willing to take on another project last minute which was a huge help. I just cant figure out how to open the bottom drawers of the bed so a quick run through to check the finished product would have been helpful. Thanks!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lauren",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T22:22:33.000Z",
          "Titre": "Mostly a good service with some exceptions",
          "Contenu": "Mostly a good service, but you never know what you’re going to get. I’ve had taskers not show up at an appointed time and then reschedule to never show up. Sometimes you get great help and sometimes it’s a total waste of time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David M",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T21:48:49.000Z",
          "Titre": "The Task Rabbit was great",
          "Contenu": "The Task Rabbit was great, but the service is a little pricey. Besides paying him, there is a service charge, too."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T09:18:07.000Z",
          "Titre": "The Tasker I utilized was fantastic",
          "Contenu": "The Tasker I utilized was fantastic, however, the platform needed navigation for the most simple things.  I don't even know where to write a review for my Tasker .  Help center is useless."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mimi J.",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T02:02:09.000Z",
          "Titre": "Your website",
          "Contenu": "Our tasker, Imed, was great but I found it very difficult to book an appointment on your website.  I had to start afresh several times before successfully booking an appt."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Susan",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T06:43:57.000Z",
          "Titre": "Honest",
          "Contenu": "Honest, pleasant, hard worker. When she made a mistake, she immediately owned the problem and fixed it, and then rechecked the other similar conditions in the hooks for the other hanging pictures, replacing a few with heavier hooks. I will definitely call Monica again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-09-25T01:42:45.000Z",
          "Titre": "Excellent service to find local help…",
          "Contenu": "Excellent service to find local help with small projects.  I give 4 stars as first tasker I hired flaked - the one who eventually did the job was perfect and installed my RING doorbell in 20 min!  A breeze"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Moira Rogow",
          "Nb_Reviews": 2,
          "Date": "2023-09-08T04:18:41.000Z",
          "Titre": "It worked well.",
          "Contenu": "I found someone willing to take on my overgrown garden and I was happy all the candidates were vetted. I thought it was much better to be able to look up a person and the comments about their work, instead of just grabbing an unknown off craigslist. Will be using this app again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-09-08T16:11:56.000Z",
          "Titre": "Taskrabbit helped me to find someone to…assemble IKEA purchase",
          "Contenu": "Taskrabbit helped me to find someone to assemble my IKEA purchase.  The communication through Taskrabbit was easy and secure.  I felt the hourly rate was a bit high and the final cost was certainly more than I anticipated."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T23:05:20.000Z",
          "Titre": "The contractor was great",
          "Contenu": "The contractor was great. However, I was unaware taskmaster fees would be so steep. I did not like that. I would like more transparency & to get an approximation of your extra fees before contracting."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T22:29:36.000Z",
          "Titre": "Only feedback would be to let the…",
          "Contenu": "Only feedback would be to let the customer explain or talk. He is good and fast but he wouldn't let us finish when we were trying to explain something. Overall, he's really quick!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T00:29:59.000Z",
          "Titre": "Curtain Rod and Blinds mounting",
          "Contenu": "The service provided by Jonathan was great, really liked his work and cleanliness.The additional charge of trust and support fee is vey high and not very happy with that charge."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JD",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T18:32:52.000Z",
          "Titre": "Tasker arrived late",
          "Contenu": "Tasker arrived late.  Was communicative until arrival.  Said little and was not confident about what he needed to do.  Got some things done."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T21:45:55.000Z",
          "Titre": "I'm unable to use the app because of a…",
          "Contenu": "I'm unable to use the app because of a glitch in the app tells me my email is taken. So it makes it tedious to communicate with the tasker because I have to be at my computer desktop. I wish you didn't have to communicate through the website/app.Otherwise, the service is good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Moraima Schwerert",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T01:14:36.000Z",
          "Titre": "I like it overall",
          "Contenu": "I like it overall. Both taskers have been very nice and did a good job.  But, the additional fees are a bit much."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Susan and Nancy",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T17:53:12.000Z",
          "Titre": "Fernando V was so nice",
          "Contenu": "Fernando V was so nice, quick and knew what he was doing! We will definitely have him back!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christine",
          "Nb_Reviews": 2,
          "Date": "2023-09-29T17:48:02.000Z",
          "Titre": "Extra fees",
          "Contenu": "I didn't understand why we had to pay an additional hourly fee for the training, (or whatever), of our tasker. If this is necessary, shouldn't it be between the tasker and the TaskRabbit?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patricia",
          "Nb_Reviews": 1,
          "Date": "2023-09-17T16:25:08.000Z",
          "Titre": "The ease of finding a great person to…assemble furniture",
          "Contenu": "The ease of finding a great person to assemble my furniture. That person was Julia who I highly recommend.The negative was that you charge way to much of a service fee and for that it may prevent me from seeking out your service again. It cost me $80.00 above and beyond the rate of the installer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wendy Bensussen",
          "Nb_Reviews": 2,
          "Date": "2023-09-19T20:25:09.000Z",
          "Titre": "Jared was great- your user interface is…",
          "Contenu": "Jared was great- your user interface is difficult to useJared provided a code for a discount if I booked him again and when I made the appointment the interface stated that the code was invalid - that is not acceptable"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Satisfied customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T18:29:35.000Z",
          "Titre": "Taskrabbit is a very easy platform to…",
          "Contenu": "Taskrabbit is a very easy platform to use. It's a great way to get tasks done very quickly.  One of the negatives, is the fees that are added on in addition to the hourly rates that are paid to the taskers. Other than that I would have given it 5 stars. I will use the tasker I used for other projects.  Some of the taskers don't seem to be very experienced."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T21:44:33.000Z",
          "Titre": "Review all fees!",
          "Contenu": "Our choice of contractor was perfect. Only constructive input is the lack of transparency with additional fees with hourly rates posted. I was unaware of any additional ‘ trust’ fees until I had completed my research and made choice of individual that met my needs."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T18:51:43.000Z",
          "Titre": "Good but surprise $20 fee",
          "Contenu": "I did not appreciate the surprise $20 fee that gets added on."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian C.",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T23:54:35.000Z",
          "Titre": "Excellent service",
          "Contenu": "The person I worked with was both professional and flexible when it came to what to install, and I would be glad to hire him again. The UX for the Taskrabbit site was a bit clunky and unintuitive, however."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Catherine",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T20:33:38.000Z",
          "Titre": "Easy to navigate as a first time user",
          "Contenu": "Easy to navigate as a first time user.  Found a 5-star painter nearby who did great work.  A bit surprised by the additional trust fee, bumping up the hourly rate by about 25%.  Still, good to know the takers are vetted."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T00:38:18.000Z",
          "Titre": "Good experience",
          "Contenu": "Terrible web site (one star) but outstanding worker who came and did the work (five stars)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T21:00:42.000Z",
          "Titre": "Not much to say",
          "Contenu": "Not much to say. He came on time, was efficient and did the job."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kacie B",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T01:16:39.000Z",
          "Titre": "Convenient way to get help!",
          "Contenu": "The first person who agreed to do my job was a no show and I never heard from him again. However, the second person I tried was awesome! I really should have started with someone who had many stellar ratings. Once it worked out, I thought the whole experience was worth it. Will use again!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "mrs. haymon",
          "Nb_Reviews": 4,
          "Date": "2023-11-23T03:53:40.000Z",
          "Titre": "The service Received was great",
          "Contenu": "The service Received was great. Task Rabbit sends me too many emails and messages."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T20:52:46.000Z",
          "Titre": "I don’t like the Trust and Support fee",
          "Contenu": "I don’t like the Trust and Support fee.  Everything else was fine, however, that additional cost should be incorporated another way."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-09-06T03:52:59.000Z",
          "Titre": "Nice not to have to worry about things.",
          "Contenu": "Hello, this is the first time I’ve ever used any type of handyman service. The app was somewhat easy. But it was a bit harder trying to find somebody who could do what I needed at a time that I needed. I work different types of hours, and trying to pick somebody who is highly rated to coincide with my time frame was more difficult than I anticipated. I did end up finding somebody who actually came out on the holiday. I was very surprised by that. He did a wonderful job that didn’t take him all day. Prices were pretty much what’s to be expected, but I was not prepared for the service fee. Especially the amount that was charged. The original amount I was OK with. But I did not realize that it was multiplying per hour. That part was not cool.I will definitely use Taskrabbit again. They took undo worry from me, which I completely appreciate!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Seattle Mom",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T21:09:55.000Z",
          "Titre": "First time user VERY happy",
          "Contenu": "Site was easy to use and I appreciated being able to see how experienced the taskers were, so I did not have to take a risk on a newbie.  The person I picked was available quickly and did a friendly, efficient, quality job for a fair price in less time than originally estimated.  Their cost was middle-of-the-pack.  I would definitely choose that person and TaskRabbit again if I had a need.  My only suggestion is that I would love it if you did technology assistance, which I did not see as an offered service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Goodrich",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T01:03:05.000Z",
          "Titre": "Rob was very professional and took the…",
          "Contenu": "Rob was very professional and took the extra time to ask my wife how she wanted the cabinet he assembled setup.  Shelf locations and things like that.Excellent service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T15:11:52.000Z",
          "Titre": "Taskrabbit to the rescue!",
          "Contenu": "We were able to hire Taskrabbit to remotely handle assisting my Mother during a move. The service was excellent and it was a great way to provide help while not being able to be there in person. Super friendly and very helpful. They helped for 5+ hours! Amazing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Guest",
          "Nb_Reviews": 4,
          "Date": "2023-12-20T22:19:55.000Z",
          "Titre": "Efficient and affable handrail installation",
          "Contenu": "For installation of two stairway handrails, Brandon understood the task and completed it quickly.  He was also pleasant to speak with, willing to explain the situation and provided advice on options, such as the number of brackets per rail."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sue",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T21:46:38.000Z",
          "Titre": "I could schedule it for the best time…",
          "Contenu": "I could schedule it for the best time that was convenient for me.  The young man Shaq was very polite and he did an excellent job putting our cabinet together.  I would recommend this company to everybody"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Diane",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T03:00:15.000Z",
          "Titre": "Love being able to identify excellent…",
          "Contenu": "Love being able to identify excellent helpers - we have always had good experiences with Taskrabbit!  In VA and in CO!  Thank you Taskrabbit!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JackyMF",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T02:40:06.000Z",
          "Titre": "Extremely satisfied!…",
          "Contenu": "Nathan did an excellent job at hanging my gallery wall located in a staircase. This project would have take me hours to complete and he did it quickly. He brought all the necessary tools. I will continue to seek his assistance on my upcoming projects!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T20:43:16.000Z",
          "Titre": "Victor was professional",
          "Contenu": "Victor was professional, efficient, clearly experienced and disciplined. He knew what he was doing and finished the job far more quickly than I thought anyone could (a 100 inch long wardrobe closet) and I know because I did two of these closets 15 years ago (and I had no interest, at age 75, to do it again.)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Foster",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T23:21:08.000Z",
          "Titre": "Well-prepared, well-executed job",
          "Contenu": "I needed to repair a table one of whose legs had partially collapsed making the table unusable. Milan emailed me as soon as I chose him for the job, asking for photographs of the problem. Due to this preparation, he showed up with the proper tools and hardware and within 45 minutes had restored table to a better condition than it had been. He also was able to improve the action of the drawers, which had become so difficult to pull that I had stopped using them. All-in-all, a very satisfying visit!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sheetal Patel",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T00:00:34.000Z",
          "Titre": "Excellent job done",
          "Contenu": "Kevin did an excellent job assembling ikea cabinet. I’m extremely satisfied with his great work skills patience explaining everything about this cabinet. I didn’t have the ikea closet design so I drew a picture of cabinet I want and he did it exactly I need."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jamie Delaney",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T05:45:01.000Z",
          "Titre": "Great experience; effucuent",
          "Contenu": "My tasker was prompt, efficient, trustworthy, and easy to have in our home. We liked that we could select from a number if taskers with descriptions and photos. It made meeting up with my tasker safely easier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jana K.",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T02:49:32.000Z",
          "Titre": "Hard worker and professional",
          "Contenu": "Tyler was timely and very professional. Made sure we were on the same page with each project. Easy to work with and would definitely work with him again. Highly recommend. Put together several pieces of furniture from IKEA that came with limited instruction. Mounted wall units without a problem. He also hung a sensory swing for my daughter and a few other projects in her playroom for us."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PenguinQueen",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T23:26:00.000Z",
          "Titre": "Movers",
          "Contenu": "We had a small moving job that we needed help with.  We found Joel immediately and he did such an amazing job for us.TaskRabbit made solving our problem easy and efficient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wanda",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T17:35:22.000Z",
          "Titre": "Easy to schedule date/time",
          "Contenu": "Easy to schedule date/time, on-time, professional, knowledgeable, quick, good workEstimate was two hours to put the bed together.  Michael M had it completed under one hour!  Was pleasantly surprised and happy that he didn’t charge the full two hour quote.  This shows integrity and professionalism and I would definitely recommend Michael M"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J. Porter",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T18:47:20.000Z",
          "Titre": "Plumber review",
          "Contenu": "I was very pleased with Mr. Wallace services. He was able to fix my plumbing issues, restored the hot water and resolved my toilet problem in my home. Quick and efficient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rommel C",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T21:48:02.000Z",
          "Titre": "He was great",
          "Contenu": "He was great. Very prompt, courteous and dependable. Took care of the things really well and made sure it was seamless handling , unloading and arranging the goods and the boxes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Clare",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T21:26:38.000Z",
          "Titre": "Highly recommend Chafa on Task Rabbit!",
          "Contenu": "I recently hired Chafa from Taskrabbit to build a daybed and a dresser from Wayfair, and I couldn't be happier with the results. Chafa exceeded my expectations by completing the task in under two hours! Their attention to detail and efficiency were truly impressive. The daybed and dresser were assembled flawlessly, and they even took the time to make sure everything was sturdy and secure. I highly recommend Chafa for any furniture assembly needs. Their expertise and speed make them a standout Taskrabbit hire. Five stars all the way!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michele Tucker Griffin",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T21:40:15.000Z",
          "Titre": "Ivan did an amazing job",
          "Contenu": "Ivan did an amazing job.  He was very professional and he knew his product well.  He did the work in the estimated time given. I will definitely use Taskrabbit again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SAH",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T00:51:57.000Z",
          "Titre": "Makes jobs easier!",
          "Contenu": "I have certain things that either require heavy lifting, electrical work or just putting heavy some furniture together. I have found people who have been good, fast and easy to work with. The other nice thing is when I travelled to help my Mom, I was able to get Task Rabbit help in another state. It is great to have support that easily."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jana",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T23:06:50.000Z",
          "Titre": "Amazing job!",
          "Contenu": "Look no further; Dejuante is the best! He arrived on time and assembled 2 large dressers and a daybed with drawers in a few hours (less time than estimated). He didn't even need the manual. I highly recommend him and will use him again in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Morgan M",
          "Nb_Reviews": 7,
          "Date": "2023-12-13T21:54:14.000Z",
          "Titre": "Wonderful experience",
          "Contenu": "Wonderful experience. He was reliable, on-time and showed up with a great attitude. Rafael did a wonderful job hanging up multiple picture frames and curtains in my apartment. He continuously asked for my approvals and has a great point of view. I will hire him again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melinda Benton",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T17:55:37.000Z",
          "Titre": "What made my experience great was I was…",
          "Contenu": "What made my experience great was I was able to pay a reasonable amount of money to take care of my needs in my home & the Contractor who completed my projects!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paula Rankin",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T20:56:46.000Z",
          "Titre": "Taskrabbit is a great new resource for us!",
          "Contenu": "Taskrabbit is a great new resource that I was previously unaware of.  We used a tasker for some long overdue yardwork and getting the garden ready for winter.  He was meticulous, worked efficiently, and we are delighted with the results."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ES",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T00:45:38.000Z",
          "Titre": "Great tasker and human being.",
          "Contenu": "My tasker was a great human being who took care of all the issues and moving I needed to have done. Taskrabbit customer service was also very helpful. Grateful for the experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Central Geotech",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T18:09:35.000Z",
          "Titre": "Great professional",
          "Contenu": "John was running a bit behind but more than made up for it with his professional demeanor and did a great job mounting 2 TV's for your office.  He even went in and set them up.  Appreciated the above and beyond effort"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T23:20:21.000Z",
          "Titre": "Great helper",
          "Contenu": "The tasker who helped me was a great person. He was fast and very knowledgeable about the task. He finished it without wasting time so I will use Taskrabbit again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T01:29:32.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service! He came earlier then scheduled and finished quickly. He came with all of his own tools and packages all of the pieces away once he was complete. Will use again ☺️ With that being said, just be mindful taskrabbit does have a hidden fee called a “trust fee” that was an additional $35 than the Taskers quoted price. I think this fee couldPossibly fluctuate depending on the task, this is not a fee associated with the tasker. I think this fee should be disclosed by taskrabbit prior to the service being scheduled. I will ask about all associated fees prior to booking the next task ☺️"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T17:21:35.000Z",
          "Titre": "Juan was exceptional *****",
          "Contenu": "Juan was exceptional. I would highly recommend him. He did everything in a gentle and timely manner. He was very helpful and methodical in his work. Juan is also a lovely person."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melanie",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T01:48:36.000Z",
          "Titre": "Weston K was great!",
          "Contenu": "Weston K was great—he was professional, friendly, worked quickly, and did the task perfectly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T09:16:48.000Z",
          "Titre": "Grateful for him!",
          "Contenu": "I wasn’t in town and he made this a seamless process even out of the country. Grateful for my taskrabbit!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T00:09:44.000Z",
          "Titre": "He showed up on time with…",
          "Contenu": "The gentleman showed up on time with his own tools. He was fast and efficient. I would definitely use him again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "D. Minor",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T00:45:08.000Z",
          "Titre": "Abdel was wonderful!",
          "Contenu": "Abdel was wonderful!! He took care of the repairs which was needed in our bathroom, asked us our thoughts, and cleaned up afterwards. It was done exceptionally well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carol Sime",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T22:01:11.000Z",
          "Titre": "Efficient",
          "Contenu": "EfficientCleaned up after himself and helped me with the empty boxesAlways focused on the task"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T02:46:29.000Z",
          "Titre": "Our task rabbit was very capable",
          "Contenu": "Our task rabbit was very capable, organized and available when we needed him."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T23:10:12.000Z",
          "Titre": "The tasker communicated with me",
          "Contenu": "The tasker communicated with me. Upon arrival, he was respectful and worked clean."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T01:05:45.000Z",
          "Titre": "Used TaskRabbit Countless Times!",
          "Contenu": "I am a single Grandpa and have used TaskRabbit countless times over a decade with amazing results: Moving assistance, uninstalling & installing TV's/plumbing/computers, putting furniture together and organizing the kitchen/pantry. It has almost always been a fantastic helpful experience as only one tasker out of around 15 was a bad apple. The rest were magnificent extremely talented skilled Taskers! Just a GREAT help when in need!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JACKIE D",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T21:14:04.000Z",
          "Titre": "Essra V arrived on time",
          "Contenu": "Essra V arrived on time, was polite, professional and efficient! This is my 2nd time using him for a job."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Diana Hollander",
          "Nb_Reviews": 4,
          "Date": "2023-12-15T18:21:43.000Z",
          "Titre": "On time",
          "Contenu": "On time, worked consistently to put all our bedroom furniture together as well as a table.Very good at what he does..recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "YVONNE",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T01:18:06.000Z",
          "Titre": "I have used Task Rabbit twice and have…",
          "Contenu": "I have used Task Rabbit twice and have been very satisfied. Both times the people have done excellent workand very pleasant. I have recommed the app."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T21:13:27.000Z",
          "Titre": "Fantastic Work!",
          "Contenu": "Ivan was very flexible with my schedule and did fantastic, and fast work. I will definitely hire him again for any furniture assembly needs!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T20:50:27.000Z",
          "Titre": "Our tasker was amazing",
          "Contenu": "Our tasker was amazing! Xavier B. went above just what was requested. He made sure to get our pick-up on time, delivered what we needed, and even took the time to help our team set-up."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terri White",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T23:21:23.000Z",
          "Titre": "Task Rabbit worked flawlessly! My job got done on time and efficiently!!",
          "Contenu": "Robert F showed up on time was pleasant and efficient and got the job done perfectly! I will use him again!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicolien Van Schouwen",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T03:02:54.000Z",
          "Titre": "The two men were courteous",
          "Contenu": "The two men were courteous, helpful and installed the couch in perfect time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T21:31:29.000Z",
          "Titre": "Great experience",
          "Contenu": "Anthony was a great help and made my moving experience easy; couldn’t have done it without him! 💪🏾"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marie M",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T19:02:18.000Z",
          "Titre": "Highly recommended!",
          "Contenu": "Martin came right on time with all his tools and was quick and efficient. Would definitely hire him again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ana Vasilic",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T11:36:20.000Z",
          "Titre": "I was struggling with ikea furniture I…",
          "Contenu": "I was struggling with ikea furniture I just bought and was so frustrated I couldn’t assemble a table and my bed-frame. After a tasker helped me oh man I felt so happy. It was quick and satisfying. Will definitely use their services again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MB",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T20:25:00.000Z",
          "Titre": "The worker arrived in time",
          "Contenu": "The worker arrived in time, was very polite, worked in a timely fashion and got the job done.  We were very pleased."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jamie Strohecker",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T22:47:59.000Z",
          "Titre": "Great service to have available for…",
          "Contenu": "Great service to have available for anyone needing an extra set or two of hands and expertise!  Most definitely will use Taskrabbit again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "FRANCINE",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T20:46:15.000Z",
          "Titre": "I got up in the morning saying these…",
          "Contenu": "I got up in the morning saying these things need to be cleaned. Went on my computer put in my information and I hired a lady come the same day. Had everything done in 2 hours. She was through. I was very pleased ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ginnycustomer",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T21:19:31.000Z",
          "Titre": "Helpful service…",
          "Contenu": "It was easy to use the service and the worker was fantastic in his work and keeping informed of everything."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T00:27:36.000Z",
          "Titre": "Very easy to use site with all…",
          "Contenu": "Very easy to use site with all important information easily available. It was super easy to choose the person I wanted to complete my task then establish ongoing communication with them. Definitely recommend using Taskrabbit for anything you can’t/don’t want to do yourself."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sabina",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T22:06:34.000Z",
          "Titre": "Great first experience",
          "Contenu": "Great first experience, tasker communicated clearly and in a timely manner. Completed the task quickly and cleaned up afterwards. I felt safe and comfortable having them in my home."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jean McIntosh",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T15:33:35.000Z",
          "Titre": "They came they did everything I asked…",
          "Contenu": "They came they did everything I asked of them and then they came back on Monday and replaced the furniture where it came from originally. They were on time, texted when they were on the way. Clean and pleasant to be around."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gail Bierman, customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T21:32:49.000Z",
          "Titre": "Assembler Elana was knowledgeable ans…",
          "Contenu": "Assembler Elana was knowledgeable ans efficient.  Worked cleanly and did a great job"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "A Jones",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T03:22:04.000Z",
          "Titre": "Professional Task Rabbit",
          "Contenu": "He was very professional, quick, and showed great interest in the set up. I will use his service again and again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T19:01:13.000Z",
          "Titre": "Kirill was fast and efficient",
          "Contenu": "Kirill was fast and efficient. I love the quality of work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T16:26:04.000Z",
          "Titre": "Knowledge tasker with a great attitude",
          "Contenu": "Knowledge tasker with a great attitude. He did a great job and did it quickly as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pam Nuzzo",
          "Nb_Reviews": 3,
          "Date": "2023-12-11T15:03:38.000Z",
          "Titre": "Great service and experience",
          "Contenu": "The appointment was very easy to schedule.  The assembler arrived on time and completed the task as estimated.Very efficient and neat.This is the 2nd time we have used this service and would do so again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T00:39:35.000Z",
          "Titre": "Alex was extremely helpful with the…",
          "Contenu": "Alex was extremely helpful with the task we needed. Will definitely need his services again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T00:12:24.000Z",
          "Titre": "Efficient and timely!",
          "Contenu": "Kyle showed up right on time, (after I had to reschedule also) and completed the job in under 2 hours, which was impressive. I would definitely hire Kyle again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kelli",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T05:25:33.000Z",
          "Titre": "Alex was great… I see why he gets 5 stars!",
          "Contenu": "Alex was great! Timely, professional and paid attention to detail! He made helpful suggestions for our closet system that made it more functional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T00:02:26.000Z",
          "Titre": "Love this app",
          "Contenu": "Love this app! Great experience each time!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paula",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T00:36:26.000Z",
          "Titre": "On Point!",
          "Contenu": "Quick, timely, polite, patient, easy to book with lots of options of Taskers to choose from with great info. My tasker was awesome."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T00:20:40.000Z",
          "Titre": "She did a super magnificent job and…",
          "Contenu": "She did a super magnificent job and would love to use her again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laura Baumtrog",
          "Nb_Reviews": 3,
          "Date": "2023-12-13T22:04:24.000Z",
          "Titre": "Definitely will do again!",
          "Contenu": "My Task person was pleasant and efficient. He met the task job in the allotted time and did a great job. And I received $20 off as a first- timer. Definitely will do this again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric Henson",
          "Nb_Reviews": 7,
          "Date": "2023-12-19T14:49:08.000Z",
          "Titre": "Six things",
          "Contenu": "Agent got here early and was very efficient, getting the job done early."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "envy",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T22:26:16.000Z",
          "Titre": "Tasker was polite respectful and knowledgeable",
          "Contenu": "He was diligent and thorough. He cleaned up and was even willing to help place things back in order. What a pleasure to have someone who is not only skilled but works with integrity!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cathie L.",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T07:24:32.000Z",
          "Titre": "Eddie M",
          "Contenu": "Eddie M. was punctual, efficient and personable.  He did the job in the estimated time. He was able to move everything himself, which is also what I needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lise",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T01:28:01.000Z",
          "Titre": "Anton was great and assembled a…",
          "Contenu": "Anton was great and assembled a complicated IKEA daybed with expertise."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T15:52:24.000Z",
          "Titre": "Very good tool for furniture assembly",
          "Contenu": "Very good tool for furniture assembly. Experts can complete the task quickly, making TaskRabbit very affordable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DeChanta Hunter",
          "Nb_Reviews": 4,
          "Date": "2023-12-16T00:06:46.000Z",
          "Titre": "The Tasker Went Above and Beyond",
          "Contenu": "The Tasker went above and beyond. I'll probably request this person again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "NJ Roberts",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T04:01:06.000Z",
          "Titre": "Professional at making the job easy",
          "Contenu": "The tasker I worked with was professional and thorough. Made it easy for me to focus on the many other things in my work day."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anissa",
          "Nb_Reviews": 8,
          "Date": "2023-12-15T21:03:27.000Z",
          "Titre": "Task Rabbit was a great Discovery",
          "Contenu": "Task Rabbit was a great Discovery . It helps a lot & you don’t have to go look for ppl in the neighborhood."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roxie",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T00:58:33.000Z",
          "Titre": "Easy to book appointment quickly",
          "Contenu": "Easy to book appointment quickly.  Tasker prompt, professional and knew what he was doing.  finished quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kay",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T00:30:26.000Z",
          "Titre": "Wallpaper",
          "Contenu": "Quality work & timely completion of job."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bonnie Creech",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T23:34:09.000Z",
          "Titre": "Superman Service…",
          "Contenu": "That day I had a no show from home Depot pro.  Task rabbit guy came the same day and did an amazing job! He was polite and patient.  He was quick too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PTG",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T21:58:35.000Z",
          "Titre": "Amazing",
          "Contenu": "Amazing.  I will definitely be using again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "amir.sunderjigmail.com",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T00:10:12.000Z",
          "Titre": "Quick and Easy",
          "Contenu": "I was quickly able to find the help I needed. UI was easy to uses and communications were easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SME",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T04:29:57.000Z",
          "Titre": "Easy to schedule; quality handyman",
          "Contenu": "App is easy to use, and communicate with a quality handyperson."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sheryl R Lasson",
          "Nb_Reviews": 4,
          "Date": "2023-12-11T20:15:27.000Z",
          "Titre": "Was very easy to schedule someone to…",
          "Contenu": "Was very easy to schedule someone to come within 2 days time. He came on a day and time convenient for us. Very respectful and polite."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jib",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T20:22:08.000Z",
          "Titre": "Very nice person great work resolving…",
          "Contenu": "Very nice person great work resolving issues effectively knowledgeable good communication skills and genuine work"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T04:18:34.000Z",
          "Titre": "Very happy with the job done",
          "Contenu": "Very professional, did a great job with assembly. He will be my go to if I need another task!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fred Peoples",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T22:05:06.000Z",
          "Titre": "Josh was great",
          "Contenu": "Josh was great. He was very professional and he mounted both tv's without any issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric S",
          "Nb_Reviews": 8,
          "Date": "2023-12-12T00:56:34.000Z",
          "Titre": "I hired someone to hook up all my TVs",
          "Contenu": "I hired someone to hook up all my TVs, soundbars, wireless boxes, sub-woofers, etc. he was nest, smart and all TVs are working.  He did a very good job at a fair price!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T23:37:51.000Z",
          "Titre": "Experience was wonderful",
          "Contenu": "Experience was wonderful. We had a really good guy named Alisijo and he did a great job."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T20:46:00.000Z",
          "Titre": "Did many different things around the…",
          "Contenu": "Did many different things around the house in a quick time frame (much quicker than us). Was very friendly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eileen Murphy",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T22:21:39.000Z",
          "Titre": "Excellent service from Fernando",
          "Contenu": "Excellent service from Fernando - very efficient, professional and easy to work with!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T20:26:34.000Z",
          "Titre": "He arrived on time and was very quick…",
          "Contenu": "He arrived on time and was very quick with hauling off the item I was disposing.  Very pleasant experience"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandra",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T23:56:25.000Z",
          "Titre": "The technician was on time and very…",
          "Contenu": "The technician was on time and very courteous and completed the job. I would request him again if I needed any other jobs done."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KW",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T22:22:01.000Z",
          "Titre": "Great experience!",
          "Contenu": "My technician was fantastic and I will definitely request her again the future!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fatima",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T07:12:56.000Z",
          "Titre": "Great service!",
          "Contenu": "Jonathan was great!!   He  was in constant contact with me.     Did a great job.    Best  service ever.   I’ll be task rabbiting for ever….  Even told my family."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Haywood Lawrence",
          "Nb_Reviews": 10,
          "Date": "2023-12-11T23:11:19.000Z",
          "Titre": "Reclner.",
          "Contenu": "A very nice and experienced worker didn't waste time, git right to the job at hand."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T00:57:07.000Z",
          "Titre": "Efficient",
          "Contenu": "Efficient, helpful and kind. So grateful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shawn",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T04:57:37.000Z",
          "Titre": "Very good!",
          "Contenu": "He was punctual, extremely polite, and very good. He got everything I needed done beautifully!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T16:02:50.000Z",
          "Titre": "Great experience",
          "Contenu": "Nurlan was on time and very professional!  He knew exactly what to do and was helpful in the design of our wall unit!   Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julie Bishop",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T00:03:55.000Z",
          "Titre": "Hire George to avoid IKEA frustration!",
          "Contenu": "George was on time, polite, and efficient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shilpa",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T18:21:42.000Z",
          "Titre": "Great service!",
          "Contenu": "very efficient and the final product looks great!!  cleaned up after also!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Guest",
          "Nb_Reviews": 5,
          "Date": "2023-12-20T02:24:02.000Z",
          "Titre": "He is incredible which says it all!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michele DeAngelis",
          "Nb_Reviews": 3,
          "Date": "2023-12-14T00:03:12.000Z",
          "Titre": "It was great",
          "Contenu": "It was great! Timely and friendly person! Would definitely use Taskrabbit again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lorena Uresti",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T06:30:26.000Z",
          "Titre": "I Love to have Taskrabbit",
          "Contenu": "I Love to have Taskrabbit! Very professional, fast, an clean after all the boxes and bags. I wil call net time."
        }
      ]
    }
  ]
}