{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "tawagpinas.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MARK",
          "Nb_Reviews": 19,
          "Date": "2023-10-24T21:07:25.000Z",
          "Titre": "Charged me 33 dollars for something…",
          "Contenu": "Charged me 33 dollars for something that costs less than 2 dollars for Filipinos. Asked them to make it partially right, they refused. 1600% mark-up. I have done a lot of \"loads\" but this was by far the worst of the worst.. Terrible company.."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Relaxing Your Mind and Soul Ch",
          "Nb_Reviews": 1,
          "Date": "2021-04-27T11:53:46.000Z",
          "Titre": "I order for 1000pesos",
          "Contenu": "I order for 1000pesos, then after ordering 4times they decided to verify again, at the time of mobile banking is not available ive submitted to them the card number and other docs still they did put on hold the amount.. now ive submitted the bankstatement they are holding it. It was charge already to bankstatement. What a bunch of thief i will never used this service anymore.. This is my case no. 12391235 you send me email and you told me that my order was put on hold because you need a screenshot of mobile banking that was charged that time it was not available but i submitted all other documents but you told me its your policy to do this and this. Ive reply to the same email that you send but you did not reply.. i dont know what happen to that purchase load as that number is now not working so i dont have anything to verify if that amount was loaded as far as i know you put it on hold on that timeI have given all the details of my wife i even attached our marriage contract her passport id and bank details... And she was the one who told me to purchase load, anyways as long as you will refund we are happy.. thanks and have a wonderful day."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "peter morris",
          "Nb_Reviews": 1,
          "Date": "2022-10-17T10:24:20.000Z",
          "Titre": "300 pesos of load cost me 4 and a half…",
          "Contenu": "300 pesos of load costs  me 4 and a half pounds in the Philippines Through you it cost me 7 and a half pounds 😡"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tricia Bugay",
          "Nb_Reviews": 1,
          "Date": "2021-10-19T01:37:02.000Z",
          "Titre": "I call and cal cannot Go thru",
          "Contenu": "I call and cal cannot Go thru. Used up a lot Of my minutes . Redialjng over and over"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Christopher Hall",
          "Nb_Reviews": 7,
          "Date": "2023-02-01T22:52:06.000Z",
          "Titre": "load never arrived",
          "Contenu": "load never arrived have emailed but no reply. waste of time"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Margaret Feril",
          "Nb_Reviews": 1,
          "Date": "2021-02-25T03:24:04.000Z",
          "Titre": "Money not processed.",
          "Contenu": "The money the I sent took 3 weeks to be processed, then it refunded back to the receiver (that’s me) before long ordeal of reaching out to them. I requested to talk to a supervisor but no one reached out for me or even let me know what was the reason of taking such a long time as promised from your advertisements ‘money same day, or instant money’ delivery. This is not right and I am filing a case against this company"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Flo",
          "Nb_Reviews": 1,
          "Date": "2019-11-14T09:58:05.000Z",
          "Titre": "Incorrect Charges",
          "Contenu": "I had a bad experience because, my card was charged twice. I emailed you but no responded, its been almost 24hours already.—Re: Issue on CardThank you for your reply here in the review site.1. There is no email from any of your representative.2. I have proof that my card was charged twice by Tawag Pinas.I would appreciate if someone will email me now.Thank you."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Costumer from AK",
          "Nb_Reviews": 1,
          "Date": "2018-03-21T05:10:59.000Z",
          "Titre": "Sorry but my transaction was pended…",
          "Contenu": "Sorry but my transaction was pended then success it said but the person i sent it to never got it!👎🏼 Talk to an operator he said he sent it to finance ro review then my friend would receive it but he never got it at all i sent another now still pending so thats it for me. When my transaction gets fixed then maybe I’ll delete this  review... otherwise......"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cristina  P",
          "Nb_Reviews": 1,
          "Date": "2017-05-13T16:43:14.000Z",
          "Titre": "The reception was terrible",
          "Contenu": "The reception was terrible. The entire call I heard my own voice echoed- it was difficult to carry a conversation with the bounce back effect going on the whole time. Not only that, but even with me signing up to get charged for minutes so as not  to drop calls, they still drop the calls, THEN email me an invoice informing me they refilled my minutes. I will use a different company next time."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "suresh sharma",
          "Nb_Reviews": 1,
          "Date": "2017-10-21T01:18:31.000Z",
          "Titre": "application",
          "Contenu": "your application is not safe.  the CVV number is visible on ur application while it will be only shown in *** sign. any hacker can  see the card detail.  and no bank security on ur application.earlier someone theft my credit card detail and made 17 attempt to use my card. thanks to my bank that they block my card. i will never use this site in future"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Theresa",
          "Nb_Reviews": 1,
          "Date": "2016-12-29T01:16:50.000Z",
          "Titre": "Deducting unused minutes",
          "Contenu": "I was very disappointed with my calls. Even though the phone didn't ring, my minutes would be deducted. I didn't even get to speak to anyone and my minutes was still getting deducted. It was a waste of money. It not only happened once, but it has happened to me several times already. I hope the company does something about this matter."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "margie Lo",
          "Nb_Reviews": 2,
          "Date": "2020-04-28T17:18:16.000Z",
          "Titre": "The line was not clear",
          "Contenu": "The line was not clear, i wasted money for this service. My experienced using this app  was not acceptable anymore. They said they already checked and i just needed to check my connection etc.and did what they said but it didn't change my problem. It was always still the same.. I still need to repeat many times what i was saying. It's been like this for many times. When i make calls i needed to re dial again and again bcoz the other party can't hear me..or sometimes i thought i talked to my loved one's but it was a diffrent person on the other line. That was real..really crazy!!"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "David S",
          "Nb_Reviews": 5,
          "Date": "2019-05-02T12:48:12.000Z",
          "Titre": "Just wasted my time trying to send a…",
          "Contenu": "Just wasted my time trying to send a load (twice in 24 hours) because the operator (SMART) is not currently able to process the load. Try again in 24 hours. I did, with the same result. Not particularly encouraging, Tawagpinas.In response to Tawagpinas reply, I found another organisation ghat was able to load that Smart number with no problem at all, so I do not accept Tawagpinas' response. Unfortunately this means that I will no longer use Tawagpinas to send any loads to the Philippines. Also, in trying to use the voice call, the PINless dialling DOES NOT WORK."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "chester tan",
          "Nb_Reviews": 1,
          "Date": "2018-04-14T08:10:05.000Z",
          "Titre": "POOR  OPERATIONS!!!!",
          "Contenu": "WORST  PREPAID/VOICE TOP UP EVER!!!!I’VE BEEN THEIR CLIENT FOR  A MONTH BUYING LOAD FOR MY FAMILY... WHY NOW THEIR ASKING FOR A VERIFICATION????  WHY THEY DIDNT DO IT BEFORE? CITI CALLED ME BEFORE IF I MADE MY FIRST PURCHASE ON LINE  WITH THEM. POOR MANAGEMENT!!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lindo9963",
          "Nb_Reviews": 2,
          "Date": "2019-08-13T20:47:28.000Z",
          "Titre": "Signal is so weak",
          "Contenu": "Signal is so weak.  No prorate, ex. 1.05 min is 2 min. Customer service is not familiar with the problem.When it was paid, the status never change, but rather you have to call the customer service to know if it data is already on the line."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "cecil",
          "Nb_Reviews": 2,
          "Date": "2016-03-28T21:05:23.000Z",
          "Titre": "A disappointment.....",
          "Contenu": "I haven't purchase from your site for a long time. We had a death in the family and I was in a real pinch thats why I bought voice credits again. It was really bad, reception was bad and i thought i was talking to somebody for awhile but everything on the other end was just continually repeating itself. Tried again and it kept saying that they cant recognize my pin number 4x and the 5th time that it did connect- it took so long to be able to get connected to the cellphone. I am really sorry for this review but I feel that you should know to be able to improve your service. Thank you."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mx",
          "Nb_Reviews": 4,
          "Date": "2017-05-14T15:05:28.000Z",
          "Titre": "Tawagpinas is not a safe website they …",
          "Contenu": "Tawagpinas is not a safe website they have apples for payment for amount / transaction I did not authorise. My card provider had to disable my card and send me new one as my details has been used fraudulently by tawagpinas."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "F.H",
          "Nb_Reviews": 2,
          "Date": "2016-07-01T08:15:27.000Z",
          "Titre": "Bad quality voice calls",
          "Contenu": "I make 6 - 7 calls until I got a fair connection not even good! The other side of my call can't hear me it's cutting and we keep saying hello hello hello... I don't really like to use it so often."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "john culbreth",
          "Nb_Reviews": 1,
          "Date": "2014-12-04T08:50:07.000Z",
          "Titre": "very dissappointed",
          "Contenu": "I refilled my gf's phone, but the load is disappearing at a pace of 100 pesos a day, at  this rate the 1000 pesos will be  gone in no time.  This was supposed to last 25 days.  Why  is this happening?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Charles Bradford",
          "Nb_Reviews": 1,
          "Date": "2020-01-22T08:47:10.000Z",
          "Titre": "After received load load phone got slow…",
          "Contenu": "After received load load phone got slow and connection problems, I don’t know if load loaded improperly or if network problems, just started happening after load was received??"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michelle",
          "Nb_Reviews": 3,
          "Date": "2021-03-29T04:14:05.000Z",
          "Titre": "Sucks",
          "Contenu": "Sucks, if only i can rate this with no star I would."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Margarita Guevara",
          "Nb_Reviews": 3,
          "Date": "2019-03-09T19:26:05.000Z",
          "Titre": "Made several calls on same number but I…",
          "Contenu": "Made several calls on same number but I could not be heard.  Finally I was able to talk to my party but my & my party’s conversation was on DELAYED all the time!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Arleene",
          "Nb_Reviews": 1,
          "Date": "2017-11-01T22:39:49.000Z",
          "Titre": "Poor Reception",
          "Contenu": "It never connects easily and when it does, I cannot talk continuously.  There is a time interval before both parties could understand each other."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Luzielle Dela Cruz",
          "Nb_Reviews": 2,
          "Date": "2019-11-03T00:23:59.000Z",
          "Titre": "Unclear instruction as when I use…",
          "Contenu": "Unclear instruction as when I use pinless calls it deduct into my mobile plan here in Australia instead of my account from tawag pinas.."
        },
        {
          "Note": 1,
          "Lieu": "BG",
          "Pseudo": "Peter John Bosse",
          "Nb_Reviews": 36,
          "Date": "2018-11-19T19:15:22.000Z",
          "Titre": "are they real? Scam",
          "Contenu": "are they real? Very bad and snob customer support guy on the phone..Tried other services to the Philippines they at once load the credit..they took 7 hours!Very bad exchange rate PLUS commission!!!!So they take twice more money as 500 PhP is around 8 and not 10 euro!Than again you have to pay extra cost..They are a total SCAM!!!Never ever again no excuses from their side just bad words over the phoneI was trying to help my friend, journalist to load the phone credit and the friend could not make any call It was just 500 Pesos but the damage was big!Dear viewers forget them..Other service load the prepaid at once and not as they need 7 hours as they say, the snobish rude of support, it might be a fraud..Come on! PayPal is protected from both sides and this snob guy should go back and work with washing the dishes instead to be on support! Very rude...7 hours to get a load is TOO long again I am not new in this but this was the first time i ever tried it..and never again..Be warned!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shahab Ansari",
          "Nb_Reviews": 1,
          "Date": "2016-08-04T17:28:48.000Z",
          "Titre": "very bad",
          "Contenu": "my experience is very bad. As when I tried to transfer money to the same number the transaction failed but money was cut from my account"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "shawan bista",
          "Nb_Reviews": 1,
          "Date": "2020-04-05T01:55:35.000Z",
          "Titre": "it says 20s but it takes 20 hours and…",
          "Contenu": "it says 20s but it takes 20 hours and barely even notifies you with purchase confirmation and order status. bad experience."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Vea Navarro",
          "Nb_Reviews": 1,
          "Date": "2018-06-30T02:52:38.000Z",
          "Titre": "It took me months before i can be able…",
          "Contenu": "It took me months before i can be able to contact the number after millions attemps to ring or call.it became so poor already"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Erlinda G",
          "Nb_Reviews": 3,
          "Date": "2020-03-19T22:51:46.000Z",
          "Titre": "Calls are often dropped",
          "Contenu": "Calls are often dropped. I don’t understand why it’s very unreliable. I am seriously looking for another alternative."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MARIANO G SANCHEZ JR",
          "Nb_Reviews": 2,
          "Date": "2019-03-23T23:16:43.000Z",
          "Titre": "I Recharged twice but was not posted to…",
          "Contenu": "I Recharged twice but was not posted to the recipient cph in the Philippines. Thanks for the trouble of sending it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "J Valencia",
          "Nb_Reviews": 1,
          "Date": "2017-11-11T06:15:35.000Z",
          "Titre": "Was charged twice because their system …",
          "Contenu": "Was charged twice because their system was unresponsive when finalizing payment. Will not recommend unless fixed."
        },
        {
          "Note": 1,
          "Lieu": "KW",
          "Pseudo": "Sabiulah Siraj",
          "Nb_Reviews": 1,
          "Date": "2018-12-30T11:15:55.000Z",
          "Titre": "The voice Quality is not as good as…",
          "Contenu": "The voice Quality is not as good as expected. Also, the rates are higher compared to than other calling apps."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cecilia Ruyle",
          "Nb_Reviews": 1,
          "Date": "2019-06-22T19:52:34.000Z",
          "Titre": "There’s always a drop call",
          "Contenu": "There’s always a drop call , the network is not clear , and for some reason they are eating up your balance"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Edisa Kelso",
          "Nb_Reviews": 1,
          "Date": "2017-06-13T13:42:01.000Z",
          "Titre": "Can't use text and it's very slow …",
          "Contenu": "Can't use text and it's very slow pick-up. The one we call can't barely hear us."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Margarita Guevara",
          "Nb_Reviews": 3,
          "Date": "2017-05-16T12:20:21.000Z",
          "Titre": "Conversations are bad",
          "Contenu": "Conversations are bad. There is a gap of seconds before parties could understand each other."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Jason Whiting",
          "Nb_Reviews": 1,
          "Date": "2020-06-18T13:31:06.000Z",
          "Titre": "I never applied or gave you my email or…",
          "Contenu": "I never applied or gave you my email or bank details Put the money back in my account"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William Martin",
          "Nb_Reviews": 1,
          "Date": "2017-09-15T21:09:17.000Z",
          "Titre": "While their rates are good",
          "Contenu": "While their rates are good. Call quality and the ability to place a call are horrible."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark Sheridan",
          "Nb_Reviews": 1,
          "Date": "2017-10-03T02:55:13.000Z",
          "Titre": "Over and over I received the same …",
          "Contenu": "Over and over I received the same message, \"Failure due to System Problem\""
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "vickie sanez",
          "Nb_Reviews": 1,
          "Date": "2015-01-16T05:35:49.000Z",
          "Titre": "Tawag Pinas review",
          "Contenu": "Too many times, the connection was bad. It's always difficult to connect."
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "kole ian",
          "Nb_Reviews": 1,
          "Date": "2019-10-25T08:08:50.000Z",
          "Titre": "worst ever customer never got load and…",
          "Contenu": "worst ever customer never got load and paid looks like scam site ian"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Barry Cohen",
          "Nb_Reviews": 3,
          "Date": "2020-04-14T00:37:35.000Z",
          "Titre": "Terrible  I send a load to my family…",
          "Contenu": "Terrible  I send a load to my family never got it. Service is awful"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "glenn thornburg",
          "Nb_Reviews": 1,
          "Date": "2015-03-04T04:28:53.000Z",
          "Titre": "loads not recieved",
          "Contenu": "yhrre of the last four loads not received but i was charged for yhem"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ARNING/KELTON GENE",
          "Nb_Reviews": 2,
          "Date": "2019-10-20T02:54:52.000Z",
          "Titre": "My debit card was hacked after using…",
          "Contenu": "My debit card was hacked after using this company.  Beware."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "jean amit",
          "Nb_Reviews": 1,
          "Date": "2017-08-25T13:08:48.000Z",
          "Titre": "i always have a terrible experience …",
          "Contenu": "i always have a terrible experience with tawag pinas."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "jon meyer",
          "Nb_Reviews": 2,
          "Date": "2019-05-06T02:52:53.000Z",
          "Titre": "U can only send one load at a time and…",
          "Contenu": "U can only send one load at a time and multiple"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2020-01-29T18:14:20.000Z",
          "Titre": "Being charged for calls unable to…",
          "Contenu": "Being charged for calls unable to connect"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "AH",
          "Nb_Reviews": 3,
          "Date": "2019-05-24T22:44:03.000Z",
          "Titre": "Too expensive",
          "Contenu": "Too expensive, too many annoying emails."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "1234",
          "Nb_Reviews": 2,
          "Date": "2020-12-13T02:10:12.000Z",
          "Titre": "seems expensive for the mins we get"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "paul ashley",
          "Nb_Reviews": 1,
          "Date": "2019-09-21T17:54:34.000Z",
          "Titre": "You didn't add my load to Smart."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Barry Cohen",
          "Nb_Reviews": 3,
          "Date": "2020-08-30T00:14:01.000Z",
          "Titre": "Got ripped off",
          "Contenu": "Got ripped off.   They suck"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Satisfied customer",
          "Nb_Reviews": 3,
          "Date": "2018-11-09T02:29:55.000Z",
          "Titre": "I was not able to make a call"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "gary lentz",
          "Nb_Reviews": 1,
          "Date": "2018-03-27T03:05:46.000Z",
          "Titre": "Call would not going though."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "AH",
          "Nb_Reviews": 3,
          "Date": "2018-11-01T14:15:02.000Z",
          "Titre": "Prices too high"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marvie",
          "Nb_Reviews": 2,
          "Date": "2020-01-29T15:03:59.000Z",
          "Titre": "Never worked"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Denis Gack",
          "Nb_Reviews": 2,
          "Date": "2023-03-27T01:37:27.000Z",
          "Titre": "I like that the calls are cheap, but...",
          "Contenu": "I like that the calls are cheap, but most of the time I have to make multiple attempts to call the number I'm calling because I get a recording that says, \"the number you're  calling is either unattended or out of the coverage area.\" I know that isn't  the case, buy most of the time I gave to make multiple attempts before my call goes through. Once it's  through I have had a number of calls where I suddenly can't heat the other person."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lani Bounds",
          "Nb_Reviews": 2,
          "Date": "2021-07-26T17:56:51.000Z",
          "Titre": "Terrible",
          "Contenu": "Terrible! Each time i make a phone call to my parents in the Philippines signal is sucks! Too much static during conversations and  each time i say something it repeats after me. Terrible Terrible signal. Need to fix this problem!"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mr Michael Morgan",
          "Nb_Reviews": 6,
          "Date": "2021-07-29T10:02:10.000Z",
          "Titre": "Although been informed that it was sent…",
          "Contenu": "Although been informed that it was sent 20 hours later my sister still not received"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Virgilia Berger",
          "Nb_Reviews": 1,
          "Date": "2022-01-01T19:11:51.000Z",
          "Titre": "Website and app are always down."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "gregoryj lyons",
          "Nb_Reviews": 3,
          "Date": "2021-01-25T16:25:26.000Z",
          "Titre": "Can’t get a connection that works",
          "Contenu": "I get the connection all the time straight through but when I connect I can’t hear the party on the other side some days and then on some days I can hear the great majority of the time recently I have not been able to hear who I’m speaking to consistently it drops off and then it’s back and then it drops off and then it’s back when I have had experiences where it’s been perfect let’s try and fix it goes Greg Lyons"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Blake Nolan",
          "Nb_Reviews": 3,
          "Date": "2020-10-17T22:33:36.000Z",
          "Titre": "When I renewed or topped up this  time",
          "Contenu": "When I renewed or topped up this  time, I wanted to buy the same package I had bought the month before. The plan I had bought before worked really well for us. Sadly it did not appear to be availible this time . When I purchased it there was no no mention of it being a special offer or sale. The carrier was Smart the plan was 800mb per day for 30 days plus 1 gb per day for you tube etc.price was approx $21.00 us it was a data plan. Did I miss this somehow? i want to repurchase."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "margie Lo",
          "Nb_Reviews": 2,
          "Date": "2019-11-12T07:54:50.000Z",
          "Titre": "The line was not so clear..i was…",
          "Contenu": "The line was not so clear..i was talking to my relatives last time especially to my mom but she can't hear me on the otnerline.. I called again and someone i don't know answer the line and it was gone.. i'm kinda frustrated and disappointment with this provider bcoz it's been like this for a very long time. I don't know what's going on with tawag pinas anymore. Hopefully, they will fix their line."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Daniel McCaskill",
          "Nb_Reviews": 3,
          "Date": "2019-10-20T07:09:36.000Z",
          "Titre": "Service is slipping to bad",
          "Contenu": "Service is slipping to bad. Having too many pending status. Needs to be instantly sent once its bought. I have to send call back request too often. But use other services that are quick and easy when this service isnt up for the job. Used to be really simple click and send load to my family and friends In Philippines but lately haven't used this service due to the lack of quality and dependability of the services."
        },
        {
          "Note": 2,
          "Lieu": "FR",
          "Pseudo": "Client",
          "Nb_Reviews": 2,
          "Date": "2019-09-30T05:40:21.000Z",
          "Titre": "Unstable",
          "Contenu": "It has been working fine the last 3 yrs i'm using it but today,sept 2019 in France,tried using it and i keep getting ''the code entered is invalid'' and the number you dialled is incorrect,it was ridiculous,!i memories my pin code and the number i am calling,keep dialling for an hour and tried all the access numbers within France and keep getting the same error,fix it!i have been a loyal client for the past 3 yrs!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mr. Olsen",
          "Nb_Reviews": 1,
          "Date": "2019-10-07T00:14:35.000Z",
          "Titre": "First off",
          "Contenu": "First off, you guys take too long to process orders.Secondly when you call in to talk to any of your associates either they're short crude or rude or they don't speak English very well.Thirdly the transfers or the load as you guys put it, in some cases take way too long to show up on the phones.I doubt seriously if I'll hear back from anybody about this survey but if you feel you have the courage to contact me my phone number is818-378-7008Thanks for taking the time"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Maria Fladseth",
          "Nb_Reviews": 1,
          "Date": "2020-07-05T15:40:26.000Z",
          "Titre": "its hard to use because I have to use…",
          "Contenu": "its hard to use because I have to use Java app. So many times, everytime I try to call my family. i have to re-run/install Java. I just add some money. I know its not enough but I dont know if i am able to use it because it wants me to .....once again re-install Java. my computer is not accepting it because of virus issue. I guess i loose that time to contact my relative again!!! and one more thing why is it your website does not work with chrome. why does It have to open to internet explorer????? your site is not user friendly!!!"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "michael riley",
          "Nb_Reviews": 1,
          "Date": "2015-01-08T08:27:28.000Z",
          "Titre": "poor quality calls, poor value",
          "Contenu": "I am charged for calls when they do not connect, the call quality is often poor which means I have to stop the call & ring again,  the connection is often lost & I get that annoying message telling me to enter the number again. Using Tawag Pinas can be very frustrating.  The cost per call is expensive and I lose a lot of my credit for the reasons mentioned above. It is poor value."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lani Bounds",
          "Nb_Reviews": 2,
          "Date": "2019-03-24T13:32:30.000Z",
          "Titre": "This is happen everytime when I make a…",
          "Contenu": "This is happen everytime when I make a phone call back home (cebu philippines) into their landline. Everytime I dialed their land line # it would ring once then it prompted me to this automated message qoute( sorry chuchu i (forgot the next word) then followed by this is a voice mail application) so I just hang up. In the past I was able to connect to their home phone.  I don't know what's going on. My parent's had the pldt came into the house to fix the line.  I still have problem with landline connections. Thank you,"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "D...B..",
          "Nb_Reviews": 2,
          "Date": "2017-01-30T00:34:44.000Z",
          "Titre": "UnReliable",
          "Contenu": "Using the service to call the Philippines can make you pull out all of your hair.  Many times it does not connect, or it takes over 3 min to get a call to connect.  Multiple times it not only connected to the wrong number, but to the wrong country.  The sound quality is poor except the rare occasion when it is actually half way decent.  The site only post positive reviews with no way of posting your own review, which leads me to believe the reviews are fake, or filtered to show only positives."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Allan Morales",
          "Nb_Reviews": 3,
          "Date": "2018-02-04T01:15:51.000Z",
          "Titre": "Underwhelmed.",
          "Contenu": "I was first connected with someone in France. Of course, the clock was ticking down my minutes, even if I got a wrong connection. After this, tt was only on my 3rd or 4th attempt that I got my desired party on. To say the least, we had to shout at each other. I ended my call abruptly."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "michael randall",
          "Nb_Reviews": 4,
          "Date": "2020-11-30T23:59:40.000Z",
          "Titre": "Kind of expensive especially calling…",
          "Contenu": "Kind of expensive especially calling cell phone numbers in the Philippines considering that few people there have landlines.  Then it is very very annoying that if a phone just rings or if I want to make another call directly after, or if the phone number if busy, that I have to hang up then redial tawagpinas before calling another number.        Why hasn't tawagpinas allowed the caller to push, for example ##, to call a different phone number.  Finally, it is not uncommon for a phone to ring or to get a strange incorrect number where no one answers but get a voice recording is no good, and yet tawagpinas charges a minute for the call."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "D...B..",
          "Nb_Reviews": 2,
          "Date": "2017-05-10T20:42:30.000Z",
          "Titre": "50/50",
          "Contenu": "Honestly, the only reason I stay with them is because they have very good customer service. But the product itself not very good.  It can take up to 3 days to get a call to connect.  Also majority of the time the call quality is not all that good."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Cesar Chan",
          "Nb_Reviews": 6,
          "Date": "2019-02-15T03:24:50.000Z",
          "Titre": "I lost more than $5 by calling certain…",
          "Contenu": "I lost more than $5 by calling certain phone number in the Philippines that call never answered but my credit was charged more than $5.00 for repeated calls I made. It was really insane that charges were made without any connection."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "REYNALDO LIMUACO FABELLA",
          "Nb_Reviews": 1,
          "Date": "2019-07-09T20:15:54.000Z",
          "Titre": "i ordered for a reload but was not…",
          "Contenu": "i ordered for a reload but was not delivered due to technical problems. I emailed my problems 4 times and requested for a call since they do not have a number to call to but the call never came not even a reply to my email"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "michael randall",
          "Nb_Reviews": 4,
          "Date": "2021-01-20T04:59:31.000Z",
          "Titre": "Four problems with Tawagpinas:",
          "Contenu": "Four problems with Tawagpinas:1. The system quickly shuts down if you have dialed the wrong number with a sarcastic \"goodbye\" followed by a dial tone.2. There is no way after you finish a call if you want to dial another number. You have to hang up and dial the other number.  Why can't Tawagpinas allow the caller to push # or something like that to be able to dial another number??3. It is not uncommon to place a call that doesn't go through or you get a strange recording including ones that say the person is out of area, and yet Tawagpinas charges the customer for the call.4. finally, the rates to the Philippines are too high.  Tawagpinas knows that most calls are to cellphone which have higher rates than calls to landlines."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rick Holland",
          "Nb_Reviews": 2,
          "Date": "2018-08-22T01:23:43.000Z",
          "Titre": "my load reload did NOT reach the person…",
          "Contenu": "my load reload did NOT reach the person i bought it for in the Philippines.  They ran a  so called investigation and i received ,,, in my opinion a RIP OF LETTER saying they got the load.   I may be looking for new way"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "james mccombs",
          "Nb_Reviews": 1,
          "Date": "2019-06-20T22:53:14.000Z",
          "Titre": "No bonus or incentives for frequent…",
          "Contenu": "No bonus or incentives for frequent users. It takes a lot to build that many points. Been using this for a long time and it is out of date.  Found some a lot cheaper and going to try the after this."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "glenn",
          "Nb_Reviews": 3,
          "Date": "2018-07-30T04:33:17.000Z",
          "Titre": "I experienced a lot of drop calls and f…",
          "Contenu": "I experienced a lot of drop calls and f there’s no internet connection cannot contact needs a lot of improvement. The only thing that’s keeping me a customer is I don’t need to go out and buy phone cards"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Glenn Perez",
          "Nb_Reviews": 3,
          "Date": "2020-03-24T03:13:35.000Z",
          "Titre": "I placed my order 2 days ago",
          "Contenu": "I placed my order 2 days ago. Until now I still can't use it. And this specialist i( Miriam) is unreliable. I called today to get this problem solve but instead the problems goes wider"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Don Reeves",
          "Nb_Reviews": 2,
          "Date": "2016-09-14T00:37:23.000Z",
          "Titre": "slow recharge",
          "Contenu": "My recharge to my beneficiary at +63 9277354499 has not gone through after three days....cannot understand the problem.  Your office has thanked me for the order but...nothing.....Help is requested."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Domino Lux",
          "Nb_Reviews": 1,
          "Date": "2020-10-13T18:16:54.000Z",
          "Titre": "sound quality of the receiving end is…",
          "Contenu": "sound quality of the receiving end is bad and choppy. Facebook messenger is clearer. I will probably just use tawagpinas when calling someone not using a Facebook messenger"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Thomas Eatinger",
          "Nb_Reviews": 3,
          "Date": "2017-01-04T17:05:01.000Z",
          "Titre": "I was not able to complete a 2nd transaction to the same number",
          "Contenu": "Hellio, I tried sending a 2nd load to the same number, and I could not get logged into your website thru facebook, or my regular login.  I asked for a password reset, and I have not received it"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "William Pemberton",
          "Nb_Reviews": 11,
          "Date": "2020-08-28T03:02:07.000Z",
          "Titre": "Your online service for follow up on…",
          "Contenu": "Your online service for follow up on order was lacking. I requested information on chat site along with phone calls and you neither wanted to respond or were not interested"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ronaldo T.",
          "Nb_Reviews": 1,
          "Date": "2020-01-05T00:39:58.000Z",
          "Titre": "The review is based on the last holiday calls of 2019",
          "Contenu": "The review is based on the last calls I'd had during the previous Christmas/New year holidays. I have been using tawagpinas for some years and don't have any bad experience until lately. First, there is limited access #s now, the one I used to use is no longer working (856) so I have to research another access # (732). Then dialing my family in the Philippines is tough getting a connection and when I did, a lot of times the connection disconnects in middle of conversation. Other times I have noticed too is when it rang on the other side but didn't get any connection, the minute was reduced. Hope that this recent experience will help tawagpinas improve their service. I am not sure though if its only because of the holidays, but in any case, they should have anticipated more volume during this season."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Diadema B. T.",
          "Nb_Reviews": 2,
          "Date": "2018-07-15T04:20:08.000Z",
          "Titre": "Charge from my paypal acct every time I…",
          "Contenu": "Charge from my paypal acct every time I call to philippines, even I still have enough money to call. And I indeed cancel my bank acct from pay pal, because of these.😡"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Carol Quijano",
          "Nb_Reviews": 1,
          "Date": "2016-02-03T18:47:23.000Z",
          "Titre": "Discount",
          "Contenu": "I received an email with a discount and I am not sure if it was applied to the $5 voice credit I purchased.  It seemed that airtime was the same as one without the discount."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Roy Andrews",
          "Nb_Reviews": 2,
          "Date": "2017-09-18T20:08:53.000Z",
          "Titre": "The connections are poor",
          "Contenu": "The connections are poor, I keep getting charged for bad connections, and even ones that never even connected.  If I could find a different service I would change."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JC",
          "Nb_Reviews": 1,
          "Date": "2020-09-26T21:02:33.000Z",
          "Titre": "Can’t make any phone calls when I’m not…",
          "Contenu": "Can’t make any phone calls when I’m not connected to wifi tho I have a strong cellular data signal. But perfectly works when I’m connected to wifi."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ron canones",
          "Nb_Reviews": 2,
          "Date": "2020-01-23T07:14:56.000Z",
          "Titre": "It's used to be inexpensive calling…",
          "Contenu": "It's used to be inexpensive calling apps but  as I use it longer my call time is not worth the money I'm spending. Not worth it anymore."
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "Mrmole",
          "Nb_Reviews": 1,
          "Date": "2016-08-15T07:35:17.000Z",
          "Titre": "Well worth using",
          "Contenu": "Sometimes i cant get through sßometimes you cant hear very well or big delays...But most of the time it saves money.I will keep using tawagpinas"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "michael randall",
          "Nb_Reviews": 4,
          "Date": "2018-11-15T05:58:36.000Z",
          "Titre": "Biggest problem is that I often get…",
          "Contenu": "Biggest problem is that I often get charged when i don't get a live voice or aren't able to leave a message.  It's a headache to have to call TawagPinas for credit for 12-15 cents even though it's TawagPinas who benefits when a lot of people get charged for calls where there was no answer.Then when a call doesn't go through or after a successful call, why doesn't TawagPinas allow me to make another call without having to hang up and redial?  That's a real headache.Then when i have enough balance to make a 1 or 2 minute call, TawagPinas will interrupt the call to tell me my balance is low.  This is annoying.  I wish they would stop doing that. After all they tell me at the start of the call what my balance is, so why are they interrupting my call to try to get me to add more money??  Also, I wish they would allow me to add $2 if i choose to do so while on the phone.  Their minimum is $5.Finally, I feel their rates to the Philippines are a bit on the high side."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Adela Macaspac",
          "Nb_Reviews": 1,
          "Date": "2017-01-20T05:59:32.000Z",
          "Titre": "Calling issue .",
          "Contenu": "If you can fix the problem on the access numbers,, everytime I call, all access  numbers have same message & can't  connect."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Humberto Belvis",
          "Nb_Reviews": 2,
          "Date": "2019-07-11T07:46:39.000Z",
          "Titre": "Comments",
          "Contenu": "It charges my account even though, my call didn’t go through.  Annoying to call customer service all the time to get a credit."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Miss K.",
          "Nb_Reviews": 1,
          "Date": "2014-12-17T00:10:37.000Z",
          "Titre": "unpredictable",
          "Contenu": "When I first used this service it was perfect but now it isn't that good anymore always drop out cannot heard on the other line."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "jay bartolay",
          "Nb_Reviews": 1,
          "Date": "2020-06-25T17:34:57.000Z",
          "Titre": "The service are to slow always pending",
          "Contenu": "The service are to slow always pending. They charge me $33.15 for globe but my uncle didnt get the load in philippine."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ronald",
          "Nb_Reviews": 1,
          "Date": "2018-08-13T05:17:56.000Z",
          "Titre": "At times calls are dropped especially…",
          "Contenu": "At times calls are dropped especially on weekend during peak times.  During weekdays there are no problems calling overseas"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Christine",
          "Nb_Reviews": 1,
          "Date": "2017-04-25T03:03:04.000Z",
          "Titre": "Most of the time the connection dies",
          "Contenu": "Most of the time the connection dies. I have to call 2x or sometimes 3x to have a better connection without dropping calls."
        },
        {
          "Note": 2,
          "Lieu": "SA",
          "Pseudo": "Zakir Hussain",
          "Nb_Reviews": 1,
          "Date": "2015-04-28T08:34:15.000Z",
          "Titre": "I am not happy",
          "Contenu": "yesterday i send a recharge to some one and now the recipient is thinking that i am lying as still not received the recharge."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ron canones",
          "Nb_Reviews": 2,
          "Date": "2019-04-16T06:44:56.000Z",
          "Titre": "It's not worth buying anymore",
          "Contenu": "It's not worth buying anymore. The call time allocation for the amount is not fair, not unlike before."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "william lee",
          "Nb_Reviews": 1,
          "Date": "2020-11-25T04:35:47.000Z",
          "Titre": "hi.you phone line.even charge time",
          "Contenu": "hi.you phone line.even charge timefor waiting for phone ring too.i find ."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dina Santos",
          "Nb_Reviews": 1,
          "Date": "2020-09-02T11:00:18.000Z",
          "Titre": "I couldn’t even hear the person I was…",
          "Contenu": "I couldn’t even hear the person I was talking. There was so much static."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Russ Sanchez",
          "Nb_Reviews": 1,
          "Date": "2019-03-02T03:47:02.000Z",
          "Titre": "Poor connection after speaking on phone…",
          "Contenu": "Poor connection after speaking on phone after 5 mins, more or less!"
        },
        {
          "Note": 2,
          "Lieu": "SA",
          "Pseudo": "Joseph Velarde",
          "Nb_Reviews": 1,
          "Date": "2016-04-13T04:31:59.000Z",
          "Titre": "Conversation always gets cut & not clear",
          "Contenu": "Conversation always gets cut & not clear. Not worth the money."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "EMILY PANGILINAN",
          "Nb_Reviews": 2,
          "Date": "2018-07-14T12:36:55.000Z",
          "Titre": "Poor signal and most of the time my…",
          "Contenu": "Poor signal and most of the time my family can't hear me.."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James Allyn",
          "Nb_Reviews": 1,
          "Date": "2015-01-18T07:25:26.000Z",
          "Titre": "poor connection",
          "Contenu": "all phone calls have Alot of noise and also many dropped calls"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jun",
          "Nb_Reviews": 2,
          "Date": "2018-12-07T03:31:47.000Z",
          "Titre": "Too expensive for calls with a lot of…",
          "Contenu": "Too expensive for calls with a lot of friction"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jennifer Wayman",
          "Nb_Reviews": 1,
          "Date": "2020-10-13T23:04:03.000Z",
          "Titre": "Line is not clear and rate is high?"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Racquel Ann Magat",
          "Nb_Reviews": 1,
          "Date": "2017-07-02T06:03:53.000Z",
          "Titre": "The reception/signal is not clear."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MC",
          "Nb_Reviews": 3,
          "Date": "2018-12-22T23:00:22.000Z",
          "Titre": "Poor",
          "Contenu": "Always disconnecting"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "rose",
          "Nb_Reviews": 1,
          "Date": "2018-05-18T04:52:39.000Z",
          "Titre": "expensive service"
        },
        {
          "Note": 2,
          "Lieu": "BE",
          "Pseudo": "John Beugnies",
          "Nb_Reviews": 1,
          "Date": "2018-02-15T10:02:53.000Z",
          "Titre": "Tax is too high"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "jes",
          "Nb_Reviews": 1,
          "Date": "2017-08-12T01:38:30.000Z",
          "Titre": "clarity is poor"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "SM",
          "Nb_Reviews": 2,
          "Date": "2018-08-13T03:21:38.000Z",
          "Titre": "Poor service"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Geoff",
          "Nb_Reviews": 2,
          "Date": "2023-10-17T11:27:54.000Z",
          "Titre": "I have never had any problems with your…",
          "Contenu": "I have never had any problems with your service until yesterday. I sent a load to my family in the Philippines yesterday, however, even though the load was successfully sent, my family did not receive the load from TM Mobile. I have sent another load today, again received confirmation of a successful load, still not receiving"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stanley Szymanski",
          "Nb_Reviews": 7,
          "Date": "2021-05-22T15:59:37.000Z",
          "Titre": "I have confidence and I feel safe using…",
          "Contenu": "I have confidence and I feel safe using Remitly. At times, however, the people on the receiving part of my transaction do not get notified with a text message. It puts the receiver in a bit of a panic but it all works out in the end.I cannot imagine using any other service!  Thank you!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Al Younger",
          "Nb_Reviews": 4,
          "Date": "2021-11-25T05:34:02.000Z",
          "Titre": "This is just a temporary rating that I…",
          "Contenu": "This is just a temporary rating that I am giving right now because I have not been able to use your service. I don't know what I am doing wrong but I can't seem to make my call to the Philippines. I check and double check the numbers but no dice. The voice comes on and says \"good bye\". I was told I have 589 minutes to call the Philippines. Please Help, so I can give a better review. Thank you."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Vicky Whirtley",
          "Nb_Reviews": 3,
          "Date": "2022-12-27T04:43:34.000Z",
          "Titre": "Again I got cut off  in the middle of…",
          "Contenu": "Again I got cut off  in the middle of talking to my mother, have to call her back, then got cut off again.  Other than that I like the service."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "helen  grace bambalan",
          "Nb_Reviews": 3,
          "Date": "2021-05-30T03:13:17.000Z",
          "Titre": "a little bit expensive the load and…",
          "Contenu": "a little bit expensive the load and fast finished the minutes to call philipoines."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "BASUEL/MARCPRINCIPE",
          "Nb_Reviews": 4,
          "Date": "2021-05-23T17:40:41.000Z",
          "Titre": "Calls dont connect right away",
          "Contenu": "Calls dont connect right away, have to dial multiple times ,then alot of drop calls"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "michael randall",
          "Nb_Reviews": 4,
          "Date": "2018-08-11T20:46:11.000Z",
          "Titre": "Not too bad but too many charges for missed calls",
          "Contenu": "Not too bad.  But there are too many dropped calls or calls where the phone just rings and yet TawagPinas charged for those.  It's a headache to have to call in each time I am charged for 1 min for a call where the phone just rings.  It still costs me 15 cents to call the Philippines.  TawagPinas needs to make sure that their system is better able to detect missed calls!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Roy Andrews",
          "Nb_Reviews": 2,
          "Date": "2018-01-31T21:11:01.000Z",
          "Titre": "I have to state since my last review …",
          "Contenu": "I have to state since my last review this group has made major improvements.  But I still do have some issues time to time, of calls that one side can not hear the other, or the call does not complete, but I get charged for it.  I do have to state those issues are not as often as before.  So I am giving a 3 star for today, and will see if they continue to improve."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Angelina Romualdo",
          "Nb_Reviews": 2,
          "Date": "2019-04-27T17:53:47.000Z",
          "Titre": "Customer service should be more visible…",
          "Contenu": "Customer service should be more visible  in assisting customers.  Many if us are not tech literate, therefore when we want to buy credit, they should be able to do that for them. You should have more promotions like other companies. Other companies offer 15% discount with no limit on the amount of the purchase."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "HOWARD",
          "Nb_Reviews": 28,
          "Date": "2017-04-05T12:23:23.000Z",
          "Titre": "Pretty good",
          "Contenu": "Pretty good.  Easy to buy credit.  Usually reasonably good quality.  But Philippines always seem to cost so much more than any other surrounding country which is a bit of a shame.  Especially, as hardly any of them have landlines.  Went up from 8.5 pence to 9.9 pence rather quickly.  Maybe four stars would have been more fair, but I will not give ANY provider a good mark while they charge so much for one particular country. Will continue to use them, nonetheless"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Cesar Chan",
          "Nb_Reviews": 6,
          "Date": "2017-08-09T03:18:55.000Z",
          "Titre": "I got deducted a minute or 2 for a …",
          "Contenu": "I got deducted a minute or 2 for a phone call that never connected through. This happened almost always, whenever I call the Philippines. I wanted to complain but I though It was a waste of time airing my complaint. So I though of writing this to somehow let you know that this issue is happening. I hope you will resolve this issue right away so that your client will be satisfied with your service and thereby, continue to patronize your product/s. Thank you for taking the time to listen."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Antonino Castillo",
          "Nb_Reviews": 1,
          "Date": "2015-03-17T22:39:19.000Z",
          "Titre": "Inexpensive rates but difficult to connect and sometimes noisy",
          "Contenu": "I give it a 2.5 stars because half my calls are not perfect.  Based on experience, calls usually connect at 50% at a time.  The first call doesn't connect.  I need to hang up and dial again.  There also seems to be noise  when calling a land line outside Metro Manila.  The receiver can barely hear my voice so I need to shout.  While I hear the other party but white noise comes in so our conversation is never completed. \r The service has a lot on convenient features like pinless dialing and  1 touch shortcuts.  But connection and call quality needs improvement."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Frank Tino",
          "Nb_Reviews": 2,
          "Date": "2017-02-21T11:14:00.000Z",
          "Titre": "Review of TawagPinas.Com",
          "Contenu": "Good Reload Company; however; while other concerns reload instantly-- this company consistently places you in  \" account review\" or \" similar \" -- and while that is going on for 4 or 5 hours, I have already reloaded at another online concern."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "mike",
          "Nb_Reviews": 2,
          "Date": "2018-04-08T21:28:46.000Z",
          "Titre": "I think the prices are still somewhat…",
          "Contenu": "I think the prices are still somewhat pricey.I have had multiple occasions where after a few minutes the call suddenly ends and I have a voice saying to enter the phone number I wish to callLittle time is given to add more minutes while on a call"
        },
        {
          "Note": 3,
          "Lieu": "SG",
          "Pseudo": "Roy A",
          "Nb_Reviews": 1,
          "Date": "2020-04-13T02:50:36.000Z",
          "Titre": "Pls stay at home you are not the only…",
          "Contenu": "Pls stay at home you are not the only person save people moving around you are also save so stay put inside your own house all are save .The only medicine to solve this virus is prayers .God is great ."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "zzz",
          "Nb_Reviews": 1,
          "Date": "2022-02-13T02:47:49.000Z",
          "Titre": "please improve the voice quality",
          "Contenu": "please improve the voice quality. intermittent interruptions at times"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Erlinda G",
          "Nb_Reviews": 3,
          "Date": "2019-10-31T03:14:43.000Z",
          "Titre": "It’s not very reliable.",
          "Contenu": "It’s not very reliable. There are times when my call cannot go through. Also, I have experienced dropped calls. I am actually looking for better alternative than Tawag Pinas. I hope to find one soon."
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "YEN CAM",
          "Nb_Reviews": 7,
          "Date": "2017-11-29T17:21:15.000Z",
          "Titre": "I called my family and friends in the …",
          "Contenu": "I called my family and friends in the Philippines from times to times...Often I can not get in touch in Barangay Suplang, Batangas and Catanduanes...Perhaps because it's too far from Manila..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cecilia Hall",
          "Nb_Reviews": 1,
          "Date": "2018-11-26T02:05:58.000Z",
          "Titre": "Connection was not clear",
          "Contenu": "Connection was not clear.  I can hear my family back home but they cannot hear me. I tried calling them twice and wasted my minutes because they can't hear me and i just gave up."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stanley Szymanski",
          "Nb_Reviews": 7,
          "Date": "2021-01-21T14:52:17.000Z",
          "Titre": "TawagPinas.com seems to work just fine, HOWEVER....",
          "Contenu": "TawagPinas.com seems to work just fine. However, whenever I am finished with my order I find it extremely difficult to log out.  It should not be that difficult."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "danilo mendoza",
          "Nb_Reviews": 2,
          "Date": "2017-08-16T14:22:48.000Z",
          "Titre": "I made calls to the Philippines but …",
          "Contenu": "I made calls to the Philippines but with poor connections! 12 times having failed attempts and dropped calls, Asked for credits but never given nor acknowledged."
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "Rachel U",
          "Nb_Reviews": 4,
          "Date": "2018-02-05T17:14:23.000Z",
          "Titre": "I rate your service 3 stars because …",
          "Contenu": "I rate your service 3 stars because sometimes theirs a problem with the connection and the persons im calling cannot hear me clearly visa versa.Thank you."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "David Butler",
          "Nb_Reviews": 12,
          "Date": "2018-05-28T10:41:23.000Z",
          "Titre": "I would like a smaller value as an…",
          "Contenu": "I would like a smaller value as an option to send. Also your reward scheme would be better if I could use for future loads not just voice"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Daniel McCaskill",
          "Nb_Reviews": 1,
          "Date": "2016-02-06T12:59:47.000Z",
          "Titre": "Couldn't complete orders due to system down?",
          "Contenu": "Wasted time, the receiver was waiting and couldn't get load completed so they had to load using another service, not so happy with that."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Rohaina",
          "Nb_Reviews": 3,
          "Date": "2017-02-04T08:40:52.000Z",
          "Titre": "Lower calling cost to Philippines",
          "Contenu": "It could have been better if the calling call charges to Philippines is lower.  Sometimes,  I wonder why my mobile cost is very expensive."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Luzzie Valdez",
          "Nb_Reviews": 1,
          "Date": "2018-03-29T03:09:56.000Z",
          "Titre": "Mobile Recharge",
          "Contenu": "I was in the Philippines trying to recharge my mobile. TawagPinas took three days to do it. It was so frustrating."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "mike",
          "Nb_Reviews": 1,
          "Date": "2016-12-24T01:13:15.000Z",
          "Titre": "pretty good but a bit expensive",
          "Contenu": "Pretty good service, but a bit too expensive for calls to cell phones, and sometimes are charged for dropped calls."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "CS",
          "Nb_Reviews": 2,
          "Date": "2019-05-27T06:52:42.000Z",
          "Titre": "Always got the language that I couldn't…",
          "Contenu": "Always got the language that I couldn't understand.... Used to be good but recently proplem after problem"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Cox",
          "Nb_Reviews": 2,
          "Date": "2021-02-03T09:50:48.000Z",
          "Titre": "The rates charged are very expensive",
          "Contenu": "The rates charged are very expensive, nearly double!  and sometimes a long delay in getting the load."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "BASUEL/MARCPRINCIPE",
          "Nb_Reviews": 4,
          "Date": "2020-11-13T06:45:52.000Z",
          "Titre": "it takes several call attempts before i…",
          "Contenu": "it takes several call attempts before i get connected and once im connected i always have drop calls!"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Tess",
          "Nb_Reviews": 9,
          "Date": "2019-01-01T20:21:42.000Z",
          "Titre": "Not a good service.",
          "Contenu": "Sometime I can't hear the voice. Always dropped the calls while I am still talking on the phone."
        },
        {
          "Note": 3,
          "Lieu": "PH",
          "Pseudo": "robert degen",
          "Nb_Reviews": 2,
          "Date": "2017-04-14T14:06:17.000Z",
          "Titre": "need a way to delete old numbers i …",
          "Contenu": "need a way to delete old numbers i loaded before but tawagpinas said theres no way to delete them :("
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Fred Thompson",
          "Nb_Reviews": 2,
          "Date": "2017-01-18T03:03:35.000Z",
          "Titre": "Exchange rate not accurate",
          "Contenu": "Seem to get cheated the exchange rate, Service charge is to high. To hard to reach customer service,"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gina from Roseville",
          "Nb_Reviews": 3,
          "Date": "2018-10-14T08:10:20.000Z",
          "Titre": "not too bad",
          "Contenu": "Call got disconnected after about 10 min. Went okay after redialing. Overall, it was okay."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chi",
          "Nb_Reviews": 3,
          "Date": "2020-01-29T18:08:52.000Z",
          "Titre": "They still need to work on their…",
          "Contenu": "They still need to work on their signal.  Drop calls and dead spots are still constant."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ron Monteverde",
          "Nb_Reviews": 1,
          "Date": "2016-03-08T03:10:18.000Z",
          "Titre": "Good for sometime",
          "Contenu": "Acceptable but the signal sometimes losses,  how ever it is good than nothing"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Evelyn Chua",
          "Nb_Reviews": 1,
          "Date": "2017-01-21T05:10:14.000Z",
          "Titre": "sometimes i loose minutes even though i can't contact the person i'm calling to & the feedback is slow. thanks",
          "Contenu": "please improve more, I hope you have unlimited call to smart users :) thanks"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "BASUEL/MARCPRINCIPE",
          "Nb_Reviews": 4,
          "Date": "2020-06-25T15:44:09.000Z",
          "Titre": "My call keeps disconnecting and it…",
          "Contenu": "My call keeps disconnecting and it takes awhike to connect my calls"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Tess",
          "Nb_Reviews": 9,
          "Date": "2018-05-11T09:08:24.000Z",
          "Titre": "Sometimes it's difficult to contact my…",
          "Contenu": "Sometimes it's difficult to contact my family and always chappy."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chi",
          "Nb_Reviews": 3,
          "Date": "2019-09-05T01:29:01.000Z",
          "Titre": "calls getting disconnected",
          "Contenu": "calls getting disconnected, signal is not stable, a bit expensive."
        },
        {
          "Note": 3,
          "Lieu": "AZ",
          "Pseudo": "Pekka Lilius",
          "Nb_Reviews": 2,
          "Date": "2019-07-28T22:48:18.000Z",
          "Titre": "Minimum load to send is 300",
          "Contenu": "Minimum load to send is 300. There should be also lower options"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "William Orth",
          "Nb_Reviews": 1,
          "Date": "2018-01-05T04:56:53.000Z",
          "Titre": "Philippines Mobile Rates",
          "Contenu": "The rate you charge to Philippine mobiles is still very high."
        },
        {
          "Note": 3,
          "Lieu": "IE",
          "Pseudo": "Grace Daguman",
          "Nb_Reviews": 5,
          "Date": "2018-08-09T10:53:48.000Z",
          "Titre": "Calls keeps getting cut off…",
          "Contenu": "Calls keeps getting cut off everytime..it's annoying."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Mar",
          "Nb_Reviews": 1,
          "Date": "2017-08-04T11:26:27.000Z",
          "Titre": "At times they can no hear me over the …",
          "Contenu": "At times they can no hear me over the phone."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeff Guberman",
          "Nb_Reviews": 6,
          "Date": "2017-06-04T19:08:34.000Z",
          "Titre": "The reception is spotty need better …",
          "Contenu": "The reception is spotty need better clarity."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "David Butler",
          "Nb_Reviews": 12,
          "Date": "2017-07-12T07:03:33.000Z",
          "Titre": "Very good service but a little expensive"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joe David",
          "Nb_Reviews": 3,
          "Date": "2019-10-07T07:38:40.000Z",
          "Titre": "The audio quality needs improvement."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "hima hima",
          "Nb_Reviews": 1,
          "Date": "2018-06-23T04:01:12.000Z",
          "Titre": "it ok",
          "Contenu": "it ok  but need to pay by btc or dash"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "WILLIAM MARSHALL",
          "Nb_Reviews": 1,
          "Date": "2019-05-10T20:43:32.000Z",
          "Titre": "I WISH YOU WOULD SELL 150 LOADS ALSO"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Tess",
          "Nb_Reviews": 9,
          "Date": "2021-02-11T07:43:58.000Z",
          "Titre": "Sometimes not easy to call."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Vic B",
          "Nb_Reviews": 3,
          "Date": "2019-02-15T11:56:18.000Z",
          "Titre": "SMS service is not reliable."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chi",
          "Nb_Reviews": 3,
          "Date": "2018-09-22T00:07:12.000Z",
          "Titre": "poor signal",
          "Contenu": "poor signal, some drop calls"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joe David",
          "Nb_Reviews": 3,
          "Date": "2020-01-23T09:36:07.000Z",
          "Titre": "Audio quality is mediocre"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rhemie Hoehn",
          "Nb_Reviews": 1,
          "Date": "2019-11-13T22:35:12.000Z",
          "Titre": "It was ok but got cut off"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Maria Manuelita Meixner",
          "Nb_Reviews": 2,
          "Date": "2019-12-31T04:13:22.000Z",
          "Titre": "hard time in connecting.",
          "Contenu": "hard time in connebting."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "mike",
          "Nb_Reviews": 2,
          "Date": "2016-09-10T14:41:11.000Z",
          "Titre": "Pretty good service",
          "Contenu": "wish rates were lower"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Vicky Whirtley",
          "Nb_Reviews": 3,
          "Date": "2021-01-14T13:40:05.000Z",
          "Titre": "Connection issue"
        },
        {
          "Note": 3,
          "Lieu": "TR",
          "Pseudo": "Ali Taskin",
          "Nb_Reviews": 3,
          "Date": "2020-07-22T10:39:40.000Z",
          "Titre": "Too expensive"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Archie",
          "Nb_Reviews": 5,
          "Date": "2023-10-10T08:40:06.000Z",
          "Titre": "Good quick service",
          "Contenu": "Good quick serviceThe supposed 50gig plus struggles to get past 2 weeks usage, which is pretty sad. As it is mostly just facebook usage"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Rohaina Amer",
          "Nb_Reviews": 1,
          "Date": "2021-03-27T14:15:06.000Z",
          "Titre": "Very good  option to used to call my…",
          "Contenu": "Very good  option to used to call my parents who live in a location which internet is slow and weak in short poor connection. Would be great if the charge decreases  so that more airtime  purchased so those unfortunate  places  affected  by corruption  will atleast  enjoy it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "reynaldo",
          "Nb_Reviews": 6,
          "Date": "2021-11-20T03:26:45.000Z",
          "Titre": "Still great long distance service…",
          "Contenu": "Still great long distance service company. I have been with them for a decade already, still trustworthy in service keep it up These will make your Telecom company stay at least at the best Telecom long distance service company"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MEC Guerrero",
          "Nb_Reviews": 1,
          "Date": "2022-03-22T10:07:32.000Z",
          "Titre": "The quality of the calls are really clear",
          "Contenu": "The quality of the calls are really clear and good.Customer service via email is quick and responsive. I really appreciate it.The only reason I did not give it a 5 star is because of one issue in the system. When the call is 'failed attempt' (this is the term used by customer service), this is when you call and it will say '... voice mail', it would deduct 10 cents automatically. So x numbers of call with that adds up. The thing is, customer service was fast and said they will credit back (and they did) and to let me now if problem persists. It is good that credit is given back, HOWEVER, If they already know that this is a problem, just FIX the system to NOT charge when this happens instead of having the customer message everytime and asking for credit back."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "lone",
          "Nb_Reviews": 2,
          "Date": "2021-07-05T05:36:05.000Z",
          "Titre": "I only rated TawagPinas 4 stars this…",
          "Contenu": "I only rated TawagPinas 4 stars this time around.  The last time I rated it 5 stars.  The reason for the lower rating is I noticed that they are now charging my account as minutes used for \"no answer\" -- this is when you try to call someone & the person you're calling never picks up or answers.... the phone just rings.  Not sure why they are charging minutes for this now.... they weren't doing it before Jun/Jul 2021..... so why the change now..... I don't think it's right to charge minutes for \"no answer\" calls!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "danish christian",
          "Nb_Reviews": 4,
          "Date": "2021-10-03T08:53:36.000Z",
          "Titre": "IT IS A GREAT SITE.",
          "Contenu": "YES I M ENJOYING USNG TAWAGPINAS. AND PAYPAL OPTION HAS MADE MY THINGS MORE EASY AND SAFE. I WILL RECOMMEND TO USE THIS SITE FOR COMMUNICATION IN THE PHILIPPINES. THANKS."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "grace",
          "Nb_Reviews": 1,
          "Date": "2022-02-12T19:05:27.000Z",
          "Titre": "Love their service",
          "Contenu": "Love their service that’s why I’mgiving it a 4* cz sometimes it takes time to get through the direct number you’re calling and if you can lower your rate pls that would be so awesome Thanks"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Carlos",
          "Nb_Reviews": 2,
          "Date": "2022-08-08T19:51:21.000Z",
          "Titre": "Dito",
          "Contenu": "I only used this service because they have Dito load service for the Philippines. Price is a little higher but at least they have Dito other load services don't"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Vaneyck",
          "Nb_Reviews": 1,
          "Date": "2021-12-23T15:20:55.000Z",
          "Titre": "Good service and somewhat reasonable…",
          "Contenu": "Good service and somewhat reasonable here fees i’m clear that could be just a little bit lower Then  more customers would use the service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Melinda Moreno",
          "Nb_Reviews": 1,
          "Date": "2023-06-17T14:01:10.000Z",
          "Titre": "This tawag pinas is a lot of help for…",
          "Contenu": "This tawag pinas is a lot of help for me anytime i need to call my family it’s easy to dial and reach them. Thanks to you Tawag Pinas😁"
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "ALAIN DESSON",
          "Nb_Reviews": 8,
          "Date": "2023-06-07T07:56:05.000Z",
          "Titre": "Never problems whit this application",
          "Contenu": "Never problems whit this application. It's a good choice for me.Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Raoul Laoyan",
          "Nb_Reviews": 1,
          "Date": "2021-06-15T17:18:08.000Z",
          "Titre": "Fast, accurate, expensive",
          "Contenu": "I would give them a 5 but the prices are extremely high to do a $25 transaction.  Every transaction I’ve done has been very fast and accurate."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Maria Batino",
          "Nb_Reviews": 6,
          "Date": "2021-09-28T15:33:10.000Z",
          "Titre": "I enjoy using TawagPinas.com",
          "Contenu": "Big help for me using TawagPinas.com to reload/send load for my family back home. Very helpful"
        },
        {
          "Note": 4,
          "Lieu": "TH",
          "Pseudo": "ERROL Dela cruz",
          "Nb_Reviews": 1,
          "Date": "2021-05-04T11:45:21.000Z",
          "Titre": "Should give you 5 star but I have one…",
          "Contenu": "Should give you 5 star but I have one order that my recipient didn't received the top up"
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "ALAIN DESSON",
          "Nb_Reviews": 8,
          "Date": "2022-01-15T11:09:20.000Z",
          "Titre": "Good service for my experience",
          "Contenu": "Good service for my experience. I find this application easy to use and fast.Thank you.."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Helene D",
          "Nb_Reviews": 1,
          "Date": "2021-07-31T04:22:50.000Z",
          "Titre": "It’s great being able to call loved…",
          "Contenu": "It’s great being able to call loved ones from the Philippines using your app."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ana Daresa Moore",
          "Nb_Reviews": 3,
          "Date": "2021-05-17T11:12:54.000Z",
          "Titre": "I order a 5$ credit and it was deducted…",
          "Contenu": "I order a 5$ credit and it was deducted to my bank but not able to use it..I need my money back if the credit is not there.grrrrrrr"
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "Anabelle H",
          "Nb_Reviews": 3,
          "Date": "2021-04-29T03:06:37.000Z",
          "Titre": "I’ve already used this for 7 months now…",
          "Contenu": "I’ve already used this for 7 months now And it looks convenient This month I just paid my globe data But then it looks like weak in just 2 weeks, do you have any idea"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Meyers",
          "Nb_Reviews": 1,
          "Date": "2021-12-28T21:27:26.000Z",
          "Titre": "So farna good experience",
          "Contenu": "So far... It has been a pleasant place to send a load to my friends.  Glad they are so easy to use and open about how they operate."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dante",
          "Nb_Reviews": 2,
          "Date": "2021-05-06T17:04:37.000Z",
          "Titre": "Great",
          "Contenu": "Great! Easy to contact the receiver and with clear voice in talking."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert  Arney",
          "Nb_Reviews": 3,
          "Date": "2022-08-26T14:38:43.000Z",
          "Titre": "A little too expensive but convenient…",
          "Contenu": "A little too expensive but convenient in a pinch"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Laurena Rago",
          "Nb_Reviews": 2,
          "Date": "2021-11-11T14:51:25.000Z",
          "Titre": "Good",
          "Contenu": "Good it help my sadness talking to my family back home"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "toolani user",
          "Nb_Reviews": 4,
          "Date": "2021-08-13T00:12:01.000Z",
          "Titre": "I like how easy it is to use",
          "Contenu": "I like how easy it is to use, and how easy it is to recharge the phone card.  If you could bring prices down I'd give 5 stars"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "William Pemberton",
          "Nb_Reviews": 11,
          "Date": "2022-12-19T06:58:32.000Z",
          "Titre": "Never give 5 stars always margin for…",
          "Contenu": "Never give 5 stars always margin for error"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dolores Tolerba",
          "Nb_Reviews": 2,
          "Date": "2023-05-27T05:27:52.000Z",
          "Titre": "Accurate",
          "Contenu": "Fast, clear and accurate."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Virgie Canumay",
          "Nb_Reviews": 2,
          "Date": "2021-08-07T19:03:25.000Z",
          "Titre": "Great!",
          "Contenu": "Great! Easy to connect, only it’s expensive.I need to get a monthly plan."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ana Bedell",
          "Nb_Reviews": 1,
          "Date": "2021-08-18T19:40:28.000Z",
          "Titre": "It’s fast but rate is a little higher…",
          "Contenu": "It’s fast but rate is a little higher than others"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Michael Cornish",
          "Nb_Reviews": 10,
          "Date": "2021-12-17T10:13:34.000Z",
          "Titre": "Works but expensive way to top up."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Mad Dison",
          "Nb_Reviews": 3,
          "Date": "2021-02-27T21:55:28.000Z",
          "Titre": "very good service fast and easy!",
          "Contenu": "very good service fast and easy!but the minimum 350 load is just too expensive. it would have been better if there's 20 or 50 for minimum load also. as i have to send it to several beneficiaries and it just too expensive for me to send 350 load amount to each beneciary at one time. I'd rather top them up with lesser load amount. cheaper that way!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Luisita Livingston",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T04:20:24.000Z",
          "Titre": "NOT BAD",
          "Contenu": "NOT BAD. I can reach the one I am intending to call."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Brian Baxter",
          "Nb_Reviews": 3,
          "Date": "2020-05-04T21:02:12.000Z",
          "Titre": "no transaction complete after sending",
          "Contenu": "The only problem I have with this service is when you hit the send button it does not tell you that your transaction is complete. It usually takes about 20 minutes to get an email saying it is complete. The first time I used this service I did not think it went through so I did it again only to find out 20 minutes later I had topped up my friends phone 2 times."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jon Roberts",
          "Nb_Reviews": 5,
          "Date": "2018-02-04T17:30:04.000Z",
          "Titre": "TawagPinas works great",
          "Contenu": "TawagPinas works great. Currently it has the options for 300, 500 and 1000 peso loads for Smart and Globe that I've used. The do have 3 other options including Sun. The only reason why it's a 4 star rating and not 5 stars is I believe they should have a 50, 100 and 200 peso options too.Double check with you recipient that they got the load."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Dominic Bobiles",
          "Nb_Reviews": 1,
          "Date": "2017-02-11T08:26:56.000Z",
          "Titre": "Good",
          "Contenu": "I would like to share that my first time to use tawagpinas is a little complicated beacuse of the delayed reload but now i like it because they improve already, but one thing i can suggest is why you dont have any percent discount, i am buying every month but until now you dont have any discount to your costumers, Thank you for your service and Good luck!"
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Philip Thompson",
          "Nb_Reviews": 2,
          "Date": "2017-01-11T08:35:33.000Z",
          "Titre": "Good site. App needs a quick load feature.",
          "Contenu": "The tawagpinas com website works great.I tried the Android app, but it only allowed me to buy talk time, and I don't really use my phone for that. I just want to load my sim card. (The phone is my Internet modem.) I'd like the app to show me a list of my usual transactions and let me say This number, This amount, This credit card, boom, done."
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "RUDY",
          "Nb_Reviews": 10,
          "Date": "2017-06-27T15:13:02.000Z",
          "Titre": "This is a great way to sent load to …",
          "Contenu": "This is a great way to sent load to your love ones in the Philippines. Just one simple advise, if you are paying with PayPal, pay attention they don't ask confirmation. This is good to know so you don't have the same I had. I thought a confirmation would be asked so I tried to sent load many times. My wife get it also several times."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rem",
          "Nb_Reviews": 2,
          "Date": "2018-05-16T21:35:27.000Z",
          "Titre": "I like the fact that you don't need a…",
          "Contenu": "I like the fact that you don't need a code to call just dial the country code and number you are calling.Reception is clear.I just don't like that when your minutes is up.It warns you but it's at the end and hangs up immediately.It would be nice to warn you 1 minute away so you can end the conversation properly."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Dave",
          "Nb_Reviews": 6,
          "Date": "2015-01-06T13:31:50.000Z",
          "Titre": "Efficient service, simple to use",
          "Contenu": "Adds mobile phone credit in less than a minute. Easy payment by PayPal, but can use credit card. You need to know which network the mobile number is registered with. I once got this wrong, which became apparent to me when the process stuck on \"Pending\". I emailed TawagPinas and it was promptly sorted out. Only downside to TawagPinas is the cost, poor exchange rate plus a handling fee. But it works well so I use it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shadd Lassuy",
          "Nb_Reviews": 1,
          "Date": "2015-01-10T01:37:31.000Z",
          "Titre": "Like it for the most part - couple of suggestions",
          "Contenu": "I have a couple of friends and a fiance in the Philippines.  I send load to their phones frequently.  I love that I have one single site that can do the 3 major cell carriers in Phil.  But the biggest problem that I have is that I sometimes make a mistake as to which carrier the number belongs to.  It would be so much more convenient if the number verification process also verified the carrier.  When I make a mistake it takes days for the process to fail and then finally refund to my account."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Cesar Chan",
          "Nb_Reviews": 6,
          "Date": "2018-03-31T21:52:47.000Z",
          "Titre": "Great and awesome",
          "Contenu": "Great and awesome! I got few issues before like calls not going through and at the same time being charged a minute or 2 for dropped calls and slow connection. But overall, I like Tawag Pinas for being available when I needed to call some relatives or friends in the other side of the globe."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William Matthews",
          "Nb_Reviews": 1,
          "Date": "2016-01-19T10:48:53.000Z",
          "Titre": "Dropped calls",
          "Contenu": "Sometimes the calls get dropped and my wife and I think it would be much better to have a phone number to call about the issue rather than submitting a \"ticket\" via the webpage. The response time to provide credit for dropped calls is pretty quick though, but we would rather talk to a live person."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John W",
          "Nb_Reviews": 1,
          "Date": "2017-01-01T18:53:22.000Z",
          "Titre": "NO HIDDEN FEES",
          "Contenu": "If you have used calling card types services  before, you know this is where the company robes you, all the other wording is just hype to get you to buy. TawagPinas is great and has no hidden fees and therefore your dollars go further so you can talk longer to those who you love. Thanks TawagPinas"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Denis Tremblay",
          "Nb_Reviews": 2,
          "Date": "2019-08-08T20:33:52.000Z",
          "Titre": "I been using this app since months now…",
          "Contenu": "I been using this app since months now It is very good and cheap to make phone calls, I call in China every day and it works ok except some I lost the communication I call back than it works it maybe not the app it self it can be cause by the network in China, I recommend"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Confusedpinay",
          "Nb_Reviews": 1,
          "Date": "2015-03-29T02:37:31.000Z",
          "Titre": "Good value, reliable connection.",
          "Contenu": "I've been using TawagPinas for a few months now. For the most part the calls are decent. Sometimes, I can hear an echo. I can always connect with my loved ones in the Philippines. The rates are very reasonable. It is very easy to buy more minutes. My whole family in the U.S. is now using TawagPinas."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Darwin Belleza",
          "Nb_Reviews": 1,
          "Date": "2015-07-23T05:37:23.000Z",
          "Titre": "USA to PHILIPPINES",
          "Contenu": "I was really amazed when I first search an online site about \"cheapest call rate/idd from USA to Philippines. It was good and worth it. But I hope if we users purchase voice credit often times we gonna have discounts or incentives so that we can have more time to talk with our family. 😊"
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2020-01-29T06:57:23.000Z",
          "Titre": "I’ve used tawag pinas for a long time…",
          "Contenu": "I’ve used tawag pinas for a long time now and really love the serve. I give it 4/5 stars only because the service charge is way more than it should cost when dealing in Philippine currency. Cut the service charge in half and I would rate 5/5."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eve Vasquez",
          "Nb_Reviews": 1,
          "Date": "2020-05-03T14:47:32.000Z",
          "Titre": "Cheap phone cards",
          "Contenu": "Sometimes site is unavailable and when you are talking to someone on the phone there are several times you get a weird sound ( noise) and then you get disconnected.Otherwise its good ,it's cheap,it's a plus.Thank You."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Lilia Erandio",
          "Nb_Reviews": 1,
          "Date": "2015-02-14T08:47:49.000Z",
          "Titre": "easycall",
          "Contenu": "it is a low cost, easy call that helps a lot to call loved ones in the Philippines , even though sometimes got static  and sorry to say, seldom happens that we are not heard by our contact. Anyway, it is highly recommended way of vommunication."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Darren",
          "Nb_Reviews": 2,
          "Date": "2016-02-04T08:35:21.982Z",
          "Titre": "Does what I expect.",
          "Contenu": "I make 2 to 3 calls per week to the Philippines, this app provides average call quality with only a split second delay. The rates are way lower than any package or PPM rates I could get from AT&T. Plus I get to refill with PayPal."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "erlinda pallones",
          "Nb_Reviews": 1,
          "Date": "2015-07-31T09:33:48.000Z",
          "Titre": "access number",
          "Contenu": "Experienced good quality conversations during calls but lately I have been hearing voice intervention of access number in the middle of conversations saying that the number I called is not responding thus ending the call prematurely."
        },
        {
          "Note": 4,
          "Lieu": "TH",
          "Pseudo": "Phillip",
          "Nb_Reviews": 20,
          "Date": "2020-07-29T18:43:47.000Z",
          "Titre": "Service & speed are excellent but....",
          "Contenu": "Service & speed are excellent, but your charges/exchange rate needs improvement, 500 pesos equals £7.84 official rate, but you chasrge £10.15 including your charges, a difference of nearly 30%"
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Rachel U",
          "Nb_Reviews": 4,
          "Date": "2019-12-20T07:39:00.000Z",
          "Titre": "Great thing to call Pinas",
          "Contenu": "Great thing there is tawag pinas, I can call anytime in the Philippines with good quality of communications and I think it's more affordable it's rate per minute so it's interesting."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Marco",
          "Nb_Reviews": 2,
          "Date": "2017-10-30T20:15:45.000Z",
          "Titre": "Good service",
          "Contenu": "Good service..sometimes not so good  with the calls made through the local numbers  but much more good  with calls made from cellphone  through internet..always good for sending SMS..it is ok for my needs"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Maria Batino",
          "Nb_Reviews": 6,
          "Date": "2022-01-03T06:09:14.000Z",
          "Titre": "Easy way send load to family back home."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Bradley Francis",
          "Nb_Reviews": 1,
          "Date": "2019-04-27T09:59:56.000Z",
          "Titre": "I'm very happy with TawagPinas but…",
          "Contenu": "I'm very happy with TawagPinas but sometimes you get interrupted by a voice recording a few times when making a phone call .It's ok but it is a big phone number to ring the Philipines,"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joyce Daba",
          "Nb_Reviews": 1,
          "Date": "2015-01-18T09:05:22.000Z",
          "Titre": "Very good service.",
          "Contenu": "TawagPinas caters to my needs in getting connected to the people back home. It has a reliable and quick loading system that allows me to call home at once. I am satisfied with their service thus far. :-)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "PiSnoopy",
          "Nb_Reviews": 7,
          "Date": "2017-12-20T11:48:47.000Z",
          "Titre": "no recourse",
          "Contenu": "The service is great, but if you load the wrong number, you lose your money. File a complaint with your bank it's the Only way to get your money back. Otherwise love the ease and use of the service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Josephine Harding",
          "Nb_Reviews": 1,
          "Date": "2019-02-23T16:53:17.000Z",
          "Titre": "Sometimes it was clear voice to hear…",
          "Contenu": "Sometimes it was clear voice to hear when I called  my family from other countries. Seems like there to close, but whenever I call hoping that we heard pretty good so that we can talk more."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ricardo Sumayao",
          "Nb_Reviews": 1,
          "Date": "2018-08-19T03:48:46.000Z",
          "Titre": "comment",
          "Contenu": "I have no complains about the service. My only concern is pricing, you are actually buying my dollar for 42 php when the exchange rate if I send money to the Philippines is around php 52.00"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Randall Plumb",
          "Nb_Reviews": 2,
          "Date": "2018-09-20T16:44:01.000Z",
          "Titre": "This is a good way of calling…",
          "Contenu": "This is a good way of calling international. Easy to use. I did notice that my credit disappeared even when I had not connected with the individual that I was calling. That is not good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kat M",
          "Nb_Reviews": 2,
          "Date": "2018-06-28T22:39:27.000Z",
          "Titre": "The first time I called my parents who…",
          "Contenu": "The first time I called my parents who are currently in Asia through tawag pinas  was not too bad. Though the reception was not so clear. I hanged up and dialed again. Then it was okay."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "GM",
          "Nb_Reviews": 1,
          "Date": "2019-06-03T17:00:41.000Z",
          "Titre": "It's very easy to use and to load…",
          "Contenu": "It's very easy to use and to load money. Also very quick response when I requested the call details beyond the 30-days that shows on my account. Quite happy with this service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lewis",
          "Nb_Reviews": 6,
          "Date": "2017-04-19T21:51:59.000Z",
          "Titre": "Nice price but sometimes connects to a wrong number",
          "Contenu": "Nice price, signal is usually pretty good, but...on several calls it has connected me to someone else in a different country than the Philippines, so I hang up and lose money :-(Reply from TawagPinas.comPublished 33 hours agoHello,Thank you for your feedback! Our service will always connect you to the number you dial, so please make sure you dial the number you want to reach correctly and in international format.Your TawagPinas teamREPLY TO TAWAGPINAS TEAM:NO, your service does not always connect me to the number I dial, 4 times now I have been connect to a man speaking arabic, and he is not in the Philippines. The number I always use is programmed as speed dial in your app.Otherwise, the service works well and I am very satisfied with the calls that do connect properly.Thanks"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Maurice Hayter",
          "Nb_Reviews": 5,
          "Date": "2018-02-15T21:04:11.000Z",
          "Titre": "Great service with good call costs",
          "Contenu": "Great service with good call costs. Sometimes call quality is poor with constant drop-outs. Find this is normally to remote areas of the Asian countries that I phone."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wilma Gizowski",
          "Nb_Reviews": 1,
          "Date": "2018-09-13T13:50:02.000Z",
          "Titre": "Tawag Pinoy Trust Pilot",
          "Contenu": "Tawag Pinoy Trust Pilot,Yes, your services to me was very good thank you that my daughter Menji Schroeder recommended you to me. Thanks a lot. Wilma Gizowski"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Tina63",
          "Nb_Reviews": 2,
          "Date": "2019-04-10T07:38:26.000Z",
          "Titre": "Great app.",
          "Contenu": "It's easy to use. I have good experience so far, though I'm still looking for a cheaper calls to the Philippines as I believe, there is one out there."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer from Philadelphia",
          "Nb_Reviews": 9,
          "Date": "2018-11-13T13:02:45.000Z",
          "Titre": "TawagPinas.com is great",
          "Contenu": "TawagPinas.com is great. I will continue to use it. I just noticed that sometimes it is a kind of hard to connect. Nevertheless, the price is reasonable."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "Anabelle H",
          "Nb_Reviews": 3,
          "Date": "2021-10-08T11:59:44.000Z",
          "Titre": "Fast ang and convenient 👍",
          "Contenu": "Fast and convenient 👍"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Neth",
          "Nb_Reviews": 1,
          "Date": "2017-10-04T04:04:13.000Z",
          "Titre": "For us the rate is still expensive per …",
          "Contenu": "For us the rate is still expensive per minute for Philippines. We’re hoping it will be less than that soon.  Also sometimes our call cannot go through."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Charles Arthur",
          "Nb_Reviews": 8,
          "Date": "2019-10-03T17:14:52.000Z",
          "Titre": "Only one thing",
          "Contenu": "There is only one thing that could be done more by TawagPinas. That would be to allow free calls between TawagPinas members. Such as Skype does."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Charles Arthur",
          "Nb_Reviews": 8,
          "Date": "2019-05-02T12:08:49.000Z",
          "Titre": "They do everything I want done at a…",
          "Contenu": "They do everything I want done at a fantastic price. Only a very minor thing that they don't have bit it is insignificant. They're great!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Paul Anthony",
          "Nb_Reviews": 2,
          "Date": "2021-01-01T18:26:25.000Z",
          "Titre": "No problems with transfer",
          "Contenu": "No problems with transfer, it is quick. But I do think charges are too high. Because the exchange rate is low so why make extra on it."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Corazon Taylor",
          "Nb_Reviews": 1,
          "Date": "2020-02-11T10:48:31.000Z",
          "Titre": "It was good talking to my brother there…",
          "Contenu": "It was good talking to my brother, there was no problem, the voice is clear. It did not take long to connect it's good.ThankyouCorazon"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "John O'Connell",
          "Nb_Reviews": 7,
          "Date": "2021-03-01T16:33:15.000Z",
          "Titre": "Happy with this reliable service",
          "Contenu": "Happy with this reliable service. But i get charged a 60cent overseas transaction fee from my bank when i recharge my phone credit."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Felipe Odulio",
          "Nb_Reviews": 2,
          "Date": "2017-11-29T00:58:05.000Z",
          "Titre": "Saves me time going to the mall to buy …",
          "Contenu": "Saves me time going to the mall to buy phonecards. I don't lose money from unused minutes. Easy to load.But sometimes I get call drops."
        },
        {
          "Note": 4,
          "Lieu": "AT",
          "Pseudo": "Asim Reza Shah",
          "Nb_Reviews": 3,
          "Date": "2016-01-01T16:00:28.136Z",
          "Titre": "Finally it worked",
          "Contenu": "Nice that after short time i can edit my review.\rIt started with problems but the support did help out after some time.\rWould use it again."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "felina hayes",
          "Nb_Reviews": 7,
          "Date": "2021-01-27T07:42:20.000Z",
          "Titre": "It’s so handy wherever I am I can just…",
          "Contenu": "It’s so handy wherever I am I can just call abroad without hassle, I think it’s a little expensive compared to some provider."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Maribell Jackson",
          "Nb_Reviews": 19,
          "Date": "2017-02-01T11:54:52.000Z",
          "Titre": "Good",
          "Contenu": "the credit arrive quick straight away.didnt get any problem. it would be nice if you give some promos and bonus credit for a loyal consumer"
        },
        {
          "Note": 4,
          "Lieu": "JE",
          "Pseudo": "Alan Richardson",
          "Nb_Reviews": 4,
          "Date": "2020-12-09T16:31:34.000Z",
          "Titre": "Easy to use",
          "Contenu": "I have used this company for about five years and I am full of praise for the ease of use and the speed of delivery."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "Shinya Sasaki",
          "Nb_Reviews": 1,
          "Date": "2018-10-10T14:04:19.000Z",
          "Titre": "English is not easy for me",
          "Contenu": "My English skill is poor. But they care me kindly. Im very happy. So I will order again soon. Thank you soo much. See you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cheery Walz",
          "Nb_Reviews": 1,
          "Date": "2018-04-11T04:04:37.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use, once you have an account you can reload minutes anytime. The access number is local so there’s no extra charge"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "LUDWIN BARBIN",
          "Nb_Reviews": 3,
          "Date": "2017-10-23T22:41:23.000Z",
          "Titre": "website is easy to use.",
          "Contenu": "website is easy to use.The phone calls are clear although sometimes experiencing dropped calls and noise during the call."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "N-A",
          "Nb_Reviews": 2,
          "Date": "2016-10-13T03:07:30.000Z",
          "Titre": "Phone Card Access",
          "Contenu": "The reason I keep using TawagPinas is because it is very user friendly. It is also easy to add more minutes to your account."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Michael Cornish",
          "Nb_Reviews": 10,
          "Date": "2016-07-14T09:15:33.000Z",
          "Titre": "Reasonably good experience",
          "Contenu": "Used to top up mobile phone for a friend. Bit expensive, but in emergency it's worth trying this site if all else fails"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christie Ong",
          "Nb_Reviews": 1,
          "Date": "2015-07-04T14:15:48.497Z",
          "Titre": "Clear calls and reliable minutes",
          "Contenu": "Easy purchase on my mobile, the calls I make are clear, no drop calls, reasonable prices and minutes. Will purchase again."
        },
        {
          "Note": 4,
          "Lieu": "KY",
          "Pseudo": "Revelino Coutinho",
          "Nb_Reviews": 1,
          "Date": "2020-04-29T01:59:41.000Z",
          "Titre": "Thank You !!",
          "Contenu": "didn’t knw that this would be helpful to reach out to my friends who are so much in need of cash Thank you team."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "reynaldo",
          "Nb_Reviews": 6,
          "Date": "2019-04-01T16:44:51.000Z",
          "Titre": "Great call",
          "Contenu": "Good enough, when calling far from Manila like Ilocos Region signal is chappy or static even though it is land line"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joel Lopez",
          "Nb_Reviews": 1,
          "Date": "2021-03-25T12:35:45.000Z",
          "Titre": "Is there a possibility that you can…",
          "Contenu": "Is there a possibility that you can remind us that there is 5 mins left instead of just cutting the line?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ronald Labayen",
          "Nb_Reviews": 2,
          "Date": "2018-12-23T13:04:20.000Z",
          "Titre": "Very Good Service But Rate Could Be Better",
          "Contenu": "Clear and crisp voice at the other end of the line. But I wish the rate per minute is lower than their competitors."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer from Philadelphia",
          "Nb_Reviews": 9,
          "Date": "2018-03-16T11:22:27.000Z",
          "Titre": "I will continue to use TawagPinas",
          "Contenu": "Sometimes I could hear echoes and sometimes it is hard to connect. Nevertheless, I will continue to use TawagPinas."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrew Hunter",
          "Nb_Reviews": 4,
          "Date": "2020-02-04T07:09:29.000Z",
          "Titre": "recommended.",
          "Contenu": "a real place that doesn't charge you for something and do nothing, A little higher priced but worth it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "GREG",
          "Nb_Reviews": 4,
          "Date": "2019-04-11T02:43:39.000Z",
          "Titre": "A little expensive but very reliable I…",
          "Contenu": "A little expensive but very reliable I have been using this for years and it always gives me good reception."
        },
        {
          "Note": 4,
          "Lieu": "TH",
          "Pseudo": "Phillip",
          "Nb_Reviews": 20,
          "Date": "2019-12-04T17:46:52.000Z",
          "Titre": "Very easy to use",
          "Contenu": "Had a small problem on the first transaction, but since then a really fast and trouble-free experience."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "helen  grace bambalan",
          "Nb_Reviews": 3,
          "Date": "2020-12-23T12:47:30.000Z",
          "Titre": "good,fast and clear when i called…",
          "Contenu": "good,fast and clear when i called philippine but the problem is a little bit expensive your loads."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gie",
          "Nb_Reviews": 3,
          "Date": "2019-03-30T14:08:57.000Z",
          "Titre": "Connection is excellent but several…",
          "Contenu": "Connection is excellent but several times recently it is dialing incorrectly and was told it was on me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "toolani user",
          "Nb_Reviews": 4,
          "Date": "2020-04-11T01:15:20.000Z",
          "Titre": "TawagPinas does exactly what I expect",
          "Contenu": "TawagPinas does exactly what I expect, it's simple to use.  They have gained my complete trust."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Denis Murray",
          "Nb_Reviews": 8,
          "Date": "2016-04-26T03:19:14.000Z",
          "Titre": "good overall",
          "Contenu": "I am just buying load for friends in the Philippines. There is nothing else to say. It works ok. Thanks"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "craig wallyn",
          "Nb_Reviews": 2,
          "Date": "2019-08-14T05:18:46.000Z",
          "Titre": "Once registered everytime I used became…",
          "Contenu": "Once registered everytime I used became quick and easy to send data and load to friends and family"
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Charles Arthur",
          "Nb_Reviews": 8,
          "Date": "2021-03-10T08:21:55.000Z",
          "Titre": "The only issue is not receiving text or…",
          "Contenu": "The only issue is not receiving text or calls with Tawag Pinas. Otherwise it works great!"
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Marcel",
          "Nb_Reviews": 1,
          "Date": "2016-03-25T07:58:03.000Z",
          "Titre": "service/price, it is good",
          "Contenu": "service/price, it is good\rBut I cannot use it with Google Chrome \rI have to use it with IE only ?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "reynaldo",
          "Nb_Reviews": 6,
          "Date": "2020-08-14T05:52:33.000Z",
          "Titre": "Great for international call especially…",
          "Contenu": "Great for international call especially Philippines, use it many times for 5 years already"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven D.",
          "Nb_Reviews": 5,
          "Date": "2023-12-02T17:15:42.000Z",
          "Titre": "No problems",
          "Contenu": "I never have a problem with this service, it is usually very fast, and does what it says it will do"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jeane Clements",
          "Nb_Reviews": 3,
          "Date": "2022-09-01T18:23:42.000Z",
          "Titre": "Used For Six Years... Great Quality And Value",
          "Contenu": "We have been using KeepCalling (TawagPinas) for the last six years to phone the Philippines from the UK. We have always been impressed by the quality of the calls and their pricing. Occasionally I do check around to see if there are any cheaper deals, and when they are available we do try them out, but the call quality always seems to suffer and we end up going back to KeepCalling. I cannot recommend this calling service highly enough."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Maurice Richard Hayter",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T11:58:52.000Z",
          "Titre": "Phone loads",
          "Contenu": "Easy to use website. Good prices for phone loads.Super fast delivery."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Roberto Garrone",
          "Nb_Reviews": 5,
          "Date": "2021-12-18T17:38:47.000Z",
          "Titre": "Easy and quick load service",
          "Contenu": "Most if not all of the telco operators are available; payment is double checked against credit card fraudsters and invoice is sent after few minutes the load has been delivered. The higher commissions are well deserved. Fully satisfied"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Charles Arthur",
          "Nb_Reviews": 8,
          "Date": "2022-11-02T15:25:42.000Z",
          "Titre": "Good experience",
          "Contenu": "I've been using Tawag Pinas for several years. Mostly to keep in contact with Philippine family. Never had any problems. Fast clear connections at low cost. Top notch."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LQ",
          "Nb_Reviews": 1,
          "Date": "2021-04-19T00:44:36.000Z",
          "Titre": "Never disappointed",
          "Contenu": "I was able to reached the intended party right away. Communicated the purpose of my call with no interruptions. Phone lines were clear. My time wasn’t wasted. I’ve been using Tawag Pinas to place important international calls to the Philippines. They never disappointed me."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Cesar Chan",
          "Nb_Reviews": 6,
          "Date": "2021-09-09T01:55:32.000Z",
          "Titre": "Awesome Rewards!",
          "Contenu": "Sometimes calls are clear and sometimes choppy. Call drops are becoming common using TawagPinas. Calling TawagPinas representative can be a convenient option since their representatives can resolve drop calls, usually giving some credit in my account in the event of drop calls. The good thing about this is that TawagPinas gives me the rewards for the purchases and calls made. This is an awesome plus for those using TawagPinas."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Mark Schafferius",
          "Nb_Reviews": 5,
          "Date": "2023-06-25T02:16:37.000Z",
          "Titre": "Easy load top up for my friend in…",
          "Contenu": "Easy load top up for my friend in Phillipines. Had a small problem that resulted in refund. No issues of refund. A trusted Company that I will continue to deal with 😊"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hanz",
          "Nb_Reviews": 1,
          "Date": "2022-06-13T14:29:46.000Z",
          "Titre": "Tawag Pinas is the best!",
          "Contenu": "This is an amazing away to help a friend back on Philippines. I appreciate for having this app and I’d recommend people to use this more often when sending a top-up on Philippines. It’s a also safe and secure."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ken C",
          "Nb_Reviews": 3,
          "Date": "2023-06-26T22:32:32.000Z",
          "Titre": "Fast and Easy!",
          "Contenu": "It's fast, easy and simple once you get your account set up.   TawagPinas is now my \"go to\" resource for sending loads to friends in the Philippines."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dennis Paskel",
          "Nb_Reviews": 3,
          "Date": "2021-05-24T16:15:12.000Z",
          "Titre": "My wife and children still live in the…",
          "Contenu": "My wife and children still live in the Philippines since my I'll health kept me from returning to them. And TawagPinas, program is one of the best ways to charge their phone and internet"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Beth Franklin",
          "Nb_Reviews": 5,
          "Date": "2022-02-15T12:46:11.000Z",
          "Titre": "I still want to be able to the U S A or…",
          "Contenu": "I still want to be able to the U S A or anywhere in the world !!  How do I do it, direct dialing plus OFFLINE mode.. Wi-fi/internet connections here in Pinas sucks!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rio Acosta",
          "Nb_Reviews": 2,
          "Date": "2022-10-18T09:27:01.000Z",
          "Titre": "easy connection, reliable access.",
          "Contenu": "very reliable connection, easy call. however, experience few minuets of speed lag where voice was gargled. might not be tawagPinas fault but signal deterioration due to bad weather or excessive line usage..."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Rita",
          "Nb_Reviews": 8,
          "Date": "2021-05-06T17:49:21.000Z",
          "Titre": "Quick and straightforward",
          "Contenu": "I have been using Tawagpinas phone card for a few years now to call my parents in the Philippines and quite happy about it although sometimes I’m having difficulty to connect but otherwise topping up credits is so straightforward and quick. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gayle",
          "Nb_Reviews": 7,
          "Date": "2023-02-02T22:26:19.000Z",
          "Titre": "Highly Recommended",
          "Contenu": "Ive been a customer of tawagpinas.com for over ten years and they are very dependable. I can quickly send mobile loads to my relatives in the Philippines"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 11,
          "Date": "2022-04-13T21:25:04.000Z",
          "Titre": "Called about how long money can wait to…",
          "Contenu": "Called about how long money can wait to be picked up,because of the Leute flooding. The representative was helpful and concise. My question answered quickly."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Phil Hopkins",
          "Nb_Reviews": 6,
          "Date": "2023-09-16T11:49:42.000Z",
          "Titre": "Quick and convenient way to recharge…",
          "Contenu": "Quick and convenient way to recharge friends phones . I would recommend to anyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fred",
          "Nb_Reviews": 2,
          "Date": "2021-12-03T23:51:48.000Z",
          "Titre": "They have always come through for me…",
          "Contenu": "They have always come through for me without zero problems:  receiving or sending...  and their rates are competitive or better!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rhea",
          "Nb_Reviews": 5,
          "Date": "2021-07-30T05:53:43.000Z",
          "Titre": "I love this service",
          "Contenu": "I love this service. Been using it for a couple of years now to call my family in philippines. Affordable and great for areas with no wifi signals like the provinces. Highly recommended"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Beth Franklin",
          "Nb_Reviews": 5,
          "Date": "2021-10-08T01:07:09.000Z",
          "Titre": "Very satisfied with  service",
          "Contenu": "Very satisfied with  service.   Love the provision where the remaining balance is there when needed or as needed only...excellent provision. Thanks"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Vance",
          "Nb_Reviews": 1,
          "Date": "2023-04-02T15:17:26.000Z",
          "Titre": "Very easy interface",
          "Contenu": "It was quite easy to use and the additional fact that I could send a message to the person that I'm topping up made it really effective."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BUKSAR/MICHAEL S",
          "Nb_Reviews": 7,
          "Date": "2022-02-27T11:18:44.000Z",
          "Titre": "I am very pleased with Tawag Pinas because of fast refills.",
          "Contenu": "I am very pleased with Tawag Pinas! They have quick online refills and excellent sound quality. I would recommend them to everyone!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marites Fullmer",
          "Nb_Reviews": 1,
          "Date": "2022-02-02T07:34:49.000Z",
          "Titre": "I've been using TawagPinas to call my…",
          "Contenu": "I've been using TawagPinas to call my family in Quezon City. All the calls were cleared and minutes per dollar is reasonable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay Brook",
          "Nb_Reviews": 6,
          "Date": "2021-05-23T13:33:08.000Z",
          "Titre": "Great service & customer service",
          "Contenu": "Great service & customer service.  I, personally think the fees are a little high, but definitely NOT as ridiculously high - as some of the other services/websites are almost criminal for their fees."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lynn Schallmoser",
          "Nb_Reviews": 2,
          "Date": "2023-06-09T04:57:19.000Z",
          "Titre": "Tawag pinas is the best service I ever…",
          "Contenu": "Tawag pinas is the best service I ever had.. quick response & legit service.. I will recommend to all..Thanks,Lynn"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "RAMAN ganapathy",
          "Nb_Reviews": 4,
          "Date": "2022-07-19T08:02:11.000Z",
          "Titre": "I have been using Tawagpinas",
          "Contenu": "I have been using Tawagpinas. I find it a very reliable medium for recharge of mobile phones in Philippines. Very fast and helpful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Judith Pail",
          "Nb_Reviews": 2,
          "Date": "2022-11-16T11:00:22.000Z",
          "Titre": "Clear connection",
          "Contenu": "Clear connection. Reliable service. Been using TawagPinas for years. Also, I use this when I travel to Philippines."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Graham Osbourne",
          "Nb_Reviews": 17,
          "Date": "2021-07-26T18:54:15.000Z",
          "Titre": "Great app to use easy and simple the…",
          "Contenu": "Great app to use easy and simple the loads sent within seconds for the recipient to use.I've never had any problems using it at all"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "David",
          "Nb_Reviews": 5,
          "Date": "2021-07-21T20:42:06.000Z",
          "Titre": "I think this is the best site for…",
          "Contenu": "I think this is the best site for putting a load on a phone in the Philippines. Always been fast at transferring the load to the other person phone"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maria Batino",
          "Nb_Reviews": 6,
          "Date": "2023-02-13T01:16:56.000Z",
          "Titre": "All I can say is five star!..",
          "Contenu": "All I can say is five star!... I wish have promo in purchasing loads. I purchased loads most of time for my loveones in the Philippines..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AxeHandle",
          "Nb_Reviews": 1,
          "Date": "2023-02-07T18:34:53.000Z",
          "Titre": "Great site and a very important tool I…",
          "Contenu": "Great site and a very important tool I use to make sure my wife always has enough load on her mobile."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leonardo Flores",
          "Nb_Reviews": 4,
          "Date": "2023-02-04T14:54:51.000Z",
          "Titre": "Loading",
          "Contenu": "It is accessible and fast to do what I want - particularly loading which I always do for my family in the Philippines. Awesome!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Constancio Buhia",
          "Nb_Reviews": 1,
          "Date": "2022-09-29T06:53:25.000Z",
          "Titre": "A very convenient way off calling…",
          "Contenu": "A very convenient way of calling overseas..call with ease knowing that funds are automatically loaded for continuity"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Charles Arthur",
          "Nb_Reviews": 8,
          "Date": "2021-08-15T07:05:17.000Z",
          "Titre": "I've had nothing but top notch…",
          "Contenu": "I've had nothing but top notch performance from TawagPinas for several years. Very reliable. Good connections. Good prices."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BUKSAR/MICHAEL S",
          "Nb_Reviews": 7,
          "Date": "2021-09-03T12:00:49.000Z",
          "Titre": "Very high quality sound on a phone…",
          "Contenu": "Very high quality sound on a phone call. Quick order fulfillment online when you run out of airtime."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer from Philadelphia",
          "Nb_Reviews": 9,
          "Date": "2022-06-17T17:35:08.000Z",
          "Titre": "The representative was extremely…",
          "Contenu": "The representative was extremely helpful and was able to complete what I needed to do, the very reason why I called. The representative understood what needed to be done."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Rein Ross",
          "Nb_Reviews": 8,
          "Date": "2021-07-22T13:05:47.000Z",
          "Titre": "Great service",
          "Contenu": "Great service, easy and the recipient gets their load very quickly.It can be used for educational modules."
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Wojciech Kotkowski",
          "Nb_Reviews": 1,
          "Date": "2021-06-15T09:58:28.000Z",
          "Titre": "So awesome easy re-loads a lot for…",
          "Contenu": "So awesome easy re-loads a lot for Philippines and overseas, so excellent!! Thank yooooou very much 🙏❤😊💖"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gemma Graham",
          "Nb_Reviews": 7,
          "Date": "2021-12-01T01:25:20.000Z",
          "Titre": "I have been using this app for over 4…",
          "Contenu": "I have been using this app for over 4 years now. The call is clear and it saves me money. I don't need to add for international calls with my current mobile plan."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dominador",
          "Nb_Reviews": 2,
          "Date": "2023-10-04T17:33:27.000Z",
          "Titre": "It helps me a lot in sending load to CP…",
          "Contenu": "It helps me a lot in sending load to CP in the Philippines"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Apple Jobs",
          "Nb_Reviews": 3,
          "Date": "2022-07-23T14:17:05.000Z",
          "Titre": "Easy and Convenient to Load Mobile Data and Calls",
          "Contenu": "Wife n Kids in Philippines. I load my wife 20 GB of data from the UK using Tawag Pinas website. Very pleased, as is my wife. I've used the service about three times and everything is fine. Good service and low costs. 5 stars"
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "RAMADAN BAHARI",
          "Nb_Reviews": 5,
          "Date": "2021-07-02T09:59:42.000Z",
          "Titre": "Have been using TawagPinas for over a…",
          "Contenu": "Have been using TawagPinas for over a year now .. so far so good .. they have been excellent and doing a great job ... Very trustworthy Thank you !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ZV",
          "Nb_Reviews": 1,
          "Date": "2021-04-01T13:29:47.000Z",
          "Titre": "Been using Tawagpinas for number of…",
          "Contenu": "Been using Tawagpinas for number of years now and I've been very please with their service. The call is always very clear."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Daniel Isahardworker",
          "Nb_Reviews": 5,
          "Date": "2023-06-12T07:59:12.000Z",
          "Titre": "Reliable service that makes loading…",
          "Contenu": "Reliable service that makes loading credit to a foreign phone easy for me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wade Lewis",
          "Nb_Reviews": 4,
          "Date": "2021-05-31T05:07:53.000Z",
          "Titre": "Outstanding price and voice quality…",
          "Contenu": "Outstanding price and voice quality weather land line or cell. This is calling made easy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gayle",
          "Nb_Reviews": 7,
          "Date": "2023-10-10T00:21:47.000Z",
          "Titre": "very good service",
          "Contenu": "very easy to navigate and good service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "james lyons",
          "Nb_Reviews": 2,
          "Date": "2021-05-28T03:18:54.000Z",
          "Titre": "been using it for yeaars might be nicwe…",
          "Contenu": "been using it for years might be nie to get a little kiss after fve yeARS , BUT OTHER THAN THAT ITS GREAT"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Froilan Sayas",
          "Nb_Reviews": 4,
          "Date": "2021-09-07T03:17:15.000Z",
          "Titre": "Easy to access,and safe for credit…",
          "Contenu": "Easy to access,and safe for credit cards purchase, Lastly cheap and quick purchasing"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Cole",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T01:08:24.000Z",
          "Titre": "WERE VERY HELPFUL TO ME AS A NEW…",
          "Contenu": "WERE VERY HELPFUL TO ME AS A NEW CUSTOMER SENDING A RELOAD. VERY PROFESSIONAL FOR AMERICAN HELPING TO PHILIPPINES"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven D.",
          "Nb_Reviews": 5,
          "Date": "2023-07-31T17:33:10.000Z",
          "Titre": "This service is easy to use",
          "Contenu": "This service is easy to use, quick and so far seems to be very reliable"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Samuel Stephen Casili",
          "Nb_Reviews": 4,
          "Date": "2023-02-17T03:16:10.000Z",
          "Titre": "Best calling apps to call international…",
          "Contenu": "Best calling apps to call international 5 stars. Been using it 3 years"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "VIRGINIA TORRES",
          "Nb_Reviews": 1,
          "Date": "2022-12-30T14:20:14.000Z",
          "Titre": "Necessary",
          "Contenu": "Helps me reach my sister at the hospital because of online load"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mennen Serrato-Bautista",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T08:34:21.000Z",
          "Titre": "Very convinient to use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tania Revereza",
          "Nb_Reviews": 4,
          "Date": "2021-10-23T22:07:43.000Z",
          "Titre": "Great !!",
          "Contenu": "Great !! Thank you. I love to use TawagPinas. Easy, Clear and affordable calls worldwide..."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Lawrence Daher",
          "Nb_Reviews": 14,
          "Date": "2021-08-24T14:49:52.000Z",
          "Titre": "I have used TawagPinas for over a year…",
          "Contenu": "I have used TawagPinas for over a year and their service has always been fast and unproblematic."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luisa Bautista",
          "Nb_Reviews": 1,
          "Date": "2022-07-26T04:47:51.000Z",
          "Titre": "minutes is honestly count.",
          "Contenu": "minutes is honestly count.reception is very clearnot expensive"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harish Shah",
          "Nb_Reviews": 1,
          "Date": "2021-12-07T02:30:48.000Z",
          "Titre": "I find service excellent within second…",
          "Contenu": "I find service excellent within second I got confirmation of your servicePl keep it continue to your customer"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "reziel johnson",
          "Nb_Reviews": 1,
          "Date": "2021-08-28T17:33:24.000Z",
          "Titre": "Load balance was received by the…",
          "Contenu": "Load balance was received by the recipient right away. Fast service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stuart Saunders",
          "Nb_Reviews": 4,
          "Date": "2021-10-18T14:58:09.000Z",
          "Titre": "Best site for loading my GLOBE sim in…",
          "Contenu": "Best site for loading my GLOBE sim in the Philippines ....Thank God for this service ....."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Beth",
          "Nb_Reviews": 1,
          "Date": "2021-10-31T06:41:18.000Z",
          "Titre": "Happy Customer",
          "Contenu": "So easy to use & the rate per minute is affordable! I’m a happy customer! Thank you for the good service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lynn Schallmoser",
          "Nb_Reviews": 2,
          "Date": "2023-11-08T03:31:14.000Z",
          "Titre": "Super good service",
          "Contenu": "Super good service! Recommended to all."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Phillip Hancock",
          "Nb_Reviews": 1,
          "Date": "2022-03-06T00:31:26.000Z",
          "Titre": "Always had a very good experience…My girlfriend's Load",
          "Contenu": "Always had a very good experience sending my girlfriend recharge load & she always receives it within minutes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-05-27T07:08:48.000Z",
          "Titre": "I always use Tawag Pinas",
          "Contenu": "I always use Tawag Pinas. It’s easy to use and affordable."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Lex D",
          "Nb_Reviews": 4,
          "Date": "2022-12-04T21:42:42.000Z",
          "Titre": "Quick and easy to use.Convenient",
          "Contenu": "Quick and easy to use. Reliable and convenient. I  recommend it."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "RAMADAN BAHARI",
          "Nb_Reviews": 5,
          "Date": "2021-11-12T15:43:06.000Z",
          "Titre": "Been using this monthly .",
          "Contenu": "Been using this monthly .. fast and efficient .  Very safe and secure . Thank you ! :)"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Josefina Jimenez",
          "Nb_Reviews": 1,
          "Date": "2022-01-08T08:01:52.000Z",
          "Titre": "Calling the Philippines was easy",
          "Contenu": "Calling the Philippines was easy.  The reception was clear. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arturo Tan",
          "Nb_Reviews": 2,
          "Date": "2021-10-15T04:36:52.000Z",
          "Titre": "Always reliable and no issues when I…",
          "Contenu": "Always reliable and no issues when I make a call to the Philippines."
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "Mor Ashcroft",
          "Nb_Reviews": 1,
          "Date": "2021-04-27T20:06:56.000Z",
          "Titre": "No words to described my opinion.",
          "Contenu": "No words to described my opinion.great service and super easy !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 3,
          "Date": "2023-02-05T17:53:38.000Z",
          "Titre": "Quick and instant service",
          "Contenu": "Got my phone loaded right away. So fast even in a different country."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nelly",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T23:33:22.000Z",
          "Titre": "Very easy to use",
          "Contenu": "Very easy to use! No hustle, no fuss - just a pin and a finger and you're good!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "JIten Jiten",
          "Nb_Reviews": 1,
          "Date": "2022-08-11T09:11:34.000Z",
          "Titre": "well done i like the software and…",
          "Contenu": "well done i like the software and effortless to recharge"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BUKSAR/MICHAEL S",
          "Nb_Reviews": 7,
          "Date": "2021-05-02T09:57:24.000Z",
          "Titre": "Quick refill and good sound quality",
          "Contenu": "Quick refill and good sound quality! We enjoy using TawagPinas!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel McCaskill",
          "Nb_Reviews": 3,
          "Date": "2021-12-16T19:05:48.000Z",
          "Titre": "always easy and fast",
          "Contenu": "Been using this service for many years and always easy and fast!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer from Philadelphia",
          "Nb_Reviews": 9,
          "Date": "2021-11-14T17:08:46.000Z",
          "Titre": "I use Tawag Pinas if l need to call via…",
          "Contenu": "I use Tawag Pinas if l need to call via phone to the Philippines. Every single call goes well."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "cristalino gonçalves",
          "Nb_Reviews": 3,
          "Date": "2021-12-27T17:56:34.000Z",
          "Titre": "The best service",
          "Contenu": "I can always top up my relatives' cell phones"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 11,
          "Date": "2021-05-07T19:19:16.000Z",
          "Titre": "Always good if a problem does come up",
          "Contenu": "Always good if a problem does come up, a quick phone call and its fixed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "roger savard",
          "Nb_Reviews": 1,
          "Date": "2021-12-16T20:54:49.000Z",
          "Titre": "good and fast servece very reliable …",
          "Contenu": "good and fast servece very reliable  its besst i ever tryed in many years"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 3,
          "Date": "2021-09-24T05:20:33.000Z",
          "Titre": "This is service is great",
          "Contenu": "This is service is great. Easy to use and always dependable"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Kat",
          "Nb_Reviews": 1,
          "Date": "2021-08-10T05:13:21.000Z",
          "Titre": "Good",
          "Contenu": "Easy to use calling your love ones in the Philippines."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "kevin molloy",
          "Nb_Reviews": 1,
          "Date": "2022-08-08T14:27:43.000Z",
          "Titre": "very  fast and efficiant,easy to…",
          "Contenu": "very  fast and efficiant,easy to use,and at a fair rate"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Priscilla Maranan Javillo",
          "Nb_Reviews": 12,
          "Date": "2021-09-22T07:16:05.000Z",
          "Titre": "Very useful",
          "Contenu": "Very useful  and Straightforward  and happy with the way it works"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ronald Becker",
          "Nb_Reviews": 16,
          "Date": "2022-12-31T01:44:03.000Z",
          "Titre": "Best place to reload phone",
          "Contenu": "I always use this site to load my wifes phone in the Philippines. It is very easy"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Tom Galenzoski",
          "Nb_Reviews": 2,
          "Date": "2021-09-20T04:08:17.000Z",
          "Titre": "I've had no problems at all everything…",
          "Contenu": "I've had no problems at all everything goes smooth every time thank you very much"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carmelita Arellano",
          "Nb_Reviews": 2,
          "Date": "2021-06-16T11:03:03.000Z",
          "Titre": "Awesome",
          "Contenu": "Fast connection, no codes to dial, stable and clear calls! Awesome!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "sal r",
          "Nb_Reviews": 10,
          "Date": "2021-05-13T14:38:45.000Z",
          "Titre": "Great company to make calls with never…",
          "Contenu": "Great company to make calls with never a problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alecia",
          "Nb_Reviews": 1,
          "Date": "2022-01-13T03:00:55.000Z",
          "Titre": "It’s very convenient using this site",
          "Contenu": "It’s very convenient using this site. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "cristalino gonçalves",
          "Nb_Reviews": 3,
          "Date": "2021-07-29T23:22:23.000Z",
          "Titre": "Maganda website.",
          "Contenu": "Maganda website.Ako ay brasilian and recharge kaibigan cellphone online."
        },
        {
          "Note": 5,
          "Lieu": "NO",
          "Pseudo": "Brenda Virtudazo Tysnes",
          "Nb_Reviews": 1,
          "Date": "2022-02-02T15:12:10.000Z",
          "Titre": "fastest services",
          "Contenu": "fastest servicesim super contented for this page."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer from Philadelphia",
          "Nb_Reviews": 9,
          "Date": "2021-04-20T16:06:27.000Z",
          "Titre": "I like Tawag Pinas",
          "Contenu": "I like Tawag Pinas, the price is reasonable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arleen Arnal",
          "Nb_Reviews": 2,
          "Date": "2021-04-01T04:01:23.000Z",
          "Titre": "No hassle loading of additional call…",
          "Contenu": "No hassle loading of additional call hours, clear reception and user-friendly system."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J. S.",
          "Nb_Reviews": 1,
          "Date": "2022-12-27T02:44:00.000Z",
          "Titre": "Easy to load",
          "Contenu": "Easy to load, Easy to connect .Time won't start 'till it was answer No ripped off."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "David Gallienne",
          "Nb_Reviews": 7,
          "Date": "2023-05-07T10:00:59.000Z",
          "Titre": "Good clear",
          "Contenu": "Good clear, no delay ph connection!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay Brook",
          "Nb_Reviews": 6,
          "Date": "2021-10-10T01:35:14.000Z",
          "Titre": "ALWAYS quick",
          "Contenu": "ALWAYS quick, accurate service with never any issues with the service or quality."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fred Kohanek",
          "Nb_Reviews": 2,
          "Date": "2021-03-28T20:38:40.000Z",
          "Titre": "What I needed",
          "Contenu": "The provided me with exactly what I requested.   Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Minnesota",
          "Nb_Reviews": 2,
          "Date": "2021-05-29T15:46:31.000Z",
          "Titre": "I am a very satisfied customer",
          "Contenu": "I am a very satisfied customer - thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Avery",
          "Nb_Reviews": 2,
          "Date": "2022-01-20T15:24:55.000Z",
          "Titre": "Fast service always and at a good…",
          "Contenu": "Fast service always and at a good price. Thankyou!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tess",
          "Nb_Reviews": 2,
          "Date": "2021-05-26T12:46:00.000Z",
          "Titre": "Can rely to TAWAGPINAS to get hold of…",
          "Contenu": "Can rely to TAWAGPINAS to get hold of my family.  Thank you."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Lawrence Daher",
          "Nb_Reviews": 14,
          "Date": "2021-12-14T13:43:27.000Z",
          "Titre": "Quick",
          "Contenu": "Quick, almost instant service on overseas phone re-charges"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Reynaldo Tano",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T17:19:59.000Z",
          "Titre": "My request was acted right away!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RM",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T18:29:47.000Z",
          "Titre": "Excellent long distance phone card."
        }
      ]
    }
  ]
}