{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "techarmor.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brad Basham",
          "Nb_Reviews": 3,
          "Date": "2023-09-30T03:44:03.000Z",
          "Titre": "Never received my order."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T06:21:33.000Z",
          "Titre": "I paid for over night shipping and…",
          "Contenu": "I paid for over night shipping and didn’t get my order till 3 days after i ordered it"
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2023-01-03T23:26:06.000Z",
          "Titre": "Poor customer experience",
          "Contenu": "I placed an order but never received a confirmation email. My card was charged but I have no clue if the order actually went through."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Disappointed",
          "Nb_Reviews": 1,
          "Date": "2021-11-04T02:39:13.000Z",
          "Titre": "Profoundly disappointed",
          "Contenu": "Profoundly disappointed that I just ordered new iPhone 13 and reorder iPhone X ballistic glass only to then find 30% off emails in junk folder. Long term customer. Get their emails all the time. But that email goes to junk?! Really sucks!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Aaron b",
          "Nb_Reviews": 1,
          "Date": "2021-08-07T18:57:55.000Z",
          "Titre": "I ordered the tech armor for iPhone 12…",
          "Contenu": "I ordered the tech armor for iPhone 12 a whole week ago. I paid for the expedited shipping. I’ve been tracking my order. I gave the correct address. My order still has not arrived. I checked with the post office. I gave them the correct address, and they said the unit number was left off the address when it was shipped. I give the post office a couple days to process the change. I still have not received my order. I track the order today and see that it is in Texas. What? How is your shipping department so incompetent? I want your product, it is the best, I just don’t want the bs. Not sure if I am still going to bother after this fiasco."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-05-24T23:21:25.000Z",
          "Titre": "Usually these work great for me but…",
          "Contenu": "Usually these work great for me but this time, they cracked immediately after putting them on. Maybe I got a bad batch?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-16T02:40:44.000Z",
          "Titre": "I wish with (3pk  ballistic screen…",
          "Contenu": "I wish with (3pk  ballistic screen protectors Iphone mini 13)  2 would have been saved for future use I did not achieve a successful install tried 3 times with the same result. Get adhesive glue or something on corners which I have never experience before from TECH ARMOR SCREEN PROTECTORS I'm very disappointed with the  result  I have been a very loyal customer and supporter since TECH ARMOR first came on the market if only TECH ARMOR could do something to make it right ."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Adam Stringer",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T10:40:36.000Z",
          "Titre": "I haven’t received my product",
          "Contenu": "I haven’t received my product after quite a while, I still don’t have it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-03T23:25:13.000Z",
          "Titre": "I have not received my package"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "LubeMan",
          "Nb_Reviews": 3,
          "Date": "2021-07-05T20:37:22.000Z",
          "Titre": "Unusual and unacceptable shipping issue",
          "Contenu": "2 weeks on and I don’t have my product. Tech Armor’s courier has still not even confirmed they have received my item for shipping. Apology email from tech support blames the courier; not acceptable as the company picked them to do the work for their customers. It’s pretty lame to try to shift blame onto them. Can’t blame it on COVID issues, if that’s the case they need to modify their posted shipping times to reflect any problems they’re having. Support suggests I extend my patience. My patience is gone, though I have no other choice but to wait.(No thanks for the boilerplate response below. Note it does not actually address the major issues I broached.)"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jenny Parkinson",
          "Nb_Reviews": 24,
          "Date": "2019-09-02T23:27:17.000Z",
          "Titre": "Rubbish and left disappointed by their product",
          "Contenu": "I purchased the tech armor ballistic glass screen protector from Amazon uk for the iPhone XR. After purchasing the RKInc ones for other phones and finding them sold out I opted for the Tech Armor...big mistake.  The glass was compromised so wouldn’t adhere in that part to the phone leaving a 1cm size bubble.  One positive is that the fitting device is effective and they are fairly inconspicuous when on your phone, that is of course if they were without manufacturing defects.   These have been returned to amazon for a refund and I shall be keeping my eye out for the much cheaper and more effective RKInc ones.  Was going to purchase clear case but will opt for a different brand now..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "LEONARD ROSOFSKY",
          "Nb_Reviews": 1,
          "Date": "2022-08-15T02:45:54.000Z",
          "Titre": "Great service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "tq",
          "Nb_Reviews": 3,
          "Date": "2022-01-06T16:13:42.000Z",
          "Titre": "have yet to receive the product"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-07-09T21:17:58.000Z",
          "Titre": "Still haven't received the item over a…",
          "Contenu": "Still haven't received the item over a month from the order date. Disappointing."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-03-12T00:57:24.000Z",
          "Titre": "I have not received my Tech Armor iPad…",
          "Contenu": "I have not received my Tech Armor iPad cover yet. Ordered feb 20th, March 11th today!"
        },
        {
          "Note": 1,
          "Lieu": "SA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-04-12T20:22:22.000Z",
          "Titre": "send this survey after I received it",
          "Contenu": "send this survey after I received it, I didn’t get it yet!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T18:02:09.000Z",
          "Titre": "Too flimsy :-/",
          "Contenu": "I was looking for a better alternative to the matte screen protectors I’ve been using. These are really flimsy and I will not be using them to protect my phone because I’m certain I’ll end up with a cracked screen. These feel like super thin plastic sheets."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John G",
          "Nb_Reviews": 1,
          "Date": "2022-07-13T22:30:20.000Z",
          "Titre": "Protector pulls up in corners of screen soon after application",
          "Contenu": "Easy to install, but the adhesive pulls up in the corners of the screen roughly a week after application. I've gone through a 3-pack and now a replacement. And yes, the phone is protected by an iPhone case which was suggested by TechArmor."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chris Terry",
          "Nb_Reviews": 6,
          "Date": "2021-08-04T04:39:58.000Z",
          "Titre": "I have had to replace 3 of your…",
          "Contenu": "I have had to replace 3 of your products now. Approx one per year. I only use my tab indoors and am very careful with my tech. I am an It Mgr of 25 years with a large corp and will have to begin looking for a better solution. I originally wrote a raving review, but no longer feel your product is the same. Not sure what has changed, but I won't be buying for my corp employees any longer as they have been experiencing more failures additionally."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lar",
          "Nb_Reviews": 2,
          "Date": "2023-01-19T23:01:18.000Z",
          "Titre": "Your product was ONCE the best",
          "Contenu": "This product was once the best, but now it seems as though they chip if you look at them wrong.   I’ve had to replace more ballistic glass protectors in the past two years than I have the previous 8 years combined, all from Tech Armor.   And those chips didn’t come from drops.  I’m saddened to see this company go down this path."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lar",
          "Nb_Reviews": 2,
          "Date": "2022-06-11T06:32:29.000Z",
          "Titre": "Quality has diminished greatly ☹️",
          "Contenu": "Two years ago, they would’ve received 5⭐️but since then, the ballistic glass protector is “thinner”?  and chips right away.  These use to last 8 months+ and now are lucky to last 2-3 weeks before they start to chip around the edges.  I’ve never replaced so many in such a short period."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T22:06:15.000Z",
          "Titre": "Arrived fast",
          "Contenu": "Arrived fast, but the screen protector keeps coming up. It won't stick at the top. This is the second time having this problem from this company."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mr Colón",
          "Nb_Reviews": 1,
          "Date": "2022-12-12T07:22:11.000Z",
          "Titre": "Your customer service does not communicate. Neither throw email nor text.",
          "Contenu": "Your customer service does not communicate at all. This is the first communication I’ve received. I placed the warranty order and heard nothing until I received the replacement in the mail."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-12T04:51:28.000Z",
          "Titre": "Apparently garbage material used",
          "Contenu": "Apparently garbage material used. These protectors chip on the edge constantly. Quality control gentlemen!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-11-05T22:46:48.000Z",
          "Titre": "Not at all what I expected",
          "Contenu": "Not at all what I expected. Pretty disappointed. Thought it would be real glass, but I guess I shouldn’t have expected much for the price."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2020-10-21T17:19:03.000Z",
          "Titre": "It does not cover the entire screen, not happy",
          "Contenu": "It does not cover the entire screen. And should have one already designed for the iPhone SE not any other model that it was made for."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "RICHARD EATON",
          "Nb_Reviews": 3,
          "Date": "2023-01-03T21:50:23.000Z",
          "Titre": "The warranty was good",
          "Contenu": "The warranty was good Not happy that we had to pay shipping"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-01-13T21:12:46.000Z",
          "Titre": "10 days after purchased and I still…",
          "Contenu": "10 days after purchased and I still haven’t received it.  I’m using Tech Armor ballistic glasses for many years but mail transit time is taking longer than other competitors.Replacement guaranty is good point but it often take 2 weeks or more till I get.Yes I understand Tech Armor has no control once it was shipped.  Maybe I’m spoiled with online purchases from other sellers as many of them won’t take up one week before shipping out like this purchase."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Antonia C",
          "Nb_Reviews": 2,
          "Date": "2022-08-19T05:17:28.000Z",
          "Titre": "great product bad communication",
          "Contenu": "I've used your screen protectors for years, excellent products. However the 3 stars is because this order I never received a confirmation or tracking email."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Kay",
          "Nb_Reviews": 1,
          "Date": "2022-09-18T03:48:41.000Z",
          "Titre": "No email confirmation",
          "Contenu": "After I placed my order I didn’t get an email confirmation until I emailed the company."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-02-14T20:59:50.000Z",
          "Titre": "To Short",
          "Contenu": "The product is not made to the correct dimensions it is to short the width seems fine."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-09-15T10:13:38.000Z",
          "Titre": "Would give 5 stars but cost to ship…",
          "Contenu": "Would give 5 stars but cost to ship free replacement was too much!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chuck",
          "Nb_Reviews": 7,
          "Date": "2020-12-14T19:27:43.000Z",
          "Titre": "Nothing received yet!!!",
          "Contenu": "They shipped my order to incomplete address (although the shipping confirmation had correct address) so not deliverable.  They responded and agreed to refund.  So. 4 stars for customer service, but 0 stars for their shipping dept!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-01-04T21:41:33.000Z",
          "Titre": "Tech Armor sent a replacement and USPS…",
          "Contenu": "Tech Armor sent a replacement and USPS claims it was delivered, but I never got it, so I can not say good or bad things about this Tech Armor transaction except I am out $5 and no protector."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "KPD",
          "Nb_Reviews": 2,
          "Date": "2021-07-10T19:39:21.000Z",
          "Titre": "Speedy customer service but poor product quality.",
          "Contenu": "Speedy customer service. So 3* for that.But product quality is poor.It doesn't sustain any drop. We have to keep replacing the protector."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Deacon Andrews",
          "Nb_Reviews": 3,
          "Date": "2022-07-29T13:25:48.000Z",
          "Titre": "Not the level up to"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CB",
          "Nb_Reviews": 3,
          "Date": "2023-11-23T17:46:29.000Z",
          "Titre": "So far, so good!",
          "Contenu": "The product itself is good but it would have been helpful to have one of those frames some companies provide to help you with installation!  I like the matte finish to reduce glare and it does a reasonable job preventing fingerprints.I would likely purchase again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gene Archer",
          "Nb_Reviews": 2,
          "Date": "2022-07-02T21:42:08.000Z",
          "Titre": "Could not clear air on one side two areas. Possibly from placing wrong side down to begin with. If the side the protective plastic was on goes down as it seems to do; directions a would have helped.",
          "Contenu": "I just did and repeating it here is not conducive to good customer service.All Air not removable on phone. The possible reason is that when I took protective cover off the ballistic glass there are no directions as to which side to be put on the phone. Evidently I must’ve put the wrong side down and then turned it over. That was enough to contaminate the surface so even the stickies didn’t clean out enough. After all the other directions were followed."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Theo",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T21:25:31.000Z",
          "Titre": "Good quality product but unfortunately…",
          "Contenu": "Good quality product but unfortunately I was unable to use the item due to delivery damage. But with quick communication between seller and buyer. A member of staff helped me with my enquiry to send me a replacement. Kind and helpful team, they try their best to make the customer happy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Deborah",
          "Nb_Reviews": 4,
          "Date": "2021-12-04T03:24:52.000Z",
          "Titre": "I am pleased",
          "Contenu": "I placed my order, however, I did not receive an email confirmation.  There is no phone number for the company for customer service. I checked my online banking and the funds had been withdrawn for payment of my order.  I sent an email and also a PM via their facebook page.  On a positive note, I did receive a response via email within 4 hours.  They sent me the tracking information for my order.  Shortly afterwards, they responded via facebook PM.  Everything turned out well.  I received my order 2 days earlier than expected via USPS.  Thank you guys!"
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Jodi Jones",
          "Nb_Reviews": 4,
          "Date": "2022-02-07T19:16:52.000Z",
          "Titre": "happy with the purchase",
          "Contenu": "Very happy with the purchase, just wish that the screen protector was mailed in a more substantial box instead of a soft sided pack. When you send some thing in a bubble pack you run the risk of damage if it is bent especially with these screen protectors. Previously you used to ship them in a small box."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2022-07-11T18:43:15.000Z",
          "Titre": "Service was very responsive",
          "Contenu": "Service was very responsive!  Instructions in box could have been better (did not seem to match up very well with the contents in box). Had trouble with ballistic glass fully sticking, but they are sending me another one!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sivakumar Rajmohan",
          "Nb_Reviews": 2,
          "Date": "2023-10-06T03:43:39.000Z",
          "Titre": "Delivery was prompt but the fit of the…",
          "Contenu": "Delivery was prompt but the fit of the screen protector could’ve been better"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Philippe Provencher",
          "Nb_Reviews": 1,
          "Date": "2022-12-17T00:53:24.000Z",
          "Titre": "Excellent Customer Service",
          "Contenu": "Tech Armor products have always been a safe bet for me. However, for some unexplained reason, the order confirmation and the tracking number were not sent to me, and the package did not arrive the first time... The customer service, understanding, courteous, efficient and helpful, collaborated really well, and we were able to find a solution easily and quickly. Overall, I am very satisfied with the services received, as well as with the products they offer. The only reason for the missing star is the order that didn't arrive the first time!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-02-03T22:26:59.000Z",
          "Titre": "Still had air bubbles (a few small ones)",
          "Contenu": "The product worked really well on reducing the issue of fingerprints on the screen.That was the principal reason I purchased the product. I would have rated it even higher if I had been able to get all the air bubbles out from underneath the protector."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bryan R",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T23:37:09.000Z",
          "Titre": "Everything was great",
          "Contenu": "Everything was great, product and quality superb. I gave 4 stars because I ended up getting a spec of dust behind my screen even though I thought cleaned it and used all dust strips. More my fault though I suppose."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Adrian Beck",
          "Nb_Reviews": 1,
          "Date": "2022-06-20T20:04:46.000Z",
          "Titre": "Broken screen gets screen protector replacement",
          "Contenu": "I was disappointed that my screen protector didn’t work but tech armor was very friendly and sent a free replacement pack. Thanks for all the help it is appreciated."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-11-05T14:33:11.000Z",
          "Titre": "Good product overall at a reasonable…",
          "Contenu": "Good product overall at a reasonable price.4 instead of 5 stars due to longer shipping time than normal forTechAmor"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mitch",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T00:14:08.000Z",
          "Titre": "had a problem with the screen protector…",
          "Contenu": "had a problem with the screen protector which was resolved through the excellent customer service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Old Hickory",
          "Nb_Reviews": 2,
          "Date": "2021-04-29T16:34:34.000Z",
          "Titre": "I love Tech Armor Products.",
          "Contenu": "I love Tech Armor Products.The reason for the 4 star review is that on curved edge screens, the glass still allows quite a bit of dust and grit under it.Despite that, the ballistic glass has saved my screen multiple times, sacrificing itself, and Tech Armor is always quick to get me a new protector shipped."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Karina Lopez-Osorio",
          "Nb_Reviews": 1,
          "Date": "2020-12-02T15:43:01.000Z",
          "Titre": "Easy and convenient replacement",
          "Contenu": "I bought a screen protector 2 years ago with a limited life warranty. I had to order a replacement recently and the transaction was super easy and convenient as Tech Armor has its own site for you to do this as long as you have your original order info(Order# & Email). I don't give it 5 start because for some reason the site did not want to take my MC, so I had to reach customer service. They answered promptly and suggested to try another card and it worked. Super happy."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Noé Fuentes",
          "Nb_Reviews": 1,
          "Date": "2021-05-13T21:43:26.000Z",
          "Titre": "Works GREAT but materials don't last.",
          "Contenu": "Its been a while since I got the use cable and it was a blast but lately they haven't been as resistant as before I don't really know what's going on, but the efficiency of charging is great and the lengths but the only inconvenient I have is that one. Hopefully they fix that soon."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JD",
          "Nb_Reviews": 5,
          "Date": "2021-07-03T21:12:34.000Z",
          "Titre": "Very happy with these cables",
          "Contenu": "Very happy with these cables. I have an Android phone as my personal phone, iPhone for work and my Bluetooth earpiece and backup battery are micro USB. This cable handles all three. If only you made a longer cable, I would give 5 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bob",
          "Nb_Reviews": 2,
          "Date": "2021-02-08T16:42:08.000Z",
          "Titre": "The Ballistic Glass screen protector…",
          "Contenu": "The Ballistic Glass screen protector for my iPhone Xr arrived on time. I watched the video, as requested in the directions but the screen protector I purchased did not match the video. So I emailed support and after some back & forth emails we sorted it out. And so far so good. There seems to be no deterioration in the sensitivity of the screen. I believe an updated video is needed, and some notes about the interface area between the screen protector and any case that is on the phone needs to be mentioned. Support was really good and very responsive. I have not dropped the phone yet, and hopefully never will, but I am confident the screen protector will do it's job."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Adriona Pride",
          "Nb_Reviews": 1,
          "Date": "2020-11-05T01:49:48.000Z",
          "Titre": "Screen protector",
          "Contenu": "I got the screen protector for my iPhone 11 and within day it had cracked a little bit but then a month after wards it randomly would chip. I am getting replacement and will see how it does"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steven Kari",
          "Nb_Reviews": 1,
          "Date": "2021-03-19T04:01:25.000Z",
          "Titre": "Update installation instructions",
          "Contenu": "I installed the screen protector without much trouble, but it was not quite centered. Not a big deal because the screen is 98% covered. Only when I was done did I notice the \"easy installation tray\" and wondered what it was and how it worked. It's listed on the front of the protection pack box. I had followed the written installation instructions as closely as I could, but nowhere in the instructions is \"installation tray\" mentioned. Instruction Note 5 would have been a perfect place for it. The graphic for Note 5 is really insufficient to clearly communicate how it works. Again, it worked out for me, but I had to watch a video to see what you had in mind for the installation tray. Consider including \"installation tray\" in the instructions to make it truly \"easy.\""
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 2,
          "Date": "2021-12-09T11:20:40.000Z",
          "Titre": "Great product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Guest",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T23:00:55.000Z",
          "Titre": "Screen protector did it's job…",
          "Contenu": "My old screen protector did it's job when I dropped my phone on concrete. The phone was undamaged. I really like the installation guide now being shipped with the screen protectors. The installation of the new protector went very well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T05:20:14.000Z",
          "Titre": "Screen protection exactly what was needed.",
          "Contenu": "Screen protection order processed immediately, received quickly. Product exactly what I needed and instructions (plus phone guide) helped me get the protector installed properly. Good price. Expect this one to last just like the last one I ordered from you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "kathy",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T03:52:50.000Z",
          "Titre": "I got this for my Iphone 6 plus",
          "Contenu": "I got this for my Iphone 6 plus. It was easy to instal and it looks great. Directions were easy. I would definitely purchase this product again. Price is good too. Highly recommend this."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joey",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T02:35:33.000Z",
          "Titre": "They always reply promptly & take care…",
          "Contenu": "They always reply promptly & take care of whatever it is I need help with. I’ve been buying Tech Armor screen protectors and accessories for probably 8 years now, and between my yearly upgrades, friends, family and coworkers, I’m probably pushing 100+ screen protectors alone. They do great business and I’m constantly referring people to them because of the great service I’ve received over the years."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tatiana",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T03:09:12.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service. Mike was super knowledgeable and helpful. He tried everything to honor warranty even original glass screen was not available. I’m happy with Tech Armor products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Catherine",
          "Nb_Reviews": 9,
          "Date": "2023-11-11T12:12:34.000Z",
          "Titre": "ONLY Tech Armor",
          "Contenu": "I purchased Tech Armor a few years ago and found that my cover was cracked.  I searched for the second application of Tech Armor but could not find it or remember the name so I purchased another product, but I did not like it.  Searched further in my house and found the second protector and immediately ordered 2 more from Tech Armor.  It is a wonderful product.  That first protector lasted a few years.  When I saw the crack I really thought I damaged my phone.  It was the protector that cracked NOT my phone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephanie Jones",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T00:58:42.000Z",
          "Titre": "TechArmor is superior",
          "Contenu": "TechArmor is an all-around awesome company. I use them exclusively to provide my phone screen protectors. Their quality products have saved my phone many times and they are always follow through on the phone screen protector lifetime warranty. I tell everyone to use TechArmor!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Guy",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T23:45:13.000Z",
          "Titre": "Best Ever!",
          "Contenu": "As per every experience I have had over the years with Tech Armor, both quality and customer service, this latest one does not disappoint! They are the best in every way!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cindy",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T18:29:28.000Z",
          "Titre": "Outstanding product and customer service",
          "Contenu": "I purchased a screen saver for my iPad in 2019. I noticed this week the screen protector is cracked so I reached out to Tech Armor. No questions asked, they have a new screen saver in the mail to me immediately. I sent my email on Saturday and they responded the same day!  I didn’t expect a response until Monday. Outstanding product and customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George",
          "Nb_Reviews": 6,
          "Date": "2023-11-04T15:26:07.000Z",
          "Titre": "Product is an investment not an expense…",
          "Contenu": "Product is always shipped and delivered promptly. I have been using these protectors on every phone I purchase and have never had a screen to crack or scratch. I think of these protectors as an investment, not an expense. Once you put one on you no longer need to worry about a cracked screen. A very good product and a great price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Abby",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T22:31:09.000Z",
          "Titre": "Fantastic Customer Service!",
          "Contenu": "First of all, you got right back to me.  My issue was resolved quickly and I received a replacement screen within a few days.   My family and I have always had good luck with your screen protectors and I will continue to buy them as we upgrade devices.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay",
          "Nb_Reviews": 1,
          "Date": "2023-07-15T04:32:29.000Z",
          "Titre": "I just happen to buy a few lighting…",
          "Contenu": "I just happen to buy a few lighting cables from Tech Armor as well as some screen protectors. I have to say their customer support is beyond top notch. It honestly is hassle free experience. I have purchased similar items from other brands but because they stand behind their product they have turned me into a loyal Tech Armor customer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William F",
          "Nb_Reviews": 3,
          "Date": "2023-10-28T20:41:35.000Z",
          "Titre": "Had a an issue with a screen saver",
          "Contenu": "Had a an issue with a screen saver. Emailed customer support on a Saturday and they got back to me within a few hours !! Amazing !! Sent out a new pack of screen protectors to me. GREAT customer service !!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Al Inger",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T22:59:24.000Z",
          "Titre": "Great experience and customer service",
          "Contenu": "I recently had an experience with Tech Armor's iPhone screen protector, and I must say, their customer service is top-notch. After installing two new screen protectors that started peeling off, I reached out to them. To my surprise, they promptly sent me a new pack. While the peeling issue was a bit disappointing, their excellent customer service turned things around. It's reassuring to know they value their customers and are willing to address any concerns. Kudos to Tech Armor for making sure my experience ended on a positive note!Al"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristina Martin",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T20:08:11.000Z",
          "Titre": "The only screen protectors I'll use",
          "Contenu": "I've been using Tech Armor screen protectors for years and I ALWAYS come back to them. I dropped my phone and the screen protector cracked. I was within my 2 years limited warranty and customer service did not hesitate to send me a new one! Fast response and super easy.  Thanks so much!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Renee B.",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T02:47:25.000Z",
          "Titre": "Lifetime warranty",
          "Contenu": "I requested a replacement for a cracked screen protector for my Iphone SE (original). Only to find out that they stopped making them. TechArmor did allow me to purchase anything else I wanted for the amount I originally spent to make it right. I'm happy with this. I guess the phone is seven years old after all."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Mary Kay Foster",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T00:12:18.000Z",
          "Titre": "Happy Customer!",
          "Contenu": "I bought the 2 pack of Ballistic Armor Glass Screen Protectors for my iPad, and was very happy with the performance of the first one installed some time ago. Recently, I removed the first protector, and replaced it with the second one from the package. Both times, I found the installation quick and easy. However, the second time, one area of the screen near the cutout for the control button on my iPad did not adhere properly. I contacted Tech Armor for assistance, and received a quick, helpful response. They offered to replace the problem screen. This is a great product, and their customer service is excellent!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hugo",
          "Nb_Reviews": 2,
          "Date": "2023-10-03T17:01:28.000Z",
          "Titre": "Tech armor is the best in this the…",
          "Contenu": "Tech armor is the best in this the business for protecting your screen. The customer service matches the same energy have nothing but positive feedback for this company"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "patricia pantzalas",
          "Nb_Reviews": 2,
          "Date": "2022-05-14T14:26:23.000Z",
          "Titre": "Protection for an iPhone SE (3rd gen)",
          "Contenu": "I purchased a new iPhone SE (3rd gen). Had great luck with my previous SE - accidentally flew several feet landed face down and the Tech screen cracked but protected it fully. This allowed me to get full trade in value for the new phone.I really like the fact that they include everything you need to install it perfectly - including a bungle proof template. I will keep purchasing this company's product because I know they are quality."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason Carlson",
          "Nb_Reviews": 3,
          "Date": "2022-02-22T12:43:44.000Z",
          "Titre": "I trust Tech Armour 💯 with my devices",
          "Contenu": "I trust Tech Armour 💯 with my devices. As many screensavers as my family has accidentally broken, none of them have ever resulted in a broken device. The lightening cables are great as well. They charge fast and I’ve never gotten a notification on my phone that’s states “this accessory not supported” like I’ve gotten with lesser quality cables. In a day and age where nobody cares about you after your purchase, IMHO Tech Armor products are the best, the best warranty, and the best customer service team."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill Hudson",
          "Nb_Reviews": 1,
          "Date": "2022-01-30T00:29:30.000Z",
          "Titre": "Ordered my new TechArmor screen…",
          "Contenu": "Ordered my new TechArmor screen protector after looking and reading numerous reviews. Easy to follow instructions and after giving my IPad Air a good cleaning with the alcohol wipe provided and them a final buffing with the clothe provided, I made sure it would fit, peeled off the adhesive protector, lined it up with the screen and it went on perfectly. Couldn’t ask for more. Now my iPad is well protected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maor",
          "Nb_Reviews": 1,
          "Date": "2022-03-21T21:15:22.000Z",
          "Titre": "BEST product & support you can choose!",
          "Contenu": "The quick response time, kindness of the team and fantastic resolution to my problem is why i choose Tech Armor. and this is without mentioning the fact that their screen protectors are keeping my iPhone safe for 3 years already!  long story short i've ordered a new screen protector recently and while installing it i cracked it, thought I totally lost the money , but no! after sending an email to Tech Armor support they replied within minutes and offered me a replacement on the spot at no additional cost to me. looking forward to get my new one and keeping my phone safe again :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve B.",
          "Nb_Reviews": 1,
          "Date": "2022-03-22T21:28:17.000Z",
          "Titre": "Tech Armor is the best.",
          "Contenu": "Our family has been using Tech Armor screen protectors for years. Every time we upgrade phones we immediately put new TechArmor Glass on them. I cannot tell you how many screens the protectors have saved. The warranty service is exceptional. I would not carry my phone with out one on it. They are the best."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "//ʙʟᴀᴄᴋʙᴀʀᴏɴ",
          "Nb_Reviews": 2,
          "Date": "2022-06-23T21:42:25.000Z",
          "Titre": "Fantastic Products By A Fantastic Company",
          "Contenu": "First and foremost, while the products this company offers are excellent and of great quality, the customer service offered by this company is without one doubt, the best, bar none. They're really that great, honestly. Any time I purchase a new phone or know of friends and family that do, I personally employ and remind others of the screen protectors provided by this company. I cannot recommend them enough and will continue to use them for all my future phone needs. Thank you Tech Armor!"
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "João V.",
          "Nb_Reviews": 1,
          "Date": "2022-08-16T20:06:16.000Z",
          "Titre": "I loved Tech Armor's service",
          "Contenu": "I loved Tech Armor's service, they solved all my doubts quickly. I was already a customer and now more than ever. Perfect, assertive and easily accessible service. Tech Armor products are the best I've ever seen on the market, they fulfill their function with excellence. Congratulations on the service and products!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill U.",
          "Nb_Reviews": 1,
          "Date": "2022-03-18T17:31:33.000Z",
          "Titre": "Awesome Protection and Easy Installation.",
          "Contenu": "I purchased the Ballistic Glass Screen Protector for my iPhone 12 Pro (6.1\") on a chance. I am delighted with the product. Installation was made simple with the supplied materials. I also watched the install video on You Tube which was a big help! I was able to align if perfectly to accommodate my case and I particularly like how the adhesive bonds to the screen. Covering the screen all around, even the notch, is a good idea. I will recommend to anyone needed a better screen protector."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brenda Thalhuber",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T18:58:42.000Z",
          "Titre": "Awesome product & Company",
          "Contenu": "I have been buying Tech Armor for years, but I needed a screen protector replaced. I contacted them and was taken care of quickly, My new protector will be here today! I would recommend their products to anyone! Thank you again for your quick response. Just amazing 👍🏻👍🏻"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TerryM",
          "Nb_Reviews": 1,
          "Date": "2022-05-06T19:01:37.000Z",
          "Titre": "Customer service is excellent",
          "Contenu": "Customer service is excellent. I couldn't find where to submit a warranty claim on their website, so I sent an email to the customer support email address, and received a response with the link within a few minutes.  I received a replacement for my ipad pro screen saver within a week.  I dropped my ipad on the floor.  I feel certain that the Tech Armor screen protector saved my ipad."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 3,
          "Date": "2022-09-05T00:38:43.000Z",
          "Titre": "Great screen protector. Great price.",
          "Contenu": "Had bought a screen protectors over a year ago and then the third one decided to crack and needed another. Working as a auto mechanic is hard on phone and electronics in general. The customer service told me exactly how to warranty it for a new one. Only issue was post office losing it for a couple days and it being delivered slightly damaged but was able to use one of the three. If they did not have a lifetime warranty i would defiantly buy again just because they protect the screen great and at a great price."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Gilbert Turcotte",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T21:26:39.000Z",
          "Titre": "I bought a Premium Glass protection for iPhone 14 Plus",
          "Contenu": "I bought a Premium Glass protection for my 2 iPhone 14plus, when I receive the package and install, I had a problem for my second iPhone and used the two others glass supplied with no good end result.I contact the company February 6 by mail and the response was super fast each time I contact them, receive a brand new package by mail February 16 and install finally the glass for my iPhone and it work perfectly this time, plus I have 2 extra glass. Very happy about the service and the product for the price, Special thank's to Paul and Mike O.Gilbert"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sarah Baker",
          "Nb_Reviews": 1,
          "Date": "2021-10-24T03:59:18.000Z",
          "Titre": "Long time user in years past and years to come!",
          "Contenu": "I have used Tech Armor tempered glass screen protectors practically since the company started. They have always served me well. I recently ordered one that, for some unknown reason, immediately had bubbles under it. I have never had that happen before. After contacting their customer service (not expecting anything, just wanting to let them know about what seemed like a defective product) they immediately reached out to me and offered to replace it with another. The replacement went on smoothly (just like the others I’ve used in the past). No bubbles this time. Just a nice beautifully clear screen! Thanks, Tech Armor, for making a great product and standing behind it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary D",
          "Nb_Reviews": 1,
          "Date": "2022-03-28T12:39:32.000Z",
          "Titre": "Nine years of experience using this excellent product!",
          "Contenu": "I have been using the Tech Armor Ballistic Glass screen protectors for years for my iPhones.  I drop my phone constantly, and the phone screen is always protected! Not only that, but the customer service support has been incredible - they emailed me back within hours when I had a question.  Excellent product and service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas Tracz",
          "Nb_Reviews": 3,
          "Date": "2022-07-20T05:53:48.000Z",
          "Titre": "The screen protector took all the abuse and saved the phone",
          "Contenu": "I've had the ballistic glass screen protector on my iPhone for over a year and a half. During that time, the phone has been dropped or fallen countless times so that the screen protector received cracks and was crushed near the bottom of the screen. Following instructions from customer support, I removed the battered screen protector to find a perfect screen still on my iPhone! I had a spare screen protector which I installed and it feels nice and new. The alignment device included in the kit makes it goof-proof to fit the protector to the phone perfectly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shanna",
          "Nb_Reviews": 5,
          "Date": "2022-09-03T00:28:15.000Z",
          "Titre": "Fast & easy installation",
          "Contenu": "Love Tech Armor Ballistic Glass Screen Protector Designed for Apple iPhone XR and iphone 13 pro. The company is very generous to sell 3 screen for an affortable prices. After watching how to install them, I could do it very nicely and quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2021-12-20T18:59:16.000Z",
          "Titre": "Outstanding Customer Service",
          "Contenu": "My lightning cable failed and Mike guided me through a trouble shoot, but they didn't work.  Ended up having to get a replacement, but my color was sold out.  He was able to send me another one in a different color which i was okay with.  company always goes above and beyond, and stand behind their product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Toma Nua",
          "Nb_Reviews": 1,
          "Date": "2022-09-10T03:25:43.000Z",
          "Titre": "I have ordered screen protectors 3…",
          "Contenu": "I have ordered screen protectors 3 different times now from tech armor. They do an amazing job of protecting my phones. The last time I ordered, I received 1/3 of the screen protectors damaged. I contacted customer service and they promptly rectified the issue at no cost to me. I will be buying from them again in the future"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roy",
          "Nb_Reviews": 1,
          "Date": "2021-09-09T02:35:10.000Z",
          "Titre": "Great product, Great company.",
          "Contenu": "Great product. Certainly saved my iPad. Lifetime limited warranty worked great. Replacement screen protector was received very quickly. I am very happy with tech armor and recommend them to anyone wanting to protect their electronic devices."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bruce Gerrard",
          "Nb_Reviews": 1,
          "Date": "2022-07-19T13:50:42.000Z",
          "Titre": "The anti glare screen covering",
          "Contenu": "The anti glare covering works exactly as I wanted. I can see my iPad outside without the reflections and glare. I do not see my fingerprints on the screen as well. I really don’t notice much of a deterioration of the screen colors or clarity. Plus the covering went on very easily."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jer",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T07:36:12.000Z",
          "Titre": "You guys are great",
          "Contenu": "You guys are great! I’ve been a customer for a long time and have recommended you many times. I dropped my phone and there a protector cracked. I am emailed you on the 21st of January to find out is the guarantee covered my clumsiness. I received a new screen under the guarantee five days later on the 25th of January. Amazing customer service!"
        },
        {
          "Note": 5,
          "Lieu": "HU",
          "Pseudo": "Bianka B.",
          "Nb_Reviews": 2,
          "Date": "2023-02-11T17:24:43.000Z",
          "Titre": "I only trust Tech Armor",
          "Contenu": "I only trust Tech Armor with the protection of my devices. There was some initial issues with submitting my order from Europe, but the customer service team was most helpful! I already received my package, and I couldn't be more satisfied."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Denise Hammond",
          "Nb_Reviews": 2,
          "Date": "2021-10-25T22:23:57.000Z",
          "Titre": "These folks provide uniquely fantastic service and the product is great too!",
          "Contenu": "These folks are uniquely fantastic!  I bought a protective cover for my ipad a few years ago and recently contacted them about a warranty replacement. Unfortunately, the replacement wasn't available in their warehouse so they went ahead and ordered it on Amazon.  it was delivered today, as promised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Rogulski",
          "Nb_Reviews": 2,
          "Date": "2022-10-21T22:45:54.000Z",
          "Titre": "Customer for years now",
          "Contenu": "Customer for years now.   I have several cables and I wait until I have a couple dead before I reach out.   I have NEVER been dissatisfied with service and every single representative I have worked with has been 100% on the ball and polite.   Just waiting for you to make 90 degree ends so I can buy them too!    Forever a customer ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mohammad Siddiqui",
          "Nb_Reviews": 1,
          "Date": "2021-10-02T20:42:50.000Z",
          "Titre": "Best Screen Protectors!",
          "Contenu": "Quality of glass protectors are amazing! Doesn’t affect usage and you can barely tell it’s on! Customer service is very good, easy process to get replacements under warranty! We use tech armor for all of our devices!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "SJM",
          "Nb_Reviews": 1,
          "Date": "2022-05-21T20:06:23.000Z",
          "Titre": "I have been using Tech Armor screen…",
          "Contenu": "I have been using Tech Armor screen protectors for years.  The ballistic glass one works great and feels just like the bare screen itself.  Recently had my phone replaced by the manufacturer due to a hardware problem and Tech Armor immediately offered to send a replacement protector for my replacement phone.  Great products, great service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DOREEN SCHMIDT",
          "Nb_Reviews": 5,
          "Date": "2023-04-25T00:52:34.000Z",
          "Titre": "Easy installation. Great results!",
          "Contenu": "The installation of the product on my iphone was super easy and eliminated almost all the air bubbles.  Only had 2 small ones that were easily removed.  This is the second product I have ordered for my iphones over the years.  Would not order any other!  Follow the online instructions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JT",
          "Nb_Reviews": 2,
          "Date": "2023-11-14T22:57:34.000Z",
          "Titre": "Super easy to install screen and lense…",
          "Contenu": "Super easy to install screen and lense protectors with provided kit"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Obrad Spanic",
          "Nb_Reviews": 1,
          "Date": "2022-01-07T00:30:28.000Z",
          "Titre": "Great customer and warranty service",
          "Contenu": "I bought 3 lightning cables and unfortunately I have had issues with them. But Tech Armour stands behind their warranty. I contacted them regarding my issues and they were more than happy to help rectify the situation.  I am more than happy with their customer service. I will purchase again from Tech Armour"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Timothy Noveroske",
          "Nb_Reviews": 1,
          "Date": "2022-09-29T00:03:37.000Z",
          "Titre": "Replacement",
          "Contenu": "I bought the Tech Armor Touch Screen protector for my Tesla but when it arrived, I found it had been creased during delivery. The Tech Armor team were very responsive and after I emailed them with a pic of the problem, they sent me a replacement immediately. I just put it on and it looks great!Thanks so much"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael G",
          "Nb_Reviews": 1,
          "Date": "2022-02-01T13:56:26.000Z",
          "Titre": "Flawless install Samsung Note 20",
          "Contenu": "Just completed the install of my tech armor ballistic glass screen protector for my Samsung Note 20. This replaces an existing tech armor screen as I dropped it in a grocery store and the screen protector cracked, however my phone had no damage thanks to tech armorThis is the only screen protector that I have found where the fingerprint reader works for my phone.  Great job tech armor!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Murph",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T00:20:48.000Z",
          "Titre": "I definitely recommend tech amor, they are the best",
          "Contenu": "i bought the tech amor matte screen protector a while back and i’m really enjoying it, it’s better than the other matte screen protector i’ve had."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Bowman",
          "Nb_Reviews": 1,
          "Date": "2022-06-04T17:45:16.000Z",
          "Titre": "Great product with even better customer service",
          "Contenu": "My phone got dropped off a ladder and hit the cement below.  This was my first time ever having a screen protector on my phone, along with the Otterbox case and I thought for sure my iphone screen would be shattered.  To my surprise, there was a crack along the lower right corner of the screen protector, but my phone screen had no issues.  This product did it's job and when I called Tech Armor, their response time was fast and they sent out a new screen protector immediately.  It's rare these days to still see great customer service and this was exceptional.  A++++++"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom D",
          "Nb_Reviews": 1,
          "Date": "2022-10-27T04:26:23.000Z",
          "Titre": "A+ company, high quality, good customer service",
          "Contenu": "Tech Armor makes high quality screen protectors that I have used since the iPhone 6. They last a long time, and when I eventually accidentally break them, their warranty process is quick and easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "mo",
          "Nb_Reviews": 1,
          "Date": "2021-10-05T19:54:03.000Z",
          "Titre": "I had an issue with my TechArmor screen…",
          "Contenu": "I had an issue with my TechArmor screen protectors. Paul and his fellow support team were super helpful and solved my problem immediately. They sent out a replacement. This is an example of GREAT PRODUCT SUPPORT. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DPJ",
          "Nb_Reviews": 1,
          "Date": "2021-09-17T06:36:57.000Z",
          "Titre": "I needed a replacement of a broken…",
          "Contenu": "I needed a replacement of a broken ballistic edge to edge glass.  I had issues with the Tech Armor website displaying my previous orders. So I contacted customer support. It was great to get fast help by representative Mike O.  He took my info and submitted a replacement order. Great help and easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bonnie Leahy",
          "Nb_Reviews": 1,
          "Date": "2021-09-25T20:28:39.000Z",
          "Titre": "In a world where customer service…",
          "Contenu": "In a world where customer service usually means a lack of service I was thoroughly delighted with Tech Armor.  They responded to my plea wicked fast and they were more than helpful.  So happy with Tech Armor's customer service - I will gladly remain a loyal customer.  Thank you so much, for going that extra mile and satisfying this customer!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marc H. Brawer",
          "Nb_Reviews": 2,
          "Date": "2023-03-09T22:18:41.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "I purchased a three pack of screen protectors for my new iPhone but when the package arrived, one of the screen protectors was damaged. I communicated with them and provided the information. They replaced the single damaged  screen protector with a brand new package of three!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joel",
          "Nb_Reviews": 1,
          "Date": "2022-01-19T16:11:09.000Z",
          "Titre": "Hands down the best customer service…",
          "Contenu": "Hands down the best customer service experience I've had in years. The team at Tech Armor was friendly, knowledgeable and extremely responsive. I've grown accustomed to poor customer service and it was sooooo refreshing to have an exactly opposite experience. Give your team a pat on the back. I'll be recommending Tech Armor to all my clients, friends and family."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "HM",
          "Nb_Reviews": 1,
          "Date": "2023-02-12T02:56:04.000Z",
          "Titre": "Love this product",
          "Contenu": "Shipped quickly. Product is excellent. I wish I'd received a shipping confirmation, but I guess it didn't really matter since both orders shipped pretty fast."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Brian",
          "Nb_Reviews": 8,
          "Date": "2022-09-09T22:23:46.000Z",
          "Titre": "Great service",
          "Contenu": "Great service. easy to use and great value.It is so nice to find a company that when it says guaranteed for life they actually mean it. I am very happy with the attitude.I have replaced two cables that have stopped working. There has never been an argument - just efficient replacement. If it werent for the children and dogs I doubt I would have replaced any."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JoEllen Oppliger",
          "Nb_Reviews": 2,
          "Date": "2022-08-11T01:49:37.000Z",
          "Titre": "Fixing MY error",
          "Contenu": "I got a new iPhone and wanted to protect it.  In my excitement, I ordered the wrong size screen protectors and was so disappointed when - of course - they wouldn't fit.  I reached out to Tech Armor customer service via email to explain my dilemma.  To my surprise, even though it was late at night, I received an almost immediate reply.  Because I had already opened the package and used some of the supplies, it was not eligible for return.  However, they graciously offered to refund half the cost and they also provided me with the link to the Amazon listing so I could get EXACTLY what I needed.  This snafu was completely my fault, and the total monetary transaction was less than $10.  But the value of their Customer Service was priceless.  If I could give them MORE than 5 stars, I would!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Grant Metzger",
          "Nb_Reviews": 1,
          "Date": "2022-02-01T00:15:55.000Z",
          "Titre": "They actually care about the customer!",
          "Contenu": "They actually care about the customer. The order that I filed the claim on was completely sold out, which ain't good. It didn't matter at all. Tech Armor actually has a spine and stands by they're word. I surprisingly had two different reps worked on my claim. They were both on the same page, which is great. The day after I filed the claim, Tech Armor sent me an email confirming that a replacement was on the way.Thanks a million, Tech Armor!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MonicaS",
          "Nb_Reviews": 8,
          "Date": "2023-04-04T21:12:39.000Z",
          "Titre": "Great protector, but privacy view from the side is not for me.",
          "Contenu": "I love your products and use them on all my devices.  You sent the correct item and shipping was quick.  I am not sure I am crazy about the one I bought that offers privacy from a side view. I take a lot of photos and am finding this makes viewing my screen for photos difficult.  Thought I’d give it a go, but might end up getting a different one from you guys."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin Hsia",
          "Nb_Reviews": 1,
          "Date": "2022-10-08T20:10:55.000Z",
          "Titre": "Customer Support and Warranty",
          "Contenu": "Charger broke due to wear and tear and was able to request a new one under the limited warranty. No issues with the process. 10/10 would recommend this product with their superb customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Todd Thompson",
          "Nb_Reviews": 1,
          "Date": "2021-11-23T03:44:11.000Z",
          "Titre": "I bought a three pack of protectors for…",
          "Contenu": "I bought a three pack of protectors for a brand new iPhone. Call it bad luck or just plain bad days but Ive dropped my phone on cement , had it fall off a work bench onto warehouse floor and then lastly it took a tumble down the driveway. Each time it appeared my phone could have been cracked or shattered the protectors saved it completely. Can’t say enough about this product as it saved me a ton of money!Buying more now to protect me for my future mishaps."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Tam-Mai B",
          "Nb_Reviews": 1,
          "Date": "2021-09-16T20:39:45.000Z",
          "Titre": "Quick response",
          "Contenu": "Arrived damaged from shipping, but Tech Armor was quick to respond and offer a replacement. Even with the fold from shipping, the screen protector feels great with an apple pencil, I'm sure the replacement product will be great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carlos Silva",
          "Nb_Reviews": 2,
          "Date": "2021-09-21T01:20:55.000Z",
          "Titre": "Love tech armor screen protectors!!!",
          "Contenu": "Love tech armor screen protectors!  I have them on all my devices and wouldn’t choose another brand.  If I need it, they’re replacement warranty has me covered!  Their customer service is also 5 stars!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Kirk",
          "Nb_Reviews": 1,
          "Date": "2022-02-04T15:55:48.000Z",
          "Titre": "First Experience With Tech Armor",
          "Contenu": "I decided it was time for a new screen protector for my iPhone SE. There's a large number of choices and a large number of companies offering these,but after hearing good things about Tech Armor, I decided to go with one of theirs.I couldn't be happier with my choice. From the way that the product was packaged to the way it fit was very impressive to me.... I've tried a number of different screen protectors from a number of different manufacturers, but never had a great experience with any of them. The Tech Armor protector fit like a glove and by far, gave me the best fit of any one I have ever tried up to this point.Going forward, I will definitely start using the Tech Armor line of screen protectors for any new phones I get or for stretching out older phones I've been happy using for a while."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Niki",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T05:29:44.000Z",
          "Titre": "Arrived quickly",
          "Contenu": "Arrived quickly. Works great and the warranty is awesome. Their customer service is some of the best I’ve seen quick and responsive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "W. Shin",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T01:48:00.000Z",
          "Titre": "Best iPhone screen protectors",
          "Contenu": "Great quality product, hassle-free installation, quick delivery, reasonable price.  Love these guys."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 3,
          "Date": "2023-06-08T21:32:00.000Z",
          "Titre": "Great screen protector",
          "Contenu": "Had bought the screen protectors for my iphone and had cracked the first one on installation so i used the other one and about 8 months later it cracked due to dropping something on it hard and went to get a warranty replacement and after ordering it and paying the shipping it was here in 2 days. Will defiantly continue to use tech armor for all my electronics as long as they are made for them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julie Kleck",
          "Nb_Reviews": 1,
          "Date": "2022-09-23T15:29:27.000Z",
          "Titre": "Great product & ease of application",
          "Contenu": "I am very satisfied with the ease of installation of your glass screen protector for the iphone XR. I just replaced my glass protector because the last one got cracked.  I was so pleased when I realized it was the protector and not the iphone glass.Thank you for such a great product. I will recommend it and buy from you again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Savesky",
          "Nb_Reviews": 10,
          "Date": "2022-11-18T23:26:57.000Z",
          "Titre": "Tech Armor is the real thing",
          "Contenu": "I am a real fan of Tech Armor.  They stand behind their product and I have always had good luck using their products. Very easy to apply and they protect my Iphones and Ipads from serious damage from drops and spills. They are my go-to products for protection."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JR",
          "Nb_Reviews": 2,
          "Date": "2021-10-27T16:52:42.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "Had a mishap with shipping/delivery and the customer service team at Tech Armor were quick to offer a solution to get me new items. Very helpful and quick email responses. Thank you, TA!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lunar Knight",
          "Nb_Reviews": 1,
          "Date": "2022-08-23T00:39:13.000Z",
          "Titre": "iPhone protector",
          "Contenu": "Recently my iPhone screen cracked but thanks to the screen protector my phone was ok.  So I ordered another protector because I know it works really well. I also just received my new protector and you know put it on quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gerry",
          "Nb_Reviews": 1,
          "Date": "2021-09-14T21:08:26.000Z",
          "Titre": "Tech Armor has the best customer service and products",
          "Contenu": "Tech Armor has the best customer service, the best products and staff . I put my trust in their products to protect all my apple devices. They have already saved me hundreds of dollars and the nice thing is that they will do a replacement in case something happens Thank you and thanks for the protection of assurance. Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike M",
          "Nb_Reviews": 1,
          "Date": "2022-07-21T20:29:57.000Z",
          "Titre": "While most of my iphone charging cables…",
          "Contenu": "While most of my iphone charging cables quit after 3-4 month the tech armor one lasted me over 7 YEARS!!! Once it quit i was able to reach out and get another under their lifetime warranty. Great product and company"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jesse",
          "Nb_Reviews": 2,
          "Date": "2022-11-11T14:09:07.000Z",
          "Titre": "No regrets buying Tech Armor",
          "Contenu": "a friend recommended Tech Armor to me, and I have no regrets buying - definitely protects your phone from damage. Customer service was prompt to honor their guarantee as well. Will continue to do business with Tech Amor in the future"
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Lawrence",
          "Nb_Reviews": 1,
          "Date": "2022-07-23T09:27:59.000Z",
          "Titre": "Solid product",
          "Contenu": "Solid product. Best part is their lifetime limited warranty, almost once a tech armour, you do not require other screen protectors."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom Davidson",
          "Nb_Reviews": 1,
          "Date": "2021-11-01T14:36:13.000Z",
          "Titre": "Extremely fast shipping",
          "Contenu": "Extremely fast shipping. An incredible value! I thought I was paying for one screen protector...I received three. It would have been a great value for just one, but three! This a ridiculously great value! You would have to be crazy to buy your screen protectors from anyone else. Go Tech Armor!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jackie Faraclas",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T20:08:02.000Z",
          "Titre": "Tech Armor Great Service…",
          "Contenu": "Tech Armor customer service responds quickly and is very easy to work with.  I would recommend Tech Armor for screen protectors."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keny",
          "Nb_Reviews": 3,
          "Date": "2022-09-24T08:08:59.000Z",
          "Titre": "Tech armor are great products braided…",
          "Contenu": "Tech armor are great products braided cables are the best they won’t tear apart from bending metal parts could be better quality they get dirty and rusted easily but for the price and warranty they do the job warranty is the best."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob Feltner",
          "Nb_Reviews": 2,
          "Date": "2022-07-25T21:05:13.000Z",
          "Titre": "Great customer service!",
          "Contenu": "I recently ordered a new ballistic glass screen protector for a new 2021 iPad. When I tried to install it I experienced difficulty getting it to adhere around the home button. I contacted customer support and they are shipping me a replacement. I have been a customer for several years for iPhone and iPad models. I really appreciate their extended warranty for cracked screen protectors! Excellent customer service!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Terry Wiley",
          "Nb_Reviews": 1,
          "Date": "2022-06-20T21:00:19.000Z",
          "Titre": "Tech Armor’s ballistic glass screen protectors",
          "Contenu": "I’ve been using Tech Armor’s ballistic glass screen protectors since 2016 and have consistently been impressed with both the quality of the protectors (the screen remains highly responsive to touch even with the protector) and with Tech Armor’s replacement policy. Over the years, they have provided me with replacement glass protectors twice in a hassle-free way. I really appreciate their quality and service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael A.",
          "Nb_Reviews": 1,
          "Date": "2023-01-06T06:53:22.000Z",
          "Titre": "You've consistently nailed it!",
          "Contenu": "Yet another excellent Tech Armor iPhone screen protection product coupled with fast delivery followed by easy / clean installation and immediate use. You've consistently nailed it every time I've ordered from TA."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Reni",
          "Nb_Reviews": 7,
          "Date": "2023-04-16T17:11:30.000Z",
          "Titre": "As usual",
          "Contenu": "As usual, Tech Armor's product quality and shipping is top notch! Will always buy my screen protectors from here!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "A. de G.",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T23:25:57.000Z",
          "Titre": "Excellent product and service",
          "Contenu": "Excellent product. Excellent customer service. I’ve used Tech Armor ballistic  screen protectors for years and for all of my family’s phones."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sam",
          "Nb_Reviews": 3,
          "Date": "2022-07-22T16:30:33.000Z",
          "Titre": "Great products and excellent warranty…",
          "Contenu": "Great products and excellent warranty support. You only need to buy the item once, and you’re covered for the life of your device.support is easy to reach and prompt in processing warranty replacements should you need them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janette",
          "Nb_Reviews": 4,
          "Date": "2022-06-29T18:21:06.000Z",
          "Titre": "I have nothing but good things to say…",
          "Contenu": "I have nothing but good things to say about Tech Armor!! Products are amazing and the customer service is outstanding. I had a question and customer service answered the very same day! Amazing!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Will",
          "Nb_Reviews": 2,
          "Date": "2022-02-16T15:26:34.000Z",
          "Titre": "Called with a problem with screen…",
          "Contenu": "Called with a problem with screen protector. They replaced it on the spot and were super fast. Thankyou so much Tech Armor. Will definitely buy from you again in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sean Anderson",
          "Nb_Reviews": 1,
          "Date": "2021-09-22T16:59:13.000Z",
          "Titre": "Great Company & Products",
          "Contenu": "I love these full coverage screen protectors and once when I had a problem with installation, they sent me replacements at no cost.I highly recommend Tech Armor!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 2,
          "Date": "2023-04-24T01:12:44.000Z",
          "Titre": "Pricing with included shipping means…",
          "Contenu": "Pricing with included shipping means it’s always the best deal, and the quality hasn’t dropped at all for years. Great product, easy to find and buy the right one every time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aki",
          "Nb_Reviews": 1,
          "Date": "2023-02-25T02:49:34.000Z",
          "Titre": "First off",
          "Contenu": "First off, I didnt expect my email to be answered so quickly so I'd like to express my gratitude for that. Second, the product was great, the user not so much...which is why I was delighted by Mike. He helped me with my problem in a couple of emails with a level of customer service that's second to none! Thank you very much"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "V Johnson",
          "Nb_Reviews": 2,
          "Date": "2022-10-31T21:26:11.000Z",
          "Titre": "My iPad pro 12.9 screen hasn't gotten a…",
          "Contenu": "My iPad pro 12.9 screen hasn't gotten a scratch or cracked since 2017 using tech armor. Just received my replacement."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robin Levitsky",
          "Nb_Reviews": 1,
          "Date": "2022-06-26T02:38:50.000Z",
          "Titre": "Fantastic customer service",
          "Contenu": "Fantastic customer service. 100% recommended this product. I used to be partial to a different brand/product, but my experience with Tech Armor has insured that I will continue to buy/use tech armor products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T02:31:45.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "I highly recommend this company, they have a great product that they stand behind.  Top notch customer service and response time."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Maitre des clés",
          "Nb_Reviews": 3,
          "Date": "2023-08-21T00:47:51.000Z",
          "Titre": "thank you been loyal customer of your…",
          "Contenu": "thank you been loyal customer of your since day 1 always best in service and in warranty"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-06-03T07:52:05.000Z",
          "Titre": "Anti-glare iPhone cover",
          "Contenu": "Product is always high quality with tech armor. The anti glare is fantastic, I just wish it were a glass cover as well instead of plastics"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Gargano",
          "Nb_Reviews": 2,
          "Date": "2023-01-04T21:04:45.000Z",
          "Titre": "Awesome products",
          "Contenu": "Great product and great customer service. My whole family uses Tech Armor products for. They are are superior to what else is out there."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ed Lewis",
          "Nb_Reviews": 2,
          "Date": "2023-03-04T16:36:51.000Z",
          "Titre": "Great item, awesome price!",
          "Contenu": "Had everything I needed in the package, followed the online instructions. Went on with no issues, not a single bubble. Great item great price. I highly recommend!!!!Ed"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T19:07:00.000Z",
          "Titre": "It’s perfect with my phone and super affordable.",
          "Contenu": "Got here fast, the application tray was such a relief and it looks great!"
        }
      ]
    }
  ]
}