{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "techcenterplus.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "reginald",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T19:52:44.000Z",
          "Titre": "THE WORSE",
          "Contenu": "THE WORSE ! this company all about money i asked to unistall the windows defender they want to charge this is the only program I am unable to uninstall on my own and they have it set up that way to make money NO HELP AT ALL"
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "Rocky Rose",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T07:30:25.000Z",
          "Titre": "Got the job done",
          "Contenu": "Got the job done. Knew what he was doing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Barbara Chin",
          "Nb_Reviews": 3,
          "Date": "2023-02-04T19:41:17.000Z",
          "Titre": "Beware of Tech Center Plus",
          "Contenu": "After I received servicing from Tech Center Plus my computer stopped working.  I took it to a local computer company to have it repaired.  I was told that a rogue IT support corrupted my computer putting it out of commission.  After getting hacked I was expecting Tech Center Plus to clean up my computer but instead I got victimized again.  The local computer company got rid of the malware and repaired the computer.  Anyone using Tech Center Plus will be greatly disappointed.  They are sophisticated scam artists that will take the victim for $300 or $500 for their “service.”This is in response to Tech Center Plus to my review.  My computer stopped working after TCP worked on it.  I was not going to allow TCP to fix it as I suspected that I had  been scammed a second time.  The legitimate company that I finally hired diagnosed my problem as one caused by a rogue IT support entity-Tech Center Plus.  The Malwarebytes program had to deinstalled.  It only costs $34 for the program meanwhile TCP charged me close to $300 for a service that would have bled me dry.  Face it TCP is very clever in marketing itself as a legitimate enterprise but in reality a scammer nonetheless.  Instead of taking thousands of dollars from a single customer they take a few hundred.  They slide under the radar.  For shame!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Odell Williams",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T11:05:38.000Z",
          "Titre": "Andrew",
          "Contenu": "THIS COMPANY IS A SCAM!!!!EVERYONE!!!PLEASE BE AWARE THIS COMPANY IS A SCAM, I WAS LOOKING FOR MICROSOFT TECH SUPPORT AND TECH CENTER PLUS CAME UP UNDER MICROSOFT AND THAT'S HOW I GOT SCAM BY TECH CENTER PLUS. MY EMAIL ISSUE DID NOT GET RESOLVE AND I HAD TO CONTACT ANOTHER COMPANY TO GET MY EMAIL ISSUE RESOLVE, AT THE TIME I THOUGH I WAS DEALING WITH SOMEONE WHO WAS AFFLIATED WITH MICROSOFT TECH SUPPORT, IF YOU LOOK UNDER MICROSOFT TECH SUPPORT YOU WILL FIND TCP TECH CENTER PLUS. NOW TCP DON'T WANT TO GIVE ME A $259.95 REFUND, BECAUSE THEY SAID THEY DID A CLEAN UP ON MY COMPUTER AND IF THAT WAS TRUE I SHOULD BE ABLE TO RECEIVE EMAILS IN MY IN BOX INSTEAD OF MY JUNK FILE. I TALK TO MICROSOFT ON THE PHONE THIS MORNING  AND THEY VERFIED TO ME THAT THEY HAVE NOTHING TO DO WITH THIS COMPANY TECH CENTER PLUS. SO IF YOU DON'T WANT TO BE SCAM LIKE I WAS I HIGHLY RECOMMEND YOU DO NOT USE THIS COMPANY."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Laura",
          "Nb_Reviews": 2,
          "Date": "2023-04-19T04:13:09.000Z",
          "Titre": "This is a scam."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T19:56:10.000Z",
          "Titre": "Uneasy",
          "Contenu": "I like that you can fix problems with the computer, but I am always uneasy with giving anyone control of my computer. I'd be more comfortable if this service were an app that I could operate independently by myself."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "john",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T00:44:25.000Z",
          "Titre": "i had a very hard time understanding…",
          "Contenu": "i had a very hard time understanding their speech, still don't know if it was a scam"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-18T04:43:09.000Z",
          "Titre": "Different expectations",
          "Contenu": "It felt like a scam. I expected Microsoft assistance but got something else that costed much more than I wanted to spend"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer Richard Kinzer",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T02:19:14.000Z",
          "Titre": "Email was not recovered even after…",
          "Contenu": "Email was not recovered even after paying almost $200. New email address added instead."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lynne Thomas",
          "Nb_Reviews": 2,
          "Date": "2023-08-23T22:08:24.000Z",
          "Titre": "Knowledgeable people",
          "Contenu": "The techy who took our call was knowledgeable but difficult to understand. The connection was very poor (satellite background noise). He solved our invasion/takeover problem in about 1.5 hours, include checking the second computer connected by modem. We were disappointed in the misrepresentation by him and your on-line posting that your company was connected to MS and/or a subcontractor to MS. Neither seems to be the case. That said, your folks do seem to know what they are doing and got us out of a real jam. We hope the year ahead of our contract with you goes well. Thank you again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Wayne Thush",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T00:01:16.000Z",
          "Titre": "overall",
          "Contenu": "overall, I'm pleased with the result.  what caused me to give only 3 stars was the problems I encountered getting where Aaron took control of the computer and did his magic.  The process of inputting my credit and/or debit cards to pay you was infuriating at best."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "TR",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T21:05:17.000Z",
          "Titre": "Assistance When I Needed It",
          "Contenu": "Tuesday, March 7, 20 yeah23I like that the consultant was knowledgeable of the problem & knew what the solution was.  Appreciate how quick the response was to work on the problem.  I’m a senior citizen & I think the plans are too expensive for seniors. There should be a discounted rate for seniors.  The problem appears to have been resolved.  I will know when I get home to work on my computer.  I am grateful Tech Center Plus was there & able to assist me when I needed it.  Thank you for everything."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T22:25:08.000Z",
          "Titre": "To get the help that I needed to be forced to buying something that I really could not afford and then it ends in 6 months",
          "Contenu": "That I could get help from anybody and I was forced into buying this I really could not afford cuz amount of severe fixed income and then it only lasts for 6 months the way my luck runs it'll end in six months in one day and I cannot afford you guys again"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-27T17:02:25.000Z",
          "Titre": "They were helpful but the tec talked to…",
          "Contenu": "They were helpful but the tec talked to fast & it was like I didn't have time to prossess everything. I am greatful for their help. I am not very good with a computor so going slow is better for me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Betty Ensminger",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T01:32:54.000Z",
          "Titre": "pressentation a little too fast",
          "Contenu": "pressentation a little too fast.  Phone says it's a spam number"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T21:58:12.000Z",
          "Titre": "Did not keep the pop ups from stopping…",
          "Contenu": "Did not keep the pop ups from stopping pop ups I had never had before."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T19:38:46.000Z",
          "Titre": "My laptop is still slow",
          "Contenu": "It appears the malware has been removed. I can’t seem to register my email for some reason"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 2,
          "Date": "2023-09-27T19:19:25.000Z",
          "Titre": "Very Very Expensive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T01:16:02.000Z",
          "Titre": "Difficult to workvwith",
          "Contenu": "I called your general number and was referred to the website after I had just spent $529 three years of malware.  I was not happy.  I was told that I would be given a special number and wasn't.  I finally got it from Alan.  He removed my Geek Squad application.  Now I have to figure out how to get it back.  I am  81 and my husband has Parkinson's.  I  did get all the malware removed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rodolfo",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T20:33:45.000Z",
          "Titre": "Prompt response",
          "Contenu": "Prompt response, and follow through on what was promissed"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T00:44:25.000Z",
          "Titre": "I'm  hopeing this is a viable company",
          "Contenu": "I'm  hopeing this is a viable company.  the tecks were very patient and helpful"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "william halsey",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T22:19:09.000Z",
          "Titre": "They were helpful and efficient"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T23:16:24.000Z",
          "Titre": "The people are very patient with me",
          "Contenu": "The people are very patient with me.  They seem very knowledgeable and curteous."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "lil",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T23:03:48.000Z",
          "Titre": "everyone was very helpful and patient",
          "Contenu": "everyone was very helpful and patientdid a great job"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ed Travers",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T19:10:27.000Z",
          "Titre": "Responsive and helpful guide to…",
          "Contenu": "Responsive and helpful guide to removing hostage ware and hacker attempts. Very professional and timely dedication to my problems . However found the remedy a little more expensive than thought"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charles Skinner",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T23:29:04.000Z",
          "Titre": "The employee was very helpful and I was…",
          "Contenu": "The employee was very helpful and I was able to follow instructions and complete the task.  Of course the results will be the final"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jarvis",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T01:09:58.000Z",
          "Titre": "Staff knowledge and willingness to…",
          "Contenu": "Staff knowledge and willingness to consider all options."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bobbie",
          "Nb_Reviews": 5,
          "Date": "2023-12-01T20:16:12.000Z",
          "Titre": "Took a long time but it appears  to be…",
          "Contenu": "Took a long time but it appears  to be fixed. It also cost much more than I thought it should."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas Baker",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T00:49:15.000Z",
          "Titre": "all personnell are very polite and seem…",
          "Contenu": "all personnell are very polite and seem extremely versed at their job. I would like to thank everyone for the help."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "orlando",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T20:33:02.000Z",
          "Titre": "aaron kept me informed on what was…",
          "Contenu": "aaron kept me informed on what was being done and guided me easily on where to look for information"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sherry",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T22:36:25.000Z",
          "Titre": "Wonderful and quick service...techical…",
          "Contenu": "Wonderful and quick service...techical support team was great!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Corliss Faison",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T21:49:08.000Z",
          "Titre": "The support was done in a short time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joseph Harris",
          "Nb_Reviews": 1,
          "Date": "2023-07-29T00:32:27.000Z",
          "Titre": "I was pleased that my cleanup went well…",
          "Contenu": "I was pleased that my cleanup went well and I hope the new security software will be excellent."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Peggy",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T22:22:04.000Z",
          "Titre": "Tech Center Plus resolved my issue and…",
          "Contenu": "Tech Center Plus resolved my issue and provided a plan for any future issues that may arise."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ah Lan",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T00:43:44.000Z",
          "Titre": "So far the technician Edmon and Logan…",
          "Contenu": "So far the technician Edmon and Logan has helped me to resolve my issue.   I need to see in the next few days or weeks how I feel about it all."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nelson",
          "Nb_Reviews": 2,
          "Date": "2023-07-14T21:49:53.000Z",
          "Titre": "This is a very scary situation",
          "Contenu": "This is a very scary situation.  I am trying this to find out how the computer works.  After checking it out, I will rate the experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joan Ricca",
          "Nb_Reviews": 2,
          "Date": "2023-11-02T22:51:01.000Z",
          "Titre": "It seems like a long process but it was…",
          "Contenu": "It seems like a long process but it was successful"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Whitney Miller",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T22:27:42.000Z",
          "Titre": "the experience was fast and helpful and…",
          "Contenu": "the experience was fast and helpful and I was able to get in contact with someone with no problems"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T00:31:47.000Z",
          "Titre": "google Microsoft help gave me a phone…",
          "Contenu": "google Microsoft help gave me a phone number I called tech center charged me $265. I hope it is fixed"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RICHARD McDonald",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T01:18:13.000Z",
          "Titre": "cleaned up system in good manner help…",
          "Contenu": "cleaned up system in good manner help me out and expland new product to me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ronald",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T23:29:19.000Z",
          "Titre": "they completed their task professionly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "paul steele",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T19:32:32.000Z",
          "Titre": "My experience was fine",
          "Contenu": "My experience was fine, however i do not like when i have any problem feeling like i am under a pressure cooker to buy a product especially when you are paying for another service !"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T20:03:22.000Z",
          "Titre": "Good but pricey",
          "Contenu": "They solved the problem but I had to add some expensive software."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dae Davis",
          "Nb_Reviews": 1,
          "Date": "2022-11-16T20:59:51.000Z",
          "Titre": "My experience was worth the trouble I…",
          "Contenu": "My experience was worth the trouble I was having to finally get rid of these scammers. I appreciate the help I  have received from your company."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cheryl",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T20:33:09.000Z",
          "Titre": "Never had this experience before",
          "Contenu": "Never had this experience before.  I think it was alright."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "kenneth",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T20:21:22.000Z",
          "Titre": "all seems to be taking care of and i am…",
          "Contenu": "all seems to be taking care of and i am satisfied.mvery helpful thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brenda Cox",
          "Nb_Reviews": 2,
          "Date": "2023-07-10T21:12:42.000Z",
          "Titre": "THANK YOU FOR YOUR SUPPORT",
          "Contenu": "THANK YOU FOR YOUR SUPPORT. WE APPRECIATE YOUR HELP."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jolie",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T20:06:53.000Z",
          "Titre": "got rid of the trojan"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "M L Merwin",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T23:57:44.000Z",
          "Titre": "The team was timely and helpful as I…",
          "Contenu": "The team was timely and helpful as I dealt with a terrible computer hack."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Leesa",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T19:03:03.000Z",
          "Titre": "Patience and taking time to explain…",
          "Contenu": "Patience and taking time to explain things."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T23:39:10.000Z",
          "Titre": "very helpful for me thankyou."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Terri Bee",
          "Nb_Reviews": 1,
          "Date": "2022-10-28T22:11:43.000Z",
          "Titre": "I appreciated the calm helpful way the…",
          "Contenu": "I appreciated the calm helpful way the tech helped me work through my computer crisis. I did feel like I had a hard sell of one product which is irritating. I am hopeful this product will be as good as advertised by the tech!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tony",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T23:08:10.000Z",
          "Titre": "Technical supports were very freindly…",
          "Contenu": "Technical supports were very freindly anf helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "pattricia brown",
          "Nb_Reviews": 1,
          "Date": "2022-10-12T19:25:31.000Z",
          "Titre": "Tech Centre Plus was great to work with…",
          "Contenu": "Tech Centre Plus was great to work with in setting up our new computer. They transferred all needed programs, files and data from old computer to new computer very quickly. Instructed us on how to use the new features and set up our wireless printer.the staff here is very friendly and very professional. We enjoyed our experience with Tech Centre Plus today. Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Josephcustomer",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T22:39:43.000Z",
          "Titre": "my issues were resolved fully."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "gbola ayodele",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T00:15:23.000Z",
          "Titre": "i love their timely and resolution to…",
          "Contenu": "i love their timely and resolution to my problems"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kimberly Chatman",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T18:14:20.000Z",
          "Titre": "Tech Support was friendly",
          "Contenu": "Tech Support was friendly, quick and efficient. Thank You!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Salsabil Aziz",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T21:43:24.000Z",
          "Titre": "It was very efficient and quick"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2022-09-30T01:33:29.000Z",
          "Titre": "I HAD A PROBLEM WITH NOT BEING ABLE TO…",
          "Contenu": "I HAD A PROBLEM WITH NOT BEING ABLE TO SEND EMAILS OR RECEIVE THEM. THE TECHINIANS WERE VERY PATIENT WITH ME AS I AM NOT TECH SAVY.  THE ONLY ISSUE I HAD WAS TO UNDERSTAND THEM AS THE HAD AN ACCENT AND NOT ABLE TO HEAR THEM ALL THE TIME."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve Dibya",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T23:01:36.000Z",
          "Titre": "My computer was hacked",
          "Contenu": "My computer was hacked, now it is fully resolved."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T23:43:29.000Z",
          "Titre": "Hoping the problems are solved",
          "Contenu": "Hoping the problems are solved.  ."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2022-09-12T22:28:42.000Z",
          "Titre": "I was very happy with the support that…",
          "Contenu": "I was very happy with the support that I received today. The only thing that did not go smoothly was when I was talking to the first agent, the phone connection was poor. He did however call me back whenever we were disconnected and I didn't have to worry too long :)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "arnoldbrry",
          "Nb_Reviews": 2,
          "Date": "2023-05-18T02:19:34.000Z",
          "Titre": "thank you",
          "Contenu": "thank you , your response was helpful"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T21:56:21.000Z",
          "Titre": "Agent was friendly and knowledgeable",
          "Contenu": "Agent was friendly and knowledgeable, and resolved issues efficiently."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T19:39:57.000Z",
          "Titre": "They removed our virus."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Harold Hill",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T20:51:07.000Z",
          "Titre": "Getting rid of the issue.Problem",
          "Contenu": "Getting rid of the issue."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customerNeta",
          "Nb_Reviews": 1,
          "Date": "2023-07-15T21:08:53.000Z",
          "Titre": "The patience he had with me",
          "Contenu": "The patience he had with me.  I was afraid I was being scammed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Angela",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T19:49:06.000Z",
          "Titre": "solved my problem"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T18:56:39.000Z",
          "Titre": "Very thorough. Great job!",
          "Contenu": "Helped me through the process and was very patient. Helped a lot!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Olsen",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T23:59:58.000Z",
          "Titre": "Good service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Denise",
          "Nb_Reviews": 5,
          "Date": "2021-04-05T18:35:40.000Z",
          "Titre": "The cost was a little high, but the service was great!",
          "Contenu": "The cost was a little high which is why I deducted one star, but the service was great! My husbands computer was infected with a virus that locked it up and told us to call a 1-800 number. We called Microsoft instead and told us that 1-800 number was scammers and the Tech Center Plus people cleaned up the virus and anything else they found and the computer is back to working great! Thanks guys."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Raymond shofner",
          "Nb_Reviews": 1,
          "Date": "2022-10-18T19:32:43.000Z",
          "Titre": "the service was apparently effective if…",
          "Contenu": "the service was apparently effective if quite pricey, hopefully this solves all my issues. thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "lillian",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T23:12:36.000Z",
          "Titre": "was very helpful when first called"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sonia Scott",
          "Nb_Reviews": 2,
          "Date": "2022-10-21T22:18:22.000Z",
          "Titre": "Great experience with technician",
          "Contenu": "Great experience with technician.  Everything was explained in terms not so technical."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Audrey",
          "Nb_Reviews": 2,
          "Date": "2023-11-02T21:42:33.000Z",
          "Titre": "I am now covered from bad guys"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ben",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T19:41:29.000Z",
          "Titre": "resolved",
          "Contenu": "resolved, thx"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Roger Brunkow",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T21:42:25.000Z",
          "Titre": "Solved the poblem"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "donald pittsley",
          "Nb_Reviews": 1,
          "Date": "2022-08-30T21:03:26.000Z",
          "Titre": "Techs were very helpful and solved the…",
          "Contenu": "Techs were very helpful and solved the problem.Only complaint would be difficulty understanding due to accent but we managed ok"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CP",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T15:10:00.000Z",
          "Titre": "He solved the problem."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joshua",
          "Nb_Reviews": 2,
          "Date": "2022-07-06T23:02:45.000Z",
          "Titre": "The experience I had was very good I…",
          "Contenu": "The experience I had was very good I found this company very useful, but it was very expensive but overall it was a good experience"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JoAnn Atkins",
          "Nb_Reviews": 1,
          "Date": "2021-03-29T21:30:15.000Z",
          "Titre": "I was having problems with my email",
          "Contenu": "I was having problems with my email, saying it needed to be updated all the time. Technician got it corrected. Also computer kept saying it couldn't update. He fixed that also."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Judy Almquist",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T20:39:29.000Z",
          "Titre": "Was a help to solve problems"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "kendall jamisoner",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T00:42:13.000Z",
          "Titre": "helpful",
          "Contenu": "techs were efficient"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T02:06:56.000Z",
          "Titre": "got my computer fixed"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lisa Newell",
          "Nb_Reviews": 1,
          "Date": "2022-09-09T20:27:57.000Z",
          "Titre": "this service helped",
          "Contenu": "this service helped , but cost is high for only 6 months, but am grateful for this help"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ricardo grant",
          "Nb_Reviews": 2,
          "Date": "2022-06-23T21:15:18.000Z",
          "Titre": "The tech support was verry helpful he…",
          "Contenu": "The tech suport was verry helpful he took care of all the problem on my pc.I am verry pleased with there service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Phillip",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T00:48:05.000Z",
          "Titre": "Great Experience"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Theresa Morris",
          "Nb_Reviews": 1,
          "Date": "2021-12-17T20:07:54.000Z",
          "Titre": "Helpful tech",
          "Contenu": "My computer locked up. Made a call to the techs and they were very helpful, efficient and businesslike in resolving the issue."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MOWELL",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T19:40:25.000Z",
          "Titre": "They are professional"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rom",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T22:45:37.000Z",
          "Titre": "Good job..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marie",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T00:02:22.000Z",
          "Titre": "OUTSTANDING BY BOTH SERVICE…",
          "Contenu": "OUTSTANDING BY BOTH SERVICE REPRESENTATIVE AND TECHNICAL SUPPORT"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LOLETA TRIPLETT",
          "Nb_Reviews": 1,
          "Date": "2022-11-08T01:36:01.000Z",
          "Titre": "VERY USEFUL GREAT SERVICE"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Avery Heidenthal",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T01:37:16.000Z",
          "Titre": "The service was good"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-10-22T23:00:00.000Z",
          "Titre": "people were efficient and patient"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Greg",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T21:42:22.000Z",
          "Titre": "Good job  thanks for your help"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patty Yetter",
          "Nb_Reviews": 1,
          "Date": "2022-06-28T22:10:35.000Z",
          "Titre": "I am thankfull for your help and how…",
          "Contenu": "I am thankfull for your help and how easy it was to get this fixed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve Leverone",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T20:28:34.000Z",
          "Titre": "They helped me after I",
          "Contenu": "They helped me after IWas hacked"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 1,
          "Date": "2022-09-03T03:55:35.000Z",
          "Titre": "Ever thing went find however the…",
          "Contenu": "Ever thing went find however the session was long"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anthony LaRosa",
          "Nb_Reviews": 1,
          "Date": "2022-07-14T01:24:37.000Z",
          "Titre": "Thank you for the Great Job on my…",
          "Contenu": "Thank you for the Great Job on my laptop and computer ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patti",
          "Nb_Reviews": 1,
          "Date": "2022-10-19T21:03:16.000Z",
          "Titre": "it was good",
          "Contenu": "it was good.  9 of 10"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Roberta",
          "Nb_Reviews": 1,
          "Date": "2022-06-10T20:54:38.000Z",
          "Titre": "I  am happy  with the help of my …",
          "Contenu": "I  am happy  with the help of my  computer  thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carorle",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T19:29:21.000Z",
          "Titre": "thanks for the help"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "susan felsenheld",
          "Nb_Reviews": 1,
          "Date": "2022-06-29T23:21:03.000Z",
          "Titre": "you were very helpful & followed up…",
          "Contenu": "you were very helpful & followed up with me"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karen",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T19:56:23.000Z",
          "Titre": "thank you.."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve razz",
          "Nb_Reviews": 1,
          "Date": "2022-09-06T21:12:02.000Z",
          "Titre": "everyone was very helpful"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Edmund kanitra",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T19:21:57.000Z",
          "Titre": "Nice job..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charles",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T20:03:56.000Z",
          "Titre": "Good work!..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gregory",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T01:28:32.000Z",
          "Titre": "The thing that made my experience great…",
          "Contenu": "The thing that made my experience great was we got the computer cleaned up and running without any problems. The company responds in a timely manner and professional. They also explained and communicated well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T23:21:52.000Z",
          "Titre": "Logan is a great and patient…",
          "Contenu": "Logan is a great and patient communicator.  He kept me from getting disappointed and was very pleasant.  He is also a very knowledgeable person and I appreciate him.  He is a keeper."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Desiree Romero",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T23:50:48.000Z",
          "Titre": "tech was supportive and knowledgeable…",
          "Contenu": "tech was supportive and knowledgeable and knew exactly what needed to be done to solve the problem quickly and efficiently"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bj Brown",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T21:13:06.000Z",
          "Titre": "The personnel I spoke with during the…",
          "Contenu": "The personnel I spoke with during the entire process of installing Microsoft 365 were great and pleasant to chat with.  They were very patient with me as I am not that computer literate.  Thanks for their understanding.Betty Brown"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T23:26:05.000Z",
          "Titre": "Aaron was very patient",
          "Contenu": "Aaron was very patient, professional and knowledgeable and answered all my questions. It was a pleasure dealing with him."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "december_yahoo.com",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T22:35:18.000Z",
          "Titre": "Malware",
          "Contenu": "The process took a while.  Malware was in laptop.  Mark explained clearly the problem and that it needed immediate attention.  I purchased a complete security program.  Owen was the tech that cleaned laptop of the malware.  Confirmed to me that laptop was clean and ready to go.  Happy that computer is back and ready to go."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "kristi",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T20:14:21.000Z",
          "Titre": "resolved a very bad situation  both…",
          "Contenu": "resolved a very bad situation  both gentleman were extremly helpful and patient  thank you both"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Gregory",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T02:05:40.000Z",
          "Titre": "I was entangled in a mess with criminal…",
          "Contenu": "I was entangled in a mess with criminal attempts to access my financial data. Tech Center + bailed me out! Thank you gentlemen for your help!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tammy Denton",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T01:18:16.000Z",
          "Titre": "Alan was so awesome.",
          "Contenu": "Alan was so awesome.. He was very thorough. He explained everything he was doing so I could understand."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gene Rice",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T02:19:50.000Z",
          "Titre": "Greate service they did what needed to be done",
          "Contenu": "the service agent took control and did what needed to be done, after which, explained what was done."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathleen Sourk",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T19:37:47.000Z",
          "Titre": "I panicked when I had the malware",
          "Contenu": "I panicked when I had the malware,  The techs were very kind and explained what they will do to fix it.  They did not get angry when I did not understand something"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Nina Rica Martin",
          "Nb_Reviews": 3,
          "Date": "2023-12-15T04:53:02.000Z",
          "Titre": "The company’s work ethic is second to…",
          "Contenu": "The company’s work ethic is second to none! The team is always responsive, prioritizes accuracy, and delivers exceptional work on time making them a viable choice for many people."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Boeder",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T02:00:17.000Z",
          "Titre": "The technicians from Tech Center Plus…",
          "Contenu": "The technicians from Tech Center Plus were very knowledgeable about addressing and correcting my computer issue.  Job well done!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julia Lauwagie",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T22:49:25.000Z",
          "Titre": "Easy to connect and understood how to…",
          "Contenu": "Easy to connect and understood how to resolve right away.Was able to speak to someone ove the phone"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick Ormond",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T01:53:52.000Z",
          "Titre": "Aaron did a great job of making repairs…",
          "Contenu": "Aaron did a great job of making repairs and explaining what he was going to do. I feel a lot better now.thank you for everything"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rose Pitman",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T00:49:00.000Z",
          "Titre": "I have been trying to resolve my…",
          "Contenu": "I have been trying to resolve my Outlook issue for several weeks and finally got ahold of your team and they fixed my issue in a short time. Thx"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ellen Burke",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T22:56:32.000Z",
          "Titre": "Bill and Alan were very professional…",
          "Contenu": "Bill and Alan were very professional and competent.  They were easy to talk to and they were very patient with a non-computer savvy person.   I appreciate all that they did and my computer is not sick anymore!  Thank you!  Ellen"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vicki Looka",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T20:08:17.000Z",
          "Titre": "Both tech people that I spoke to were…",
          "Contenu": "Both tech people that I spoke to were courteous and professional. My issue was quickly resolved."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-12-05T21:27:21.000Z",
          "Titre": "GREAT JOB FROM TECH SUPPORT CREW…",
          "Contenu": "It was an absolutely terrible experience, but with the help of Tech support, they got me through this.  They actually did a great job.  I did have a little trouble dealing with some of the accent and broken English but we got through it together.  Thank you to Logan,and all of the crew in India for their patient way of helping me.GREAT JOB."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Orlando Dozier",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T23:03:16.000Z",
          "Titre": "The techs were very helpful &…",
          "Contenu": "The techs were very helpful & knowledgeable about solving my issue. They were also very courteous & polite to me. Thank you so much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Victoria Saltsman",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T23:19:17.000Z",
          "Titre": "personnel were patient and kind",
          "Contenu": "personnel were patient and kind. got the job done"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T23:01:27.000Z",
          "Titre": "Gentleman who answered the phone…",
          "Contenu": "Gentleman who answered the phone explained the process very clearly and stayed on the phone until I was completely satisfied.He understood how scary the situation was for me and was able to address my fears and was reassuring.What could have been a disaterous situation was resolved quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rochella Cooper",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T19:33:36.000Z",
          "Titre": "Problem solved",
          "Contenu": "Aaron did a great job. Mark gave me more information than I needed. I realize he was trying to help but the information was overwhelming. Thank you Mark."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Beverly",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T22:02:08.000Z",
          "Titre": "I can’t thank you enough for all your…",
          "Contenu": "I can’t thank you enough for all your help today.  I appreciate everything that was done for me today.  All the technicians that helped me were very professional and courteous."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Delores A Nikkila",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T23:52:10.000Z",
          "Titre": "A super fast and wonderful fix",
          "Contenu": "A super fast and wonderful fix! So grateful for their expertise. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T22:15:19.000Z",
          "Titre": "My tech issue has been resolved",
          "Contenu": "My tech issue has been resolved.  Thank you Owen Logon for your wonderful help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JOSEPH MARYUMA",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T00:05:38.000Z",
          "Titre": "Experience was great",
          "Contenu": "Experience was great. Very quick to fix problem with internet. Great Support!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "The Dune",
          "Nb_Reviews": 5,
          "Date": "2023-11-28T22:08:25.000Z",
          "Titre": "I had a hacker issue and when I…",
          "Contenu": "I had a hacker issue and when I contacted Microsoft Anthony was quick to react and respond to the issue. After he completed his quick action he connected me to Logan. He quickly to control of the issue and did a fabulous job to reolve the hacker problem and restore my computer to a completly safe mode and installed their premium Malwarebytes computer protection program. I feel safe and protected and want to thank them for a wonderful job !!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary Morstad",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T23:08:26.000Z",
          "Titre": "It was fast and easy",
          "Contenu": "It was fast and easy. the people i spoke with explained every step and we were able to resolve it quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:59:49.000Z",
          "Titre": "prompt and courteous service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barbara Williams",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T19:44:30.000Z",
          "Titre": "Quickly solved my problem",
          "Contenu": "Quickly solved my problem.  Were prompt in all questions and called back to see if I had any more questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leo Swantek",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T23:18:29.000Z",
          "Titre": "technichian did great job, all works well, comunicted and complerd well"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barbara Benney",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T23:01:55.000Z",
          "Titre": "Everyone that I have come in connect…",
          "Contenu": "Everyone that I have come in connect with has been very professional and technically an expert in their field."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vincent Boseman",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T02:13:09.000Z",
          "Titre": "They fix virus issue on my computer…",
          "Contenu": "They fix virus issue on my computer awesome people."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gertrude Mcclure",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T21:37:53.000Z",
          "Titre": "they were very helpful in resolving our…",
          "Contenu": "they were very helpful in resolving our spam issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T18:59:38.000Z",
          "Titre": "The service techs provided me with…",
          "Contenu": "The service techs provided me with excellent service. Logan was very patient and professional. I would rate him a (10 out of 10)Thanks for helping me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gaylon WesleyBrooks",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T23:13:42.000Z",
          "Titre": "the patience of the people that…",
          "Contenu": "the patience of the people that assisted me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T23:00:18.000Z",
          "Titre": "Logan and Bill",
          "Contenu": "Logan and Bill made my experience very pleasant.  They were models of customer service and customer education.  The company is quite fortunate to have them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "olushola olawuyi",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T17:55:44.000Z",
          "Titre": "At Tech Center plus you get the best…",
          "Contenu": "At Tech Center plus you get the best deal of computer systems, with a great sales and services that will suit you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T00:57:54.000Z",
          "Titre": "Mr. Logan did a GREAT job",
          "Contenu": "Mr. Logan did a GREAT. Due to his knowledge and experience he was able to rectify my mistakes and reconfigure my computer in a timely manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T02:03:02.000Z",
          "Titre": "They were very professional",
          "Contenu": "They were very professionaland guided me every step of the way. Could'nt ask for better service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shirley Montgomery",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T22:11:27.000Z",
          "Titre": "Wonderful service",
          "Contenu": "Wonderful service.  Everyone was nice and helpful.  I am an elderly woman and do not understand how to do everything.  They were very helpful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T20:07:54.000Z",
          "Titre": "The analyst understood the issue and…",
          "Contenu": "The analyst understood the issue and went straight to work. They were very professional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathy",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T22:54:37.000Z",
          "Titre": "quick service",
          "Contenu": "quick service, explained everything,,and got the job done,  thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rita Rice",
          "Nb_Reviews": 2,
          "Date": "2023-11-25T00:57:52.000Z",
          "Titre": "LOGAN AND HIS TEAM WERE ABLE TO UNDO MY…",
          "Contenu": "LOGAN AND HIS TEAM WERE ABLE TO UNDO MY PROBLEMS I DIDNT EXPECT TO HAVE A COST BUT HE EXPLAINED IT TO VERY CLEAERLY WHY I HAD THE COST AND I HOPE THERE WILL NBE NO MORE PROBLEMS BUT IF I DO I NOW HAVE A SUPPORT TEAM"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T23:47:00.000Z",
          "Titre": "Thank you Tech Support",
          "Contenu": "Thank you Tech Support.  The issue of the virus has been eliminated."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T20:19:19.000Z",
          "Titre": "work was done in short time",
          "Contenu": "work was done in short time, but we have not been able to use it yet to see how the performance is"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T01:25:00.000Z",
          "Titre": "They helped me reinstall malwarebites…",
          "Contenu": "They helped me reinstall malwarebites after my computer software was reinstalled"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T21:05:40.000Z",
          "Titre": "Iwas helped step by step through the…",
          "Contenu": "Iwas helped step by step through the process and much patience on his part was demonstrated"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janet McLaughlin",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T21:30:04.000Z",
          "Titre": "Patient",
          "Contenu": "Patient, professional and efficient service with Arhab and Bill! thank you for all your help!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Glen Schanck",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T20:01:27.000Z",
          "Titre": "Techs have terrific patients and helped…",
          "Contenu": "Techs have terrific patients and helped me get my lap top back up and running, thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Judith Foglia",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T21:49:20.000Z",
          "Titre": "Totally being honest",
          "Contenu": "Totally being honest, Sam and Logan patient, knowledgeable.  These 2 gentlemen resolved many issues I had. I feel secure with my new subscription with Malwarebytes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "custAnn Greimomer",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T00:48:34.000Z",
          "Titre": "Francis in particular was wonderful &…",
          "Contenu": "Francis in particular was wonderful & patient. Logan came in & finalized the work. They were both great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KATHY V LAQUEY",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T00:29:25.000Z",
          "Titre": "They were very helpful and resolved the…",
          "Contenu": "They were very helpful and resolved the issue quickly.!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alfred Keene",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T21:36:42.000Z",
          "Titre": "Great support and solved my problems"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sharon",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T20:19:19.000Z",
          "Titre": "I was very please with the service of…",
          "Contenu": "I was very please with the service of Microsoft techs.They were extremely informative and professdional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cindy Lee Ramsfield",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T19:31:55.000Z",
          "Titre": "the service was great and fast"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas Frankson",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T01:13:57.000Z",
          "Titre": "The service was great"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "candace Goodyear",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T21:00:41.000Z",
          "Titre": "The work was prompt and the feedback…",
          "Contenu": "The work was prompt and the feedback and explanations good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Simone",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T22:35:15.000Z",
          "Titre": "Great job",
          "Contenu": "Great job. They fixed my issue and were very professional and courteous. Highly recommend them.Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "harold houck",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T22:04:53.000Z",
          "Titre": "Alan was very helpful and patient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LaVonne Sallee",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:05:56.000Z",
          "Titre": "it was a good session"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary J Broughton",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T22:55:35.000Z",
          "Titre": "Even though I was having trouble with…",
          "Contenu": "Even though I was having trouble with my responses my technician was very patient with me.  My problem .was resolved,"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Virginia ricci",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T23:47:52.000Z",
          "Titre": "The problem I was having has been…",
          "Contenu": "The problem I was having has been resolved by Tech Center Plus."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arnold",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T22:25:45.000Z",
          "Titre": "Very courteous demeanor",
          "Contenu": "Very courteous demeanor. The men who worked with me seemed very competent!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T18:55:56.000Z",
          "Titre": "called microsoft for tech support and I…",
          "Contenu": "called microsoft for tech support and I was helped right away and got my computer fixed"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customeBetty Shawr",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T21:28:13.000Z",
          "Titre": "Thank you for your knowledgeable and…",
          "Contenu": "Thank you for your knowledgeable and courteous help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janet Hitchcock",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T22:16:49.000Z",
          "Titre": "It solved my virus issues and  and…",
          "Contenu": "It solved my virus issues and  and cleaned my computer and installed virus protection for the future"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elizabeth",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T20:06:32.000Z",
          "Titre": "staff was patient with me- and appears…",
          "Contenu": "staff was patient with me- and appears issues have been resolved"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T20:50:42.000Z",
          "Titre": "Great customer Servce",
          "Contenu": "Great customer Servce , promt with what you ask for ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RU",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T22:48:17.000Z",
          "Titre": "What was a quick fast easy repair…",
          "Contenu": "What was a quick fast easy repair service. Thank you Techsupport. RU"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donna",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T22:45:12.000Z",
          "Titre": "Bill and Logan were very helpful in a…",
          "Contenu": "Bill and Logan were very helpful in a stressful situation. Thanks again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T22:15:11.000Z",
          "Titre": "You have been great",
          "Contenu": "You have been great , helpful  and patient too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "bonnie",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T19:52:20.000Z",
          "Titre": "Service was fast and very polite."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Howling Helmets",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T22:06:27.000Z",
          "Titre": "The representatives were patient and…",
          "Contenu": "The representatives were patient and respectful to me, and fixed my computer, looking forward to 3 years of successful business together, Arline Huddleson"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MIIKE B",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T00:06:01.000Z",
          "Titre": "people were very knowledgeable and took…",
          "Contenu": "people were very knowledgeable and took care of my issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T23:46:18.000Z",
          "Titre": "Good service",
          "Contenu": "Good service, problem solved."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T01:30:11.000Z",
          "Titre": "Both Francis and Logan were very…",
          "Contenu": "Both Francis and Logan were very helpful fixing our computer problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debbie C. in Delaware",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T21:24:43.000Z",
          "Titre": "I got quick replies and expert help",
          "Contenu": "I got quick replies from both Anton and Logan and fast, expert help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hugh",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T22:49:34.000Z",
          "Titre": "They took care of an issue that what is…",
          "Contenu": "They took care of an issue that what is completely foreign to me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda Wagner",
          "Nb_Reviews": 3,
          "Date": "2023-11-28T21:34:55.000Z",
          "Titre": "I was well taken care of",
          "Contenu": "I was well taken care of, in a very professional manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leslie",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T00:00:09.000Z",
          "Titre": "very patient with me during process"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T22:28:54.000Z",
          "Titre": "This service call was professionally…",
          "Contenu": "This service call was professionally and timely completed.  The explanation and process was well done."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Russel Lloyd Rankin",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T02:40:35.000Z",
          "Titre": "No one likes to have to worry about…",
          "Contenu": "No one likes to have to worry about things they know nothing about. The people that helped me today could not have done any better. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "judy",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T19:09:23.000Z",
          "Titre": "Service was curtious and was explained…",
          "Contenu": "Service was curtious and was explained clearly along the way. Very professional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ted",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T21:08:59.000Z",
          "Titre": "Logan talked me thru anything and was…",
          "Contenu": "Logan talked me thru anything and was very helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T22:54:49.000Z",
          "Titre": "Very professional",
          "Contenu": "Very professional. My first time with this, so I'll have to see how thins workout over time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T18:57:17.000Z",
          "Titre": "So far so good...Always scary to have…",
          "Contenu": "So far so good...Always scary to have computer issues!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Renee",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T20:06:32.000Z",
          "Titre": "The person that helped me (Aaron) Made…",
          "Contenu": "The person that helped me (Aaron) Made me feel so much safer. This was the best service ever. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gary",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T02:18:43.000Z",
          "Titre": "Could not have done it with out…",
          "Contenu": "Could not have done it with out excellence service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deborah",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T19:28:15.000Z",
          "Titre": "Aaron and Sarah were awesome",
          "Contenu": "Aaron and Sarah were awesome.  They did an amazing job and so pleasant to work with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lucy",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T02:14:05.000Z",
          "Titre": "very patience and worked with my daughter to restart",
          "Contenu": "ery patience and worked with my daughter to restart"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JJerry",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T19:34:45.000Z",
          "Titre": "All issuse fixed within 30mins first…",
          "Contenu": "All issuse fixed within 30mins first call"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "brian Kaplan",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T23:19:16.000Z",
          "Titre": "great experience",
          "Contenu": "great experience. very nice guy and resoled my issue"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jacki",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T22:11:23.000Z",
          "Titre": "Very Helpful and pleasant",
          "Contenu": "Very Helpful and pleasant. Thank you Mark and Aaron"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T20:04:37.000Z",
          "Titre": "Help When Needed",
          "Contenu": "They were very professional and helped me out Greatly!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T20:41:56.000Z",
          "Titre": "Very good service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gregory",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T02:34:20.000Z",
          "Titre": "Thank you for all your help great job"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dennis Sipe",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T19:43:06.000Z",
          "Titre": "Outstanding service",
          "Contenu": "Outstanding service.  I will recommend your company to friends"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Louis",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T21:32:52.000Z",
          "Titre": "JOb well done and explained to me in…",
          "Contenu": "JOb well done and explained to me in advance"
        }
      ]
    }
  ]
}