{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "tello.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jonathan Arnold",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T11:17:29.000Z",
          "Titre": "I think I got tricked into paying for…",
          "Contenu": "I think I got tricked into paying for something I didn't need... I lost my phone and wanted to DO something!But I should have waited, gotten another phone and ported that in... I am 77 years old, and don't have a good grasp of how to deal with this techie world and the people who are out to just SKIN me, financially. Anyway, thanx for NOTHIN, TELLO..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bibhu Dash",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T12:29:05.000Z",
          "Titre": "Tello pathetic service",
          "Contenu": "Tello have very pathetic service. Their customer care executives don’t have knowledge over their services. For any issue they can just create service ticket. But you will on the mercy of technical team. And there is no ETA or responsibility technical team has. Very bad in communication."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "stephen smith",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T20:46:42.000Z",
          "Titre": "Researched endlessly, Still Lied to and Cheated!",
          "Contenu": "Researched, read reviews, kept looking for wifi hotspot provider, which Tello claimed they would provide.  Their map claims to have good coverage where I was.  It sucked!  Not just a little bad, horrible.  I could compare it to other wifi in coffee shops, et cetera, and it still sucked.  Away from a little town--almost nothing.  I had continually tried to impress upon any Tello representative that wi fi hot spot was my priority.  Always heartfelt promise of not just good or acceptable service, but rather the best!!!!   Not true.  Any and all promises now from Tello are subject to the most stringent scrutiny.  They have all drunk the kool-aid.  More BS from yet another rip off phone company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T08:27:55.000Z",
          "Titre": "Customer Service rep didn't read the responses I gave, kept asking cookie cutter questions that didn't suit the problem",
          "Contenu": "Poor interaction. Representative asked for an order number, there wasn't one I could see. They didn't understand the issue and gave a standard response instead of an appropriate one. They then find the information later and no longer request the order number, then they ask for the error message after already having provided it to you multiple times. Then throughout describing the issues I was having they kept answering the same unhelpful answer, showing they didn't actually listen to the questions/info I was asking about. They then kept asking the same question instead of actually reading the response. Then at the end it was frustrating to ask for this survey multiple times, and instead being told to call in about the issue, then was told I asked about the order number ('Order' was the first word of the error message, but never anything about an order number) when the transcript shows I never did.Just please, for the love of god read the responses, and answer. Especially when I'm already doing what you ask. But if I have to explain the same thing to you multiple times because you can't get it the first 2-3 times... not even using different words, just copy/pasting the exact same error message. It's frustrating and makes me feel like you do not care about the customer in the least. You're putting zero effort into the interaction. The whole point of contacting Tello was because the other carrier said Tello was denying the request, there was nothing more they could do. Understand that I'm just trying to get to the bottom of it.EDIT: \"We noticed that you were able to port your number successfully, the rejections were due to the incorrect port information provided on the request itself\" - INCORRECT. The port request was successful because I altered my Tello address multiple times with false/different addresses in order to finally get the porting to go through. It wasn't that I needed to correct the address in there, it was that the address in there wasn't working, as I tried telling your representative multiple times. Even copying and pasting and ensuring no errant spaces/characters were present. I had to put in bogus addresses until one worked."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jamie B",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T18:35:34.000Z",
          "Titre": "Not enough data for pricing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "mj",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T13:33:53.000Z",
          "Titre": "Find another carrier",
          "Contenu": "I'll be on line one minute and then can't be connected moments later even though I'm stationary and in the same spot. Sorry, sorry internet service even though the phone shows a good connection. This has happened so many times with your service that I'm looking to switch.Update to carrier response: this has happened to 3 different phones, all were unlocked, all GSM compatible, variety of settings/ locations. I always check phone's compatibility prior to purchase."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ashvin Patel",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T14:49:51.000Z",
          "Titre": "Customer service is good but cell…",
          "Contenu": "Customer service is good but cell service is worst. Do not get incoming calls sometimes on my 3 different phones. When run out of data get lower than 2g speed. Price is not competitive any more so ready to switch soon after so many years as don't see any effort to improve it.Updates: customer service, please do not suggest non working solutions ( like clean sim, reboot phone). Get the same reply each time I complain and this solution does not work. Also do not advertise 2g reduced speed because I don't get even 32kbps after reduced speed where 2g speed supposed to be 64-128kbps."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "OUTRAGED MOM",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T21:50:49.000Z",
          "Titre": "BAD BAD BAD +",
          "Contenu": "Bad bad bad. I advised TELLO US my teenage daughter illegally used my card to purchase a SIM/NEW LINE after taking away her phone. After clearly explaining this to customer service they nonchalantly denied helping me and refused to give me back my money. They also took from January to March to even review the claim. 🤦🏽‍♀️ BOOST, METRO EVEN OPTIMUM has better customer service than this ☝🏽 👎🏽 👎🏽 👎🏽 👎🏽 👎🏽 never recommended-highly disapproved."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dimitri Wessendorf",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T15:49:44.000Z",
          "Titre": "Cell, network coverage is terrible",
          "Contenu": "Cell coverage is terrible, can’t even dial out.  I have to have others call me instead of calling out. Monthly 1 gig never even works. If I’m not connected to Wi-Fi forget about having any network. I’m honestly considering switching services. What’s the point of having a service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Henry Rivera",
          "Nb_Reviews": 2,
          "Date": "2023-03-11T16:18:40.000Z",
          "Titre": "They trapped me",
          "Contenu": "They trapped me with a promise of a referral bonus then said I have to downgrade to use that credit. Then when I called about this issue customer service is terrible. Didn’t even try to fix or solve the problem. In addition to this, their service is terrible the coverage map says it covers a lot of places like the other carriers but it doesn’t. Poor connection Terrible customer service"
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "Natalia Antequera",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T11:03:43.000Z",
          "Titre": "Its very hard to contact a service…",
          "Contenu": "Its very hard to contact a service agent and the webpage is not easy to figure out, information is not clear. I bought an unlimited plan but run out of data not even 2G works, which is absurd because I pay for UNLIMITED data. Very disaponting service in general."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "C.T. Taylor",
          "Nb_Reviews": 2,
          "Date": "2023-11-09T07:06:36.000Z",
          "Titre": "My pin was changed but I didnt change…",
          "Contenu": "My pin was changed but I didnt change it. They wouldnt help me with anything. Only wanted to text 12 yr old kids phone for verification. Would do nothing for me, the adult, on the phone, who pays for everything. I spoke to a customer service representative. Did not catch his name, spanish accent. Worst people skills I have ever encountered. Thank god they showed how bad they sucked before I ported the other 3 lines. Too bad cause the price is right but this guy was borderline slow at best, more likely the type of lazy that kills the companies bottom line.  DONT TRY ITThey replied to the review with a decent response. Unfortunately none of that happened. I verified everything...for a half hour  and the rude guy said his supervisor was more comfortable texting a security code to a sixth grader. So that wasn't the case for me...you're right. The case for me was I verified everything and the unnamed supervisor felt the integrity of the account was better off in the hands of a child.My pin was not changed by me. They would not help me despite my number, name and email on the account they insist on texting a code to my minor children's line. Nonsensical and In no way secure.  The response is not only stretching the truth but outright fabrication in part.  If you want a cheap line for your kids. Don't set it up with your info because they will want to text the kids line a code despite 47 minutes of verifying it's you. Not to mention the catch 22 that if you start the account with your info and buy their phones you don't know the numbers yet. How the heck can this system work? All your set up info is worthless? Now you're childs number controls the account. Not you with your actual account info.Thanks for the reply. Try hiring or training people with logic, reasoning or even compassion. What a strange apology Tello. I get where the csr developed the bad attitude. Top down."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Fedelma McKenna",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T16:04:41.000Z",
          "Titre": "Very dissatisfied",
          "Contenu": "I almost never have telephone service or connection when i need it, nor am i able to access the internet from my tello plan well - i usually have to subsist on wifi. Very dissatisfied.  Texting is terrible, I have unlimited texting plan but very often \"can't download\" the texts from contacts the SMS vs other type of texting just complicates things and makes it very difficult to use."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Peter",
          "Nb_Reviews": 6,
          "Date": "2023-02-04T19:45:09.000Z",
          "Titre": "Doesn't support visual voicemail",
          "Contenu": "Doesn't support visual voicemail.  There are no working clients for it (they used to use software that has since been abandoned).  Tello has no plans to provide customers with a working visual voicemail app anytime soon."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Adam",
          "Nb_Reviews": 2,
          "Date": "2023-04-10T11:16:21.000Z",
          "Titre": "Tello \"2g\" after data cap",
          "Contenu": "I wrote the following review on the tello blog page titled (\"What you can actually do on 2g\") , original review below. It was not approved so I left it here for others to be aware of what to expect. Actual 2g speeds are indeed usable. However, the recent testing done on the tello network of the throttled data once 4g data was exceeded left me completely dissatisfied.2g provides data transfer speeds between 64kbps and 256kbps with good reception. Using the tello network speeds were observed to be maxed out at 30kbps (0.03mbps) when the signal strength was the strongest. The testing was conducted over the course of 7 days in multiple areas with signal strength reading between -63dBm and -99dBm at testing.My observation is tello throttles data much below the standard 2g network, making their service very much unusable once data cap is reached."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Piers Worsley",
          "Nb_Reviews": 5,
          "Date": "2023-02-21T19:34:23.000Z",
          "Titre": "Try porting out of Tello!",
          "Contenu": "Try porting out of Tello!No other carrier recognizes Tello on their carrier list, so good luck porting out.And their customer service live chat or email is absolutely no help at all.On top of that, the voice calls drop and also there's crackling on the line.My advice? Stay away from Tello."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "E Landau",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T18:22:37.000Z",
          "Titre": "Phone service is a disaster",
          "Contenu": "Phone service is a disaster, many times dialing doesn't give any connections, cutting off suddenly, listening to a conference there is many cut offs in middle, very disappointed. It's everyday for quite a year."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Misha Zaslavskiy",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T02:48:07.000Z",
          "Titre": "My \"unlimited\" text service was blocked…",
          "Contenu": "My \"unlimited\" text service was blocked multiple times for no reason. Customer service is unable to provide any explanation, and I have to call and waste my time every time to turn it back on. This is unacceptable, I'm going to change provider if this situation continues."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Krabik",
          "Nb_Reviews": 1,
          "Date": "2023-08-06T23:24:58.000Z",
          "Titre": "Unlimited internet plan sucks.",
          "Contenu": "Unlimited internet plan is not 5g high speed internet. You get only 25gb of high speed data after that it is 2G speeds. Which is not enough for anything, maps loads so slow you need to wait couple minutes. Youtube doesn't play at all. 25GB goes fast in 5-6 days. For the rest of the month you stuck with 2G speeds which is useless. So dont get tello, mint mobile would be better choice."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2023-05-13T08:09:37.000Z",
          "Titre": "Customer service?",
          "Contenu": "I’m going on the third round of questions to customer service and they still have yet to answer my specific question. Not sure they understand the question or are choosing not to answer it.  So far it’s not starting out good on a customer service stand point."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gaagle Plas",
          "Nb_Reviews": 4,
          "Date": "2023-05-24T15:18:43.000Z",
          "Titre": "Worst experience with a mobile service",
          "Contenu": "Worst experience with a mobile service.  Ordered a SIM online using a promotion to try it out for a month. Got the SIM and during activation it charged me again so disputed the extra charge and found out from Tello that since I used a different email it created a new account.  Thought they'd fix it as in the email they said they would escalate internally and get back to me. Instead they suspended my account!  They then said I need to drop the dispute and they would refund my extra payment.  Seems stupid but that's how they operate.It was bad enough that they had terrible connection speeds to begin with but this just cemented my belief that this was a terrible decision to try TelloUpdate:  My account has NOT been reinstated as Tello claims, like I said in my review terrible customer serviceUpdate 2:  service is back on now and waiting for charged amounts to be corrected"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "GARY OSIER",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T16:08:44.000Z",
          "Titre": "Call forwarding",
          "Contenu": "We asked for the phone numbers to call to forward to one of our other phones, and they did not work. Otherwise my phone works fine. This is probably the 4th time in a year we have asked this question, and we seem to get a different answer each time. This time was the most straight forward, but the numbers did not work. If we could only get calls forwarded from our home phone we would have a 5 star experience."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Graeme Byous",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T09:11:07.000Z",
          "Titre": "MMS doesn't work",
          "Contenu": "MMS doesn't work. There's no data roaming. Other than porting my number, there really doesn't seem to be a point."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pamela Lowe",
          "Nb_Reviews": 1,
          "Date": "2023-01-14T17:06:28.000Z",
          "Titre": "I did not place an order with Tello",
          "Contenu": "I did not place an order with Tello. I have tried multiple ties to cancel this coverage. I have never used this company, and yet they continue to charge my credit card. A company that takes advantage of seniors. Beware!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nataliia Peresada",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T20:19:54.000Z",
          "Titre": "I can’t call to my daughter",
          "Contenu": "I can’t call to my daughter, only massage. It’s always telling me “ not in service “ or “ leave the message “. I am assuming it’s bad covering"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Perry",
          "Nb_Reviews": 4,
          "Date": "2023-09-14T15:19:48.000Z",
          "Titre": "Dirty business practices",
          "Contenu": "I started the service and before the end of the month emailed them to stop it since it is very bad. However, instead of stopping it, they continue to bill it. What a shame! What a way to do business!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Prasanthi Malapati",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T19:56:13.000Z",
          "Titre": "Worst experience",
          "Contenu": "Very very very bad signal call not connecting some no signal , voice breaking lot issues"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "PPH",
          "Nb_Reviews": 1,
          "Date": "2022-12-24T15:11:13.000Z",
          "Titre": "Horrible network",
          "Contenu": "I live in a large SoCal city. The network is horrible!!! Their network is not compatible with android software leading to usage of 4G instead of 5G. I will be switching to AT&T prepaid."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Adam Parker",
          "Nb_Reviews": 1,
          "Date": "2022-12-06T20:27:31.000Z",
          "Titre": "Slow to fix problems",
          "Contenu": "Pro: Customer service is prompt and well-spoken. They seem very helpfulCon: My SIM card stopped working. And they sent me a replacement via snail mail instead of overnighting it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kun Ji",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T18:35:24.000Z",
          "Titre": "Almost ruin my trip. Terrible data network.",
          "Contenu": "Almost ruin my trip as it is hard to connect the data network，it wasted me so much time and money on this stupid plan. Without the Telcel sim card I got from Mexico, I could not even call a Uber! I should not switch Mint Mobile to this crap."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thea",
          "Nb_Reviews": 2,
          "Date": "2022-12-24T16:27:04.000Z",
          "Titre": "This was awful",
          "Contenu": "This was awful, I’ve spend close to $100 in two days. Every few hours I would receive another receipt; “thank you for your orde”. Only used it a few hours a day but was charged another 10 usd after about two hours and this kept going."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tomer",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T07:41:45.000Z",
          "Titre": "Caused me to lose my bank and gmail access",
          "Contenu": "Transferred my number over to Tello, but they couldn't active the eSIM. I was left without my number, and lost access to my bank, Gmail, and more."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Situ Mou",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T08:18:04.000Z",
          "Titre": "Tello told me I should get unlimited…",
          "Contenu": "Tello told me I should get unlimited call to USA and Bangladesh but I didn't received it. While calling yesterday they said I need to refill the account balance and it's totally unprofessional behavior from them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Donald Laackman",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T19:20:52.000Z",
          "Titre": "Most of the time I enjoy one bar or…",
          "Contenu": "Most of the time I enjoy one bar or less of signal strength, so my phone switches to WI-FI calling.  I thought T-Mobile was going to invest in the network!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eduard Marius Bauer",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T18:51:52.000Z",
          "Titre": "I renew my card and it still no…",
          "Contenu": "I renew my card and it still no working! I,m in san francisco and i dont have internet👌🏽 cooolll!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ary gonzalez",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T21:21:54.000Z",
          "Titre": "tello erases your data at the end of…",
          "Contenu": "tello erases your data at the end of the month. the data that you paid for with your hard earned money.they want you to manually renew every month. all other companies are automatic. if you miss your renewal day you will lose all your data. they don’t care that you paid money for it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gorkem Demir",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T09:10:05.000Z",
          "Titre": "After 25gb data using my unlimited plan…",
          "Contenu": "After 25gb data using my unlimited plan internet speed down to 2g cant use for anything!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dina",
          "Nb_Reviews": 4,
          "Date": "2022-11-16T14:56:41.000Z",
          "Titre": "Do Tello offer service for Apple iWatches?",
          "Contenu": "I emailed asking if Tello had started servicing Smart iWatches ie (Apple’s) because I’ve purchased their 8 so I would like it to operate independent of my iPhone; the response I received back said yes Tello now service smart watches with instructions regarding an eSim for it. I called and was told all of this was not true now I am totally disappointed in this one Tello rep. I mean it makes me feel like customers can’t even rely on Tello reps at all. This should not be happening."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gordon",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T17:08:34.000Z",
          "Titre": "The service is very spotty for phone…",
          "Contenu": "The service is very spotty for phone calls and there is a delay with every call. Text is fine, just very frustrating when trying to make a phone call."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "FutureVision",
          "Nb_Reviews": 3,
          "Date": "2023-03-18T07:32:59.000Z",
          "Titre": "Tello internet unreliable in emergency",
          "Contenu": "I keep my Tello phone as a backup.   This week our power went out due to a wind storm.  My Tello phone was able to connect and showed many bars, yet the internet access was slow or dead.  What good is a backup if it does not work in an emergency as needed?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marc",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T04:56:38.000Z",
          "Titre": "Will your phone REALLY work on the Tello network?",
          "Contenu": "In determining if we should switch our service to Tello, we first checked to see if our phones were compatible with their network.  We used THEIR IMEI system checker on their web page, (home page linked to \"bring your own phone\"), for all of our phones.  It indicated all our phones would work, (both Apple phones and my wife's Android Galaxy A12), but...not so much.  First, it took a full week to get the SIM card for the A12.  the iPhones were eSim eligible).  Once we ported over to the Tello network, we had difficulties making calls, receiving calls and sending/receiving texts so finally we called Tello.  They informed us that our Samsung Galaxy A12 wouldn't work on their network even though their web page says it does.  Their response from customer service was to hold on to the phone and wait for an update from Samsung, and that many customers who have the A11, A12 and A13 are having problems with the Samsung updates making the phones work with Tello. Really! And what am I supposed to do until then?  The Tello agent also agreed that their site should say that the Samsung Galaxy A-12 is not compatible.  Now that we have ported over all our phones from our previous service provider, which worked fine with our phones to one that only supports 2 of our three phones is very disappointing. We switched over to save money, but is it worth it? Time will tell, but now I have low confidence level in Tello.  I feel it is a poor and deceitful business practice on Tello's part, especially the flippant attitude of \"oh well, wait for an update or buy a new phone\"."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joseph Collins",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T20:36:14.000Z",
          "Titre": "Can't change plan in middle of the month or it \"stacks\" together",
          "Contenu": "I wanted to CHANGE my son's plan, NOT add onto it. I \"bought\" a cheaper plan and it stacked on top of what he already had. Wow, what kind of moron set this system up? We have canceled and won't be back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gerry Rush",
          "Nb_Reviews": 1,
          "Date": "2022-11-19T15:46:35.000Z",
          "Titre": "5g not working",
          "Contenu": "5g is still not working on my Moto 5g phone. I've talked to customer service twice. Both times the rep was helpful but said it will be fixed on the next update. When is that?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Maya Romanyuk",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T20:32:40.000Z",
          "Titre": "Reception is not good"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Catherine Wilkerson",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T01:08:01.000Z",
          "Titre": "I have been charged $19.99 twice for…",
          "Contenu": "I have been charged $19.99 twice for something I did not want. I have tried contacting Apple which is where the charge is coming from. I have tried to STOP it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Luckett",
          "Nb_Reviews": 5,
          "Date": "2023-03-13T14:45:30.000Z",
          "Titre": "Deceptive marketing - \"Unlimited\" has a 25 GB limit",
          "Contenu": "Deceptive marketing.  Company advertises plans named for their amount of high-speed data, in all cases but one.  So, there's a 500 MB plan, 1 GB plan a 5 GB plan, 10 GB and \"Unlimited.\"  They even promote it as \"Unlimited EVERYTHING --For Real...\".  However it has a limit of 25 GB of high-speed data.  So, if they were honest, they would call it the 25 GB plan, consistent with all their other plan names.  They are not honest.  The limit on the \"Unlimited\" plan is disclosed only in smaller print at the bottom of an interior page of their website.   Shame on them! \"Unlimited Everything\" is a lie.They have s sleazy tactic for clouding the issue:  You get unlimited 2G data.  But 2G data and high speed data are two different things.  They do not give you unlimited high speed data, so \"unlimited everything\" is a lie.2G data will not get you access to the Lyft app for example.  All the other plans are identified by their amount of HIGH speed data. And then they call this plan \"unlimited\". And yet the fine print contradicts that by imposing a 25 GB limit on high-speed data. Very deceptive! And apparently intentionally so.I provided this phone to a refugee living in a shelter without Wi-Fi. She needs lots of data because she's having numerous Zoom calls with various aid agencies and she was given a credit for Lyft that she can only access by the Lyft app which uses high-speed data only. She has two small children with various medical needs. She hit the 25 GB limit which we didn't know about just when she needed to access the Lyft app in order to take one of her children for medical care. We couldn't figure out what was wrong.  Finally I called Tello and discovered that \"unlimited everything\" to them means 25 GB of high-speed and no more. After much argument they allowed half a gigabyte additional but would not honor the promise of \"unlimited everything\" They also would not let me talk to a supervisor.I'm done with Tello but would like to save others from being cheated in the same way so I am posting this on Trust Pilot and have filed a complaint with the attorney general.  A half truth is a whole lie and lying to consumers is against the law."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Ashish Yadav",
          "Nb_Reviews": 3,
          "Date": "2023-03-08T07:38:08.000Z",
          "Titre": "People didn't complete port out request…",
          "Contenu": "People didn't complete port out request and then no one is available"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel Miller",
          "Nb_Reviews": 1,
          "Date": "2022-11-14T22:23:41.000Z",
          "Titre": "It would be nice if my phone had  sim…",
          "Contenu": "It would be nice if my phone had  sim card holder in the phone I had told them I had but mine is a esim card and they don't support it.  Wont even as if they could send one that works."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "COOKE DANIEL",
          "Nb_Reviews": 5,
          "Date": "2023-02-13T13:21:18.000Z",
          "Titre": "Good bye 2002",
          "Contenu": "I have Tello for a few more days but had to switch due to no mobile service unless phone is in 2/3g mode for mobile networks. Meaning when not using a wifi network, basically only phone capable. Can't send text with a pic even. Until tello I never heard of this \" mobile networks function\" which allows you to go back in time to connect to 2/3 g network, until Tello explained to me 3 months ago, that this was a Samsung issue and next month with new release will be fixed. I called a couple more times and response was the same. Then I tried a 7 day trial with their competition, on the same network, and Mint works fine in 5g. 3 months of 2002 speeds vanished with a Mint sym card. Spoke to Tello and they told me they could send me a new sym card, but it would not fix the issue, and again noted it was a Samsung issue WHILE I SPOKE TO THEM IN 5G ON THE MINT SYM...........Ok, but hard to believe. Same network, Mint sym.  Works. 3 months with Tello. Didn't. Also was unable to port in or out numbers from Tello, and again Tello pointed the finger at the other guys. And the reply says it all. Wow. I tried porting in and out, filled out the forms, and it failed in and out of tello. As to 5g and lte my mint card on same phone on same tmobile network works  fine, while tello to this day requires I put my phone in 3g mode to work. The reply below is finger pointing when all facts points inward and is exactly the response I got when I spoke to tello for 3 months. \"The fix is coming in a few weeks\" was the repeated month after month reply."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 3,
          "Date": "2023-03-25T14:49:10.000Z",
          "Titre": "If I could give zero stars I would",
          "Contenu": "If I could give zero stars I would. No service anywhere! I have to rely on my home or work wifi to use my phone! Had a power outage last night and couldn't even call it in!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JOHN Shipe",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T13:18:47.000Z",
          "Titre": "The service socks alot of drop calls"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kris K",
          "Nb_Reviews": 3,
          "Date": "2023-04-17T14:34:18.000Z",
          "Titre": "poor cell reception almost everywhere",
          "Contenu": "poor cell reception almost everywhere. data speed is no good"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Avril Gillis",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T17:56:52.000Z",
          "Titre": "Don’t recall ordering",
          "Contenu": "Don’t recall ordering. What is charge for?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Abi",
          "Nb_Reviews": 3,
          "Date": "2022-12-19T14:11:03.000Z",
          "Titre": "There is inadequate service all days",
          "Contenu": "There is inadequate service all days. calls and text  hardly come through all the time anymore."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "AS",
          "Nb_Reviews": 2,
          "Date": "2022-11-11T05:22:34.000Z",
          "Titre": "Horrible Customer Service",
          "Contenu": "I recently bought a new iPhone 14 pro and this phone is activated only through an eSIM. When I tried activating the eSIM through the Tello website, the eSIM was successfully activated but my number did not transfer over. I had to call Tello 3 times in one day for them to finally escalate my situation and have a technician fix my situation. Customer service was very bad and uncooperative. Before I made those 3 calls, I sent an email to Tello and they sent me the same steps to troubleshoot which I had already tried, and although I told them very clearly I had already tried the different steps over the phone, they still made me go over the steps over and over again wasting my time. This was such a bad experience for me that I decided to change my line to a new carrier. Tello should hire more people that actually have some knowledge about their lines and technology."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Twinklez Jones",
          "Nb_Reviews": 5,
          "Date": "2022-10-30T13:36:55.000Z",
          "Titre": "Tello randomly blocked my texting…",
          "Contenu": "Tello randomly blocked my texting service saying I am using it for business not residential purposes which is an outright lie. I am disabled and do not work!. They tried blaming T mobile but that was proven false to me. Despicable"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steven",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T18:50:19.000Z",
          "Titre": "Consumer Nightmare!!!",
          "Contenu": "UPDATE #2Spoke with FCC today who instructed me to file a complaint. The form had a place for attachments. Went to Tello’s website to take a screenshot and noticed that some minutes had been used. Wanting to be sure that my phone number was still not working, I tried making a call again. To my surprise, it was now working. I want to thank Trustpilot as I believe they were instrumental in resolving this issue. Also want to thank Tello for finally getting my phone working again. To be fair, Tello provides unequaled service AND pricing. They have an awesome website to manage your account. For instance, it allows you to see the Number called, Date & Time of the call,  how long the call was, and the Cost of the call. However, the best part of their website enables you to customize the service plan you want such as the number of minutes and MB. Doing so gives you the lowest price possible. You can also choose not to have a plan and select Pay As You Go. Since I do not know which option is best for me, I have a customized plan for one line, and the Pay As Yo Go for the second line.END OF UPDATE #2UPDATEIn my review, I had 2 issues. 1) The first and most important one of all was that after adding 300 minutes by renewing, I was unable to make any calls or receive message as it showed \"Call Failed\". 2) The second issue was about eSIMs. Received Tello's reply that only addressed the second issue regarding eSIMs. They glossed over the first issue about the phone being unable tø make or receive any calls. Tried calling using that line and it is still not working. If line isn't working in 2 days, I'll lodge a complaint with the CPUC. Additionally, will seek the advice of legal council to ascertain if this matter can be litigated for actual and punitive damages. I've had this number for 15 years and have missed many costly calls and messages.                       END UPDATERenewed a plan. However, when making a call now, it shows \"Call Failed\". Renewed my plan for another Tello number which worked fine. Have spoken with 4 argumentative representatives who were of no help whatsoever. One told me to shut down my iPhone and would call back in 5 minutes but never did, which is a common occurrence. Another representative said there was a problem with my phone. I’ve spoken with this particular person many times in the past who ALWAYS says the problem is on my end no matter the issue. He refused to escalate this matter. I asked to speak with his supervisor and was transferred to an answering machine. Left a message but again, never received a call back. Another representative told me to take the phone to an Apple Store. Another representative put me on hold to research this issue. He returned 10 minutes later stating 2 lines cannot be  on at the same time. It’s been a week now and the number still doesn't work. There is another issue which has been unresolved for 2 weeks . . . it no longer supports 2 Active (ON) lines. Although I have 3 SIMs, all phones only have the capability to have 2 Active (ON) lines at the same time. With 2 Active (ON) lines, this allows a person to make or receive calls on either line. However when doing so, it puts the other Active line on Standby mode until the call is completed. This feature works with a 3rd party SIM card and an eSIM as well as using two eSIMs.I’ve spoken with 5 representative regarding this issue. All adamantly state that my phone is incapable of having two Active (ON) lines even though I’ve been able to do since day one using their service. This feature works with a 3rd party SIM card and an eSIM or two eSIMs.Spoke with Tello’s main competitor Mint Mobile. They acknowledge that my phone is capable of having 2 Active (ON) lines simultaneously. The pricing for their plans is competitive. Unlimited calling/text with 5GB is $15. Tello has the same plan for $19. Since Mint Mobile has better pricing with knowledgable  good-natured customer support representatives, the choice for me is clear . . . No more Tello nightmares!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anh Nguyen",
          "Nb_Reviews": 1,
          "Date": "2023-06-25T16:52:24.000Z",
          "Titre": "Slow data",
          "Contenu": "Data is super slow for the last month, and it is not even limited data. Terrible."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pradv",
          "Nb_Reviews": 1,
          "Date": "2022-10-11T07:38:33.000Z",
          "Titre": "Terrible service",
          "Contenu": "Terrible experience activating the phone; even worse customer service. [edit] After seeing this review, tellos replied and declared that my esims are working fine. But one of the esims hasn't been activated due to the repeated problems with the activation and they couldn't figure this out on their end."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Koi 1971",
          "Nb_Reviews": 2,
          "Date": "2022-10-13T21:20:57.000Z",
          "Titre": "Can't trust Mei Number",
          "Contenu": "Tello told me my phone was  compatible. I ordered and installed Sim card. Phone worked right up until  I canceled my present carrier. Could only text , no phone calls. Tello rep told me sometimes a comparable Mei phone is not enough and I would have to purchase one of their refurbished  phones to use Tello. I looked at their out dated refurbished phones and , decided to Cancel Tello and go with another carrier. Since then constantly get email's from Tello. Obviously Tello has bigger problems other than telling future customers their phones are compatible even though they aren't"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dale",
          "Nb_Reviews": 2,
          "Date": "2022-10-13T19:27:30.000Z",
          "Titre": "I only use Tello for  disposable…",
          "Contenu": "I only use Tello for  disposable accounts. Using online services is fine but the call quality is horrible. It keeps cutting out and hanging up while you are talking. I called Customer service and they  gave up and sent me an email."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "A V S",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T16:29:49.000Z",
          "Titre": "Bad phone connection & poor reception.",
          "Contenu": "Bad phone connection & poor reception.Unsatisfactory low speed data transfer and internet performance."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Haitham Alnaeb",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T12:53:40.000Z",
          "Titre": "World worst calling company ever"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Baz",
          "Nb_Reviews": 2,
          "Date": "2022-10-14T09:26:26.000Z",
          "Titre": "I have the unlimited everything plan…",
          "Contenu": "I have the unlimited everything plan for $30 a month. After 25gb it slows to 2G which in this day and age is absolutely useless. Nothing will load. I have used data many times with different cell companies. Never has the data disappeared so quickly. I pretty much do the same thing every day and have done so for years so I know my useage very well. Tello’s data just disappears. I suppose you get what you pay for. Never had this problem with any of my other cell providers. What seemed a good deal isn’t.EDIT to Tello reply.Why would I buy Pay as You Go credit at $20 for 1gb when I can just renew my monthly contract at $30 for 25gb? You completely avoided the question and replied with a nonsensical answer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alfred Pinsi",
          "Nb_Reviews": 2,
          "Date": "2022-10-15T21:12:00.000Z",
          "Titre": "Two months later and no resolution to…",
          "Contenu": "Two months later and no resolution to texts not recived in Taiwan. Tello says it's Taiwan, Taiwan emphatically denies.  If you only talk or text domestically (U.S.) I guess you'll be fine."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ruvim Pisarchuk",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T07:34:25.000Z",
          "Titre": "The data is horrible",
          "Contenu": "The data is horrible. So expensive. And works very slow."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Elizabeth Hoffman",
          "Nb_Reviews": 1,
          "Date": "2022-10-14T11:39:23.000Z",
          "Titre": "I was forced to order a new phone not…",
          "Contenu": "I was forced to order a new phone not that I wanted to should of been funded by your company because last phone I had was fuxked up due to update last phone was forced to get it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ben",
          "Nb_Reviews": 1,
          "Date": "2022-09-14T20:38:20.000Z",
          "Titre": "Worst cell service ever.",
          "Contenu": "Phone from tello almost never works. Customer service doesnt care . They will ask you to gather tons of information to fix the issue and waste youre time.And the issue never get fixed phone still doesnt work after a total of 10 hrs with tellos customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Diego",
          "Nb_Reviews": 1,
          "Date": "2022-08-17T05:22:55.000Z",
          "Titre": "Signal is bad and data very slow",
          "Contenu": "When I purchased the two lines I did it because it mentioned that the signal works really well. It has not been the case, data and signal is really bad and even thought the phones have data available, it is really slow or null to say the least. It needs to be improved. Finally, I decided to increase the data and give it a try, still very slow while not on wifi. And, I don't agree with the fact that if I increase the data in the middle of the last plan, there is no reimbursement or credit for what it has been unused."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andy",
          "Nb_Reviews": 1,
          "Date": "2022-08-17T02:24:21.000Z",
          "Titre": "Worst experience ever!",
          "Contenu": "Worst experience ever!Ported in my number, easy enough. 24 hrs after activation, Tello had a huge outage (allegedly) and could not make/receive texts/calls for close to a day. Immediately switched to a better provider and gave myself a peace of mind. Gentle reminder that you get what you pay for."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Donna BELLRAISHE",
          "Nb_Reviews": 2,
          "Date": "2023-09-12T22:22:15.000Z",
          "Titre": "Want to change carrier",
          "Contenu": "Want to change carriers, bad customer service overall"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "dean ribaudo",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T11:25:46.000Z",
          "Titre": "I don't like that your billing is not…",
          "Contenu": "I don't like that your billing is not the same day every month..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vishal",
          "Nb_Reviews": 1,
          "Date": "2022-07-29T07:35:24.000Z",
          "Titre": "DO NOT Recommend...",
          "Contenu": "Internet slows down when it is most needed. Network is unavailable at many times even in area where there is good connectivity.Bad service. DO NOT USE TELLO. You will regret.Update: It's just a nightmare. Sometimes data don't work and sometimes calls stop ..  They keep providing odd solutions and settings and nothing works. Atleast they accepted the problem but they are not willing to refund despite the fact the service is not working since weeks."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "hen nussbaum",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T01:38:36.000Z",
          "Titre": "Extremely slow recepyton of emails"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "드라마 광신자",
          "Nb_Reviews": 1,
          "Date": "2022-09-03T17:33:19.000Z",
          "Titre": "Price is good, service is not",
          "Contenu": "Switched from Republic Wireless to Tello, and immediately started having problems. When making calls, it takes forever to connect and start ringing, then when it finally does, calls frequently drop. Texting is a nightmare. I have to turn on my own data most of the time to send and receive, or turn off my phone, then when I turn it back on, texts flood in, some from days ago I never received. The only time texting works properly, is when I’m texting with my brother who also has Tello. I’m about at the end of my rope, I’m switching back. I’ve tried everything Tello Customer Service suggested, but I still have the same problems. Good price, but not worth the unreliability."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sharjeel Shah",
          "Nb_Reviews": 4,
          "Date": "2022-07-25T18:25:44.000Z",
          "Titre": "Tello is worse company",
          "Contenu": "I wrote review and they contacted me and asked my information and now they replied on my review and says they can't find my information 😂 even I gave them all my detail and my phone number. Thisbtime I am providing my order number i hope this time they can find my information."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sharjeel Shah",
          "Nb_Reviews": 4,
          "Date": "2022-08-11T15:40:58.000Z",
          "Titre": "Its been more than 3 months I am facing…",
          "Contenu": "Its been more than 3 months I am facing no network issue they told me samsung will launch new update this month but didnt got anything.My phone is new with latest Android version but my other phone is galaxy s10 plus which has android 9 i dont understand how both phone can have same issue if its really software issue?Clean sim card restore phone update phone turn on off phone all this just time waste truth is their service is sucks and they can't fix issue they even don't know what is the real issue is they just making stories and scamming with people I am looking better service. Be aware of them"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 1,
          "Date": "2022-07-19T14:39:21.000Z",
          "Titre": "Poor Quality on 2G",
          "Contenu": "While on 2G data,(1) Dialing a call takes around 1 minute to find the caller and hear the ring on both side.(2) On 2G data, App based mobile data messaging does not work.(3) Google Maps service does not work, just like a dead, so it does not show any direction when you are lost."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Macpissedoff",
          "Nb_Reviews": 2,
          "Date": "2022-07-08T17:48:15.000Z",
          "Titre": "Despite the coverage map saying that…",
          "Contenu": "Despite the coverage map saying that there was excellent service in my area there is actually none at all. I live in a suburban town just outside a major city and the service is actually non-existent. I tried speaking with customer services but they fobbed me off with the same excuses, \"there's a cell tower down in your area, no we don't know when it will be repaired, the service is actually only supposed to be intermittent.\" In short, Tello is a complete waste of time and money. Avoid at all costs."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Wendy",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T16:21:54.000Z",
          "Titre": "Not receiving text messages and…",
          "Contenu": "Not receiving text messages and regularly have to reset network connections."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Alex",
          "Nb_Reviews": 6,
          "Date": "2022-11-11T00:10:07.000Z",
          "Titre": "None existent service and support",
          "Contenu": "I've given one star but zero would be preferred. I can't really say anything good about them to be honest since I barely even managed to connect to their network! The SIM came through the post after almost 2 weeks of waiting, I had pre paid so the money left my account immediately and I worried the SIM wasn't ever going to appear (such was the lack of communication) . When it did, I put it in the phone, it worked for a day and then refused to activate.I contacted support, they kept feeding me total rubbish about a new Android update affecting activation and I ended up giving up on them after 3 days of no service and no help. Switched to US Mobile, worked first time, up and running within an hour. Sadly, Tello gave me nothing to love about them and they never refunded my money. Worth the money? I feel almost happy to pay to be rid of them!Addition:I can confirm that my money was returned, though I cannot see a good reason to raise my rating. No one would wait 3 months for an Android update in order to get cell service (as I was being asked to do)."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Peter Cardone",
          "Nb_Reviews": 3,
          "Date": "2022-08-29T06:28:34.000Z",
          "Titre": "Awful",
          "Contenu": "I have had a terrible experience. According to their website and according to one of their representatives my phone is compatible with Tello Network and I'm in a good coverage area. I have not been able to make a phone call or text or receive a phone call or a text since starting the service. The tech support was not very helpful after the first few calls. I would call and nobody would be there to answer the phone. I would not recommend tello to anybody who actually wants to use their phone. In response to Tello's response to this review...I already included my order number and telephone number to you.Tello tech support had no  answers for me so I cancelled my account and received a refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sharjeel Shah",
          "Nb_Reviews": 4,
          "Date": "2022-07-21T16:41:21.000Z",
          "Titre": "Worse service I have ever seen",
          "Contenu": "Worse service I have ever seen. All the time no signal at all no matter where you go if you have emergency soeey you'll be without signal no call or text. Last whole month I tried to contact them and all replies of my email was clean sim card reboot device update software restore phone change networking settings thats all they said and at the end they said issue is under one more thing they said Dont Use 5G lol I pay for 5G why not? I am still waiting i dont know when it will resolve if they don't resolve this issue by end of this month I'll disconnect servicei don't wanna pay more for nothing goodbye"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Santosh kumar Woonna",
          "Nb_Reviews": 2,
          "Date": "2022-08-17T12:58:22.000Z",
          "Titre": "*Stay away - worst service**",
          "Contenu": "If there is a zero stars, would have selected that.I moved to tello based on trust pilot reviews, 3 days after moved to tello, both incoming and outgoing calls not working. My mother is in hospital, supplied my number for every place. Chat option not working, customer service call never connect and disconnect automatically after 5 mins. I sent an email, then reply says more customers are complaining about it and no timeline on resolution. ** Issue is not resolved even after 14 hours of complaint although lot of customers are facing the issue. ***If phone is critical for you, stay away from tello.Update: Issue resolved after 18 hours, but I was completely stuck, lost time, had inconvenience and pain."
        },
        {
          "Note": 1,
          "Lieu": "KR",
          "Pseudo": "Karl Mueller",
          "Nb_Reviews": 8,
          "Date": "2022-03-07T20:24:13.000Z",
          "Titre": "LIARS AND THIEVES",
          "Contenu": "Total rip off. Paid them for a phone, they sent a SIM card. Next, they said they \"had to investigate\"...still waiting for my MONEY BACK. They are clearly only concerned about THEIR side of it, and not at all concerned about the guy who is OUT A HUNDRED BUCKS. Anyone who deals with these incompetent clowns is a FOOL. In their response to this they claim to have never lied to me...yet they SAID they had shipped me a phone. WHERE IS IT, THEN?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Doll",
          "Nb_Reviews": 2,
          "Date": "2022-02-03T00:52:23.000Z",
          "Titre": "After they switched to GSM",
          "Contenu": "After they switched to GSM , I have troubles. Customer service responds quick, but they have some basic templates written on the troubleshooting steps which they keep on insisting and is not helpful at all. Calls going automatic to voice mail, not receiving SMS ever after turning on the data services. I have three services two of them I already terminated. This review is very genuine, I have entered my order # for further reference."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Landon Wardell",
          "Nb_Reviews": 1,
          "Date": "2022-01-27T16:54:42.000Z",
          "Titre": "Service is lousy",
          "Contenu": "Service is lousy. Most of the time my phone tells me \"Emergency Calls Only\" and won't let me make regular calls or texts. Seems to me, if the phone is capable of making an emergency call, it should be capable of other calls as well. It also often shows that I have several bars of service, but text at the top of my screen says \"No Network Connection\", and of course my phone won't work. Internet is terrible too. Tello is cheap, and I suppose you get what you pay for."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "A Paldano",
          "Nb_Reviews": 3,
          "Date": "2021-10-24T08:39:49.000Z",
          "Titre": "Multiple problems",
          "Contenu": "Multiple problems with this MVNO.* Hardly got any network coverage and wifi calling just wouldn't work. However, they do have a great app and you can use it to place calls over wi-fi. * Also, group texts just DO NOT work!! I had a computer engineer friend (from Stanford!) take a look at the phone and they recommended that I was better off switching telecom providers.Can't wait to move on."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Aaron Silver-Pell",
          "Nb_Reviews": 1,
          "Date": "2021-10-22T08:08:27.000Z",
          "Titre": "I got my phone stolen and afterwards…",
          "Contenu": "I got my phone stolen and afterwards they would not re-send me the security pin.  Just give me the birthing pin so I can activate my phone.  All these \"security\" features are just awful and they don't get to know you either, it's always a different person to deal with.  They act as if the security pin on a civilian phone is a matter of national security or something."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tia",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T19:35:21.000Z",
          "Titre": "Calls drop people can’t hear me I miss…",
          "Contenu": "Calls drop people can’t hear me I miss calls."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rita",
          "Nb_Reviews": 10,
          "Date": "2021-11-04T14:00:33.000Z",
          "Titre": "Bad customer Service",
          "Contenu": "Don't answer phones.Did not tell me to Purchase a phone with a sim card slot for the change of network happening in one year.My other phone carriers phone was dropped accidently and I needed internet but tello's internet was down for hours.I waited 2 hours outside for a taxi that never came and tello's internet still down the next day."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alan",
          "Nb_Reviews": 3,
          "Date": "2021-09-28T14:55:28.000Z",
          "Titre": "Disappointed by frequent inability to connect and by call quality",
          "Contenu": "I switched to Tello about six months ago because I like the price and the billing process.I have experienced repeated call failures, however.  And even when I am able to connect, the audio signal often is garbled.  Perhaps this is due to my Vermont location (I don't know)-- but I DO know that my repeated inability to make routine calls is unacceptable.As a result, I will be replacing Tello with a different carrier."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cathy",
          "Nb_Reviews": 4,
          "Date": "2021-10-06T13:09:14.000Z",
          "Titre": "Phone service over past few months has been inadequate",
          "Contenu": "Phone service over past few months has gotten horrible. Calls drop all the time, and when on calls,there are times no reception- can't hear caller, or at points, they can't hear me. So disappointing. I use to recommend tello  all the time. Tickets do no good either. Some of us, based upon our plan have become a low priority.I will be shopping."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cory",
          "Nb_Reviews": 1,
          "Date": "2021-10-26T15:14:05.000Z",
          "Titre": "Very disappointed…",
          "Contenu": "I upgraded to the new chip for tello and I have no service in areas I had service and only one bar most others. People can not hear me often saying “ I can’t hear you you’re breaking up…” Very disappointed. Tello Support called me and they were very nice, turned on wifi calling, which helps a little with calls while I am home, but still have all the same problems! Especially dropping calls constantly! Like 3 drops per call and long periods of time with No Service!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Peace",
          "Nb_Reviews": 1,
          "Date": "2021-11-28T20:27:50.000Z",
          "Titre": "I purchased Tello value 6 -month plan (…",
          "Contenu": "I purchased Tello value 6 -month plan ( $44) through online and activated ( 11/02/2021  ) and had to ported out my number (11/17/2021) to other carrier for  an evitable reason. I requested for a partial credit for keeping Tello account . But they refused it for $44 .Thank you Tello for your inconsideration."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "thomas hand",
          "Nb_Reviews": 2,
          "Date": "2021-08-12T13:17:39.000Z",
          "Titre": "Not so compatible as you said",
          "Contenu": "Converting three phones from two different carriers to Tello.  Each was verified as compatible.   Purchased three Tello start up kits.  Each failed for different reasons, no SMS, no signal where map says great signal, etc.  Many hours were spent on each conversion.  Original phones at original carriers worked fine. Super price but got what we paid for. Massive frustration."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "jerry barnes",
          "Nb_Reviews": 1,
          "Date": "2021-09-16T17:06:34.000Z",
          "Titre": "you are changing operating systems",
          "Contenu": "you are changing operating systems. and did not inform us of said change. leaving us with spotty service and constant dropped calls for two months, the only reason we found out we were going to lose service on our old phones is i called to complain about the bad reception. and the kicker is, we would have had no phones in a few weeks. i feel it is bad business to not inform your customers of terminal changes to their service. basically you left us high and dry."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeremiah Shields",
          "Nb_Reviews": 1,
          "Date": "2022-07-18T16:31:30.000Z",
          "Titre": "Find another option",
          "Contenu": "Was trying to switch from other carriers... but won't be. Tello seems to have good service coverage and a reliable network. But fails on account support. I have never seen a company make it so difficult for onboarding new customers to use their platform or have more than 10 lines with them (anyone else would welcome the extra business).@ Tello you should really look into the onboarding process of your competition because your process is VERY inefficient. And It could use a serious overhaul. Also, where do you post/state there is a limit of 10 lines??? It is not transparent. \"residential\" or not, I've never seen a company so willingly shoot themselves in the foot to decline potential business or extra revenue from a customer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "FactuallySpeaking",
          "Nb_Reviews": 1,
          "Date": "2022-01-14T16:25:40.000Z",
          "Titre": "Spam and robo calls",
          "Contenu": "I don't like the auto renewal process. It doesn't roll over the balance. Spam and robocalls aren't screened at all. too many of them. promotional rates are only for new customers once you are locked in, they don't pay attention to existing customers. No roaming."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2021-08-04T14:21:01.000Z",
          "Titre": "No working service for 3 days with no end in sight",
          "Contenu": "You can't talk to their tech department, only customer service. I move my service to them and so far (3 days) no working service. I get the run around from customer service, they miss dead lines (i.e. we will respond in 1 business day) they set. Their only solution is to wait with no timeline. While I have no phone to conduct business."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David Law",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T02:29:05.000Z",
          "Titre": "Too many dropped calls",
          "Contenu": "So I really wanted this to work because the coverage is as good as my previous carrier but costs less.  But I kept having calls dropped.  Various people, times, days, essentially everywhere, anytime and anyone.  So, I had to give it up, went back to former carrier."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mark Melena",
          "Nb_Reviews": 2,
          "Date": "2023-11-17T20:37:59.000Z",
          "Titre": "Very poor reception",
          "Contenu": "Very poor reception. I often have to hang up and redial. My service bars still show I good reception but the quality of the call is not as indicated."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Marc Doane",
          "Nb_Reviews": 6,
          "Date": "2023-10-28T11:08:40.000Z",
          "Titre": "The service is horrible where I live on…",
          "Contenu": "The service is horrible where I live on both of my lines, the website is difficult to navigate, unlimited data means that my Spotify should work without WiFi when I cycle .... Wrong ! If your service isn't good in an area you should tell people. You get what you pay for."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "`Arif",
          "Nb_Reviews": 3,
          "Date": "2023-09-27T15:06:48.000Z",
          "Titre": "Data Speed & Throttling",
          "Contenu": "Data Plan and pricing is great on paper, however, in the field it's below average. Mobile data speed is always lagging and gets throttled down depending on the day and the time. The only reason I remain a customer is due to 90% of my connectivity is with WiFi."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jack Carli",
          "Nb_Reviews": 3,
          "Date": "2023-08-04T22:45:55.000Z",
          "Titre": "Getting to live customer  Customer…",
          "Contenu": "Getting to live customer  Customer Service is  an act of total frustration on the Tello website. Type in the address bar Tello/customerservice/support/ that will get you a  live person. Customer service at Tello 3 years ago was fabulous. Today its a monkey cage, with no humor persons heavily monitored expect quick answers, Questions like how much GB am I using  or is my iPhone 128 enough or do I need more memory? Gets a. quick disconnect.(most likely byTello management) . The. faqs. are where Tello management is headed- totally ..expect low to. average live service.  My suggestion   is get out while you can, as $$$$$ is Tello management's mantra.Save your self,   some  big frustration."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Avanish Vyas",
          "Nb_Reviews": 2,
          "Date": "2023-10-09T12:28:05.000Z",
          "Titre": "Not completely satisfied",
          "Contenu": "I have a customer of Tello since a year now. I have $10 Tello Dollars in my account but I cannot use it since:1) Tello does not allow it's customer to use Tello Dollars in automatic renewal method. You manually need to cancel your plan, wait for the expiration date, renew the plan manually and choose Tello dollars as the payment method.2) You cannot use Tello Dollars as partial payment. For e.g., if the plan cost is $20 and you have $19 as Tello Dollars, you cannot use it towards your plan. Either you have to refer someone else and get more Tello Dollars or buys cheaper plan for which charges + taxes is less than or equal to Tello Dollars.3) Tello does not work at all in Canada and Mexico. You are basically on your own.If Tello does not fix the above issues in few months/years, I will lower the star rating to 1 star."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "LuxiPiik",
          "Nb_Reviews": 3,
          "Date": "2023-08-09T04:44:40.000Z",
          "Titre": "I used their service for about 2-3…",
          "Contenu": "I used their service for about 2-3 years (twice I switched to them) because they were affordable, but also with good service. It was only until a few months ago from now, that their service started giving me a no signal, saying \"emergency calls only\" even though my service was active. I called customer service, they gave me a new sim, then it was fine for a few days. But, it went back to the same issue.... so I switched to t-mobile, didn't want to bother with the problems. I can't recommend unreliable service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "SwimmerDudeski",
          "Nb_Reviews": 1,
          "Date": "2022-12-12T16:01:42.000Z",
          "Titre": "The services Tello offers are AWESOME",
          "Contenu": "The services Tello offers are AWESOME.  For Price versus value you have NO PEERS.  That said, your website isn't very good.  It is difficult to navigate and more awkward to find information than it could be.  But perhaps you don't spend very much money on web designers and technicians...and if so it SHOWS in the EXCELLENT PRICES and design your own plans that your company offers.  I give you 10 STARS for VALUE and FLEXIBILTY...the TWO stars is purely for your website."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ian Jones",
          "Nb_Reviews": 1,
          "Date": "2023-04-24T02:58:51.000Z",
          "Titre": "You can't change your Caller ID!",
          "Contenu": "You can't change your Caller ID, they don't advertise this and it's a big drawback for business users.  Maybe it cost them something extra or it's a fraud prevention step?  It's a little unprofessional to be calling from \"Wireless Caller\" to business clients."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Pat A",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T21:59:14.000Z",
          "Titre": "No option to add services but only but paying for a whole new plan",
          "Contenu": "There is no option to add data to a plan but only by paying for a whole new plan that includes it. My plan had just been renewed and realized I wanted additional data. Had to pay twice only to add data to my existing line. Hopefully you may add this option soon."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "EJ",
          "Nb_Reviews": 2,
          "Date": "2023-01-03T01:48:09.000Z",
          "Titre": "Not reliable with Samsung phone",
          "Contenu": "My Samsung phone started to lose network connection off and on two months ago.  Went into searching and/or emergency mode.  Tello ran me through many troubleshooting steps but that did not work.  They finally told me it was a Samsung software update that was causing the issue.  I called Samsung and they said it was a Tello problem.  Note that switching SIM card showed it was NOT a Samsung problem but a Tello problem and now I am getting ready to switch to another carrier.  I have emailed Tello support many times."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ken",
          "Nb_Reviews": 7,
          "Date": "2022-12-28T08:12:14.000Z",
          "Titre": "Data used faster than it should",
          "Contenu": "PROS: Good coverage based on the T-Mobile network. Renewal notifications work as described.CONS: Unlimited plan has a 25GB data cap that slows to virtually unusable 2G speeds when exceeded (most carriers falsely advertised 'unlimited' but 25GB limit is less than many other MVNOs). Data cap threshold consistently reached much faster than previous T-Mobile, Mint Mobile, US Cellular plans (i.e., Tello reports 25GB+ usage while phone has used 19-20GB, so it's actually only a 20GB plan). App & online account do not summarize data usage, so you cannot see real time data consumption. Customer service replies are prompt but scripted & do not address my questions, so will be moving to a different wireless provider."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robin Shasteen Sesko",
          "Nb_Reviews": 2,
          "Date": "2023-01-11T16:54:21.000Z",
          "Titre": "I'm being generous with this review",
          "Contenu": "I'm being generous with this review.  We have had Tello for a week and a half.  We have had 1-2 bars at home, but when traveling between cities, we have no service.  Yesterday, we had no service from anyplace.  This was a cause for extreme anxiety for me since my mom is on our plan and has 3 people checking on her daily.  My brother was very worried because he wasn't able to reach any of us.  My adult son also has medical issues (severe depression and epilepsy).  He is an hour away.  We need to keep in touch with him daily.  This isn't going to work for us.  The price of Tello is great, but if you don't have service, that's a problem.  We are currently looking for another carrier.  Ugh!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "¡wEaVe",
          "Nb_Reviews": 1,
          "Date": "2023-03-08T15:31:53.000Z",
          "Titre": "Unlimited???  PONY TURDS!!!!  Not unlimited.  THROTTLED!  Unethical & deceptive business practice.",
          "Contenu": "I suppose it's my bad. Inundated, shopping all the different carriers, looking for the best deal. Somehow I must have failed to read the fine print on this one.The practice of calling something unlimited, when it's not. I think is a pretty deceptive tactic. Not just on you Tello, but on all cellular carriers whom advertise UNLIMITED, when it is not unlimited. Only 25 gigs on this so called \"unlimited\" plan. Surpass that 25 GB & they knock you down to 2G speeds. Anybody remember 2G speeds? USPS, the freaking mailman, even he goes faster than 2G! 100% completely useless. It takes about 45 minutes to download a text only email @ 2g speed. Can't even pull up a map before you find the place without one. Took over 55min to access Tello's very own site, just to click a button & re-up our plan. Shouldn't call it unlimited, if it's not truly unlimited!  It's totally not necessary. All of you mobile providers already have us by the nuts. And y'all do it. I mean, what's the harm in calling it what it is & telling the truth?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David N",
          "Nb_Reviews": 1,
          "Date": "2023-04-14T16:21:32.000Z",
          "Titre": "Good prices but the service acts up",
          "Contenu": "Good prices but the service will often act up. I have unlimited texting but for some reason on the last days of my plan I can’t send or receive text messages."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chris Thongsouk",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T13:59:35.000Z",
          "Titre": "It took 3 tries for Tello to port in my…",
          "Contenu": "It took 3 tries for Tello to port in my numbers correctly. However, I was impressed with the response time to address the errors."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kristen R",
          "Nb_Reviews": 6,
          "Date": "2023-01-09T19:37:58.000Z",
          "Titre": "Coverage is not as advertised",
          "Contenu": "Coverage is not as advertised.  I do not get a signal in places that I tested before buying this service.  I even did not have a signal as I approached Las Vegas on my recent trip!"
        },
        {
          "Note": 2,
          "Lieu": "ES",
          "Pseudo": "Luna Vanessa Villegas Romero",
          "Nb_Reviews": 2,
          "Date": "2023-01-12T20:02:57.000Z",
          "Titre": "The only thing I can be thankful for is…",
          "Contenu": "The only thing I can be thankful for is the help center, they tried to help me with my problem but there was no solution. I wish I had the opportunity to navigate with the data plan I bought but it was impossible."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "L W",
          "Nb_Reviews": 3,
          "Date": "2023-03-22T14:18:22.000Z",
          "Titre": "Spotty service and dropped texts",
          "Contenu": "Spotty service and dropped texts, can't send group texts or photos without buying data, offer credit to you to have you get others to join, but make it impossible to use the credits"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alex",
          "Nb_Reviews": 5,
          "Date": "2023-01-27T14:45:55.000Z",
          "Titre": "The cell reception is very patchy and…",
          "Contenu": "The cell reception is very patchy and sometimes your phone would go \"no service\" on you in the middle of the city...literally in downtown. I also think that in general the service used to be better last year....Update: and now they are asking me to provide them more info...which I don't want because there is absolutely no point - it will not make my coverage better, but instead I would be engaged in a pointless conversation with tello people. If I don't give more info, they will take my review down. Let's say now I think I understand why Tello has such a good overall rating and mostly positive reviews.Update2: Tello flagged my review. Lol. Initially I wrote quite polite that the reception was unstable. How did we get here, Tello? I will be leaving you because not only you have below average service (which is undoubtfully affordable though), but you are flagging your customers..I mean, really!? Do you have to take down every review that gives you less than 5 stars?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tello user",
          "Nb_Reviews": 1,
          "Date": "2022-11-22T15:47:03.000Z",
          "Titre": "Though Tello is a very good service",
          "Contenu": "Though Tello is a very good service, it’s payment options and the payment portal are confusing. It’s possible that this is deliberate to promote purchase of additional service. This has been consistent throughout my experience with the TELLO payment portal for 2 years. I am always anxious when I use it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ken R",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T05:02:17.000Z",
          "Titre": "Tello actually cost me $225 for just 3 months",
          "Contenu": "I paid $32 for 25gb data.  The speed and reliability was great,  as was signal. They say they slow it down once you use up your 25gb of high speed.  They suuuuure did!  Even right under a cell tower with 5 bars I couldn't use the internet.  Page loading simply stalled out.  It was 100% totally useless.  Pay for ANOTHER 25gb and it works very fast again. I also never went through data so fast as what they said I was using.  I believe they are very inaccurate with your data usage. I always was spending at least $65 a month using Tello. After 3 very disappointing months  that cost me  $225 to use Tello I switched to T-Mobile Magenta plan.....100gb HIGH SPEED ALWAYS....for $50 a month."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Walter Geluso",
          "Nb_Reviews": 2,
          "Date": "2023-03-16T14:37:40.000Z",
          "Titre": "Service change",
          "Contenu": "A few months ago Tello changed to a new network.  Since that time my service has been terrible.  Dropped calls and text that never go through.  The good thing is that it's so cheap I'm willing to live with the poor service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "McLauren Pulliam",
          "Nb_Reviews": 3,
          "Date": "2022-12-25T18:08:32.000Z",
          "Titre": "My phone has never worked from outside…",
          "Contenu": "My phone has never worked from outside of my home. (And I use my land line when I am home.)I reported the problem but all they do is Email the entire instruction book to me.  I have tried dozens of times over the past year to make my my phone, (Which I purchased from Tello.), work.I am an old man who only needs a cellphone for emergencies. The price is great,, unless you need to use their service.I did get a call. The man was very nice but he told me that my phone would not work on their system. He had me move back and forth from 4 to 5 on the service. This did not work. ---------------------------------------------------December 2022.Later I thought, \"Why not try 2? It worked! I can now make a call from my car. Service is a bit slow but I don't need fast service.I guess level 2 is for people who over-use their level.I got it working but I still can't register my phone. That won't matter unless I lose it or it is stolen so I can live with it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tim",
          "Nb_Reviews": 8,
          "Date": "2022-10-29T01:26:28.000Z",
          "Titre": "Spotty coverage and many phones not supported even if they say it is",
          "Contenu": "I have an unlocked Note20 that Tello said was compatible. Unfortunately, it could never receive a single inbound call. After many support emails over a period of days - all the time being told Samsung Note20s don't work on any T-Mobile service (not true because it works fine on Mint) - I was finally told my phone was NOT compatible. Additionally, the coverage was terrible - maybe this was because my phone wasn't working with their service. I lost service constantly and I'm in Atlanta. Finally, I'm not a fan of their customer service either. There is not chat support or phone support. It's all email. Now I will say this, in most cases you get an email response within minutes or hours at most."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kelly Bennett",
          "Nb_Reviews": 1,
          "Date": "2023-04-21T08:35:56.000Z",
          "Titre": "data is really slow",
          "Contenu": "data is really slow, i have unlimited data but its not worth the price"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kendra",
          "Nb_Reviews": 4,
          "Date": "2022-10-10T13:41:41.000Z",
          "Titre": "I switched to Tmobile for $35/mo unlimited data/phone/text at 5G. If you use internet/email Tello is a joke.",
          "Contenu": "I had the $10 plan with 1 mb of data which was used up in an hour and had to switch to unlimted data plan for $30 but they limit data to 25MB and then switch you to 2G which takes 10 min to load a webpage so I switched to Tmobile for $35/mo unlimited data/phone/text at 5G. If you use internet/email Tello is a joke.\"What we recommend would be to make sure that you update Apps over Wi-Fi only and restrict App background Data. You can also set a daily usage limit for Data in your phone's settings.\" Ok but I don't have to do all this with T Mobile so Tello doesn't make sense for me."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ang",
          "Nb_Reviews": 1,
          "Date": "2022-08-10T19:18:20.000Z",
          "Titre": "Not able to receive calls",
          "Contenu": "Just switched over and not able to receive calls from people that have always called me and that I call.  Very frustrating.Even after working with customer service, still not able to receive calls on the same network that I came from - TMobile.  Can't even receive calls on WiFi calling.  Tello showed that my phone was compatible with their 5g but then customer service said it was not."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Erik Garabaya Casado",
          "Nb_Reviews": 1,
          "Date": "2022-08-19T06:50:45.000Z",
          "Titre": "I tried to use my Tello Dollars to pay…",
          "Contenu": "I tried to use my Tello Dollars to pay yesterday's bill manually but I couldn't find an option to do that. After seeing that I had paid the whole amount with my credit card, I contacted customer support and they explained me the situation. I still think it is too confusing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jackie Clift",
          "Nb_Reviews": 1,
          "Date": "2022-09-14T09:23:48.000Z",
          "Titre": "I'm having a horrible experience",
          "Contenu": "I'm having a horrible experience. I'm not able to view anything, not even my account information. I have no way of making sure I can make sure my next month will be here! I'm so upset. I need HELP..Please"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ladonna Biehl",
          "Nb_Reviews": 1,
          "Date": "2022-07-10T23:21:53.000Z",
          "Titre": "Service has been very poor last few…",
          "Contenu": "Service has been very poor last few months.  Way too often get notice that carrier has temporarily cut off service.  Often takes 2-3 days for text messages to go through and phone very often not available for voice.  We had a big field fire this week with husband severely burned and unable to call for help.  Will likely be changing soon.  Loved the service when we first got it.  Disgusted now."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Cindy Martin",
          "Nb_Reviews": 1,
          "Date": "2022-08-16T11:11:32.000Z",
          "Titre": "Reception is very poor at my house…",
          "Contenu": "Reception is very poor at my house despite being in the city.  I can only use WiFi calling.  Despite being able to get strong signal in some areas of city, I can’t get but 1 or 2 bars of cell strength in others which makes it bad if need to make emergency call."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "deb pottery",
          "Nb_Reviews": 1,
          "Date": "2023-02-09T13:04:58.000Z",
          "Titre": "I can’t get voicemail to work no matter…",
          "Contenu": "I can’t get voicemail to work no matter what"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Julie Stickel",
          "Nb_Reviews": 1,
          "Date": "2022-06-28T15:29:56.000Z",
          "Titre": "We love the price but not the reception at our home",
          "Contenu": "We love the price, but we have to work to get some texts to send. We try different things: go outside, turn off the WiFi on the phone, set the phone in certain places in the house, or wait to get/send texts until we drive away from our house.  Distressing when you need to send/receive texts immediately..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "eek151",
          "Nb_Reviews": 2,
          "Date": "2022-04-23T12:47:57.088Z",
          "Titre": "Network Change -> No Signal in my own Apartment",
          "Contenu": "I have had tello for several years now and was always a big fan. When they switched networks recently, I started having issues with service - even at my own apartment! People try to call and it goes straight to voicemail. I will need to switch to a new provider which is so sad because you can't beat the price point Tello offers."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Edith Wo",
          "Nb_Reviews": 2,
          "Date": "2022-04-12T18:22:57.000Z",
          "Titre": "Not great value",
          "Contenu": "okay service, LTE/3G only network, no 5g access to T-Mobile's network if you use iphone. Free international calling doesn't include Hong Kong and Macau. For the same data allowance and features(5G access, free international calling) I would rather go for redpocket's 8GB/month annual plan($240/yr vs tello's 4GB $19/month). Oh, and also no reception if you are in Alaska because tello doesn't include domestic roaming. Good luck."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sarah S",
          "Nb_Reviews": 2,
          "Date": "2022-07-26T11:55:16.000Z",
          "Titre": "Tello not suitable for traveling",
          "Contenu": "I've been traveling lately, both domestically and internationally, and I've realized how limited I am when it comes to coverage. Tello doesn't offer roaming, and it took awhile to figure out how to activate wifi calling on my phone for my international trip, and you're a sitting duck if you don't have Wi-Fi. And good luck traveling in the Midwest on a road trip. We were nearly stranded in the middle of nowhere of NE on our way west. No roaming meant no gps as we were driving. but we only knew this after the fact when our next leg of the journey was constantly \"recalculating\". Not sure how sustainable tello will be for me as I aim to do more traveling in the future."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Claudia",
          "Nb_Reviews": 2,
          "Date": "2022-06-10T14:49:12.000Z",
          "Titre": "Your price is right",
          "Contenu": "Your price is right, but you've removed services that I used to enjoy. Now I have to go out across the street in order to send and receive text messages because you no longer support WiFi transmission. Boo! I am looking for another service provider."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kenneth Kiser",
          "Nb_Reviews": 2,
          "Date": "2022-06-19T22:50:57.000Z",
          "Titre": "Tello was great as long as they were…",
          "Contenu": "Tello was great as long as they were using Sprint simm cards and piggybacking Sprint towers. Since it is all Tello simm cards now and I'm not sure whose towers, Tello is not bad enough to abandon but not good enough to recommend."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Craig Hashbarger",
          "Nb_Reviews": 1,
          "Date": "2022-04-08T13:45:48.000Z",
          "Titre": "This seems to be a classic example of…",
          "Contenu": "This seems to be a classic example of \"you get what you pay for.\"  The low price is fantastic, but the service has been extremely unreliable, even with respect to text messages.  I will be dropping this service in the next few months in favor of something more reliable."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Patricia",
          "Nb_Reviews": 6,
          "Date": "2021-11-19T18:32:52.000Z",
          "Titre": "An Economical Plan for those who stay in places with good coverage",
          "Contenu": "Tello provides low-cost mobile service but without roaming, I often don't have coverage.  Customer Service has been excellent in the past, but I fail to understand why the migration to the GSM SIM is an upgrade as now I have trouble setting up my voicemail that I had in the past.  I appreciate what Tello provides, but it doesn't seem to meet my needs any longer."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-10-09T13:45:12.000Z",
          "Titre": "The service offered meets my particular…",
          "Contenu": "The service offered meets my particular needs at this time...... However..... I had to order a phone to comply with gsm requirements only to learn a cdma phone with VoLTE works as well....And the phone tello sent was a cdma phone without VoLTE (LG Tribute Monarch refurbished Boost Mobile phone for $119)...and i had to return it..... Tho the experience was educational....i dont think it reflects well on tello service....."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Glenn Cox II",
          "Nb_Reviews": 2,
          "Date": "2021-10-13T12:41:15.000Z",
          "Titre": "So Far service is ok",
          "Contenu": "So Far service is ok.  I had to upgrade a plan and was forced to pay the entire amount after only having service for 2 days.  I also lost my 20% promotion for the 1st 6 months on that line.  Also Unlimited is not really unlimited.  You get 25 GB and then are throttled down.  LOL, you 2g is useless and you know it.  You reply is insulting."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David Shaheen",
          "Nb_Reviews": 1,
          "Date": "2021-09-11T15:57:52.000Z",
          "Titre": "Internal speaker did not work",
          "Contenu": "Internal speaker did not work.  Don’t you check this stuff out before selling it?EDIT: Customer service did contact me.  They asked if I wanted a refund or a replacement phone.  I asked for a replacement.  After returning the phone, they sent me an email indicating there was no replacement phone available. (why offer one then??).  Anyway, I do appreciate them contacting me."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mario Garcia",
          "Nb_Reviews": 3,
          "Date": "2021-09-26T02:01:52.000Z",
          "Titre": "Good Plans/Poor Service",
          "Contenu": "Prior to the change to a GSM sim card, the service was good.  Recently after the change, my pictures to and from my phone won't go through most of the time.  My call quality has also deteriorated.  Calls either drop or when I am on them i can't her people or they cannot her me.  I am using a Iphone 6s and had no issues with other carriers on this phone.  I do like the plan options and low price, but guess the say you get what you pay for is right."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "DAVID WILLIAMS",
          "Nb_Reviews": 4,
          "Date": "2021-08-29T13:21:35.000Z",
          "Titre": "To many robo calls",
          "Contenu": "The price is great but the robo and telemarketing calls are horrible.  You can expect when you get a new number to get calls from the previous owner for a month or so.  I have had this tello number for several months and the robo calls are coming stronger than ever.  I think tello sells your information to these telemarketers that is why the price is so low.I have blocked over a hundred phone numbers and text message and I still get robo call trying to sell me stuff."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chris in Ohio",
          "Nb_Reviews": 1,
          "Date": "2021-08-21T22:00:11.000Z",
          "Titre": "Good Customer Service, Bad Cell Service",
          "Contenu": "Tello customer service was always very helpful, but it didn't make up for the fact that the cellular service was never close to functional.  I'm in a small town with historically bad T-Mobile/Sprint coverage and, after 6 months of trying, when I switched to another carrier who uses AT&T networks, my phone worked immediately."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nathan Deller",
          "Nb_Reviews": 1,
          "Date": "2021-06-01T15:48:26.000Z",
          "Titre": "Disappointed",
          "Contenu": "Yes, it is cheap, but it has seriously started to fall short of my expectations. My service has started to be very poor almost all the time, and I can no longer send or receive pictures over sms, send group messages, or use my voicemail properly. All in all I used to love tello for the price but now I’m seriously considering spending a little more so I can actually use what I am paying for."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Louis Cordero",
          "Nb_Reviews": 6,
          "Date": "2021-08-28T17:16:09.000Z",
          "Titre": "Tello was very good when I started with…",
          "Contenu": "Tello was very good when I started with this service. Then things started to go downhill after that. My calls are dropped more and more often and it is getting worse as time goes on. What is happening Tello?! A loyal customer who is disappointed with a good service that is not so good anymore. Hope you can fix the problem."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Esama",
          "Nb_Reviews": 2,
          "Date": "2021-06-07T11:36:22.000Z",
          "Titre": "Budget friendly",
          "Contenu": "Switching was my husband’s idea. I would say calls and texting has been good ONLY if you are in the somewhat limited coverage area. My main issue is with the internet… it completely sucks. It just doesn’t work. I can’t rely solely on my home WiFi, I am not always home. We have been stranded multiple times on the road because we can’t access waze. I am seriously considering reverting to my previous service provider. With that said Tello is good on a budget and I guess you get your money’s worth."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kristin Artman",
          "Nb_Reviews": 2,
          "Date": "2022-06-13T16:59:43.000Z",
          "Titre": "Service doesn't work at times",
          "Contenu": "Service doesn't work at times.  Can't receive texts or phone calls for no reason when there are enough bars for proper functioning.  Only just started having problems in the last month or 2."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "fred m",
          "Nb_Reviews": 1,
          "Date": "2020-10-04T15:04:19.000Z",
          "Titre": "I often receive texts much later than…",
          "Contenu": "I often receive texts much later than when sent. Sometimes my texts sent are not received. I have a hard time hearing conversations clearly, and people complain they can’t understand what I am conversing, very often repeating. I purchased the LG phone from you.I will be purchasing a new phone soon and discontinuing my service with your company. I saved money while with your company but have to go back with Verizon."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nic H.",
          "Nb_Reviews": 1,
          "Date": "2020-08-20T20:21:25.000Z",
          "Titre": "Greedy Prepaid Policy Change Not Good",
          "Contenu": "Tello used to be great now not so much. There is now  prepaid mininum spending of $20.00 every 3 months. If no order is placed in 3 months your prepaid credits will expired and your service will be terminated. Why can Tello allow people to spend based on what people need and not set a high minumun prepaid order in a short 3 months duration period. Not good at all."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Raj Pippalla",
          "Nb_Reviews": 1,
          "Date": "2020-05-20T16:45:26.000Z",
          "Titre": "$6 plan and $4.15 for taxes.. really?  & you dont mention it till you switch.",
          "Contenu": "$6 plan and $4.15 for taxes.  Of which there are all kinds of categories.  It would be nice if Tello would give you an idea of the total bill vs $6 as a plan. You would expect taxes to be around 10 - 20% max.  This is around tax.  It is close to being unethical.  Deeply disappointed.  Will be with tello since I paid a tranfer fee etc. But, it's not a company that I will stay with."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JB Basinger",
          "Nb_Reviews": 3,
          "Date": "2020-07-16T16:10:31.000Z",
          "Titre": "Not good in rural areas.",
          "Contenu": "Your techs don’t know a lot. Should be better trained. Your signal is weak  where I live. All Sprint network services are. I will probably be switching to Spectrum and spouse deal with less data. It’s sad that a Sprint tower is not far from where I live but the signal is just too weak. One to two bars is not enough. Calls get dropped all the time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "mdc",
          "Nb_Reviews": 3,
          "Date": "2020-08-25T15:35:15.000Z",
          "Titre": "Dropped calls",
          "Contenu": "Dropped calls.  After several attempts of failed instructions, all what I am left of with is that \"there are issues technicians are working in your area\".  When asked how long will take Tello has no idea.  So basically no solution, no set expectation.  Very disappointed.  For several years I was happy but now no more."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2020-12-23T20:06:21.000Z",
          "Titre": "The service seems great",
          "Contenu": "The service seems great.  However the network constantly drops out or will quit when you're in the middle of a search.  Would love it if they had a better network and way of keeping the service up for data usage.  Phone calls always go through, so the only real problem is with the data dropping out."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jean Klippstein",
          "Nb_Reviews": 1,
          "Date": "2020-09-21T20:59:39.000Z",
          "Titre": "I am very disappointed with the cell…",
          "Contenu": "I am very disappointed with the cell coverage of Tello.  My phone drops calls and has very poor service whenever I leave the Chicago area.  If I am supposed to be on the Sprint cell towers, something is seriously wrong because when I am traveling with other people who are on Sprint, they have no issue.I love everything else about Tello, and I would love to be able to recommend it but unfortunately, I don't feel safe traveling with this service and have to consider switching to another carrier."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tom Nguyen",
          "Nb_Reviews": 1,
          "Date": "2020-02-17T13:50:30.000Z",
          "Titre": "Sometimes I won't be able to received…",
          "Contenu": "Sometimes I won't be able to received email or text message until the next day and also text to my daughter and friends and they won't receive it until next day. A lot of time I have one bar signal on my phone. My daughter said they received multiple same text messages since I text only once. I hope tello.com can improve better."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Hilmer Shackelford",
          "Nb_Reviews": 1,
          "Date": "2019-03-02T13:11:05.000Z",
          "Titre": "Phone drops to \"No Network Available\"…",
          "Contenu": "Phone drops to \"No Network Available\" too often.  Receive no notification of this other than incoming calls go directly to voicemail, inconveniencing caller, and I know nothing is wrong until I attempt to call out to see the message.  Have to reboot phone to fix.Charger connector on refurbished phone was faulty.  Tossed it and use Samsung charger that came with my Notebook."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Andrea Maul",
          "Nb_Reviews": 1,
          "Date": "2019-01-28T21:07:37.000Z",
          "Titre": "I ordered a phone and purchased a…",
          "Contenu": "I ordered a phone and purchased a service plan for my son for Christmas.  I was having trouble activating the phone and when I called I was told there is no service in my area.  Since I had the phone for more than 30 days I couldn't return it (as I stated, it was a Christmas present so it was bought early).  I wish I would've been told there was no service in my area prior to spending almost $100"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kyle c",
          "Nb_Reviews": 7,
          "Date": "2019-02-26T02:33:33.000Z",
          "Titre": "I use To be their biggest fan not pleased this time",
          "Contenu": "I have really been please with tello until this experience they first sent me a new phone that wouldn’t activate them they sent me another phone that would not activate and i finally ended up having to buy a used phone which activated fine. As good as my previous experience has been this was really bad went for a long time with out a phone then took weeks to get a refund"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JEFF",
          "Nb_Reviews": 2,
          "Date": "2018-10-10T00:11:59.000Z",
          "Titre": "the alcatel flip phone I got is junk…",
          "Contenu": "the alcatel flip phone I got is junk quit working1 day after 30 day warranty. now it shuts down will not start up till I remove the back take battery out and replace have to go outside to get a signal constantly loses signal just junk.price is reasonable for service but this phone is junk. I am 64 I cant afford any other service so I will stay with tello just wish the phone would work .thanks jeff"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mario",
          "Nb_Reviews": 1,
          "Date": "2020-12-20T02:48:20.000Z",
          "Titre": "Excellent to make calls here in…",
          "Contenu": "Excellent to make calls here in Baytown, Texas, but no 4G coverage. Hope Tello run on Tmobile network soon...                                                                                           Downgrade to 2 stars because lately international voice service is horrible. Phone calls to Mexico drop over and over again. Tonight I realized is a Tello problem 'cause after 2 dropped calls switched to Google Voice and the call went without interruptions. Im a loyal customer and would like Tello stand up and fix this issue..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joshua KIm",
          "Nb_Reviews": 3,
          "Date": "2020-01-29T17:41:18.000Z",
          "Titre": "For more than 1 year period",
          "Contenu": "For more than 1 year period, I have had more than a few calls that never rang on my phone in the 1st place & were not even registered as missed calls & text messages that were never delivered to my phone when family/friends texted me on my phone. I called tello technical support & the phone was re-set several times but did not fix any problem.Now, tello has suggested that it might be an issue with my phone & that a factory re-set or buying a new phone could solve the problem."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Del Eslinger",
          "Nb_Reviews": 7,
          "Date": "2019-10-30T21:02:58.000Z",
          "Titre": "It is difficult to discern issues.",
          "Contenu": "It is difficult to discern issues - is it a problem with Sprint or Tello.The difficulty with international calls (Europe) are taking us and our business / church / family relationships to exploring other venues. Altec has surfaced as a viable vendor.Sprint's lack of service in the north and northwest is unacceptable."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "No name",
          "Nb_Reviews": 1,
          "Date": "2020-10-15T16:00:53.000Z",
          "Titre": "Don’t bother calling their customer…Don’t bother calling their customer service line, nobody will answer it. They don’t call you back so don’t bother leaving a message. The email responses were prompt",
          "Contenu": "Don’t bother calling their customer service line, nobody will answer it. They don’t call you back so don’t bother leaving a message. The email responses were prompt but appear to be partially canned responses and so we’re confusing. After many exchanges, they did resolve my problem."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 3,
          "Date": "2021-10-18T15:01:54.000Z",
          "Titre": "I am disappointed with how often phone…",
          "Contenu": "I am disappointed with how often phone calls and texts are completely unavailable to me. And my data use to be available away from wifi, but lately I get NO INTERNET is spite of having plenty of remaining mbs.When I ask you guys, you tell me to reinsert my sim card but that is not the problem. The problem is you shut me down for many hours in a day and often I absolutely NEED to make a call or text but the screen just says no service or schedule this call for some other time. So If I could get a reasonable explanation for this or a work around that actually functions, that would be nice. Otherwise, I'm changing service providers soon."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jenn",
          "Nb_Reviews": 1,
          "Date": "2022-05-26T14:26:11.000Z",
          "Titre": "My calls are regularly dropped and my…",
          "Contenu": "My calls are regularly dropped and my phone data  just doesn’t work sometimes when I leave my house WiFi. The data times out or is super slow…Love the price, but service needs work."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Scott Alesch",
          "Nb_Reviews": 1,
          "Date": "2022-10-02T15:43:37.000Z",
          "Titre": "I can't use data.",
          "Contenu": "I can't use data.. so I pay for something that I don't get. But low price you expect cheap service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Serena V",
          "Nb_Reviews": 1,
          "Date": "2018-10-02T20:47:34.000Z",
          "Titre": "Many callers will call you",
          "Contenu": "i thought its nice to change my phone number, that way no one will call me unless i tell them my new phone number, but i was wrong, so may calls and numbers that i don't know keep showing on my phone, when i call Tello, they pretty much told me, they didn't know why, i really didn't like the answer from them!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ronald Ballard",
          "Nb_Reviews": 1,
          "Date": "2019-09-14T12:30:21.000Z",
          "Titre": "i have had trouble with getting data…",
          "Contenu": "i have had trouble with getting data service outside my house going on 2 months now. i have a moto z and i thought it would be a good phone but not. i should of gotten a i phone instead. would like to trade it in for one! i cant open any photos or data service.need to be fixed. before i came to tello they said i would have good service and it lasted one month now i cant trade my phone in for a new one because it only had a 30 day warrenty which they didnt tell me. never had such bad phone service and horrible warrenty on a phone before!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 6,
          "Date": "2020-04-26T19:19:39.000Z",
          "Titre": "Price plans are good but with Tello…",
          "Contenu": "Price plans are good but with Tello piggybacking off SPRINT the service isn’t good. The 4g is lousy, it keeps stopping on Google map or other road finding app specially when your driving. You loose the signal. Also you cannot switch caller ID off. It remains on at all time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "RS",
          "Nb_Reviews": 3,
          "Date": "2019-08-13T05:29:15.000Z",
          "Titre": "Very poor service",
          "Contenu": "Very poor service, always losing connection, especially at the most critical times! It is a rare luxury when i can have a normal conversation on my cell from start to finish without the reception waving in and out. I know it's dirt cheap but a little bit of service would be nice."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 1,
          "Date": "2020-01-02T15:30:31.000Z",
          "Titre": "Techs have been unable to resolve issue…",
          "Contenu": "Techs have been unable to resolve issue with telephone not receiving incoming calls. I called myself after setting up service and the call went through but have not been able to get any other calls since. I have been issued a ticket number and told to wait 24 hours but issue still not resolved. Called again and go through all steps again and then told wait 24 mores hours. I did not receive an email or anything so I called back again and am told to wait another 24 hours while they contact the main provider again! I've been patient but really frustrating!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Barbara Brown",
          "Nb_Reviews": 3,
          "Date": "2019-10-23T14:18:59.000Z",
          "Titre": "You started off great then",
          "Contenu": "You started off great then, as you launched your promotions, the service got worse and worse.  The tower malfunctions with every weather disturbance, you no longer have the bandwidth to support your subscribers here during busy times, the hotspot keeps going down when being used...   I know you are working very hard to correct this but I can't afford to keep you as my main internet connection.  I will keep you as a standby and possible backup because I like your CS reps. immensely but, if you don't get on top of this soon...you're screwed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alfonso Davila Jr",
          "Nb_Reviews": 2,
          "Date": "2020-11-24T06:22:54.000Z",
          "Titre": "Data seems to take a long time",
          "Contenu": "Data seems to take a long time to do anything, im comparasion to my brother's provider. we both have the same phone and and his apps just connect much quicker and respond better.  Voice is fine, text is fine just data seems to be slower than average."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Me",
          "Nb_Reviews": 1,
          "Date": "2019-02-06T21:26:02.000Z",
          "Titre": "Get what you pay for",
          "Contenu": "Got the service for a cheap plan for my 10 year old daughter. Spotty service and number I was given has numerous debt collectors calling and still get texts from previous users contacts. Called to see about getting assigned a new number and was told no. I guess you get what you pay for."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Thomas Hudd",
          "Nb_Reviews": 1,
          "Date": "2019-03-04T18:04:03.000Z",
          "Titre": "Okay service",
          "Contenu": "Okay service, but no roaming (a real big problem when I'm overseas!), no rollover of unused data, minutes; and not as cheap as it seems with auto recharge hitting every time you go over your data amount.  Probably wouldn't go with them again, planning to switch back to Sprint."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dionne Klingensmith",
          "Nb_Reviews": 3,
          "Date": "2019-03-18T04:21:42.000Z",
          "Titre": "Bad equipment/OK service",
          "Contenu": "Service has been fine, but I had horrible issues with purchasing phones from them in the beginning.  I still have the unusable phone they sent me.  I stay with them because they are the cheapest I can find.  Also, they sent me a request to review them, so I'm just being honest."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bari Shenkman",
          "Nb_Reviews": 2,
          "Date": "2020-05-09T12:13:22.000Z",
          "Titre": "Accessing help and technical support…",
          "Contenu": "Accessing help and technical support took 4 hours. 3 of your people answering technical support questions in the chat did not give out the most basic information of how to set up the phone. the answer to the question that all of them should have known is to skip through the Google screen skip skip skip until you can access the phone's settings. In the settings, you then reactivate the phone through the Samsung note 9 phone settings. Train your people to see what the customer sees. If I can't activate with you having already ported it over to you, then I'll just port back from you."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Phone CLV",
          "Nb_Reviews": 1,
          "Date": "2020-04-30T18:48:47.000Z",
          "Titre": "Don't Let Your Automatic Billing Card Expire!!",
          "Contenu": "Although I have been pleased with Tello's service, it is useless should you forget to update the credit card information they have on file when it expires. You will not be given notice; they will simply cut you off and, instead of allowing you to simply update your billing information, you will be required to sign up for a new plan as if you were a new customer! A HEADACHE which could EASILY BE AVOIDED if they SIMPLY SEND YOU A TEXT informing you that they were unable to bill your card. This is an EXTREMELY INEFFICIENT manner to do business, but a great way to waste your customer's time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2022-08-18T19:53:10.000Z",
          "Titre": "International calls",
          "Contenu": "International calls always get disconnected for every 5 min. Can’t receive local messages or calls in-spite of being in coverage area."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bk",
          "Nb_Reviews": 1,
          "Date": "2020-10-19T14:41:27.000Z",
          "Titre": "Pay as you go is no longer a good option",
          "Contenu": "Pay as you go is no longer a good option at Tello. The minimum is now $20 (+taxes) for 3 months which is around $6.67/month - so you are better off with a plan. But the lower priced plans have higher taxes than the higher priced plans. So you might end up paying more for some lower priced plans than higher priced plans.If you subscribe to Pay as you go, then you need to track the expiry date yourself. The online account does not show the expiry and there is no warning. The balance on your account is just gone - as happened in my case. If you have any balance, you cannot get it refunded or transferred. You just lose it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bns",
          "Nb_Reviews": 2,
          "Date": "2019-11-22T00:17:03.000Z",
          "Titre": "its not really a simple 14 dollars a…",
          "Contenu": "its not really a simple 14 dollars a month, taxes are added on which isn't the biggest  deal.  but the tale is in the truth here. custom service is blahsay. just like any other.. expect to get what you pay for. would I recommend these guys... most likely no"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Carolyn Ratcliffe",
          "Nb_Reviews": 2,
          "Date": "2019-10-03T02:30:54.000Z",
          "Titre": "Tello is cheap and the Service is…",
          "Contenu": "Tello is cheap and the Service is sporadic. Has weird cut off of conversations if they thinkThey go On for Too Long. Had repeated cut offs when speaking  ro friend in Canada. All Tonight all Of a sudden downgraded to 3G service which is awful- nextTo nonexistent with trying to access information/emails.Guess you get what you pay for. My planJust renewed 09/22/2019. By Oct. I was downgraded to 3G. Very weird about sending texts as well. When I am notOn Wifi, text transmission. Is frequently not delivered.  Am thinking about switching servers again Because service is problematic."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jean Pierce",
          "Nb_Reviews": 5,
          "Date": "2019-02-20T17:46:28.000Z",
          "Titre": "Tello doesn't stand behind their products that they sell or their service.",
          "Contenu": "My husband's phone doesn't work.  You won't fix it.  My minutes and data don't roll over.  We purchased our phone through Tello.  I think they should fix it or provide an avenue for it to be fixed.  I think that a company that sells an inferior product and doesn't stand behind it provides a poor quality of service.  How can we continue our service with Tello when the phone won't work?  Tello called after my review and talked to my husband and told him they would not fix the phone or provide any avenue for it to be fixed and cancelled his account."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jole",
          "Nb_Reviews": 2,
          "Date": "2021-10-22T14:15:49.000Z",
          "Titre": "No 5G as advertised",
          "Contenu": "Tello made a promise that 5G would be available by now. Still stuck on LTE on the iPhone even months later. I’m essentially paying the same price as those who do have it but for less performance. Very upsetting."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ben Hall",
          "Nb_Reviews": 1,
          "Date": "2021-09-29T10:43:10.000Z",
          "Titre": "You get what you pay for: very weak signal coverage on older phone",
          "Contenu": "I understand that often in life \"you get what you pay for\"The signal for out daughter's phone has been highly disappointing.  Text messages are nearly non-functional [except when connected to wifi  -  which we could do without subscribing to Tello ofcourse].  The phone signal does work, but, again, very spotty coverage.I also understand that she is using an older device [iphone 6], but when I used that same phone as my primary device prior to handing it down to her, I did not have these issues when it was connected to operate on another network [with a higher pricetag].So, in short, going back to my opening salvo, this truly appears to be a case of \"you get what you pay for\""
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "..",
          "Nb_Reviews": 1,
          "Date": "2019-07-20T13:40:28.000Z",
          "Titre": "The coverage was not as good as AT&T",
          "Contenu": "The coverage was not as good as AT&T. They changed my plan without noticing me, and even unchecked my option so that they did not notice me by email 48 hours prior to charging me. Still leave a 2 star since it is probably still one of the cheaper options."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Samuel Clovis",
          "Nb_Reviews": 2,
          "Date": "2021-09-12T14:06:53.000Z",
          "Titre": "Since Tello is using t-mobile as a…",
          "Contenu": "Since Tello is using t-mobile as a provider, reception is spotting, calls are dropped, and at many times I cannot even get or make text or calls!!  I would NOT recommend Tello to anyone now. Get rid of t-mobile."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ben Clark",
          "Nb_Reviews": 1,
          "Date": "2019-04-27T13:43:17.000Z",
          "Titre": "Unless you live in a large metropolitan…",
          "Contenu": "Unless you live in a large metropolitan area, the coverage is sub par. It says I would have great coverage but that wasn’t true. I would almost rather pay $15 more dollars a month to go back to Verizon. In the end, you get what you pay for, which is not much."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Caitlin Spencer",
          "Nb_Reviews": 1,
          "Date": "2020-05-21T22:21:55.000Z",
          "Titre": "Their customer service is terrible",
          "Contenu": "Their customer service is terrible, they just copy and paste possible reasons for my issue instead of answering my specific question. We emailed back and forth a dozen times, and each time they just copied and pasted the same \"possible reasons.\" They offered a 3 way call to solve the problem, then backed out. They offer a 24/7 customer support phone number that never picked up when I called. I was without phone service for 17 days thanks to them. After finally getting everything resolved, my phone service has been fine and it is the cheapest plan we found, so that's why I gave them two stars instead of just one."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kim Edwards",
          "Nb_Reviews": 1,
          "Date": "2018-11-11T22:01:00.000Z",
          "Titre": "Slow connections, no voicemail",
          "Contenu": "I have not been happy with the service.  Connections have been much slower and I no longer am able to get voicemails.  Sorry to have to report such a low rating, but if you can find a way to assist me, perhaps the next review will be more favorable.Regards,"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Josh Kirkpatrick",
          "Nb_Reviews": 1,
          "Date": "2019-11-08T15:07:02.000Z",
          "Titre": "Need different, unused, phone number",
          "Contenu": "The pricing is good and the Tello service and online account is easy to use.  However, with the phone number we were given, we constantly receive, often inappropriate, texts and phone calls.  It is inconvenient to constantly block phone numbers."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Erica Cohen",
          "Nb_Reviews": 1,
          "Date": "2021-04-14T01:40:14.000Z",
          "Titre": "Tello was great until....",
          "Contenu": "Tello was great until we purchased new phones a few weeks ago.  My husband and I now have super spotty service, calls drop often, no visual voicemail and group texts no longer come in on one string.  Super frustrating!"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Robert",
          "Nb_Reviews": 2,
          "Date": "2019-02-27T13:54:06.000Z",
          "Titre": "Generally I don't get great service…",
          "Contenu": "Generally I don't get great service with Tello, which is true both in New York city and throughout New Mexico where my family live. It's really hard to make a call without it dropping and sometimes getting any data is impossible as well."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Charles Claude",
          "Nb_Reviews": 2,
          "Date": "2022-01-02T18:15:02.000Z",
          "Titre": "A Good But Unreliable Service From Home",
          "Contenu": "The cell reception around the Phoenix area where I live is generally good and I enjoy the service. As soon as I travel or go 100 miles from base my service goes from 4G to E (edge) and basically I can do nothing. Eg I spent a fortnight in New York and had little service. Same thing with Chicago, San Diego, Philadelphia etc. Basically it's unreliable and I always need a backup. I've complained and all they do is ask me to set my APN to something else. I have reset my network setting so many times to no avail. I have used other networks and never got this before. Anyway that's me, I can't tell if this happens to others, but it's not a service I can always rely on. I read recently Tello still uses the Sprint network, don't k ow if it true but it's a shame."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JL",
          "Nb_Reviews": 1,
          "Date": "2021-03-09T11:23:43.000Z",
          "Titre": "Tello's LTE is 3G?",
          "Contenu": "Installed Tello's T-Mobile sim cards to my iPhone 7Plus and iPhone SE which are both LTE/Volte capable (confirmed with Apple) only to find out that both phones drop from LTE to a 3G connection when placing voice calls with poor quality and slow data speeds during placed call. I live in a very strong signal area in Queens NYC. Also constantly receiving pop-ups if I want to update cellular network settings which I agree to however does not resolve issue. Tello's technical support unhelpful falsely claiming that their is a tower outage or blaming Apple phone for not having VoLTE (disproved by Apple) or congestion drops calls from LTE/VoLTE to 3G. (Never had 4G call anywhere).Disappointed customer."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Pk",
          "Nb_Reviews": 1,
          "Date": "2018-10-25T07:38:49.000Z",
          "Titre": "Very cheap plans",
          "Contenu": "Very cheap plans. Fast customer support but they mislead you and do not provide complete information. I had bad experience in porting out my number. They also do not offer WiFi enable calls and that’s major drawback of Tello."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Guadalupe Karen Zamudio Cordov",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T08:29:05.000Z",
          "Titre": "My phone does not work as before.",
          "Contenu": "Many people inform me that they call me and I do not receive the calls.  sometimes people they do not listen to me o I do not hear them for moments during a call.  My phone take fotos of my face and add it in videos. Would you please help about it.  Thanks in advance."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "bats",
          "Nb_Reviews": 3,
          "Date": "2023-12-05T10:27:35.000Z",
          "Titre": "I love the tello realistic pricing…",
          "Contenu": "I love the tello realistic pricing however customer service is hit or miss,I had one tech say my table isnt compatible with tello when of course it is the techs ego wouldnt allow him to admit he was incompetent, that type thing.I can deal with inconvenience to get the good price my wife cant."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 3,
          "Date": "2023-12-09T04:05:42.000Z",
          "Titre": "Backup Data now Gone",
          "Contenu": "Not quite through my first month of service. The Service was Excellent! HOWEVER, December 5th, they decided to change up all their plans. Specifically, they increased the high speed data, however, they got rid of the 64kbps fall back. While the additional high speed data is nice, lack of the 64kbps fall back means, when you run out of data, your done. No more working service. You can't even get online without another data source, such as wifi, to top off service if you need more. We were testing out with an ipad, and were planning to add 4 more ipads and a phone at renewal time, and more in the future, however, having no working data at all is a deal killer. So this brings my 5 star down to a 3.As a poster on reddit puts it, and summarizes it quite well:\"Before: blow through 500mb, no longer able to browse, but still able to send an occasional WhatsApp text, control the IoT intercom door lock and parking gate, activate a bus ticket etc...After: blow through 500mb, have 500mb more, blow through that as well, stuck without ANY data for the rest of the cycle.\""
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert Isenberg",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T08:21:42.000Z",
          "Titre": "payday vs renewal date",
          "Contenu": "getting paid every 2 weeks does not jibe with 30 or 31 days renewal"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Poonam saed",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T07:21:21.000Z",
          "Titre": "At the very first two years ago when I…",
          "Contenu": "At the very first two years ago when I enroll tello mobile, I had six gigabyte data and unlimited talk. I was able to complete a month little short, the later I upgrade for 10 GB. I almost finished about 7/8 GB still run couple of GB end of the month. Then I was switching for unlimited gigabyte data supposed to get a 25 4G, now only 25days  finish all my 4g data, even though most of the time especially night times I use my home internet. I just could not believe something is not right at the beginning was very good now looks like they're slowing down intentionally then you must upgrade."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Hinkley",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T13:25:57.000Z",
          "Titre": "Reception occasionally spotty in Northern Maryland",
          "Contenu": "Reception occasionally spotty in Harford County Maryland.  Many times have not received calls that should have gone through. Instead they went direct to voicemail.  Calls such as acknowledging appointment in doctors office, etc.Otherwise fairly few dropped calls or poor quality of sound."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Simons",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T07:22:12.000Z",
          "Titre": "Room for improvement",
          "Contenu": "Obviously the price is right for me and my needs. Phone service is not very good, low coverage outside any major city limits in the state of Oregon currently. Internet speeds vary greatly"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jacek Nowak",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T21:03:15.000Z",
          "Titre": "All works fine but,",
          "Contenu": "All works fine, but: \"Unlimited\" data turns out to be limited to 25GB. A few minutes after sim activation, I was bombarded by scam calls and they keep calling. Apparently they selling phone numbers to scammers."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "publicly visible",
          "Nb_Reviews": 2,
          "Date": "2023-06-20T13:08:53.000Z",
          "Titre": "My payment Methods got hacked !",
          "Contenu": "reasonable Service,  Great customer support, bad, Payment gateway,  Hacked my prepaid card. Great value if you dont get Hacked, 2 seperate accounts same thing both. use paypal no problems.Come on ! requestion every piece of information just to process so trustpilot wont  delet me  YOre Kidding !"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2023-07-25T02:57:37.000Z",
          "Titre": "Phone call connection",
          "Contenu": "Phone call connection: Not good - frequently the service cannot deliver the phone calls at first time though it is in an area with excellent coverageUnused data: Cannot automatically carry over.Data plan: Good - can choose an option based on need"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Celina Carey",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T20:31:30.000Z",
          "Titre": "wi-fi charges?",
          "Contenu": "One problem  I have is when I am home listening to commercial radio on wi-fi usint ootunes app,I am getting dharged data bits/bltes. I have veen retired  22 years and have to limit my expenses. Have I got my iPhone 13 configured wrong and charged for wi-fi?  Ken"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mike T",
          "Nb_Reviews": 2,
          "Date": "2023-08-21T14:39:56.000Z",
          "Titre": "Account payment links.",
          "Contenu": "Links to make payments is not obvious. I had to edit my payment method and the links did not tell me that it was or wasn't accepted. When I had not gotten an email confirming changes, I then resubmitted. I had to use another device to make upgrade because mine had been shut down. It would be nice if there was a way to keep paying account open."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alex Kim",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T07:48:17.000Z",
          "Titre": "I have been a user of Tello for 2 years…",
          "Contenu": "I have been a user of Tello for 2 years now. I do appreciate the service but I do now see the price to benefit ratio falls behind compared to other esim providers and as a user am a little sad to see this happen."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Bryan",
          "Nb_Reviews": 2,
          "Date": "2023-08-15T16:52:03.000Z",
          "Titre": "A Positive Review",
          "Contenu": "The service isn't s reliable as I would like. There are times when long text messages just won't send even though pics will send with no problem. Most recently my hotspot repeatedly quit for a couple of hours especially high speed though I only started a new billing cycle and need it most.I do enjoy being able to change your plan freely but it is weighted hevaly on data."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "kaz takayama",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T07:32:48.000Z",
          "Titre": "The step to transfer my original phone#…",
          "Contenu": "The step to transfer my original phone# was not clear. When a new sim was inserted, my old service was deactivated and all existing phone info was lost and hard to transfer. For 2nd phone, there's no confirmation to be activated successfully."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Mohammad",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T17:37:09.000Z",
          "Titre": "Tello is missing international roaming",
          "Contenu": "I find the only thing that is missing international roaming. We can make a call using the app while we are roaming but cannot hear voice mail or access messages. It would be great if at least these features were added."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Leonard Bunes",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T15:54:30.000Z",
          "Titre": "CALL QUALITY",
          "Contenu": "Many of my outbound calls, especially to businesses, are of poor clarity...the voice transmission on my end is badly distorted. If the party calls me back on their phone system the clarity usually improves markedly. Is this annoyance a Tello matter?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "RICHARD HOLMES",
          "Nb_Reviews": 6,
          "Date": "2023-02-27T16:04:44.000Z",
          "Titre": "My Experience with Current Tello Services.",
          "Contenu": "Generally, good service.  Customer support tends to be good. Coverage, not so much.  I've had issues with coverage areas that I didn't have with my previous service provider.  Only discovered the coverage issues when I was outside my home area, and needed coverage owing to a vehicle problem.  Now, I try to be more careful of where I roam, and whether I have coverage, or not.  Rating would have been higher, had I not had coverage issues.  Thank you."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Curtis Bay",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T16:55:35.000Z",
          "Titre": "Tello provides reliable service at an…",
          "Contenu": "Tello provides reliable service at an incredible price. My only disappointment was during my trip to Alaska last summer, where I learned that state is not covered."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rob Miles",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T18:02:28.000Z",
          "Titre": "price is right",
          "Contenu": "Internet connections are badWould like to use it while on the beach, but its outmore than half the time...However for what Tello charges,no complaints"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bernard Regier",
          "Nb_Reviews": 2,
          "Date": "2023-06-05T16:27:22.000Z",
          "Titre": "Auto-pay always",
          "Contenu": "No complaints with the service itself but auto-pay is not optional. For those of us with a pre-paid debit card, it translates into a couple days of confusion and frustration every single month."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "michael van horn",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T11:45:03.000Z",
          "Titre": "cant  ever  get a  signal in my house …",
          "Contenu": "cant  ever  get a  signal in my house  have to be outside and 30 feet away/ good thing i only use it to get  my password codes"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jaimie Noh",
          "Nb_Reviews": 1,
          "Date": "2023-05-13T06:54:22.000Z",
          "Titre": "Tello is cheap",
          "Contenu": "Tello is cheap, but it was difficult to activate and my friend has trouble hearing me when I call. My texts also sporadically fail one or two times a day for 10 or so minutes. It's unsafe if you were to ever need it for an emergency tbh."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MediocreInFlorida",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T22:03:54.000Z",
          "Titre": "I guess you get what you pay for?",
          "Contenu": "Well it's not bad for the money.But beware, it can be spotty coverage in places."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Josalyn Jackson",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T20:50:43.000Z",
          "Titre": "I Love the customer service and I love…",
          "Contenu": "I Love the customer service and I love the affordable plans. What I have a small issue with is in certain parts of my city I dont get service or if i go close to far out i will loose signal."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Matthew",
          "Nb_Reviews": 4,
          "Date": "2023-06-05T07:16:43.000Z",
          "Titre": "While I appreciate the ease of use",
          "Contenu": "While I appreciate the ease of use, when I asked to change my plan I simply had to forfeit what I had already paid in order to change the plan. Not hot on being double billed."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "AVJ",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T06:22:20.000Z",
          "Titre": "Activation took a long time whereas I…",
          "Contenu": "Activation took a long time whereas I wanted it instantaneous. While the plan mentions unlimited, speed got reduced drastically lost 25GB consumption."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Noland Weisser",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T14:58:07.000Z",
          "Titre": "Dislikes and Likes",
          "Contenu": "Dislikes - Frequent disruptions in service or not getting text messages from people in a timely manner.  Likes - cheap price and decent customer service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ed C",
          "Nb_Reviews": 1,
          "Date": "2022-12-12T00:19:34.000Z",
          "Titre": "Affordable service...if you can get it.",
          "Contenu": "Affordable service...if you can get it.Tello is one of the most affordable prepaid plans around. It works well when I'm in or near a town. On the rare occasion I need to travel, roaming between towns is almost non-existent. Get what you pay for I suppose. The other star it lost is for the hassle to get data to rollover. If you let the plan renew automatically, you lose the remaining unused gigabytes from the prior month. If you renew manually, the unused data rolls over, but you lose the remaining days on your plan. The only way to not lose days or data is to renew manually between midnight and whenever that morning the auto billing system runs your account. This is an enormous PITA! I never had any previous service providers pull this kind of BS. Again, you get what you pay for. Otherwise, the service has been fine. It's just the corners they cut are more than mere inconveniences."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ahmed Raoof",
          "Nb_Reviews": 3,
          "Date": "2023-10-19T01:28:05.000Z",
          "Titre": "Prices are not competitive any more",
          "Contenu": "Prices are not competitive any more. The other providers are offering better deals."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bonnie the bunny",
          "Nb_Reviews": 3,
          "Date": "2023-01-04T06:33:35.000Z",
          "Titre": "Changing plans .....lose days paid for",
          "Contenu": "They charge you to change plans before your plan is up. You lose any days you have already paid for on current plan. Update to Tellos reply. I had to wait to change the plan which meant remembering and checking the day to get more days use. Yes I am Frugal."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bertha Alba Torres Meza",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T19:09:17.000Z",
          "Titre": "I don’t like that you have limited…",
          "Contenu": "I don’t like that you cover limited territory only in the US, you don’t support Mexico"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marco Campos",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T09:34:58.000Z",
          "Titre": "I give tello 3 Stars",
          "Contenu": "I give tello 3 Stars because I don't like the fact that if your data that they give you for the unlimited plan reached the ending sicle your signal turns extremely slow, I think it should be unlimited as it is with the calls and texting that way every one comes to tello, because Tello would be the best since is doing better then anyone else the prices are perfect and the service is unique but is only that little detail that I wish they would have or change because this is why every customer gets frustrated with every company since they do the same thing just give them a serten amount of data for videos and Internet. I'll say if you change that you'll be the best telephone company."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Maurice Herboldsheimer",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T18:31:57.000Z",
          "Titre": "I like Tello",
          "Contenu": "I like Tello, especially for the price. Coverage seems to be spotty, but it works fine at my home; so I keep it there as a house phone."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Frank Giglio",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T17:23:40.000Z",
          "Titre": "my call drops or cuts out",
          "Contenu": "my call drops or cuts out. but the bars on my phone are showing more than half"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James Xin",
          "Nb_Reviews": 1,
          "Date": "2023-07-09T09:51:46.000Z",
          "Titre": "Unused data should be transferred to next month",
          "Contenu": "Any unused data should be automatically transfered to next month."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "sandman4452",
          "Nb_Reviews": 4,
          "Date": "2023-05-31T17:13:15.000Z",
          "Titre": "Ok at best",
          "Contenu": "The cell service is spot it cuts out data service fails in place. For the price I paid it’s what I expected."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Fen Wang",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T23:50:36.000Z",
          "Titre": "Extend the plan automatic renewal time",
          "Contenu": "The update time of the plan is from 12 am to 4 am every time. Should it be until daytime, even if it is 7 am?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Manoj Kokal",
          "Nb_Reviews": 1,
          "Date": "2022-09-30T06:43:25.000Z",
          "Titre": "Expedited overnight took 4 days",
          "Contenu": "I ordered a replacement SIM and picked an option to deliver in 24 hr but I got it back after 3 of which were working days.. Apparently, I was not told there was processing time before shipping it. If I knew it would take so long I would have not paid the extra money for shipping.UPDATE - Tello refunded expedited shipping fees. Changing stars to 3 from 2"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bill Morland",
          "Nb_Reviews": 2,
          "Date": "2023-11-12T16:29:53.000Z",
          "Titre": "Reception is very intermittant",
          "Contenu": "Reception is very intermittant .  Otherwise audio is clear."
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "Martin Morales",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T14:39:43.000Z",
          "Titre": "I need roaming in Mexico"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brent Washam",
          "Nb_Reviews": 4,
          "Date": "2022-08-15T04:19:04.000Z",
          "Titre": "I sometimes get poor audio connection…",
          "Contenu": "I sometimes get poor audio connection with dropouts, dropped calls upon answering or \"not registered on the network\" errors when I first make a call.  Don't know if its the local T-Mobile service in my area, Tello account, or my phone but I have changed the phone and problems have generally continued.  May change the service next to see if it resolves."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anne Carnes",
          "Nb_Reviews": 1,
          "Date": "2022-09-01T21:04:40.000Z",
          "Titre": "I was traveling to Corpus Christi from…",
          "Contenu": "I was traveling to Corpus Christi from north Texas and my service enroute, and at destination was not good. It was very frustrating as I needed my phone for work purposes.I did like that you sent me a text message when I had been running too much data using maps as a warning."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "B.J. Merholz",
          "Nb_Reviews": 3,
          "Date": "2023-03-21T17:50:29.000Z",
          "Titre": "Tello does not offer a cruise ship…",
          "Contenu": "Tello does not offer a cruise ship service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Salvador Torres",
          "Nb_Reviews": 1,
          "Date": "2023-01-13T21:39:13.000Z",
          "Titre": "We no have coverage in Mexico"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "unhappy customer",
          "Nb_Reviews": 1,
          "Date": "2022-07-29T17:43:32.000Z",
          "Titre": "disappointed",
          "Contenu": "I am disappointed that, since Tello switched to TMobile from Sprint, I seem to have less geographic coverage than before and there are periods of time when I get notices that my voice service is being turned off by my carrier.  Also, my father's experience with Tello customer service has been awful. His phone purchased from Tello always said that most of his calls were roaming.  At first, customer service said the problem wasn't a problem.  After it got worse they said, oh it's a problem all right but now it's out of warranty."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Hannah",
          "Nb_Reviews": 1,
          "Date": "2022-08-23T06:48:18.000Z",
          "Titre": "I've enjoyed Tello and it's extremely…",
          "Contenu": "I've enjoyed Tello and it's extremely affordable data plans for years. But coverage has gotten worse. Frequently calls drop or the caller and I can't hear each other on a call from my own house. Will likely switch service soon"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Karrie Thompson",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T08:39:19.000Z",
          "Titre": "It is way too expensive for data"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "HerTello",
          "Nb_Reviews": 1,
          "Date": "2022-02-26T13:38:37.000Z",
          "Titre": "Tell has been great so far",
          "Contenu": "Tell has been great so far! The sreception has been mostly consistent. Honestly, my Tello phone plan was more worth it when I had the two dollars off deal, which brought it down to about eight dollars a month. That only lasted six months, and then they bumped it back up. Currently, I am looking for a new phone plan, as there are many alternatives that offer more data for about the same price I’m currently paying."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Justin G",
          "Nb_Reviews": 2,
          "Date": "2022-03-12T12:29:15.000Z",
          "Titre": "Service has really fallen off",
          "Contenu": "I've been a Tello customer for 4-5 years and always thought it was an excellent service. But since late last year, the cell reception has become just awful. I have absolutely no 3G internet on my phone anymore, and not being able to access basic things like Google Maps when I'm out travelling has left me in several tough situations in recent months. I know the Sprint-Tmobile merger was supposed to increase our signal strength, but personally it's had the opposite effect for me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Vlad",
          "Nb_Reviews": 1,
          "Date": "2022-01-25T06:33:59.000Z",
          "Titre": "i got the line to transfer my old…",
          "Contenu": "i got the line to transfer my old number from WA. I currently live in IL. You probably know the rest: cannot do. Tello is not flexible with that or the Customer rep did not want to bother.Got a reply frim Tello. They are missing it all together - Tello cannot transfer a number from another state. Can be done only to an area code corresponding to your address."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Trish V",
          "Nb_Reviews": 1,
          "Date": "2022-03-25T16:18:27.000Z",
          "Titre": "Calls and texts ok but not data",
          "Contenu": "I signed up for my child a 6-month promo that was claimed to include unlimited texts, unlimited calls, and 2GB data. The data barely works. Every time we went out of the house where there's no wifi available, my child cannot get on internet at all. We tested in the cities where the signal is strong but Tello 2GB data still didn't work. We contacted Tello and did every step like instructed but all was useless. We now use Tello for calls and texts only. This is an affordable plan for a child and we appreciate Tello offers it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "M.Pepe",
          "Nb_Reviews": 5,
          "Date": "2022-04-07T06:12:43.000Z",
          "Titre": "Constant loss of calls",
          "Contenu": "Constant loss of calls.  Disconnects itself from my WiFi.  Being asked to reboot too often.  Was told phone I had no longer being supported, so get different phone and get onboard the new system by Oct. 2021.Just got another notification that I may need to replace my phone again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Edward",
          "Nb_Reviews": 1,
          "Date": "2022-01-18T09:49:55.000Z",
          "Titre": "The 2G data speed actually feels like a…",
          "Contenu": "The 2G data speed actually feels like a dial-up 56K modem from the old days in actual use. In fact, the confirmed 2G bandwidth test speed is limited to only 56K, which halves the typical 128Kbps 2G speed. You can also confirm it with any speed test websites or apps if in doubt. I hope the company can be more generous in the near future."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Clemens",
          "Nb_Reviews": 1,
          "Date": "2022-05-03T12:21:10.000Z",
          "Titre": "Service is inexpensive",
          "Contenu": "Service is inexpensive, a great value overall.  However, it appears that, in order to get that, I need to compromise speed.  Speed often seems slow, and coverage is spotty with large areas with bad or no service.  Also, it takes hours for voice mail to show up."
        },
        {
          "Note": 3,
          "Lieu": "BE",
          "Pseudo": "Client",
          "Nb_Reviews": 3,
          "Date": "2021-12-24T15:38:06.000Z",
          "Titre": "Products could be better.",
          "Contenu": "Two problems I've experienced with Tello:1. At some point I was unable to send messages even though I have a plan with unlimited texts.2. I've bought a phone (refurbished) for my wife and it came in poor condition, with stains and marks on the screen.The customer service is friendly and professional, but the products could be better."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "S Star",
          "Nb_Reviews": 1,
          "Date": "2022-04-24T14:39:39.195Z",
          "Titre": "Customer Service via email not as good as phone",
          "Contenu": "The first time I used Tello's customer service via phone it was EXCELLENT.  They helped me port my old number to their system.  Very Smooth.However, when I tried getting some help from customer service via email (twice) I got no response to my questions."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert Cross, C.W.E",
          "Nb_Reviews": 1,
          "Date": "2022-08-31T18:31:59.000Z",
          "Titre": "The first person I delt with in…",
          "Contenu": "The first person I delt with in Customer Service didn't explain things well. I asked for a change in Customer Service staff and finally received clear information."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dr. Koch",
          "Nb_Reviews": 2,
          "Date": "2023-04-27T12:27:16.000Z",
          "Titre": "Weak coverage in many areas of the U.S."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Roman Bobrakov",
          "Nb_Reviews": 1,
          "Date": "2021-10-12T08:59:33.000Z",
          "Titre": "Customer service does not respond to…",
          "Contenu": "Customer service does not respond to emails. Still waiting for a response for a question I sent to customer service over a month ago.Update:I reached out via support page on your website in September 2021 and I got a confirmation saying it was submitted. I never got a response so I reached out again in October. The response I eventually got was thorough and helpful, so I’ve revised my review, but don’t gaslight me publicly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ellen",
          "Nb_Reviews": 5,
          "Date": "2022-12-09T20:10:37.000Z",
          "Titre": "My service worked out and I had limited…",
          "Contenu": "My service worked out and I had limited ability for anything"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "KSS",
          "Nb_Reviews": 2,
          "Date": "2021-08-30T10:47:33.000Z",
          "Titre": "Up until merger",
          "Contenu": "Up until merger, I have rated Tello 4 or 5 stars. Will discontinue my 4 lines with Tello due to now having zero service at my residence. This is not a reflection on Tello as I'm sure they retained their excellent customer service - just luck of the draw that I lost good phone service. Also, disclaimer -  I do live in a rural area. When I'm in town I seem to have good reception.. just not many places in the county."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "IMT",
          "Nb_Reviews": 1,
          "Date": "2021-10-23T19:57:19.000Z",
          "Titre": "it was a bit frustrating",
          "Contenu": "it was a bit frustrating, because your site for activation kept saying: 'sign in later' or 'service not available in your area', which i knew is untrue, cuz i already have another fone activated from same address. this was our second family fone switching to new service. first fone was much easier."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Colin",
          "Nb_Reviews": 2,
          "Date": "2022-04-09T23:13:02.000Z",
          "Titre": "Should Have Left Good Enough Alone",
          "Contenu": "Pros: really affordable and customizable!Cons: since they upgraded their network and required customers to purchase 5G phones my phone won't send and receive texts while connected to WIFI. Tello's techs couldn't solve the problem."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mac",
          "Nb_Reviews": 1,
          "Date": "2021-10-27T13:06:07.000Z",
          "Titre": "It used to be good",
          "Contenu": "It used to be good. But recently they switched from CDMA to GSM network, and the signal became sporadic around my house. Called their tech support, the only suggestion they can give is to reset and reboot my phone, which won't help at all.======Got another phone call from tech support, explained in details. Sprint went belly-up is not their fault. Unfortunately my location only has certain GSM band available which is not supported by my old iPhone 7. Well time to upgrade I guess. Thanks for the info."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Donna Kirk",
          "Nb_Reviews": 1,
          "Date": "2022-01-03T04:39:56.000Z",
          "Titre": "I like Tello but feel trapped when I…",
          "Contenu": "I like Tello but feel trapped when I run out of minutes and have none left in case I am in an emergency.  It would be helpful to sound a warning some time during the month to alert customers when fewer than 12 minutes are left for talk time until the next renewal. Thank you."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Richard Gamache",
          "Nb_Reviews": 1,
          "Date": "2021-07-22T17:08:44.000Z",
          "Titre": "Mixup on two gsm deliveries",
          "Contenu": "I have two cdma phones from tello I was offered gsm sims to replace them. One was delivered very fast but the other one was delayed for much longer. Don’t know why but it was frustrating waiting for the second one to arrive. My thoughts are: A.  the second one was not shipped the same time as the first. B. Tello website was not clear if I ordered one or two sims in the beginning.Whatever the reason, I now have both gsm sims and they are working fine.Regards,Richard"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ken -Oshkosh WI",
          "Nb_Reviews": 2,
          "Date": "2021-05-12T13:41:24.000Z",
          "Titre": "Worth Considering?",
          "Contenu": "Price is very good with features to pick data amounts. Reception is spotty at times and people cant always hear me with their phones (Oshkosh,WI) so I have to hang up and try the call again also opens up other apps on the phone even when I have not opened them. I dont get any service in Lanark by Waupaca when I am there camping. If you dont want to spend a lot on cellphone bills this might be the carrier for you"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dissatisfied long time Custome",
          "Nb_Reviews": 1,
          "Date": "2021-09-27T13:30:47.000Z",
          "Titre": "Before T-Mobile bought out Sprint the…",
          "Contenu": "Before T-Mobile bought out Sprint the service was great.  After the buy out the phone service is terrible.  Most of the time I cannot receive calls along with my text coming late.  I am living in the same exact home I was before the buy out.  I was told that service would be better so far that is not true."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Donna H Perygin",
          "Nb_Reviews": 2,
          "Date": "2021-06-17T01:43:35.000Z",
          "Titre": "The first sim card I bought got zero…",
          "Contenu": "The first sim card I bought got zero signal and I wasted a lot of money on that service. I later decided to try again, so I activated a second sim and it got better service for some reason. Still, I would not trust this as my main phone as I live in the boonies. I use it for a hotspot only or as a second phone. Reception is spotty here."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jen P.",
          "Nb_Reviews": 1,
          "Date": "2021-12-28T11:27:34.000Z",
          "Titre": "Overall",
          "Contenu": "Overall, I am satisfied with Tello.  Only problem is with trying to order new free SIM card for my phone. The instructions in the email I received do not match with tabs from website.  I have not ordered a new SIM card because of this.  I guess a phone call is required."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Two seniors",
          "Nb_Reviews": 1,
          "Date": "2021-08-10T09:04:23.000Z",
          "Titre": "It gets the job done",
          "Contenu": "My husband and I have a cell phone which we use very infrequently, e.g. when we leave home to go somewhere, e.g. a road trip, shopping, etc.  We like the Tello plan because it is not expensive for how we use a cell phone. We purchased the flip phone.  It gets the job done but it is big/bulky. Just recently it is starting to fall apart.  A piece of plastic fell off the hinge. We wonder when the rest of the phone will fall apart.  We had a small Virgin Mobile flip phone before which we really, really miss."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Barb B.",
          "Nb_Reviews": 2,
          "Date": "2021-10-17T12:45:12.000Z",
          "Titre": "Second and Third thoughts",
          "Contenu": "Horrible time connecting to the carrier to use the line. Even worse trying to switch SIM cards. It was good for a long time and then started getting crappy about six months ago. Now you HAVE to switch away from CDMA to GSM and I can't get the SIM card they JUST sent to work."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Don Bower",
          "Nb_Reviews": 3,
          "Date": "2021-01-17T13:44:37.000Z",
          "Titre": "To save myself the bother of refilling…",
          "Contenu": "To save myself the bother of refilling my account frequently I put a lot of money on my pay-as-you-go.  On day 91 Tello confiscated $20.00 that was left on my account, informed me that my phone number would be permanently forfeited, and I would be SOL.  I received no advance warning or notification.  If you deal with Tello, watch your back."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kristen R",
          "Nb_Reviews": 6,
          "Date": "2021-09-17T17:27:20.000Z",
          "Titre": "Problem with coverage",
          "Contenu": "When I signed up, I checked the coverage area for an area I frequently travel to in California.  I checked both locations where I normally stay and it  was determined that there was good coverage.  However, when I traveled there, there was no coverage!  Quite disappointing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Peter",
          "Nb_Reviews": 1,
          "Date": "2021-10-04T21:17:18.000Z",
          "Titre": "Tello was great at first",
          "Contenu": "Tello was great at first, but now my phone is losing signal, not sending messages and not working to well at all. Edit: They gave me a call and said my phone wasn't 100% compatible with the plan I had. Grateful they responded and helped me figure out what was wrong"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "George",
          "Nb_Reviews": 1,
          "Date": "2020-06-22T18:18:08.000Z",
          "Titre": "Maybe this is my fault but bought a…",
          "Contenu": "Maybe this is my fault but bought a little sim card thing with them and a plan and like four months later I go to use it and my credit is gone. Had not even activated my phone yet. Kinda not cool, shoulda been alerted my balance would be confiscated if I don't use it fast enough.If u guys see this it would be kinda cool if you can refund my account. It was only $7, but still..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alejandra",
          "Nb_Reviews": 1,
          "Date": "2020-06-30T13:50:44.000Z",
          "Titre": "I like using Tello because it is a prepaid service",
          "Contenu": "I like using Tello because it is a prepaid system. However, I thought it would be better in the sense that we can’t receive files within texts unless we use data even though texting is unlimited. Also, I don’t receive texts to groups. I continue using because it is the line of a teen but at this point I can’t swap my line to Tello, unfortunately. Hopefully Tello will win me soon!Thank you for the opportunity to share our experience!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "sharon petersen",
          "Nb_Reviews": 1,
          "Date": "2021-09-06T00:58:52.000Z",
          "Titre": "Actual phone service is pretty good.",
          "Contenu": "Actual phone service is pretty good.But the phone I had to buy is ghastly.  I hate it.  After 6 months of use, I can barely make it work and can't do some functions at all.  I asked for help from you once before and got a bunch of cyber gibberish I don't understand.I'm 82 years old and university graduated but I was not born with computer programming pre-loaded in my brain.A better quality phone is highly recommended. When I was travelling, I took this one in to a Tmoble shop in Denver for help.  The agent snorted and handed it back saying to trash it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Saskia",
          "Nb_Reviews": 1,
          "Date": "2020-03-25T16:50:15.000Z",
          "Titre": "Variable Service.  Mostly great, but occasionally it's kaput.",
          "Contenu": "Most of the time it's great!  Low price for the amount of use I give it.  Everything I expect in phone service.However, occasionally, calls just won't go through and/or texts don't download or voicemails download late.  I don't know why.  I've checked for updates at those times, only to receive message that there are no new updates to be installed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Terri Ohler",
          "Nb_Reviews": 1,
          "Date": "2021-03-14T15:19:18.000Z",
          "Titre": "Finding how to port in the second line…",
          "Contenu": "Finding how to port in the second line with phone number that is existing on a different phone/carrier was difficult on the website. Several times it said it was going to you replace the first phone number that I had brought into Tello previously, not just let in the second phone number/line. After several tries I got it to work. Also, the coverage is not as good as what we had with Sprint. We find that about 30% of the time, the calls are dropped at our home. The pricing is great! One call to customer service was good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Hope Hong Hamilton",
          "Nb_Reviews": 4,
          "Date": "2021-08-04T17:23:51.000Z",
          "Titre": "I live in a busy area of a city but the…",
          "Contenu": "I live in a busy area of a city but the connection of phone calls from time to time is poor, fuzzy, which is very disappointing. When it works it works greatly. I have two phones, each using different provider. I have been thinking of stay with another company permanently."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Guru",
          "Nb_Reviews": 5,
          "Date": "2021-10-01T13:50:30.000Z",
          "Titre": "Free worldwide calling and cheap price",
          "Contenu": "Tello Website is user friendly,  free calling to 60 countries, and price plans are really good. But the coverage is not that great. Maybe it is still on the Sprint network. The coverage is poorer than T-Mobile. If they improve the coverage it will be very good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "NJ",
          "Nb_Reviews": 1,
          "Date": "2022-04-15T12:17:21.000Z",
          "Titre": "Okay BUT data is inconsistent",
          "Contenu": "The customized plan options and pricing are great BUT data is inconsistent. Sometimes it works, sometimes it does not, and that can be a serious problem. Because of this problem, I am thinking about switching."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 3,
          "Date": "2019-10-28T18:45:34.000Z",
          "Titre": "Mostly good",
          "Contenu": "Mostly good, however there are a few outstanding issues.  During busy hours of the day service can be sporadic.  We live out in a rural area and my wife, who stays home, has had big problems with texts not going out.  Most of her texts do not go through, she has had them stay in the outbox for days and she finally gives up and deletes them.  Voice and texting over the internet would be a great addition to your service!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shawn B.",
          "Nb_Reviews": 4,
          "Date": "2020-11-06T13:34:12.000Z",
          "Titre": "Only gives 3G, not 4G as advertised",
          "Contenu": "Despite the promise of 4G LTE, Tello seems only to manage 3G - well, for me anyway. I live in the Washington, DC area where one would expect major cell coverage. My phone is a supported model so I can only assume the issue is at the network coverage end. It's disappointing for an otherwise great company."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JENNIFER CHARTRAND-TANGSRUD",
          "Nb_Reviews": 1,
          "Date": "2019-07-24T21:31:04.000Z",
          "Titre": "Best to bring your own phone",
          "Contenu": "Best to bring your own phone. Issues with my phone in order to be fixed require continous rest, erasing all info, so I rather just keep pulling battery out and replacing in order to use phone. Without reset, phone will always say I have a message fron months ago. Also, Husband lost reception while traveling Montana.Phone just permanently quit after this review. Was leaving for patriot phone anyway, so sooner than later."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Costi Max",
          "Nb_Reviews": 1,
          "Date": "2019-12-13T03:11:46.000Z",
          "Titre": "Swapping phones was fairly easy but it…",
          "Contenu": "Swapping phones was fairly easy but it took a couple more days than I expected for the SIM card to be shipped to me. Previously, around Thanksgiving, I had called and messaged several times about purchasing a new phone for my kid. I was not able to get any assistance but I am glad I did not buy a new phone anyhow as I just used an old phone I already had. It will do the job. On the bright side, the plan is affordable and works well enough for my kid. Thanks"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Edwin Alvarez",
          "Nb_Reviews": 2,
          "Date": "2022-07-26T14:21:29.000Z",
          "Titre": "Unstable signal throughout my region",
          "Contenu": "Unstable signal throughout my region. Called customer service and they were unable to find the problem. Will change back to my old service provider MetroPCS mobile."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ken -Oshkosh WI",
          "Nb_Reviews": 2,
          "Date": "2022-01-22T13:40:48.000Z",
          "Titre": "Like Tello service extreme value for…",
          "Contenu": "Like Tello service extreme value for the money but when it comes to billing it could be better. I have direct deposit and need to be billed on a certain day when funds are in my account. Tello charges you early before your 30 day plan expires up to 2 days early and then may bill you at 4am when my bank is closed if it does not go thru on the first try you may not have service until you log in and try to re submit your payment they should give you a 3-5 day grace period like other businesses do you can sign up for e-mail notification so they will e-mail you 48 hours before payment is attempted but that does not help much if their charging you before your plan expires."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jenry Rodriguez",
          "Nb_Reviews": 3,
          "Date": "2020-01-15T15:05:15.000Z",
          "Titre": "I paid for another month of service to…",
          "Contenu": "I paid for another month of service to find out that the SIM card doesn't work with my Samsung S9+. I have to buy another SIM because the one I have from them and was using in my other phone is not compatible. Otherwise great value and customer service. I just wish there was more flexibility when switching phones."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Hinchey",
          "Nb_Reviews": 3,
          "Date": "2019-07-22T18:27:28.000Z",
          "Titre": "Web site is terrific but actual cell service is POOR",
          "Contenu": "Web site is terrific, 'DASHBOARD' and 'ACTIVITY' pages are super helpful and informative BUT actual cell service is POOR.  Works great from my home in Manchester NH but just three miles north (but still in Manchester NH) no service at all.  Very disappointing, will have to cancel an move to a different provider!!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pooya Beirami",
          "Nb_Reviews": 3,
          "Date": "2019-11-30T20:04:50.000Z",
          "Titre": "No roaming in Canada!",
          "Contenu": "I recently traveled to Canada and I did not have an internet connection. I had a very hard time finding places in Canada. Overall better than other MVNOs; good price and customer service but you will have a hard time if you travel abroad like Canada. If Tello had roaming service, it would definitely deserve 6 stars!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Fly Fisher",
          "Nb_Reviews": 1,
          "Date": "2020-01-27T15:52:49.000Z",
          "Titre": "Lacks CONDITIONAL CALL FORWARDING Feature",
          "Contenu": "The service has been better than Republic Wireless with one major exception, the lack of CONDITIONAL CALL FORWARDING. This is a feature that just about every carrier provides and is a real necessity for those that wish to have Google Voice handle voice messages and transcriptions (Google does it very well).  The request has been made numerous times to Tello with no response.  Is it a deal-breaker?  Close enough to consider going back to Republic Wireless.  Otherwise, the service has been pretty good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Elton Orme",
          "Nb_Reviews": 1,
          "Date": "2020-03-18T12:55:57.000Z",
          "Titre": "We'll keep using it",
          "Contenu": "The phone provided is pretty bad. We had one occasion where the service did not work even though it had worked in that spot before. We just use it for the kids when they need a phone while out of the house or if we are gone we can contact the kids at home. The price is amazing, so we will keep using it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2019-08-17T13:26:44.000Z",
          "Titre": "Nice customer service people, but a couple of other problems",
          "Contenu": "The customer service people are very nice, but there have been a few issues:  (1) All our 3G devices got forced offline due to a Sprint network update on August 1, 2019.  Tello was unable to correct this, so we ended up spending $200+ buying all new equipment.   (2) When the customer service line is overloaded, it pushes you off to voicemail.  There have been times where I've been on hold for several minutes and been pushed to voicemail.  I call right back and get an agent the second time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charles",
          "Nb_Reviews": 3,
          "Date": "2020-12-02T22:29:56.000Z",
          "Titre": "Five stars for the price",
          "Contenu": "Five stars for the price, two stars for the customer service.  I received assistance from four young Tello technicians; only one of them treated me with dignity and respect.  He was willing to learn the effective way to communicate and provide assistance to a senior citizen."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Fred Neil",
          "Nb_Reviews": 6,
          "Date": "2020-06-20T14:00:00.000Z",
          "Titre": "5 Star Cost, 2 Bit  Service",
          "Contenu": "The cost to use Tello is 5 Star. The pricing is best that I could find.  But their communications skill is not so hot. Chats get cut off. Telephone contact is iffy at best. Trying to buy a telephone and asking questions about them is the impossible dream. Want to use your own phone requires providing numbers you don't have until you buy a new phone. I love 'em, and won't leave 'em , but the price of service is RIGHT! 2 Stars for service and 5 Stars for cost averages a 3 Star rating. Sorry Tello, I really wanted to do better.Fred"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "NASIM AHMED",
          "Nb_Reviews": 1,
          "Date": "2022-05-05T02:53:45.000Z",
          "Titre": "The reason for this service is good but…",
          "Contenu": "The reason for this service is good but it is expensive in comparison to other service providers, They also use the T Mobile network. Most probably I will drop their service after a month."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "PK",
          "Nb_Reviews": 1,
          "Date": "2022-01-11T20:09:56.000Z",
          "Titre": "Tello works find in big cities but…",
          "Contenu": "Tello works find in big cities but coverage in more rural areas is terrible compared to my husband who has T-Mobile.  Sometimes I have to turn my phone on and off to get any coverage and even then it can be spotty."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dina",
          "Nb_Reviews": 4,
          "Date": "2023-12-14T13:12:06.000Z",
          "Titre": "GREAT, until…..",
          "Contenu": "1. Tello has the best service for the price.2. Tello has the best data plans for the price.3. Some of Tello customer service reps are great.My BIGGEST issue with Tello is that their service DOES NOT support Apple iWatch and iPhone as a pair that will allow them to work independent of the other; which means customers have to use other cellular phone services to get that. This is probably costing Tello good business. My advice to Tello: Get with the times before someone else comes up with a way to take ALL your business."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mrs. Fong",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:25:26.000Z",
          "Titre": "Price is good but problem voice call.",
          "Contenu": "Price is good.  However, a lot of time for voice call with unknow noise even I call back with the same problem."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Wilhelm",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T16:38:42.000Z",
          "Titre": "Better service than my previous…",
          "Contenu": "Better service than my previous provider.  Pure talk who claim to be Veteran driven had poorer service and fraudulently charged me $85 for a phone line I never authorized.  Tello costs less and provides better for this Veteran."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Glenn J",
          "Nb_Reviews": 2,
          "Date": "2023-12-03T20:37:59.000Z",
          "Titre": "The pricing is great",
          "Contenu": "The pricing is great  and commiserate wiht the services provided.  The only gripe I have is the performance of the flip phone which reacts slowly to inputs,"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Muneer Khan",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T18:33:37.000Z",
          "Titre": "I was using T-Mobile network",
          "Contenu": "I was using T-Mobile network, being a grad international student, it was really painful and one of my friend suggested me to switch to tello. It's been around 2 years and I'm happy with services. Even I moved out of the NY and traveled Chicago, Ohio, Michigan, North Dakota. Everywhere I received the coverage. I'll highly recommend it to international students."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "FA",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T19:16:01.000Z",
          "Titre": "Great options for an affordable plan",
          "Contenu": "Tello is affordable, user friendly, convenient and very easy to customize your own plans as well as see how much of it you use. The only issues I really have are with not being able to see how much of my plan I'm using until some time later (e.g. the next day or even after), and sometimes that my plan seems to be used up a lot quicker than I am actually using it (which I have difficulty checking due to those belated plan usage updates), so it feels like I have to be hyper vigilant on my usage. But other than those, I haven't had many other problems so I definitely recommend this as a pretty great, reasonably priced phone plan!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sara Cargill",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T18:28:42.000Z",
          "Titre": "Love the service",
          "Contenu": "Love the service.  However, my voicemail feature is very much delayed to receive a message.  Is it my phone or this service?  Other than that, it’s great…and so reasonable in cost.  Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cy",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T02:36:04.000Z",
          "Titre": "Incredibly Affordable Cell Service",
          "Contenu": "When my landline became too expensive to justify a couple of years ago, I ported the number to Tello to primarily still use as a phone that stays at home. For a song, you get unlimited N. America calls and a basic, but adequate, data allotment.The only drawback is that you can't roam the phone abroad, but that is being made clear when you sign up. Also, when they switched network awhile back, I had to buy a new compatible phone on my own dime. But even that was quickly made up by the super-low monthly rate. I would recommend their service to anyone without hesitation."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jason Myers-Benner",
          "Nb_Reviews": 1,
          "Date": "2023-09-17T17:56:29.000Z",
          "Titre": "So flexible and affordable",
          "Contenu": "So flexible and affordable. Trouble-free ordering, timely notification when I'm in danger of bumping up against my chosen limits. Only problem is that I don't get group texts right away sometimes. Sometimes they come in days later. Could be my phone, but I don't think so."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "Jay V",
          "Nb_Reviews": 1,
          "Date": "2023-07-23T08:08:33.000Z",
          "Titre": "Moved From T-Mobile",
          "Contenu": "We were moving from T-Mobile and living overseas. New sims were easy to order, activation and porting was very fast.Only thing I think needs improvement is identifying sim cards. I mixed them up by accident and it took me some time to realize I was trying to activate an iphone sim on an Android phone."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sarah Hood",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T16:45:05.000Z",
          "Titre": "Very good service and very affordable…",
          "Contenu": "Very good service and very affordable but there has been a lot of outages lately with them in my area first ine was 9b August 2nd for a few hours the second time lasted 3 days and just had another outage 9n August 30 2023. Its getting ridiculous luckily I have WiFi calling set up"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Hernandez",
          "Nb_Reviews": 3,
          "Date": "2023-08-18T18:24:49.000Z",
          "Titre": "I almost would give it 5 stsrs if the…",
          "Contenu": "I almost would give it 5 stsrs if the bumper porting over was faster. Took couple days where I been to other places and all took couple hours. Other than that T-Mobile it uses and have to say way better than us mobile /verizon or consumer cellular / AT&TService much better overall. So easy to swap phones after that with eSIM literally takes minutes and I done several times. I went to try another service and came back. I  put my wife’s phone now on it  not to mention plans r cheaper than others. Well worth it. Just do it trust me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul B.",
          "Nb_Reviews": 3,
          "Date": "2023-07-20T23:35:15.000Z",
          "Titre": "Great MVNO, meh network",
          "Contenu": "SIM shipping was fast. Free and received in 4 days. Others take 7-10 days and I don't get it. Their prices are good. For T-Mobile, I still feel like it's $3-5 dollars too much per month, and I wish the limited plans, i.e. no-very little data and unlimited calling were a bit cheaper.Another gripe is T-Mobile itself. They don't cover half of what others do and their data network \"goes down\" or \"malfunctions\" randomly every few days regardless of signal. It's a shame Tello's model doesn't scale to other carriers. With a triopoly dominating I'm sure this doesn't leave as many choices nor wiggle room, but it would be nice to see similar prices and choose other networks."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Crossley",
          "Nb_Reviews": 5,
          "Date": "2023-08-11T02:26:43.000Z",
          "Titre": "Tello Customer Service THE BEST!",
          "Contenu": "Tried to give 5 Stars. Tello is always great with its customer service. Almost no wait time and immediate help that’s the best I’ve ever had from any carrier. I LOVE Tello not just because of the price and call quality, but MOST IMPORTANTLY because of the EXCELLENT customer service. Thank you, Tello!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mohammad Sharifkhani",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T06:04:36.000Z",
          "Titre": "It's affordable and reliable",
          "Contenu": "It's affordable. The internet speed is acceptable, however I have to switch to LTE as it unable to switch to different antennas automatically when on 5G. I have never had an issue with its network coverage. I have an unlimited data plan which is capped at 25GB. When you reach the cap, it becomes unusable so you have to renew your plan. Also, on unlimited plans you cannot keep track of your usage unless you rely on your phone's data usage report."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patrick L",
          "Nb_Reviews": 1,
          "Date": "2023-06-24T19:40:02.000Z",
          "Titre": "Mint Mobile user switched to Tello",
          "Contenu": "I switched over to Tello from Mint Mobile after running into issues with delays or not receiving my SMS text at random times.  So far that has not been an issue on Tello for about a year now.I give Tello 4 out of 5 stars because for iPhone users we do not get a 5G network.  Also, the website and mobile app UI / UX design could be improved for better user experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dwight Wilson",
          "Nb_Reviews": 2,
          "Date": "2023-10-10T01:39:50.000Z",
          "Titre": "I have better reception now at home and…",
          "Contenu": "I have better reception now at home and at work! All good, with the exception of my music. My Spotify app seems to stop more often now than it did before. I'm hoping that's not going to be the norm."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Al",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T02:18:36.000Z",
          "Titre": "The plans are very customizable",
          "Contenu": "The plans are very customizable, I can choose how much data and minutes I want and the prices probably the best if you don't use a lot. You can use their app or website to manage your account and I love the fact that the website isn't a bloated slow mess like most websites these days. I won't give a full 5 stars because I had problems where calls wouldn't work but don't know if its because of my old phone or tello."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ray H.",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T15:05:12.000Z",
          "Titre": "Tello Ok",
          "Contenu": "For the most part, tello has served my wife and I well. We do, on occasion, experience dropped calls while using wifi calling. The only other thing that's a little bothersome would be the fact that tello rolls data to zero if not renewed before the end of the pay cycle. How nice it would be if we diddn't have to worry about losing our saved data every month."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Grace Watson",
          "Nb_Reviews": 3,
          "Date": "2023-01-04T14:15:33.000Z",
          "Titre": "TELLO",
          "Contenu": "Have used Visible, Mint Mobile, and almost AT&T Prepaid before reading their reviews.So far TELLO is working well. Occasional slow data speeds/connectivity where phone needs to be toggled to airplane mode. Visible had better data connection, but I like TELLO's flexibility in plan pricing.Haven't needed to call customer service yet."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T20:36:24.000Z",
          "Titre": "Save on great cell phone service",
          "Contenu": "Signed up two years ago 4 people in my household, everybody is very happy with the service AND the pricing. Easy to deal with when it comes to helpdesk, ask for Juan. Wish they could send the voicemails as text emails to my inbox. (Most VOIP phone companies do this) Apart from that, I highly recommend them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James De Ricco",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T00:58:33.000Z",
          "Titre": "Good price, but 4G mobile data speeds is slower than Tracfone in my area",
          "Contenu": "UPDATE: Tello technical support was helpful and easy to work with, and call quality after our support session is good, although mobile data speeds have stayed the same slow 1.4 Mbps download (half Tracfone in my area). The support technician guided me in adding a custom mobile network entry (APN wholesale, MMSC domain name wholesale.mmsmvno.com, ask Tello for the remaining settings).ORIGINAL REVIEW, BEFORE TELLO SUPPORT CALL:Tello is an excellent price, but with my 4G cell phone call quality is poor and data speed is slower than expected in my neighborhood (I get 1.4 Mbps download speed), making online shopping painfully slow. Tracfone is delivering double the data speed (2.7 Mbps download) and better service overall in my town. But the price of Tello is much lower than Tracfone, especially with its plan flexibility, and WiFi calling vastly improves call quality at home, so its functional for me. Also, the \"My Tello\" app is more reliable than the Tracfone \"My Account\" app for checking balance and changing the plan."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dina",
          "Nb_Reviews": 4,
          "Date": "2023-06-14T14:01:42.000Z",
          "Titre": "GREAT…., but!",
          "Contenu": "As stated in some previous Tello Surveys, I have been with Tello for a number of years now and I love their service, which is why service for my Apple iPad Pro and Mini is covered by them; but I also have an Apple XR and an iWatch 8 that I would LOVE to be covered by Tello as well, but Tello seems to move at a cave man’s paste to make that service available to it’s customers. Come on Tello, it’s your loss, it’s a new day, GET WITH IT!  What’s taking so long?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve R",
          "Nb_Reviews": 2,
          "Date": "2023-07-21T18:13:15.000Z",
          "Titre": "A confusing web site Activation process",
          "Contenu": "Very responsive Customer Service.  I had some difficulty following the web site directions.  They were clear enough, just not very prominent.  Anyway, after I  achieved my SIM in the mail, I went to the the web site and began the activation process, I followed the directions as outlined above but then I had to pay again for another Plan.  I must have made a mistake, I kept waiting for acknowledgement of having paid for a Plan, but it never showed and I had to purchase another plan."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "swadipti panigrahi",
          "Nb_Reviews": 2,
          "Date": "2023-06-26T13:25:10.000Z",
          "Titre": "Tello works great for my family",
          "Contenu": "Tello works great for my family. It's cheap, affordable and reliable most of the time. The only thing I could wish for as a customer -Renewing the plan every month does a mobile data reset and makes a fresh start which could be improved by carry forwording it for next cycle. To me Tello will be the BEST network if they do consider the above request."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rita Urey",
          "Nb_Reviews": 3,
          "Date": "2023-10-20T18:45:12.000Z",
          "Titre": "I switched to tello over a year ago…",
          "Contenu": "I switched to tello over a year ago after having my previous carrier for about 7 years.  I am very happy with the service and the price can't be beat!  Customer service is also very good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Li",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T08:28:11.000Z",
          "Titre": "Overall very good phone service",
          "Contenu": "Great service. Easy to change plan and prices are sweet.Only two inconveniences really. These aren't deal breakers by any means and I still highly recommend the service.First, the coverage can lack in some areas. By comparison a friend who has ATT won't lose service in more remote areas while I will.Second, if you buy one plan then decide to upgrade part way through, you have to buy the complete new plan not just pay the difference.For example, you buy a [1gb $10] plan but then decide to get [unlimited $30] plan a couple days later.Instead of charging you $20 to upgrade, you pay the full $30.Not a big issue and not something that effects the quality of service.Just wanted to say incase someone else was curious.TLDR: Great service, minor coverage issue (i.e. wooded/remote areas), let your gb balance run out before upgrading/downgrading."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "EP",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T18:11:08.000Z",
          "Titre": "Port-In Nightmare / Cannot Get a Resolution",
          "Contenu": "*Update*I did receive a response from Tello and my issue appears to be resolved. I don't like leaving reviews like this but thankfully Tello takes customer feedback seriously. I'd like to revise my original review because it appears Tello was NOT at fault for the glitch that caused my service interruption. Thanks to the support staff and technicians for getting my service restored.---Original Review---At the time of this review, it's been 6 days of not having service following my port into Tello mobile. I am literally not receiving calls or texts to my number.I've been contacting support everyday and just cannot get anything more than \"we sill send it to technical support.\" Six days and they have not figured out why my line is not working.I hate leaving bad reviews but after 6 days, I have to. The only thing I can do is hope someone is actually trying to resolve my issue. Being helpless and without my phone number is a gut blow.Hopefully at some point, I get my number working but now that this is approaching a week, I have little to no optimism. Just don't lose my number. I have MFA logins attached to it for receiving codes. I cannot lose my number because of Tello/T-Mobile."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dawn Rowe",
          "Nb_Reviews": 2,
          "Date": "2023-09-01T13:19:10.000Z",
          "Titre": "I love you guys",
          "Contenu": "I love you guys! Thank you for providing very affordable service and allowing me to have two phone numbers on my cell phone (my former landline and my cell phone number). I wish I could get better service out here in the country. It’s fine outside but once I go inside it gets sketchy.That has to do with the number of towers available and I don’t think you have anything to do with that.Oh, your customer service on the phone is friendly and prompt. Thanks again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Gake",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T23:48:10.000Z",
          "Titre": "Staying with me to assure that the…",
          "Contenu": "Staying with me to assure that the numbers transferred to Tello."
        },
        {
          "Note": 4,
          "Lieu": "BD",
          "Pseudo": "Ehsanul  Haque Shomaji",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T13:30:07.000Z",
          "Titre": "Superb!",
          "Contenu": "Honestly speaking,tello helps me a lot to reach all in a moment globally.I would appreciate if tello provides incoming call in it's app as well as extend the validity of sim,so long the user desires.Thanks tello for it's performances."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Craig P. Winans",
          "Nb_Reviews": 2,
          "Date": "2023-06-07T23:59:12.000Z",
          "Titre": "Customer Service is prompt and…",
          "Contenu": "Customer Service is prompt and responsive. However, they have been unable to port-in three landline numbers, from the AT&T network. My current thoughts are to leave Tello service after only two weeks."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gilles",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T19:00:18.000Z",
          "Titre": "Great price for custom plans but no roaming",
          "Contenu": "Tello is has great prices on plans that you can customize so that you buy only what you need.The website is easy to use and phone number transfer happened within minutes of my request.The only thing missing is roaming option. Right now, the only option is to use the phone over wifi while abroad. I wouldn't mind paying $5 to activate this for a month for example."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gaurav Mittal",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T19:34:33.000Z",
          "Titre": "The payment gateway was faulty which…",
          "Contenu": "The payment gateway was faulty which resulted in me getting multiple sims (and credit card charges). However, the support was awesome, as soon as I reached out to them, they helped revert the money, and fix the multiple sims problem."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Constance Griesmer",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T02:05:40.000Z",
          "Titre": "The customer representatives were most… friendly, and almost there",
          "Contenu": "The customer representatives were most friendly, thorough and professional. There needs to be some improvement for blind and visually impaired customers. Namely, that the customer service personnel have the ability to, with the customers permission, see you their screen so that they can pinpoint things like QR codes. That would greatly short in tThe customer representatives were most friendly, thorough and professional. There needs to be some improvement for blind and visually impaired customers. Namely, that the customer service personnel have the ability to, with the customers permission, see if there’s screen so that they can pinpoint things like QR codes. That would greatly shorten the process of tasks Such as installing eSIM. Thank you for caring business team that helps us customers walk through various tasks."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jason Timm",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T03:53:34.000Z",
          "Titre": "It's a good value for me (with a dumb…",
          "Contenu": "It's a good value for me (with a dumb phone) since I don't need very much mobile service. It's also easy to order, and change the level of service every month. The problem has been, is there are times the voice connection doesn't work, but I can use text. Then sometimes text doesn't send right away, even tho there's a connection. And this is where other (non tello) phone plans work ok. But in general it's a good deal."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 3,
          "Date": "2023-04-09T07:02:36.000Z",
          "Titre": "I wish the unlimited plans were really unlimited in speed.",
          "Contenu": "I wish the unlimited plan and other plans would keep the 5/4 Gb until the end of the plan without limitations.$ 29 dollar plan for unlimited it's still expensive.  Inviting a frend and getting the credit did not happen because the app is confusing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sally M. Yeh",
          "Nb_Reviews": 2,
          "Date": "2023-08-19T08:20:09.000Z",
          "Titre": "Very affordable mobile service",
          "Contenu": "Inexpensive, easy to subscribe and organized, Tello is a great deal.  However, the 5G reception can be spotty and needing to turn on cellular mode isn’t convenient."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris Halle",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T02:15:34.000Z",
          "Titre": "I have tello",
          "Contenu": "I have tello. You need o be careful., Virtual voicemail is not compatible with Tello and tell also makes your ported number 11 digits not 10 by adding a 1 in front of your number. That makes your name not show up and seem like spam. After i ported My number I called my mom My number showed but was 11 digits and her phone marked it as spam"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Elizabeth Carlisle",
          "Nb_Reviews": 1,
          "Date": "2022-12-13T17:53:07.000Z",
          "Titre": "never had any problem with usage of…",
          "Contenu": "never had any problem with usage of Tello.  Has always performed as it should.  I've have used Tello for 2-3 years.I have to admit that your selections of phones to sell is not very good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eric Blanchard",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T02:41:49.000Z",
          "Titre": "I love the inexpensive service and the…",
          "Contenu": "I love the inexpensive service and the the taxes and fees are SO low.  The cost is worth the service.  I am not impressed with the data as it is really slow all the time and very spotty.  I also feel like some months I lose a day of service and am charged on a 30-day cycle or something.  But for the price it is worth it and I won't be changing anytime soon."
        },
        {
          "Note": 4,
          "Lieu": "RS",
          "Pseudo": "Slobodan Vasic",
          "Nb_Reviews": 3,
          "Date": "2023-10-25T19:10:02.000Z",
          "Titre": "Very good service for price",
          "Contenu": "Very good service for price. Only issue is that when I am using wifi calling abroad is that I need to use some kind of proxy else service does not work, only emergency calls.Edit: changing dns to 8. 8. 8. 8 does the job. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lawrence Andersen",
          "Nb_Reviews": 2,
          "Date": "2023-08-14T18:35:30.000Z",
          "Titre": "I love the price",
          "Contenu": "I love the price, the coverage is pretty good, if I get up in any mountainous area I have no coverage and for that I am giving four stars instead of five"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "j beard",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T16:38:10.000Z",
          "Titre": "creating an account is difficult",
          "Contenu": "creating an account is difficult, but after that it has been smooth and best price around for our minimal use. We have two phones and are 73."
        },
        {
          "Note": 4,
          "Lieu": "IL",
          "Pseudo": "Ricky Fleischer",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T13:22:33.000Z",
          "Titre": "It was very easy to use the eSIM",
          "Contenu": "It was very easy to use the eSIM. Easy to switch back and it also was very easy to renew. All around a good experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eric E.",
          "Nb_Reviews": 4,
          "Date": "2023-07-17T17:28:43.000Z",
          "Titre": "Overall excellent value and service",
          "Contenu": "Overall excellent value and service.  I'd like more info on how to use Tello mobile while overseas through WiFi."
        },
        {
          "Note": 4,
          "Lieu": "VN",
          "Pseudo": "Giang Truong",
          "Nb_Reviews": 1,
          "Date": "2023-02-04T10:59:57.000Z",
          "Titre": "Easy to use the crazy plan",
          "Contenu": "Easy to use the crazy plan. However, 30 days policy will change the date of the month which will not work with the setting of the phone, not big deal but it became hard to focus every month. Do we have 3 months, or 6, or 12 months plan like Mint which is easier to pay for? Once we selected the right plan…"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Leonard Pozniak",
          "Nb_Reviews": 3,
          "Date": "2023-09-16T12:47:42.000Z",
          "Titre": "I never really had a problem with Tello…",
          "Contenu": "I never really had a problem with Tello other than an occasional break up"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ronald Szretter",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T14:07:47.000Z",
          "Titre": "Bravo!",
          "Contenu": "Fast and reliable service at an affordable price. Customer service is helpful, professional and pleasant to work with. Your company should be proud of your accomplishments. Thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James B",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T15:20:20.000Z",
          "Titre": "Good Service",
          "Contenu": "I have been pleased with Tello service. I have talked to customer service several times. The connect was fast and the problems were solved. I will contine to use Tello."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dillon stevens",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T08:56:46.000Z",
          "Titre": "If you want a cheap phone bill It's…",
          "Contenu": "If you want a cheap phone bill It's great but the unlimited should be unlimited not go down the hill"
        },
        {
          "Note": 4,
          "Lieu": "HT",
          "Pseudo": "Eveline Brice",
          "Nb_Reviews": 3,
          "Date": "2022-11-14T17:53:30.000Z",
          "Titre": "My experience with Tello.",
          "Contenu": "I really enjoy all the possibilities that Tello offers to me. The way Tello always reminds on my availability in terms of megabytes left and other things. I am on a fixed income and Tello’s plan fits into my budget.In one word “ Tello is ideal for people like me.”Thank you Tello for being there for me and people like me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ronald",
          "Nb_Reviews": 3,
          "Date": "2023-08-23T05:40:06.000Z",
          "Titre": "Ultra low price",
          "Contenu": "Ultra low price, coverage in fringe areas worse than T-Mobile and maybe Sprint"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rylan Ollivier",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T15:06:55.000Z",
          "Titre": "The coverage in Philadelphia and New…",
          "Contenu": "The coverage in Philadelphia and New Jersey is not great when it comes to data. It might just be my phone, but apps often don't work on data."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dorothy Barbato",
          "Nb_Reviews": 1,
          "Date": "2023-01-24T23:46:30.000Z",
          "Titre": "I would like to be able to carryover…",
          "Contenu": "I would like to be able to carryover data without renewing the day before its ready to renew."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Zvlago",
          "Nb_Reviews": 4,
          "Date": "2023-05-28T20:15:43.000Z",
          "Titre": "I get great value for the price",
          "Contenu": "I get great value for the price - My use is low enough to make a $10 cell phone perfect. Easy to maintain service with the set it and forget it plan .."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kenneth Edwards",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T15:11:33.000Z",
          "Titre": "Love the price and service",
          "Contenu": "Love the price and service, please provide home wifi internet so I can buy it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Szymon",
          "Nb_Reviews": 1,
          "Date": "2022-11-17T16:09:16.000Z",
          "Titre": "Pricing and quality of calls are solid",
          "Contenu": "Pricing and quality of calls are solid. I wish the 2g internet was faster and international calls from us to Europe would not show Random numbers on receivers' phone"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jason Somers",
          "Nb_Reviews": 1,
          "Date": "2023-01-26T02:12:31.000Z",
          "Titre": "Simply works fine.",
          "Contenu": "I have not had any signifocant issues. The only problem I have had is minor issues relating to finding specific information about my data usage."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Dragone",
          "Nb_Reviews": 3,
          "Date": "2023-02-14T13:33:52.000Z",
          "Titre": "The service is good & affordable.",
          "Contenu": "The service is good & affordable.Minus 1 star for the price & lack of selection of phones."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Parker",
          "Nb_Reviews": 5,
          "Date": "2023-03-20T19:26:36.000Z",
          "Titre": "They offer a pretty good eSim service…",
          "Contenu": "They offer a pretty good eSim service for a fairly fair price. So far it has worked fine for everything I've needed to do."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 5,
          "Date": "2023-03-22T19:00:35.000Z",
          "Titre": "I am so glad I took the chance and joined Tello!",
          "Contenu": "I joined Tello around 03/06/23. I almost wish I had known more about Tello a while ago. I have always had a flip phone and that is still the type I carry with me. I also recently got my first and last smartphone (forced into it). I rarely ever turn it on or even look at it, but the problem was that I could not get a data plan for it through my previous carrier (T-Mobile). It wasn't that they did not offer it is that they only have one plan and it is far more than I need and unaffordable. The bigger offense was that they lied to me for two months making all kinds of promises that I later found out were completely false (not only customer reps, but supervisors as well)! I only needed 1 GB of data and though it would be nice to have both phones with one carrier, but I can't afford $65 per month for something I will never use.I was very skeptical of Tello, thinking it was a fly by night scam or something, but I needed to leave T-mobile (who no longer has good customer service) mostly for the lies. I decided to take a chance with Tello for both phones. (I now understand what Tello is better). I am not used to DIY for cell phones and was scared I would mess things up setting up service with Tello, but the customer service is amazing! From before service to setting up, I was able to get someone on the phone almost immediately and every question was answered. Not only did I get set up, but I even ported my number, which happened in record time (after I threatened T-mobile, who were being uncooperative, by citing chapter and verse of the law regulating mobile services). Once I got what I needed, Tello ported my number in less than an hour!I now have a custom plan (love that) and paying half what I was for my flip phone coverage and getting more than I had with T-mobile directly! I opted for one sim chip that I will switch back and forth between the two phones as needed, which won't be much. (I only need data for places without Wi-Fi and I'm rarely in that situation).  To date, the service has been fantastic! I think this is really the way to go."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jane",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T17:00:07.000Z",
          "Titre": "What more could you want",
          "Contenu": "Good coverage, cheap price, what more could you want."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Redfern",
          "Nb_Reviews": 2,
          "Date": "2023-03-20T01:48:25.000Z",
          "Titre": "It's very much a value for the price",
          "Contenu": "It's very much a value for the price. The only problem I have had is that I upped my data allowance. Now that I don't need that amount of data, I am not sure how to down the amount."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Samuel Clovis",
          "Nb_Reviews": 2,
          "Date": "2022-11-07T04:21:01.000Z",
          "Titre": "Phone service has bad reception in my…",
          "Contenu": "Phone service gets bad reception in my home. I have to go to my garage to make sure that I do not have \"dropped\" calls. This has been happening almost daily since you switched to T-mobile."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Haris Hukic",
          "Nb_Reviews": 6,
          "Date": "2023-08-01T17:44:31.000Z",
          "Titre": "Economy phone service standard",
          "Contenu": "OK. Cheap service. Economy phone line. Lifeline type."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas  J. Joyce",
          "Nb_Reviews": 7,
          "Date": "2022-10-18T05:50:55.000Z",
          "Titre": "I have had Tello service for both of my…",
          "Contenu": "I have had Tello service for both of my phone lines for a year.  I am very, very pleased with both the price and the coverage, with the exception that there is no service in limited areas of southern New Hampshire when I have made brief visits there - but then the silence is not all bad.  No problems as all in Chicago."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marlene Stuckey",
          "Nb_Reviews": 3,
          "Date": "2023-01-29T22:35:04.000Z",
          "Titre": "Great price but spmetimes signal is…",
          "Contenu": "Great price but spmetimes signal is weak in homes."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T01:31:42.000Z",
          "Titre": "Sebastian the Great",
          "Contenu": "Sebastian would listen to my questions!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 4,
          "Date": "2022-10-05T20:05:05.000Z",
          "Titre": "I'm very pleased with the Tello…",
          "Contenu": "I'm very pleased with the Tello service.I did experience a puzzeling thing. I was viewing live TV and had 3.5 gigs on my plan left. after about 45 mins. all of the data was used up. Can you explain why? In the past , 1 hour of video used up about a gig. Last week I was camping at High Falls State Park in Geogia. Just North of Macon and 1/2 mile off of I-75. I had no service at all,  but everyone around me ,including my wife who has verizon service was using their phones. That was disappointing. Is this going to be an ongoing problem? Over all my experience has been good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2023-06-13T05:21:01.000Z",
          "Titre": "The agent gave me the detail of my data…",
          "Contenu": "The agent gave me the detail of my data usage. Good service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Prince Prempeh",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T09:53:53.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good. I need more time to make complete assessments"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-07-16T11:54:20.000Z",
          "Titre": "Phone service so so but internet…",
          "Contenu": "Phone service so so but internet connection poor,"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "john bryant",
          "Nb_Reviews": 3,
          "Date": "2022-09-06T14:35:06.000Z",
          "Titre": "Had trouble with wife's phone...",
          "Contenu": "Having trouble with wife's phone. The tech people worked with me back and forth over several days before reaching a correct conclusion. They were courteous, persistent and professional. Been with Tello for a number of years and definitely recommend to friends."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ian Woods",
          "Nb_Reviews": 1,
          "Date": "2022-08-11T21:26:32.000Z",
          "Titre": "Tello service is honest and affordable",
          "Contenu": "Tello service is honest and affordable.  There are numerous options of plans for a variety of users.  I have been using Tello for three months now and appreciate it for what it's worth.     Out of state phone calls are sometimes difficult indoors, which I hope improves with time.  Overall, Tello is a good service with a high recommendation.  Their plans are easy to set up which is a bonus, and the price is exceptional."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "hwg",
          "Nb_Reviews": 1,
          "Date": "2022-09-18T18:45:45.000Z",
          "Titre": "loss of service",
          "Contenu": "I have had one other event s few months ago where tello stopped working for an evening. No hotspot for internet. Mintsim also not working, so that may have been tmobile? down. Worked the next day.This event. tello hotspot stopped working in the evening. Mintsim worked ok, so this says that tello was down. Tello worked again the next day.Tello has been pretty reliable, but when it goes down it takes a lot of time to try to determine whether the problem is my computer, tello, or whatever. Kind of frustrating.Another frustration is that I was thinking about getting a new phone (samsung a23 5g). Tello can't tell me if it will work without an imei. I don't have an imei because I haven't bought the phone yet."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hunkele Antiques",
          "Nb_Reviews": 1,
          "Date": "2022-07-28T15:01:22.000Z",
          "Titre": "Good response from tech support",
          "Contenu": "The responses to my questions are prompt and thorough. But I'm still having some issue between 2 different accounts because they involve Apple phones. Also my cell reception goes in and out on one of them even tho they are right beside each other. But saving 120 bucks a month is more important than this problem."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mordechai",
          "Nb_Reviews": 3,
          "Date": "2022-08-23T05:15:59.000Z",
          "Titre": "Good Company",
          "Contenu": "I love how affordable Tello plans are and that they even allow you to keep your phone number when you switch. The customer service is also pretty good I must say. Service can be a bit spotty at times which is why I'm only giving a 4/5 star review."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 3,
          "Date": "2023-05-13T18:56:45.000Z",
          "Titre": "When i needed to call it was always…",
          "Contenu": "When i needed to call it was always availiable"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "E Flinchbaugh",
          "Nb_Reviews": 1,
          "Date": "2022-12-27T15:52:54.000Z",
          "Titre": "It is cheap phone service but seems to…",
          "Contenu": "It is cheap phone service but seems to work good enough to get he job done.   Thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nathan Cox",
          "Nb_Reviews": 3,
          "Date": "2022-08-23T14:28:29.000Z",
          "Titre": "Good experience getting my son’s phone…",
          "Contenu": "Good experience getting my son’s phone number changed. A little difficult getting the email process figured out, but once we got the ball rolling it was fairly prompt. Not bad service for a discount mobile service provider."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brandon B",
          "Nb_Reviews": 2,
          "Date": "2023-01-06T20:57:23.000Z",
          "Titre": "Customizable Service",
          "Contenu": "Customizable Service. Good network. Recycled phone numbers is a downside."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gary",
          "Nb_Reviews": 2,
          "Date": "2022-10-14T07:29:09.000Z",
          "Titre": "It was easy to upgrade",
          "Contenu": "It was easy to upgrade. I would've given 5 stars if there had been an easy way to switch plans without changing the payment date."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Clark",
          "Nb_Reviews": 3,
          "Date": "2023-07-02T06:15:33.000Z",
          "Titre": "Customer service was spot on",
          "Contenu": "Customer service was spot on. Very satisfied"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Yang",
          "Nb_Reviews": 1,
          "Date": "2022-06-01T14:12:26.000Z",
          "Titre": "Good phone plan",
          "Contenu": "The phone plan price is cheap, and I have been using it. Since the company changed a new SIM card.I often cannot receive calls from friends, and sometimes the messages are received after more than 30 minutes.  I contacted the customer service, and he asked me to take out the sim card and clean it. I did it, and I could receive the information immediately, but the future information could not be received again.  Hope the company improves it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve Freece",
          "Nb_Reviews": 1,
          "Date": "2023-03-18T13:50:31.000Z",
          "Titre": "The rates are great and ordering is…",
          "Contenu": "The rates are great and ordering is simple."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jacob Chiu",
          "Nb_Reviews": 1,
          "Date": "2022-09-19T16:58:40.000Z",
          "Titre": "Great price",
          "Contenu": "Great price! However, my phone couldn't detect the SIM card after about a month, so I switched to ESIM. Possibly Tello adding ESIM did something to existing SIM cards?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Toyboy",
          "Nb_Reviews": 7,
          "Date": "2022-04-29T13:30:50.000Z",
          "Titre": "I think the world needs Tello!",
          "Contenu": "Value for price is excellent. My limited contact with the support team has been mixed, one person who was obviously in the wrong job and others who were excellent. With the Tmobile takeover, I had the unpleasant experience of replacing a recently purchased phone with slightly weaker signals in my home area, but now we can easily call some of my friends in Europe. Overall, I am happy but not effusive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "D F O",
          "Nb_Reviews": 5,
          "Date": "2022-06-29T20:14:46.000Z",
          "Titre": "Customer service reps",
          "Contenu": "Customer service reps. have been really great! I'm, also, pleased with the coverage. >My only complaint is that I've called 3X asking for the previous owner's name to be removed from the number that is now mine.  Having someone else's name show on caller id has caused me to not reach people.  I was stuck at the airport for 2 1/2 hrs. As a senior in my 70's, this was scary.  No one would answer a call from a name they did not recognize: Victoria Yadd....  If the previous name can be removed, I'll raise my 4* rating to 5*.                     Thanks,  DFO"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carole Nasholds",
          "Nb_Reviews": 1,
          "Date": "2022-07-20T20:01:41.000Z",
          "Titre": "After an internet search",
          "Contenu": "After an internet search, we decided that as retired seniors on a small fixed income, Tello was the way to go. Our, son, who is early in his career and still on our plan, was happy to hear that the T mobile network is utilized. He only uses his phone fr calls and texts.We had good customer service experience. There was an initial misunderstanding but it was handled well and sorted out. {Thank you Eric for your patience and help).The new phone appears to work well and it was easy to set up and transfer information following Tello instructions. Here's hoping fr continued great service and ease of use. Thanks Tello. Carole & Wade Nasholds"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Roman",
          "Nb_Reviews": 1,
          "Date": "2022-04-24T05:56:03.528Z",
          "Titre": "Very competitively priced plans, some inflexibility in plan management.",
          "Contenu": "Very competitively priced plans. I didn't expereince poor connection in my area, but I haven't tried using Tello outside of a well-covered urban area. Generally, I'm happy with the price-quality ratio. Negatives: minimum amounts for \"pay as you go\" credits are too high ($20) and this credit only lasts limited time (3 months?). Also, Tello's system of plan change is weirdly inflexible: there is no scheduled plan change, any plan change is immediate."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nate",
          "Nb_Reviews": 4,
          "Date": "2022-04-14T22:56:15.000Z",
          "Titre": "The price is great",
          "Contenu": "The price is great! I love that you can pay for only what you need. My issue is sometimes texts don't come in a reasonable amount of time. Usually it's within a minute, but sometimes it takes 5-30 mins to get texts. Pics and GIFs also don't like to send unless they're under 300 kb, and sometimes not even then. Other times I can send a 1.2 MB pic and it sends almost immediately. It doesn't seem to matter whether data is on or off, it's not consistent. Ultimately it gets the important jobs done."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christian Torres",
          "Nb_Reviews": 2,
          "Date": "2023-09-22T20:26:02.000Z",
          "Titre": "Now I could recommend using Tello.",
          "Contenu": "I was very disappointed with their service at the beginning. The data didn't work. They fix and now is working great (even better than before). Now I could recommend using Tello."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jimp",
          "Nb_Reviews": 3,
          "Date": "2022-02-18T14:38:56.000Z",
          "Titre": "Decent company",
          "Contenu": "I pay $30 a month for 2 cell phones unlimited talk and text with 2gb of data, which I'll admit is not a lot but I'm also not glued to my phone so it's enough for what I do. Don't know any other company where I can get a deal like this, reception is fine and speeds are decent. Not stellar service but for what I pay it's good."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Jim",
          "Nb_Reviews": 5,
          "Date": "2022-01-25T14:39:10.000Z",
          "Titre": "Service and rates are great",
          "Contenu": "Service from phone staff is great, they really help with your questions. Rates are great with many plans to choose from.  A lot of Canadians travel to the USA for 5 to 6 months, only need Tello plan while they are there in USA.  Why not allow them to purchase a Sim and send to Canada before they head to USA so when they hit the USA border they can activate their Sim and phone with Tello."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Meredith Cockerille",
          "Nb_Reviews": 1,
          "Date": "2022-01-17T00:50:14.000Z",
          "Titre": "Decent Service and Coverage",
          "Contenu": "Decent service and coverage - reliable. Your data is capped (of course) and you WILL feel it when they cut you back. Tech support is generally helpful and accurate. My phone does not handle updates very well and I have experienced issues with the APN on one occasion (that could be the phone itself though). Very affordable! The product and service you receive are well worth the price!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Hanson",
          "Nb_Reviews": 1,
          "Date": "2022-01-15T14:45:38.000Z",
          "Titre": "I have been with tello for a few months…",
          "Contenu": "I have been with tello for a few months now and NOT had any issues and very satisfied.The only issue I have is that if I change my service every month I keep my old minutes, data and text time. If I keep my old plan I lose all items and start over.You should have some type of plan where if I don’t use all minutes, data, etc. some or all minutes, dat text roll over to the following month.Just a thoughtThanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Katherine Braun-Anderson",
          "Nb_Reviews": 1,
          "Date": "2021-12-31T17:03:52.000Z",
          "Titre": "Tello is a magnificent service",
          "Contenu": "Tello is a magnificent service.  It offers several different plans at very affordable rates.  It meets my needs perfectly.  Its site is easy to navigate.The only negative in my book is that Tello does not allow minutes and data to roll over to the next month if a person ops for auto monthly renewal.  Other phone companies do allow this, so it is not a matter of technology."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Louis Kern",
          "Nb_Reviews": 2,
          "Date": "2022-05-07T18:30:55.000Z",
          "Titre": "I don't use my phone everyday nor do I…",
          "Contenu": "I don't use my phone everyday nor do I check my text messages could have used more than 24 hours when my card was discovered was hacked and had to be canceled and had to get a new card maybe even a phone call and would have cut through a lot of the red tape"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Janice Roy",
          "Nb_Reviews": 4,
          "Date": "2023-11-16T14:59:38.000Z",
          "Titre": "Great price Great data for my needs"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ann Malley",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T16:29:45.000Z",
          "Titre": "Paola Lopez made my customer service…",
          "Contenu": "Paola Lopez made my customer service experience GREAT. Why? She addresses issues with kindness, competency, and efficiency. My issue surrounded porting my phone to another service and yet, Paola still provided superior service. Superior because the current provider I'm being forced to use is the exact opposite. I'll be switching back to Tello as soon as I'm able."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "elizabeth harrah",
          "Nb_Reviews": 6,
          "Date": "2023-12-18T23:44:53.000Z",
          "Titre": "I called Tello today",
          "Contenu": "I called Tello today 12/18/2023 about my SMS not working within 10 mins the help desk had it working thank you.  I have never had bad customer service from Tello, I was with Straight Talk and switched because of their bad customer service. Please let your employees know how important they are this will keep good people."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennie",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T14:42:27.000Z",
          "Titre": "Tello Mobile is the best!",
          "Contenu": "I love that their plans are very affordable and they also give you internet which is very nice. The new saving era is so amazing and i’m happy that they provide esim and physical card because esim was the reason why i joined tello. I will continue to use tello mobile and share it with others to show them how great it is. I appreciate Tello Mobile and i’m rooting for them! Have a wonderful day! :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Geri Lopker",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T16:43:04.000Z",
          "Titre": "Renew early to roll over data",
          "Contenu": "Easy to renew... I  renew a day early as then Tello will roll over my remaining data... this is a wonderful deal! Tello reminds me 48 hours before renewal so that I  can renew and roll over my minutes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Private Please",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T16:32:09.000Z",
          "Titre": "Wonderful help from really kind and nice people.",
          "Contenu": "All of the phone representatives are very patient, informative and courteous. It is so refreshing to talk to real humans who really care and go above ordinary customer service and customer support. I truly respect your 24 hour staff."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T11:50:00.000Z",
          "Titre": "Treating Their Customers Right",
          "Contenu": "We have an expectation that technology becomes less expensive over time. What is unusual is for a technology company to pass those saving on to existing customers. Thank you Tello for the free service upgrade!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Farmer",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T22:08:57.000Z",
          "Titre": "I love everything about Tello!",
          "Contenu": "I love everything about Tello!  Whoever the web site developer is definitely knows what they are doing.  Plenty of explanations in common language that tells you what everything is, what it means, and how to use it.  Everything on the web site is SO EASY!!   Not to mention, the service itself is clear and clean.  I'm in the process of changing all our phones over to Tello.Just one suggestion to web developer.... When porting your current phone number in, The PIN input should explain that it is your password/pin you use when logging into the carrier you are porting from."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dick Gomez",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T20:33:02.000Z",
          "Titre": "Nothing but praise for Tello",
          "Contenu": "Nothing but praise for Tello. Have used it for years and have not had one problem with it. Service is great.They have even given more than I had realized I was entitled to. It's a wonderful service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dysart Family",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T21:07:32.000Z",
          "Titre": "Our family loves Tello",
          "Contenu": "Our family loves Tello. We each pay around ~10/month for our cell phone service (depending on the data plan). It is reliable and covers most areas, so we don't have issues with dropped calls. You just need to use a phone that works with their service. Tello sells the phones, but (FYI) we found better deals on the manufacturer's website."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shaoping Bian",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T22:00:39.000Z",
          "Titre": "Dashboard has all info.",
          "Contenu": "Dashboard has all info. necessary for payment process easy. Simple step to pay and change plan."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leigh",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T02:35:41.000Z",
          "Titre": "Great customer service",
          "Contenu": "When I misplaced my phone, I went to the Tello site to block the number. A few weeks later, I found the phone. The website said I had to email customer service to unblock the number. I sent the email and got a reply 6 minutes later! They unblocked my phone and I was good to go. I was amazed at how fast they solved the problem. Wow!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "G R",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T17:17:31.000Z",
          "Titre": "Outstanding Customer Service w personal follow-up",
          "Contenu": "Tello is a unique company in that their customer service  reps really do their job. Every time I have called, they have answered my questions thoroughly and even gone above and beyond with personally typed out emails providing instructions. Also, VERY VERY important is that they are not an off shore phone bank of foreigners parroting predetermined responses, but rather they have service reps that are native English speakers or if foreign born, their accents are not too heavy. Very reasonably priced plans as well that don't require a contract. Good job Tello!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MRG",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T23:59:42.000Z",
          "Titre": "I had a small issue with Tello…",
          "Contenu": "I had a small issue with Tello regarding billing and was surprised at how fast and efficiently they responded to my concern.  Not only did they clearly explain the policy in question, but they also went beyond what I thought necessary to immediately accommodate my request.  The response time was measured in minutes (via email!).  So, kudos to Tello - keep up the good work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terry Phillips",
          "Nb_Reviews": 3,
          "Date": "2023-12-17T19:32:12.000Z",
          "Titre": "Tello has been the best cell provider…",
          "Contenu": "Tello has been the best cell provider in our experience!  We've used them for 3 years, our friends and family have found them to be awesome too.  Thanks Tello for what you do!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jack",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T11:16:31.000Z",
          "Titre": "I have been with Tello mobile for a…",
          "Contenu": "I have been with Tello mobile for a couple of months. I started out on $10 plan and moved up to the $14 plan. I ported my landline from AT&T. I have saved a ton of money porting landline toTello Mobile. I would recommend Tello Mobile."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melissa Wingo",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T21:51:44.000Z",
          "Titre": "Thank you so much Tello!!!",
          "Contenu": "Thank you so much Tello for your incredible and generous gift of data increase and unbelievable price drop for my Unlimited Plan! It was completely unexpected and truly appreciated! It is a blessing to me and my mother in so many ways. I've been with you for over a year now with no issues of any sort. In fact my mother is in need of a new phone and provider and knowing my satisfaction with your company is planning on switching to Tello as soon as possible. Thank you so much! God bless you,and again,thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vince",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T09:47:35.000Z",
          "Titre": "Offers everything I need at the lowest…",
          "Contenu": "Offers everything I need at the lowest cost and THE reason if you need the cheapest way to be able to text. I tried for 2 years with no texts and it turned out to be very hard. Tello to the rescue and I couldn't be happier. I also like their pay a day or so in advance and you keep all unused data and minutes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rachel de",
          "Nb_Reviews": 3,
          "Date": "2023-12-08T19:05:50.000Z",
          "Titre": "The Best Deal There Is!",
          "Contenu": "Tello always tells you the whole story-- upfront. No if , ands  or buts. Tello increased my service-- not the price! Tello does not pretend to give services they do not give. Tello web-site is clear and  not filed with extraneous  advertisements for additional services. Tello  reps are always knowledgeable, polite, patient and eager to be helpful. Honesty is the best policy-- and Tello is the best."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Fulton",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T14:31:42.000Z",
          "Titre": "Tello works for us",
          "Contenu": "Tello works for us. We've been using it for over two years now, and have never had a problem. We travel up and down the East Coast, listening to Pandora and placing phone calls at will, admittedly along the freeways/interstates, and I don't recall coverage problems.Oh yes, and we've saved quite a bit of $ over our previous plan(s) in the process. Consider that we rely on cell phones exclusively for communication... we dumped our landline years ago...we get more cellular data than we need, both lines together cost under $30 total, it's beyond me why anyone would voluntarily pay more! After all, a phone call is a phone call, a MB is a MB regardless of which carrier supplies it. It's the same!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erika Roberts",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T18:50:11.000Z",
          "Titre": "myTello is great so far!!!",
          "Contenu": "i hate cricket wireless with a passion. they constantly double charge their customers for months of service and refuse to give refunds under any circumstances. tello was quick with porting a phone number im sentimentally attached to, only $25 for unlimited that cricket was charging me $50 for, and they don't double charge your account when using a debit card. eSim makes things super quick, didn't have to worry about waiting for a physical sim to show up in the mail. my agent that helped me port over my number, Nicole, was amazing and quick. Will be reccommending this service to all my phone-geek friends."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen",
          "Nb_Reviews": 13,
          "Date": "2023-12-15T01:16:11.000Z",
          "Titre": "Give Tello a try!",
          "Contenu": "Give Tello a try, you won't be disappointed. The service, the cost and customer service are unbeatable. You may also be able to use your own phone, so check it out."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joni",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T02:15:06.000Z",
          "Titre": "The SIM card came quickly and was easy…",
          "Contenu": "The SIM card came quickly and was easy to set up. So far, we're very happy with the service too! When all is said and done, we'll be getting 3 phone lines for about the price of 2 when we were with Mint Mobile, and we can pay monthly and still get the lowest price. Can't beat that!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Del Duca",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T22:19:30.000Z",
          "Titre": "Unexpected digital experience",
          "Contenu": "The customer service person was great.  He was very respectful and patient with a person like me who is almost total digital ignorant.  He took the tine and walk me through all of the needed steps to handle my lost phone and purchasing a new one."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Staib",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T22:02:08.000Z",
          "Titre": "Very helpful customer service",
          "Contenu": "We had a problem with data downloads. It turned out to have nothing to do with Tello whatsoever. However, Tello Customer support person was immensely helpful and patiently assisted us to reset our iPhone until the networking problems were resolved."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ronald Lambert",
          "Nb_Reviews": 4,
          "Date": "2023-12-07T13:37:35.000Z",
          "Titre": "I'm not very good at giving reviews",
          "Contenu": "I'm not very good at giving reviews, but I can say that Tello was very helpful in setting me up with a great phone and service plan that I can afford. They have plans and phones that meet every budget and are there to assist with any problems you may have, (for those of you that are like me when it comes to tech)."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rajesh Sundaram",
          "Nb_Reviews": 18,
          "Date": "2023-12-12T17:40:50.000Z",
          "Titre": "Tello is Awesome",
          "Contenu": "Great customer service. Offered a refund immediately for changing plans and sent an email with the refund status. Great plans and flexibility. Hope to be with them for a long time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Theresa",
          "Nb_Reviews": 16,
          "Date": "2023-12-06T00:44:08.000Z",
          "Titre": "An extra GB of data - Christmas came early!",
          "Contenu": "What a nice surprise, an early Cmas gift of an extra GB on my basic plan.  Wow! Just when I thought Tello couldn't get any better.  I've experienced such excellent service since switching to Tello, thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T18:35:29.000Z",
          "Titre": "Tello Is Great!",
          "Contenu": "This was an unbelievable experience. I received an email from Tello showing my 2GB data plan has been increased to 5GB at the same cost. This sort of thing just doesn't happen. I felt I was already getting a great deal. I wish more companies would follow their lead."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Suchoski",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T17:07:34.000Z",
          "Titre": "Low cost leader, and they continue to provide more for the same $",
          "Contenu": "Received a three gigabyte increase in monthly allocation without even asking for it.  They are sharing the success."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Brown",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T16:31:17.000Z",
          "Titre": "Free upgrade",
          "Contenu": "Hello Tello Customer Service,I just want to say \"thank you\" for my plan's upgrade for no additional cost! This is really an attractive business decision."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greyboy",
          "Nb_Reviews": 4,
          "Date": "2023-12-06T01:59:26.000Z",
          "Titre": "Tello Email",
          "Contenu": "Received email today from Tello informing me that they are doubling the data on my plan with no price increase. This is a great company, with great prices and excellent customer service. I recommend them for cell phone service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "c.b. duncan",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T03:07:13.000Z",
          "Titre": "Tello's new rates for the unlimited…",
          "Contenu": "Tello's new rates for the unlimited data plan and their considerable increase of GBs on the plan were an unexpected surprise and so very welcome. Because my budget does not justify investing in home internet service (I'm not even sure it's available where I live but, if it is, I'm sure it's not cheap), I depend on my Tello account for all communication with the outside world.  Not surprisingly, it is easy to use up the data. But Tello's increase of data and decrease on price really means a lot. As important, it also demonstrates that Tello appreciates our business and desires to cultivate loyal customers. We could be cynical and point out that there's stiff competition among providers and so chalk up Tello's business move to no more than an effort to remain solvent. But I think Tello should be commended for--and feel good about--the approach to solvency they have chosen. They already have very good pricing and very good customer service. They didn't have to make this move to keep my business.  I'm grateful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T18:45:26.000Z",
          "Titre": "They upped my data from 1G to 2G and…",
          "Contenu": "They upped my data from 1G to 2G and I'm paying the same rate ($8.00). That's pretty good service these days."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julie Yap",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T01:33:49.000Z",
          "Titre": "I have just been informed that I'm…",
          "Contenu": "I have just been informed that I'm getting more data for the exact same price in my plan!"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Figurelli Wileiner Moisés",
          "Nb_Reviews": 11,
          "Date": "2023-12-08T07:40:27.000Z",
          "Titre": "Perfect and excelent",
          "Contenu": "Todo excelente y súper práctico , rápido , innovador, excelente atención, económico. En resumen lo mejor de lo mejor . Tutto eccellente e super pratico, veloce, innovativo, ottima attenzione, economico. In sintesi il meglio del meglio .All excellent and super practical, fast, innovative, excellent service, economical. In short, the best of the best."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erom",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T15:10:19.000Z",
          "Titre": "Unlimited Flexibility Is The Way",
          "Contenu": "Unlimited flexibility is the way, the one one can't do without, omnipresent option among others to permanently come by as you choose a cellphone plan, and that's what you get with Tello Mobile.Depending on your needs at any given moment, you are able to select and/or customize a plan that fits properly you desire. In addition, on top of this, you get more data so far with each plan for the price than the competition out there by comparison.You're never tied to a stack or bundle buy to realize your own standard or tailored plan, ever.An excellent and cleanly simplified web UI to complete most of your activities about your account and plan options, and to expediting your bills privately in your own comfort. Concurrently, a mobile app is also conveniently available.I personally searched and compared several providers in the nation, and, indubitably Tello took the palm by far. Look and try it for yourself, beside my humble and personal opinion.A plethora of options in all plans that comes freely with zero(0) additional fees.If you do care about that flexibility and for saving accordingly, please, honestly check Tello out. You'll rejoice with the service as I do, unequivocally.Cheers"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shirleew",
          "Nb_Reviews": 4,
          "Date": "2023-12-06T20:00:39.000Z",
          "Titre": "Tello service works well with no pressure to upgrade from basic.",
          "Contenu": "I like Tello because you’re not always trying to make me spend more and upgrade.  I will keep recommending Tello to friends because the service is trouble free."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Reuben I Baltazar",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T18:12:24.000Z",
          "Titre": "I have been with Tello for few years…",
          "Contenu": "I have been with Tello for few years with outstanding service ... no issues and will recommend to friends and relatives."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Simone",
          "Nb_Reviews": 3,
          "Date": "2023-12-04T13:24:01.000Z",
          "Titre": "I love Tello",
          "Contenu": "I love Tello, because i am 84 years old and only need a phone for emergencies or reaching my kids…i hardly use it BUT can afford the price from my social security. I feel confident when i go out that if i need help i have a phone to get help…i think you should advertise more to the elderly who cant afford most phone lines. I am very happy to have Tello. Thanks for making it possible."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joyce White",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T21:26:03.000Z",
          "Titre": "Tello- Not Too Good To Be True!",
          "Contenu": "I was an AT&T customer for more than 20 years. I have nothing bad to say about them at all but due to a drastic reduction in our finances we could no longer afford them. After researching we decided to try Tello. My thoughts were that with such great prices their service must be a dud. Boy, was I wrong! From the very first, my every experience with them has been an A++. I needed a new Sim card-they told me how. I wanted to import my number-they helped me every step of the way. Every need has been efficiently and politely met. The service is great. I have zero complaints. And now they tell me that my data is being doubled with no price increase? Amazing! I had to make sure I understood correctly! Needless to say, I am one happy, satisfied customer!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jose Campo",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T08:34:56.000Z",
          "Titre": "Very satisfied with great serive…",
          "Contenu": "Very satisfied with great serive provided"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dean Nguyen",
          "Nb_Reviews": 9,
          "Date": "2023-12-14T15:17:58.000Z",
          "Titre": "Tello offers great prices for the…",
          "Contenu": "Tello offers great prices for the packages selected by the users. Their service is also great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mud Pascal",
          "Nb_Reviews": 3,
          "Date": "2023-12-08T20:54:45.000Z",
          "Titre": "International calls are FREE",
          "Contenu": "Outstanding feature is the inclusion of free international calls as well as the cost beingone third of plans offered by major carriers like Verizon or T-Mobile.  Dependable service, boasting no drop calls or missed messages, whether it's for international or local calls.  Tello's user-friendly system allows almost anyone to change their SIM card and effortlessly port their existing number to the Tello service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "K.B.",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T16:18:51.000Z",
          "Titre": "Tello is wonderful!",
          "Contenu": "I have received excellent service the entire time that I have had Tello for my cellphone service provider. And I just found out that my 1G of data for $10/mo. has been adjusted to 2G of data for the exact same price of $10 plus tax (of course) starting with my next month. That gives me a bit of \"breathing room\", not that I needed it, but it is nice to have if I ever do need it. Yay for Tello!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terry Moore",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T22:05:32.000Z",
          "Titre": "Customer service rep was efficient, wonderful and understanding",
          "Contenu": "The customer service rep, Thay, answered immediately, and was very gracious and understanding. He efficiently rectified a billing recharge situation, even though the \"error\" was made by me, the customer, and not Tello, thereby saving me a lot of money down the line. I was left with a wonderful feeling this Thanksgiving weekend. We will definitely stay with this company for many more years to come!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pat Glasscock",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T16:48:27.000Z",
          "Titre": "Easy Sim Replacement",
          "Contenu": "My son lost his phone and it was easy, quick and inexpensive to replace the Sim card and I was able to keep the original number."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter Brook",
          "Nb_Reviews": 3,
          "Date": "2023-12-05T15:44:01.000Z",
          "Titre": "I appreciate Tello",
          "Contenu": "I appreciate Tello rewarding loyal members with double data, much needed these days.  Tello is so easy to deal with, I appreciate that."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "gemtex",
          "Nb_Reviews": 3,
          "Date": "2023-11-21T21:16:53.000Z",
          "Titre": "Great Service at a Great Price",
          "Contenu": "Great Service at a Great Price. I have been using tello for over 2 years and I am completely satisfied. A few times I did have to contact customer service and each time I would get right through an speak with a Real Live Person, who I could understand. Every time I received help. I almost feel guilty paying such a low phone bill each month. Over this time I have converted a handful of family members and they have also been very satisfied."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tareq Abdulfattah",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T01:05:06.000Z",
          "Titre": "I love Tello",
          "Contenu": "I love Tello.  I have 2 lines with Tello and the service is great.  I will be switching my 3 other lines from T Mobile to Tello pretty soon.  The price is great and I love the customized  family plan.  Not everyone in my household needs an unlimited plan and thats what makes Tello great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fiona L",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T13:44:46.000Z",
          "Titre": "Amazing value for money!",
          "Contenu": "I can't believe how much money I was wasting with AT&T for so long. Tello simply give me a lot more value for a much cheaper price and I LOVE their cheap international calling rates!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wesam Shalaby",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T13:29:38.000Z",
          "Titre": "I love Tello",
          "Contenu": "It’s a custom plan, I can change it every month according to my needs. I don’t have to pay a lot or pay for 12 months in advance. And besides that, the service is great! The app also is nice and easy to use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "alex t.",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T18:30:29.000Z",
          "Titre": "I've had Tello for about 2 months now…",
          "Contenu": "I've had Tello for about 2 months now (switched from xfinity) and I'm very happy with them. The coverage is excellent and I'm paying about a third of what I was paying with Xfinity."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen",
          "Nb_Reviews": 5,
          "Date": "2023-12-05T16:32:01.000Z",
          "Titre": "Tello is a wonderful company",
          "Contenu": "Tello is a wonderful company.  They are a very affordable company. My entire family has tello. The company is easy to work with online. Don't hesitate to get tello.Thank You Tello"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carmelite Nuns",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T21:29:04.000Z",
          "Titre": "Doubled our data space for free - so nice!",
          "Contenu": "We're on the cheapest plan possible, and Tello just doubled our data space for free. So nice! We really like this simple, straightforward and non-intrusive company that does very well what we pay them to do. God bless them!"
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Asgart Juri",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T22:33:13.000Z",
          "Titre": "Best Solution is Tello",
          "Contenu": "Well, Tello for me and any other people around the world is the best solution. Fantastic service, awesome support. I can and do rely on Tello whenever I need. I am 1000% sure that my inquiry will be received, acknowledged and the solution is to be found just within a short period of time. I love Tello!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leslie Weathermon",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T17:51:37.000Z",
          "Titre": "Wonderful Company",
          "Contenu": "I have been a customer with Tello for six years. I am  excited to receive this amazing perk! More data at the same price! Plus the price went down!! Thank you for rewarding long term customers!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cheap Talker",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T15:44:32.000Z",
          "Titre": "Perfect Cost for my usage.",
          "Contenu": "As somebody that only uses a few data-centric apps, paying for a service with 50GB would be wasteful.  Tello gives me with the amount of data I need at a very fair value.Calling and Map App are the only things that I \"need\" and have not had a problem with connectivity when traveling.Note: I never use anywhere near my Data limit but during a Hurricane it was used up fast. A way to \"bank\" some of the unused Data for such situations and could be done at minimal cost to Tello and Customer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rachael S.",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T16:57:16.000Z",
          "Titre": "Best phone provider I've had by a long shot",
          "Contenu": "Great prices, real people, good customer service, user friendly, and love that they don't lock you into a plan."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mc Courrier",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T18:23:06.000Z",
          "Titre": "Sebastian was Very Helpful in guiding…",
          "Contenu": "Sebastian was Very Helpful in guiding through the process of Retrieving my Tello Account InfoPatient,Calm and well versed with the processTello Phone works fine,but the internet Service,Not So am afraid .Always very weak and dropping off Signal"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deep d",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T16:37:04.000Z",
          "Titre": "Went to see the Yorktown in Charleston…",
          "Contenu": "Went to see the Yorktown in Charleston last week.Hotel internet down.Turned my Samsung cell hotspot on and worked well for 3 days! Also works well with Roku.My cell works great with the 2.4 LTE 4g everywhere with TELLO.I use the basic plan/5gig data/international.That data included beats Consumer by 4 more gigs!! 5 instead of 1 gig.Dave-in North Carolina"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joshua Shemeta",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T10:06:32.000Z",
          "Titre": "actually have a pleasant time",
          "Contenu": "actually have a pleasant time.  customer support team is responsive.  highly recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Malgorzata Rzeczkowska",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T15:19:49.000Z",
          "Titre": "Excellent service for many years.",
          "Contenu": "My family is with Tello for many years and we are very happy with this provider. Excellent service. I always recommend it to my friends."
        },
        {
          "Note": 5,
          "Lieu": "BD",
          "Pseudo": "Mo Hossain",
          "Nb_Reviews": 9,
          "Date": "2023-11-03T01:06:52.000Z",
          "Titre": "Olivia is an awesome rep!",
          "Contenu": "Olivia S. was a great support rep. My Tello experience was super smooth because of her excellent communication and ability to resolve things quickly. I made a mistake porting over two lines to my phone plans and I accidentally sent them to the wrong plans. She understood the issue I was facing easily and helped me reorder my plan and started the refund process for the previous purchase. Super easy to talk to and good handling. Thank you again, Olivia!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicholas",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T23:09:13.000Z",
          "Titre": "Rather than to blow me off or dismissed…",
          "Contenu": "Rather than to blow me off or dismissed my concerns, a customer service representative named Joseph told me my case number which none of the orevioya representatives even mentioned.  He updated me on tye status of my case and assured me that my concerns would be handled expeditiously."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Walter Reitman",
          "Nb_Reviews": 7,
          "Date": "2023-11-17T16:05:14.000Z",
          "Titre": "Great agents!",
          "Contenu": "All of your agents I've dealt with so far have been incredibly good.  Whoever selects and trains them is doing a really great job.  The most recent was Erica.Thanks again for the competence and the patient helpfulness.  It really makes a huge difference!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Geoff Nicklen",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T06:02:54.000Z",
          "Titre": "Sebastian helped the best he could.",
          "Contenu": "Sebastian helped the best he could.Having a live person for  customer service is really really good. You cannot even  get a phone number from X finity."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jack Orez",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T14:49:56.000Z",
          "Titre": "Best Price Going",
          "Contenu": "Tello is the best service for someone that just needs a phone number. Currently there are so many other ways to communicate there really is no need for a carrier service. However some businesses are stuck in the past and require customers to have one. I speak to about 5 people a day but only make 1 phone call every 3-4 months. For me there is no need to use an expensive carrier service. Tello solves this problem"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "mary lewis",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T22:56:31.000Z",
          "Titre": "Directions are easy to follow for old…",
          "Contenu": "Directions are easy to follow for old people!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KB",
          "Nb_Reviews": 3,
          "Date": "2023-12-05T21:56:00.000Z",
          "Titre": "You guys are incredible",
          "Contenu": "You guys are incredible! More data at the same price? You can't get much better than that! It is appreciated!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Randy Ness",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T07:21:22.000Z",
          "Titre": "My new phone was not working and I…",
          "Contenu": "My new phone was not working and I called to find out why. Your rep.did some tests and determined that the problem was my phone. She told me what to do to verify if that was the problem and she was right."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patrick Chan",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T10:14:12.000Z",
          "Titre": "Pretty easy to use",
          "Contenu": "Pretty easy to use. This is wonderful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Bommarito",
          "Nb_Reviews": 3,
          "Date": "2023-12-05T13:56:26.000Z",
          "Titre": "I love tello great phone and support…",
          "Contenu": "I love tello great phone and support service and price beats out all the big cell companies."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wu",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T17:29:01.000Z",
          "Titre": "I asked for usage data to evaluate…",
          "Contenu": "I asked for usage data to evaluate needs. I am happy with its fast response with the requsted records. Will keep its services and recommend Tello services to frieds and relatives whenever they ask me about."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Philip",
          "Nb_Reviews": 4,
          "Date": "2023-11-22T03:11:45.000Z",
          "Titre": "A great money-saver",
          "Contenu": "I've used Tello for more than a year.  My cell service has a few minor blips; one caller doesn't hear my phone ring when she calls me.  But the call goes thru, and the quality is as good as with my previous carriers.  It's a great money-saver."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marty Rakovan",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T18:59:03.000Z",
          "Titre": "Cost is cheap",
          "Contenu": "Cost is cheap, service is as good as any other provider in my area, which is rural so everyone has a dead spot here and there. Happy with the plan I have."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sergeo",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T04:33:47.000Z",
          "Titre": "Tello is a great service and the…",
          "Contenu": "Tello is a great service and the customer service is the best i have ever had on any services"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony Anastasia",
          "Nb_Reviews": 4,
          "Date": "2023-11-05T15:05:10.000Z",
          "Titre": "A Thoroughly Professional Service",
          "Contenu": "Set up was easy, reps were professional, knowledgeable, and pleasant. Price is more than reasonable, and I have never had a single issue that would cause me to consider changing service. What more can one ask for?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Badarinarayan",
          "Nb_Reviews": 2,
          "Date": "2023-11-06T20:36:18.000Z",
          "Titre": "Tello is one of the best mobile service Providers",
          "Contenu": "Tello is one of the best mobile service providers with affordable Price & with wide range of plans to choose.  Further Tello's Customer Care is quite active, quick in responding to queries"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T18:26:58.000Z",
          "Titre": "Tello is a great service",
          "Contenu": "Tello is a great service, especially for seniors, as it is easy to install and provides articulate customer service by phone. Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wayne Hinnenkamp",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T06:35:37.000Z",
          "Titre": "Plans that work",
          "Contenu": "Plans that work, are affordable, clear and honest."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Holton",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T19:31:53.000Z",
          "Titre": "Choices updated!",
          "Contenu": "Usually the choices are dependable OR affordable… Tello achieves dependable AND affordable! Keep up the great work Tello :-)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "W G",
          "Nb_Reviews": 4,
          "Date": "2023-10-29T14:44:13.000Z",
          "Titre": "The plans are perfect for my needs",
          "Contenu": "The plans are perfect for my needs. I've never gone over 100 minutes on talk and am very happy not to have to pay for unlimited. The prices also benefit people on fixed income who need a phone for medical and security reasons."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sergio Zenteno",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T20:52:28.000Z",
          "Titre": "Data problems",
          "Contenu": "I had a connection problem and was easily solved by their customer service. Kudos to Estrella, for top service.Hope people like her get a raise."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Margaryta Neyman",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T15:40:25.000Z",
          "Titre": "Great company with great customer…",
          "Contenu": "Great company with great customer service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nancy",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T01:23:57.000Z",
          "Titre": "I love your telephone service and have…",
          "Contenu": "I love your telephone service and have told many people about it. Several have decided to get it for themselves and are very happy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ernie",
          "Nb_Reviews": 3,
          "Date": "2023-10-30T19:30:24.000Z",
          "Titre": "Great customer service",
          "Contenu": "Yellow.sent me am email about my billing process not going thru on one of my accounts, after reviewing the account information and updating one of the cards it was very easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Herta",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T04:34:56.000Z",
          "Titre": "Sebastian was patient and kind from…",
          "Contenu": "Sebastian was patient and kind from first point of contact. He waited for me to obtain the information needed to work on the account. He explained everything to me and helped me get the plan that was right for me. I have told many people about Tello. I hope you remain successful for many years to come!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "S WEISBROD",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T16:22:48.000Z",
          "Titre": "Excellent TELLO activation",
          "Contenu": "The Tello activation was very easy and quick. MY Tello app is very good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barbara Larsen",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T02:39:42.000Z",
          "Titre": "Luna was fabulous. She has helped me two times. I remember her name.",
          "Contenu": "Luna was fabulous. My phone hasn't worked for four months. I switched to Tello for the lower price; I don't use my cell phone much. However, I was needing to use it. 11/10/23 11:45 CST (no order no.)Anyway, she helped me troubleshoot the problem on my end; couldn't fix it. She told me to wait 10 minutes and turn it off and on. She was able to correct the problem on the company level and IT WORKED! I was so excited. I'm sorry I forgot to fill this out. I called right away to tell her it was working and got Edgar Nunez who offered to mail me the review. THANK YOU, LUNA!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erika",
          "Nb_Reviews": 2,
          "Date": "2023-11-07T10:28:16.000Z",
          "Titre": "Love Tello!",
          "Contenu": "I left AT&T for being ridiculously expensive. I was able to port out my number to Tello and I’m very pleased. When I’m not working, I’m not glued to my phone as many people are therefore I’m happy with my 1GB of data & unlimited calls/text for $10!Can’t beat the price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "M. Noras",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T15:00:39.000Z",
          "Titre": "Inexpensive and reliable service",
          "Contenu": "Inexpensive and reliable service. I like it a lot, never had a problem with calls, texts nor data.I think it is the best deal on the market right now."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Suguru Ogata",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T02:35:39.000Z",
          "Titre": "Thank you for your good response",
          "Contenu": "I made a mistake in rollover my contract plan and consulted the customer center.Customer support responded quickly to my issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "H G",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T23:29:45.000Z",
          "Titre": "Convenient and applicable",
          "Contenu": "Have been using Tello for a while.  The usage plans are diverse, easy to choose, and easy to change plans at any time.  The effect is good and the price is very reasonable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yitz and Frimi .Levi",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T17:52:15.000Z",
          "Titre": "Great job!",
          "Contenu": "I love Tello in general and was so so happy with Jesica Cordova and her help regarding some confusing data in my order history. She was super professional and helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Acedc",
          "Nb_Reviews": 2,
          "Date": "2023-10-28T04:26:56.000Z",
          "Titre": "Best price  most options  and great…",
          "Contenu": "Best price  most options  and great service. Oh... and terrific customer support! I always am able to get the answers I need. Stellar experience so far."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MM",
          "Nb_Reviews": 3,
          "Date": "2023-12-13T07:22:32.000Z",
          "Titre": "Easy and quick to install",
          "Contenu": "Easy and quick to install!  Not only that but got up and working quickly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Bradley",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T00:29:56.000Z",
          "Titre": "Customer service is usually a bore",
          "Contenu": "Customer service is usually a bore. Amanda made the experience great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Spacer",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T20:27:11.000Z",
          "Titre": "Very helpful and considerate customer…",
          "Contenu": "Very helpful and considerate customer service. My only complaint is that sometimes the 48 hours bill reminder is turned off automatically. Otherwise Tello is pretty great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dale",
          "Nb_Reviews": 2,
          "Date": "2023-11-13T14:42:03.000Z",
          "Titre": "I like Tello",
          "Contenu": "I like Tello, they are consistent in their pricing and performance.  Great network and I like doing business with Tello."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Wu",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T22:11:07.000Z",
          "Titre": "Reliable service!",
          "Contenu": "It has good reliable services no matter where I went."
        }
      ]
    }
  ]
}