{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "textnow.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeffrey Fisher",
          "Nb_Reviews": 1,
          "Date": "2024-01-10T01:21:45.000Z",
          "Titre": "SIM card will not activate",
          "Contenu": "Package came in the mail I opened it put the SIM card in my unlocked phone tried to unlock Sim following directions. The SIM card that I received would not activate gave me a specific set of time to activate. I waited till the time time frame given and then try to activate. They said my car was already activated but would not work at all on anything tried several other phones that were unlocked all on my account and would not activate!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Daniel LaRusso",
          "Nb_Reviews": 1,
          "Date": "2024-01-02T23:21:26.000Z",
          "Titre": "Beware of termination for no reason!",
          "Contenu": "I have had my TextNow # for years and was on their premium service. Today, I was logged out automatically and when I tried logging back in, a message stated that I had violated their terms of service. I did not violate their terms and invite them to go through all of my text messages to verify. I use the # as a primary personal # and have never had an issue. This # is also connected to my banking, email accounts, etc and now they've royally f*cked me."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "NordVPN Customer - Diego",
          "Nb_Reviews": 6,
          "Date": "2023-12-29T20:30:50.000Z",
          "Titre": "Dropped after paying for service 3 years",
          "Contenu": "I have been a paying customer since 2020.  In December 2023 they closed my account while I was traveling in Spain and Italy.  I bought a sim card in 2022 which did not work in Manhattan, Brooklyn, Queens or New Jersey.  I think that they should focus on VoIP."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anzuly Marquez",
          "Nb_Reviews": 13,
          "Date": "2023-12-17T14:52:30.000Z",
          "Titre": "i has acount from many years",
          "Contenu": "I read their terms of service before setting up my account and never violated any of their rules. Very surprising to see my account got suspended !!! luckily, I have not paid the subscription before my account was taking down. But too bad to see how difficult or hard time they're going through to run their service properly"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Patrick kelley",
          "Nb_Reviews": 1,
          "Date": "2024-01-10T07:06:49.000Z",
          "Titre": "I never received the sim I ordered so…",
          "Contenu": "I never received the sim I ordered so someone stole it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Linda Kornblum",
          "Nb_Reviews": 3,
          "Date": "2023-10-16T23:29:24.000Z",
          "Titre": "Text now was difficult enough to use…",
          "Contenu": "Text now was difficult enough to use previously, due to the vast amount of ads you must endure to use this service. Now, some genius at Text Now has decided to run gaming ads, which run repeatedly, every.single.time you either use the phone or have a call come in. These ads run for several minutes, blasting loudly so you can't hear your own conversation nor is there anyway to get out of the loop until it finishes, which makes the phone service virtually unusable. Very unwise decision."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Majo",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T05:51:19.000Z",
          "Titre": "I fell victim to their \"Terms of…",
          "Contenu": "I fell victim to their \"Terms of Service\" violation scam just like most others on here. Shame on you, Textnow!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "There",
          "Nb_Reviews": 1,
          "Date": "2024-01-09T23:11:38.000Z",
          "Titre": "We were not able to use it",
          "Contenu": "We were not able to use it. Still can't. I don't know why."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "A A",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T06:46:06.000Z",
          "Titre": "This app is a total scam",
          "Contenu": "This app is a total scam. It ask you to pay for the paid version and says that the limitations of the free version will go away. I subscribed but nothing was fixed so I tried to change the number and they disabled my account minutes after I paid for the subscription. I contacted them asking for a fix or a refund and they didn't even bother to answer the email!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "SCG",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T05:26:36.000Z",
          "Titre": "Free service, HORRIBLE.",
          "Contenu": "Free phone service is literally a win for most people. If not, all.TextNow does that, but at what cost? EVERYTHING.I've created 4 GOOGLE ACCOUNTS JUST for TextNow to disable each of their numbers, and I lost HUNDREDS of valuable texts.And they aren't even going to reply to my goddamn appeal because APPARENTLY saying something as simple as \"yeah sure\" will set off a spam filter and disable my account.I HATE YOU TEXTNOW.Do yourself a favor and look up TextNow alternatives because TextNow is HORRIBLE. At least until they update their service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 5,
          "Date": "2023-06-04T07:39:57.000Z",
          "Titre": "Charged for annual subscription, account shut down next day and no refund provided. Stay away form this company please.",
          "Contenu": "Used their services for 2-3 years. Then one day, right after charging me for the annual subscription, they canceled the account as it apparently violated their terms and services. Sent an appeal, no reply at all. Had a chat with their support (they have no phone support), was told they did not disclose the reason, and would not refund the subscription. Please do yourself a favor and stay away from this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cuddle Me Dammit",
          "Nb_Reviews": 1,
          "Date": "2022-11-26T00:30:13.000Z",
          "Titre": "THEY DELETE ACCOUNTS AND ALL CONVOS WITHOUT ANY NOTICE OR REASON",
          "Contenu": "Expect to have your account shut down without any notice or reason!Sent a group text to a few friends saying Happy Thanksgiving yesterday. Then my account was shut down. I figured it set off a spam alert so I did live chat w them and they said my account could not be recovered no matter what. And they wont give you a reason. And they wont let you download your conversations post cancellation. 6 months of conversations with valuable information down the drain."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Seif H",
          "Nb_Reviews": 5,
          "Date": "2023-07-01T12:19:57.000Z",
          "Titre": "I was foolish enough to order a Sim…",
          "Contenu": "I was foolish enough to order a Sim card to take advantage of their so-called free cell phone calling and texting service. After activating the Sim, I was unable to receive calls or make outbound calls. Their only customer service provided is via chat by a service somewhere in India. The individual on the other side of the chat with me was never able to understand that my problem was with the cell phone and Sim card-based service not the app. No matter how many ways I explained it this individual did not get it and actually disconnected with me abruptly to get rid of me. It’s five dollars and some frustration lost but the lesson is avoid this business like the plague….."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Patricia Souza",
          "Nb_Reviews": 1,
          "Date": "2023-03-11T08:51:00.000Z",
          "Titre": "My experience with TextNow has been…",
          "Contenu": "My experience with TextNow has been horrible.  They blocked two phone numbers in one week for no reason.  I have lost all of my customer's Contacts and I'm trying to resolve it without success because they don't have any kind of customer service.  Please TextNow my name is Silvio my phone is 415 756 7898"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Laura Smith",
          "Nb_Reviews": 2,
          "Date": "2023-06-23T16:44:26.000Z",
          "Titre": "How does one contact a live human…",
          "Contenu": "How does one contact a live human Customer Service Rep. for info on tracking SIM card?  I bought SIM card 6/16/23, haven't received it as of 6/23/23, BUT, I'm receiving notices from Text Now stating \"It is time to activate your SIM card!?! ĤELP"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lorenza",
          "Nb_Reviews": 1,
          "Date": "2022-08-25T02:09:05.000Z",
          "Titre": "TextNow has gone crazy.",
          "Contenu": "TextNow has gone crazy.They are confused on how to run their service properly.I read their terms of service before setting up my account and never violated any of their rules. Very surprising to see my account got suspended !!! luckily, I have not paid the subscription before my account was taking down. But too bad to see how difficult or hard time they're going through to run their service properly."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Administrator",
          "Nb_Reviews": 2,
          "Date": "2023-02-14T11:05:10.000Z",
          "Titre": "They deleted my phone number for all of…",
          "Contenu": "They deleted my phone number for all of my marketing needs for my business without any reason and their is no support or customer support to explain anything at all !!!! Lost me over $11,000.00 for my construction company. Thanks alot text now.. I will absolutely never use again !!!! We emailed so many times and no reply"
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "mitchell",
          "Nb_Reviews": 1,
          "Date": "2023-01-02T00:54:47.000Z",
          "Titre": "Account Disabled for no Reason then Horrible Customer Service",
          "Contenu": "I signed up, used it to make a couple of calls and thought it was great.  The next day my account is disabled for violating terms.  I have no idea what term was violated because I only used it for 3 legitimate calls, therefore appealed, also asking what term was violated.  I get no response.  I try to follow-up and it is impossible because you are only allowed to appeal once, and their emails don't accept replies."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tali Nelson",
          "Nb_Reviews": 2,
          "Date": "2020-06-23T22:49:00.000Z",
          "Titre": "I am writing as a concerned parent of a…",
          "Contenu": "I am writing as a concerned parent of a son who suffers with mental illness. A \"girl\" has been texting him/communicating with him for over 2 years and I just discovered she's now using TEXT NOW. I actually think it's a BIG SCAM. I am taking his phone to the authorities or please feel free to INVESTIGATE the following phone number(from the scammer/girl): 651.317.7451!!! I want this to end for my son and am determined to find out WHO has this number and is manipulating him! It's sick and sad."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Majid Lodhi",
          "Nb_Reviews": 2,
          "Date": "2023-05-08T20:29:36.000Z",
          "Titre": "TextNow is the worst company when it…",
          "Contenu": "TextNow is the worst company when it comes to customer service. TextNow cancelled my subscription for no reason and did not refund the ad+ subscription as the subscription was taken out just a few days before cancellation. I had a hard time contacting them but finally I found their chat site. Totally unhelpful. They told me that Apple will refund the charges when I contacted Apple they told me that TextNow needs to refund it."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Ayesha Naaz",
          "Nb_Reviews": 1,
          "Date": "2022-09-25T11:11:58.000Z",
          "Titre": "Not good at all",
          "Contenu": "Not good at all. When app was screened for background trackers and spyware, Huawei 5G was tracking in the background. They also reassigned a person's phone number to me who reportedly conned someone by selling them a defective unlicensed gun. They did not respond to any complaints or give me a new number. I had to let the number expire."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mariam Saibu",
          "Nb_Reviews": 1,
          "Date": "2022-07-25T17:54:13.000Z",
          "Titre": "I used textnow for my small business…",
          "Contenu": "I used textnow for my small business and I paid for the no ad-version. About 10 months later, account got terminated for violating their terms. All I did was use the number to run the small business, accept call and send messages to customers about inquiries. Mind you, they never told me the violation, they don't tell you anything so you can correct the issue, they terminate the account and leave you to find out on your own by speaking to an online bot,"
        },
        {
          "Note": 1,
          "Lieu": "TH",
          "Pseudo": "Andy Moy",
          "Nb_Reviews": 4,
          "Date": "2023-06-12T17:55:43.000Z",
          "Titre": "Blocked my account for no clear reason. Now they cannot reactivate! 🤯👎",
          "Contenu": "I had a number for over 2 years. Making calls to a landline from it every other day. But I got a message that I wasn't using it...sending text messages out...and one day they blocked my account. What a nightmare. I talked to customer service. They told me it can be for a variety of reasons.  Not specific. And when they tried to reactivate it again they said they couldn't because I'm currently not in Canada or the USA.  The whole point of a voip number is that it's international!DO NOT USE TEXTNOW. FIND ANOTHER VOIP PROVIDER!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carson Day The Truth Be Told",
          "Nb_Reviews": 2,
          "Date": "2023-05-13T00:02:25.000Z",
          "Titre": "Suspended my account and canceled my subscription!",
          "Contenu": "Worst company ever! They canceled my subscription for no reason, and they suspended my account for suspicious activity. I use Textnow as my main number, and they are absolute trash ❌.  If you want a good company, use something else!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "暁ほむら",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T11:42:59.000Z",
          "Titre": "So sad",
          "Contenu": "Disabled my account with no reasonThe customer service always just copy same words.This app can set pass words but dose not support 2FA which means it is not safe enough."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steven Kraus",
          "Nb_Reviews": 1,
          "Date": "2022-11-22T21:29:35.000Z",
          "Titre": "SO THIS JUST HAPPENED",
          "Contenu": "SO THIS JUST HAPPENED:  If you are outside of North America or are using a VPN with a location set to another country, you will not be able to register for and/or use an account through the app or on our website.  I am an American serving at a US military installation overseas and all of a sudden textnow makes a \"Decision\" to NOT allow usage for us making companies like textnow a thing.  3 years for account and now I am without service.  Their customer support is awful as live chat took forever and the \"APPEAL\" email process is a waste of time. DO NOT USE Textnow!  They do NOT support us!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marisol",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T06:24:49.000Z",
          "Titre": "About my account balance",
          "Contenu": "I've been trying to do a live chat for over a month now because I cannot figure out how to put my account balance on my debit card. I ordered a plan and cancelled nów I have an accountant balance and cannot retrieve it. I wish there was a direct number to reach TextNow customer service instead of using that chat option it is so annoying SMH"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JAMES",
          "Nb_Reviews": 1,
          "Date": "2019-02-18T21:46:00.000Z",
          "Titre": "STAY SAFE DON'T TRY TEXT NOW",
          "Contenu": "I created an account 1 minute ago & here is a TEMPLATE REPLY FROM AGENTJohnnieIIt appears that our system has actually disabled your account, as we detected activity that violates our Terms of Use: textnow As a result of this violation, the account has been permanently disabled. I apologize, but we cannot re-enable this account under any circumstances.JohnnieI’m sorry, but we cannot see or disclose the specific violation, just that one occurred. If you’d like to read the Terms of Use mentioned above, (textnow), that should give you an indication of what caused your account to be permanently disabledSTAY SAFE DON'T TRY TEXT NOW"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cliff Brown",
          "Nb_Reviews": 25,
          "Date": "2021-09-13T16:29:27.000Z",
          "Titre": "This business has people using their…",
          "Contenu": "This business has people using their service to call people especially me daily on my landline claiming to be medicare and will not do anything about it .They want me to file complaints with law enforcement when it should be their problem not mine.I am going to file complaints with the FCC today against TextNow if they want do anything then they are supporting this by allowing these people to keep their phone number .You have been warned TextNow do something or I will file complaints against you with the FCC."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Deondre Eddie Jones",
          "Nb_Reviews": 5,
          "Date": "2023-12-05T20:32:56.000Z",
          "Titre": "$4.99 a year to locked a phone number…",
          "Contenu": "$4.99 a year to locked a phone number to receive a confirmation code bruh come on man 🤬"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tmi Admin",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T02:14:25.000Z",
          "Titre": "The full story",
          "Contenu": "I have been with 2nd line , a Text Now company . the service was ok and the ads were increasingly intrusive but it was free.  On mothers day I sent multiple ( over 20 ) gifs to my contacts and was promptly kicked oit of my account. I sent numerous messages to customer service . when they did respond. I was told basically I violated the terms of service with no insight to how. I sent the gif explained the situation and was told Basically there was nothing they could tell me or do and I lost my account.  Things happen but both the support and the situation is unacceptable. You cant trust the service if they dont respect ot protect us the consumer.  I dont write reviews but a number I have circulated for years I now have lost access to including numbers and media."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "essel",
          "Nb_Reviews": 8,
          "Date": "2022-01-05T03:10:58.000Z",
          "Titre": "A Scammer pretended to be from ICE and…",
          "Contenu": "A Scammer pretended to be from ICE and USCIS called me and threatened me to steal money and identify. This is AR-11 FORM SCAM.The phone call was mainly from VOIP services. They sounded like Indians and called from +12028475394.  He called me from multiple number and it looks like the numbers are from different VOIP services including bandwidth.com and textnow.com.Another number is I guess - +1 720 440 5399.Another number is +1 720 440 5399 and another one is +1 6697779187TEXT NOW - PLEASE PROVIDE VOIP SERVICES AFTER CHECKING BACKGROUND. OTHERWISE THIS COULD BE A THREAT TO ANY NATION.BEWARE OF INDIAN SCAMMERS CALLING THROUGH VOIP TO USA RESIDENTS FOR IDENTITY THEFT AND MONEY THEFT. PLEASE HANGUP IF THEY SAY AS A FEDERAL OFFICER OR ANY GOVERNMENT OFFICERS."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2022-12-12T17:44:55.000Z",
          "Titre": "They said it takes up to 5 business…",
          "Contenu": "They said it takes up to 5 business days to poet out your number and I'm on day 3. Don't move your number to text now u less you plan on staying with them forever! Oh you can't use your messaging or calling app ypu have to use the text now app and they often drop calls. Receiver says it sounds like I'm underwater.."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Duane OD",
          "Nb_Reviews": 1,
          "Date": "2023-02-03T06:34:54.000Z",
          "Titre": "Screwed by Textnow, just now",
          "Contenu": "Purchased an Iphone6 from Textnow in 2018.  Lost the free number in 2021 when I forget to use it for 31 days.  Tried to login and get a new number on 2-2-23 and got a message that my account was suspended for violating terms of use.  Heck, I didn't use the account for over a year, but Textnow won't even tell me why my account was terminated. Don't use Textnow if you telephone number is important.  They will screw you down the line"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MarkL",
          "Nb_Reviews": 1,
          "Date": "2021-11-17T20:49:38.000Z",
          "Titre": "Total Scam App",
          "Contenu": "After five years of using this app and being general fine with the service I was terminated from it for violating their Terms of Service (ToS).  They won't explain what I did or reinstate after chatting with them (no customer service number to call) but of course they're going to keep my money and Apple won't refund it either since it's been more than 60 days since my subscription renewal.Great little scam they and Apple have going on.  Cut the service but keep the money.  Then split the pot at the end for a nice payday for them.Don't get sucked into their scam world and save yourself the problems."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "KittyMaster Friery",
          "Nb_Reviews": 2,
          "Date": "2023-09-13T02:08:00.000Z",
          "Titre": "Wanted to leave 0 stars",
          "Contenu": "Beware of using the texting app called TextNow  they randomly decide you violated their TOS (but won't tell you which one) and lock you out of your account and you will lose all information and/or pics you have. BUT they will still have your info.  And F.Y.I. it is based out of Canada."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Maria",
          "Nb_Reviews": 1,
          "Date": "2022-03-25T19:49:57.000Z",
          "Titre": "Don't use this app! You could lost your access",
          "Contenu": "Download the app, click on the create new account button, put my email and password. Select a number and close the app. I didn't even call, receive or send messages. I did not do anything. The next day they tell me that I violated the terms and conditions and they close my account forever. It's the most ridiculous thing that's happened to me on the internet and they say they can't explain it to you."
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Renee Jackson",
          "Nb_Reviews": 1,
          "Date": "2022-03-11T15:57:11.000Z",
          "Titre": "Don’t use this service",
          "Contenu": "I had used this app for a few years, everything was fine until recently. They blocked my account and couldn’t tell me why. I can’t even create a new account and when I was finally able too, before being able to do anything with it I apparently violated the terms. After reading so many reviews it seems everyone is having this issue. And TextNow doesn’t care."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rebekah",
          "Nb_Reviews": 1,
          "Date": "2022-05-29T15:17:02.000Z",
          "Titre": "Worst company ever!",
          "Contenu": "I had a TextNow number for my small start up business so I didn't have to use my personal number. Despite following all the rules, making calls and texts monthly. They still reassigned my number. You can't reach ANYONE from this company. Their website is a joke. Never again will I use this company. They should be shut down since their customers and the public can't get ahold of anyone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "j",
          "Nb_Reviews": 2,
          "Date": "2023-07-14T22:46:46.000Z",
          "Titre": "they act tiny theft,charge me a dollar…",
          "Contenu": "they act tiny theft,charge me a dollar for sim card which offer some minius and data,then no more service couples of month later,what a joke"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Monique",
          "Nb_Reviews": 7,
          "Date": "2022-07-11T20:03:04.000Z",
          "Titre": "Poor Customer Service",
          "Contenu": "I have not used these services in months. All of a sudden, I get charged. Got the run around from google play and textnow support. Absolutely horrible and now I’m outside of the refund policy waiting on both companies?!? I’m super upset and don’t recommend at all."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chm",
          "Nb_Reviews": 1,
          "Date": "2022-07-28T00:10:36.000Z",
          "Titre": "Bad company to do business with",
          "Contenu": "This company is located in Canada and has a habitual record of just shutting accounts down for violation of their users agreement without supplying any information of the violation. No reinbursement either. Their support is a robo. This company will scam you. One of the many scammed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "K JAN",
          "Nb_Reviews": 1,
          "Date": "2020-06-29T14:48:17.000Z",
          "Titre": "Horrible Customer Service",
          "Contenu": "I got a $50 referral credit yesterday (through their own system. They sent me a pop-up message that I got a referral credit). Then this company took it away without providing any notice or explanation. I reached out to the customer support to inquire (which is only through chat). The representative named Aaron G did not understand his company's referral system and claimed that he did not see anything in my account. Suddenly, he ended the chat on his side, and now their customer support is totally unreachable. What a HORRIBLE customer service! Don't waste your time and money on this company. This is indeed my worst experience dealing with any customer service agent. Their call quality is really bad too. My call frequently drops."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 37,
          "Date": "2021-08-30T20:58:34.000Z",
          "Titre": "Impossible to get in contact with them",
          "Contenu": "It's impossible to get in contact with their support. I wish it was good but I honestly don't know because I can never get in contact with customer service. They have a bot that answers absolutely no questions and their agents are never online. I've literally been trying to contact them during their stated business hours on the chat for weeks and not a single agent has been online."
        },
        {
          "Note": 1,
          "Lieu": "EG",
          "Pseudo": "Ahmed",
          "Nb_Reviews": 5,
          "Date": "2018-12-06T11:41:58.000Z",
          "Titre": "Stay away at all costs!",
          "Contenu": "I had an account on their website. They closed my account without any prior notice or explanation.I tried to contact them. There is no way to contact them, no phone number, no tickets, no emails, no live chat. Literally 0 customer service. Zero.I found that I can post on their forums for help, so I needed to make an account, but I can't, they won't allow me to make a new account just to post a question on the forums.Terrible experience."
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "Zak Patel",
          "Nb_Reviews": 2,
          "Date": "2020-11-30T02:46:16.000Z",
          "Titre": "I was using textnow since long and it…",
          "Contenu": "I was using textnow since long and it was working great! I stopped using textnow for some time since i got engaged in some personal stuff now i am trying to recover my account and it's not allowing me to login nor be able to create new account. Their support is not replying me. Can some related to the concerned department of textnow may able to contact me to resolve this matter."
        },
        {
          "Note": 1,
          "Lieu": "BD",
          "Pseudo": "Lee Adams",
          "Nb_Reviews": 1,
          "Date": "2022-02-04T17:02:32.000Z",
          "Titre": "They give my number to a scammer.",
          "Contenu": "I had a one-year paid subscription, when I fully involved my number with my business, they just suspend my account without any notice or didn't even email me after suspension and give my number to a scammer. Now I am in big trouble."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Britbrat",
          "Nb_Reviews": 1,
          "Date": "2021-12-14T08:50:08.000Z",
          "Titre": "TEXTNOW SUCKS",
          "Contenu": "I’ve literally made 5 accounts in the past week and each one was deactivated due to violating their terms of service or whatever without giving a reason for what I did to have that done. This app is total BS and shouldn’t even be used."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Val Lee",
          "Nb_Reviews": 3,
          "Date": "2021-07-26T19:50:52.000Z",
          "Titre": "NO Live help from TextNow. No way to resolve!",
          "Contenu": "There is no live chat support! They just post irrelevant articles. No one is there to assist. My account was hacked and I cannot get into my account and when I use my email to receive help, it says it is invalid or belongs to another. My TextNow phone number is working on my iPhone, but not on my Mac laptop. It was my laptop that was hacked. For some reason, it did not affect my phone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Starina Goldman",
          "Nb_Reviews": 1,
          "Date": "2018-09-05T16:15:21.000Z",
          "Titre": "Horrible app",
          "Contenu": "Horrible app, I have tried contacting them and nothing.Issues-Doesn't ring when getting a callDrops the calls constantly (excellent wifi)Caller can never hear meSlow to open the app (5 mins.) No notification when getting textTakes a while to even pick up a call This is very ridiculous and this one is the worst,  I get about 30 calls a day from different numbers it can be from New York, Arizona etc. I have never given my number away to anybody just close family, I block the numbers and the numbers just change, leaving the area code the same and three digits but changing the last four only!! What is this?! I will be uninstalling this app soon"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Mihit Patel",
          "Nb_Reviews": 1,
          "Date": "2023-04-29T07:21:36.000Z",
          "Titre": "I was paying for the TEXT NOW number…",
          "Contenu": "I was paying for the TEXT NOW number and I delevloped my client base on this number....they just stopped my number without even sending me any kind of notice and directly I stopped my number....I would suggest you guys to go for TEXT ME OR TEXT PLUS app as they run business very genuinely and they care for their users..( specially paid users), TEXT NOW will stop your number any time without sending you any prior notice and you won't be able to even recover your all data from that app.....please don't use TEXT NOW if you don't wanna suffer ....they wont even help you when u chat with their client support...very ridiculous platform...go for TEXT PLUS OR TEXT ME app they runs well and they will never stop your number."
        },
        {
          "Note": 1,
          "Lieu": "FI",
          "Pseudo": "Saeed Sk",
          "Nb_Reviews": 1,
          "Date": "2021-11-21T18:24:19.000Z",
          "Titre": "lack of responsibility",
          "Contenu": "HiI have purchased an account from #textnow and many of my contacts are connected to this account.But now, for no reason, my account has been #blocked forever and the company does not accept any responsibility.He does not even inform me the reason for closing my account."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kelly Moniqué",
          "Nb_Reviews": 3,
          "Date": "2023-03-10T22:05:16.000Z",
          "Titre": "Trash - Stay Away!!!",
          "Contenu": "Trash connectivity. Can't even make calls, can only use as text for my biz support line, which is also a paid service. It's a battle to reach customer service. When you do, most are totally incompetent! Deserves a 0. Stay away!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "GOOGLE Partner  VJRADRICK FCC",
          "Nb_Reviews": 5,
          "Date": "2023-05-09T22:36:25.000Z",
          "Titre": "#textnow NOT getting 2FA VERIFY…",
          "Contenu": "#textnow NOT getting 2FA VERIFY Messages from CHASE BANK cant renew in app or PC > renew links dont work! \\MLM #FTC fined $$$ see SanJose CA BBB.org ideas?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Atuoma Ezeh",
          "Nb_Reviews": 1,
          "Date": "2021-04-02T20:25:52.000Z",
          "Titre": "My TextNow number stopped making and…",
          "Contenu": "My TextNow number stopped making and receiving calls. When I called the number on their site a robot answered telling me to go on the website to chat with someone. I went on the website and the chat is almost impossible to find. Horrible company with horrible service. All they care about is app downloads but they don’t follow through"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Gail",
          "Nb_Reviews": 1,
          "Date": "2023-04-14T23:21:05.000Z",
          "Titre": "can't login",
          "Contenu": "Well I deleted an email address (google) and guess what?  that was the one used to login to textnow.... i have attempted to explain this mistake to their customer service twice.  they simply tell me i must change the email address on my end.  i cannot.... a verification code is sent to the deleted email...  just an email change should not cause so many headaches"
        },
        {
          "Note": 1,
          "Lieu": "BJ",
          "Pseudo": "Sandeep Mangla",
          "Nb_Reviews": 1,
          "Date": "2022-05-04T21:48:54.000Z",
          "Titre": "Scam company",
          "Contenu": "Scam company. Everything will work for a while, and then one fine day your number and account will be disabled, with obviously no refund of the premium fee they charged. And oh by the way, no customer service email or phone number or chat to complain. Wow"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JDS",
          "Nb_Reviews": 4,
          "Date": "2021-11-29T21:21:44.000Z",
          "Titre": "Worst calling App in USA",
          "Contenu": "Worst calling App! Text Now is extremely \"Shady\" --- They make you pay for a number, for one year, you lose the number & then they withhold the SAME area code to give you a new number! They have done this for years. I dropped their subscription, because TextNow does NOT reply to customer Emails. I've used many calling Applications, and TextNow is by far the WORST. Number selection is withheld \"within\" the company. TextNow tells its paying & free customers that they have no Numbers available, when infact they have many. They withhold showing users certain Area Codes so they can keep them to themselves and for customers using a different IP address. I would NOT use them. They stole a year's worth of money from me & did not Activate my Cell Phone -- or the APP! User beware. My experience was terrible!! Remember -- they hold available area codes from customers! BBB should be notified."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "mncatlover",
          "Nb_Reviews": 1,
          "Date": "2019-10-23T23:16:00.000Z",
          "Titre": "Absolutely horrible",
          "Contenu": "Absolutely horrible! Where to start? Service was god-awful with choppy reception and a long delay. Then, there's customer \"support.\" It's only open until 4:30 p.m. EST. When it's time to close, they shut off the lights and end chat even if you're in the middle of a conversation. Then, they hold your number hostage when you try to port it to make you pay for another month's service. Don't waste your time with this one. Even the app is dreadful, making you restart your phone to get texts or calls. Worst wireless experience I've ever had!"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Aswin Kumar",
          "Nb_Reviews": 1,
          "Date": "2022-08-14T12:08:43.000Z",
          "Titre": "Steals money after subscription",
          "Contenu": "I have an annual subscription from Textnow starts from Sept 2021 - Sept 2022.But on Feb 2022, they unilaterally denied the service. When I contacted their customer support person Jason, he refused to service and denied to refund the money. Pathetic."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "CHRISTOPHER MCALONEY",
          "Nb_Reviews": 2,
          "Date": "2023-08-09T02:44:28.000Z",
          "Titre": "Scammers!!!Do Not Buy Anything from!",
          "Contenu": "Scammers!!!Do Not Buy Anything from!In the app it has 1 price for ad free for a month,but when you go to checkout it charges you weekly and not monthly like it states in the app.This is 100% False Advertising!Watch yourself people!I have friends in the U.S.A. with Textnow sim and there data plans advertised are not even the same as to what they offer now.Textnow is nothing but a scamming company and they don't care about customers or there employees.Do Not Deal With Textnow!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "subscribe to LiquidfireZoZ",
          "Nb_Reviews": 1,
          "Date": "2021-09-19T00:12:24.000Z",
          "Titre": "Aparently i used the app or whatever in…",
          "Contenu": "Aparently i used the app or whatever in 2014 first off i didnt even know.i had it. Thhen secound of all there are a bunch of random texts with random letters that i never sent i dont use the app it in my spam mail for a reason. So is somone using my account if so was it sold to them from The company? Why is an accpint being used under my email no better yet HOW is an account being used under my email. Biggest freaking scam taht im 40% sure is. Big freaking crime. May have to file a lawsuit or whatever i can because this is extremly shady."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "shapur",
          "Nb_Reviews": 2,
          "Date": "2023-09-15T20:34:05.000Z",
          "Titre": "without alerts they disable textnow…",
          "Contenu": "without any alert they disabled my textnow account so that I missed all connections which was based with the number they had assigned to my account."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tim Givens",
          "Nb_Reviews": 1,
          "Date": "2022-02-24T17:30:25.000Z",
          "Titre": "Worst constantly says I have no vm…",
          "Contenu": "Worst constantly says I have no vm setup other times those calling me get some crazy guy answering say stop calling me you got the wrong fg number.  Etc.  Paid for sim kit 5 months ago and never received it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "RanKai Ohana",
          "Nb_Reviews": 1,
          "Date": "2021-09-27T10:26:04.000Z",
          "Titre": "I did not use TextNow but my activity shows I did.",
          "Contenu": "My Web and App activity is showing I visited TextNow from three different cell phones that I've purchased since 2019. I never did visit TextNow or used it. What is going on?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "R L",
          "Nb_Reviews": 2,
          "Date": "2022-09-12T16:43:15.000Z",
          "Titre": "Not reliable, there's are better alternatives like TalkU",
          "Contenu": "I've been using textnow since 5 years now and I have a paid number, after 5 years they banned my account for no obvious reason and refusing to activate the account back nor refund me.Not a reliable service at all, do not link your important stuff to this crap app"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amanda poore",
          "Nb_Reviews": 1,
          "Date": "2021-06-28T19:13:16.000Z",
          "Titre": "My Textnow account is hacked",
          "Contenu": "My Textnow account is hacked, someone changed my number, and is sending out messages , this is very scary stuff, no customer support, and the people that hacked my account are using it for bad purposes,  They need customer support,  I tried paying for the no add offer, and it did not good not once.  i cancelled that,  this is dangerous,"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Clint Wolverine",
          "Nb_Reviews": 1,
          "Date": "2020-05-24T04:36:47.000Z",
          "Titre": "THEY Don't Even Deserve ONE star…",
          "Contenu": "These people don't even deserve a ONE Star.  But couldn't  access to give a review unless I picked at least one star.!!!!!!!!!!!!!!!!!!!  They close your account if you don't use the the text, after only 2 weeks. They Do NOT Care about the Pandemic Happening in this country right now, OR the fact of catastrophes in certain parts of the country. Especially in MICHIGAN. This problem in MICHIGAN Has caused NO NIGHTS OF SLEEP, To Try and Recover From This. Then They SHUT IT OFF, Right When We NEED IT MOST.!!! WORTHLESS \"A\" HOLES>>!!!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "VE",
          "Pseudo": "Bermudez",
          "Nb_Reviews": 4,
          "Date": "2021-11-30T01:36:46.000Z",
          "Titre": "Not even one star deserves",
          "Contenu": "Not even one star deserves. I have opened 3 accounts in 4 days. The last one did not last 3 hours in which they closed it for allegedly violating the terms of use. In the support chat they never gave an explanation about what the violated terms of use were. They only limited themselves to sending a link so that we can read it ??? Without offering any answer or solution.The worst of all is that every time I paid for each number they gave me and they NEVER returned the money.It seems to me a total FRAUD AND SCAM.You have to be careful not to fall into this trap."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tina Bailey",
          "Nb_Reviews": 2,
          "Date": "2023-10-27T18:42:16.000Z",
          "Titre": "Nothing but scams calls all day n…",
          "Contenu": "Nothing but scams calls all day n night. .the app don't let you do anything withouf having to pay 6.99 a week for each thing. Very poor service and nothing but scam calls day and night .I don't recommend at all"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "DM",
          "Nb_Reviews": 6,
          "Date": "2022-11-03T16:14:50.000Z",
          "Titre": "you get what you pay for",
          "Contenu": "Bought a SIM card for $1 with free delivery. Activated and tested on an iPhone.Calls and texts can only be made through the TextNow app, not the Phone and Messages apps.When you go into the Settings part of the TextNow app there’s no obvious way to get back to the screen with calls and text messages, other than force quitting the app.Also, calls made through the TextNow app often don't go through at all - they just keep ringing in the app but there’s no incoming call on the other phone. Sometimes calls don’t go through at first, then after a few minutes when you've already started doing something else, the phone starts ringing and the only way to stop it is to force quit the TextNow app.To sum up, it's a mess. Don't rely on this \"free\" service. Instead, get the cheapest prepaid plan that will actually work when you need it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Debra Morris",
          "Nb_Reviews": 1,
          "Date": "2020-06-04T06:26:38.000Z",
          "Titre": "This app is a joke to say the least",
          "Contenu": "This app is a joke to say the least. Does not always hang up or disconnect when I'm done talking to somebody. Drops calls,doesn't ring when I have a incoming call most of the time, no notifications when I receive texts or messages, makes stupid noises for no apparent reason and some moron constantly sending me a text telling me I'm not allowed to text!! Who is that idiot anyway??That's just a few things. And doesnt work hardly at all when I'm away from WiFi. App is pure 100% junk!!  It's not worth a penny let alone what you charge. I'd rather pay alittle moreand get a good reliable service.You should be prohibited from charging anything for this crap.You should fix all the crap wrong with it or stop charging people.What a rip off!!"
        },
        {
          "Note": 1,
          "Lieu": "HK",
          "Pseudo": "Joshua Yuet",
          "Nb_Reviews": 4,
          "Date": "2022-05-16T20:37:07.000Z",
          "Titre": "Useless SIM wasted money and time. No support at all",
          "Contenu": "Purchased a SIM card, got it in Florida. Put it in iPhone 12 and got LTE signal. Can’t make calls. Can’t get calls. Can’t get sms. Totally useless. Plus, no hotline, no email support, just a fishy chat service that will disconnect before even got one answering you."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Renegade Rebel",
          "Nb_Reviews": 2,
          "Date": "2022-02-01T14:07:55.000Z",
          "Titre": "Working with scammers.",
          "Contenu": "I've constantly reported numbers from their service for scams and never got any responses. They don't do anything to stop the scams so in my opinion that makes them complicit."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ricardo",
          "Nb_Reviews": 4,
          "Date": "2018-12-02T05:04:33.000Z",
          "Titre": "No customer service at all! .",
          "Contenu": "Don't even think in the pay version of TextNow, horrible customer service, never answered  email's,  no answers  on the chat and no phone customer service. They charge you and then when you have a problem  there is no help at all. I just  cancel my service and file a charge dispute with my bank.Stay away!, Be aware!."
        },
        {
          "Note": 1,
          "Lieu": "HK",
          "Pseudo": "Penny",
          "Nb_Reviews": 2,
          "Date": "2022-05-16T20:47:06.000Z",
          "Titre": "A slap on customer",
          "Contenu": "Account suspended next day after opening. Opened a new account. Picked a number. Not even started to use. Then the very next day I got warning for violation of terms. What am I violating? I didn’t even start to explore. They wanted me to verify email then they will reopen my account. Well thanks for the slap and now you want me back? Go to hell."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike S",
          "Nb_Reviews": 2,
          "Date": "2020-07-06T20:24:42.000Z",
          "Titre": "Can't catch a break",
          "Contenu": "As suggested in the response to my last review, I was able to chat with a tech online.  Since I didn't discover how bad my \"glitches\" were until after the 30 refund fund, I am left holding an expensive paperweight.In regards to my phone number being \"recycled\", I discovered it was regarding my free account number.  I was not aware I had a free account.  I directly asked to cancel that account and Shawn told me to just don't use the account and the number will be recycled.  When I asked not to receive anymore emails from TextNow Shawn said \"I wouldn't be able to change the email on the account no, you'd have to log into the account, and put another email address not currently on a TextNow account on the account to change the email address on the account. Sorry for the inconvenience!\"   Not and inconvenience a nuisance."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mindy Vaughan",
          "Nb_Reviews": 17,
          "Date": "2022-09-06T16:56:21.000Z",
          "Titre": "Very Unreliable!!!!!",
          "Contenu": "They constantly cancel my account BEFORE my payment is due. And my payment is through an iOS subscription, which has money on that card. They have no idea what they're doing and they're a HUGE pain to deal with!!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "GR",
          "Pseudo": "Ava",
          "Nb_Reviews": 2,
          "Date": "2022-02-25T16:09:30.000Z",
          "Titre": "No way to delete a free account",
          "Contenu": "I created a free account to test the service. As I was not satisfied with it, I decided to delete my account after a few hours. Guess what?! You cannot delete the account! They keep your email address on their servers, which is a privacy breach."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Briana",
          "Nb_Reviews": 8,
          "Date": "2023-09-02T18:06:24.000Z",
          "Titre": "Banning people left and right",
          "Contenu": "Banning people left and right! I have a paid subscription and when i tried to log in, it says i violated their TOs and it cannot be undone. i have no idea what i've done."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jarrett Thompson",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T17:42:03.000Z",
          "Titre": "I am appalled",
          "Contenu": "It was great at first, I could text and call at my own disposal, but ever since last Friday I haven't been able to use the app at all in the way it's intended to. I can't sign in properly. I can't open the app in the app store without my computer having problems. Tried the ole turn off and turn back on with the laptop and same with the wifi. Everything else works fine so I know this app is the issue. Do not use unless it's a last resort."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Ayo K",
          "Nb_Reviews": 1,
          "Date": "2021-11-26T19:50:50.000Z",
          "Titre": "This is a scam",
          "Contenu": "This is a scam. I paid for the service and had not even used it after day one they said i violated their terms of service and they wont explain what i did wrong within a day of subscribing to it. They just felt they are above anyone and wont explain to anybody after all who will take them to court of $12 or less. This is a fraud i tell you."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tim Lee",
          "Nb_Reviews": 2,
          "Date": "2022-06-27T23:32:47.000Z",
          "Titre": "Revised & Update  Textnow does have live online help available",
          "Contenu": "I have an account with textnow, their service now requires a new sim card. However, if your Android version is too old you cannot use the new sim card. I bought a new phone with Android 12 but have been unable to download the textnow application to use the new sim, even in google play. Searched all of their website but there is no way to contact them with my problem.  They have a link for online support but it just provides canned answers and cannot deal with problems not in the automated system. This has been a frustrating experience and after much work have not solved my problem.Textnow does have live online help available. It seems that the hours I tried to use the online service was during the non working hours. They do not mention that on the site so I with my schedule it is not convenient to call during those hours. If they had listed the hours where humans were available it would have saved me a lot of frustration.  I was finally able to contact them and they provide the help I needed."
        },
        {
          "Note": 1,
          "Lieu": "KE",
          "Pseudo": "David Miller",
          "Nb_Reviews": 1,
          "Date": "2022-01-30T16:47:20.000Z",
          "Titre": "A scam at the best",
          "Contenu": "A scam at the best! I set up a text now number on my wifes phone, worked for a month than it got disconnected, so I set up another number and paid to have it locked. Now that one has never worked properly, we can call but no one can return any calls or texts. Do not try!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jennifer Clark",
          "Nb_Reviews": 2,
          "Date": "2023-10-27T04:42:02.000Z",
          "Titre": "DO NOT USE THEM",
          "Contenu": "Free phone service, what can go wrong? I also needed to make calls outside of wifi so I got the sim card for 4.99. It drops calls, I can't pick up calls nor make calls. Tried turning phone off and on to no avail. Had a couple of phone interviews and after a few times of them trying to get through to me they gave up so I lost out on a couple of job opportunities. I needed wifi access for just one week so paid the 4.99 and turned off auto renewal so I wouldn't be charged. One the wifi never worked so it was useless paying for that service and two, a month and a half in i kept getting charged once a week for this service for 4.99 which over drafts my account eveytime since I have no money in that account which is 15 dollars everytime. I still owe about 80 dollars of overdraft fees because of this company and they don't care. Can't call them, you can only message them. They don't say sorry or nothing but they do atleast refund my 4.99 fee and as I'm writing this I got a notification that they took out 4.99 once again and I have discontinued this service a week ago. And messaging them is a joke because you can't turn off your screen and sometimes you have to wait three hours for someone to come on. I let me screen go black for 5 mins and came back on and they got on and said sorry we didn't reach you and closed the chat. They have my number just text me atleast. So far I'm loving tello and have not had any issues and they are 10 dollars a month with internet included."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "jepoore",
          "Nb_Reviews": 3,
          "Date": "2021-12-30T18:13:54.000Z",
          "Titre": "Way Over the TOP!!!!",
          "Contenu": "I am using TextNow on an average laptop. They have put so so much ad on the page, it's become so busy you can't tell what you are doing. 3 or 4 ads are streaming at the same time and a total distraction. It's just way over the top."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mikel Prince",
          "Nb_Reviews": 1,
          "Date": "2022-09-23T11:44:04.000Z",
          "Titre": "I paid for sim card never received it",
          "Contenu": "I paid for sim card never received it. Same with numerous friends and family members. When I messaged them on Facebook they blocked me"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Del Edwards",
          "Nb_Reviews": 1,
          "Date": "2021-09-13T09:41:11.000Z",
          "Titre": "Had a number for well over a year",
          "Contenu": "Had a number for well over a year. My mom passed, I forgot to text or call the number and it was reassigned. Just stick with good old reliable and forever constant service like Google Voice."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "T C",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T05:23:07.000Z",
          "Titre": "TextNow Cancelled My Account Without Warning",
          "Contenu": "TextNow Pulled The Number and Account without any warning, or reason. I just suddenly did not have access to my account, and was told there was not any account with my email. This was odd as I had used it the day before this happened. Having someone close to me die suddenly and discussing with my closest contact that I felt lucky we could communicate through TextNow. Then, they pull my number 306-718-5575, without any reason, nor warning. They must have wanted the number for someone else. Oddly enough, I was just going to contact the business to see if it would be possible to get a sim to use in my phone too. The company is out of Canada, and offers free text and calls in Canada and the USA. It offers very low cost calls internationally. But, what good is any of it, if you suddenly do not have any account or phone number to communicate. If this had not happened, I would probably have given the company a 5 star review because up until this sudden stripping of usage, I was always telling everyone about the great company. Now, I tell them to avoid it unless they want to wake up one morning to find they no longer can communicate with others due to a company that cares very little how they affect the users.  Mostly, it is heartless when they see the messages and know that people are dealing with loss."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Briana",
          "Nb_Reviews": 8,
          "Date": "2023-03-04T20:20:05.000Z",
          "Titre": "They completely suspended my account…",
          "Contenu": "They completely suspended my account for no apparent reason. I had my bank accounts, and all other personal accounts linked to my textnow account. now i cannot access anything."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "big a",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T19:14:11.000Z",
          "Titre": "Bait and switch.  The lock in number for the first year…",
          "Contenu": "The lock in number for the first year was reasonably priced, then they made the yearly amount a monthly amount."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eda",
          "Nb_Reviews": 3,
          "Date": "2022-03-08T00:10:41.000Z",
          "Titre": "not free",
          "Contenu": "Advertised as free, but nothing is free, I just installed it, and I am getting rid of it because the app is already begging for money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jd Wilmoth",
          "Nb_Reviews": 1,
          "Date": "2022-04-13T16:03:53.000Z",
          "Titre": "Text now is a scammers Haven",
          "Contenu": "This service needs to be shut down three out of four texts or calls I get from scammers comes from text now numbers"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dietlinde Hoffman",
          "Nb_Reviews": 1,
          "Date": "2018-07-12T17:00:50.000Z",
          "Titre": "Dropping calls, Terrible reception",
          "Contenu": "I have the Text Now free service and my husband the paid service. It is horrible. We stay with it because it's cheap. Half the time I can't make call when I want. It deletes the names of my phone contacts randomly. The names that I put in on the computer don't carry over to my phone app so I have to put in every contact twice. I also get calls and texts from strangers, so they are selling my number. Reception is terrible and sometimes get a text a day later than it was sent. You can bring your number in, but you can't move from Text Now to someone else and keep your number."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "edward hayes",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T00:34:58.000Z",
          "Titre": "I’ve had text now for years have used…",
          "Contenu": "I’ve had text now for years have used it a lot. Many contacts have my text free number and call and text on it. Just recently text now just stopped being available. They just left me high and dry. No pre noticeNo nothing. I’m just left out in the desert. Would have been nice to have a little advance warning that I would lose all means of contact."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Zev W.",
          "Nb_Reviews": 4,
          "Date": "2018-08-15T15:49:43.000Z",
          "Titre": "Terrible call quality",
          "Contenu": "Terrible call quality, even when connected using excellent wifi signal.Customer service chat service also very pronlematicand their app is buugy, keep away and use something more reliable, otherwise be prepared to deal with their problems."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Grace",
          "Nb_Reviews": 1,
          "Date": "2022-07-27T17:17:42.000Z",
          "Titre": "Will Delete Your Account With NO Notice",
          "Contenu": "I used TextNow for about two months. I don't have good service where I live, so used the app to make Wi-Fi based phone calls to my healthcare providers. It was the only way that I could stay in touch with them, because my data is useless in the country area I live in. I used it one day, then woke up the next day and it had logged me out of all of my devices. I tried uninstalling and reinstalling the app and logging in again (per advice of their help article) and it still said \"Something went wrong try again later\" after two days I finally contacted the live chat. Which by the way is the ONLY way you can reach them. They informed me that my account had been permanently deleted and I cannot undo this. I cannot get any of my messages or call logs from within the account there is no access to it. They gave me no email warning or anything. Their excuse was I violated terms of use. I asked how because I only used it for basic calls and messages. I asked is calling doctors a violation of your policy? Like what a joke. He just gave me a link in the chat to read their terms of use and told me again I was in permanent violation. I told him I will just leave a bad review. Outside of that, it makes me uncomfortable that they're logging and reading through our conversations or phone calls. That's creepy. Don't use TextNow. They're a poor excuse for a app that's supposed to help people communicate."
        },
        {
          "Note": 1,
          "Lieu": "JM",
          "Pseudo": "Carol Williams",
          "Nb_Reviews": 1,
          "Date": "2020-02-01T20:46:34.000Z",
          "Titre": "DO NOT USE THIS APP",
          "Contenu": "DO NOT USE THIS APP. IT IS A FRAUD!!!!! THEY stole my money  and lie about the account not being linked to the purchase. I sent proof of apple receipt and proof of the account i use for textnow and they refuse to refund me and keep giving me the go around.  DO NOT USE THIS APP"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "chet keller",
          "Nb_Reviews": 3,
          "Date": "2021-11-15T23:18:26.000Z",
          "Titre": "This app is pure garbage",
          "Contenu": "This app is pure garbage. I used it for 4 yrs, they changed my # 18 times, the last time, they just deleted me off their app, even though I was paying them. Please find another solution. These guys suck!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dee Lynn",
          "Nb_Reviews": 4,
          "Date": "2022-11-05T12:58:16.000Z",
          "Titre": "ANTI-AMERICAN COMPANY - DO NOT USE",
          "Contenu": "WOW....I should have looked at this site and this company's reviews before purchasing. Well TextNow, good luck because you are going to need it and I AM RELENTLESS!!!!! I just paid the 4.99 to have my phone be able to accept sms code texts after signing up only 1 week ago. I have been flooded with your ads and the app would crash constantly, but  really did not have a choice of what to do right now because I just got off the street from being homeless 3 months. Your company was my bridge to my new phone with service from a local provider. Obvioulsy, you dont give a crap about people trying to get on their feet and  will be posting this on TrustPilot and Google Play as soon as I am done here. I did  violate any damn terms and I want my 4.99 returned to my card asap or the next step will be the . Your company is a scam. How many peope do you convince to upgrade to the sms ability which BTW, does NOT work 2/3 of the time and is seen as a VOip and not accepted. Then you harass people continuously to get the sim card or upgrade the plan. It is harassment. Once someone ignores your constant ads and pop ups to do the above, you disable their account. Say goodbye to your company and hello to a class action suit. The FCC will investigate your disabled accounts. How dare you!!This was my lifeline in between the \"rock bottom\" and getting on my own two feet and you decided to take it away for no reason. Why dont you share the information you feel is a problem with the user before disabling them?? Companies that I have applied to have this as my contact number. You are ANTI-AMERICAN and need to lose your abillity to do this to other ppeople struggling in this economy. Good luck jerks, you will need it!!!!"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "There",
          "Nb_Reviews": 1,
          "Date": "2024-01-01T21:17:48.000Z",
          "Titre": "I cannot have any identification codes…",
          "Contenu": "I cannot have any identification codes sent to my text now number, because you guys charge for access"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Fred",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T22:15:31.000Z",
          "Titre": "Canadians can't get sim cards for use in US",
          "Contenu": "I used the service in Canada and it is working fine on Wifi.  However, I am going to the US for the winter and wanted to use the sim card in the US. When I try to pay for the sim card using my Visa which works fine in the states, the system has no way to put in a Canadian billing address so card is rejected.  I managed to chat with their representative with difficulty.  Their response was I need a US billing address.  A supposed Canadian company that discriminates against Canadian Snowbirds."
        },
        {
          "Note": 2,
          "Lieu": "MX",
          "Pseudo": "Planificacion Urbana SIG",
          "Nb_Reviews": 1,
          "Date": "2022-03-14T01:48:53.000Z",
          "Titre": "Suspicious, but good, though",
          "Contenu": "Well, I am not really, completely against this service I have had no problem after several years of nice and free service with my own phone number and area code using any available internet connection. BiG however, there is no real customer service desk for support. The best you can have is a tutorials page. That’s very suspicious. Is this a kind of laundry or phishing platform?"
        },
        {
          "Note": 2,
          "Lieu": "NI",
          "Pseudo": "Sergio Arana",
          "Nb_Reviews": 1,
          "Date": "2023-02-03T05:14:47.000Z",
          "Titre": "I paid for a year to keep my number",
          "Contenu": "I paid for a year to keep my number, then on following year, I was charged without notice for the renewal, then 15 days later, my service was suspended and they just won't talk to me nor refund my money. They said, I violated their terms of service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jenna Phelan",
          "Nb_Reviews": 1,
          "Date": "2022-05-05T22:22:01.000Z",
          "Titre": "textnow serves its purpose but beware!",
          "Contenu": "textnow serves its purpose. its free so able to call or text but its not very reliable. sometimes wont receive missed calls, texts or voicemails til after a couple days. their phones work fine for about 3 to 6 months before stuff starts going wrong with. freezing, glitching and/or not charging properly. Logging in to your acct can be a pain. and of course no refunds nor replacements are given and insurance is not available. the updated sim cards that they send you every year doesnt always work and that in itself is a process because your phone became locked and they have to get in touch with your carrier to unlock your phone. the good thing about it, is that you can download onto laptop, computer, tablet, any phone, so if yours breaks, theres still a way to access your messages if you have either of those electronic devices. The biggest issue is having to replace your phone every year because it will not last through the years. Thats where they are making their money. overpriced phones that dont even last a year. Ive used them for about 3 yrs now and for me personally, its been useful and helped alot but i dont like how im having to replace my phone about every 6 months. and i wish they would provide insurance"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Donna Larry",
          "Nb_Reviews": 1,
          "Date": "2018-08-24T20:10:03.000Z",
          "Titre": "The service is okay but the customer…",
          "Contenu": "The service is okay but the customer service is terrible.  You can't get ahold of a person and their numbers just lead to recording with directions to use the app."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Marcel Cuera",
          "Nb_Reviews": 1,
          "Date": "2021-08-16T01:07:41.000Z",
          "Titre": "I been trying to chat with support i…",
          "Contenu": "I been trying to chat with support i want a return i purchase the lock number option but i made a mistake and i cancelled litteraly 5 minutes after so can i get my 5$ back please"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mike S",
          "Nb_Reviews": 2,
          "Date": "2020-07-05T15:26:58.000Z",
          "Titre": "Phone I can't Use & My phone number to be cancelled",
          "Contenu": "I had been a TextNow customer for a few years and was very happy with their service.  On Apr 16 2020 I purchase a new phone through TextNow because I needed 32G of memory.  I noticed a few \"glitches\" when making and/or receiving calls. Since the quarantine, I started using my phone more often.  This is when the \"glitches\" became more of an issue.The first week in June I contacted the on-line support and we spent several hours  trying to resolve the problem.  I was later told that the engineers found that the phone (which I bought from TextNow) was not compatible on the TextNow network.Jun 18th I went to Best Buy to find a new carrier.  I decided on ATT.  The tech inserted the new sim into the phone (from TextNow) and went through the activation process.  For some reason the phone that I was assured was unlocked was locked onto a Sprint tower.The phone was re-set to factory settings but still unable to activate it. After many calls I discovered that the phone was locked by Boost Mobile. I was forced to purchase a new phone.On June 19, 2020 I sent a letter to TextNow at your San Francisco office requesting guidance on return the phone that I could not use.  To date no reply.Today I received an email from TextNow saying that my phone number was going to be deleted unless I send a message to TextNow.  That is impossible to do since you don't have any direct phone line that can be used."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Christina",
          "Nb_Reviews": 2,
          "Date": "2018-08-21T20:58:47.000Z",
          "Titre": "The service is slow and I don't like…",
          "Contenu": "The service is slow and I don't like how you have to send text messages."
        },
        {
          "Note": 3,
          "Lieu": "ZA",
          "Pseudo": "Leo",
          "Nb_Reviews": 1,
          "Date": "2024-01-09T22:12:41.000Z",
          "Titre": "Usually TextNow allow sending of images…",
          "Contenu": "Usually TextNow allow sending of images but it doesn't work anymore. I think you should try to reconsider it. Apart from that, i feel cool with the app"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "KaheaazAKALadyAqua",
          "Nb_Reviews": 1,
          "Date": "2024-01-01T08:11:58.000Z",
          "Titre": "I LOVE TEXTnow although I would like to…",
          "Contenu": "I LOVE TEXTnow although I would like to request that my username be modified. This is the only flaw that affects me. Other than that I appreciate the services and am proud to be a TEXTnow consumer. Thanks so much!! Love and Aloha,Kaheaaz"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Webb",
          "Nb_Reviews": 1,
          "Date": "2024-01-10T00:58:32.000Z",
          "Titre": "Offer annual phone numbers",
          "Contenu": "Offer annual phone numbers, like you did earlier"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "LaShawn",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T03:33:37.000Z",
          "Titre": "TextNow app is great!",
          "Contenu": "I like that the unlimited talk and text are free, but only if you have Wi-Fi connection. However, sometimes my calls drop and the text message that I started disappears. Also, my calls aren't always audible.."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Vinay Burman",
          "Nb_Reviews": 5,
          "Date": "2023-12-19T22:18:22.000Z",
          "Titre": "Besides too many ads",
          "Contenu": "Besides too many ads, it's a good app for calling texting. I have been using it for years and it was much cheaper to get rid of all ads at a very low monthly of around $2.00 a month but now they ask about 30-35 dollars per month. That's way out of line. I only pay $7.00 a year for locking my number but never bothered to get rid of annoying ads. But overall its good for me to use as second phone. New customers may find it expensive to even lock the number."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Makeba",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T17:19:35.000Z",
          "Titre": "I like that I can use it to make calls",
          "Contenu": "I like that I can use it to make calls, but I don't like that he calls are always breaking up and dropping. I don't like that the Internet is going in and out even when you have wifi."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "AW",
          "Nb_Reviews": 5,
          "Date": "2023-12-14T23:20:41.000Z",
          "Titre": "It is free",
          "Contenu": "It is free. But the company may randomly suspend your number for no reason. It does work as advertised."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Donald",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T22:40:13.000Z",
          "Titre": "Good and bad",
          "Contenu": "I loved the service but I lost my SIM card and couldn’t get anyone to help.  If I needed to buy one or if they could have replaced it either way would have been nice to know.  But if you don’t pay for the service it’s works most of the time"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anthony",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T03:35:05.000Z",
          "Titre": "All I need new damn Sim card to do is buy a new Sim card",
          "Contenu": "All I need to do is buy a new Sim card.   Why can't I get a link to do this, I asked to speak to a rep still nothing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stan",
          "Nb_Reviews": 1,
          "Date": "2022-05-25T22:09:30.000Z",
          "Titre": "Good value if you use it for free. But I had a problem",
          "Contenu": "Good value if you use it for free service. Unfortunate I ran into a problem in trying to setup my phone. With the new sim for wifi calling I ran into a problem. I went to the support web page but it did not cover the problem I had.  I search everywhere on their website but was unable to find any way to report my problem. No email or phone support. So if your problem is not covered in their support page you won't be able toget an answer from them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JUANELL",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T22:51:37.000Z",
          "Titre": "It doesn't always work",
          "Contenu": "It doesn't always work. Sometimes it works great but it can stop out of nowhere"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "TrustedReviewer",
          "Nb_Reviews": 11,
          "Date": "2023-03-25T19:03:18.000Z",
          "Titre": "Used them for about 5 years",
          "Contenu": "Used them for about 5 years, doing browser-only (no app) calls and texts for $10/mo. Generally worked ok until last month when my number disappeared. I can still log in but the first thing it wants is for you to select a new number"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gaje Nes",
          "Nb_Reviews": 2,
          "Date": "2022-04-05T16:56:39.000Z",
          "Titre": "It is a very convenient way of calling…",
          "Contenu": "It is a very convenient way of calling and texting when i dont want just anyone with my mobile number. Though it is very laggy recieving text messages and calls."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Wyatt Seungri Baek",
          "Nb_Reviews": 13,
          "Date": "2020-10-27T00:30:09.000Z",
          "Titre": "TextNow",
          "Contenu": "TextNow, is meh. It is a good app, but there are a few problems, which are ADS, SPAM, and TERMINATION.I haven't checked my TextNow phone number for a week or so, and suddenly I have 40 SPAM phone number calls. There are also ADS on the free plan.If you're not active, your number can get TERMINATION, as I read from a text message I got. It could be spam, though."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "SOUTHERN CALIFORNIA",
          "Nb_Reviews": 2,
          "Date": "2021-05-22T01:12:57.000Z",
          "Titre": "Try it, what's the worst that could happen? It's free!!!!!",
          "Contenu": "While text app is free, it only works with wifi. If that's all you need, i.e. at your house, Starbucks, or any fast food restaurants your golden. I haven't paid a phone bill in 3 years but I'm not glued to phone like some other robots in our society. If your looking for a non existent phone bill and occasionally wifi outside your house then I recommend this app. Sometimes the audio can be choppy but just find that sweet spot and your good. I text 95% of the time so it works great. Just depends what type of phone user you are. BUT if you fall into my catagory then your straight. I'd recommend depending on what you use it for. Definitely will save you money."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mallorie",
          "Nb_Reviews": 2,
          "Date": "2023-03-08T05:04:47.000Z",
          "Titre": "HORRIBLE/TERRIBLE CUSTOMER SUPPORT !!",
          "Contenu": "I DO NOT like the fact that you can not talk to a human and your support chat is HORRIBLE and needs to be fixed immediately..... when troubleshooting the question you asked is NEVER properly answered and they give you a list of info you neither asked for or needed .... something needs to be done quickly because its extremely frustrating when you're trying to get and receive answers or help   There has to be a better way and the customer support people that are trying to help you need better and more extensive training bc i just need help with the audio on my voicemail messages when i hit the play button the message just plays when the speaker is not even on and i can't turn the volume of the speaker off nor can i turn the speaker off so can someone PLEASE HELP ME w/this issue bc its very frustrating i don't want everyone listening to and hearing my voicemail messages."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David A. Dunham",
          "Nb_Reviews": 1,
          "Date": "2020-05-25T03:35:39.000Z",
          "Titre": "Missed Calls!!!",
          "Contenu": "Only problem we have had ( the wife and I ) is half the time we miss calls due to our phones not ringing?  We both purchased a Motorola E5 from Text Now."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Luca Stone",
          "Nb_Reviews": 2,
          "Date": "2021-07-29T10:26:46.000Z",
          "Titre": "lost my number and couldn't find any…",
          "Contenu": "lost my number and couldn't find any support."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Bob",
          "Nb_Reviews": 1,
          "Date": "2024-01-09T23:13:00.000Z",
          "Titre": "Great app ,,Works well",
          "Contenu": "Works well , both Text and voice. I would say it is very good for a FREE service. I can up with the ADs as I use it for texting APPLE devices with their proprietary IMESSAGE app. There is a lag in the audio when you first make a call and I have had a few calls dropped because of lack of a confirmed Hello... Anyway good app."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Al Cantwell",
          "Nb_Reviews": 2,
          "Date": "2024-01-09T21:55:20.000Z",
          "Titre": "Could be better",
          "Contenu": "Used to be able to send images and voice mail but can't do that anymore, otherwise I would give it 5 stars."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Kathleen",
          "Nb_Reviews": 1,
          "Date": "2024-01-09T22:53:01.000Z",
          "Titre": "Voice",
          "Contenu": "Alli g a number other person can't hear me o. My end but I can hear that person speaking"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JH",
          "Nb_Reviews": 2,
          "Date": "2024-01-09T22:00:57.000Z",
          "Titre": "Easy and convienient",
          "Contenu": "Texnow is easy to use. Makes texting from the computer useful and simple."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "HongJun Lin",
          "Nb_Reviews": 43,
          "Date": "2023-06-06T14:27:55.000Z",
          "Titre": "Not bad for use as subscriber.",
          "Contenu": "I use this service for more than 2 years and subscribed it for the second year. It's a good phone number provider in the past, however, they cancelled notification via email. Hope they can add it back in the future."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "devan collins",
          "Nb_Reviews": 2,
          "Date": "2022-07-14T20:34:47.000Z",
          "Titre": "Curious about how intelligent the…",
          "Contenu": "Curious about how intelligent the average person is? Look no further than an online review sites comment section about a free app. In this world common sense and critical thinking don't matter and self entitlement levels are so high the people who are the most intentionally ignorant won't understand any of this.On to TextNow.It's a free app. It is able to afford to operate on T-Mobiles network thanks to an abundant amount of ads displayed on the app at all times, and from customers who pay to have said ads removed from their app. In order to send and receive free calls and texts, even with a TextNow sim, you must use the TextNow app to send and receive calls and texts. This means you will not use the default phone app or text message app that came pre-installed on your iphone or Android device.If you are having issues sending or receiving calls or texts while not connected to a wifi network and have their sim card, this is an issue with your signal strength on the T-Mobile network or incorrect APN settings. Both are clearly mentioned prior to setting up an account or paying for a sim.TextNow is a personal data harvesting, cheaply coded app loaded with trackers hell-bent on nothing more than profiting off selling every bit of personal and geographical location information they can get from you, but their app and services work as advertised. You should probably work on your critical thinking and google search skills if you're here calling them a scam."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sugarcube",
          "Nb_Reviews": 13,
          "Date": "2023-07-29T00:03:35.000Z",
          "Titre": "Useful as a secondary/backup VoIP number.",
          "Contenu": "I've been using TextNow for over 2 years now, and while I'm not a fan of all of all of the updates they've had in the last 6 months (such as the update to block ad blockers from working on the app and the major increase in pricings of their in-app purchases), I understand it and am thankful that my account's subscription is stayed the same price due to the grandfather clause.TextNow has been very useful as a secondary and backup VoIP number for me to use for years now, and for that, I'll remain a subscriber for as long as I'm grandfathered."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T06:57:55.000Z",
          "Titre": "Just wish my SIM card would work on any…",
          "Contenu": "Just wish my SIM card would work on any cell phone."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "akra",
          "Nb_Reviews": 15,
          "Date": "2019-09-25T16:45:56.000Z",
          "Titre": "Good to use",
          "Contenu": "Good to use. But when having a call, the voice is a quite low from other side.I hope more improvements. Do not stay at one place!"
        },
        {
          "Note": 5,
          "Lieu": "VN",
          "Pseudo": "There",
          "Nb_Reviews": 1,
          "Date": "2024-01-10T06:08:04.000Z",
          "Titre": "I live overseas and this app has been a…",
          "Contenu": "I live overseas and this app has been a lifesaver for receiving authentication codes and for communicating with USA companies and friends.  I have referred this product to others too. The one issue I recently encountered is I can’t reply to text messages anymore.  I get an error indicating I am not a human and I have yet to find a solution.   Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lynell Smith Jones",
          "Nb_Reviews": 2,
          "Date": "2024-01-09T22:49:27.000Z",
          "Titre": "TextNow is FREE and Reliable",
          "Contenu": "TextNow provides me with outstanding phone service when my budget is tight. I'm able to keep a working phone number available for use like a paid service only it's absolutely FREE."
        },
        {
          "Note": 5,
          "Lieu": "DO",
          "Pseudo": "Pierre Didley Etienne",
          "Nb_Reviews": 1,
          "Date": "2024-01-09T23:05:05.000Z",
          "Titre": "The absolute best",
          "Contenu": "This is the best free phone company that I know.I have been using it for years, sometimes you may not be able to receive passcodes in the basic plan.If it is available in your region and you're trying to call or text US and Canada, I can't imagine a better app to do that."
        },
        {
          "Note": 5,
          "Lieu": "DO",
          "Pseudo": "Julian Roa",
          "Nb_Reviews": 3,
          "Date": "2024-01-10T00:39:59.000Z",
          "Titre": "Reliable",
          "Contenu": "Reliable, confidential and personal services. And don't let me get started on the prices, is bonkers to be able to get so much for so little. Definitely love the services."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay A. Moses",
          "Nb_Reviews": 1,
          "Date": "2024-01-09T23:49:56.000Z",
          "Titre": "Who doesn't like free",
          "Contenu": "Whom doesn't like free? Surely not I. Text now is like gravity or pain... Always there for me. Consistency counts. I believe text now is great because it has always been there for me regardless? Thank you is what I am saying. Jay Moses"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debbie",
          "Nb_Reviews": 1,
          "Date": "2024-01-10T00:40:50.000Z",
          "Titre": "I think TextNow is a great phone to…",
          "Contenu": "I think TextNow is a great phone to have i have been with them for 4yrs,I haven't had any trouble with them, I would recommend them to anyone for a great service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "WriThatDwn",
          "Nb_Reviews": 2,
          "Date": "2024-01-09T22:51:06.000Z",
          "Titre": "An excellent source of use for variety…",
          "Contenu": "An excellent source of use for variety of many things. Works great acts well very convenient. Perfect for all needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kimberly Jacobs",
          "Nb_Reviews": 3,
          "Date": "2024-01-09T22:05:23.000Z",
          "Titre": "I am in the hospital and TextNow has…",
          "Contenu": "I am in the hospital and TextNow has enabled me to communicate with my family from my tablet. It is extremely efficient and the call quality is fantastic!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "SA",
          "Nb_Reviews": 2,
          "Date": "2024-01-10T12:02:48.000Z",
          "Titre": "Love this service",
          "Contenu": "Love this service. It helps me become more accessible with a local phone number when I travel to the US."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "There",
          "Nb_Reviews": 1,
          "Date": "2024-01-10T02:14:13.000Z",
          "Titre": "Great app",
          "Contenu": "Love the app but don't like the need to pay to receive confirmation calls and texts."
        },
        {
          "Note": 5,
          "Lieu": "DO",
          "Pseudo": "Jose De La Cruz",
          "Nb_Reviews": 1,
          "Date": "2024-01-09T22:38:52.000Z",
          "Titre": "is anbelievanble",
          "Contenu": "it is a great company, a very well and axcelentmn way of comunication"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anya",
          "Nb_Reviews": 1,
          "Date": "2024-01-10T06:23:06.000Z",
          "Titre": "Service grate to call in other state",
          "Contenu": "Service grate to call in other state, country. Easy to use and with out problems I use it for couple years."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Lowe",
          "Nb_Reviews": 1,
          "Date": "2024-01-10T00:46:23.000Z",
          "Titre": "Excellent app",
          "Contenu": "Excellent app , what a great service with no problems!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "There",
          "Nb_Reviews": 1,
          "Date": "2024-01-09T23:25:09.000Z",
          "Titre": "Reliable service",
          "Contenu": "Have used text now for over 3 years always a reliable way of open communication especially helpful in my job searches and staying in communication with doctors appointments n stuff !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Max",
          "Nb_Reviews": 1,
          "Date": "2024-01-10T00:45:33.000Z",
          "Titre": "Great App!",
          "Contenu": "Very good app. You have to remember to make a call every week so you don't loose your number. Great 2nd line."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Balouch",
          "Nb_Reviews": 1,
          "Date": "2024-01-09T22:27:22.000Z",
          "Titre": "Bus virtual phone number I have ever used",
          "Contenu": "This app is literally amazing.Love using textnow"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lela",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T03:44:40.000Z",
          "Titre": "Anytime & Anywhere",
          "Contenu": "TextNow has giving me the opportunity to stay in touch with my loves ones. Anytime and anywhere on any device I'm able to have a line of communication with Important doctor calls business calls and even with jobs. TextNow has been an great experience overall is number #1.Thanks!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "There",
          "Nb_Reviews": 1,
          "Date": "2024-01-09T21:54:53.000Z",
          "Titre": "Just to be able to use it anytime…",
          "Contenu": "Just to be able to use it anytime anywhere i go"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Claude",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T01:53:41.000Z",
          "Titre": "Simply the bestt",
          "Contenu": "Really wonderful especially when we are abroad; it is possible to send a message from anywhere in the world to Canada and the United States. also phone calls can be made from anywhere in the world to Canada and the United States. The quality was exceptional."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Hamid",
          "Nb_Reviews": 3,
          "Date": "2024-01-09T23:07:15.000Z",
          "Titre": "Great app",
          "Contenu": "Great app, very simple to use and reliable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Raquel Alexander",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T21:44:03.000Z",
          "Titre": "This is the only phone service that is…FREE",
          "Contenu": "This is the only phone service that is truly $0... all others I need to pay for data to get phone service. We travel to the US from abroad often and TextNow makes it really easy to deactivate/reactivate whenever we are here, and buy small amounts of data if needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shannon",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T22:53:11.000Z",
          "Titre": "Great experience with TextNow!",
          "Contenu": "Every company has a few bugs, however I have been using the free TextNow for around 4 years now. Works great for me. Ads are short. Don't have any real complaints. Rarely is there ever a problem with the service. I actually can't remember the last time there was a hiccup. I always recommend to everyone. Why pay hundreds of dollars when you can get free and low cost phone service with TextNow!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "There",
          "Nb_Reviews": 1,
          "Date": "2024-01-10T01:31:05.000Z",
          "Titre": "It's a great app for people who don't…",
          "Contenu": "It's a great app for people who don't have minutes on there phone."
        },
        {
          "Note": 5,
          "Lieu": "BW",
          "Pseudo": "Petrona",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T09:45:09.000Z",
          "Titre": "TextNow is highly reliable and cost effective.",
          "Contenu": "Why TextNow? It ranks above the rest. This company delivers very good service and is always available for dealing with any technical issue that arrises within a minute."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Mia",
          "Nb_Reviews": 1,
          "Date": "2024-01-09T22:54:23.000Z",
          "Titre": "Comes in handy when you are on a fixed…",
          "Contenu": "Comes in handy when you are on a fixed income."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adelaida",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T16:26:41.000Z",
          "Titre": "Life after textnow",
          "Contenu": "Yes, this company is working out great for me . I have WiFi at home . I'm sick I got sick n knocked out of work .n this helps a lot with the doctor appointment s .I'm in Los Angeles so it's beyond helpful for my safety and peace of mind during this ruff time . I do utilize the wifi when needed .this is perfect for people transitioning from work health into disability.if I live .. I pray I do ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "barry williams",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T13:32:32.000Z",
          "Titre": "I'm disable and live on a fixed income…",
          "Contenu": "I'm disable and live on a fixed income so I appreciate TEXTNOW for giving free phone service. Thank you TEXTNOW. Happy Holidays."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "There",
          "Nb_Reviews": 1,
          "Date": "2024-01-09T21:58:08.000Z",
          "Titre": "It’s very helpful when you need it…",
          "Contenu": "It’s very helpful when you need it great app"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Mo",
          "Nb_Reviews": 1,
          "Date": "2024-01-10T00:59:16.000Z",
          "Titre": "Reliable and user-friendly",
          "Contenu": "It's 100% user-friendly and you can rely on app."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Quang",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T00:11:08.000Z",
          "Titre": "Very practical.",
          "Contenu": "It is very practical for me because I need 2 phone numbers and if there is something wrong I still have another one."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rickie Jamesworth",
          "Nb_Reviews": 1,
          "Date": "2023-12-28T00:43:36.000Z",
          "Titre": "Excellent App and works wonderfully",
          "Contenu": "Excellent App and works wonderfully! Have been using it for many years."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Labonte",
          "Nb_Reviews": 2,
          "Date": "2024-01-09T22:27:45.000Z",
          "Titre": "Great to have in an emergency.calls …",
          "Contenu": "Great to have in an emergency.calls  are clear."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Andre Vivar Balderrama",
          "Nb_Reviews": 2,
          "Date": "2024-01-09T22:00:05.000Z",
          "Titre": "Wow perfect services"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2024-01-09T22:56:31.000Z",
          "Titre": "best 2nd number phone",
          "Contenu": "I WISH THOSE ADS CAN BE REMOVED"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "There",
          "Nb_Reviews": 1,
          "Date": "2024-01-09T21:53:38.000Z",
          "Titre": "You guys are amazing"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Goaliedave",
          "Nb_Reviews": 2,
          "Date": "2024-01-09T21:57:37.000Z",
          "Titre": "Works great",
          "Contenu": "Works great, clear calls, texts fine, thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob V",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T23:39:56.000Z",
          "Titre": "Usage with wifi",
          "Contenu": "95% of my usage is in areas where wifi is available so I have unlimited access for no cost"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gene Finz",
          "Nb_Reviews": 2,
          "Date": "2023-12-28T00:39:09.000Z",
          "Titre": "Great app!",
          "Contenu": "Great app!  Alll the features of a cell phone on a second phone number provided free by TextNow!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "There",
          "Nb_Reviews": 1,
          "Date": "2024-01-09T21:57:36.000Z",
          "Titre": "The service is great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Addison",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T01:37:10.000Z",
          "Titre": "Free",
          "Contenu": "Free, and has great coverage. It’s not the best coverage but it’s above and beyond what you’d expect for free."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nikki",
          "Nb_Reviews": 1,
          "Date": "2023-12-29T18:05:17.000Z",
          "Titre": "Thank you for unlocking our account",
          "Contenu": "Thank you for unlocking our account.  We love the App!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edward",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T23:34:39.000Z",
          "Titre": "I've been with textnow since 2013",
          "Contenu": "I've been with textnow since 2013. They've ALWAYSprovided prompt & exellent service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer val",
          "Nb_Reviews": 2,
          "Date": "2024-01-05T21:45:22.000Z",
          "Titre": "text now has been and as is now great…",
          "Contenu": "text now has been and as is now great network"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "There",
          "Nb_Reviews": 1,
          "Date": "2024-01-10T00:52:18.000Z",
          "Titre": "I been with text now than 5 year"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Natalie Keys",
          "Nb_Reviews": 2,
          "Date": "2022-07-15T07:46:48.000Z",
          "Titre": "Great creative writing tool!",
          "Contenu": "The only reason I know about “TextNow” is because I have been getting texts from random numbers asking me to continue our conversation on WhatsApp. Each time, there is a “oh this must be a wrong number” moment, and that’s when I take the conversation in whatever ludicrous direction I choose. It’s like a reverse prank call, but the initiators are the target, you should try it, it’s a great creative writing prompt. Seven stars. Scammers: don’t give up! I’m really excited to support you financially!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Big D",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T00:22:47.000Z",
          "Titre": "TextNow's free phone service is awesome",
          "Contenu": "TextNow's free phone service works great and is super useful. I can't believe there's a truly free talk and text service out there that gives you a phone number! I'm not sure why I EVER paid for phone service before."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michelle",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T09:28:35.000Z",
          "Titre": "Great service",
          "Contenu": "Great service. I'm homebound so why pay for cell service when you can get everything for free via WiFi."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Sanjay",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T01:17:04.000Z",
          "Titre": "Never down",
          "Contenu": "Never down, Clear sound from both ends, texting capabilities. Best!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Nelson",
          "Nb_Reviews": 88,
          "Date": "2022-06-17T19:28:48.000Z",
          "Titre": "Love the wireless plan, couple improvements could be made",
          "Contenu": "The wireless plan where Textnow partnered with T-Mobile is great. I used to use RepublicWireless but Textnow Wireless is far cheaper and has just as good if not better coverage.It would be nice if the Texnow app would allow us to schedule texts like my old default messenger app would. Also would be nice if we could search through conversations on Textnow app.Keep up the good work guys!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "ThereRaj",
          "Nb_Reviews": 1,
          "Date": "2024-01-10T00:00:30.000Z",
          "Titre": "Good service",
          "Contenu": "Every thing is good so far"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob Sarasota",
          "Nb_Reviews": 3,
          "Date": "2022-05-08T03:29:26.000Z",
          "Titre": "Great app - free of monthly plans and lies",
          "Contenu": "Don't need major carriers anymore! Overrides locked sim cards that force you to buy monthly plans. Good connections and easy set-up! Finally free from contracts, minutes used, and sales offers. Forget about Tracfone - they are dishonest and advertise:\"no monthly plans, no contracts and no surprises\" - THEY LIE!! All the major carriers will charge fees for monthly plans. My phone from Tracfone sim card was locked, but TextNow set me up with a phone number and everything I need for FREE! Best service for escaping  all the scam carriers. Emancipated from Tracfone and their false advertising. Amen."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "john",
          "Nb_Reviews": 1,
          "Date": "2024-01-09T21:57:04.000Z",
          "Titre": "works good everytime i use it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "The Great One",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T03:32:52.000Z",
          "Titre": "Great service",
          "Contenu": "Great service. I would recommend anyone to use the service"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Joseph",
          "Nb_Reviews": 2,
          "Date": "2024-01-09T22:33:13.000Z",
          "Titre": "Excellent service",
          "Contenu": "Very good app and few ads"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "The MasteR",
          "Nb_Reviews": 1,
          "Date": "2024-01-09T22:10:50.000Z",
          "Titre": "OutStandinG. Marvelous! Simply Marvelous!",
          "Contenu": "OutStandinG!  Marvelous! Simply Marvelous!"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Tony",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T22:58:28.000Z",
          "Titre": "The best way to get a phone number with…",
          "Contenu": "The best way to get a phone number with all its features and so fast"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Sam Ahad",
          "Nb_Reviews": 1,
          "Date": "2024-01-10T02:26:07.000Z",
          "Titre": "It's a good free servece."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Garth",
          "Nb_Reviews": 1,
          "Date": "2023-12-28T01:35:56.000Z",
          "Titre": "Excellent text and phone service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Suezette",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T15:42:49.000Z",
          "Titre": "It's better than a monthly plan and…",
          "Contenu": "It's better than a monthly plan and it's best app phone service ever"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike /NAJ Resources Grp",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T01:02:09.000Z",
          "Titre": "Great to have as a back up or 2nd line",
          "Contenu": "Been with Text Now for years and great company and very web friendly to use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Judylynn Larson",
          "Nb_Reviews": 1,
          "Date": "2020-02-15T21:55:24.000Z",
          "Titre": "Text now is a good app just don't go…",
          "Contenu": "Text now is a good app just don't go premium it's a joke they have no problem taking your money every month . but when you are having problems there support team is a joke I have literally spent countless days for months on end to get issues resolve hopping to keep there service costed me 29.99 for at least 4 months now I haven't been able to use my phone service and I've been a customer for going on three years . I finally canceled my premeum service just today . I'm really disappointed that they COULDENT FALLOW threw with helping me keep there service . why they don't have a live operator to help walk you threw there glitches I have no idea except they just don't want to be bothered with keeping there loyal customers . But if I were Text now I'd fire the INTIRE suppost team they have now and replace them with real technical support along with an operating phone line for customer service and technical support system . As it is right now it a a huge waist of money and a sham to boot ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessica Chauvin Jessie Mae",
          "Nb_Reviews": 2,
          "Date": "2024-01-02T01:09:14.000Z",
          "Titre": "I love TextNow"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valene",
          "Nb_Reviews": 1,
          "Date": "2023-12-28T04:43:57.000Z",
          "Titre": "It's very useful",
          "Contenu": "It's very useful, free and great communication."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harry",
          "Nb_Reviews": 3,
          "Date": "2019-10-22T03:09:38.000Z",
          "Titre": "Account Number and Pin",
          "Contenu": "I am using two textnow numbers. One is premium and the other is not. I wanted to switch one number(non-premium) to other provider.I want to keep the premium with textnow. When I contact the customer care about porting.. I am told that new provider has to send them an email asking my account and pin(which is very unlikely they would). The other service provider said that its me who should get it from TextNow. Its pity that TextNow is asking me to run around. Its simple they have my details and they should give it to me.New Post:Thanks for the support.. Got my Account number and Pin. Waiting for the port out."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shanna",
          "Nb_Reviews": 5,
          "Date": "2024-01-10T04:26:54.000Z",
          "Titre": "Great very good"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "tim",
          "Nb_Reviews": 1,
          "Date": "2023-12-28T04:38:56.000Z",
          "Titre": "great service"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Michel H.",
          "Nb_Reviews": 2,
          "Date": "2024-01-09T21:54:50.000Z",
          "Titre": "Simple to use."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "There",
          "Nb_Reviews": 1,
          "Date": "2024-01-09T23:01:31.000Z",
          "Titre": "good",
          "Contenu": "very goodlike"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cathy Carter",
          "Nb_Reviews": 1,
          "Date": "2024-01-09T23:20:06.000Z",
          "Titre": "Excellent App"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "There",
          "Nb_Reviews": 1,
          "Date": "2023-12-28T03:06:53.000Z",
          "Titre": "everything is perfect"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "sON",
          "Nb_Reviews": 2,
          "Date": "2023-12-28T00:40:34.000Z",
          "Titre": "Awesome",
          "Contenu": "Pretty much excellent"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Brabhan",
          "Nb_Reviews": 1,
          "Date": "2022-04-10T13:27:27.000Z",
          "Titre": "HAPPY 8 YEAR CUSTOMER !",
          "Contenu": "WOW ! Whats with all the negative stuff ? I have used this service for over 8 years on and off. I did something years ago and lost service, it happens. I currently use them and yes there are ads. I have to wait sometimes a whole 20-30 seconds boo-hoo I want my mommie !Its a FREE service folks dont you get it. how do they do it ? thats shady ? THEY MAKE MONEY FROM SPONSORS ! just like on TV commercials ( same thing )Id give 10 stars if I could."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Oljas",
          "Nb_Reviews": 3,
          "Date": "2020-07-31T14:12:57.000Z",
          "Titre": "Awesome service",
          "Contenu": "Awesome service. I got local Halifax number for my building buzzer. Works great, no issues so far."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julian",
          "Nb_Reviews": 5,
          "Date": "2018-05-16T21:40:17.000Z",
          "Titre": "Improved service and better call quality",
          "Contenu": "Well in the past 2 or 3 years ago I tried textnow cellphone services and I must admit call quality was horrible most of the time over wifi or cellular data,then on may of 2018 I tried again TextNow knowing they are a VoIP cellular company with an older phone I had,for my surprise this time call quality seems to be great,maybe when switching from wifi to data while in a call could be a little degradation in quality but in my case I use most of the time data minutes and call quality is impressive since they use sprint I think they redirect the call thru sprint real time minutes.also over a good strong wifi calls are good as expected.I think TextNow improved their services for good.also they are selling simcards to use their services thru att or T-Mobile I think this is another great plus.also the plans are very reliable and convenient starting at $9.99 for unlimited talk and text in my opinion the only company that gives that price for only taking and texting for people like me that does not need data.in my opinion a good choice for people in a budged but at the same time getting a good and improved quality service.just remember to be sure if using your own hanset or a TextNow one be sure you have a good sprint coverage and when using a simcard choose which the better coverage for you T-Mobile or att.keep going textnow"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jg",
          "Nb_Reviews": 1,
          "Date": "2023-12-28T00:35:08.000Z",
          "Titre": "Always works",
          "Contenu": "Always works. No dropped calls"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Amrik Singh",
          "Nb_Reviews": 4,
          "Date": "2019-11-18T10:13:38.000Z",
          "Titre": "Great Services",
          "Contenu": "TextNow Provides great services for free but site is very heavy load, so minify your coding."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kay Dre",
          "Nb_Reviews": 1,
          "Date": "2020-10-17T08:07:27.000Z",
          "Titre": "Works lovely",
          "Contenu": "Works lovely. I only need it for text messages and it's free. The only thing you need to do is to message regularly or otherwise, you will lose your number. Happened to me a few times:)"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "There",
          "Nb_Reviews": 1,
          "Date": "2024-01-09T21:56:18.000Z",
          "Titre": "Dhcclinic",
          "Contenu": "Excellence"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "MS.drake",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T02:10:06.000Z",
          "Titre": "Awesome to have as a back up",
          "Contenu": "Awesome to have as a back up Five stars 🌟"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Clifford J Barry",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T14:49:00.000Z",
          "Titre": "calls work",
          "Contenu": "allways works when i need it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Drew Constable",
          "Nb_Reviews": 7,
          "Date": "2023-05-15T19:35:17.000Z",
          "Titre": "It is not bad for what it is.",
          "Contenu": "It is not bad for what it is.We use the free service for our elderly neighbor who did not have a cell.  We had a 5-ish-year-old Android phone that was just a paperweight in our house, and we activated it with the $1 sim from the text now.  I also activated one of my old iphones, just to have a backup phone in my workbag.  I purchased the year-long phone number lock for $5 a year.  (I later noticed on my iPhone that it costs about 5$ a WEEK to have that service, so probably not worth it) For a basically free service, I really don't think it is a bad deal, but there are some things to note:-Set up isn't difficult, but does take some time.  I have activated 2 phones on this service, and I would say it took me about 30 mins each time to do so.-While you can pick your phone number (from a group of available numbers) your phone number is NOT LOCKED in unless you pay for an upgrade.  They say that you have to call or text once a day to keep from losing your numbers, but in practice, it is more like one every 3-4 weeks, and they send you a reminder text that you need to use your account.  (you can even log into the app on your personal or primary phone, and text from there to keep it active.)  For these reasons, TextNow is probably not a great business phone solution. Maybe go with Tello as a cheap paid service, or google voice is you have a phone number you can text from and link.    -Texting and Calling is through the TextNow App, NOT the default phone text of calling apps.  -There are ads in the App, but they do not bother me or my neighbor. Data is NOT included, and I believe starts at $10 a month.  This service is best used for someone who can use wifi to access the internet and just needs to talk and text otherwise.  -After using both, in my opinion, I think it works better with my old Android that my old iPhone.  Overall, I think this is a fine service that is probably getting a bad rep just because people do not understand what it is going in. I would rate it 85/100, but I am rounding up to give them some love as their service is great for my neighbor who needed it.   I hope this helps!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Viraf Baliwalla",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T22:33:45.000Z",
          "Titre": "Great tool during travelling."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jimmie",
          "Nb_Reviews": 3,
          "Date": "2018-06-26T07:13:45.000Z",
          "Titre": "One of the best service I ever…",
          "Contenu": "One of the best service I ever received. Free plan is pretty good but if you pay some bucks you 'll get amazing deals I am sure. Thanks TextNow.com"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Prillia",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T22:46:06.000Z",
          "Titre": "Love text now app",
          "Contenu": "The way they care for you is amazing"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "charlotte Miller",
          "Nb_Reviews": 4,
          "Date": "2023-12-18T08:27:22.000Z",
          "Titre": "It’s great",
          "Contenu": "I love my text now account"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Walter",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T08:27:40.000Z",
          "Titre": "Works very well",
          "Contenu": "Works very well. Quality very good."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "lindsey",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T22:23:12.000Z",
          "Titre": "I had a good experience",
          "Contenu": "it was good experience"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Michael J.",
          "Nb_Reviews": 3,
          "Date": "2020-12-03T06:19:19.000Z",
          "Titre": "Had great experience when i needed a…",
          "Contenu": "Had great experience when i needed a temp no. for my personal use. They rock!Would love to use again."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Mac",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T22:03:10.000Z",
          "Titre": "Best customer service",
          "Contenu": "Great quality, great customer support"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ms. Mona",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T01:21:10.000Z",
          "Titre": "TextNow offers clear service."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "There",
          "Nb_Reviews": 1,
          "Date": "2023-12-29T00:59:24.000Z",
          "Titre": "Great",
          "Contenu": "Great when in a pinch"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "electronicGIG",
          "Nb_Reviews": 1,
          "Date": "2023-12-28T03:08:01.000Z",
          "Titre": "It works all the time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph  Cohan",
          "Nb_Reviews": 2,
          "Date": "2023-12-28T00:45:49.000Z",
          "Titre": "Oooh",
          "Contenu": "Idk I'm out later"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J b theria",
          "Nb_Reviews": 2,
          "Date": "2023-12-28T01:13:59.000Z",
          "Titre": "Works well for me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Darnell Slaughter",
          "Nb_Reviews": 3,
          "Date": "2022-08-04T21:57:10.000Z",
          "Titre": "Why can't I delete numbers that i have…",
          "Contenu": "Why can't I delete numbers that i have in my call log?"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jon",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T22:34:20.000Z",
          "Titre": "Works every time it’s needed"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GrayBison",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T02:44:29.000Z",
          "Titre": "Always reliable clear connections."
        }
      ]
    }
  ]
}