{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "tgmodz.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "HAIM",
          "Nb_Reviews": 5,
          "Date": "2023-12-18T17:47:48.000Z",
          "Titre": "They did not want to return the money.",
          "Contenu": "They did not want to return the money.Sellers talk disgustingly.Account upgrade Spotify dont buy! Will work for you only with a new user In any case, I will not buy here so that you will do the same**editingI tried to create a user after me and they did not agree to a refund because in your opinion it is not a valid reason, and again I was removed from the user. I said again if I wanted to buy for a new user I would buy but I did an upgrade which is something else"
        },
        {
          "Note": 1,
          "Lieu": "FI",
          "Pseudo": "samipoikken",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T23:17:26.000Z",
          "Titre": "I ordered spotify lifetime premium and…",
          "Contenu": "I ordered spotify lifetime premium and i got banned to the discord server"
        },
        {
          "Note": 1,
          "Lieu": "SG",
          "Pseudo": "Jing Yi Gao",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T20:47:05.000Z",
          "Titre": "my steam account got stolen by them",
          "Contenu": "Bought two products but only giving malware on my pc! I suggest do not turn off your window defender or antivirus as they told you. Your pc will get infected like mine, my social media account and steam accounts got stolen by them. :("
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tony",
          "Nb_Reviews": 2,
          "Date": "2023-10-28T11:16:26.000Z",
          "Titre": "I did not get a response from anyone on…",
          "Contenu": "I did not get a response from anyone on Discord. I just bought a product without making an account and I lost the ticket they just gave me the discord server no email.  If I got a response I may have a better response."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Fadek Ken",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T20:19:36.000Z",
          "Titre": "I purchased REdengine for a week",
          "Contenu": "I purchased REdengine for a week, upon injecting it i got banned for 14 days. No refund was given either. horrible..."
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "william laugensen",
          "Nb_Reviews": 2,
          "Date": "2023-09-09T19:00:08.000Z",
          "Titre": "They are scammer and don’t give refund",
          "Contenu": "They are scammer and don’t give refund they are the worst don’t buy from them"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "King",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T05:11:57.000Z",
          "Titre": "They scammed me of my money then called…",
          "Contenu": "They scammed me of my money then called me dumb and told me to kms!! I have proof and I’m willing to post it"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Whiteboy_chevy",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T21:24:35.000Z",
          "Titre": "Get banned to easy and wasn't even…",
          "Contenu": "Get banned to easy and wasn't even using aimbot or God mod"
        },
        {
          "Note": 2,
          "Lieu": "NO",
          "Pseudo": "SanderYUP",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T23:23:47.000Z",
          "Titre": "Good stuff but shifty unhelpful support"
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "Laurent",
          "Nb_Reviews": 6,
          "Date": "2023-07-03T09:57:50.000Z",
          "Titre": "Fast service but a little strict on the…",
          "Contenu": "Fast service but a little strict on the rules"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ausissu Susisu",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T17:39:44.000Z",
          "Titre": "very great help from this team!"
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Rayan Rayan",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T18:31:29.000Z",
          "Titre": "m3lz",
          "Contenu": "m3lz. A very good staff who welcomes I recommend 100% guys."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Leva",
          "Nb_Reviews": 2,
          "Date": "2023-06-16T10:57:36.000Z",
          "Titre": "Fine service just abit slow",
          "Contenu": "Would reccomend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "King King",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T06:44:30.000Z",
          "Titre": "The timing was perfect it was simple…",
          "Contenu": "The timing was perfect it was simple and quick response time amazing product 💪❤️"
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Rxztent no",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T20:02:03.000Z",
          "Titre": "Awesome server",
          "Contenu": "Awesome serverspent over $100 everything worked fine, helpful support fast delivery"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jaysom",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T05:03:15.000Z",
          "Titre": "was nervous about it at first as I…",
          "Contenu": "was nervous about it at first as I never bought anything like this but was super smooth and got my menu pretty quick super happy with it and would recommend!!!!"
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Tayyab Khalid",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T12:26:52.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service, and cheap mod menu with great discounts"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "USGAUDF ASFGADGA",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T17:06:41.000Z",
          "Titre": "Spotify Premium Lifetime",
          "Contenu": "Tiago and Tiger bro#6969 were extremely understanding and helpful. Top tier assistance took me step by step. Will be purchasing from here again!"
        },
        {
          "Note": 5,
          "Lieu": "MA",
          "Pseudo": "Omar Jamal El Idrissi",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T21:09:39.000Z",
          "Titre": "AMAZIIIING",
          "Contenu": "10.10 EVERYTHING :DI got Assos & rebound & 2take1 & 3 fresh accounts, everything delivered so quickly and support is helpfulWould buy again most definitely!"
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Bengo Youtube",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T20:11:47.000Z",
          "Titre": "Best of the best!",
          "Contenu": "Best of the best, I see people reacting with bad review because they used the mods the wrong way, its not tgmodz there fault but yours learn how to spoof and dont use free cheats before using premium dummy.+Rep Joy:), Tiger and Mar"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "nook",
          "Nb_Reviews": 8,
          "Date": "2023-06-30T22:35:06.000Z",
          "Titre": "Great customer service 🧸",
          "Contenu": "TG is very quick at providing service when wanting to pay via ticket, PayPal is accepted which most resellers do not offer as well as cashapp. You are sent details of completed order within minutes of purchase! Very nice website/server to purchase from. ❤️"
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Mustang Lamborghini",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T20:35:29.000Z",
          "Titre": "Very fast and efficient administration",
          "Contenu": "Very fast and efficient administration. Very quickly I got an e-mail with a midnight activation code. Overall, don't be surprised that I rate it 5 stars, but they were the best resellers I've ever used and I will definitely use them again!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MollyWater",
          "Nb_Reviews": 2,
          "Date": "2023-10-30T02:34:16.000Z",
          "Titre": "legit, reliable, and fast",
          "Contenu": "bought redEngine, crown, lumina, absolute, and hx thru them; always been fast and immediately recieve product keys after purchase. would reccomend 11/10"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eve",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T20:28:41.000Z",
          "Titre": "Polite and Concise",
          "Contenu": "Staff was very concise and and helpful. Responded almost instantaneously."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jace Johnson",
          "Nb_Reviews": 3,
          "Date": "2023-09-11T04:07:58.000Z",
          "Titre": "Really Great Seller !!",
          "Contenu": "Purchased Twice Here Now. I bought three gta 5 accounts, and they have been great for me. I had an issue with one of the accounts, and almost immediately I got a replacement account, free of charge. I would recommend this shop to anyone because of their great prices too. <33"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Laurent",
          "Nb_Reviews": 6,
          "Date": "2023-07-08T21:41:42.000Z",
          "Titre": "Nfurious for the win",
          "Contenu": "It was a great experience! Nfurious was super fast with responding took like 10 seconds, great service cause i couldnt figure out something with paypal the owner helped me within like a minute keep it up guys!~Thanks to Nfurious,Ves,Tigerbro!"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Waw Tf",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T17:41:36.000Z",
          "Titre": "super fast and straight forward super…",
          "Contenu": "super fast and straight forward super good staff and good response time defo reccomend"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Pcboyisda Ooook",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T20:27:08.000Z",
          "Titre": "I needed to wait a long time cuz it was…",
          "Contenu": "I needed to wait a long time cuz it was out of stock but it wasn‘t the owners fault. Altogether it was a Trusty discord server and siteRecommending it!"
        },
        {
          "Note": 5,
          "Lieu": "NO",
          "Pseudo": "William Bgge",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T16:39:35.000Z",
          "Titre": "Best mod store!",
          "Contenu": "I highly recommend purchasing from tgmodz.com they answer extremely fast and are super kind. I purchased a menu with paypal and got it within seconds!, I won't be using any other store than tgmodz.com from now!."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "YURK -",
          "Nb_Reviews": 2,
          "Date": "2023-08-26T18:58:32.000Z",
          "Titre": "Ive been a buyer since day one and i…",
          "Contenu": "Ive been a buyer since day one and i can say full Heartedly that they deliver 100 percent of the time if u need deals on mods n everything they got your back"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CreamyWeamyPie",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T17:53:50.000Z",
          "Titre": "I bought Rebound Mod Menu",
          "Contenu": "At first The staff and CEO were superhelpful and the paying process was very simple and fast. They almost instantly gave me the key and a day after buying they even gave me a free alt. Amazing services 10/10"
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "abdulfrj",
          "Nb_Reviews": 1,
          "Date": "2023-05-28T12:49:32.000Z",
          "Titre": "Trusted, Easy To Work With, Great Service",
          "Contenu": "Got my information immediately, easy and quick purchase, support was super helpful and quick to inform me about any questions I had. You can trust them with any form of payment. Great seller, will probably buy again!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "MFC",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T14:54:54.000Z",
          "Titre": "Very good",
          "Contenu": "(Payed with Paypal) i Opened a ticked and just 2 minutes it was anwsered buying process was very fast and gread service"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Kilian RHC",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T19:11:20.000Z",
          "Titre": "Incredible",
          "Contenu": "Very kind staffGood review everywhere i recommendLegit and fast !"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Arhaan Nair",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T11:47:03.000Z",
          "Titre": "Got the account details within a minute…",
          "Contenu": "Got the account details within a minute of payment, was a bit confused as to how to go about it, but Tiger Bro from the discord staff team helped me and solved my problems. Really kind staff and trusted"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "loops honorr",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T21:03:54.000Z",
          "Titre": "great experience",
          "Contenu": "Easy no hassle buying process. Get the key within minutes of paying. Would 100 percent recommend. Thx Karla for making payment process easy af."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Connor ODell",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T22:49:20.000Z",
          "Titre": "They helped me out by giving me a replacement and 2 extra accounts.",
          "Contenu": "They helped me out by giving me a replacement rockstar account, but gave me 2 extra as a gift. I would 100% recommend buying from them. \"Giga\" and \"Tiger bro\" were the people that helped me. They sell stuff for extremely cheap, cheaper than any other sellers. I will 100% be back to buy more products."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "semipp",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T14:16:05.000Z",
          "Titre": "Awesome support from Tiger bro and…",
          "Contenu": "Awesome support from Tiger bro and F1lip they helped me through out the whole process of purchasing a product to installing it and getting it up and running. Can’t thank them enough"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "InvalidUser",
          "Nb_Reviews": 2,
          "Date": "2023-10-08T16:03:12.000Z",
          "Titre": "Payment was quick and easy and got the…",
          "Contenu": "Payment was quick and easy and got the key within a minute after payment. Lowest price i could find as well - recommended"
        },
        {
          "Note": 5,
          "Lieu": "DK",
          "Pseudo": "Ajdin Karic",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T18:07:12.000Z",
          "Titre": "Easy 5/5",
          "Contenu": "Cant give it other that 5/5 stars, fast replies and you get your product instantly, no waiting no matter what payment you use."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "marr",
          "Nb_Reviews": 1,
          "Date": "2023-05-20T22:08:28.000Z",
          "Titre": "Amazing experience",
          "Contenu": "Great experience, I was helped by the founder, Tiger Bro. Great guy such a good help, was really quick, less than 5 minutes. I was sceptical at first and he solved my problems really quick. Was given a freebie due to a special limited time offer too."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Night Ingale",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T11:25:34.000Z",
          "Titre": "VERY FRIENDLY STAFF",
          "Contenu": "VERY FRIENDLY STAFFbought a sub on them via paypal and the transaction went smoothly. Tiger Bro handled my transaction and in a matter of minutes transaction was done. very satisfied."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Bene",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T20:56:28.000Z",
          "Titre": "very safe and fast",
          "Contenu": "very safe and fastfirst i was scared about getting scammed- i never used Discord chat to purchase something :D but everything worked and they were friendly and fast responding! also i did not get scammed :Di traded with Tiger bro#6969 and marroxo"
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "AMRV",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T11:04:51.000Z",
          "Titre": "My Review",
          "Contenu": "my experience was great beacuse the staff made it so easy to buy,and the time to the respond was so little,that even i was suprised.TigerBro assisted me and i was 78 cents of the price and he was so generous that he payed the 78 cents for me!I would recommend TGModz with trust"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Abdul",
          "Nb_Reviews": 2,
          "Date": "2023-08-26T20:43:02.000Z",
          "Titre": "He was very nice responded to all my…",
          "Contenu": "He was very nice responded to all my question and was very fast with everything made my experience great he made sure that I was in good hands and helped me"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Mr. BananenBrot",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T18:58:38.000Z",
          "Titre": "Best modding Serive I have seen in a long time",
          "Contenu": "What I bought: 4 new Gta 5 accs, 2 times Rebound VIP, 1 time 2take1 VIP Lifetime.Categorys: 1.Website 2.Service 3.Support 4.delivery 5.My Opinion1. The website is good looking has many things you can buy like: Spootify lifetime,Mod Menus:GTA,FiveM,Fortnite,R6,CS2 but also UAs or fresh accs GTA only. You can purchase over the website or via Discord with many diffrent payment methods. On the website only Card!!!!2. Service was pretty good a view clicks and I knew where to pay, what I get and also how to install finding the Discord was easier than ever. Pretty good Job there! On the Discord you open a Support Ticket for purchase.3. Support was a 100/10 every team member was nice the purchase and the delivery was quick and easy. If I had problems they solved it faster than I could see. They are funny and nice and do everything to help you. Answers from the support are very quick but keep in mind they are still humans and many of them life in diffrent time zones. So give them time.4. The delivery was like in 3. very quick after purchase. I had 1 time a little problem but they solved it very quickly.5. My Opinion is if you want a trusted seller with good prices an very good team, almost instant delivery and 24/7 support than you should 100% buy on TGModz. I will get my stuff here again if I need something 100%!!!!! Recommended !!!!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "drago",
          "Nb_Reviews": 2,
          "Date": "2023-10-08T19:17:27.000Z",
          "Titre": "Best Shop Ever!",
          "Contenu": "Here again buying something this time R6 LITE day key, very fast cheap and reliable!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "mr.midnight.real",
          "Nb_Reviews": 2,
          "Date": "2023-09-14T17:52:09.000Z",
          "Titre": "Excellent Products, Trustworthy with Superb Support as Well",
          "Contenu": "I recently had the pleasure of using TGModz for FiveM mod menus, and I was thoroughly impressed by their exceptional customer service and unwavering trustworthiness.First and foremost, the team at TGModz truly goes the extra mile to ensure their customers have a seamless experience. Whenever I had questions or needed assistance, their support team responded promptly and with a level of expertise that put my mind at ease. Their dedication to helping their customers is second to none.But what truly sets TGModz apart is their trustworthiness. I've had experiences with other mod providers that left me hesitant, but TGModz is refreshingly transparent and reliable. Their products are authentic and tailored specifically for the FiveM modding community needs. This level of trustworthiness is a rarity in the modding community, and it's something I greatly appreciate."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Luke",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T15:06:08.000Z",
          "Titre": "Quality and trustworthy products",
          "Contenu": "Quality and trustworthy products, and very quick activation after ordering. Very active and helpful staff made the process even better when I ran into a rare problem."
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Börje Von pelledt",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T19:36:16.000Z",
          "Titre": "Very good and trustworthy site",
          "Contenu": "Very good and fast support even if you want to pay with paypal thru the discord. Ticket support was so fast that the man who helped me wrote the first message before me. Thats quality."
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "JonnyFoxer",
          "Nb_Reviews": 10,
          "Date": "2023-07-27T19:45:51.000Z",
          "Titre": "Bought redEngine",
          "Contenu": "Bought redEngine from TGModz and I gotta say instant delivery and some of the best staff at TGModz. Highly recommend buying from them"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "jpdvx xd",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T20:12:29.000Z",
          "Titre": "Really good Service",
          "Contenu": "I recently bought a mod menu for GTA V im this discord server via ticket and support its really awesome, fast and reliable."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Marlon",
          "Nb_Reviews": 5,
          "Date": "2023-11-14T18:55:52.000Z",
          "Titre": "Great support and great service",
          "Contenu": "Great support and great service! Special thanks to Tiago"
        },
        {
          "Note": 5,
          "Lieu": "LU",
          "Pseudo": "theycallme tiagz",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T23:43:39.000Z",
          "Titre": "Recommended",
          "Contenu": "I bought 5 accs.Mar and Filipe and boss did a great Job on replying fast and delivering fast!Recommended for sure and its not a scam at all!"
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "Dod Is",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T06:33:51.000Z",
          "Titre": "i buyd here ov cheats and gta acc is…",
          "Contenu": "i buyd here ov cheats and gta acc is the best cuality the ceo is the best and it come to me in the first sec i buy"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ryan scherer",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T09:23:07.000Z",
          "Titre": "TGModz is amazing",
          "Contenu": "the best place to buy your mods and other neccesitys with the best customer support and the best vibes #TGModz on top"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Bazzoce",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T11:17:44.000Z",
          "Titre": "Awesome Owner!",
          "Contenu": "had a problem and the owner messaged me within minutes. He was super friendly and solved the problem immediately"
        },
        {
          "Note": 5,
          "Lieu": "MM",
          "Pseudo": "Trustseller",
          "Nb_Reviews": 5,
          "Date": "2023-09-02T12:10:29.000Z",
          "Titre": "Trust Service",
          "Contenu": "TGModz is the best service for me. It also solves my problem🥰.Friendly service. A service that can provide responsibility and accountability 🥰"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Latzinio",
          "Nb_Reviews": 3,
          "Date": "2023-07-06T20:49:14.000Z",
          "Titre": "Amazing",
          "Contenu": "Very nice support. Thanks to Ves and Tiger bro for assisting me and completing my order in less than 10 minutes."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Big Sheamo",
          "Nb_Reviews": 1,
          "Date": "2023-06-17T23:07:29.000Z",
          "Titre": "Amazing Service Quick And Polite",
          "Contenu": "Amazing Service Quick And Polite, Paid through paypal through the discords ticket service and it was reliable safe and easy defo will use again"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Paul Habich Paul_Paula",
          "Nb_Reviews": 3,
          "Date": "2023-06-30T22:06:56.000Z",
          "Titre": "instant delivery!",
          "Contenu": "instant delivery, PayPal worked perfekt nothing to complain. adam and Tiger bro are very helpfull and nice."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dolo m",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T20:05:55.000Z",
          "Titre": "There very respectful and fast someone…",
          "Contenu": "There very respectful and fast someone responded to my ticket under a minute !!!! best services ever !"
        },
        {
          "Note": 5,
          "Lieu": "CZ",
          "Pseudo": "Co čumíš pičo",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T16:55:47.000Z",
          "Titre": "They took care of my order quickly and…",
          "Contenu": "They took care of my order quickly and excellently I recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "holl x",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T01:55:21.000Z",
          "Titre": "very helpful",
          "Contenu": "very helpful group of people that made the buying process easy"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ves",
          "Nb_Reviews": 2,
          "Date": "2023-06-29T16:07:57.000Z",
          "Titre": "Great Service will buy again",
          "Contenu": "Quick service very nice staff team didn't have to wait long to recieve my key for midnight W CEO W staff team. Also STEVE helped me alot.USE CODE \"VES\" FOR 5% OFF"
        },
        {
          "Note": 5,
          "Lieu": "CZ",
          "Pseudo": "anilife masteя",
          "Nb_Reviews": 1,
          "Date": "2023-06-25T10:04:53.000Z",
          "Titre": "Fast & Nice seller",
          "Contenu": "Very nice seller , got the key in less than 10 minutes from the payment , trully recommended"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dcqnh",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T00:22:12.000Z",
          "Titre": "Service was reliable and fast",
          "Contenu": "Service was reliable and fast. NFurious came to me less than a minute after I created a ticket."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "xX",
          "Nb_Reviews": 2,
          "Date": "2023-09-26T23:28:30.000Z",
          "Titre": "The order was so fast and the quality…",
          "Contenu": "The order was so fast and the quality are incredible, thank you guys!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "xNFuriousx",
          "Nb_Reviews": 2,
          "Date": "2023-06-30T17:25:23.000Z",
          "Titre": "Fast delivery & friendly staff team",
          "Contenu": "Fast delivery, very helpful and friendly staff team.I recommend this services of TGModz!!!"
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "Duarte",
          "Nb_Reviews": 4,
          "Date": "2023-05-24T23:55:09.000Z",
          "Titre": "Should give they a try!",
          "Contenu": "they're insane , like insane prices, a fast response and friendly support (with nook and giga). Recomend a lot"
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Svyxy",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T15:40:07.000Z",
          "Titre": "Very solid service",
          "Contenu": "I recommend them, the staff in their Discord was really quick to help me with my purchase and everything went smooth. Got the key in less than 5 minutes. Overall great guys"
        },
        {
          "Note": 5,
          "Lieu": "PR",
          "Pseudo": "Jose",
          "Nb_Reviews": 2,
          "Date": "2023-05-12T20:41:23.000Z",
          "Titre": "Excellent service",
          "Contenu": "First Time buying And went quickly instantly responded now got my Key <3 i will continue buying"
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Guld Smycka",
          "Nb_Reviews": 1,
          "Date": "2023-07-30T13:13:50.000Z",
          "Titre": "Very good service",
          "Contenu": "Very good service, Adam the support in the discord helped me out with all the stuff of to fix it!"
        },
        {
          "Note": 5,
          "Lieu": "CZ",
          "Pseudo": "Theodor Lewis",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T11:45:19.000Z",
          "Titre": "Amazing!",
          "Contenu": "It was fastest buy and confirmed my information and i got e-mail with confirmed purchase, so fast and legit."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Perle Wini",
          "Nb_Reviews": 1,
          "Date": "2023-08-06T14:08:53.000Z",
          "Titre": "very good speed it's a good discord…",
          "Contenu": "very good speed it's a good discord that sells cheap accounts I recommend"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Vuxh fr",
          "Nb_Reviews": 1,
          "Date": "2023-07-09T14:55:20.000Z",
          "Titre": "Perfect",
          "Contenu": "I bought two things from their shop, a mod menu and some acc, the awnser is very fast, everything is legit."
        },
        {
          "Note": 5,
          "Lieu": "TR",
          "Pseudo": "hasna yna",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T00:52:02.000Z",
          "Titre": "Tiago was very quick and resolved my…",
          "Contenu": "Tiago was very quick and resolved my issue promptly and was very helpful"
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "glupia idiota",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T08:41:56.000Z",
          "Titre": "Fastest reply",
          "Contenu": "Fastest reply, helpful and patient administration."
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "da baby",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T18:24:58.000Z",
          "Titre": "Awesome service and support",
          "Contenu": "Awesome service and support, and the website was pretty sick too"
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Maciek",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T14:54:36.000Z",
          "Titre": "Very fast response",
          "Contenu": "Very fast response, and btfl customer , so to buy my product i waste just 4 minutes. Perfect !"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "defqon weekendwarrior",
          "Nb_Reviews": 10,
          "Date": "2023-06-06T18:45:15.000Z",
          "Titre": "recommended webshop",
          "Contenu": "real fast support and service 100% recommended Tiger Bro is a real legend that offers fast support !"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Blazed Gaming",
          "Nb_Reviews": 3,
          "Date": "2023-09-03T20:38:52.000Z",
          "Titre": "Great product and fast service",
          "Contenu": "Great product and fast service. Very straightforward in my purchase"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "John smith",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T20:57:25.000Z",
          "Titre": "Great service fast response",
          "Contenu": "as above they have a quick service they respond fast if you need assistance!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Connor Plays",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T04:03:13.000Z",
          "Titre": "Ves helped me out throughout the whole…",
          "Contenu": "Ves helped me out throughout the whole process and deserves a promo for his good work"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "BouhModder",
          "Nb_Reviews": 1,
          "Date": "2023-07-15T16:26:54.000Z",
          "Titre": "Rapide et efficace merci à [USE CODE…",
          "Contenu": "Rapide et efficace merci à [USE CODE \"Ves\" FOR 5% OFF] et Tiger bro"
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Alan",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T22:07:17.000Z",
          "Titre": "Quick Delivery, Quick Responce",
          "Contenu": "Quick Delivery, Quick Response no problems so W shop :)"
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "elay",
          "Nb_Reviews": 1,
          "Date": "2023-05-20T22:50:27.000Z",
          "Titre": "Best shop!l",
          "Contenu": "Best shop!l! bought a gta chair then right after an other product got them and I'm very satisficed, ill surely buy more stuff again!"
        },
        {
          "Note": 5,
          "Lieu": "CZ",
          "Pseudo": "matej senigl",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T19:56:34.000Z",
          "Titre": "Some problems but with help of admin…",
          "Contenu": "Some problems but with help of admin all works"
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "Box",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T18:10:29.000Z",
          "Titre": "Very friendly and very fast I recommend",
          "Contenu": "Very friendly and very fast I recommend everyone to buy from here"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Khen Cruz",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T17:41:52.000Z",
          "Titre": "The seller is very accommodating",
          "Contenu": "The seller is very accommodating. Super Fast and easy transaction! Very good!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Bradley Martin",
          "Nb_Reviews": 2,
          "Date": "2023-10-26T00:43:15.000Z",
          "Titre": "quick and easy",
          "Contenu": "was easy took 5 mins and was done very quick response time. ty tiago for help"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Shivanshu Gupta",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T16:04:01.000Z",
          "Titre": "JUST TRUST THEM AND BUY. 1000000% TRUSTED",
          "Contenu": "JUST TRUST THEM AND BUY. THEY HAVE THE MOST CRAZY OFFERS COMPARED TO OTHER RESELLERS.GO FOR IT"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Benoit Maroteaux",
          "Nb_Reviews": 2,
          "Date": "2023-08-01T16:34:23.000Z",
          "Titre": "Great !!",
          "Contenu": "Crazy rebound vip package !! Well done to the developpers"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "drago",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T16:15:53.000Z",
          "Titre": "Fast and easy 10/10",
          "Contenu": "Fast and easy, staff 10/10 cool people would definitely recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "louis drae",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T07:39:39.000Z",
          "Titre": "great service",
          "Contenu": "+rep extremely quick and staff is super friendly"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Sylex",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T17:35:49.000Z",
          "Titre": "Nice and Fast",
          "Contenu": "Worked perfectly support was fast and nice purchasing thru paypal was absolutly no problem"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "aseg gwet",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T06:54:07.000Z",
          "Titre": "Great Seller",
          "Contenu": "Great Seller! Fast and Reliable with no problems."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "slides",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T00:31:34.000Z",
          "Titre": "Easy to use and fast",
          "Contenu": "Easy to use especially on discord, I joined made a ticket and sent the $5.28 and my email and got my key."
        },
        {
          "Note": 5,
          "Lieu": "FI",
          "Pseudo": "Xsu",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T15:54:48.000Z",
          "Titre": "f1lip and tigerbro are amazing they…",
          "Contenu": "f1lip and tigerbro are amazing they helped me so much"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nova Services",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T19:33:21.000Z",
          "Titre": "Bought Epic account",
          "Contenu": "Bought Epic account and everything worked perfect!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Dovydas Leistrumas",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T15:18:57.000Z",
          "Titre": "Amazing",
          "Contenu": "Amazing group of people, Got the job done quickly. Completely trusted and all is well!"
        },
        {
          "Note": 5,
          "Lieu": "BG",
          "Pseudo": "Dababy Dababy",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T20:58:41.000Z",
          "Titre": "Amazing and fast service would…",
          "Contenu": "Amazing and fast service would recommend !"
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "sculyx",
          "Nb_Reviews": 1,
          "Date": "2023-06-03T21:00:48.000Z",
          "Titre": "Rebound cheat",
          "Contenu": "Thank you for the rebound mod menu i got it! legit and nice support/owner! W"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Youness",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T18:30:41.000Z",
          "Titre": "Everything works as i wanted and the…",
          "Contenu": "Everything works as i wanted and the service is perfect !"
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "calinacho ㋛",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T00:26:07.000Z",
          "Titre": "reallu goid!",
          "Contenu": "reallu goid injector has anything u need"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "mr.midnight.real",
          "Nb_Reviews": 2,
          "Date": "2023-09-14T17:58:32.000Z",
          "Titre": "Exceptional Customer Service, Trustworthiness, and Reliable FiveM Accounts",
          "Contenu": "My experience with TGModz, encompassing FiveM mod menus and their replacement FiveM accounts, has been nothing short of exceptional. TGModz stands out as a beacon of outstanding customer service, unwavering trustworthiness, and a reliable source for FiveM accounts.Customer service at TGModz deserves special recognition. Whenever I had questions or needed assistance, their support team was not only responsive but also incredibly knowledgeable. Their dedication to helping customers navigate the intricacies of modding and account replacement is unmatched. They truly go above and beyond to ensure a smooth and enjoyable experience.Moreover, TGModz's trustworthiness sets them apart. In an industry where reliability can be questionable, TGModz shines as a beacon of transparency and dependability. Their replacement FiveM accounts are consistently reliable, offering peace of mind for anyone concerned about the stability of their gaming experience.The inclusion of replacement FiveM accounts in TGModz's offerings is a significant advantage. These accounts provide a hassle-free solution for those who want to enjoy FiveM without worrying about potential issues or setbacks. Knowing that TGModz provides trustworthy accounts adds a layer of convenience that's hard to find elsewhere.In conclusion, TGModz is the complete package, offering exceptional customer service, trustworthiness, and reliable FiveM accounts. Their commitment to enhancing the gaming experience, both through mod menus and replacement accounts, makes them a standout choice in the FiveM community. I wholeheartedly recommend TGModz to anyone looking for a comprehensive and dependable solution for their FiveM needs. TGModz has certainly made my gaming experience more enjoyable and worry-free!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Victor Mordzak",
          "Nb_Reviews": 2,
          "Date": "2023-06-02T19:40:46.000Z",
          "Titre": "bought a csog menu and works perfectly…",
          "Contenu": "bought a csog menu and works perfectly fine, support is hella kind too"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "sven munnik",
          "Nb_Reviews": 3,
          "Date": "2023-10-18T18:08:13.000Z",
          "Titre": "smooth and easy transcaction"
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "adam",
          "Nb_Reviews": 3,
          "Date": "2023-06-06T19:57:08.000Z",
          "Titre": "10/10",
          "Contenu": "10/10 got my rdr2 account instant! Thank you for the help @Mikoo and @Tiger bro!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "B G",
          "Nb_Reviews": 6,
          "Date": "2023-07-13T19:10:03.000Z",
          "Titre": "its fast and legit best service for…",
          "Contenu": "its fast and legit best service for paypal"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Ne Seri",
          "Nb_Reviews": 7,
          "Date": "2023-10-23T20:08:57.000Z",
          "Titre": "very fast delivery and trusted"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "drago",
          "Nb_Reviews": 2,
          "Date": "2023-09-10T16:16:09.000Z",
          "Titre": "Best Reseller",
          "Contenu": "3rd time buying something and always reliable, 11/10 service CHEAP!!!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "ChickenNugget",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T18:07:36.000Z",
          "Titre": "I got a very Fast reply on my order and…",
          "Contenu": "I got a very Fast reply on my order and its Legit!"
        }
      ]
    }
  ]
}