{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "therapynotes.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Katherine",
          "Nb_Reviews": 3,
          "Date": "2023-11-06T22:59:37.000Z",
          "Titre": "Their payment processing system is horrible",
          "Contenu": "Therapy Notes is great but Card Pointe, their payment processing company, is absolutely horrible and ultimately, made it impossible for me to use Therapy Notes for my business. If you plan on processing payments through Therapy Notes, I wouldn't waste your time even applying.  They rejected me three times without any valid or clear explanation and Therapy Notes is so disconnected from their provider, they were no help at all."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nancy Schleich, LISW-S",
          "Nb_Reviews": 2,
          "Date": "2023-10-04T17:34:45.000Z",
          "Titre": "Avoid Therapy Notes",
          "Contenu": "Formerly a great company that was responsive to my tech support needs, Therapy Notes has deteriorated.  I just called tech support and got message that no one was available and I was out of luck.  They seem to have moved to wanting only online email support communications, but when I tried that, I got email back saying it didn't seem to them that I was olocked out of my program (which I am) and no way to discuss this.  I am now looking for another platform and recommend that you do not sign up for Therapy Notes.  Its a shame.  They were pretty good in the past."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Emmanuel Sandoval",
          "Nb_Reviews": 2,
          "Date": "2023-02-16T19:55:45.000Z",
          "Titre": "EHR Software with many limitations",
          "Contenu": "Therapynotes doesn't have a way to manage secondary payments. From a clinician's standpoint it is great. From an Administrative standpoint the software is very minimal. There is no way to track denial claims to resubmit. It marks them as rejected and written off. As you may know you don't just write claims off when they are denied. Can't change anything on the note from an administrative perspective. ERA's are hit and miss they sometimes come via EHR and sometimes they don't. You can't communicate directly with change healthcare when you have EDI issues. If you are looking for a great software. Keep looking. TherapyNotes is not it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Emmanuel Sandoval",
          "Nb_Reviews": 2,
          "Date": "2023-03-31T19:16:14.000Z",
          "Titre": "Zero Solutions from Customer Support",
          "Contenu": "TherapyNotes does not provide good solutions to issues. Not being able to remove an authorization without having your counselor redo their notes is insane. Asking a counselor to redo 30 notes is not a solution. 6 months with TherapyNotes and no updates recommended have been implemented. The longer you are in TherapyNotes the more you realize it is a product for a very small operation. This product does not support any big practices without having extensive work arounds and having to manage spreadsheets outside of the system. In theory, the EMR system should help with this, but it does not. They promise great support, but don't provide any solutions."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "R and J",
          "Nb_Reviews": 6,
          "Date": "2023-05-06T03:16:43.000Z",
          "Titre": "After the honeymoon phase.....",
          "Contenu": "After the honeymoon phase with therapy notes....the claim process is beautiful...but then you get paid. Sigh. I am an out-of-network provider, so I cannot speak for those in the network with insurance companies. My experience has been an exhausting one. Secondary insurer payments will not mark accounts as paid when Medicare is the primary; causing tedious, redundant, and time wasted constantly correcting numbers, write-offs, and entering patient copays.  It's been 5 months and Therapy Notes has cost me paying more overtime to billers than the fee itself.  I am looking for software with much more automation. I would advise you to wait 3-4 months to leave a review...the honeymoon phase is indeed wonderful; however, I found the basic accounting and billing functions inadequate and limited at best."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2020-10-17T20:27:06.000Z",
          "Titre": "The customer service is so poor",
          "Contenu": "The customer service is so poor, not willing to help with any problems you can't troubleshoot yourself.  Often refer you to other departments and they just send you in circles.  A found a number of my claims were not going through as a result of their technical coding, which again they were not willing to look into, even suggested doing it by hand and mailing them in.The response from Therapy notes is untrue, I was a client for over 2 years.  While trying to trouble shoot my last problems, I was transferred from support to sales, back to sales only to be told I need to speak with support.  The Sales representatives name was Jeff and have numerous documented emails of poor customer service and failed claims on Therapy Notes account."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michele Johnson",
          "Nb_Reviews": 1,
          "Date": "2021-01-18T18:55:08.000Z",
          "Titre": "No Customer Service",
          "Contenu": "There is no customer service support. They call it “customer success” but they don’t care about your success and they definitely don’t care about the fact that you have patients that you actually do care about!  We have been long-term clients and have tried out their telehealth services. We are having problems and have repeatedly contacted them and they make appointments with the doctor in our practice and then they don’t keep them. If you have a problem they blame you. If you make an appointment at their convenience, they do not call on time.  If you call them, they do not respond.  If you ask to speak to a supervisor, forget it.  Their solution to everything is that they don’t need you as a client, so you can leave, at your own expense and time.  arrogance is the only word to describe it!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Current TN user",
          "Nb_Reviews": 1,
          "Date": "2014-05-18T20:25:32.000Z",
          "Titre": "Do Not choose Therapy Notes",
          "Contenu": "Therapy notes may be useful for individual private practitioners and cash only single providers.   The few practice management reports that are available are inconsistent, unreliable, and, in many cases, un-exportable. Billing features are extremely basic, secondary insurance submission has never worked, does not allow for tertiary insurance to even be entered, and does not allow for the capture of insurance adjustments.  If an insurance is updated, there is no way to keep a record of previous insurance a client has had, no ability to enter start or end dates, and old/previous visits are automatically changed to new insurance.  \rTherapynotes is lacking in even the most basic features, experiences frequent outages, and fails to provide the services it claims to offer.  When you choose to leave Therapynotes, you will be told that the only way to capture/save your information to to print the screen-shots."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jessica Jones",
          "Nb_Reviews": 4,
          "Date": "2020-01-08T20:25:53.000Z",
          "Titre": "Terrible customer service and impossible to cancel",
          "Contenu": "My experience with TherapyNotes has been terrible overall and I have not been able to close my account 18 months after I cancelled and stopped using the software.I tested the system for about 6 months since I'd heard good things and the system was missing some key features for me so I cancelled my account and used a different EHR. Almost a year later I found out that TherapyNotes had, in fact, never cancelled my account and had been charging me for a continued subscription for over a year! I contacted customer service and got the runaround about a refund but I decided to just cancel the service (again) to be done with it. I cancelled my account again with the help of customer service. A few months later I was alerted AGAIN that I had a past-due bill on my somehow still active account! After I closed my account twice! Once again I reached out to customer service and once again I was told lies (they told me I had submitted claims more than 18 months after I stopped using their system and I had to prove using their own activity logs that was a lie) and STILL have been unable to get a refund or cancel my account after months of back and forth with customer service. I would not recommend this software and would be very wary of even signing up to try it out because you may not be able to cancel!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "DW",
          "Nb_Reviews": 1,
          "Date": "2020-05-28T15:51:45.000Z",
          "Titre": "Therapy Notes has horrible service",
          "Contenu": "This is only my experience. I hope therapy notes has actually improved its service because it is customers who keep a company going. My experience was horrible. It has nothing about being pleased. If a company follows through with what they say they will do, and provide quality customer service, then they have no need to worry about negative reviews. Because of the service I received, I ended up going to another EHR. There were several reasons. There was no options for when text reminders could be sent out. Therapy notes claimed text reminders are sent out 28hrs before clients appt. My clients always received text reminders less than 24hrs before their appts. There was a discrepancy in my credit card bill which was always higher for services used than the actual bill I received. Fees for client's card used were never billed to the end of the billing period which was always shocking. I canceled with therapy notes and was still charged by the card service company for services that were not used. I tried calling the card company to cancel services, and the card service company told me I had to call therapy notes to get the service canceled. When I tried getting billing discrepancies resolved, the rep yelled at me. When I asked if there could be changes when the text reminders went out, I was told my business was small and insignificant. I was also told things were in the works to be changed, but I never saw any changes."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Don Brock",
          "Nb_Reviews": 1,
          "Date": "2017-07-01T04:18:17.000Z",
          "Titre": "Non responsive to system breakdown."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Cheryl Willoughby",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T12:41:20.000Z",
          "Titre": "Forgot the fundamentals.",
          "Contenu": "I’m 3 weeks into trying to be approved through merchant services with no real explanation from support services.  It doesn’t matter how good any of the other services are if clients can not be charged for sessions.  Hard to start a new business without collecting payments."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Amanda, ARNP",
          "Nb_Reviews": 1,
          "Date": "2022-10-24T16:26:12.000Z",
          "Titre": "Not helpful for psychiatry providers",
          "Contenu": "I am a Nurse Practitioner in a behavioral health clinic that is predominantly therapists. I am the only individual that prescribes medications. I really wish I could tweak templates for the psychiatry notes as I see fit--design my own so to speak. Have certain phrases and things built into every note, etc. Physicians/NPs/PAs notes are centered around a SOAP format, which TN does not follow at all. There are numerous areas for subjective content (ROS, symptom description) and then objective content would be the MSE, physical content, and objective content. Why is this all over the place? Assessment and plan generally go together, for instance:ASSESSMENT & PLAN:Major depressive disorder--Continue blah blah--Follow up in blah blahOur assessment is not better or worse than last visit. Our assessment is our diagnosis. There are so many random boxes to put in information--it is very clunky.Also please have it calculate the age at the top rather than just showing the birthday. Every other EMR shows DOB and the age such as \"2/2/18 6yo F\", etc. It is much quicker to see the age, especially with pediatrics where FDA indications of meds vary on age. Yes, I can do math, but when I have a patient every 20 minutes not doing mental math saves me a ton of time. Also we use A LOT more screening tools than the PHQ and GAD (at least I do). It would be amazing to have more of these included and also to be able to pull these into the note rather than having to type out PHQ 9 Score: X. Can we please get an auto-save feature?!? It is so annoying to have to scroll all the way down to the bottom to save. Again, when you are a very busy provider all of these extra scrolls, clicks, etc. which add time to your workflow and these getting rid of these little things helps so much!I have many more suggestions.I would love to work with TN and have them consult me to spruce up the psychiatry notes and make them more user friendly for the work that we do. Let me know who to contact to make this happen! :)"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "R and J",
          "Nb_Reviews": 6,
          "Date": "2022-05-19T17:09:11.000Z",
          "Titre": "Inconsistent",
          "Contenu": "InconsistentThey have some great features but this is a software still working out kinks. They fail to acknowledge their own mishaps and tend to blame the customer us for the mishaps. If you have a practice that accepts medicare and has secondary payers...run away..run fast. These payments are not marked as paid and are easily rebilled to medicare. The credit card processing fails to charge the card yet it authorizes the transaction. I know...I was like what? There are a handful of reps whose customer service skills need a fine tuning; however, there are some that go above and beyond, hence the reason this is not one star."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James  Archibong, PhD ArchibongPhD",
          "Nb_Reviews": 1,
          "Date": "2018-09-25T18:36:03.000Z",
          "Titre": "Cant Save Notes",
          "Contenu": "Please Please assist me adjust therapy notes.when i write notes i can't save them because when I scroll down I can hardly go pass the \"sign this  notes'' column.As you know \"Save  Notes:'\" and :\"Review Notes\" are wright under this column.Thanks."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mara Steinhour",
          "Nb_Reviews": 1,
          "Date": "2015-12-03T14:33:18.000Z",
          "Titre": "Review thus far",
          "Contenu": "I don't like that I have options on notes that I really don't need \rI'm confused on doing the notes especially if it ask for treatment plan but then If I have to look for dismissing or terminate pt cause don't need treatment plan... Why not ask when you want a treatment plan update if pt is continuing.\r I dislike being logged of after 15 minutes as my sessions can be 45 minutes to 60 minutes and often it's nice to do notes as I'm in sessions as many pts don't mind and like that I'm keeping track of Plans of Future goals but I get logged off after 15 minutes. So I'm writing on paper to then type on notes. \r Thank you"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Julia Rosengren",
          "Nb_Reviews": 1,
          "Date": "2022-05-25T23:47:36.000Z",
          "Titre": "Therapy Notes used to be great for…",
          "Contenu": "Therapy Notes used to be great for private pay clinicians who provide superbills 2-5 times a year for patients. Recently the modifiers do not show up on superbills and when I called to ask why, they gave me a horrible time-consuming workaround. It was incredibly confusing and to have my employees and myself do this would add much extra time and errors. I’m also not happy that no one notified us of this, but rather our clients had to come to us saying they weren’t being reimbursed. This is absolutely something I will leave TN about unless it is resolved without a workaround.***UPDATE: Since I cannot figure out how to reply to the reply that was made below. I appreciate that they are trying to make the superbill function work the way it worked for years. However, if you read my comment above, I did call to get the workaround and it is NOT easy. I have spent hours teaching staff and editing charts to correct this issue. For cash practices this is not at all okay. Please fix ASAP or I will be leaving."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ashlee Sitzmann-Hedges",
          "Nb_Reviews": 1,
          "Date": "2018-07-09T17:36:17.000Z",
          "Titre": "I would not recommend Therapy Notes at…",
          "Contenu": "I would not recommend Therapy Notes at this time. They have not kept their word about creating an option to fill out and submit paperwork online. They have not created a better way to take notes for couples counseling even though many users have asked. Most importantly, the system runs slow consistently. There are constantly issues connecting to the server which makes it a battle to complete notes and billing entries. I like the program but there are others that can do the same things better such as Simple Practice. As soon as I have time to move all my notes over and learn the new system, I will. If Therapy Notes works out the kinks in the meantime, I would like to stay but I’m tired of it taking hours to complete notes bc I can not connect to the server."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kendra Allen",
          "Nb_Reviews": 1,
          "Date": "2020-06-03T13:59:32.000Z",
          "Titre": "Missing Standard Billing Features",
          "Contenu": "Missing Standard Billing Features:  Start Date & End Date of Insurance Coverage, Cannot bill secondary claims electronically, missing key reports such as patients with secondary and tertiary insurance.  When speaking with customer service their response is simply stating the feature is not available and that is that, no future updates.  \"If Therapy Notes isn't for you, then you should consider other options.\"  Ultimately client retention does not seem to be a concern.The EHR / Charting is easy to use and customer service is responsive to any issues regarding charting.  Sad really, because it is a good product that is just missing some very basic features.  It could be a GREAT product.  Too bad no one seems to be willing to accept feedback or provide more interactive customer service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JB",
          "Nb_Reviews": 1,
          "Date": "2020-01-17T17:28:50.000Z",
          "Titre": "Lacking in Basic Functionality",
          "Contenu": "Our practice started using TherapyNotes in order to streamline our scheduling process - allowing clients to schedule their appointments online.  Although this is an improvement over back and forth emails for scheduling purposes, some very basic elements are missing.  When a client requests an appointment, it shows as pending for the clinician, but it doesn’t send an email to that effect to the client.  Therefore, the client doesn’t have a record of when they had requested an appointment, and they typically assume that the request submission guarantees that appointment time.  The clinician has the opportunity to accept or decline appointment requests, but clients are only notified about the accepted appointments.  When they are declined, the client is not notified. Clients can cancel appointments through the portal, which then notifies the clinician, but if a clinician cancels an appointment, again no notification is sent out to the client.  Unfortunately, TherapyNotes is set up to appear as if these processes  would be happening automatically, so many clinicians might not be aware of the lack of communication with clients.TherapyNotes Customer Support has been timely in replies to concerns, but has not been helpful.  Despite the relatively quick and straightforward programming adjustment necessary, each Customer Support response has dismissed my needs, saying that it may get looked at in the future."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rick Quisenberry",
          "Nb_Reviews": 1,
          "Date": "2015-12-31T21:54:01.000Z",
          "Titre": "Clunky and limited",
          "Contenu": "The agency for which I work uses TherapyNotes for its client contact and record keeping. While I won’t speak for the agency as a whole, my observation is that the staff considers the application to be adequate but less than hoped for. My experience with TherapyNotes has been a bit more negative. Briefly, my disappointment is reflected in the following: First, it does not support couples or family counseling. This requires the clinician to document their couples/families and related sessions as if they are individuals. This works okay, but it’s really quite limited in terms of writing notes about these clients. Second, it forces a workflow that may not reflect the clinician’s preferred practice. In particular, a treatment plan with diagnosis is required before even the first progress note is written. It doesn’t support well the initial assessment phase of therapy. In fact, TherapyNotes has no explicit way of identify what phase of therapy is taking place. It imports the diagnosis into progress notes (a practice that some clinicians and supervisors have found to be unnecessary). At this time, the diagnosis must be manually re-entered for termination notes (why?) . Finally, the folks at TherapyNote have very little interest in soliciting feedback from customers. To my knowledge, they have not requested input / feedback from our agency, and when I have given them feedback, it typically dismissed or ignored by their support staff. \r There are better products in the market place."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Melissa Gratz",
          "Nb_Reviews": 1,
          "Date": "2016-05-11T18:37:29.000Z",
          "Titre": "Major problems with software not being fixed",
          "Contenu": "There are some major issues that business owners should be aware of. While the program itself is sleek, user friendly, intuitive, and encompassing. Some major issues include accounting inaccuracies. The most costly one for business owners is that any refund issued to a client, or a redacted payment by insurance, is only reflected on the actual date of service. So if you have already paid your therapist months ago for that session, and pull an income report for this current payperiod, in which you issued the refund, you will not find it. It gets deducted, on paper, from the therapists income at the date of service, not the date it was issued. So you can't easily deduct the refund back from the therapists pay using their accounting features. Another major issue is diffulty navigating the calendar if you are scheduling for many therapists at once. We have 12 therapist and there is no way for the system to identify regular openings on a therapists scheduled without looking at them one by one on a week view of multiple therapists on a day view but you still must scroll through week to week to make sure it is a consistent opening if you like to schedule that way. Our previous system would allow us to search slots by selecting AM, Afternoon, PM and Morning, Day, Evening and it would present all the options available like  \"12 upcoming slots on wed. at 9AM with Sam, for example. This one is extremely cumbersome when locating slots. We made several attempts at working with TN to resolve these issues but after over a year they are still not even in the queue. They roll out lots of little stuff but the big things don't seem to ever make the list. If you are a serious business owner consider that these things may cost you considerable time and money in the long run."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tim White",
          "Nb_Reviews": 1,
          "Date": "2020-10-24T15:35:16.000Z",
          "Titre": "Completely fed up 10/23/2020--Less fed up 10/24/2020",
          "Contenu": "10/23/2020 Original 1 Star review.  We have had some really good experiences with TherapyNotes and some awful experiences as well.  From outages to technical issues to getting the runaround from support.  Customer Support's very typical reply is that a feature is in the works and that they can move our request up to development.  NONE of our requests have been met with any kind of new feature in years and some of this stuff is pretty simple.  For example, STOP HAVING THE DEFAULT AT PAYMENT BE THAT THE CREDIT CARD IS SAVED!  The default should be nothing so that the receptionist doesn't accidentally save information the client does not want saved.  I understand larger issues, like fillable intake forms that the clinician can tailor to the clinician's practice, are more difficult and in-depth.  Truly that's more than I could work out, but we've been in a pandemic for the last 9 months and I just got totally blown off by support about streamlining the intake process.  His response was, \"I don't know how to respond to that.\" and \"There is no way to put you in contact with the development team.\"  We have been with TN since March of '17 and I'm shopping for new practice management software for the rest of the day.10/24/2020 Amended to 2 stars.  Yesterday the above gentleman's supervisor called me and we discussed the issues I am having.  Firstly, the folks at TherapyNotes are very nice people and there is nothing personal that has been offensive.  Also, not all customers can be made happy.  They have offered to give us two free months of service.  That's nice but there are still issues that we would like addressed and the feedback is typically a, \"We'll push this along to the development team.\"  With that said, TN is working on paperless, online intakes.  That's awesome, also super late to the game.  There is a workaround, which I have not investigated yet.  My opinion is, stop it with the workarounds and integrate solutions directly into the platform.  TherapyNotes is great for a lot of practices.  Ours is unique.  If the issues above can be addressed, we'll stay.  If not, I'm still shopping.  Finally, it is super disappointing that it took a one-star review to actually get TN's attention and motivate them to reach out to a long-standing customer."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Donald Gibson",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T06:49:10.000Z",
          "Titre": "Secure email is needed",
          "Contenu": "The calendar is clean and easy to use.The quality of the video is good, and the platform is easy for clients to use. It is difficult for some clients to download, print, sign, and upload documents when clients have to use cell phones. The progress notes template is excellent. You are not able to send and receive secure messages to the client's portal."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2022-09-20T17:17:33.000Z",
          "Titre": "Recent updates have meant that…",
          "Contenu": "Recent updates have meant that TherapyNotes has been down a few times. Generally, rollouts are tested for functionality before they go live. When you're sitting with a client and need to access the system, it's very debilitating to be at a loss...at the mercy of a cloud-based system."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Delila Donaldson",
          "Nb_Reviews": 1,
          "Date": "2019-01-17T07:31:15.000Z",
          "Titre": "Great customer service and no hidden…",
          "Contenu": "Great customer service and no hidden fees. Need to add a few things to really keep up with the competition... telemental health, add ability to customize documents, that can also be filled out within the portal, customized options for assigning CPT codes (limited to 3 choices) , and add group therapy options for notes and billing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ray Sirry",
          "Nb_Reviews": 1,
          "Date": "2015-10-29T19:57:45.000Z",
          "Titre": "Therapy Notes Poorly Organized/ Awkward to Use",
          "Contenu": "Therapy notes is poorly organized. For example, the medications field does not carry forward, making review awkward. User can't see previous notes without losing note in progress. There are many other examples. The text boxes are too confining so notes of length are lost and there is no where to put the excess. There is no place to attach important letters and documents so a paper file is also necessary."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JULIE R.",
          "Nb_Reviews": 1,
          "Date": "2014-05-28T04:17:03.000Z",
          "Titre": "Great program.  Improving quickly.",
          "Contenu": "Therapy Notes truly has been a lifesaver.  No more paper files!  Billing generated seamlessly through clinical note taking process.  Unfortunately, there have been many days Therapy Notes is \"down\" for various reasons.  This seems to happen less frequently the past few months."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Leroy Miller",
          "Nb_Reviews": 1,
          "Date": "2015-08-04T15:20:54.000Z",
          "Titre": "Lack of ERA auto-posting",
          "Contenu": "I have started \"beta\" testing Therapynotes and am extremely pleased with the interface, scheduling, claims submission, support and all other features - except the lack of auto-posting of ERAs.\r If you submit claims to insurance companies you'll have to manually enter all of the EOB information in Therapynotes and this is very time consuming and error prone. \r If you don't work with insurance companies, this is a great program!!!\r Unfortunately, we will have to look elsewhere as the ERA Beta will not be updated anytime soon."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark Hunyar",
          "Nb_Reviews": 1,
          "Date": "2015-05-04T23:18:17.000Z",
          "Titre": "Unavailability of server unexpectedly.",
          "Contenu": "Occasionally, usually on my busiest day, Saturday, I will lose contact with Therapy notes in middle of documentation. Consequently I will not be able to complete note, bill or schedule the patient. Generally. Downtime is usually approximately one hour straddling two appointments."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cody Oaks",
          "Nb_Reviews": 1,
          "Date": "2020-03-13T18:13:36.000Z",
          "Titre": "Okay for some things",
          "Contenu": "After more time with Therapynotes, I'd say it's okay. I like it for scheduling and note-taking, but for electronic claim submission, only one payer works through TherapyNotes so I end up using the Payers individual portals anyway."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "B. L.",
          "Nb_Reviews": 1,
          "Date": "2018-02-13T02:31:45.000Z",
          "Titre": "Fed up!",
          "Contenu": "While there are many good features, the TherapyNotes does not automatically save your work. How stupid.  I lost hours and hours of work, with much aggravation, each time it happens.  I have complained about this for months, but they have higher priorities. They are aware of the problem because of multiple complaints from many others (which they admit), however, nothing has changed. I should not lose information that I've worked so hard to put it into documents, because they can't have a automatic save feature.  I lost information today, because I stepped away from the computer to help my wife with the groceries,  and I got locked out, got back in and lost what I did.  I lost information many times on complex multifaceted treatment plans, intakes and notes, because I did not remember every time to save everything, no matter what, or I will lose every bit of work I've done on that document.  How stupid.  And disrespectful."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jose",
          "Nb_Reviews": 2,
          "Date": "2020-04-10T22:50:06.000Z",
          "Titre": "As with most large scale companies",
          "Contenu": "As with most large scale companies, the employees do not communicate well with each other which leads to inefficiency."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Larry",
          "Nb_Reviews": 1,
          "Date": "2014-11-03T12:48:00.000Z",
          "Titre": "Large Practice Difficulties Administration Problems Clinically Excellent",
          "Contenu": "I can fully recommend therapy notes from a clinical perspective. Several problems exist administratively for a large practice. 1. Individual clinicians cannot see the entire payment record and must get a administrator to print the payment file. There appears to be no plans to make this available. 2. For practices that pay their clinicians as a percentage of gross a significant problem exist. If a client pays in advance each payment must be reworked during each pay period until the prepayment is completed. If this is not done the revenue generated does not show up in the revenue report which is necessary for the clinician to be adequately paid. The system necessary to manage this is prone to error on the part of the person doing the recalculations as they are done manually.3. Individual clinicians cannot run a revenue report for the income that they generate. This prevents them from checking accuracy of postings for the pay period. 4. The revenue report does not clearly identify the amount posted for that pay period. Each line item needs to be researched to identify the amount posted. 5. There is no total listed on the revenue report."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Deborah Harper",
          "Nb_Reviews": 2,
          "Date": "2015-10-01T16:27:10.738Z",
          "Titre": "Informaton page",
          "Contenu": "Where is \"comment\" on information page, I need this for reminders  and to store additional info."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Fugett",
          "Nb_Reviews": 2,
          "Date": "2020-12-29T20:58:00.000Z",
          "Titre": "Good company, but this issue:",
          "Contenu": "I used TherapyNotes for 7 years, before switching to another company out of necessity during the early Pandemic to have smooth access to telehealth services. I was very happy with TherapyNotes up to that point and would not have switched before the need to provide telehealth services.So why only 3 stars? The reason is that TherapyNotes, when informed that we were moving, had no method to easily allow me to copy or download my files en-masse. You can download records, but only for one client at a time. A very slow and unnecessary process when you have many clients on their system. So far I have not been able to finish this process in 9 months. That is on me. I could choose to spend hours and hours and likely days doing it. My schedule has not made this easy, or reasonable.My new provider has a very simple feature that allows you to download all of your data via their website. No need to contact anyone. [UPDATE: Therapynotes called me the day after I posted this review. They informed me that they have a storage service that decreases the cost of having your data on their servers to $9 dollars a month. This is better, but still not enough. I was told they are working on a way to download data all at once which would be greatly appreciated. Therapynotes has great customer service. You can always get support on the phone. If the download issue is not a concern for you, Therapynotes is a great company and their system is simple and complete.]"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jonathan",
          "Nb_Reviews": 3,
          "Date": "2018-03-12T05:00:29.000Z",
          "Titre": "System consistently down - unreliable",
          "Contenu": "My group has been using TherapyNotes for over 4 years. For the first 3 years we were very pleased with the service. However, for the past year there have been significant reliability problems with their system. We went nearly a week last year when the entire system was down. Since then there have been too many outages to count. On a regular basis the system will be down for periods of time that make it impossible to use when you have clients, need to schedule, need to bill, etc. Anytime inquiries are made regarding details on these repeated problems the canned response is simply that they are aware of the problem and appreciate our patience. They are poor at giving information about outages, timelines, and plans to ensure they stop. We have run out of patience and are moving to another system. While I am sure I don't understand what it takes to make their system work seamlessly, its reliability problems have created such significant issues for us that we just can't rely on it anymore. Maybe the other reviewers can live with this, but, we have a large group and rely on consistent access - which this doesn't provide.The TherapyNotes CEO reached out to me directly which was good customer service. He promised things will be much better. They have been for the past few weeks. I am waiting a few more months before we decide if we will move - but the system has to be more reliable and needs major improvements with the patient portal onboarding. For now my review stands as is - but - may improve if things improve."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sarah Voruz",
          "Nb_Reviews": 1,
          "Date": "2014-06-11T23:16:17.000Z",
          "Titre": "Pretty good - would like to see some improvements",
          "Contenu": "When I first signed up, I had to pay for an extra account simply to have my supervisor sign my notes, even though he does not use TherapyNotes for any of his own documentation purposes. I was offered a discount but I still thought it was silly that I had to pay for a subscription that was being used only for signing purposes. After writing this review, I was given a free subscription for my supervisor, which is greatly appreciated. If you are a resident or need your notes signed, be sure to contact TherapyNotes directly to inquire about pricing for your individual needs. \r TherapyNotes is also lacking in some basic features that would be nice, like a to do list that is not associated with appointments, a way to control who shows up on your active client list, and a session counter. Also, I once selected a setting to not automatically cancel appointments when a vacation is scheduled and now I can't find a way to change this. [Update: TherapyNotes's reply helped me address that]. Additionally, as a psychologist resident it would be awesome if there was a way to look at summaries of my scheduled hours doing various tasks. I also wish that they didn't require you to use the gender binary for patient information. Additionally, I find it annoying that if you start a note, but don't finish it, it shows up twice on your to do list. I've run into some difficulty with entering payments where if I don't do it just so, it will assign the person credits instead of taking it off the balance. This seems to happen when I enter the payment via the scheduled appointment box versus going into patient billing. Generally, I'd like to see more options for customization and to have them take things up a notch in terms of reducing glitches and improving features."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "SHERI MATTHEWS",
          "Nb_Reviews": 1,
          "Date": "2014-06-02T16:06:00.000Z",
          "Titre": "Average",
          "Contenu": "Expensive and needs more features!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dottie Gemignani",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T01:22:21.000Z",
          "Titre": "The person who responded told me how to…",
          "Contenu": "The person who responded told me how to do something I was unable to do. And they also stated they will report my suggestion to the program design team."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eugene Anderson",
          "Nb_Reviews": 2,
          "Date": "2022-10-22T08:25:31.000Z",
          "Titre": "Amazing platform for all problems",
          "Contenu": "Amazing platform for all problems. I had a problem downloading Microsoft Office for my Mac. I called them and get a great service. I am nicely impressed with the level of service and I highly recommend this site."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kristin T",
          "Nb_Reviews": 1,
          "Date": "2022-12-05T14:58:17.000Z",
          "Titre": "Customer service works great",
          "Contenu": "Customer service works great!  I call every time I have a question that needs to be answered in real time.  So far therapy notes is making billing and note taking so much easier."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Yesenia Guerra",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T17:03:53.000Z",
          "Titre": "Very User Friendly"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ramon Diaz, MA, LPC, NCC, CDBT",
          "Nb_Reviews": 1,
          "Date": "2022-12-08T20:10:36.000Z",
          "Titre": "Professionalism was Impressive",
          "Contenu": "The rep-from TherapyNotes-was attentive and helpful when addressing my inquiry. The rep sent me a detailed email that reflected the content of our discussion. She demonstrated strong professionalism."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "A.L.",
          "Nb_Reviews": 1,
          "Date": "2022-10-18T19:16:01.000Z",
          "Titre": "Quick response time",
          "Contenu": "Quick response time.  Clear and concise response without any extra scripted filler."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Connie Eriksson",
          "Nb_Reviews": 1,
          "Date": "2022-07-27T00:39:44.000Z",
          "Titre": "I love working with the team at Therapy Notes",
          "Contenu": "I have used Therapy Notes for more than 2 years.I love working with the team at Therapy Notes.  I rated them as a 4 because there are a few things I would change about the portal and the notes.However, the support is out of this world!  I trialed other EMRs and the wonderful support is what sold me on Therapy Notes. There are tutorials on everything and the support staff is so helpful. Someone will walk you through anything you are having trouble with.  They also follow up calls with step-by-step, clearly written, instructions.  I rarely have had to wait on hold and emails are returned quickly, usually within hours, always within 24 hours."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mary McMahon",
          "Nb_Reviews": 1,
          "Date": "2022-01-23T13:24:47.000Z",
          "Titre": "It’s Great!",
          "Contenu": "I really like Therapy Notes. It’s easy to use and fairly intuitive. The staff is very professional and are always available to help. Only thing I would wish different: that intake documents could be downloaded, printed and uploaded when needed, and documents didn’t expire so quickly in portal. Otherwise, its Great!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Beach Counseling Center",
          "Nb_Reviews": 1,
          "Date": "2021-09-28T19:38:35.000Z",
          "Titre": "TherapyNotes is very easy to schedule",
          "Contenu": "TherapyNotes is very easy to schedule, complete a note, and bill.  They are short on fillable forms for patients, especially during Covid.  The response to the pandemic was slow as patients were not coming in the office, and we had a need to ave fillable forms.   They added a few fillable forms, but not all.  I have been waiting for eprescribe for years, and sadly will have to leave."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Camille M.",
          "Nb_Reviews": 1,
          "Date": "2021-08-03T15:56:07.000Z",
          "Titre": "I have been using Therapy Notes for…",
          "Contenu": "I have been using Therapy Notes for almost 2 years now. It is a great platform, easy to use, and with great customer service. The agents reply very fast, they try to address the issues the best they can and I have seen great improvements and upgrades in the last year. There is still space for the better, especially with the Telehealth options, but in general, this is a great platform that I recommend to anyone."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michelle Coco",
          "Nb_Reviews": 1,
          "Date": "2022-01-27T20:14:46.000Z",
          "Titre": "Consistent Improvements & Strong Customer Service",
          "Contenu": "Not the flashiest EHR out there, but in the years that I've been with them, I've found that they work to continuously improve user experience, keep costs contained, take feedback seriously, and provide customer service that is quick, competent, and kind."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Keith Lewkowitz",
          "Nb_Reviews": 1,
          "Date": "2022-03-21T10:54:48.000Z",
          "Titre": "By and large a well run organization",
          "Contenu": "By and large a well run organization. When I get someone to pick up, the individuals are helpful and detailed. They answer in polite manner and resolve most issues satisfactorily. There are however, i in the past, where I have called and been waiting extensively on hold. No idea when someone will pick up. When someone picks up, as I said prior, the issue is generally resolved satisfactorily. However, I have inquired multiple times over the 12 months and the excuse is too often indicating they hire people and their training takes several weeks. That may be true, but then perhaps more individuals need to be hired to avoid these extensive hold times for customer service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dr. Valentina Pacheco-Cornejo",
          "Nb_Reviews": 1,
          "Date": "2021-04-05T23:00:36.000Z",
          "Titre": "TherapyNotes provides me with…",
          "Contenu": "TherapyNotes provides me with everything that I need to run my HIPAA-compliant private practice. It would get a 5 if I was able to share my screen and invite more than one family member into the virtual video telehealth session (when I have split families), which is now free or a part of the $49/mo fee that they charge."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dr Monique",
          "Nb_Reviews": 2,
          "Date": "2021-04-01T20:23:29.000Z",
          "Titre": "I strongly recommend TherapyNotes",
          "Contenu": "I strongly recommend TherapyNotes. I give 4/5 stars and only take 1 start away as they do not have an electronic consent or way to convert my uploaded consent into an electronic form. Other than that, they rock! Their customer service is on point and their rates (subscription and payment fees) are fair and affordable. They've made billing via a CMS-1500 form super easy, the \"To-Do\" list is imperative to keeping me on track, and the Google calendar sync feature with the TherapyNotes schedule."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MM",
          "Nb_Reviews": 1,
          "Date": "2021-03-02T16:36:36.000Z",
          "Titre": "Recently I had considered using a…",
          "Contenu": "Recently I had considered using a different EHR, but after trialing the potential new one, I realized I wouldn't be getting the phone support that has been so valuable to me since I have been using Therapy Notes.I don't have a lot of time to look through hours of blogs and help articles to try to find the answer I need, so the telephone support has been invaluable.Anyone I have spoken to has been very helpful, professional, and quickly resolve my problem.Thanks again to your support team!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AliciaP",
          "Nb_Reviews": 1,
          "Date": "2020-10-09T18:41:24.000Z",
          "Titre": "Would Recommend",
          "Contenu": "Overall, it is an user-friendly system to engage with.  Customer support  has been a good experience, particularly expediency and follow through. Nicole was really friendly and helpful in chasing down a solution that involved a partner company. Would definitely benefit from more program expansion as related to features. Would definitely recommend."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephanie Little Brave",
          "Nb_Reviews": 1,
          "Date": "2020-07-01T02:21:37.000Z",
          "Titre": "Love having a person to talk to",
          "Contenu": "Love having a person to talk to. SimplePractice took me 3 months to get set up. I was up and running in a week with therapynotes, They each have pros and cons but I was so sick of looking for articles, sending emails and waiting for responses. Therapy notes is fast affordable and has the main components I need. Just a call away with virtually no wait time to speak to a services rep."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael SHANE Luck",
          "Nb_Reviews": 1,
          "Date": "2020-06-26T16:54:58.000Z",
          "Titre": "TherapyNotes continues to be my go to…",
          "Contenu": "TherapyNotes continues to be my go to program.  I have surveyed all the sites and tried several and have come back to TherapyNotes.  With the addition of Telehealth and Forms, I think it is becoming more and more the ERS service we all need in this difficult time.  All of my patients are now on Telehealth services where I can reach them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lara Falberg",
          "Nb_Reviews": 2,
          "Date": "2020-07-08T18:40:34.000Z",
          "Titre": "Really impressed so far!",
          "Contenu": "Really impressed so far! I'm a new customer to TherapyNotes and, so far, I'm really pleased with the customer service. Everyone has been kind, supportive, and genuinely interested in helping. They also get back to you in a very timely manner. It's fairly user-friendly, and if something doesn't automatically make sense, you can get an actual person on the phone to help you figure it out. I'd definitely recommend them for EMD and telehealth services."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donna Hunter",
          "Nb_Reviews": 2,
          "Date": "2020-08-15T12:38:07.000Z",
          "Titre": "Overall I have liked  using Therapy…",
          "Contenu": "Overall I have liked  using Therapy Notes. The platform is clear and easy to use.  I would prefer talking to a human when I need customer service. However my last email interaction regarding the portal, was in a short time answered very succinctly by privacy officer. It addressed all of my concerns very well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JAREE E. WARD",
          "Nb_Reviews": 3,
          "Date": "2020-06-24T15:25:43.000Z",
          "Titre": "I have been using Therapy notes since…2015",
          "Contenu": "I have been using Therapy notes since 2015 when I opened my private practice.  Their product is easy to use and helps me keep track of my clients, billing and any payments made.  There have been a \"few\"  issues over the years, however, the support team has been timely in acknowledging,addressing and resolving this issues.  They have been patient and kind even when I would be upset and frustrated.  I would highly recommend them to anyone who was in need of the services they provide.JaRee Ward MA, LPCC"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "WF",
          "Nb_Reviews": 2,
          "Date": "2018-02-25T14:27:55.000Z",
          "Titre": "Product overall is fantastic and…",
          "Contenu": "Product overall is fantastic and continues to improve. Very occasionally, there will be a technical issue that has some impact on customers and they do a lackluster job of communicating, taking responsibility, and appropriately apologizing, often defaulting to defensiveness and communication about how hard they are working. This comes off to me as apathetic towards my business. All that said, I have other options but stay with them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karla Bailey Cooper",
          "Nb_Reviews": 1,
          "Date": "2017-09-05T17:07:12.000Z",
          "Titre": "My customer service representative was …Sal Zade",
          "Contenu": "My customer service representative was great and completely explained my problem, that several insurance company resources were not able to do.  I've found Therapy Notes customer service reps to be polite, professional, and helpful each time I've called them - that has always made me feel comforted in whatever problem I've encountered as a fairly new user!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "A TN CLIENT",
          "Nb_Reviews": 1,
          "Date": "2016-01-25T14:02:00.000Z",
          "Titre": "If they had ERA'S AUTO POSTING THEY WOULD BE PERFECT",
          "Contenu": "I LIKE THE INTERFACE AND THEY ARE VERY RESPONSIVE WITH QUESTIONS. I WOULD HAVE SUFFERED THROUGH A LESS ATTRACTIVE INTERFACE IF I HAD KNOWN THEY DO NOT HAVE AUTOMATIC POSTING OF ERAs. I WAS CONSIDERING MY \"CLIENTS PLUS\" BUT DIDN'T KNOW THAT TN DIDN'T HAVE IT. TN is more expensive, they don't have the better features! I am a little mad that they keep promising and don't follow through!! COME ON TN!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Monarch Consulting",
          "Nb_Reviews": 1,
          "Date": "2022-06-01T21:44:11.000Z",
          "Titre": "Fantastic Program!  Not so fantastic customer support.",
          "Contenu": "Therapy notes is, by far, the best mental health billing and records software that I have found. It is an elegant product, and very intuitive and user-friendly. The organization of the electronic charts, and the to-do list, are extremely useful, and the coordination with billing is seamless.The four star rating, rather than five stars, is not about the product at all, but the customer support. TN staff misrepresented several things about its ability to handle a large group practice. Since on-boarding the new program, TN has refused to schedule a live support session, simply advising us to “call customer support“ if we have questions. So, if you want a beautiful, extremely functional software package for billing and recordkeeping in a mental health practice, Therapy Notes is the very best! Just don’t expect very good customer support."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Glori Van Brunt",
          "Nb_Reviews": 1,
          "Date": "2014-05-19T15:26:06.000Z",
          "Titre": "Denfinately a \"go to\" for private practice counseling",
          "Contenu": "Therapy notes has met and exceeded my expectations in terms of a program for clinical management! Very versatile and it helps me think through treatment plans. Easy to upload documents to allow me to save on space and be a paper free office! Customer service / technical support are great!!\rCompetitively priced, it's the best out there that I've seen."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shamika Dent",
          "Nb_Reviews": 1,
          "Date": "2015-11-19T05:13:37.281Z",
          "Titre": "Great and Thanks",
          "Contenu": "Therapy notes is the BEST ERS system our practice has used, and believe me we have used a few. It is clean, quick and to the point, and we love it. Thank you Therapy Notes for allowing us more time focused on clients, and less time focused on navigating chaotic ERS systems... Thank you Therapy Notes Team <3 Team Trinity"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shane Luck",
          "Nb_Reviews": 1,
          "Date": "2016-06-25T01:08:18.000Z",
          "Titre": "Works great.",
          "Contenu": "Works great and support is good.  Especially like the \"to do\" lists and reminders.  Needs ability for clients to complete forms in client portal and sign treatment plans, releases, etc.  I have compared to other top programs and TherapyNotes is the most comprehensive and responsive for my needs."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jay Pesek",
          "Nb_Reviews": 1,
          "Date": "2014-05-17T08:41:30.000Z",
          "Titre": "So far... so great.",
          "Contenu": "This program is saving me about an extra 7 hours in a week which is almost a full work (or weekend) I was sacrificing - so our NP is trying it our and low and behold it is geared to her needs template wise - with the billing and all else the same - and once they an add e-prescribing we are dropping our big name web-based client and RUNNING with our psychiatrist to sign up. We use it currently also in our opiate treatment practice for detailed and very manageable ways to be HIPAA and DEA compliant."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Drew Buss",
          "Nb_Reviews": 1,
          "Date": "2014-10-24T15:21:27.000Z",
          "Titre": "Solid EHR and billing platform...",
          "Contenu": "...might consider a 5 star review if; 1) the program allowed users to itemize or otherwise customize patient statements (showing amounts billed, write-offs, insurance payments, amounts due/expected from insurance and patients); 2) the program allowed specification of insurance adjustments (write-offs vs co-pays vs coinsurance vs deductible amounts); or even if 3) Therapy Notes support would have responded to these submitted requests with a simple acknowledgement that they were received and being considered."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "frustrated",
          "Nb_Reviews": 4,
          "Date": "2020-06-17T02:06:06.000Z",
          "Titre": "Therapy notes- easy to use, great service, inexpensive…",
          "Contenu": "Therapy notes is inexpensive and a good tool for therapists and counselors.  Their strongest attribute is their people.  They are available more than most companies, answer their phones quickly, will stay on the phone with you until the problem is solved, and send follow up emails, personally.  Their customer support is excellent. electronica remittance and payment is fairly easy and convenience, as is credit card payments, statements, and text reminders to patients.   The program could use some work for billing and statements, and format of how notes print out, but overall, it's a nice program, and really affordable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "D. Potts LMSW, LCDC",
          "Nb_Reviews": 1,
          "Date": "2014-05-19T17:34:05.000Z",
          "Titre": "This program is excellant for those in private practice.",
          "Contenu": "I find this program to work well for my needs. There are some features that I wish I could customize; however, those are easily enough overlooked for the value of using TherapyNotes. I do not currently have to pay for it (my agency does); that said, from what I see, it looks as if the billing portion works as well as it is supposed to (my agency doesn't use that feature) then it can definitely be cost effective for those in private practice.\r When I do go into private practice in the next 6 months, I will look into acquiring it for myself."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian T",
          "Nb_Reviews": 1,
          "Date": "2017-10-26T15:26:17.000Z",
          "Titre": "TherapyNotes is an amazing software …",
          "Contenu": "TherapyNotes is an amazing software that helps streamline and efficiently manage my psychotherapy practice. I’ve saved countless hours and money through their very reasonable monthly subscription fee and integrated billing and electronic EOB / payment posting features. Their customer service / helpdesk team is very reliable, accessible, professional, and knowledgeable about the intricacies of their product and features. I would highly recommend this softer ware to any psychiatric / psychological practice, whether you have one employee or 50! I don’t know where I’d be without it!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "n/a",
          "Nb_Reviews": 1,
          "Date": "2017-11-08T23:56:23.000Z",
          "Titre": "Works very well most of the time",
          "Contenu": "Works very well most of the time. Sometimes is slow on updating schedule on all persons schedule. I.e. appointment shows up under the receptionist account but not therapist or vice versa, which can lead to problems when multiple people are making schedules."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lisa Steelsmith",
          "Nb_Reviews": 2,
          "Date": "2020-06-23T15:28:51.000Z",
          "Titre": "Therapy Notes has been easy to use",
          "Contenu": "Therapy Notes has been easy to use to start up my own business. They are beta-testing an integrated telehealth platform presently. I use their credit card processing software too. The only reason they only get 4 stars (would have been 4.5) is because they do not offer a secure messaging component to allow communication about clinical versus scheduling/payment info. I also have requested that they allow creation of a report clinician's can use for the field \"Plan\" at the end of Progress Reports. It would be handy to be able to create a pdf of clients to be seen that day, and what we had planned for the time between sessions and this session."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrea",
          "Nb_Reviews": 1,
          "Date": "2020-03-14T19:27:53.000Z",
          "Titre": "User Friendly and Good Costumer Service",
          "Contenu": "I chose TherapyNotes over a similar platform because I found it easier to navigate, particularly at first and in completing Intake Notes. I wish it had embedded treatment plans to draw from or the ability for me to create some standard plans relevant to diagnosis so that I'm not rewriting plans from scratch with each new client. At times, I have found the \"How To\" instructions to be confusing, but their costumer service has been fantastic in that you can speak to someone and get answers quickly. I appreciate the reminders for treatment plan updates and the To-Do list. It's also great that they send appointment reminders to clients."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CJ",
          "Nb_Reviews": 1,
          "Date": "2020-01-29T14:37:14.000Z",
          "Titre": "The Therapy Notes customer service…",
          "Contenu": "The Therapy Notes customer service representative listened to my concerns, demonstrated patience, and walked me through the resolution process. I appreciated her assistance after trying to resolve the issue on my own. Thanks, TNCJ"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Erin B",
          "Nb_Reviews": 1,
          "Date": "2019-04-01T15:12:06.000Z",
          "Titre": "User friendly and streamlined",
          "Contenu": "I really like the interface of TherapyNotes and the free trial was very helpful as I was building my practice and didn't want to have a lot of startup costs before getting clients in the door. I also tried Simple Practice for a month and liked TherapyNotes better in terms of their scheduling, billing and fees overall. My only reservation is the client portal and credit card processing. I wish that a client could log into the client portal and enter their own credit card information. Accepting credit cards through TherapyNotes has seemed to be cumbersome and confusing, so I have yet to do this, but likely will in the future."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Yana Peleg & Katie Bond",
          "Nb_Reviews": 1,
          "Date": "2014-05-25T16:17:22.000Z",
          "Titre": "It has transformed the way we operate our clinic.",
          "Contenu": "Over two years ago, after much reluctance (we consider ourselves traditional psychotherapists in that sense), we made the decision to start transitioning all of our clinical records to an online service.  From the beginning, TherapyNotes was intuitive, user-friendly, and had supportive staff who were always receptive to our feedback. It has truly allowed us to take our business to an increased level of efficiency and effectiveness without compromising client care.  Now, we can optimize what we do best, which is spending time with our clients, and minimizes getting bogged down in the details."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Diane Franz for Southern Tier Counseling Solutions",
          "Nb_Reviews": 2,
          "Date": "2016-02-24T21:34:23.000Z",
          "Titre": "therapy notes review",
          "Contenu": "Like this program more than others I tried. I do wish the enrollment with payers went faster. Going on a month and still waiting. Process takes up to 6 weeks. That said I do like the notes and treatment plans aspect of this program a lot! Very simple."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joy Hopper",
          "Nb_Reviews": 1,
          "Date": "2021-01-08T22:31:44.000Z",
          "Titre": "Excellent Support",
          "Contenu": "Excellent Support! Everytime I call with a question, regardless of what time of day, I'm always met with an associate who is knowledgable and professional. Every so often in the three months that I've been working with Therapy Notes, I've found that when I come across something tricky I meet with a customer service associate that is excellent and goes above and beyond to try to fix an issue. Today it was Ryan. As I work more with the software, I'm sure I'll find some things that I'd like to improve, or more features that I'd like to see if available, but for now it meets my needs and is very user friendly. And for when it's not - there's that excellent support team!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richale",
          "Nb_Reviews": 1,
          "Date": "2021-04-02T16:34:09.000Z",
          "Titre": "I love me some Captain Nicole & TherapyNotes!!",
          "Contenu": "I love Captain Nicole...she was so helpful. The best part of Therapy Notes for me is the customer support. Sure they have improvements to make but so does everyone and you can't beat great customer service with REAL people. They are always so helpful but today Captain Nicole lead my private practice to victory in resolving claims, insurance payments, and client balances. She was patient, kind, she laughed with us, and helped us solve our problems with efficiency and skill. Thank you so much Nicole...I know a leader when I encounter one and you my dear are a BORN LEADER!!!  Hence the name I crowned you...Captain Nicole! Blessings to you and TN for hiring great talent to support small private practice clinicians like myself."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sara",
          "Nb_Reviews": 1,
          "Date": "2015-10-23T04:11:09.999Z",
          "Titre": "Great software",
          "Contenu": "Overall I love this software...loving being able to access it anyway, being able to sync the calendar to my phone.  I wish there was a waitlist option and that the ERA's were functioning but hopefully in time those options will be updated."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lisa Taylor-Austin",
          "Nb_Reviews": 2,
          "Date": "2014-05-18T01:45:47.000Z",
          "Titre": "Easy!",
          "Contenu": "I looked at many different programs and selected TherapyNotes for ease of use. I figured it out myself and didn't need any training. I find things easily and quickly. I would give it 5 stars if there was more professional customer service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sarah Keller",
          "Nb_Reviews": 1,
          "Date": "2021-04-27T20:10:33.000Z",
          "Titre": "Amazing customer support!",
          "Contenu": "I am still new to TherapyNotes and am sometimes finding things they could improve on, but overall it's been a good transition. I can't say enough good things about the support team! I have contacted them a couple times by phone and there is hardly any wait on hold and they will walk me through solving issues. I have sent several emails asking for help (especially since I'm new to it) and they always reply with step by step instructions on how to solve my issues. The support is amazing, quite honestly, and their availability to help is fantastic! I did give an overall of 4 stars because I wish some features were a little different but I would give the customer service and support 5 stars, hands down. They make solving issues a priority."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cynthia Magistro",
          "Nb_Reviews": 1,
          "Date": "2014-05-22T22:07:12.000Z",
          "Titre": "I'm glad I use TherapyNotes; it is worth the monthly fee.",
          "Contenu": "I began my private practice almost a year ago, and it can be quite overwhelming. Using TherapyNotes gives me peace of mind because I feel confident that my documentation and billing are confidential, complete, and HIPPA compliant. It is alsogood to have everything in one place, and I appreciate that I can access my practice information easily from home or the office. \rThe reason I gave the program a 4 instead of 5 is simply that it isn't as customizable as I would like. I can change the list of interventions, but I can't revise other cmenus to fit my therapeutic approach. \rStill, it is a great help, and I plan to continue to use it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LaTania Williams McAdoo",
          "Nb_Reviews": 1,
          "Date": "2019-07-15T02:23:42.000Z",
          "Titre": "This rating would be five stars if…",
          "Contenu": "This rating would be five stars if Therapy Notes created an online method for clients to do the intake paperwork.  I don't mean upload and save it, I mean a web-based method like many of the other HRA companies use that upload intake information directly into client's record..  It was almost a deal breaker, but since I used Therapy Notes at my last agency, I didn't have time to learn a new system when I started my private practice Other than this, I feel that Therapy Notes is a great company.  The hold time is minimal, they always follow up with an email and written instructions and they are open on Saturdays!!Did I mention the customer service is great and the staff is very patient?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Aleta Fox",
          "Nb_Reviews": 1,
          "Date": "2020-06-03T21:12:02.000Z",
          "Titre": "I've been using Therapy Notes for 4…",
          "Contenu": "I've been using Therapy Notes for 4 years.  It is the only practice website I have used but there is a reason for that.  They have always come through.  Thank you Therapy Notes for all your help!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richelle Stevenson",
          "Nb_Reviews": 1,
          "Date": "2020-06-29T20:46:06.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "Excellent customer service!  Unfortunately this is only targeted at mental health therapy and doesn't really have a simple set-up for physical therapy or occupational therapy.  All appointment options were labeled \"psychiatric\" so the only way to have a physical therapy evaluation, treatment session, massage session, personal training, etc was to use the label \"consultation.\"  Danny was extremely helpful in walking me through a few ways to adjust the system towards physical therapy instead of mental health, but I needed something simpler with easier access for CPT codes and how-to-videos.  I highly recommend if you need a mental health MNR as customer service responded within 45 minutes and provided thorough instructions."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Denise Alexander",
          "Nb_Reviews": 1,
          "Date": "2016-11-26T18:00:48.000Z",
          "Titre": "Great Tool, but...",
          "Contenu": "I love using Therapy Notes. The only issue is that sometimes the site is slow or for one reason or another is not up and running. Luckily this does not happen very much. Otherwise, the site is absolutely wonderful!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jennifer Forbes",
          "Nb_Reviews": 1,
          "Date": "2017-08-28T19:50:49.000Z",
          "Titre": "Therapy Notes has great customer …",
          "Contenu": "Therapy Notes has great customer service!!  They are very quick to respond.  And while the application itself has some opportunities for improvement, I would say that they are responsive to my suggestions."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrew R. Morton, LICSW",
          "Nb_Reviews": 1,
          "Date": "2018-03-19T13:26:33.000Z",
          "Titre": "TherapyNotes is almost there.",
          "Contenu": "I’ve used TherapyNotes since 2012 when I made the switch from another EMR. Without fail, TherapyNotes has made monthly updates since then giving the user a very polished experience. On the few occassions I’ve needed technical support, they’ve usually responded within the business day. Any web-based service experiences occassional glitches and outages, and TherapyNotes has been no different. While I don’t fault them for this, their communication about what is happening could be improved. Additionally, they’ve yet to release patient portal functionality that allows new patients to complete paperwork online (and they’ve been talking about it for years). When they accomplish this, TherapyNotes will be THE small practice EMR/EHR to use."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Gardin II, Ph.D.",
          "Nb_Reviews": 1,
          "Date": "2018-04-30T19:54:35.000Z",
          "Titre": "Almost heaven from a private practitioner of almost 45 years",
          "Contenu": "I have been a practitioner in private practice and an administrator in various programs for about 45 years.  I am now in solo private practice and wanted a software that would do it all - history, notes, treatment plans, billing.  Although I haven’t quite figured billing out yet, I’m now ready to tackle it.  If their support for billing is anything like there support for everything else, this is going to be a cakewalk.  My only complaint is that there is no “auto-save” when creating documents.  More than once I am in the middle of taking a history, and my patient takes a side path - by the time I look down, I’m being asked to log in again - and all my work on that page - I mean ALL my work - is gone.  Fixing that would make this a 5+ stars for me"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karen Bekker",
          "Nb_Reviews": 8,
          "Date": "2017-06-23T14:30:34.000Z",
          "Titre": "I have just started with therapy notes",
          "Contenu": "I have just started with therapy notes, but so far I have found the program to be a significant step up from the one I was using before and the staff to be excellent--really helpful and responsive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jacques Lipetz",
          "Nb_Reviews": 1,
          "Date": "2018-01-30T20:10:21.000Z",
          "Titre": "Support is superb",
          "Contenu": "Support is superb!  Program is user friendly and meets most of my needs. There are some lacunae for my needs, but I suspect that TN will help and/or develop methods of dealing with these minutea."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Liz Frater, Medical Biller",
          "Nb_Reviews": 1,
          "Date": "2020-04-20T18:22:22.000Z",
          "Titre": "Compared to other Mental health Billing…",
          "Contenu": "Compared to other Mental health Billing platforms this is much more user friendly. The billing side is better and more usable. Customer Service is great and has a quick response."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Phillip Davis",
          "Nb_Reviews": 1,
          "Date": "2022-01-03T16:49:15.000Z",
          "Titre": "Pretty easy setup",
          "Contenu": "Pretty easy setup. Get the insurance all set up and signed up for ERA's was the worst part. Once things are done and set up it is pretty easy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "M McKenzie",
          "Nb_Reviews": 1,
          "Date": "2020-03-31T19:39:11.000Z",
          "Titre": "I was very nervous upon calling as I…",
          "Contenu": "I was very nervous upon calling as I did not think i could keep up with support questions.  I talked with 2 different gentlemen who kept me calm and focused on my problem."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kristy Burton",
          "Nb_Reviews": 1,
          "Date": "2019-11-07T21:13:34.000Z",
          "Titre": "Good but not yet great",
          "Contenu": "Love the product. I do wish the financials were more user friendly - such as copay vs insurance payment balances, ability to check a client in or out, easier receipts."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "BH",
          "Nb_Reviews": 1,
          "Date": "2015-09-30T00:46:09.677Z",
          "Titre": "Good service. Happy with the product.",
          "Contenu": "Happy with the ability to write notes from anywhere. Happy as well with drop-down options.\rWish there was more of an option for sample interventions based upon best practice."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mitch Mueller",
          "Nb_Reviews": 1,
          "Date": "2020-04-27T20:37:54.000Z",
          "Titre": "Portal=bad, interface and insurance verification=good",
          "Contenu": "Inteface is clean and intuitive for the most part which helps the learning curve.  The biggest criticism is that the portal is cumbersome.  You have to send patients an invitation to create an account, then they create the account, then you send them an invitation to complete intake paperwork, then they completed the paperwork and upload in the portal.  That's too many steps.  They should be able to create an account and upload the paperwork on their own.  It doesn't need to be any more complicated than a Gmail account.  This would especially be helpful for a solo practitioner like me.  I want to spend more time doing therapy, not emailing back and forth about paperwork.  I don't even use the portal feature because of this.  The biggest plus is the instant insurance verification.  That saves me a ton of time not having to call the insurance companies to verify benefits."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tacha Fletcher, LCSW",
          "Nb_Reviews": 1,
          "Date": "2019-08-20T03:02:10.000Z",
          "Titre": "Thumbs up!",
          "Contenu": "Compatible on computer, tablet, and mobile is a plus. User friendly and easy to navigate. The 'to do' list is handy and helps keep records up to date."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Admin Assistant",
          "Nb_Reviews": 1,
          "Date": "2020-10-21T15:50:41.000Z",
          "Titre": "Had repeated issues with one…",
          "Contenu": "Had repeated issues with one TherapyPortal feature, but a rep worked through it with us. They were quick to respond and thorough in their answers."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Corie Putnam, LMHC",
          "Nb_Reviews": 1,
          "Date": "2021-05-07T17:22:36.000Z",
          "Titre": "Great platform with room to improve. Would highly recommend",
          "Contenu": "I have used Therapynotes for years.  I love that the system is simple and easy to use.  The billing process is streamlined so it doesn't take hours to submit claims.  Note keeping is straightforward and they provide templates for every kind of note that I've needed to make.  There is room for improvement though.  It would be so helpful if the provided client information form included a place for insurance information and that transferred automatically to the client billing settings. Also, while the telehealth platform is very convenient and works well, I cannot then access client information or paperwork during the session.  It would be helpful, especially with the new screen sharing option, to be able to show clients how to upload forms or use the client portal and such.  (Maybe I'm missing something and should be able to do that).  Overall, I think Therapynotes is a great platform and I will continue to use it for my practice needs and recommend it to others."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carol Cirabisi",
          "Nb_Reviews": 2,
          "Date": "2018-02-19T21:23:11.000Z",
          "Titre": "Hopeful...and happy so far!",
          "Contenu": "Over the last several weeks (months?), TN has had some real trouble with it servers and it was wreaking havoc with our practice management.  I was almost to the point of of reviewing other software programs, but because of the great service I had received up until that point, and because of all the great features that TN offers, I was reluctant to go elsewhere.My patience paid off.  I am happy to say that at this point it would seem that any of the issues have been rectified...and I know this mostly because I have gotten back to a place of not even having to think about how the software is working because it is doing what it was created to do.  So I don't have to think about it!  I am hopeful that all is well, and that I can continue to \"ignore\" the program, and just use it as effortlessly and intuitively as I was prior to the problems!I am sure it was pretty stressful over there behind the scenes, too.  I hope none of us will have to go through this again!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Khalio Borum",
          "Nb_Reviews": 1,
          "Date": "2015-05-20T21:32:34.490Z",
          "Titre": "Very reliable pilot that is handy and secure.",
          "Contenu": "Therapy Notes has been very helpful with keeping me up-to-date with future appointments and different types of notes for individual clients."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pamela Lawson",
          "Nb_Reviews": 1,
          "Date": "2021-11-15T00:34:14.000Z",
          "Titre": "I think TherapyNotes is a great…",
          "Contenu": "I think TherapyNotes is a great platform. My only complaint would be the poor reception during telehealth."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kallie Baudine",
          "Nb_Reviews": 2,
          "Date": "2021-02-15T13:08:58.000Z",
          "Titre": "therapy notes have made my professional…",
          "Contenu": "therapy notes have made my professional life so much easier. They are all so great! thank you for your service!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "SHERITA HARVEY",
          "Nb_Reviews": 1,
          "Date": "2020-12-07T22:54:14.000Z",
          "Titre": "Excellent piece of software",
          "Contenu": "Excellent piece of software, excellent customer service. Great tool for students to learn on. Very user friendly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike Misterka",
          "Nb_Reviews": 1,
          "Date": "2015-10-12T01:57:29.189Z",
          "Titre": "i rate it at a 4 1/2 since nothing is perfect but they try very hard.",
          "Contenu": "i like the format. i can breeze thru some parts and focus on the type of notes that i need to help me do therapy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nicole Nichols",
          "Nb_Reviews": 1,
          "Date": "2022-01-10T01:42:18.000Z",
          "Titre": "I have been using Therapynotes for 2 months",
          "Contenu": "I have been using Therapynotes for about 2 months now.  It has made billing a lot lot easier. I appreciate being able to bill with a click of a button.  I also appreciate being able to decline appointments.  There could be room for improvement there as they don't alert the client that the appointment was declined, you have to do that yourself but it's also easy to miss the message that lets you know that.Also setting up billing can be a tad bit confusing and a bit of a nuance but once it's done its all good.  There has been a big delay in receiving payment, but I believe that is on part of the insurance company.Video is pretty good and pretty easy to get to.  I have found though that the video will lag on occasion and act up.  It also appears to always say that internet connection is poor for both parties; I am not sure what that is about.  All in all I can say I do like the platform.  They have even made some small changes in the short period of time I've been on.Once thing I can say is stellar is the amount of support, they give you.  There are videos and helpful blogs everywhere, but they are also always reaching out to see if you need assistance with anything.  They call, email, and just reach out if they feel you need anything.  I think the platform is awesome and I am pleased with my decision."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Leonard De Forge",
          "Nb_Reviews": 2,
          "Date": "2018-06-11T21:04:40.000Z",
          "Titre": "The note design and easy to use…",
          "Contenu": "The note design and easy to use features are awesome for clinicians that have been avoiding EHR."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Greg Ieraci",
          "Nb_Reviews": 1,
          "Date": "2019-02-26T13:32:09.000Z",
          "Titre": "All in all, a fantastic program.",
          "Contenu": "I have been using TherapyNotes since 2016. It is an amazing tool and has greatly automated my practice.  Things I love:-Insurance Billing is a SNAP!  Two clicks and  the claim is filed! I love the fact that the claim only gets filed when the note is complete.  This can be a life saver if I am ever audited. -Customer Support is THE BEST!  And it is live by phone if you choose.-Treatment planning templates are clear and concise. It takes me 3 minutes to do a simplified treatment plan when I use Practice Planners.-The automatic to-do list is fantastic. It is all in one place and keeps me organized. Things that are needed:- A dedicated scheduling app that has direct access to the scheduling calendar.  Other EMR software packages have this.- The ability to create online forms that can be filled out directly from the patient portal. The signature application is good but I want to be able to use my therapy contract and intake. Right now I email, print, and scan.- An attached HIPPA compliant email system that opens when the client email is clicked. You could partner with someone for this and add the subscription price as an extra. -Online therapy portal that is HIPPA compliant.  I use another application for this and it is working great but it would be nice to have it all in one place."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Westbrook Psychological Services",
          "Nb_Reviews": 1,
          "Date": "2018-07-06T01:43:33.000Z",
          "Titre": "New User",
          "Contenu": "Just started using the program and our clinicians are enjoying it's easy to use design."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Molli",
          "Nb_Reviews": 3,
          "Date": "2020-10-05T22:01:25.000Z",
          "Titre": "Therapy Notes is a good program",
          "Contenu": "Therapy Notes is a good program. It works well for our office of 30-some providers."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Garnet Moore",
          "Nb_Reviews": 1,
          "Date": "2015-02-10T19:16:34.000Z",
          "Titre": "Simpicity",
          "Contenu": "I really appreciate the Simplicity and easy to use applications stored on Therapy notes"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Heidi Savell",
          "Nb_Reviews": 1,
          "Date": "2020-09-23T19:48:04.000Z",
          "Titre": "Helpful responsive customer support",
          "Contenu": "Helpful responsive customer support, and very easy to use."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Annie Hall",
          "Nb_Reviews": 1,
          "Date": "2016-09-28T17:32:17.000Z",
          "Titre": "it works",
          "Contenu": "very easy to use and user friendly. Customer service is great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Caroline",
          "Nb_Reviews": 1,
          "Date": "2020-05-19T23:37:36.000Z",
          "Titre": "Satisfied",
          "Contenu": "I have been really satisfied with TherapyNotes. I am a single practice provider so I wanted something which was easy to use for myself and my patients. With the big key items of wanting the software to be reliable, not regularly having connection issues on me, and user friendly. That has been met. I have used other complex EHR systems and it does not help with efficiency.Connection and Access Issues: Minimal to none. I have to think hard to remember a time I had problems. I do remember when there were issues it was resolved quickly in no longer than 60 minutes. Access to Support: Amazing! This is one of TherapyNotes greatest assets. They have real time support and you get someone quickly. Meaning 5-10 minutes quickly! For those in private practice this is like gold for your time. Additionally that are great for getting things resolved with the support. Clinician Features: You can do documentation, scheduling, billing, and tracking of tasks all in one. The system is not complex which I like. If you want very detailed options for intake, treatment plans, and client notes this may not be for you. If you like the set up of SOAP note format you will be happy with the notes template. I do not use the billing system to submit to third party payers so I can not give feedback on it. My one compliant is I wish I could get more of my own personal documents to upload to the client portal for clients to fill out for their intake. Additionally I like to give patients questionnaires to fill out. Being totally electronic with COVID-19 did not allow this. Patient Features: They are able to obtain portal access and the set up is easy from what I hear. The portal is nice since clients can request appointments, view and e sign documents."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rodney Beck",
          "Nb_Reviews": 1,
          "Date": "2018-05-23T16:45:02.000Z",
          "Titre": "Support at start-up",
          "Contenu": "Early support has been very good to this point.;"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2021-02-18T01:19:47.000Z",
          "Titre": "Cash or check payment option",
          "Contenu": "\"Our practices would prefer to manage the relationship with their clients.\"This client would prefer to manage her own financial information on your site herself and does not care what a practice may prefer!  I don't understand why this is so hard for you to understand.  Your site stores the financial information.  You are responsible for it.  I highly doubt you are able to secure the data given the recent SolarWinds breech.  I doubt you even know if your site is hosted by a compromised cloud provider.\"We do have some ideas to add a feature allowing patients to enter one-off payments on the portal that doesn't require a card to be stored for future charges. But there is no way for you to push cash into a digital portal that I can think of. We are considering adding eChecks features in the future.\"This is a great idea!  I understand you cannot take cash.Per TrustPilots website, \"Trustpilot is here to help you shape and improve the world. We do it by giving you a powerful, open-to-all review platform where you can share and discover experiences, and connect with businesses to help them improve.\"  Note TrustPilot states open-to-all.I'm sorry you feel the review is unfair.  I believe that not giving any support or consideration to the ultimate consumer of your product, the consumer who pays your bills, is also unfair.  Your phone agents will not support patients leaving me no choice but to get your attention via a public forum.I am a patient but that does not change my concern.  I have since found out that a patient has no control over their own credit card (cannot change or delete) information once entered.  The only was to change or delete is to ask the clinician to allow it.  Legitimate medical portals do allow the patient to control their information.Let me know how to reach out to you directly per your response to my original review and I will be happy to discuss with you.  TherapyNotes should provide a way for clients to pay with check or cash as well as authorize all credit card transactions individually.  Holding a client credit card with an agreement that the therapist can charge with no notice invites abuse.  Not allowing payment by cash or check is a discriminatory practice which is becoming outlawed in some states."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gregory Milbourne",
          "Nb_Reviews": 2,
          "Date": "2016-11-03T17:03:37.000Z",
          "Titre": "Pleased to have made the decision to make the switch from paper to electronic records",
          "Contenu": "An evolving and improving product."
        },
        {
          "Note": 4,
          "Lieu": "MY",
          "Pseudo": "Halim Amelae",
          "Nb_Reviews": 2,
          "Date": "2021-03-05T13:31:17.000Z",
          "Titre": "No complaints.",
          "Contenu": "Only gratitude."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karen Muehl, Ph.D.",
          "Nb_Reviews": 1,
          "Date": "2014-05-20T14:54:54.000Z",
          "Titre": "I'm very satisfied",
          "Contenu": "I am in solo private practice and I wanted to go paperless.  I looked pretty carefully at several different software options (made a spreadsheet to compare, did free trials) and even though TN was at the top of my budget I decided it was the best value for the things that were important to me.  Here's why I chose TN:\r--I wanted a reputable company that was well-established and trustworthy\r--I wanted one program for all of the following: scheduling appointments, writing client notes, uploading client documents, keeping a credit card on file, keeping track of payments, filing insurance claims with BCBS, and automatic appointment reminders sent to clients by email and text.\rTN was recommended to me by a friend and I've been using for 6 months now.  Here are some reasons I have grown to love it:\r--Calendar - syncs with my iphone and gmail calendar but only uses client initials, so onlookers can't see patient names\r--Notes - Intake note, progress notes, contact notes, treatment plan are all structured in a way that matches really well with the information I collect and how I like to write it up.  Check boxes for interventions make it easy to document what you did in treatment.  Everything is linked to the client's treatment plan and it prompts you to update the plan if the client completes goals or if the diagnosis is changed.   \r--To Do list tells me which notes still need to be done.  You can add reminders to yourself within each client record, and I recently asked TN to add a feature so I can put overall To Do items on my list and they said yes, it's coming.\r--Insurance claims - after trying to file paper claims and being rejected a million times I was shocked (with delight) the first time I filed an electronic claim with TN and it went through without a problem.  I've now filed claims for 4 different clients with different BCBS plans and they get paid the first time around.  This is probably the most valuable thing to me right now!  It's also really easy to track what is submitted and then enter payment when the check arrives.  There is no separate Clearinghouse - it is all integrated.\r--Customer support - Any time I have a question or need help with something, the TN support staff are prompt and friendly.  I've gotten things resolved very quickly.\r--Credit Cards - This is huge.  I was using the Square but it meant I had to keep a copy of the credit card number on file.  With the new CC feature I enter the card and it gets encoded and is kept secure and then I just click to charge it.  I love that it is integrated into the software.  Also, you don't need a card reader.  I was deterred at first because I didn't want to spend $60 on a card swiper but I realized you can just enter the number the first time and then it is saved and you don't do anything else.  Seems like the most secure option I could find.\r--Revenue reports - I am not a financial/Excel person and I find the reports on TN to be very easy to understand, and helpful to see how much money I am making. \r--Uploading documents - One you have uploaded documents you can open them and they appear in a new tab without being downloaded.  This is nice because then you don't have to go back and clear downloads from your browser or delete from your download folder and then empty trash.  Keeps confidential info off your actual computer.    \rThe only cons for me are:\r--Price - Value or not, it's a lot of money over the course of a year.\r--Contact note revisions - For email exchanges with clients I like to create a contact note for the first email I send, and then it would be nice to be able to add to that same note the way you would see a 'thread' on a message board.  The way it is now you can't group the different contacts together.  If you revise the note you can't tell the differents dates of each contact unless you add them into the text or go through the revision history.\r--Couples - There is not a great way to handle records for couples clients.  I use one partner as the primary client and then add the other partner as a contact, but then I am not able to add a separate intake for each partner.  If you make them two separate clients you can't scehdule them both for an appointment together.  If you see a lot of couples this is something you should evaluate carefully."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debra C.",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T22:47:10.000Z",
          "Titre": "Wonderful Therapy Note's Customer Success Representative…",
          "Contenu": "Therapy Note's Customer Success Representative, Benjamin H., thoroughly answered my concerns about my client records after retirement and put my mind at ease.  He followed up with a detailed email about everything that we discussed and more...  So very helpful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandy Kemink",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T18:14:03.000Z",
          "Titre": "Excellent Customer Service!!!",
          "Contenu": "Therapy Notes does an excellent job with their Customer Service! I spoke with Olivia today and presented two questions which she quickly solved for me. She was pleasant, informed, and helpful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Meghan Grzetich",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T15:51:07.000Z",
          "Titre": "Helpful & Great Customer Support!",
          "Contenu": "TherapyNotes is so easy to use and perfect for a Mental Health Practice.  The support is easy to access when you have a question and the customer service is amazing.  They answer questions quickly and thoroughly and are always easy to work with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Katherine M",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T20:46:51.000Z",
          "Titre": "TherapyNotes LISTENS to their customers!",
          "Contenu": "TherapyNotes can't be beat for their exceptional customer service.  They welcome client feedback and, in the past year, have made significant improvements in their client portal, screener tools, intake process, and they are working on a few billing improvements as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angela Wilbur, Psy.D.",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T00:32:26.000Z",
          "Titre": "I've been in private practice for 1.5…",
          "Contenu": "I've been in private practice for 1.5 years and I could not be happier with Therapy Notes as my EHR. They have the absolute best customer service when I am struggling with insurances changes, easy to use templates and love all the extra features that help me have a successful practice. I highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barbara Lovelady",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T22:01:53.000Z",
          "Titre": "Just a typical call",
          "Contenu": "This was just a typical interaction with TN. The thing that I appreciate is the I HATE phone calls. But because of the consistent positive response I get from TN, I don't dread (or put off) calling. They are efficient and friendly, and find a way to explain things in a way that makes sense quickly. The summary email they send afterward is a lifesaver for not having to keep calling about the same issue. They have, without a doubt, the single best customer service I've ever experienced."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Quinett Simmons",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T21:51:28.000Z",
          "Titre": "Thank you Lymari and Rob",
          "Contenu": "Thank you Lymari and Rob!  I appreciate the kind and patient assistance as I learn billing. Lymari thank you for the link to the class.  I will be signing up soon for that event. I appreciate you thinking 'outside' the box and letting me know about this billing class."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erin Weingart",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T15:41:40.000Z",
          "Titre": "Love TherapyNotes",
          "Contenu": "I have been a user of TherapyNotes for my group practice for 5 years and have been so happy.  The customer service is outstanding, and follow through is terrific!  I trialed mannnnnyy EHR's and so glad I landed on TherapyNotes!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Abbie H",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T22:16:51.000Z",
          "Titre": "Amazing service and customer service",
          "Contenu": "Amazing service and customer service! Our office has thoroughly enjoyed TherapyNotes. Their support staff are phenomenal and always quick to respond to our concerns or questions. They are thorough and very pleasant to speak with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phyllis Tobias",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T04:32:11.000Z",
          "Titre": "Thank You",
          "Contenu": "I have no idea what I would do without Therapy Notes!! Their platform is extremely comprehensive!! It’s like “one stop shopping” for all of your private practice needs!! Their customer service is also really great!! They are always professional, patient and really know what they are doing!! As a bonus, a follow up email is sent w the directions discussed on your call. A big shout out to Olivia at TN tonight (a Saturday night) helping me understand what I needed to do to make important edits to a client’s document(s)."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David J",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T18:53:02.000Z",
          "Titre": "Makes my practice so much easier to run",
          "Contenu": "The software is easy to set up and use.  Lots of automated functions, easy tracking reports, and embedded forms and assessments.  Mobile interface is also very good.  Tech Support has been wonderful with problem-solving, and the company is very responsive with requests for new functions.  This is the best EMR I've ever used."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peggy Williams",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T18:32:53.000Z",
          "Titre": "I never hesitate to call support…",
          "Contenu": "I never hesitate to call support persons at TherapyNotes.  Today I spoke with Sarah P. and she walked me through what I considered a complicated issue as if it was a walk in the park.  She was clear and super supportive.  I highly recommend calling when you have issues!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Beth",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T18:27:30.000Z",
          "Titre": "Helpful Support",
          "Contenu": "The Therapy Notes representative understood my claims issue very quickly and took action to correct it.   He was friendly and caring about the frustrations I had trying to resolve the issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Heather Radish",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T16:00:13.000Z",
          "Titre": "Wonderful customer service",
          "Contenu": "The customer support from Therapy Notes is great! They are quick to respond and always keep you notified of the progress."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MARIA WEAVER",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T01:53:39.000Z",
          "Titre": "Therapy Notes",
          "Contenu": "Therapy Notes, honestly has the VERY best customer service ever.  Not only is their EHR the very best, but the way they handle things goes above and beyond.  If you are not using Therapy Notes for your EHR, you are not doing your practice justice.  The ease of use along with the excellent customer service experience far exceeds anything out there."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen C",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T03:04:33.000Z",
          "Titre": "Patient professional and efficient…",
          "Contenu": "Patient professional and efficient service, no wasting time with FAQs, chatbot, or email requests. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan Gibson",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T19:31:13.000Z",
          "Titre": "Super Helpful Staff",
          "Contenu": "The staff is always friendly, super knowledgeable and encouraging.  I never hesitate to call them whenever I have an issue I can't resolve on my own.  Whatever the problem, the staff solves it in minutes.  Thank you TNotes support!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Katelyn Six",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T18:24:36.000Z",
          "Titre": "Support Team is Super Helpful",
          "Contenu": "When I called in to Support after being worried about a possible technical bug, the Support rep was able to dig into my issues and help find answers to my questions so I could provide the right info to my clinicians. It was a great experience and I felt like they were receptive to my concerns and stuck with me to figure out answers. Very thankful for the Support Team and all the wonderful work they do to help me out whenever I run into an issue on the job."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephanie",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T23:40:24.000Z",
          "Titre": "I talked to a real person",
          "Contenu": "I talked to a real person!  I have been look at platforms to support my practice. Most of them I do not get to talk to a person or it is through email and delayed responses.  I was provided with personalized support and all my questions were answered. I felt confident to use the product after the call."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carol Glover",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T16:15:12.000Z",
          "Titre": "I had a problem with connectivity to…",
          "Contenu": "I had a problem with connectivity to TherapyNotes on two different devices and two different servers.  I reached out after hours and received a quick reply with helpful, comprehensive instructions to clear the cache. Problem solved!  I have been using TN for 2 years and have received prompt, cheerful, helpful responses on the few occasions I needed assistance.  It's a great company and great EHR platform!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amanda Evans",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T23:17:33.000Z",
          "Titre": "Detailed and Helpful Customer Service",
          "Contenu": "Detailed and Helpful Customer ServiceMo F provided quick, supportive and friendly customer service today. Even as I was unsure how to answer certain questions, Mo was patient and took the time to walk me through each step. Then to top everything off, they emailed me a detailed recap of our conversation so I could review what we discussed in the future and easily share the steps with the rest of my team."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Becky Morlang",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T18:15:05.000Z",
          "Titre": "Amazing Customer Service Rep",
          "Contenu": "The customer service rep was super friendly and helpful and while helping me, was able to give me a tip that was helping with another issue I had.  She also sent a follow up email that had the step by step instructions in it so I had it for future reference!  Kudos!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ramona Clifton",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T17:34:57.000Z",
          "Titre": "TherapyNotes is the best!",
          "Contenu": "Customer support is amazing!  They respond in a timely manner and are always helpful.  TherapyNotes is user friendly. I have tried their competitor but did not find it user friendly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lenny De Forge",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T04:17:24.000Z",
          "Titre": "Our business has grown and improved…",
          "Contenu": "Our business has grown and improved over the last five years due to the support and updates we get from TherapyNotes and their awesome support staff. This gets easier almost daily while allowing us to focus on providing better therapy and advocating for better Mental health treatment for everyone. TherapyNotes is our partner in business and so much more than just software.  It is the humans behind it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dana Strickland",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T23:23:10.000Z",
          "Titre": "I was introduced to TherapyNotes while…",
          "Contenu": "I was introduced to TherapyNotes while working for a (different) group practice. When I opened my own group practice I tried a different EHR thinking it would save me money but opted to return to TherapyNotes because...1) It saves money2) It is very user-friendly3) Support services are always fast, friendly and is always actually helpful4) TherapyNotes truly is thoughtful and careful with the user experience and takes their time to roll out changes methodically and with intention so that privacy and other aspects that are of the utmost importance are not sacrificed. Today I contacted Support for help with payment processing and they were able to guide me through to the solution quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Wolber",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T18:58:16.000Z",
          "Titre": "TherapyNotes has an amazing",
          "Contenu": "TherapyNotes has an amazing, friendly, and knowledgeable staff! Whenever I call and talk to them, if they can't help me find an answer they aren't afraid to ask for more help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Caitlin Eckert, LCSW",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T15:38:56.000Z",
          "Titre": "Great phone support",
          "Contenu": "Wow! Excellent customer service! Nicole W. had me on and off the phone in less than 3 minutes with my concern resolved. I really could not be more appreciative of this level of care, as it helps me dedicate more time to my clients and my work instead of behind the scene logistics!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Doniesa Baldwin",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T22:14:31.000Z",
          "Titre": "Because I'm a new employee",
          "Contenu": "Because I'm a new employee, I am not familiar with thesoftware platform. They were able to help me understand this program and they provided excellent instructions on what to do."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sarah Goss",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T21:46:18.000Z",
          "Titre": "Customer service is AWESOME",
          "Contenu": "Customer service is AWESOME!  I am transitioning from another electronic medical record system, and am not complete with the transition, so I cannot speak to how the billing portion works, but everything that I have had an issue with, all I need to do is pick up the phone, and I get a person.  Sometimes, there is a short wait, but they have 24 hr availability of customer support people, all in the United States.  Extremely helpful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LG",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T18:04:00.000Z",
          "Titre": "Customer service is amazing",
          "Contenu": "Customer service is amazing. Representative takes the time to understand the issue, problem solve and test the resolution. Very professional and patient with the process. TN is a comprehensive program that allows all aspects of a therapy practice to be streamlined."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rebecka Pearson",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T00:38:19.000Z",
          "Titre": "Long Time TN User",
          "Contenu": "I have been a TN user for almost 10 years and they have always been top notch in terms of customer service, products and have steadily increased the resources and functionality of the software since I started. Today, one of the reps (Kayla) saved me hours of time and solved an issue I have been struggling with for months. I am thrilled with them and I recommend them to anyone!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julie F.",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T03:25:00.000Z",
          "Titre": "I Found A Unicorn!!!",
          "Contenu": "The Success Representative (Asheton S.) was remarkably patient with me and very knowledgeable. My agency had been having some serious trouble with our claims processing.  Asheton knew exactly what to do and led me through the entire process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Suzanne E.",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T00:24:18.000Z",
          "Titre": "I called and talked with Jordan at TherapyNotes LLC",
          "Contenu": "I called and talked with representative, Jordan about a billing issue and changes I needed to make.  Jordan was very helpful and knowledgeable about these issues and could seamlessly educate and coach me through the process.  I'm appreciative of the high quality and ease of the customer support I received just before the Thanksgiving holiday!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Katie Adkins",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T19:08:26.000Z",
          "Titre": "Friendly and swift customer service",
          "Contenu": "Very friendly, patient, and swift customer service. Follow up email reviewing our tasks was wonderful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kerri-Ann",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T13:32:47.000Z",
          "Titre": "I love TherapyNotes",
          "Contenu": "I love TherapyNotes.  It is a user-friendly EHR and the CSRs are truly efficient and professional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mayra Cano",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T17:15:46.000Z",
          "Titre": "Therapy Notes is reliable and always…",
          "Contenu": "Therapy Notes is reliable and always helpful. I have never had a negative experience with anyone from Therapy Notes. I highly recommend them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony Bertram",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T00:14:36.000Z",
          "Titre": "The Best there is",
          "Contenu": "There’s nothing the staff at TherapyNotes can’t resolve in just 1 phone call."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kush Desai",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T15:15:12.000Z",
          "Titre": "TherapyNotes is the best EHR",
          "Contenu": "TherapyNotes has been the best behavioral health EHR I have used. Their platform is intuitive and easy to navigate, they are always adding new features (without increasing the price) and their support is 24/7 and always helpful. I would recommend them to any practice."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joshua Westby",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T21:39:44.000Z",
          "Titre": "Easy to work with company",
          "Contenu": "Easy to work with company. Customer support answers quickly and provides the support you need to get off the ground. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SJoseph",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T18:27:46.000Z",
          "Titre": "Easy Pesy",
          "Contenu": "I've been using Therapy Notes since I started in Psych outpatient as a NP, it has been so easy to get started and help is always around the corner.  Staff is quick to respond and pleasant.  You can change your style of notes on the back end, billing, credit card, telehealth....they do it all. Not to mention, a great price compared to others."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anna Powers",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T00:39:58.000Z",
          "Titre": "I have really enjoyed a lot of the…",
          "Contenu": "I have really enjoyed a lot of the details in the TherapyNotes platform and the helpful, rapid responses that I get from the support team. I would recommend it to other clincians. :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adrienne Webb-Markopolos",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T22:58:08.000Z",
          "Titre": "What makes TherapyNotes such a…blessing. Their business model for customer service.",
          "Contenu": "What makes TherapyNotes such a wonderful and user friendly choice for EMR use is the friendly and knowledgeable team of experts.  They provide three prompts when you call to make sure you don't waste your time with the wrong department.  They have free training, comprehension summary of what was discussed and on the rare occasion they can't answer your question they promptly investigate with their community partners or for example Clearing House or Card Pointe..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Connie Bode",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T02:12:45.000Z",
          "Titre": "So appreciative",
          "Contenu": "First I could hear the person's voice clearly.  So many times customer support volume and voice is choppy and difficult.  Secondly, the patience of the helper is SO very appreciated for someone as clueless as I am at the moment.  They validate my confusion, repeat themselves when I ask, and just seem happy to be helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joy",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T23:55:52.000Z",
          "Titre": "TherapyNotes billing issue resolved!!",
          "Contenu": "Dealing with TherapyNotes is always great. I called and got Robert on the phone to do something I had not done before and further complicated by the insurance company's request. He walked me through whole process and made sure I understood how it would work so that in the future it would make sense to me. As usual both Robert and TN did not disappoint me. Thank you Robert! JOY office manager Tarrytown, NY"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anakalia Tornga",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T20:44:47.000Z",
          "Titre": "Courtney M",
          "Contenu": "Courtney M. knew just how to solve a billing issue that had me in panic mode. I wish all customer service responded like therapy notes do, because it just makes life so much easier to run a business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Damarys G",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T19:46:05.000Z",
          "Titre": "Great customer service!",
          "Contenu": "My experiences with Therapy Notes customer services have always been excellent. Their representatives go above and beyond to make sure my issues have been resolved and I feel my time is valued."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gayle W.",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T17:00:22.000Z",
          "Titre": "Eddie, the support person who helped me",
          "Contenu": "The support person who helped me, Eddie, was great.  He is personable, knowledgeable and patient.  I am not yet very familiar with Therapy Notes and he took time to help me learn what I needed to know to access the information I was seeking."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ari Comart",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T17:41:31.000Z",
          "Titre": "TherapyNotes is the best EHR",
          "Contenu": "TherapyNotes is the best EHR, hands down. The interface is easy to use, and their support is better than any other company I have ever dealt with. Not exaggerating."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Glenn Scott",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T16:34:18.000Z",
          "Titre": "Fantastic Customer Service!",
          "Contenu": "TherapyNotes offers an excellent EHR. What sets them apart from others is excellent customer service. They have been able to solve big or small issues in a friendly helpful manor. I would highly recommend their services."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cindy Simmons",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T22:57:24.000Z",
          "Titre": "Every time I reach out for assistance…",
          "Contenu": "Every time I reach out for assistance at Therapy Notes I have always gotten someone who is polite and very helpful.  You can tell they feel that there is no dumb question and I appreciate that!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KJW",
          "Nb_Reviews": 1,
          "Date": "2023-07-09T23:44:02.000Z",
          "Titre": "Expert assistance.",
          "Contenu": "The client support person was friendly, knowledgeable, able to answer all my questions, spending as much time with me as I needed.  She quickly sent me a follow up email recapping everything she'd taught me and providing me with additional information. She also said she'd pass along my suggestions to improve the product of things I'd like to see in Telehealth. Wow!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maria Rolland",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T20:45:44.000Z",
          "Titre": "Support is helpful, responsive, and warm!",
          "Contenu": "I have found the support team to be very helpful, responsive, and warm. I have been very pleased with the level of support I receive and would say it is an excellent value for what I pay."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessica Krohn",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T15:24:50.000Z",
          "Titre": "Super friendly",
          "Contenu": "Super friendly, efficient and helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "HW Fan",
          "Nb_Reviews": 3,
          "Date": "2023-08-08T22:52:17.000Z",
          "Titre": "Have had them for years and don't know…",
          "Contenu": "Have had them for years and don't know what I would do without them. Great service and always there if you have questions. Great system that saves time but also very compliant to HIPAA and laws for progress notes. Great options like assessments and uploading your intake paperwork. Big part of our practice!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "K. Heckman",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T22:38:12.000Z",
          "Titre": "I love therapynotes' support team",
          "Contenu": "I love therapynotes' support team. So helpful and always available!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peaceful Minds LLC",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T19:22:55.000Z",
          "Titre": "This program is so user friendly!",
          "Contenu": "This program is so user friendly! I love the support from the customer service team. Therapy notes is so easy to use for a individual or a group practice. It helps a lot with billing, which is an area where I stuggle with in my practice."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff Huston",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T00:35:13.000Z",
          "Titre": "TherapyNotes is very well organized",
          "Contenu": "TherapyNotes is very well organized and user friendly.  Communication is solid regarding any updates or glitches, with solutions and work-arounds found quickly.  Updates happen regularly making the site running smoothly.  Technical support is provided quickly when questions arise, which are few and far between for this user."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Myre",
          "Nb_Reviews": 2,
          "Date": "2023-07-09T20:41:48.000Z",
          "Titre": "Quick Transition to Private Practice",
          "Contenu": "My wife had to quickly transition from a non-profit agency to a private practice after the agency was forced to close due to finances. TherapyNotes software has been invaluable in a smooth transition for the clients. Of course there is a steep learning curve with software this complex, but with the help of the excellent TherapyNotes support staff, who are always available, we are very happy with our decision to use this software."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Craig",
          "Nb_Reviews": 2,
          "Date": "2023-08-31T21:57:00.000Z",
          "Titre": "The staff member was professional",
          "Contenu": "The staff member was professional, courteous, and knowledgeable.  She was also patient in walking me through a new process.  I’m very happy with her help, and happy with Therapy Notes.  I’ve been a long-term subscriber of the service and plan to continue for many more years."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "EM",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T21:37:29.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service - a real help!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen Wood",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T05:33:29.000Z",
          "Titre": "Big or small, support does it all.",
          "Contenu": "I called Therapy Notes with a little thing that ended up being a Safari view issue, and not Therapy Notes. But, Steve was kind, and worked issue through to solution. I also appreciate Therapy Notes for my suggestions for big, system wide changes. Site is always improving."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Always Hope Counseling",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T15:19:21.000Z",
          "Titre": "Technical support is amazing!",
          "Contenu": "The program works and the support is 1st class!  TherapyNotes Support Team are amazing! They are kind, and smart. They make sure your issues are resolved and then follow up with an email that covers what was done so you have a record to reference. You just can't find this level of support very many places; In the world of \"technical support\", TherapyNotes is a high meadow of wildflowers where you are expecting a putrid swamp."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janlyn Polimeni",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T19:36:02.000Z",
          "Titre": "Customer service is excellent",
          "Contenu": "Customer service is excellent! Having to call customer service can sometimes be met with rudeness or be unhelpful. Therapy Notes provided quick, helpful, and most importantly kind customer service over the phone and followed up with an email summarizing the steps needed to solve my issue. Very impressed with the product and the customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ellen Carter",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T18:44:25.000Z",
          "Titre": "TherapyNotes is the best",
          "Contenu": "TherapyNotes is the best!  They stay on the phone with you through every billing chore that you need to complete.  They never show that they are frustrated or annoyed.  They have an extremely kind and understanding staff.  You will like working with this very professional group."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angela Girard",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T19:21:34.000Z",
          "Titre": "Outstanding product and service!!!",
          "Contenu": "Every single representative has been extremely helpful and they follow up and follow through.  I've never had such amazing customer service.  The software does everything it says it does and is incredibly user friendly  I'm new to private practice and brand new to billing - I couldn't do it without Therapy Notes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lori A Melhart",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T22:25:45.000Z",
          "Titre": "Validation!",
          "Contenu": "The service provider was so validating! I had a previous call into customer service, so I figured I had made the same mistake again, but she was completely validating as to why I was so puzzles and confused. It relax me enough that I was able to solve the problem!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Very Good Therapy, LLC",
          "Nb_Reviews": 1,
          "Date": "2023-05-13T01:37:05.000Z",
          "Titre": "TherapyNotes truly helps with charting notes!",
          "Contenu": "I did a lot of research before I committed to TherapyNotes, and I am very pleased with my choice. TherapyNotes truly makes charting notes not as terrible. While the program doesn't just chart for us, it does help to make it as easy as possible. For clinicians, notes are the bane of our existence, and TherapyNotes helps! It's intuitive, clear, and adjustable. The customer service is amazing and never makes you feel dumb. I also like how it's available on a webpage, allowing you to use it on a phone, tablet, or computer. Great product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2023-02-20T17:20:55.000Z",
          "Titre": "Great support",
          "Contenu": "My support person understood what I was trying to do from my perspective! Contrast this with other places where you struggle to explain what you need in terms of their system. She then walked me through the set up steps while knowing enough about the industry to help me avoid an incorrect setting. Professional and friendly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brenda DeGeer",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T18:32:57.000Z",
          "Titre": "The BEST Support Team!",
          "Contenu": "Therapy Notes support is excellent.  I have never talked to a support person who could not solve my problem.  They are the BEST.  We have all had a lot of experience calling into companies and most of it is not good.  This one is quite the exception!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Britt R",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T17:28:00.000Z",
          "Titre": "I've had nothing but good experiences…",
          "Contenu": "I've had nothing but good experiences with calling Therapy Notes customer service. They are always extremely friendly, helpful, and patient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pamela Morgan",
          "Nb_Reviews": 2,
          "Date": "2023-02-17T00:18:57.000Z",
          "Titre": "I do billing for Behavioral Health…",
          "Contenu": "I do billing for Behavioral Health Services for multi practices and I have never been disappointed with  Therapy Notes Support.  I have had to hold on line for a while due to back up with calls before me; however, I am not bothered because I know they are going be helpful, explain in detail of my concern and so uplifting when my call gets answered.  This means a lot to be able to work together as a team.  Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kerry Headley",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T23:08:00.000Z",
          "Titre": "TherapyNotes offers consistently helpful support",
          "Contenu": "TherapyNotes offers consistently helpful, patient, and friendly customer support. Their blog offers lots of instructions, but I did not quite understand how to issue a refund, so I called. The person who assisted me walked me through it and then sent me an email outlining what we had done so I would know for next time. I really appreciated that because I doubt I would remember the steps without this."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donna Felkins-Dohm",
          "Nb_Reviews": 5,
          "Date": "2023-09-07T18:12:48.000Z",
          "Titre": "Great Platform to Work With",
          "Contenu": "This platform works well and is easy to use. The support has been excellent with quick responses and assistance. My biggest thing was getting my DEA set up and the layers of security steps."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tinya",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T19:28:34.000Z",
          "Titre": "I absolutely love Therapy Notes",
          "Contenu": "I absolutely love Therapy Notes! I have reviewed other EHR but they they do not compare.  Why do I believe that Therapy Notes is the best?  First, Therapy Notes offers the majority of services needed to successfully operate my private practice on my own.  Secondly, the software is very easy to learn and use. I began using Therapy Notes at least 10 years ago and since that time all of my records have been concise and easy for auditors to review.  I could go on and on, however, you have to try the software to really seen the ease of operation and the benefits of a subscription.  Tinya Holt LCSW"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joyce Holroyd-McGuire",
          "Nb_Reviews": 4,
          "Date": "2023-02-20T17:37:13.000Z",
          "Titre": "I am a provider who is new to Therapy…",
          "Contenu": "I am a provider who is new to Therapy Notes. I have been impressed with so many aspects of this company. There are abundant ways of getting information to learn how to use this program. Having said that, I a m impressed by the support team. They get back to you in a prompt manner, direct you to resolving an issue, or point you in the direction that would best answer your question. I highly recommend this program, I know I have only just begun to experience all of what it can do. I forgot to mention I am a Private Practitioner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gary Hillard",
          "Nb_Reviews": 3,
          "Date": "2023-07-19T14:17:36.000Z",
          "Titre": "Wow!! Best thing ever.",
          "Contenu": "Wow!!!  Old guy here, returning to practice, and so happy to have found this software program.  Scheduling, billing and clinical notes, all in one package, with the best customer support ever.  Works even for old guys."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sister Mary Paul Moller",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T20:39:07.000Z",
          "Titre": "Abby was very helpful and gracious in…",
          "Contenu": "Abby was very helpful and gracious in her manner.  She took time step by step to resolve my issue with logging in.  Her explanations were clear and understandable.  I have been using therapy notes for the past 4 years.  It is helpful in organizing notes, billing information and reports. The one area that could use some improvement is in printing reports and notes.  They have to be printed individually and it would be helpful to bundle them in one printing process if possible."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tanya Grubaugh",
          "Nb_Reviews": 1,
          "Date": "2023-04-30T20:01:24.000Z",
          "Titre": "TherapyNotes High Ratings for Support",
          "Contenu": "TherapyNotes has been very supportive as I get oriented to the system. I've had a lot of questions and they have been highly responsive - taking time with me to walk through steps, directing me to helpful information, and writing up notes outlining the details of our conversation after a phone call. I feel confident I'll get the help I need should I get stuck at any point as I go forward with them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Liliana G",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T23:44:27.000Z",
          "Titre": "I had to leave this review after…",
          "Contenu": "I had to leave this review after receiving help from a support staff member today. Just as before, I was able to speak with support staff in a timely manner and receive friendly, thorough, and knowledgeable service. Not only did the support agent Dan provide me with detailed information, but he also followed it up with an email after the call. It makes my job easier knowing I will receive excellent and reliable service each time I reach out to Therapy Notes staff."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jinsun Yi",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T19:06:56.000Z",
          "Titre": "I called the support team several times…",
          "Contenu": "I called the support team several times and they were always pleasant. They made me feel comfortable and took time to listen. They walked me through the process and advised me where to click to get to the solution I needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melanie Szucs",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T23:24:38.000Z",
          "Titre": "Awesome customer service",
          "Contenu": "Awesome customer service! I was between EHR software, and ultimately chose TherapyNotes because of their great customer service. They have always been responsive and helpful. The platform is also very easy to use, has lots of helpful features (including a great To-Do list that keeps me on track), and is constantly adding new features. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mia Williams",
          "Nb_Reviews": 1,
          "Date": "2023-02-22T19:06:42.000Z",
          "Titre": "Always Happy to Help",
          "Contenu": "The rep I spoke with, Caity, was very knowledgeable, professional, and helpful. She made sure I did not have any other questions towards the end of our call. We always receive the best customer service from the staff at Therapy Notes, it is most definitely unmatched compared to most other companies we work with on a daily basis. Thank you for being so wonderful!Lifespan Team"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ann Landers",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T22:53:18.000Z",
          "Titre": "Billing",
          "Contenu": "Laura helped me clean up and understand the billing platform.  She helped to relieve much stress around billing.  Laura was kind, helpful, knowledgeable and very understanding of my mistakes and guided me to fix them.  I am so grateful for her assistance and feel relieved.  Thanks Laura @ TherapyNotes  :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Emily Frey",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T01:21:37.000Z",
          "Titre": "Wonderful experience!",
          "Contenu": "TherapyNotes is so accessible, helpful, and the customer service is great whether it is through email or phone. I am impressed by their ability to provide direction without even seeing my screen at times. Their pricing is beyond fair and I am getting more than what I pay for :) Derek was so great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dr. Susan Mendelsohn",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T01:09:17.000Z",
          "Titre": "The customer support is amazing",
          "Contenu": "The customer support is amazing. They answer calls pretty much immediately and they are extremely helpful with resolving issues (and I have contacted them over 40 times int he first month). They listen, are understanding of the problems and resolve them immediately."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alycia Roach",
          "Nb_Reviews": 2,
          "Date": "2023-05-16T21:20:03.000Z",
          "Titre": "Transition to TherapyNotes",
          "Contenu": "We are in the process of making the move from one EHR that we used for over a decade to TherapyNotes.  I appreciate all the support TherapyNotes provides, the step-by-step instructions to resolve any issues or gain knowledge, and their YouTube channel is a great asset as well.  Our group practice is pleased with the transition and comment on the ease of completing Treatment Plans and Progress Notes."
        },
        {
          "Note": 5,
          "Lieu": "BD",
          "Pseudo": "Mahmuda Pervin",
          "Nb_Reviews": 4,
          "Date": "2023-03-22T14:24:57.000Z",
          "Titre": "It's really very important for me to…",
          "Contenu": "It's really very important for me to meet this ' TherapyNotes,LLC'.Their services for human beings are awesome. Their customer service it's really very high quality. I am interested in their activity any where they spend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Philip Budd",
          "Nb_Reviews": 1,
          "Date": "2023-02-17T00:07:51.000Z",
          "Titre": "Support that really helps",
          "Contenu": "Typically when I have to call support for a device or software or other issue, I dread it.  The wait time is incredibly long and the people who answer are rude or unable to help.  Today, I had occasion to need help with Therapynotes and as has been my experience in the past, I did not have a long wait time, they were knowledeable, patient and eager to help.  I don't dread calling support at TherapyNotes!  You guys are awsome!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peggi Wegener",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T16:36:58.000Z",
          "Titre": "Outstanding customer service",
          "Contenu": "Each time I have needed support from TherapyNotes, I have received timely and thorough responses.  This time was related to a very complicated ERA that I couldn't figure out how to post.  I received clear, understandable directions on how to reconcile the ERA in the system.  These folks are THE BEST"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Monique L",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T06:29:41.000Z",
          "Titre": "Great company/system",
          "Contenu": "Great company/system. I can do my notes, track my calendar, process payments and so much more. This has been a lifesaver for my private practice. The company has great support as well. Whenever I call for help (usually to figure out how to do something) They assist me kindly and send an email after with the information on whatever we went over during the call."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary Little",
          "Nb_Reviews": 2,
          "Date": "2023-04-06T22:03:10.000Z",
          "Titre": "Over the Moon",
          "Contenu": "I have only begun using TherapyNotes and I am already over the moon about the swift and detailed customer service/feedback. While there are still a few features I'm missing, I'm overall happy to use this platform and feel like the promise and strides to expand to meet the full scope of my needs is on the early horizon."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kenneth McNutt",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T21:49:02.000Z",
          "Titre": "Great support",
          "Contenu": "Short white time. Friendly, knowledgeable support staff. Rarely have to speak to more than one person to get my issue resolved. Issues resolved very quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carla Wilson",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T20:51:42.000Z",
          "Titre": "Great Customer Service with knowledgeable staff",
          "Contenu": "The Rep. that I spoke with was polite and friendly.  She answered my questions, and offered several options that would address my problem, until a successful one was found."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jodi Klubnik",
          "Nb_Reviews": 2,
          "Date": "2023-03-07T05:36:01.000Z",
          "Titre": "I’m never leaving therapy notes!",
          "Contenu": "Can’t say enough good about therapy notes and their incredibly helpful support team. Especially IRINA. She has been incredibly patient and kind as she helped me resolve some billing issues. She is extremely knowledgeable and in no time had my questions answered and issues resolved. I am new to running my own practice, and Irina and the rest of their support team has honestly been my lifeline while I learn this process. Without fail, I get a friendly helpful voice ANYTIME I need immediate assistance. (And I’ve called too many times) They make it so easy, and walk me through everything step by step. They have even been patient when I ask a zillion questions! I would without a doubt be completely lost without their support! Way to go Therapy Notes!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rachael Banda",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T17:42:50.000Z",
          "Titre": "Eduardo's positive attitude is…",
          "Contenu": "Eduardo's positive attitude is contagious! He was willing to help me resolve my issue, and really dug deep to help me find what I needed. :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jill Chlan",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T17:33:22.000Z",
          "Titre": "Best customer service",
          "Contenu": "Best customer service!  A real person answers the phone, always helpful, courteous, enthusiastic about helping, the que doesn't take an hour on hold, and the product makes running a Center much easier as it's very intuitive.  Highly recommend TherapyNotes!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pam J",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T18:05:19.000Z",
          "Titre": "The rep Eduardo listened to me",
          "Contenu": "The rep Eduardo listened to me! That's valuable to me. He gave me good, easy to understand step-by-step directions and even included \"pictures\" of the process in an email. I am very pleased with Therapy Notes support staff. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edith Chase",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T20:15:59.000Z",
          "Titre": "I am a new user of Therapy Notes",
          "Contenu": "I am a new user of Therapy Notes. When I called Support to have a few questions answered, Sean, was very patient with me. He took his time answering the questions I asked plus the ones I did not. He anticipated my needs and provided follow up articles. After speaking with Sean, I am confident that I will be a proficient user of Therapy Notes in no time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Helga Riley",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T23:48:58.000Z",
          "Titre": "I had a wonderful experience with…",
          "Contenu": "I had a wonderful experience with Irena, who is an agent for therapy notes. She was very capable Sharp and helped me resolve all of my issues, efficiently, and with the greatest attitude. It was such a positive experience that I would highly recommend it to anybody else. 10 out of 10."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maria Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2023-04-26T22:14:34.000Z",
          "Titre": "I have been with Therapy Notes for five…",
          "Contenu": "I have been with Therapy Notes for five years and their staff is very professional, kind, respectful and knowledgeable about their program. There has not time that I call and I do experience the same quality of services. I am also very excited, because they been implementing a bilingual (Spanish) option for those of us whose English is not are first language. 95 percent of the clients I work with are Spanish speaking clients and Therapy notes is taking the time and investing on making sure the intake forms are also available for our clients in their own native language. Therapy Notes and all their staff you Rock!!! I always recommend your services to my friends on this field."
        }
      ]
    }
  ]
}