{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "therapyappointment.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "M D",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T01:13:32.000Z",
          "Titre": "Two separate experience this year!",
          "Contenu": "Two separate experience with two different “doctors” who seem to have NO training or understanding of the technology and are just too confused to even want to get involved in how the patients are stuck in nowhere land between two orgs passing the buck while collecting some percentage of the benefits. Meanwhile I don’t even have the option to purge my records or receive ANY assurance of their safeguarding my private information! What a scam even if they are “legit”! I want my files purged. How do I handle that with shysters on both sides of the equation?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Patrick",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T17:57:01.000Z",
          "Titre": "I was charged $10 for nothing",
          "Contenu": "I was charged $10 for nothing, I was told that this was a patient portal but when i made the account it looked like I was the Therapist. And now I'm unable to access my account so i cannot stop this from charging my card"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Roger",
          "Nb_Reviews": 1,
          "Date": "2023-04-14T21:25:35.000Z",
          "Titre": "It is impossible to get through to…",
          "Contenu": "It is impossible to get through to technical support.  I had questions and issues.  They were never answered.  I tried all forms of communication but no reply. The lack of customer service is horrible.  I tried to get a hold of someone to tell them I was quitting the use and still no reply. I have since started with another company please refund and discontinue charging me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joshua Mounts",
          "Nb_Reviews": 1,
          "Date": "2023-02-07T16:27:19.000Z",
          "Titre": "Heidi Halsey is very unprofessional",
          "Contenu": "Heidi Halsey is very unprofessional. She did not let me and my wife speak she just told us stories about herself. Wasnt helpful and we felt as if she made things worse for us."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ANNE NORTON",
          "Nb_Reviews": 3,
          "Date": "2022-11-11T18:01:48.000Z",
          "Titre": "the upgrade to 2.0 has been a disaster…",
          "Contenu": "the upgrade to 2.0 has been a disaster since the beginning. Claims don't get processed, the dashboard doesn't indicate what hasn't been processed, I loved loved the legacy. I want to go back. it was clear, user friendly.."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nicole N.",
          "Nb_Reviews": 1,
          "Date": "2022-10-24T14:52:25.000Z",
          "Titre": "Not user friendly",
          "Contenu": "Not user friendly; the way it is set up leads to much more work for the clinician.  I believe this program is very helpful for admin staff, but for clinician's it makes for very inconsistent, time-consuming documentation."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T15:26:37.000Z",
          "Titre": "I’m getting billed for services not…",
          "Contenu": "I’m getting billed for services not received"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shannon Colburn-Blinn",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T22:29:55.000Z",
          "Titre": "Issues with Scrub function",
          "Contenu": "After the most recent upgrade, I was attempting to submit a claim and kept being redirected to an error page. The system would not let me scrub the claim to identify a possible fix but rather sent me straight to an error \"oops\" page and directed me to fill out an ticket. When I did so, the person that was assigned to assist me told me there was a missing zip code. I was able to correct the issue and submit the claim but when I explained that generally the scrub function would identify missing information I received a very curt reply from Tammy L that said \"The error said the zip code was missing\". It did NOT say that on my end and that was what I was trying to explain. It USED to allow me to scrub a claim and let me correct any errors. Since the upgrade, this is no longer a function I have and may likely be a glitch that happened during upgrade. I did not appreciate the response. It was not helpful and was rude, in my opinion. Unfortunately, this has become the norm when asking for assistance. The launch of 2.0 appears to be \"make upgrades and figure out eh glitches as we go\". I don't have the time to work through the building of a system while trying to put my efforts towards running a practice. The system is not inclusive. My partner is visually impaired and many of the features are not accommodating to her needs. Technical support does a poor job of listening to the issues and attempting to resolve them. There are many other systems to utilize besides Therapy Appointment and if this is the attitude of customer service, I am seriously considering looking at other options."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Laura",
          "Nb_Reviews": 2,
          "Date": "2021-12-28T21:07:08.000Z",
          "Titre": "Do not waste your money. Poor customer service",
          "Contenu": "I am in the process of deleting my account after an appalling experience with their billing support team. I have been a customer since May 2020 and everything was going okay until I faced a significant technical issue that I needed help with involving posting claims. I voiced my frustration with my experience and my desire to leave as a result. The billing supervisor Instead the first thing she said when she called was \"do you want to start with X issue or X issues\". She failed to inquire as to why I was wanting to cancel my subscription or to show any empathy about the poor experience I was clearly having with the service. In my initial shock, I said I just wanted to leave the service and she proceeded to cheerily say an email would be sent to me to show me how to do that. When I asked why she was making no attempt to keep me as a customer or better understand the ways in which TA support could have improved, she said she had and the conversation was \"not going anywhere\". When I expressed my desire to speak to someone in a higher position she said TA didn't give out upper management's phone number for random phone calls. Really disappointed as I loved the interface but couldn't get past this truly shocking support experience. Stay away- it's not worth it if you work on your own and needed personalized help with technical billing questions."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "T.H.",
          "Nb_Reviews": 1,
          "Date": "2022-11-02T06:19:56.000Z",
          "Titre": "Frustrated",
          "Contenu": "Extremely frustrating that when you have questions you can not get ahold of anyone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Melissa Schniers",
          "Nb_Reviews": 1,
          "Date": "2022-12-15T17:21:25.000Z",
          "Titre": "I hate the new platform for telehealth",
          "Contenu": "I hate the new platform for telehealth. I will be going with someone new."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Duane",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T22:35:16.000Z",
          "Titre": "I have been struggling for weeks to…",
          "Contenu": "I have been struggling for weeks to integrate Tsys with TA. It is one on the recommended providers for credit card processing, but they act like they have never heard of TA. I finally had to cancel my contract with them. I’m now starting over again with International Bankcard. I’m hoping they will be able to work with TA."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chan Timmons",
          "Nb_Reviews": 2,
          "Date": "2022-11-11T17:43:50.000Z",
          "Titre": "ERA issues and Payroll",
          "Contenu": "You don't have the payers for ERA that I need so it becomes a Manual Process.  You blame Office Ally, OA blames Rocky Mountain Health Plan, but it leaves me the provider with no solution.  2-4 hours a week are wasted.  I also would like to have an integrated Payroll system as part of TA, allowing me to simply use the info within TA to produce payroll sheets customizable by therapist versus cutting, pasting into Excel."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Larry Smith",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T23:48:19.000Z",
          "Titre": "I often get bumped off the site…",
          "Contenu": "I often get bumped off the site throughout the day and have to repeatedly sign in through the day.  I don't find TA to be very user-friendly nor intuitive. For a long time I was getting a prompt I had a message and none was there.  I discussed this with tech support and they observed this happen during our call. They didn't know how to stop it and said they'd talk to other technicians, but the problem persisted for a long time.  Hasn't been happening recently.  My clinical director can't get reports tracking performance data that would make her job easier and has been told there are not plans to develop such tools.  So, not very happy, I'm afraid."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Elizabeth Schenk",
          "Nb_Reviews": 1,
          "Date": "2022-11-16T04:34:11.000Z",
          "Titre": "If you are not already a customer, go somewhere else- the old format was much better before it was spun off to a new company that has no idea what therapists need to do their business.",
          "Contenu": "In general I was a very happy customer for TA for many years before the company completely changed their format. It is terrible to use the program - the insurance features, billing features, setting up a new patient, calendar features all terrible. Most recent tech support was good, but in general it is very hard to access support"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kathleen Treloar",
          "Nb_Reviews": 1,
          "Date": "2022-11-13T21:40:08.000Z",
          "Titre": "I am struggling with my billing",
          "Contenu": "I am struggling with my billing. THere is always an issue with the \"scrub\" and its difficult to get in touch with your representatives. I have also had problems with zip code declines, despite my information being up to date."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "D. B.",
          "Nb_Reviews": 1,
          "Date": "2022-11-04T18:32:51.000Z",
          "Titre": "Priced too high",
          "Contenu": "I would like to see a lower price for those of us who don't use the billing features.  Great EHR for records but prices too high.  I am switching to a competitor who is affordable next month."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jill",
          "Nb_Reviews": 1,
          "Date": "2023-02-07T23:26:55.000Z",
          "Titre": "Single Dr Practice with one Administrative Employee.",
          "Contenu": "For a single Dr practice with only one administrative employee this program is very difficult. Making appts is awful as we sometimes make anywhere from 2 to 6 months of appts at a time.  The calendar for the month doesn't have blanks like the old system where you can put the appts in there.  You have to go to the small calendar and each time you say \"book it\" it takes you clear back and you have to start over from the beginning of the year to get back to the month you were on.  Very time consuming if the patient is patiently waiting at your desk.  If you are the one person doing everything and your on one task, say posting checks. Its much more time consuming to get it done quickly and get out of where your at, save it,  and help the person on the phone. I don't know how many times I've had to stop completely where I'm at because it's too hard to get to the calendar from billing, or just put a persons info in with their last name to pull up their account.  So I have to leave where I'm at and then start over when I'm done with the phone.  This program is just too busy, Legacy would have been better with just a few improvements to upgrade some of the things it needed instead of the whole thing being completely redone.  The electronic billing has some better features. For instance you can edit the 1500 page if your not sure you used the correct CPT code and you can correct or void the claim right there before you submit them.  We like the fact you can look on the calendar and find the canceled patients by checking the cancelation box,  as all canceled appts will show up in red. These are some of the improvements that would have worked with Legacy.  We'll keep using this for now, but it is what it is.  Thank you Jill"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Pam Rogers",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T17:14:02.000Z",
          "Titre": "Simple solution",
          "Contenu": "Simple solution, for example, to be able to view a continuous month for scheduling clients (currently one can only see half a week when the month ends and go to the next month to see the continuity and what's available, difficult especially when schedule is mostly full)Simple solution, for example, to be able to copy and paste some information to progress note like diagnosis and consistent data (currently one has to use note pad first and then copy notes from notepad to TA progress note)Simple solution, for example, when not able to schedule a client because of technical glitch with TA system (and customer service contact and resolution for such a problem is days to week+ (forced to spend hours to figure out a solution after not hearing back from the contacted TA staff)"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Avella",
          "Nb_Reviews": 1,
          "Date": "2022-10-20T15:55:58.000Z",
          "Titre": "I am new to TA and was disappointed…",
          "Contenu": "I am new to TA and was disappointed with the help I received. It was curt and not user friendly. I am not sure if this is going to work for me."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Amani Henderson",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T19:21:29.000Z",
          "Titre": "things have been good so far using…",
          "Contenu": "things have been good so far using therapy appointment"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ADAM",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T17:57:21.000Z",
          "Titre": "no reason to use it unless you are stuck with it.",
          "Contenu": "it is glitchy and dated in comparison to other options."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joanna",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T17:30:55.000Z",
          "Titre": "The schedule for the week is not…",
          "Contenu": "The schedule for the week is not viewable and cannot go back and add people to calendar for that day or the day before."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Angie",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T20:35:28.000Z",
          "Titre": "If not for the price point I would use a different platform.",
          "Contenu": "I would probably have changed companies by now, but the price of $10 while getting started can't be beat. I find the software is not intuitive and because it's not clear I put the client forms in the wrong location to start. The woman helping me has been helpful when we meet, but does not get things done by the time she says she will. I would have preferred no promises rather than ones not kept. The \"faith\" button for the 'find my therapist' function lacks diversity for people who don't fit into the 7 options given by the company. Disappointing I cannot write in my beliefs there or just put \"other\". Instead I'm forced to answer faith as \"not applicable\" which isn't reflective of who I am as a therapist. I would say for $10 monthly it's ok. If you can afford a  better software, I would say look elsewhere."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Beaule",
          "Nb_Reviews": 1,
          "Date": "2022-10-24T19:14:21.000Z",
          "Titre": "Other software (aka,therapynotes) has a…",
          "Contenu": "Other software (aka,therapynotes) has a more extensive drop down menu of checkable boxes which allows quick, easy and more detailed information to be listed in client session notes. Client contact info highlighted when hovered over in scheduling tab would be helpful. Private notes is a helpful option though."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dr. Chris",
          "Nb_Reviews": 1,
          "Date": "2022-11-12T01:07:00.000Z",
          "Titre": "Therapy Appt",
          "Contenu": "I dislike how modifications are unexpectedly made on the fly and without any warning. Especially with tech support being days out when needed. A direct tech support line would be nice to count on.It is hard enough to provide services to those in need without having to learn unexpected changes on the fly. The service is typically good otherwise."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bobbi C.",
          "Nb_Reviews": 1,
          "Date": "2022-11-16T19:54:27.000Z",
          "Titre": "It does the job but the system feels complex.",
          "Contenu": "Overall I like this service but since they upgraded, it feels more complex. If I get an overpayment, or I end up needing to reimburse an insurance company, going back and making repairs feels daunting and my system ledger (if you will) gets out of whack - whereas the old version was much more simple to use. Overall, it \"gets the job done\" but I don't like feeling like I need an expert to work out the kinks. The patient portal aspect is nice because clients can go in and input their data. I am also a fan of the invoicing system where you can message clients directly through the portal."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ginny Winchell Monk",
          "Nb_Reviews": 2,
          "Date": "2023-02-13T17:29:34.000Z",
          "Titre": "Please have someone call me.  Office 806.350.5861 please leave message with time to return call.",
          "Contenu": "Please have someone call me.  I had an appointment with \"Tammy\" at 3:00 PM today and it is EXTREMELY important that I find some answers to an accounting question involving possible overcharges by TA.  I remained on Zoom until 3:17 and no one joined the meeting.  This is a simply question that can be answered in a matter of minutes.  It is extremely difficult to get in touch with anyone at your office.  Thank you."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "C.C.",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T19:28:11.000Z",
          "Titre": "Therapy Appointment",
          "Contenu": "Therapy Appointment does what it is supposed to do. It has saved me from doing a lot of work on my own. There are some services, I wish Therapy Appointment would provide that could cut down on extra costs that I am spending.  (1). Therapy Appointment doesn't have an app.(2). Therapy Appointment doesn't have Wiley notes incorporated and embedded into the notes-taking system. I had to purchase my own. (3). Zoom is not offered for meeting options, only sessions, and I am paying the base fee through Therapy Appointments, that Zoom fees allow you to do. (4). I never get a notification chime that my session is ending. (5). A text messaging system would be fantastic to utilize."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Susan Brenner",
          "Nb_Reviews": 1,
          "Date": "2022-11-12T17:22:18.000Z",
          "Titre": "I created an account for my clients and…",
          "Contenu": "I created an account for my clients and then when they go  to create an account and log into the portal we end up with two different accounts with the same email I don’t understand how that keeps happening.Some clients  have a hard time figuring out how to launch their session to zoom others have no problems at all. I struggle coaching them through options or other ways of connecting on zoom."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brian Hudspeth",
          "Nb_Reviews": 1,
          "Date": "2022-10-19T22:35:45.000Z",
          "Titre": "There is no live help",
          "Contenu": "There is no live help. You must email and wait for their response. Often more than one email is required if there is any problems with them understanding. Also, there is no time frame given for suggestions and no ideas. Somewhat frustrating. Change or updates seem slow."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Erica DeHart",
          "Nb_Reviews": 1,
          "Date": "2022-10-28T23:25:20.000Z",
          "Titre": "There is a lot I like about the…",
          "Contenu": "There is a lot I like about the platform and a lot that is super annoying. It is not user friendly or intuitive at all. I have had no luck in correcting claim issues even though it is advertised that techs will walk me through any problem that arises. Most often I’m told to call the insurance provider. And the linkage to Availity is not a good choice in my opinion. The eligibility and benefits is wrong at least 50% of the time. I know that is an Availity platform issue but you all chose to work with them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bewindi Bobb",
          "Nb_Reviews": 1,
          "Date": "2021-04-20T16:43:34.000Z",
          "Titre": "Therapy appointment",
          "Contenu": "Therapy appointment - I appreciate this platform as all of my practice is now virtual... I wish it had some more interactive parts, and some times glitches... I also wonder if I were to hire someone would I have to switch platforms like to simple practice but I am grateful for this platform"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carol Anderson",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T19:28:27.000Z",
          "Titre": "The website has too much inconsistency…",
          "Contenu": "The website has too much inconsistency between actions that have to be taken.  Some examples: Save button on one item is at the bottom and on another is at the top. They should always be at the bottom, to see when you're finished filling in the form.  The system turns off at 9:30 PST so records are not recorded until the next day.  This should be automatically saved and recorded.  When filling in an EOB, the client payment, the page shows \"0\" even though there is one.  Additionally, sometimes a client's claim will submit when I complete the note, then later I see that a claim for the same client was not submitted, even though I cannot see there was a problem with it. These are just a few issues that are confusing and slow me down while trying to work quickly.  I believe that there are more, but I don't recall right now."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kenneth Burns",
          "Nb_Reviews": 1,
          "Date": "2022-10-28T19:54:20.000Z",
          "Titre": "It's not so good for a true group…",
          "Contenu": "It's not so good for a true group practice. The price is good. Good if you are an individual provider. Or a group of therapists operating individually. The calendar for the group leaves much to be desired."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alan Lipps",
          "Nb_Reviews": 1,
          "Date": "2022-10-25T21:57:53.000Z",
          "Titre": "Setting up the weekly schedule is Difficult",
          "Contenu": "Setting up the weekly schedule is difficult--especially on a mobile device (iphone). I kept creating available spots by accident just trying to navigate. Then, I had to go back and delete those. I was trying to extend availability by dragging from the bottom of the box, but could never do this with the iPhone. Also, I was confused by the \"exceptions.\" I assumed this would be for making exceptions to the schedule--for example if I were out of town on a particular week. Obviously, this was not correct as I ended up with an unexpected result. Setting up a schedule, or editing a schedule, could be improved by making it possible to input the information using the keyboard--not only by dragging/resizing. If it can already do this, that is not obvious or easy to figure out how."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "K B",
          "Nb_Reviews": 1,
          "Date": "2022-12-04T07:48:23.000Z",
          "Titre": "Helpful",
          "Contenu": "My favorite feature is being able to copy notes from the previous session. It keeps me from flipping back and forth. I'll admit though that it's not the easiest EHR that I have used though. I would love to see a box for treatment goal progress."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marcia McGlone",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T02:03:36.000Z",
          "Titre": "I am not a therapist and your program…",
          "Contenu": "I am not a therapist and your program is not geared towards APRN PMHNP,so I have to pay for another EMR and transfer to Therapy Appt. I don’t type very well either."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Loren Goff",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T19:38:33.000Z",
          "Titre": "I find the new system cumbersome in…",
          "Contenu": "I find the new system cumbersome in entering data, entering payments, and making changes.While billing still works relatively well, getting answers to questions is more tedious. I miss the personalized service you used to provide so willingly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Henry",
          "Nb_Reviews": 1,
          "Date": "2023-02-11T21:55:54.000Z",
          "Titre": "I was surprised to get a charge on my…",
          "Contenu": "I was surprised to get a charge on my Bank Account when I never used the service.  I was under the impression that this was a trial evaluation and not an automatic charge."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Aaron Zatcoff",
          "Nb_Reviews": 1,
          "Date": "2022-10-19T22:30:32.000Z",
          "Titre": "I dislike the reporting in this…",
          "Contenu": "I dislike the reporting in this application, so I don't use it.  This requires me doing more work in another application, so I am not happy with that aspect of therapyappointment.com."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ginna Beal",
          "Nb_Reviews": 1,
          "Date": "2022-11-16T03:12:05.000Z",
          "Titre": "New tech",
          "Contenu": "I love therapyappointment in many aspects but I detest the change in the tech.  It’s bulky and some functions are not at all intuitive."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MS",
          "Nb_Reviews": 1,
          "Date": "2021-04-20T16:39:02.000Z",
          "Titre": "Needs to be better for large group…",
          "Contenu": "Needs to be better for large group practices.  Not efficient for intake-needs to have a running side view for new Intake Appointments that can be easily accessible.  Also needs a 'waiting list feature' for new appointments waiting to be scheduled, waiting for verification of benefits, or anything else that may be' in progress'. Also needs integrated Verification of Benefits feature where we can easily get accurate insurance benefits for patients!!!!  Also need easier quicker navigation when going between pages."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Therapist",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T17:50:34.000Z",
          "Titre": "Customer service use to be offered in…",
          "Contenu": "Customer service use to be offered in “real time” and sometimes it is necessary and not available.No customer service for patients could be improved."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Karyn Feit",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T19:29:32.000Z",
          "Titre": "I like the new interface and the staff…",
          "Contenu": "I like the new interface and the staff is hard working and kind.  There are some things that are not intuitive in the interface and I wish they were."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JoAnne  Barge",
          "Nb_Reviews": 2,
          "Date": "2022-11-11T19:58:39.000Z",
          "Titre": "Too much",
          "Contenu": "Takes too much time to learn & makes choices for you that you may not want!It is happening here, making me select just one day?? It is ongoing..,"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rickie Simpson",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T18:19:20.000Z",
          "Titre": "The forms are more limited than Valant…",
          "Contenu": "The forms are more limited than Valant or Simple practicr. It is difficult to use the treatment plans."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lauren C.",
          "Nb_Reviews": 1,
          "Date": "2022-11-16T13:54:34.000Z",
          "Titre": "Needs standalone treatment plan template",
          "Contenu": "I would like more to work with around treatment planning and a treatment plan form that is more comprehensive, allowing for problem /goal / objective/ intervention format with multiple entry options for all that is standalone and NOT connected to a progress note. I am happy with TA otherwise but am currently considering switching to another EHR for easier treatment planning."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jt w",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T17:15:51.000Z",
          "Titre": "It feels like you have to click 5 times…",
          "Contenu": "It feels like you have to click 5 times to get any one thing done. There are more steps in many processes. I love the reporting section and what it tells me, but there is not ease of use there,  either."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kenneth Schmitt",
          "Nb_Reviews": 1,
          "Date": "2022-10-20T18:40:13.000Z",
          "Titre": "Can not customize forms with check…",
          "Contenu": "Can not customize forms with check boxes.  This would help so much in my practice."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Timothy Pieczonka",
          "Nb_Reviews": 2,
          "Date": "2021-04-22T17:13:41.000Z",
          "Titre": "Calendar and scheduling issues",
          "Contenu": "I am unable to customize times on my schedule to just show hours of operation and after scheduling clients appointments have disappeared"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Wanda Harper",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T23:40:04.000Z",
          "Titre": "Calendar still not user friendly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lani",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T00:06:47.000Z",
          "Titre": "The only thing I don't care for is that…",
          "Contenu": "The only thing I don't care for is that it didn't work with my MacBook.  On my phone it's great.  But it's ki d of hard."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kelly Lucas",
          "Nb_Reviews": 2,
          "Date": "2023-09-12T17:20:11.000Z",
          "Titre": "So far things have been good",
          "Contenu": "So far things have been good, there are few things that could be added such as better note templates and treatment plans, an app that allows you into the scheduling or adding clients.  Also having reminders deliver the link for the appointment, also being able to have clients initials show up on the shared calendar for easier schedule review."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sharla Robbins",
          "Nb_Reviews": 1,
          "Date": "2022-11-12T07:15:11.000Z",
          "Titre": "I appreciate your product",
          "Contenu": "I appreciate your product. It is comprehensive to my needs as a private practitioner.  My criticism is that it is difficult to navigate (from going through multiple screens to sign in to refunding a charge). Though I’ve used 2.0 for quite some time, I’m still learning (still trying to find how to charge a virtual charge card from an insurance company)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Panh Song",
          "Nb_Reviews": 1,
          "Date": "2022-11-21T23:07:26.000Z",
          "Titre": "Some things are clear and easy to use",
          "Contenu": "Some things are clear and easy to use. Some are not, doesn't have specific instructions, like entering an EAP. Also I don't like entering too many info on online payments. I've been waiting a long time for a physical credit card terminal still and don't know when I will receive it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T19:35:10.000Z",
          "Titre": "Almost Perfect",
          "Contenu": "I love almost everything about Therapy Appointment 2.0. I would give it five stars if it had the ability to automatically charge cards on file without having to set-up with an outsourced credit card processing company for an additional monthly fee to use the service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nicole",
          "Nb_Reviews": 2,
          "Date": "2023-09-10T18:25:53.000Z",
          "Titre": "Great Platform",
          "Contenu": "Great customer Service! I love the feature of being able to search for availability. However, I don't like the fact that you have to pay extra for a telehealth integration."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lynn Barrette",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T18:21:08.000Z",
          "Titre": "Great software, always improving!",
          "Contenu": "Easy, for the most part. Clients report fairly easy to access on their end. Great reporting. I love that credit card and EOBs are integrated. The tech people continue ongoing updating, and provide quick responses to tech issues. Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ruth",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T03:49:41.000Z",
          "Titre": "TherapyAppointment has all the features…",
          "Contenu": "TherapyAppointment has all the features that I am looking for. I left off one star because it can take some time to get help from support, I would love prefer live help."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rita Morris",
          "Nb_Reviews": 1,
          "Date": "2022-10-23T23:25:39.000Z",
          "Titre": "The cost versus what you get is…great",
          "Contenu": "The cost versus what you get is remarkable. There are a few things I have issue with like not being able to undelete a cancelled appointment, not having the option to have the treatment plans, and not able to view/edit the forms from the client side. For example if I have a client that is not tech savvy or have a computer I'm not able to complete the paper work for them while we meet virtually or in person. They have to know how and be able to log into the client portal and do so themselves. It would be nice to be able to complete the forms and then upload them to their file for them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Melinda Dubbs",
          "Nb_Reviews": 2,
          "Date": "2021-04-20T18:26:23.000Z",
          "Titre": "Just a few features short of perfect",
          "Contenu": "Overall I really enjoy TherapyAppointment. I love that it is a combination of things that I need to run my practice including a scheduler, virtual platform, EMR, and bill manager. There are a few features that hold it back from a 5 star such as back and forth electronic signatures, being able to directly bill a credit card on file, etc."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JustAnswer Customer",
          "Nb_Reviews": 2,
          "Date": "2022-11-15T19:55:03.000Z",
          "Titre": "Still poor calendar setting system for therapists.",
          "Contenu": "Overall Therapy appointment is wonderful for Therapist to use. Unfortunately setting calendar remains a problem, and really needs to be corrected to allow therapist to add appointments without having to start all over again!! Cts also need to have ability to sign telehealth release and not be told appointment is in person! Therapist don't all use Therapy appointment zoom with fees, and clients are confused when they sign up for telehealth but then are told appointment will be in person. Please fix these problems."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kenyatta Black",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T22:52:41.000Z",
          "Titre": "I think TA is doing a good job with the…",
          "Contenu": "I think TA is doing a good job with the recent upgrades. I attended a conf with a colleague and she had TherapyNotes. TherapyNotes gives her the option to update the benefits info once an ERA is received. For example, if the initial info is that a client had a $20 copay however, when the ERA is received it shows the client's responsibility is $60, TherapyNotes will ask if the clinician would like for the benefits to be updated. Personally, I think this is a game changer. I was wondering why she never complains about her billing anymore. I spend a lot of time asking my billing team to make sure an update the benefits once the ERA is received. I think TA is doing some things better than TherapyNotes ie) charging the credit card automatically once the note is signed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Monica Cagayat",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T20:24:07.000Z",
          "Titre": "Good tech support",
          "Contenu": "I have found tech support and questions to be taken seriously and thoughtfully answered by staff. Overall the platform is easy to use and probably 95% of the time is exactly what I need as a therapist. My biggest request is for an app to use so I can be more on the go with my business."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Erin",
          "Nb_Reviews": 1,
          "Date": "2023-02-12T23:26:17.000Z",
          "Titre": "Great EHR overall, just needs a few tweaks!",
          "Contenu": "More variety for pre-made note templates, and a treatment plan template that isn't just a narrative box would be fantastic. Otherwise, I am really enjoying TherapyAppointment! It fits my needs well and isn't outrageous cost-wise."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Darcy Mason",
          "Nb_Reviews": 1,
          "Date": "2022-10-20T19:49:34.000Z",
          "Titre": "I find TA easy to maneuver in and…",
          "Contenu": "I find TA easy to maneuver in and intuitive. I like that everything important is on the dashboard and color coded. I like that the DX is right in front of me for note writing. Treatment plan review could be enhanced with the option of a template."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James B",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T18:13:42.000Z",
          "Titre": "Solid EHR",
          "Contenu": "Reasonably priced, user-friendly interface, and an all-around convenient EHR. I've been a user for about 5 years now and don't have any interest in changing to another EHR."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Juan O",
          "Nb_Reviews": 1,
          "Date": "2022-10-19T21:56:04.000Z",
          "Titre": "Budget friendly, outdated interface",
          "Contenu": "The interface is not the most user friendly. It doesn't always notify you when you have messages. It locks your notes once you enter them and then you have to do addendums to correct them. But, it lets you pick your format for your notes.The cost is really affordable, it is easy to schedule people, and it is secure."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sabrina Bowen",
          "Nb_Reviews": 1,
          "Date": "2022-10-25T16:43:36.000Z",
          "Titre": "Love Therapyappointment",
          "Contenu": "Love Therapyappointment. My only complain is that their credit card integration is not good due to the companies that contract with them. Everything else is great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Geraldine-Pasadena,CA",
          "Nb_Reviews": 2,
          "Date": "2022-10-29T06:55:28.000Z",
          "Titre": "The system has worked well up to the…",
          "Contenu": "The system has worked well up to the date of the \"disruption of my service\" with no sensible reason. This issue resulted in an inability for me to manage my work load in a reasonable time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Aliya Saulson",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T19:57:14.000Z",
          "Titre": "Solid and Still Improving",
          "Contenu": "Overall a positive and user-friendly intuitive experience.  Support is usually very timely and responsive.  I've heard of some hiccups/oddities with group charting.  Additionally, I have reached out to the company on several occasions about getting pronouns added to clients' charts which seems to still be a work in progress."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sharon Baker",
          "Nb_Reviews": 1,
          "Date": "2022-11-12T18:59:35.000Z",
          "Titre": "Therapy Appointment is intuitive and…",
          "Contenu": "Therapy Appointment is intuitive and easy to use - almost perfect.  I would like to see all of the biographical form.  Often parts of it are cut off."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jennifer",
          "Nb_Reviews": 1,
          "Date": "2023-03-26T03:38:28.000Z",
          "Titre": "It is a great EMR system for the most…",
          "Contenu": "It is a great EMR system for the most part. The only thing I wish was different  was the ability to take payments through the portal without having to use a paid service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Casey Nicholson",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T04:35:50.000Z",
          "Titre": "A Good Platform That Is Getting Better",
          "Contenu": "I’ve been using Therapy Appointment for the past thirteen months.  I’ve found it to be a good platform overall. There was a bit of a learning curve in the first couple of months, and getting started required (in my case at least) the creation of numerous intake documents that could be a bit tedious to draft. Still, the platform helped me take my practice to a new level, and it has become a much better system than my previous method of doing everything in house with no third party paperwork management system. One thing I appreciate about the platform is that it continues to evolve and get better as time goes on. There are still a few things I’d like to see improve (read receipts for sent messages are one small but obvious feature that is still missing; the ability for clients to schedule their own group appointments for couples counseling rather than limiting client scheduling to their personal solo sessions is another). Still, the platform has seen numerous upgrades in the year I’ve been using it, and I imagine it will continue to get better with time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Becky",
          "Nb_Reviews": 1,
          "Date": "2022-10-19T22:08:32.000Z",
          "Titre": "Good, basic program",
          "Contenu": "I would like more options to creating point-and-click templates other than just SOAP.  Same goes for treatment plans."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nicole W",
          "Nb_Reviews": 2,
          "Date": "2023-06-24T19:20:34.000Z",
          "Titre": "Great user friendly.",
          "Contenu": "So far things have been very user friendly and the support people have helped very quickly. I’m looking forward to learning more about the platform."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sandra DeSobe",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T18:31:49.000Z",
          "Titre": "For the most part we really liked the…",
          "Contenu": "For the most part we really liked the upgrade to 2.0. However the biggest problem we faced was not being able to easily enter the fee for service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lindsay Dickerson",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T19:22:36.000Z",
          "Titre": "therapy appointment has been a great…",
          "Contenu": "therapy appointment has been a great tool - sometimes it can be confusing when i feel like i'm trying to reconnect my officeally account to my therapyappointment account, but this problem seemed easy enough to fix."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lyndee Schaefer",
          "Nb_Reviews": 1,
          "Date": "2022-10-23T22:34:06.000Z",
          "Titre": "This program makes it possible to keep…Convenience",
          "Contenu": "This program makes it possible to keep all client information in one safe and convenient place."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Denise Greene",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T17:53:42.000Z",
          "Titre": "It’s reliable",
          "Contenu": "It’s reliable. Adding new features frequently   All intake documents can be completed online"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kimberly Kennedy",
          "Nb_Reviews": 1,
          "Date": "2022-10-31T22:27:18.000Z",
          "Titre": "I like the format",
          "Contenu": "I like the format; but I do wish the billing part of it was easier to navigate."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T21:04:05.000Z",
          "Titre": "Ease of use in so many ways",
          "Contenu": "Ease of use in so many ways, but some sync issues with Google calendar and limitations in customizing availability schedule."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AFBHS",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T18:31:33.000Z",
          "Titre": "Great Follow Up",
          "Contenu": "Follow up and willingness to add features when possible."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Odell",
          "Nb_Reviews": 1,
          "Date": "2022-11-16T00:29:55.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use.  Usually up and running.  The spell check is awful.  It's about the only thing I don't like about it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 1,
          "Date": "2022-10-19T21:55:00.000Z",
          "Titre": "Faster note writing!",
          "Contenu": "It is great, it's a lot faster to write notes than our past program."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tracey Reyes",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T19:24:53.000Z",
          "Titre": "Very quick to respond to my questions."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bonnie Teitleman-Levin",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T17:36:43.000Z",
          "Titre": "Support is great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Esther Davies Venn",
          "Nb_Reviews": 5,
          "Date": "2023-11-14T03:16:20.000Z",
          "Titre": "Great platform",
          "Contenu": "This platform is great its very affordable and very helpful and make it easy to manage a growing practice with less manual effort"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MB",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T18:15:59.000Z",
          "Titre": "The EHR is easy to use",
          "Contenu": "The EHR is easy to use. I like the embedded assessments for clients to use like the PHQ-9 and GAD-7. I also appreciate the ease of use for both the clinician and the client. And you really can't beat the pricing, especially if you are just starting out and need an affordable EHR for documentation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SHANE HARMON",
          "Nb_Reviews": 3,
          "Date": "2022-10-19T22:28:11.000Z",
          "Titre": "The only EHR for me!!",
          "Contenu": "My agency has been with TA for 11 years. Bill Whitehead has been absolutely fabulous to work with and even as our agency has changed, he and his program have been irreplaceable in walking us through the necessary changes. I have been able to connect directly with Darlene in their help department who has been an absolute saint in solving problems for us and keeping our agency in top shape. Thank you for everything TA!!!"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Kainat",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T00:16:39.000Z",
          "Titre": "I’m happy with the phone and the deal I…",
          "Contenu": "I’m happy with the phone and the deal I got from the company. I wanted a good smartphone that did the basics, and the site recommended one that ticked all the boxes. Speaking with the service team helped me get exactly what I was looking for.The only reason not to give 5 stars is the fact that I had to separately claim for the offered cash back deal, rather than it being automatic, and this info wasn't stated anywhere."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Dill",
          "Nb_Reviews": 1,
          "Date": "2022-11-14T22:59:44.000Z",
          "Titre": "High Quality and safe",
          "Contenu": "Today getting online, I'm reminded of how grateful I am to have the convenience of working online, from home and my clients have a safe and dependable way of having a therapy session from their car on their lunch break, or from a quiet room at the office, not having to endure dark and rainy streets, burning gas and wasting time commuting to my office. I see clients from Port Townsend to Richland Washington. That's one end of the state to the other and from the Olympic Peninsula to Wenatchee. Such a huge area to draw clients from! Thank you Therapy Appointment for providing a platform to make all this happen. I also lead two groups with guys from all over the state. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristy Brecke",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T17:05:45.000Z",
          "Titre": "Amazing customer service!",
          "Contenu": "I love how quickly I get a response. They never make me feel like I am asking a dumb question. I absolutely love that it continues to improve with what it offers to make our experience easier. The ability to add insurance cards and ID's is huge. I wish the scheduling tool was as easy as the legacy version was.The more connections to more insurance panels to verify insurance would be huge but I really do love next to everything about this platform right now."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer Feldman",
          "Nb_Reviews": 1,
          "Date": "2022-11-02T14:37:55.000Z",
          "Titre": "It's a game changer.",
          "Contenu": "Therapy Appointment has been a game changer for me.  The portal is so thoughtfully designed, fearure-rich, and easy to use.  My clients consistently tell me that they have had a positive experience and they enjoy being able to self-schedule. Live customer support has been over-the-top helpful. The company frequently makes useful improvements and adds features I didn't even know I wanted.  All of this means that I get to focus on what matters to me...practicing counseling."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristi",
          "Nb_Reviews": 2,
          "Date": "2022-11-11T20:27:58.000Z",
          "Titre": "Great program with lots of helpful…",
          "Contenu": "Great program with lots of helpful features.  IT support had been very responsive and timely and they have made many of the suggested changes I've offered. The telehealth platform was a life saver during the early pandemic. Only slight negative is some features of the telehealth platform aren't intuitive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LeAnne Black",
          "Nb_Reviews": 1,
          "Date": "2022-10-19T23:55:47.000Z",
          "Titre": "Therapy appointment is a wonderful…",
          "Contenu": "Therapy appointment is a wonderful site.  At various jobs I have worked with different sites but this one is straightforward and has what therapists need.  If I have questions, I send in a chat and get an answer fairly quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julie Waldron",
          "Nb_Reviews": 1,
          "Date": "2022-10-24T13:05:54.000Z",
          "Titre": "TA is great for my small business",
          "Contenu": "As a solo practitioner, Therapy Appointment is like having a trustworthy assistant. It's incredibly helpful that clients can schedule themselves on my calendar without needing to play phone tag to find appointment times that fit. The calendar, the options for charting, the reports- all very intuitive and easy to set up and use.  I am thankful I chose TA 2.0 for my business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeffrey Katz, Ph.D.",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T23:30:18.000Z",
          "Titre": "TherapyAppointment checks all of the boxes for us to run our practice.",
          "Contenu": "TherapyAppointment has been wonderful for our practice since we started with them 5 years ago.  They are always improving how the site works and adding new features.  They have excellent customer support.  They respond quickly to questions and are clear when explaining what to do.  We worked with two other companies prior to working with TherapyAppointment.  Obviously, we were not  happy until starting with TherapyAppointment."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathy Byford",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T20:53:10.000Z",
          "Titre": "I love this program",
          "Contenu": "I love this program. It makes billing for Insurance so easy.  I like having clients fill out paperwork in the patient portal before their appointment time too. I don’t have to spend session time covering paperwork."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carmela Denise  Katz",
          "Nb_Reviews": 1,
          "Date": "2022-11-16T18:50:14.000Z",
          "Titre": "LCSWC thinks is intuitive system",
          "Contenu": "I am not a tech person. I have used 3 different electronic health records systems and this one is the absolute best, most intuitive, efficient , friendly ones I have come across. Everyone should be using TA if they want to be happy"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sharon Paprocki",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T19:03:24.000Z",
          "Titre": "Truth be told my tech capacity to…",
          "Contenu": "Truth be told my tech capacity to figure things out is minimal.  I liked the simple nature of their original plan Legacy.  Since being on 2.0 there are many updated features of which the one I use most is the built in virtual session option.  That said navigating some of the business, billing, and insurance needs we have in 2.0 has been challenging.  The reason for the high rating is the consistent tech and teaching support we get from the people.  The turn around time is fair and the zoom or phone calls are very helpful.  If someone like me can use TA everyone can.  For those of you who are more tech savvy I am sure you will love all that you can do within the program."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barbara H.",
          "Nb_Reviews": 1,
          "Date": "2022-11-12T05:10:41.000Z",
          "Titre": "I really enjoy using therapy appt",
          "Contenu": "I really enjoy using therapy appt. It is easy to use to schedule, change my schedule, complete my notes and bill. I like being able to message with my client, assign and upload documents when necessary."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tracey",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T17:38:15.000Z",
          "Titre": "Always fast to respond to any of my…",
          "Contenu": "Always fast to respond to any of my questions or needs and help explain things when I get confused!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "A. Jenkins",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T19:32:46.000Z",
          "Titre": "TherapyAppointment is user friendly",
          "Contenu": "TherapyAppointment is user friendly. Any time I have issues or questions they are able to be reached in reasonable amount of time. They are constantly improving the software to make the system more efficient and user friendly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rob Sheppard",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T18:16:33.000Z",
          "Titre": "Counseling with ease.",
          "Contenu": "Counseling, when you do it with all your might is exhausting. Then to face the daunting task of recording the experience, billing for the sessions, tracking and recording all the EOBs, tracing the money path from billing, processing, fixing inevitable problems, is overwhelming. Therapy appointment was developed by a counselor. He got as close to alleviating all the tasks, and making the daunting task  into a doable task. Even I, one who HATES secretarial and book keeping, and am neigh to computer illiterate, can do a fairly good job of doing it all and having some time to myself."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paty",
          "Nb_Reviews": 3,
          "Date": "2022-10-29T20:51:44.000Z",
          "Titre": "It's a great EHR",
          "Contenu": "It's a great EHR. Easy to use and maintain my clients information safely.I use other systems for booking and insurance, so I don't use all the benefits. Yet, it looks easily applicable if ever needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessica",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T15:36:14.000Z",
          "Titre": "so far very supportive experience…",
          "Contenu": "so far very supportive experience straightforward and has been very responsive"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephanie Vazzano",
          "Nb_Reviews": 1,
          "Date": "2022-10-25T17:12:56.000Z",
          "Titre": "Great behavioral health software",
          "Contenu": "The TherapyAppointment folks have been so helpful to us in our transition and they have been able to customize things for us when we had specific needs.  They are responsive to help requests, but we've also found the software very easy to use and had very few problems with it!  It's been a great addition to our office (we are 8 clinicians).  Credit card processing has been great, our office manager has found it a good product now that everything is set up.  It was a long process to get everything set up, but now that we're there, it's pretty seamless.  We have custom documentation so that we don't have to write much on our notes because things auto populate for us now that we have set it up.  We use the telehealth platform which works well for us.  We like that some of us can use on-line scheduling to varying degrees and that's an example of how it has been customizable to each clinician. The little things which aren't ideal have been more minor than what we ran into for theranest, therapynotes, and simple practice."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alice Vlietstra",
          "Nb_Reviews": 1,
          "Date": "2022-11-13T03:32:52.000Z",
          "Titre": "Insurance and Billing",
          "Contenu": "At first the details of billing and insurance was difficult.  I really appreciated the opportunity to have 20 minute consults with Tammy L and Darcey Driver.  They were very helpful.  Thanks again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sara Boghosian, PHD",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T22:35:26.000Z",
          "Titre": "I am very happy with Therapy…",
          "Contenu": "I am very happy with Therapy Appointment as an EMR for my small private practice. It makes scheduling, charting, and billing very user friendly for me. I would probably close my side practice if I did not have this resource!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melinda Dubbs",
          "Nb_Reviews": 2,
          "Date": "2022-10-31T02:33:52.000Z",
          "Titre": "TherapyAppointment listens to feedback",
          "Contenu": "TherapyAppointment has been truly wonderful to use! When I first started with the platform two years ago there were a few features I wished they had  (such as easier billing of clients with auto-pay and sliding scale) but they listened and were able to roll those out months later. That was amazing and I felt like I was heard. It's very rare I have any issues or downtime. I never need to use tech support because it's easy to use and doesn't have any issues. My clients also report that it's easy to use on their end for appointments. There are still a few little tweaks I wouldn't mind they add (I wish receipts could be emailed instead of print only. I also wish documents could be edited so that a therapist and client can both sign instead of the document being closed once a client submits. I wish Zoom offered a few more features such as a custom message for your waiting room. I also wish there was an easier way to send progress notes to client) but these are more Quality of Life upgrades that would really enhance the experience. Overall, a great platform and much easier to use compared to others I sampled before I chose."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Comforts Triage",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T22:52:46.000Z",
          "Titre": "New card upload feature",
          "Contenu": "We are so excited about the new card features on the main screen. We cannot tell you how much time this will save us. We also appreciate how quickly someone responds when we have any issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Gilbert",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T17:51:56.000Z",
          "Titre": "You all have been great since day one…",
          "Contenu": "You all have been great since day one of me singing up. Your responsiveness and patience with me (not a tech-savvy person) has been so helpful. Your tagline really is my experience (you provide the therapy, we handle the rest). Thank you so much!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sherry Reaves",
          "Nb_Reviews": 1,
          "Date": "2022-10-21T23:54:14.000Z",
          "Titre": "TherapyAppointment has been…",
          "Contenu": "TherapyAppointment has been life-changing for me as it eliminates the stress of running my practice by providing everything I need in a very smooth running, all inclusive way.  Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laura",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T14:40:42.000Z",
          "Titre": "TherapyAppointment is the best EHR…",
          "Contenu": "TherapyAppointment is the best EHR software that I have ever used. It’s easy to use and has everything that you need to start up your practice. The pricing is also very affordable and is a great value. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T01:50:14.000Z",
          "Titre": "I love this system!",
          "Contenu": "I did a great deal of research before choosing TherapyAppointment. Darsey, their onboarding specialist, has been amazing! Their customer support is outstanding! The system itself has all the necessary features. You can tell that TherapyAppointment has been designed by actual therapists. I highly recommend it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Diane Strouse",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T20:59:22.000Z",
          "Titre": "Therapy appointment has everything I…",
          "Contenu": "Therapy appointment has everything I need to run my private practice well. When I have questions, your staff is always quick to respond and resolves the issues. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J MORRIS",
          "Nb_Reviews": 1,
          "Date": "2022-11-18T14:49:59.000Z",
          "Titre": "Prompt, friendly service",
          "Contenu": "TA customer support is friendly and very helpful.  Remy responds to my questions or issues promptly and makes every effort to be helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary-Elizabeth LeBlanc",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T17:16:16.000Z",
          "Titre": "Great product",
          "Contenu": "I have been using TherapyAppointment for years. The updates on the electronic record including docs that can be electronically signed have been a crucial update since the pandemic. I have also been enjoying the Zoom telehealth feature."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Adkins",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T17:14:36.000Z",
          "Titre": "Awsome program!",
          "Contenu": "It is easy to get help from the support staff. You are constantly looking to improve the features of Therapy Appointment and you publish new featurs or improving features often."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T18:09:12.000Z",
          "Titre": "Quick Response from Support!",
          "Contenu": "Response from support was quick and helpful. Really like this organization and the platform."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christine Malone",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T19:15:59.000Z",
          "Titre": "Awesome system",
          "Contenu": "Awesome system! Does virtually everything my practice needs. Always on the cutting edge. Very responsive whenever there are questions or issues. Continually working to upgrade"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elle Garfield",
          "Nb_Reviews": 2,
          "Date": "2022-11-11T22:54:44.000Z",
          "Titre": "This program makes work easy",
          "Contenu": "This program makes work easy! The geniuses at Therapyappointment.com have thought of everything that would be helpful to therapists. I have no complaints."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adam",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T19:19:25.000Z",
          "Titre": "Overall wonderful",
          "Contenu": "Overall wonderfulThe UI has been really easy to learn and functions are laid out in an intuitive manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Katharina Hartman",
          "Nb_Reviews": 1,
          "Date": "2022-10-25T17:12:50.000Z",
          "Titre": "It is easy to learn",
          "Contenu": "It is easy to learn, straightforward organization of various options (for documentation, billing, etc.) and seems to have important professional features. Clients use it with ease.I asked questions and always was well guided."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mia Simmons",
          "Nb_Reviews": 1,
          "Date": "2021-04-20T20:51:14.000Z",
          "Titre": "TherapyAppointment is an amazing tool…",
          "Contenu": "TherapyAppointment is an amazing tool for Therapist! No matter how small or large your practice is it may serve you well; as it is a flexible tool to gather the mandated information you need on a comprehensive platform for an affordable price!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charlene",
          "Nb_Reviews": 1,
          "Date": "2021-04-24T20:56:42.000Z",
          "Titre": "I always get timely and informative…",
          "Contenu": "I always get timely and informative responses to my questions. When it's something that I see would be better, I am told that they will pass it up to those in charge."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christine",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T23:13:01.000Z",
          "Titre": "Wonderful platform",
          "Contenu": "Wonderful platform. I love the automation, easy use, and helped me to get my business set up quickly with plug and play template forms."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Russ Federman",
          "Nb_Reviews": 2,
          "Date": "2022-11-15T20:52:27.000Z",
          "Titre": "Great practice management program",
          "Contenu": "We’ll designed, user friendly, excellent customer service.  Have used the site for many years - strongly recommend it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wayne Williams",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T18:02:02.000Z",
          "Titre": "Very powerful program that has thought…",
          "Contenu": "Very powerful program that has thought through a lot of the needs of therapists and have made it easy to be in compliance with ethics and law."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Clarissa Crystal",
          "Nb_Reviews": 3,
          "Date": "2022-11-03T16:02:41.000Z",
          "Titre": "The Most Efficient System By Far",
          "Contenu": "I researched all the most popular programs and found this one to be the most efficient overall for multiple reasons, including the people are highly professional, knowledgeable, kind, and courteous; the system is a great way to schedule appointments and keep files without storing them in cabinets, boxes, and storage units; And, I love having active and inactive clients at my disposal with a click of a tab. Notwithstanding, I do have a few wishes. 1) I wish there was greater phone access when there is a question. Being referred to prompts and volumes of troubleshooting articles is not helpful. 2) I wish the system would allow you to correct errors in the notes found after it is locked. If we catch an error in a handwritten copy, we can correct it. Our signature is testimony to the integrity of the note. Why shouldn't we be able to correct it here? Couldn't we add a heading indicating it is a polished copy while leaving the first draft to preserve and prove the integrity of the content? That way, we can improve the punctuation, word omissions, grammar, name errors, etc., that 3rd party payors are adept at pointing out. 3) I wish there was a way to enter treatment plans that were in use and completed before being entered into the system, and 4) that there would be a second page for additional goals and objectives so immediate and short-term ones can be added. I hope this was helpful and not taken as being overly critical."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Renee Ahern",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T19:42:40.000Z",
          "Titre": "THERAPY APPOINTMENT  - Great Work!",
          "Contenu": "THERAPY APPOINTMENT is easy to use; a quick learn and has great support.  I’ve been using it for 3 months. It is much easier to learn and use than the previous platform that I used."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mina O'Connell",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T20:16:13.000Z",
          "Titre": "I think you do make my life easier",
          "Contenu": "I think you do make my life easier! Thank you, can't think of any glitches at the moment that cause problems. Will write as needed. Charting, billing, cc on file, reminders, etc. work great. Thank you. See peacewithGod.net for how Jesus teaches we go to Heaven. He died for you and loves you!! The book of John explains this well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cindy",
          "Nb_Reviews": 2,
          "Date": "2022-11-15T21:23:46.000Z",
          "Titre": "When I have neede help with any…",
          "Contenu": "When I have neede help with any question - your team responded immediately and arranged a conversation and/or chat support call within hours.  Always helpful and courteous."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer L",
          "Nb_Reviews": 1,
          "Date": "2022-10-20T00:47:01.000Z",
          "Titre": "all the support you offer!",
          "Contenu": "I appreciate all the support you offer. As well as the start up practice pricing which none of the other platforms have."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shannon L Deitch",
          "Nb_Reviews": 2,
          "Date": "2022-11-11T17:44:06.000Z",
          "Titre": "Customer Service",
          "Contenu": "Customer Service.  Anytime I have a question TA has quick response times and I am able to solve the problem quickly with support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Suzanne Johnson",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T17:21:17.000Z",
          "Titre": "When I was unable to understand how to…",
          "Contenu": "When I was unable to understand how to use a software I was able to talk to someone on the phone who helped me figure it out"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dr. William",
          "Nb_Reviews": 1,
          "Date": "2023-05-06T14:26:22.000Z",
          "Titre": "Impeccable Customer service",
          "Contenu": "Actual human contact for support in the transition was awesome. Slways quick responses. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lori",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T13:14:24.000Z",
          "Titre": "Excellent training on how to use…",
          "Contenu": "Excellent training on how to use therapy appointment website and easy to use website."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Victoria Anderson",
          "Nb_Reviews": 1,
          "Date": "2022-10-26T08:49:00.000Z",
          "Titre": "My experience was great",
          "Contenu": "My experience was great. My director was outstanding 👏. Please give her a raise. She was very caring and helpful. This class helped me alot."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "C. Eberhardt",
          "Nb_Reviews": 1,
          "Date": "2022-11-03T03:34:46.000Z",
          "Titre": "Therapy Appointment is great",
          "Contenu": "Therapy Appointment is great. I've used this EHR for the platform in my small private practice and am very happy with all of its functions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rachel Cooper-Stadler",
          "Nb_Reviews": 1,
          "Date": "2022-11-01T23:18:03.000Z",
          "Titre": "Exceeds Expectations",
          "Contenu": "Communication from TherapyAppointment regarding required maintenance is always \"on time\" by being ahead of time - ample notice is offered. Payment processing, scheduling appointments, and using the secure inbox is also incredibly user friendly. I've been happy with my choice to partner with TherapyAppointment!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary Logan, Chaos to Calm Coun",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T17:15:12.000Z",
          "Titre": "I love this product",
          "Contenu": "I love this product.  It is robust and the array of reports and flexibility with my growing practice is wonderful. Also , the customer service and support is excellent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael McFarland, PhD",
          "Nb_Reviews": 1,
          "Date": "2022-11-14T18:21:11.000Z",
          "Titre": "Constant Improvements!",
          "Contenu": "I am impressed with the steady release of improvements in functionality.  This system is perfect for my private practice!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicole Blocker",
          "Nb_Reviews": 1,
          "Date": "2022-10-19T22:38:14.000Z",
          "Titre": "Excellent EMR",
          "Contenu": "I can really appreciate the ease of use with the site. I also like the different progress note options."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lauren",
          "Nb_Reviews": 1,
          "Date": "2022-10-29T04:42:32.000Z",
          "Titre": "Responsive help/customer service team",
          "Contenu": "Responsive help/customer service team.  User friendly to therapists and clients.  There are regular improvements to the EHR.  I feel that my feedback is taken into consideration."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christy Stewart",
          "Nb_Reviews": 1,
          "Date": "2022-11-12T01:40:49.000Z",
          "Titre": "TherapyAppointment.com is helpful in running my practice!",
          "Contenu": "I appreciate the ease of note keeping, insurance billing, and tracking finances. In addition, response from tech support is quick and helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sherry Thomas",
          "Nb_Reviews": 4,
          "Date": "2022-10-24T02:11:51.000Z",
          "Titre": "The platform is easy to manage",
          "Contenu": "The platform is easy to manage, when I have problems it is easy to connect with help and resolve things."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jack R",
          "Nb_Reviews": 1,
          "Date": "2022-11-04T22:42:34.000Z",
          "Titre": "Love it",
          "Contenu": "TherapyAppointment is easy to use and works great. I'll definitely be continuing to use it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tucson Counseling",
          "Nb_Reviews": 1,
          "Date": "2022-11-16T02:39:02.000Z",
          "Titre": "Support when you need it.",
          "Contenu": "The software is awesome and helps our practice run smoothly but what makes Therapy Appointment really stand out is the availability of support and the the support staff's willingness to respond to our needs in a timely and helpful way."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ATP, FTW TX",
          "Nb_Reviews": 2,
          "Date": "2022-11-21T01:38:22.000Z",
          "Titre": "Responsive when you need help",
          "Contenu": "Responsive when you need help!  Software is easy to use and makes therapy easier!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jamie S",
          "Nb_Reviews": 1,
          "Date": "2022-11-03T17:31:20.000Z",
          "Titre": "Customer service is always available…",
          "Contenu": "Customer service is always available and helpful, the product has suited all of my needs as a therapist"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christi Chalker Legacy Counsel",
          "Nb_Reviews": 1,
          "Date": "2022-10-19T22:19:54.000Z",
          "Titre": "The accounting part of the program is…not a normal accounting set up. The credit distribution took some getting used to and my therapist and clients have a hard time understanding their statement with",
          "Contenu": "The accounting part of the program is not easy to use and it is difficult for our clients to understand."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stefani Roscoe",
          "Nb_Reviews": 6,
          "Date": "2023-07-14T00:52:19.000Z",
          "Titre": "All is well so far…",
          "Contenu": "So far Darlene and Denise have been available and helpful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cheri Craft",
          "Nb_Reviews": 2,
          "Date": "2022-11-11T20:35:34.000Z",
          "Titre": "It is easy to navigate and has short…",
          "Contenu": "It is easy to navigate and has short cuts to help with completing paperwork"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T05:16:25.000Z",
          "Titre": "Alyssa Broshar was helpful in releasing…",
          "Contenu": "Alyssa Broshar was helpful in releasing my stress and I can't wait to see her again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tamara Letcher",
          "Nb_Reviews": 1,
          "Date": "2022-10-23T22:56:42.000Z",
          "Titre": "Love the support ease of access and…",
          "Contenu": "Love the support ease of access and reminders. This has been a great platform to use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Fallon",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T17:11:59.000Z",
          "Titre": "Everything works well",
          "Contenu": "Everything works well.  The software captures all the right data.  A few years ago I scored 100% on a Medicare audit.  I never think about TA."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Josh Hetherington, CCRC",
          "Nb_Reviews": 2,
          "Date": "2022-11-19T15:44:55.000Z",
          "Titre": "Great Tool, Great Support",
          "Contenu": "It allows me to run my group practice, and  the support team is amazing!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wendy Kraus",
          "Nb_Reviews": 1,
          "Date": "2022-11-12T00:34:32.000Z",
          "Titre": "Very easy to use",
          "Contenu": "Very easy to use. When I have a problem the customer service is quick to help and get me the answers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sarah Allen",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T17:50:02.000Z",
          "Titre": "The platform is efficient and easy to…",
          "Contenu": "The platform is efficient and easy to maneuver, both in timekeeping and billing aspects."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bobbi Burg",
          "Nb_Reviews": 1,
          "Date": "2022-11-18T22:26:57.000Z",
          "Titre": "I have been using TherapyAppointment…",
          "Contenu": "I have been using TherapyAppointment for a few years, and you continue to improve."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deborah Mertlich",
          "Nb_Reviews": 1,
          "Date": "2022-10-28T20:20:43.000Z",
          "Titre": "Customer service is amazing",
          "Contenu": "Customer service is amazing. I love how easy things are to use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim Carlton",
          "Nb_Reviews": 1,
          "Date": "2022-10-20T19:00:23.000Z",
          "Titre": "Ease of use and the different features…",
          "Contenu": "Ease of use and the different features help provide a foundation for online management and scheduling."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dr. Roxy",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T18:12:24.000Z",
          "Titre": "Our training with Denise!",
          "Contenu": "Our training with Denise!She is terrific!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2023-02-12T15:16:04.000Z",
          "Titre": "Very prompt help",
          "Contenu": "Very prompt help.  The staff always makes sure the problem gets resolved.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Iris Santos",
          "Nb_Reviews": 2,
          "Date": "2022-11-02T03:34:20.000Z",
          "Titre": "The value",
          "Contenu": "The value, the customer service are always there when I need help, the easiness of the system and overall, HIPAA compliance regulations."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T18:21:15.000Z",
          "Titre": "Helpful practice platform",
          "Contenu": "The personalized attention to my starting practice and how therapy appointment could support it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marty Murphy",
          "Nb_Reviews": 1,
          "Date": "2022-11-21T23:14:02.000Z",
          "Titre": "Good response to email questions",
          "Contenu": "Good response to email questions.  Great customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kimberly Nicolson",
          "Nb_Reviews": 1,
          "Date": "2022-11-02T04:02:51.000Z",
          "Titre": "User Friendly and Comprehensive",
          "Contenu": "TherapyAppointment has been extremely user friendly and responsive to my questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Catherine Hunter",
          "Nb_Reviews": 1,
          "Date": "2022-11-13T23:36:44.000Z",
          "Titre": "I’ve been using TA now about 3 years",
          "Contenu": "I’ve been using TA now about 3 yearsThis January we moved to 2.0It’s very helpful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DoctorD",
          "Nb_Reviews": 1,
          "Date": "2022-10-29T21:15:44.000Z",
          "Titre": "It’s affordable for my small practice."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joan Huebl",
          "Nb_Reviews": 1,
          "Date": "2022-10-24T21:55:35.000Z",
          "Titre": "Platform is straightforward and easy to…",
          "Contenu": "Platform is straightforward and easy to use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kimberly Schenke",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T18:10:35.000Z",
          "Titre": "responsive",
          "Contenu": "Very responsive to the needs of our company"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "pam",
          "Nb_Reviews": 1,
          "Date": "2023-02-20T01:15:24.000Z",
          "Titre": "Was easy to follow and enjoyable to use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sara Little",
          "Nb_Reviews": 1,
          "Date": "2022-11-13T05:48:32.000Z",
          "Titre": "Reliable Tech support",
          "Contenu": "Tech support has been consistently rapidly responsive via email."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Heather Schuck",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T19:23:52.000Z",
          "Titre": "Very quick response that was very clear…",
          "Contenu": "Very quick response that was very clear and helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jadea Miller",
          "Nb_Reviews": 1,
          "Date": "2022-11-14T00:30:33.000Z",
          "Titre": "Wonderful platform",
          "Contenu": "Wonderful platform! East to use!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Linkevich",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T20:21:59.000Z",
          "Titre": "The response was prompt and the info…",
          "Contenu": "The response was prompt and the info was very helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Abby Schreiber",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T18:16:52.000Z",
          "Titre": "Excellent, thoughtful vehicle to manage private practice",
          "Contenu": "Fabulous customer service. Platform very intuitive and user friendly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ted Stein",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T20:29:00.000Z",
          "Titre": "GREAT SUPPORT!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sarah linder",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T19:27:32.000Z",
          "Titre": "Love all the updates",
          "Contenu": "Love all the updates, keep it up!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay Levin",
          "Nb_Reviews": 2,
          "Date": "2022-11-12T14:31:56.000Z",
          "Titre": "Excellent program",
          "Contenu": "Excellent program. Very good support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Annette Munguia",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T17:03:26.000Z",
          "Titre": "Great platform",
          "Contenu": "Great platform, good customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Priscilla Johnson",
          "Nb_Reviews": 1,
          "Date": "2022-11-02T16:58:03.000Z",
          "Titre": "Accessibility to Zoom on…",
          "Contenu": "Accessibility to Zoom on TherapyAppointment is very helpful and convenient."
        }
      ]
    }
  ]
}