{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "therangehoodstore.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Cerniglia",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T18:27:44.000Z",
          "Titre": "Deceptive practices! This company stated an extension was…",
          "Contenu": "This company stated an extension was necessary. If you had a nine or 10 foot ceiling for a hood vent. Want to purchase then install I realize the extension was not necessary and called to return it just to find out the policy was not to take back extensions. I felt this was a very deceptive policy just to sell more product"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christian Wagner",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T02:28:05.000Z",
          "Titre": "Charged me for a “in stock product”",
          "Contenu": "Charged me for a “in stock product” Sent a shipping confirmation. Two weeks later no delivery. Turns out the item was back ordered and unavailable."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "richburtneryahoo.com",
          "Nb_Reviews": 2,
          "Date": "2023-04-05T22:11:13.000Z",
          "Titre": "Do not buy from here",
          "Contenu": "Do not buy from here. I got a damaged hood. They gave me 10% off."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T13:33:17.000Z",
          "Titre": "Too Much Stuff",
          "Contenu": "When I went to checkout, I noted that I had inadvertently included two crown molding kits.  I attempted to remove one kit by reducing the quantity to zero.  The checkout reflected the reduction and showed a total price of $1,008 plus taxes to be determined.I then went through the checkout procedure, thin king my order was satisfactory.  When the order summary was posted, there were two crown molding kits and a cost 0f $1118.I immediately e-mailed the company noting that I o only wanted one crown molding kit.  To no avail.  I received two.Just to rub my nose it this extra $90 plus tax, the next day the hood I ordered was reduced in. price substantially.  That's the way it goes - I needed to order the hood ASAP and couldn't wait for sales.  I didn't need, and don't want two crown moldings.  The in ability of RH to correct this fiasco is frustrating."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Thomas Smith",
          "Nb_Reviews": 2,
          "Date": "2023-09-20T00:05:46.000Z",
          "Titre": "Damage with no recourse",
          "Contenu": "I will say that the exhaust hood that we ordered is a quality product, but I certainly would not purchase from this particular company again. We are builders in New Jersey, as a matter of course to stay ahead of things and on schedule, we order items well in advance of when they are needed. When this exhaust vent hood was delivered, it was noted that there was slight damage to the box, at which point I wrote on the delivery receipt that it was damaged and called the company as well to report the damage. Unbeknownst to us, they have a 60 day period to inspect the item for physical damage. As mentioned, we order items in advance, so they are on hand when needed, inspection of the actual item took place at the job site a few days past the 60 day review window, and damage was only noticed after we peeled off the protective film. At that point, we were informed of the 60 day review window, with no recourse. We of course thought this seemed unfair, so my manager has called this company no less than three times, requesting a callback from a manager. You would think they would respectfully at least call back, but they have not as of this writing.So our advice is just beware, and inspect your items immediately once they come in, no matter the condition of the box, as the condition of our box in no way represented the damage that was done to the unit. We tried to do the right thing and be proactive, if someone at their company told us we only had 60 days to unpack the product and inspected, we would have done so.T. Smith/J. KalnasMy Deck, LLCFlemington, NJ 08822908-713-1000"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JW",
          "Nb_Reviews": 3,
          "Date": "2023-05-15T15:46:28.000Z",
          "Titre": "My complaint is actually with ZLine…",
          "Contenu": "My complaint is actually with ZLine more than the Range Hood Store. Shipping was fast. The price for the ZLine microwave trim kit is ridiculously high for what you get. Also, the installation instructions were very difficult to follow and I am very handy. Lastly, the trim kit only works on a very limited opening, I had to modify the kit to fit in the space for the microwave. A trim kit should allow for various opening sizes, this one does not."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Vaderaide",
          "Nb_Reviews": 2,
          "Date": "2023-05-02T02:24:31.000Z",
          "Titre": "Tracking of the delivery is HORRIBLE",
          "Contenu": "Tracking of the delivery is HORRIBLE.    Called for pickup on April 27, no update on this delivery as of May 1"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "CHRISTINA COULSON",
          "Nb_Reviews": 2,
          "Date": "2023-04-01T01:50:07.000Z",
          "Titre": "Price and delivery excellent",
          "Contenu": "Price and delivery excellent, but was not told I had to bring it into house myself or that was not included."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Smith",
          "Nb_Reviews": 1,
          "Date": "2023-05-06T11:54:55.000Z",
          "Titre": "DON'T MAKE ANY ERRORS- updated",
          "Contenu": "I had an initial hiccup with the company. After a complaint, from me, the company’s “Sales Team”  reached out and offered to refund or exchange my product. I will say, I am impressed with the level of service I have received from the “Sales Team”. I will not say much about the customer service experience. I appreciate the help I have received from Mr. Tim S."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Zac",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T16:38:06.000Z",
          "Titre": "Fast shipping",
          "Contenu": "Fast shipping, install was slightly difficult. Would recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevan McCutcheon",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T16:27:18.000Z",
          "Titre": "My sales guy was absolutely fantastic",
          "Contenu": "My sales guy was absolutely fantastic. He was patient, diligent, went above and beyond to procure extra information and guide, which item I wanted I needed. And he must’ve worked some magic in order to get it delivered five days before we were worried WKSU it would take! Please give that guy a raise because he’s very very good!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patricia evans",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T01:17:28.000Z",
          "Titre": "The customer service was top notch!",
          "Contenu": "The customer service was top notch!They made is so easy to purchase.  The team answered my questions very quickly.   It is nice to deal with an individual who knows the brand very well.  I love my new range hood!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Stewart",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T02:08:47.000Z",
          "Titre": "Actually talked to someone on the phone…",
          "Contenu": "Actually talked to someone on the phone to put the order together. First company in a long time that I've been able to reach someone on the phone immediately. Shipping was also fast and they used a reputable shipping company, FedEx; not some cheap no name shipper."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Manny Guzman",
          "Nb_Reviews": 2,
          "Date": "2023-10-03T01:44:21.000Z",
          "Titre": "YOU ALL ARE AWESOME!",
          "Contenu": "YOU ALL ARE AWESOME!!  The ease of placing the order, great fall sale as well and WOW super fast shipping. Our Zline microwave was packaged very well. Emails were coming from you all fast and continuous. Tracking was great too. I am praising the Lord for this company. Thank you thank you thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles Lewis",
          "Nb_Reviews": 9,
          "Date": "2023-04-10T22:29:48.000Z",
          "Titre": "Very impressed with the Zline…  But one of the sales manager should be fired immediately!",
          "Contenu": "Very impressed with the Zline appliances (I bought a double oven, gas cooktop, refrigerator, dishwasher and hood.)  I was very happy with the buying process with one exception.  The customer service manager (I did not get her name but she works for Robyn) was a total smart aleck.  I am 76 years old.  Out of my many years of dealing with sales managers, owner, sales people, etc. I can honestly say she was the worse.  Zline definitely should get rid of her immediately.  After insisting on speaking with a higher up manager in the company, I was finally transferred to Robyn. Robyn was very nice and took care of the problem immediately."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "V Hans",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T01:32:57.000Z",
          "Titre": "Zline for the win!",
          "Contenu": "Everything about the process including the ordering, shipping, and ease of installation met our expectations.  The build quality and performance of this hood is top notch.  We will definitely consider other Zline products in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kim",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T18:19:29.000Z",
          "Titre": "Outstanding product and customer service…",
          "Contenu": "Outstanding customer service and very nice quality products - purchased numerous product for use in a new house - extremely please with everything.  Prices are very good and shipment/delivery quick.  Excellent company that I don’t hesitate in recommending (I don't normally write reviews, but Zline is exemplary)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dewey Fitch",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T04:02:25.000Z",
          "Titre": "Excellent Experience",
          "Contenu": "Item was shipped and received quickly. Item was correct as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jose Melendez Guerrero",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T07:29:47.000Z",
          "Titre": "Your products make me very satisfied…",
          "Contenu": "Your products make me very satisfied and they look great  on everything in your kitchen. Also they look very modern and efficient. They help me out with my purchased ,  thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GMinAZ",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T22:27:00.000Z",
          "Titre": "Purchase Review",
          "Contenu": "I have purchased a couple of Zline appliances from The Range Hood Store and they have always been very nice and easy to deal with. I have interacted with both customer service and inside sales. Shipping and delivery has always been fast and on time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donald streger",
          "Nb_Reviews": 4,
          "Date": "2023-05-12T18:30:33.000Z",
          "Titre": "Quick delivery and easy purchase of our…",
          "Contenu": "Quick delivery and easy purchase of our Zline range hood. The range hood was easy to install by our election and contractor. The Range hood is a perfect fit with the short chimney feature. The 24 inch size was also a perfect fit to our small kitchen. The ventless feature was also an easy converstion. The lighting is a great feature as well. It looks great, very up scale."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ray Hamberger",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T23:54:18.000Z",
          "Titre": "Sales person knew exactly what I…",
          "Contenu": "Sales person knew exactly what I needed, told him I could not find it online. Have already received the crown molding. Was ordered within five minutes after speaking with him, thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PAUL",
          "Nb_Reviews": 2,
          "Date": "2023-03-21T01:16:35.000Z",
          "Titre": "Great to work with",
          "Contenu": "Great to work with!   Carried all of the accessories that I needed for my project.    Always provided detailed information about shipping, delivery dates etc. Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa Gleason",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T21:04:25.000Z",
          "Titre": "Great customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tabitha Shirey",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T13:08:13.000Z",
          "Titre": "Customer Service is amazing",
          "Contenu": "Customer Service is amazing! I have placed both of my orders over the phone and the customer service provided was absolutely amazing!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JoAnn",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T16:41:45.000Z",
          "Titre": "Good Experience",
          "Contenu": "Sales Rep was informative and knowledgeable. The unit was delivered quickly and in excellent shape. It looks great in the kitchen"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julianne",
          "Nb_Reviews": 2,
          "Date": "2023-03-26T00:02:30.000Z",
          "Titre": "Alex is so patient and helpful in…",
          "Contenu": "Alex is so patient and helpful in answering all my questions each time I call to get more information about Zline products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan DiGiovanni",
          "Nb_Reviews": 1,
          "Date": "2023-03-25T23:26:43.000Z",
          "Titre": "Speedy service",
          "Contenu": "I ordered 2 charcoal filters online and they arrived at my house within 2 days.  Couldn't ask for more!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan Ross",
          "Nb_Reviews": 1,
          "Date": "2023-04-02T19:11:53.000Z",
          "Titre": "Knowledgeable staff",
          "Contenu": "Knowledgeable staff, helped me to find what I needed quickly and easily. The product was shipped quickly and arrived undamaged."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sarah Vanneman",
          "Nb_Reviews": 2,
          "Date": "2023-04-04T23:24:38.000Z",
          "Titre": "Most everything went well but...",
          "Contenu": "Everything went smoothly. Except we did not hear anyone knock or ring the bell when it was delivered. We made a point of being home."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob H",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T18:39:55.000Z",
          "Titre": "Very quick (free) shipping",
          "Contenu": "Very quick (free) shipping.  Well packaged, arrived in perfect condition."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan Himmerich",
          "Nb_Reviews": 1,
          "Date": "2023-07-01T21:15:27.000Z",
          "Titre": "Fantastic pre-sale Support",
          "Contenu": "Fantastic, fast engagement as I pondered options and needed input. Fast shipping. Next, installation..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carol Douglas",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T16:13:47.000Z",
          "Titre": "Fast delivery",
          "Contenu": "Fast delivery! Item arrived well packed! Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tammy",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T03:06:42.000Z",
          "Titre": "They shipped quickly in the most…",
          "Contenu": "They shipped quickly in the most excellent packaging!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GramRhonda",
          "Nb_Reviews": 2,
          "Date": "2023-09-08T17:29:19.000Z",
          "Titre": "They made the purchase easy and were…",
          "Contenu": "They made the purchase easy and were very helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristal Gordon",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T04:02:43.000Z",
          "Titre": "Customer service",
          "Contenu": "Helpful and efficient people who followed through. Fast delivery"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank Riddell",
          "Nb_Reviews": 2,
          "Date": "2023-04-09T22:25:04.000Z",
          "Titre": "easy to install,looks great does…",
          "Contenu": "easy to install,looks great does exactly what I want"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T05:39:29.000Z",
          "Titre": "Delivered the exact product I needed…",
          "Contenu": "Delivered the exact product I needed very quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Patrick",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T21:43:56.000Z",
          "Titre": "Very professional staff",
          "Contenu": "Very professional staff; easy tracking of order. Most importantly - on-time delivery."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tacheng",
          "Nb_Reviews": 5,
          "Date": "2023-07-06T21:10:51.000Z",
          "Titre": "Easy ordering and fast shipping"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John LePore",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T17:18:27.000Z",
          "Titre": "Great customer service and prompt!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas Haehn",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T01:16:42.000Z",
          "Titre": "Quick and professional service",
          "Contenu": "Quick and professional service. Good communication and now waiting for the delivery."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Rowe III",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T13:49:54.000Z",
          "Titre": "Good communication",
          "Contenu": "Good communication, fast processing, shipment arrived on time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carey Graybill",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T04:40:04.000Z",
          "Titre": "Got delivered on time"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joni Mahoney",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T20:13:34.000Z",
          "Titre": "Very good service",
          "Contenu": "Very good service, nice people"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathy L",
          "Nb_Reviews": 2,
          "Date": "2023-05-06T15:57:28.000Z",
          "Titre": "Fast shipping and packed well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Dirsh",
          "Nb_Reviews": 1,
          "Date": "2023-06-10T13:48:42.000Z",
          "Titre": "Excellent information",
          "Contenu": "Excellent information. Good price and professional advise. Free shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stacy Collins",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T20:27:05.000Z",
          "Titre": "Fantastic service!",
          "Contenu": "Fantastic service!! Efficient, knowledgeable, friendly!! Above and beyond!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sanford Winn",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T01:24:20.000Z",
          "Titre": "Great product",
          "Contenu": "Great product Fast deliveryGood communication"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patricia Maguire",
          "Nb_Reviews": 4,
          "Date": "2023-04-03T15:40:08.000Z",
          "Titre": "Fast delivery",
          "Contenu": "Awesome Fast delivery"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shale Parker",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T20:22:00.000Z",
          "Titre": "GREAT  THSNKS"
        }
      ]
    }
  ]
}