{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "theunitysoft.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "LT",
          "Pseudo": "Tadas Surgailis",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T12:03:56.000Z",
          "Titre": "The WIN11 license code didn't work."
        },
        {
          "Note": 1,
          "Lieu": "MK",
          "Pseudo": "Pavlina Trencevska",
          "Nb_Reviews": 1,
          "Date": "2021-12-08T00:38:48.000Z",
          "Titre": "TheUnitySoft",
          "Contenu": "TheUnitySoftMiami Beach Media LLC2880 West Oakland Park / 33311 / Florida / United StatesINVOICEPavlina Trenchovska5 MakedonijaPehcevoNorth Macedonia2326North MacedoniaInvoice Number: 94006Invoice Date: December 7, 2021Order Number: 319322Order Date: December 7, 2021Payment Method: Credit CardCustomer VAT Number:Product Quantity PriceMicrosoft Office Professional Plus 2019 License Keys for Windows– 1PCAnd I could not download or install my office even I already pay for it"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "TheBoyzLondon",
          "Nb_Reviews": 55,
          "Date": "2023-05-05T04:54:35.000Z",
          "Titre": "WARNING. Scam alert.",
          "Contenu": "WARNING.Purchased software in advance from this company in good faith with intention of using it when I renew my computer.When I purchased a new computer the software wouldn’t work. I contacted Unitysoft only for them to say I’d have to purchase the license again.When I asked why, what they didn’t make clear is that there is a shelf life for a licence even though you have paid for it. Total waste of money.I DO NOT recommend these people. Not helpful aftercare at all. 🙁"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "trefor",
          "Nb_Reviews": 17,
          "Date": "2023-03-30T18:17:55.000Z",
          "Titre": "Microsoft office 2021 could not be installed on pc",
          "Contenu": "Microsoft office 2021 would not load as the microsoft windows security check stated software not genuine.Ws advised by unitysoft to switch this alert off and it still didn't load so asked for refund and advised this was not possible \"I am afraid a refund is not possible as this is a local issue from your PC\" The PC was a brand new HP laptop so can't see how the PC was the problem."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "AndrewS",
          "Nb_Reviews": 1,
          "Date": "2021-12-04T11:46:37.000Z",
          "Titre": "I purchased MS Office 2016 and…",
          "Contenu": "I purchased MS Office 2016 and installed it. Initially it worked fine, so I thought the key was valid and legitimate. But after some time, when I open up MS Office, it says my product failed to activate and was for corporate use. I entered the key in that I received from Theunitysoft, and activation failed saying it cannot be activated because product key was invalid.I got duped."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "stewart thomson",
          "Nb_Reviews": 5,
          "Date": "2022-04-22T19:58:11.606Z",
          "Titre": "Really should be ZERO stars.",
          "Contenu": "Really should be ZERO stars.I seem to have bought from these people a 30 day trial of MS Office 2021. I am now being told to activate.My login is mysteriously 1) not valid and 2) trying to change it returns a \"404 not found\" messageHappy for someone to help me out and I'll change the  review. Right now this feels like a scam"
        },
        {
          "Note": 1,
          "Lieu": "GR",
          "Pseudo": "Ευάγγελος Βαλσαμίδης",
          "Nb_Reviews": 1,
          "Date": "2021-09-26T14:15:04.000Z",
          "Titre": "installation problem",
          "Contenu": "I have problem with installation of Office 2019 from yesterday.I have already sent a mail,I was trying to speak in chat but i havent any answer.Please contact ,I cant work."
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "tuna",
          "Nb_Reviews": 8,
          "Date": "2022-07-31T18:02:07.000Z",
          "Titre": "Don’t bother",
          "Contenu": "Don’t bother. Key won’t work and they won’t refund. They want you to go through a lengthy MULTIPLE HOURS long process screenshotting EVERYTHING before theyll refund. Not worth a 4 hour ordeal for $20 back. Sad. Don’t use!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "G Reid",
          "Nb_Reviews": 1,
          "Date": "2021-12-03T10:18:50.000Z",
          "Titre": "Tom was rude as the transcript of my…",
          "Contenu": "Tom was rude as the transcript of my chat confirms.  Very unhelpful and the standard of service abominable, particularly, when your system was clearly at fault."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Kenneth",
          "Nb_Reviews": 6,
          "Date": "2022-01-03T11:58:54.000Z",
          "Titre": "Difficulty and trouble obtaining a refund within cooling off period",
          "Contenu": "Having not yet activated the MS software license that I had been sent I had requested pre-installation advice on the adequacy to run on a Mac platform.This led to a large amount of emails in both directions which made me more and more uneasy resulting in me choosing not to use the license that I was sent.So, still being within the 14 day cooling off period, I requested a refund.First of all I was told that they do not do refunds. Then they wriggled and wriggled seeming to ignore my refund request.I pointed out the relevant clauses in the Consumer Contracts (Information, Cancellation and Additional Charges) Regulations 2013 for distant selling and cooling off but got no reply. Section 34 (4) states that a refund must be provided without undue delay.  Section 34 (7) states the trader must make the reimbursement using the same means of payment, Mark Smith had originally stated that he did not even know how they had been paid.The following day I advised them that Which? Legal department had suggested asking them why they might feel that this cooling off period did not apply to them. I received a refund immediately.Incidentally, under their refund policy, they have a link to Which?  where it outlines the essentials of this act. When I advised Which? of this link they were most surprised.They are very closely meshed with unitedsoftware.co.uk with both companies having the same office in Miami, Florida; and here they are trying to use UK law.Names that came up in the above process were Guido Augusto Beggino (named as the authorised representative for Trusted Shops Trustmark, and could be the boss), Mark  Smith (level 2 support agent who front lined all communication) and Tom Morgan (the refunder).Mark Smith expressed in the refund notification email “Deeply sorry for the inconvenience.”"
        },
        {
          "Note": 1,
          "Lieu": "CH",
          "Pseudo": "Client Content",
          "Nb_Reviews": 2,
          "Date": "2022-12-05T16:53:25.000Z",
          "Titre": "Les codes de de la version Windows 10…",
          "Contenu": "Les codes de de la version Windows 10 Pro. Ne sont pas accepté par Microsoft."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "B Silver",
          "Nb_Reviews": 1,
          "Date": "2022-01-14T09:50:06.000Z",
          "Titre": "Abrupt and impatient customer service",
          "Contenu": "Abrupt, impatient customer service.Had to do a full reformat after trying to install the software."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Quintis Beetge",
          "Nb_Reviews": 5,
          "Date": "2021-12-31T16:40:05.000Z",
          "Titre": "Well you might say if you buy something…",
          "Contenu": "Well you might say if you buy something in about 20 minutes after you’ve bought it you realise that you don’t need anymore or that you’ve bought the wrong thing and then you get told that you’re stuck with the product well dandy dandy I’m stuck with a product I don’t want that I’ve paid for and you will not take it back and refund me because it’s in your policy"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Rejaul",
          "Nb_Reviews": 2,
          "Date": "2023-07-01T23:52:36.000Z",
          "Titre": "Didn't work."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Davis Coley",
          "Nb_Reviews": 1,
          "Date": "2020-02-15T08:05:55.000Z",
          "Titre": "Company used to be called Software…",
          "Contenu": "Company used to be called Software Geeks.  Bought Windows 7 from them last year.  Just started it up and it says not a genuine version of Windows and asking me to enter my key.  I had already done this so Windows has deactivated in the last few months.  Go to TheUnitySoft support page and there is no way to contact them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ash",
          "Nb_Reviews": 2,
          "Date": "2019-12-09T15:50:48.000Z",
          "Titre": "license key for windows pro",
          "Contenu": "I purchased a license key for windows 10  pro from their website . Key didn't work and After several emails back and forth they refused to refund me. I had to put dispute on the transaction To get my money back.  Very bad experience and i don't recommend them at all.if i could i would have given them zero stars."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Rob",
          "Nb_Reviews": 2,
          "Date": "2019-10-17T12:12:08.000Z",
          "Titre": "License key has stopped working",
          "Contenu": "The Microsoft Professional Plus 2019 license that I bought has stopped working, softwaregeeks has now rebranded as \"theunitysoft.com\" and no longer recognises my old account.The support page on theunitysoft.com is blank so there is no support available."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Tahaan",
          "Nb_Reviews": 2,
          "Date": "2020-07-21T23:48:21.000Z",
          "Titre": "BUYERS BEWARE!!!",
          "Contenu": "If I could give less than one star, I would. Upon downloading the program, I have had nothing but problems. I have emailed support only to be told they don’t take responsibility, there is no refund, basically BAD LUCK.I DO NOT RECOMMEND THIS COMPANY AT ALL!!!! BUYERS BEWARE!!!!Prior to downloading the software, I never had any problems with threats or malware. I have 2 laptops, they both have the same apps, everything is the same. The only difference is the one that The Unity Soft program was downloaded on is the one that has threats. Regardless as to the comments by Unity Soft, I stress BUYER BEWARE!!!I DO NOT RECOMMEND THE UNITY SOFT!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "B. Dunbar",
          "Nb_Reviews": 1,
          "Date": "2019-07-20T00:51:58.000Z",
          "Titre": "Unable to download Windows 7",
          "Contenu": "Each time I attempted to download the software I get a \"Failed-Network\" error indicating that there are \"unwanted\" programs on my computer, however, there are no \"unwanted\" programs on my computer."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Caroline Ayacha",
          "Nb_Reviews": 1,
          "Date": "2020-08-12T16:41:02.000Z",
          "Titre": "Buyer's beware",
          "Contenu": "Buyer's beware.  Golden rule of thumb, If it sounds to good to be true it usually is.  Microsoft office 1 time fee of $29.99... RightThis is a fraudulent company.  They do not have keep your order no. on file.  Or your name, coordinates etc. Once you purchase the product, go to order history, your order is not there.  You have to download things onto your computer.  I contacted them less than 10 days without using or downloading their software and they could not even give me my $29.99 back.  They are willing to lose their credibility for $30.  I cancelled my credit info so they could no longer take $$$ from my account.  If I ever get a refund from them, I will be more than happy to write a positive review."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Laurence",
          "Nb_Reviews": 2,
          "Date": "2020-05-26T18:32:36.000Z",
          "Titre": "The download links did not work",
          "Contenu": "The download links did not work.  When contacting customer support I just received a response saying the links do work.  When I re-iterated that they don't, I just received the same copy and paste response."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Emre Can GUDER",
          "Nb_Reviews": 1,
          "Date": "2023-01-01T16:14:37.000Z",
          "Titre": "Product doesnt work."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Anon",
          "Nb_Reviews": 1,
          "Date": "2021-09-02T09:27:49.000Z",
          "Titre": "Received the key and also a link for…",
          "Contenu": "Received the key and also a link for the download, however the download was corrupted so not usableFortunately i was able to get the download from another source and use the key"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "ZT",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T17:12:11.000Z",
          "Titre": "The product didn't work."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "David Alessi",
          "Nb_Reviews": 1,
          "Date": "2019-07-23T07:35:55.000Z",
          "Titre": "the licence i bought for Office 2016…",
          "Contenu": "the licence i bought for Office 2016 didn't work. I sent an email and got a reply that didn't fix the problem. it was a waste of money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Larry vincent",
          "Nb_Reviews": 2,
          "Date": "2019-09-03T18:32:08.000Z",
          "Titre": "Wouldnt download ....",
          "Contenu": "Wouldnt download ..... plz refund.... the thumbdrive... has no files.Download wouldnt complete.Plz just refund the money."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Debs Foster",
          "Nb_Reviews": 1,
          "Date": "2020-07-10T15:34:01.000Z",
          "Titre": "I bought the product code and it…",
          "Contenu": "I bought the product code and it doesn't work... I've messaged them so hoping for a new code or refund ."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Donaldw",
          "Nb_Reviews": 2,
          "Date": "2019-10-18T14:33:22.000Z",
          "Titre": "Office 2016 key does not work.",
          "Contenu": "Office 2016 key does not work.No repsonce from email.Support page does not work on web site.Not recommended"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Josh Criddle",
          "Nb_Reviews": 1,
          "Date": "2021-09-24T22:17:12.000Z",
          "Titre": "Scam",
          "Contenu": "Scam, Scam, Scam  Sent already used Window's 19 code.  We'll see if they fix or refund."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "carl",
          "Nb_Reviews": 1,
          "Date": "2019-09-02T22:34:17.000Z",
          "Titre": "bought product no instructions on…",
          "Contenu": "bought product no instructions on installing sent email no responce still dont have it installed"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Peter",
          "Nb_Reviews": 1,
          "Date": "2019-07-06T07:34:28.000Z",
          "Titre": "I have not managed to download my…",
          "Contenu": "I have not managed to download my program yet 1week on with minimal assistance from theunitysoft"
        },
        {
          "Note": 1,
          "Lieu": "GR",
          "Pseudo": "Georgios STAVROS RAKITZIS",
          "Nb_Reviews": 1,
          "Date": "2021-01-02T10:21:26.000Z",
          "Titre": "The key doesn't work",
          "Contenu": "The key doesn't work. It tells me that the windows key doesn't activated"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jonathan Davis",
          "Nb_Reviews": 2,
          "Date": "2021-02-08T12:40:53.000Z",
          "Titre": "Really bad service",
          "Contenu": "Really bad service. I purchased an upgrade key from Win 10 Home to Win 10 Professional. The product key listed was not working. Messaged them on the support chat. They told me to use the key in the emails. This is a different key to the key provided on the website, but not made clear. I explained to the agent that this wasn't clear, that it was a different product key, he kept arguing with me saying that the instructions on the website are clear. IT DOES NOT SAY TO FOLLOW SEPERATE INSTRUCTIONS IN THE EMAIL where it lists the product key for the upgrade. Moving on, I follow the instructions, and it fails, says exception error could not activate. Mesaged them again and 'Tom' who is the agent i spoke to before, told me 'customers are stupid because they don't read' - I know what Im doing when it comes to computers, but he was being really rude and condescending when what the instructions were telling me to do were not working. He also told me not to restart my computer, then told me I need to restart my computer for it to work. It then said that the license is not valid, and so had to do the process all over again. It worked the second time. But 'Tom' was adamant that I was not doing it right. I told him I am going to make a complaint about him, and he begged me not to after he realised he was in the wrong when i sent him screenshots. Boy this guy needs to get fired."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Stuart Moodey",
          "Nb_Reviews": 5,
          "Date": "2020-02-03T06:58:45.000Z",
          "Titre": "No consumer rights",
          "Contenu": "No consumer rights. Do not use. Very poor customer service! STAY AWAY!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Clarence Ford",
          "Nb_Reviews": 1,
          "Date": "2019-09-01T18:06:32.000Z",
          "Titre": "Already sent it in email if they get it…",
          "Contenu": "Already sent it in email if they get it and do something with it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Quinton Hobbs",
          "Nb_Reviews": 2,
          "Date": "2020-06-03T11:58:54.000Z",
          "Titre": "My Microsoft windows key did not work"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Brian Cho",
          "Nb_Reviews": 1,
          "Date": "2019-10-30T18:48:38.000Z",
          "Titre": "MS Office 2019 not working after 4 weeks",
          "Contenu": "I purchased Office 2019 Home & Student 2019 on Sept 26, 2019.I started get alert that I only have few days left on the license and need to activate.  I re-entered the product key provided from unitysoft and the message still appears.  I contacted the unitysoft and received an e-mail that I should contact softwaregeeks.  I purchased the product from unitysoft, not softwaregeeks (never even heard of softwaregeeks).  I replied to the email to unitysoft, and no response from unitysoft yet.After reading Rob's review, I am having the same issue but I purchased the product key from unitysoft, not softwaregeeks.  The email I received from the unitysoft is exactly sames as the response they wrote on Rob's comment.Update: The company contacted me again, after I wrote the review.  They wanted me to send the screenshot of the error and I sent them right away (also they said they would \"appreciate correction of the review made once resolved\").  Now it has been 4 days and no response from the company. Here is the correction of the review.  The license may work for some people but it didn't work for me.  Based on my experience with this purchase, I would have been better off buying the license from more reputable company considering my license got suspended after four weeks.  I should have read the description more carefully and realized that this company is sketchy.  It indicates that the license is for lifetime but the company only gives 1 year warranty on the license key.  In my case, license only lasted 4 weeks, without proper tech support from the company.Update:  They sent another email and said they never received my screenshot, only after I updated the review.  I checked my sent emails and I sent them on Oct 24 and another email to verify if they received my screenshot on Oct 25, to the email address they provided.  I sent another email on Oct 29, to the same e-mail address as below for the third time and no response from their support team again.  I am frustrated with their support team that I ended up buying another license from MS.  I won't be emailing them again nor update this post any further."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "J.",
          "Nb_Reviews": 9,
          "Date": "2023-06-30T12:26:08.000Z",
          "Titre": "Staff member Tom is extremely rude.",
          "Contenu": "Windows license key validity has gone down hill, we’ve purchased quite a few over the years but more recently we’ve had duds.To make things worse though, staff member Tom is extremely rude and has zero professionalism about him. If you were to read the chat logs you’d be surprised the guy even has a job in customer service."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Paul Bloor",
          "Nb_Reviews": 27,
          "Date": "2022-12-01T18:57:14.000Z",
          "Titre": "Had problems with install",
          "Contenu": "Had problems with install, emailed and was told it wasn't your problem."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "David Williams",
          "Nb_Reviews": 10,
          "Date": "2022-11-03T14:57:35.000Z",
          "Titre": "Too complicated to download"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Luke",
          "Nb_Reviews": 1,
          "Date": "2020-06-02T17:12:03.000Z",
          "Titre": "Not good",
          "Contenu": "Not goodGot sent 2 pdfs and had to find a new usb key myself. Product functions at least."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Phil Sadler",
          "Nb_Reviews": 2,
          "Date": "2020-09-02T20:50:06.000Z",
          "Titre": "I purchased a number of keys but they…",
          "Contenu": "I purchased a number of keys but they stopped working and had to purchase more."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Somerville",
          "Nb_Reviews": 1,
          "Date": "2019-09-14T04:36:55.000Z",
          "Titre": "Poor Cust Service & Software Does Not Work",
          "Contenu": "Windows 7 Pro Software will not upgrade install on to Vista. I have emailed several times fully explaining the issue and Cust. Supp. (CS) takes a long time to reply and their reply is asking questions that I answered with info provided previously in that same email. They don’t read your emails!! I provided my laptop specs three emails prior and finally they made a statement that Win 7 Pro cannot upgrade Vista Home. I have asked for Win 7 Home replacement for Win 7 Pro, but no response. It appears they will only respond to these reviews and not to a CS email asking for help. NOTE; CS is NOT 24/7 as advertised on Web site. They respond when they get around to it. Let’s see if this review helps!!Update: Writing a bad review worked!! If you cannot get a response I suggest you do the same. Within an hour I received a response, however, the response was an obvious issue that should have pointed out after my 1st email request for support. I did what they said and still had the same issue. I emailed back again explaining the issue and again giving details of the problem, and TWO DAYS later they responded with OH this is a \"COMMON\" issue with Windows Update/Install. Common Issue?? WHY could you not tell me that in the beginning and save me a huge headache!and complete waste of my time!! I got tired of waiting for their response, so I ended up performing a clean install of Win7 Home Premium, losing all of my installed Software and settings. I have spent several days reinstalling software and re-configuring most of my settings.I changed my rating to 2 stars only because the software did install correctly and the License Key was Genuine per Microsoft. If any other info. comes up I will update again."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Anon",
          "Nb_Reviews": 3,
          "Date": "2023-02-07T20:23:00.000Z",
          "Titre": "Licence OK but creating account difficult",
          "Contenu": "Bought a Windows 10 Pro licence.  The price was right and it is all working OK.  It was very difficult to get an account created though which is why I am only giving 4 stars."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Paul Kenny",
          "Nb_Reviews": 13,
          "Date": "2022-10-31T13:52:38.000Z",
          "Titre": "The price was good and the download…",
          "Contenu": "The price was good and the download fine. the problem is that the program won't load I get an error code which I e-mailed to The Unity soft the code but got no reply."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "David Menelaus",
          "Nb_Reviews": 10,
          "Date": "2021-11-02T19:19:19.000Z",
          "Titre": "good and not so good",
          "Contenu": "good computer but arrived with un activated version of win 10  needed urgently so had to purchase on line for £20.not good"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Keith Murray",
          "Nb_Reviews": 3,
          "Date": "2021-09-05T10:56:30.000Z",
          "Titre": "This isn't a home pro license",
          "Contenu": "This isn't a home pro license, is a workstation one instead. It miight've been described as that but I never noticed and that's on me.There's also a bit of what I feel is fairly dodgy steps to actually getting it to work, worried I'll end up having it revoked or worse. Here's hoping it'll be OK."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Jonathan Turnock",
          "Nb_Reviews": 1,
          "Date": "2019-11-13T22:49:53.000Z",
          "Titre": "Provided with a used key!!",
          "Contenu": "Purchased Windows Pro Key and not able to activate because the key has already been used!!Contacted support via message and emailed but no reply.Update: Received reply from support in response to the review, provided with a replacement working key.2 Day turn around for issue is ok and I would consider this good customer service. I have used Software Geeks 2-3 times with no issues. However service should not be in response to a Review it should be in response to a service request in a tracking system with an expected response time."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Jonathan Sparrow",
          "Nb_Reviews": 1,
          "Date": "2019-07-06T22:06:08.000Z",
          "Titre": "You sent a corrupt file",
          "Contenu": "corrupt file original direction from trying to follow instructions After 5 email they eventually sent a file that worked, so I have altered my review.  I am still disappointed as their response is as if every consumer has a IT degree, they seemed to make out it was something I was doing"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Steve Clark",
          "Nb_Reviews": 1,
          "Date": "2020-10-01T13:15:51.000Z",
          "Titre": "Original key was not valid",
          "Contenu": "Original key was not valid, e-mail response very very slow but had to do an onlilne chat to resolve the issue. Was issued a new key immediately and worked fine. 3 stars because of e-mail response but 5 stars for online chat!!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JA",
          "Nb_Reviews": 2,
          "Date": "2019-09-17T00:41:47.000Z",
          "Titre": "\"May Damage Your Computer\" - UPDATE",
          "Contenu": "Just purchased and attempted to download. After over an hour, I received a message from MicroSoft \"This type of file may damage your computer.\"UPDATE: I did receive an email from the company indicating the following: \"This is a normal message when you download from an external link. We can assure you all files are tested and harmless, as a VAT registered company we only sell legal and genuine stuff with Tested downloads.\"I believe that customers need to know to expect this message, as well as how to maneuver through it. It took another hour to upload and this time, the 4th attempt, it did work.Now hoping it will not corrupt my computer."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Wayne Stinton",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T17:53:16.000Z",
          "Titre": "I bought a copy of Microsoft Office…",
          "Contenu": "I bought a copy of Microsoft Office from this company at a good price. I had some trouble installing it but their Support department were excellent and guided me through the process"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T19:38:20.000Z",
          "Titre": "Nice Price - Good Support",
          "Contenu": "Windows Licence purchased for nice price.I had a problem with it not activating.Mark and his team were very responsive to support and resolved the problem within a few emails back and forth."
        },
        {
          "Note": 4,
          "Lieu": "IE",
          "Pseudo": "George",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T17:41:17.000Z",
          "Titre": "Prices and availability are good.",
          "Contenu": "Prices and availability are good.. But this issue where licenses do not work after a year is a little frustrating."
        },
        {
          "Note": 4,
          "Lieu": "NO",
          "Pseudo": "Martin Syversen",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T05:08:10.000Z",
          "Titre": "Excellent customer support!!!",
          "Contenu": "Update: Excellent customer support!!! Reach out to TheUnitysoft if you have difficulties activating or other !! ... Background: Failed to get my key to work, when upgrading through activation from Enterprise (and before that LTSC). The customer service department reached out upon reading review, with no previous communication on my part, and wanted to assist me in activation. I had in the meantime bought directly from MS. Customer service then provided me with a key to another MS product as substituion, even if they didn't really need to. Since i didn't upgrade entirely according to key description, going from enterprise to pro, rather from home to pro. Really a above and beyound experience."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "George",
          "Nb_Reviews": 10,
          "Date": "2022-12-22T18:12:01.000Z",
          "Titre": "Good customer support and working product (after a few attempts)",
          "Contenu": "Originally, several product keys did not work. Customer service team and 2nd line support was great, though, and helped resolve the issue to my satisfaction after a while.One star minus for the slight delay and hassle, but as the product eventually worked fine and customer service was great, I'd recommend them."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Simon",
          "Nb_Reviews": 1,
          "Date": "2022-12-30T17:41:34.000Z",
          "Titre": "Purchased a Windows 11 home to pro…",
          "Contenu": "Purchased a Windows 11 home to pro upgrade. Clear instructions on how to carry this out. Had a problem with the licence key but their technical support engineer Mark Smith was excellent and it was sorted out very promptly."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Fabien A",
          "Nb_Reviews": 5,
          "Date": "2022-10-25T21:48:47.000Z",
          "Titre": "Quality of service",
          "Contenu": "I needed help with a product code that Microsoft kept saying was invalid - generally the codes work (although I have only used this company twice before). The team was able to help within two days.  The service is reliable, and I would definitely make more, future purchases from this company."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Derek Shanks",
          "Nb_Reviews": 2,
          "Date": "2022-07-01T15:58:54.000Z",
          "Titre": "Speedy service and response to query",
          "Contenu": "Speedy service and response to query. Very patient and stuck with me until they resolved an issue I was having - my fault."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Geoff",
          "Nb_Reviews": 1,
          "Date": "2021-12-01T00:19:48.000Z",
          "Titre": "Good troubleshooting team",
          "Contenu": "EDIT: Originally received an in use product key that wouldn't activate, messaged customer service with proof and within 30 minutes had a new key in working order, initially skeptical but very satisfied with the result."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Simon Brookes",
          "Nb_Reviews": 12,
          "Date": "2022-03-01T07:03:23.000Z",
          "Titre": "Easy Purchase not the cheapest",
          "Contenu": "Easy Purchase not the cheapest but with an account the quickest."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Poppo",
          "Nb_Reviews": 1,
          "Date": "2022-02-14T21:39:12.000Z",
          "Titre": "Always the best in indoor air quality!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mark",
          "Nb_Reviews": 11,
          "Date": "2023-03-29T23:54:46.000Z",
          "Titre": "Good prompt service"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Bryce Brogan",
          "Nb_Reviews": 4,
          "Date": "2020-12-07T18:33:54.000Z",
          "Titre": "Needs New Product Key for Reinstall.  One-year guarantee.",
          "Contenu": "Bought Office 2019 Pro.  Got key.  Installed OK with key.  Then had to reinstall windows 10 six months later.  Reinstalled  Office 2019 Pro.  This time, got error: Product Key locked.  Invalid product key.  Contacted UnitySoft support and they issued me a replacement key as part of their one-year guarantee against having to reinstall."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Chris",
          "Nb_Reviews": 2,
          "Date": "2020-06-22T15:36:26.000Z",
          "Titre": "Win10 Pro license had problems",
          "Contenu": "I was installing a Win10 Pro license on a brand new MacBook Pro at the time of writing (22/06/20). The instructions given weren't working. Their support was very helpful and even transferred my problem to a higher up who emailed me an hour or two later.I managed to sort my problem before receiving this email, but I would recommend them based on my experience with their support."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Steve Turner",
          "Nb_Reviews": 1,
          "Date": "2019-12-08T09:44:40.000Z",
          "Titre": "Great price and worked fine",
          "Contenu": "Great price and worked fine.  The previous reviews were they responded and helped people with problems gave me the confidence to use the service but.....it was frustrating that the website never explains how the process works and not one of the screenshots/instructions matched the screens I was presented with.  It's a process not for the tech naive. Windows 10 pro bought"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "AJ",
          "Nb_Reviews": 7,
          "Date": "2019-07-31T02:00:48.000Z",
          "Titre": "I had a difficult time downloading the…",
          "Contenu": "I had a difficult time downloading the actual install files which based on the link supplied with the email didn't work over multiple computers and different browsers. However the support staff were very good and suggested multiple options before supplying me with an alternative download which worked first time.If I have need of this type of service again i will be using them again."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Arthur",
          "Nb_Reviews": 1,
          "Date": "2019-07-29T21:03:20.000Z",
          "Titre": "Just bought windows 7",
          "Contenu": "Just bought windows 7. Says corrupted file. The link does not work anymore to try again. Microsoft does not recognise the product key either it says to contact the merchant... and i need my computer today.ArthurThank you for fixing the problem promptly. It now works as expected.Arthur"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "GrahamG",
          "Nb_Reviews": 1,
          "Date": "2020-01-06T19:53:27.000Z",
          "Titre": "Win 7 Pro key, OK for me.",
          "Contenu": "Toshiba laptop HDD went down completely, I reinstalled using an official Win 7 Pro installation ISO and tried to activate it using the original key label on the machine but MS did not accept it because that particular key had been licensed to Toshiba. With end of support for Win7 only days away I could not justify £50 or more for a full install package of Win 7 Pro, so I took a chance with a Win 7 Pro key from TheUnitySoft - key was provided instantly upon payment and was accepted as valid by MS. So far so good, if I have any problems further downstream I will report back."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "David Hinds",
          "Nb_Reviews": 6,
          "Date": "2019-12-18T18:58:53.000Z",
          "Titre": "Great Customer Support",
          "Contenu": "Being a little incompetent when it comes to computers I did at first struggle with the instructions but the customer support was fantastic, guiding me through. I now have a working installation of Microsoft Office at a great price."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mehregan Bagherpour",
          "Nb_Reviews": 1,
          "Date": "2020-01-01T23:09:27.000Z",
          "Titre": "Slight room for improvement",
          "Contenu": "Initially got the email and and started to download, afterwards I found that I needed a DVD writer, etc.... a simple scan of people's hardware would simply eliminate headaches for the users. Otherwise, a great service."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Steveb90125",
          "Nb_Reviews": 3,
          "Date": "2019-10-29T16:22:22.000Z",
          "Titre": "Had some issues activating Office Home…",
          "Contenu": "Had some issues activating Office Home & Student 2016 over the internet but after emailing support they provided an alternative suggestion to activate by phone which although a bit tedious worked just fine. Very happy."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Tim",
          "Nb_Reviews": 5,
          "Date": "2020-09-10T13:31:25.000Z",
          "Titre": "Happy to recommend",
          "Contenu": "I have purchased only two keys from TheUnitySoft. There was an issue with the second key but it was very quickly rectified to my satisfaction. I was impressed with the speed of support.Happy to recommend them."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Stuart Kennedy",
          "Nb_Reviews": 30,
          "Date": "2021-09-07T17:18:26.000Z",
          "Titre": "Issue Quickly Resolved",
          "Contenu": "I had an issue with the Activation Key.After a full diagnosis I was given a thorough explanation with links by Mark Smith which quickly resolved my issue.Thanks Mark."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Angela Fletcher",
          "Nb_Reviews": 1,
          "Date": "2020-08-20T11:32:42.000Z",
          "Titre": "A bit fiddly to install but it works!",
          "Contenu": "Bought the Windows 10 pro.  Took a bit of fiddling about but it now works a treat.  Very good price.  Read the instructions.  And restart computer after installing lol."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Dunia Ali",
          "Nb_Reviews": 9,
          "Date": "2021-07-15T08:49:44.000Z",
          "Titre": "Product key worked fine and Windows 10…",
          "Contenu": "Product key worked fine and Windows 10 Pro is active and running! I would recommend this product from The unitysoft.Reason for deducting 1 star: They do have reasonable response time for customer service, but since my issues was a little more unique I would have liked it if they knew how to help me, rather than me figuring it out in the end- though they did point me to the right direction by asking to restart PC. Just in case anyone else is using Windows on Mac, this is how to solve it:Since I am running Windows with another splitting program on my MAC (Parallels), you need to specifically restart Windows within Parallels, and not restart the MAC device. I tried restarting my MAC many times (as the instructions state restart your PC) but it didn’t change anything, but after figuring out that specifically Windows needed to start within the splitting program, that’s when it finally worked. Thank you for your help and for saving me money!"
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Trevor",
          "Nb_Reviews": 2,
          "Date": "2020-11-16T13:26:28.000Z",
          "Titre": "Unrivalled service",
          "Contenu": "Unrivalled service, I have bought multple licences without issue, until today one stopped working, contacted support and they fixed it within 15 mins."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Elinore",
          "Nb_Reviews": 3,
          "Date": "2020-06-01T19:12:53.000Z",
          "Titre": "Even though I did not benefit fully…",
          "Contenu": "Even though I did not benefit fully from your software I know I will use you again. I’m sorry for my not being able to use it like it was intended."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Rusty",
          "Nb_Reviews": 2,
          "Date": "2021-09-02T21:57:30.000Z",
          "Titre": "theunitysoft repeat customer",
          "Contenu": "I have used theunitysoft many times. Their customer support is very good and helpful. Products are great! Will use again."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Samantha Honey-Maree Wilson",
          "Nb_Reviews": 2,
          "Date": "2019-07-27T06:48:48.000Z",
          "Titre": "Great help",
          "Contenu": "There were a few hicups. However it was dealt with and the people helped me figure out the problem. Everything works like it should"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "GLW",
          "Nb_Reviews": 1,
          "Date": "2021-09-04T06:50:53.000Z",
          "Titre": "I think the install instructions for…",
          "Contenu": "I think the install instructions for upgrading Windows 10 Home to Pro may need a tweak but perfect otherwise."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Henry",
          "Nb_Reviews": 6,
          "Date": "2019-07-23T04:47:38.000Z",
          "Titre": "The purchase didn't work for me and the…",
          "Contenu": "The purchase didn't work for me and the company understood and refunded the purchase price quickly."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "avalanchefan",
          "Nb_Reviews": 8,
          "Date": "2019-10-02T17:41:38.000Z",
          "Titre": "Delivered material rapidly",
          "Contenu": "Delivered material rapidly. Had some trouble in the download but figured it out on my own."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Bao",
          "Nb_Reviews": 11,
          "Date": "2021-04-02T20:21:50.000Z",
          "Titre": "Great",
          "Contenu": "Great! but you may need to be a little bit of techies to benefit."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "John Gilmour",
          "Nb_Reviews": 7,
          "Date": "2021-01-27T16:41:09.000Z",
          "Titre": "Small glitch dealt with promptly",
          "Contenu": "Small glitch dealt with promptly and effectively by support."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Barb MacNaughton",
          "Nb_Reviews": 1,
          "Date": "2019-07-11T12:39:42.000Z",
          "Titre": "The product didn’t work but the…",
          "Contenu": "The product didn’t work but the customer service was good"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Louis Bourque",
          "Nb_Reviews": 1,
          "Date": "2019-09-01T17:51:15.000Z",
          "Titre": "procedure to download a little obscure",
          "Contenu": "procedure to download a little obscure, but got it OK."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Paul Wilkinson",
          "Nb_Reviews": 2,
          "Date": "2019-08-03T00:27:25.000Z",
          "Titre": "The install information layout was not…",
          "Contenu": "The install information layout was not logical"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Roland",
          "Nb_Reviews": 6,
          "Date": "2019-09-24T22:06:32.000Z",
          "Titre": "Great customer service"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Chris Groome",
          "Nb_Reviews": 2,
          "Date": "2020-01-01T19:25:37.000Z",
          "Titre": "All seems to work"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Simon Brookes",
          "Nb_Reviews": 12,
          "Date": "2020-03-03T06:33:18.000Z",
          "Titre": "Prompt service."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "PCH",
          "Nb_Reviews": 6,
          "Date": "2021-05-01T05:05:48.000Z",
          "Titre": "Good service"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "PCH",
          "Nb_Reviews": 6,
          "Date": "2019-12-19T08:53:42.000Z",
          "Titre": "Good service"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Charlie Nicol",
          "Nb_Reviews": 17,
          "Date": "2023-12-18T23:51:29.000Z",
          "Titre": "Outstanding Service - Highly Recommend",
          "Contenu": "I contacted the company as the Windows key I had bought did not work. They responded within 10 minutes and agreed to send another. This happened twice more, within half an hour, before I realised I had a hardware problem. They agreed to reimburse me and within minutes had provided email proof that they had done so. The best service I've ever had from any company. Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Bailey Machen",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T20:43:54.000Z",
          "Titre": "Amazing customer service",
          "Contenu": "Amazing customer service answered very quick and gave me a refund as my code wasn’t working due to my pc being dodgy"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "MarkV",
          "Nb_Reviews": 11,
          "Date": "2023-11-02T18:47:09.000Z",
          "Titre": "Office 2021 Pro (PC) works on Mac under Parallels/Win 11",
          "Contenu": "Just purchased a licence for Office 2021 Pro (PC version) to attempt to install on my Mac under Parallels/Win 11.I wasn't holding my breath as I feared it wouldn't run under Windows for ARM.But it did!! Smooth install. I did deliberately do a 'Repair', which refreshes Office from an MS download, to make sure I was getting the ARM version.No problems with the licence key supplied by Theunitysoft (remember to paste only the first 25 characters).I can now use MS Access on my Mac. Fantastic!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "JA",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T14:43:52.000Z",
          "Titre": "Great company!",
          "Contenu": "We upgraded a PC that we built ourselves, changing the hard drive and motherboard - then upgraded from Windows 10 to 11.  However, no matter what we tried, we couldn't get Windows 11 to activate.  Hours and hours later, we came across Theunitysoft.  With a budget friendly price, we received the Windows key immediately, and had our PC activated with no trouble whatsoever!A big thanks from us - and would highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "willb",
          "Nb_Reviews": 2,
          "Date": "2023-06-21T13:41:03.000Z",
          "Titre": "Purchased Win11 Pro to run on Parallels…",
          "Contenu": "Purchased Win11 Pro to run on Parallels on Mac. Initial key didn't work, contacted support and all sorted in about 2 minutes. I've used them many times before and always happy with the end result. Almost went with an (even) cheaper site I didn't know, glad I didn't! Excellent service and great value."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "LAURENCE BARRON",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T10:18:09.000Z",
          "Titre": "PROBLEM WITH SUPPLIED WINDOWS 10 LICENSE KEY",
          "Contenu": "HAD PROBLEM WITH SUPPLIED WINDOWS 10 PRO LICENSE KEY NOT BEING RECOGNISED!SENT EMAIL ON A SUNDAY TO SUPPORT & RECEIVED NEW WORKING LICENCE KEY WITHIN 1 HR. VERY HAPPY WITH THE SERVICE & SUPPORT FROM THEUNITYSOFT COMPANY. i WILL DEFINATELY USE THEM AGAIN & RECOMMEND TO FRIENDS & FAMILY."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Tim",
          "Nb_Reviews": 6,
          "Date": "2023-06-26T10:48:35.000Z",
          "Titre": "Product Key issue",
          "Contenu": "Product Key issueI recently had to restore my operating system and when trying to reinstall Office '19, MS were telling me the product key I used was no longer valid! I tried everything I could to resolve this, ending with a support ticket to TUS. They were fast, polite and though they didn't have to do anything they sorted my issue almost immediately."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Bob Hammersley",
          "Nb_Reviews": 1,
          "Date": "2023-05-27T17:19:10.000Z",
          "Titre": "Top quality product and service",
          "Contenu": "Have used UnitySoft for a number of years now - product has always been excellent. On the odd couple of occasions  I have had an issue their support has resolved the problem very quickly - responding to emails within minutes.  Good prices, good product good support - can't really ask for more than that."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Rebecca Jackson",
          "Nb_Reviews": 2,
          "Date": "2023-04-28T18:23:36.000Z",
          "Titre": "Great service for first time buyer.",
          "Contenu": "Great service. First time using this company, selected them based off the reviews. I bought a product key and ran in to trouble activating it, even with the guidance instructions that are sent with the key. I emailed the support team who got back to me within minutes. After explaining everything I tried and providing an order number they quickly sent a replacement code which worked straight away. They were quick and efficient. I will definitely recommend this company to my friends and anyone reading this review."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Pablo Casais Solano",
          "Nb_Reviews": 4,
          "Date": "2023-08-27T18:05:28.000Z",
          "Titre": "Just bought a Windows 11 Pro license…",
          "Contenu": "Just bought a Windows 11 Pro license and the whole experience was very easy. Got my PC running in no time and the only doubt I had was answered really quick by their support team. Really great guys, will continue buying from them in the future!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Rog Burton",
          "Nb_Reviews": 13,
          "Date": "2023-07-13T18:15:03.000Z",
          "Titre": "Great software and support from Unitysoft",
          "Contenu": "Timely and accurate instructions with support, when needed. Mark was brilliant at putting me right, after my first effort of loading up win 10 pro. Great software and support from professional people."
        },
        {
          "Note": 5,
          "Lieu": "LU",
          "Pseudo": "Akob Vardanyan",
          "Nb_Reviews": 2,
          "Date": "2023-06-28T16:28:22.000Z",
          "Titre": "Top customer support",
          "Contenu": "I have used the service twice, in 2021 and 2023. No issues the first time, had a problem activating the key the second time. However, customer support replied to me within an hour or two after I emailed them and immediately solved the issue. Best experience I’ve ever had with any customer support team."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Tom",
          "Nb_Reviews": 2,
          "Date": "2023-07-17T17:31:53.000Z",
          "Titre": "Have been using this company for the…",
          "Contenu": "Have been using this company for the last few years always had really good service from them, and you cant beat the price!Any issues we have had have been resolved that day of early the following morning.If we have had any problems with installing the products we have received very quick help and the problem has been resolved.Would recommend to anyone"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "B Odedra",
          "Nb_Reviews": 5,
          "Date": "2022-10-10T20:57:41.000Z",
          "Titre": "Absolutely without any reservation a…",
          "Contenu": "Absolutely without any reservation a fantastic company to buy software from at great priceBought office 21 pro single of license but original laptop was stolen. Asked if I could transfer key to the new laptop using the online question option. Product was in warranty so a new activation key was given to me. No fuss and excellent response times. Less than 2 hours I had it installed and activated.Have also bought windows 10 and other products and have had no issues with either."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "An Invester",
          "Nb_Reviews": 4,
          "Date": "2023-06-16T09:03:56.000Z",
          "Titre": "Having purchased Windows 11 Software in…",
          "Contenu": "Having purchased Windows 11 Software in error, I contacted the company. My incorrect purchase has been refunded in full. The Windows 10 software, (the intended purchase) was downloaded, and works well.I fully endorse the companies policy, and for GBP £17.99 it is extremely good value.Thanks too to Mark and Tom for their efficiency and Customer Service."
        },
        {
          "Note": 5,
          "Lieu": "HR",
          "Pseudo": "Mate Banovac",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T17:22:59.000Z",
          "Titre": "Legit, fast, good",
          "Contenu": "Very good customer support experience. Cheers and thanks to agent called Nick, who patiently guided me to solution for a problem that i had. This is 8th software i bought from this site, and i can confirm that everything works just fine since day one."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr & Mrs Shamir Easeph",
          "Nb_Reviews": 4,
          "Date": "2022-10-27T17:11:36.000Z",
          "Titre": "Fabulous Service!",
          "Contenu": "Fabulous Service!We had issues upgrading the Windows Home version into Pro and were struggling passing the phase with unique Product Key. I was lucky to have 'Tom' who helped us patiently and efficiently, guided us to the step we were missing out and helped us in sorting the issues within no time. Appreciate it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Sutton",
          "Nb_Reviews": 3,
          "Date": "2022-08-19T01:44:53.000Z",
          "Titre": "Quick fix for an unusal activation problem",
          "Contenu": "I had an unusal activation problem with an Unitysoft product that I bought, downloaded and installed months ago. Then, out of the blue MS said the product was not activated. Unitysoft's excellent support staff exercised great patience and worked along with me to quickly resolve the prolem. Up and working fine."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "G.........P",
          "Nb_Reviews": 15,
          "Date": "2023-10-04T14:24:11.000Z",
          "Titre": "Great service",
          "Contenu": "Great service, Key was sent by email just a few moments after payment with detailed instructions on how to use the product.I would highly recommend using Rufus to create the Bootable USB Installation drive (Stick) to bypass the Microsoft (Create Account) and Security Questions."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T20:06:01.000Z",
          "Titre": "I made a mistake and ordered Windows 11…",
          "Contenu": "I made a mistake and ordered Windows 11 Home instead of Professional. Support from Mark was very quick (minutes) and efficient in sorting out my error. I would highly recommend anyone use them for your software requirements."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Alun Webb",
          "Nb_Reviews": 2,
          "Date": "2023-05-11T23:27:01.000Z",
          "Titre": "Have used them on a number of occasions…",
          "Contenu": "Have used them on a number of occasions to purchase various pro versions of Windows, as well as several copies of Office.  Most recently a  purchase of Windows 11 Pro.  An issue with the install was quickly resolved, everything working as it should be."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Nicholas",
          "Nb_Reviews": 2,
          "Date": "2023-02-21T00:23:18.000Z",
          "Titre": "Instant Email Back of Windows 11 Key for Parallels on Mac",
          "Contenu": "Excellent service. Just installed parallels on my M1 Mac Book Air and the version of windows it installs asks for a product key to activate it. It try's to steer you to the Windows site and pay £219 for an activation key for Windows 11 Pro. Just purchased it from Unity for £19.99. Got an instant email back with the key and simply pasted it into product key part in setting and Voila! Simple as that, Windows 11 Pro is activated."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2023-04-30T16:02:38.000Z",
          "Titre": "10/10",
          "Contenu": "had a problem with a windows 10 key,got in contact with support via email,Mark quickly and professionally sorted the problem.everything sorted in less than 24hr over a weekend dont get that very often 10/10"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Sam joseph",
          "Nb_Reviews": 3,
          "Date": "2022-10-07T19:14:11.000Z",
          "Titre": "Genuine products and genuine company",
          "Contenu": "This is the second time I’ve used this company and both times I’ve had no issues. The products purchased does exactly what it says lifetime purchase and no subscription. Tom was amazing with me the second time and talked me through the right package for me and even helped me with my technical illiteracy which was appreciated. Would definitely recommend to anyone who is thinking of buying from them."
        },
        {
          "Note": 5,
          "Lieu": "LV",
          "Pseudo": "Mjagii",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T19:21:05.000Z",
          "Titre": "Great customer support",
          "Contenu": "I bought a copy of Windows 10 Professional, and at first the key didn't work. However, after one day I was provided with a replacement key that worked perfectly. Also purchased Microsoft Office, which worked flawlessly."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "LEWIS",
          "Nb_Reviews": 13,
          "Date": "2022-12-19T18:08:12.000Z",
          "Titre": "Always good and reliable",
          "Contenu": "I have purchased a number of keys from UnitySoft over the years. Until my latest, purchase I've never had any issues at all. Although I had a small issue this time, it was resolved by their support pretty much instantly. Would highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "BG",
          "Pseudo": "Mariyan Budinov",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T07:03:49.000Z",
          "Titre": "Great service",
          "Contenu": "I've received the email instantly. Information was completely enough for me to download and install the software."
        },
        {
          "Note": 5,
          "Lieu": "TH",
          "Pseudo": "Evans",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T18:37:08.000Z",
          "Titre": "Bought microsoft office 2016 recently…",
          "Contenu": "Bought microsoft office 2016 recently from the Unity Soft. They responded very quickly and was very helpful with all my queries regarding instalment problems. I am a happy customer."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Dan Wearden",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T17:09:56.000Z",
          "Titre": "Excellent Service",
          "Contenu": "The code arrived immeditately with detailed instructions and for a good price. It didn't work at first but when I contacted the company Tom straight away provided a new working one. He was excellent."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ben West",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T15:40:52.000Z",
          "Titre": "Windows 11 Pro for a new PC…",
          "Contenu": "Purchased windows 11 Pro for a new PC install. The first key didn't seem to work so I emailed support and they got back to me within about 2 minutes with a replacement. Excellent customer service!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "JamesB",
          "Nb_Reviews": 6,
          "Date": "2022-07-05T18:29:24.000Z",
          "Titre": "Excellent Service - Use them!",
          "Contenu": "Excellent Service! Online purchase and email with Key came straight though. I didn't read the instructions and had a failure with activation. Emailed for help and got a very good, quick email back with instructions. It worked perfectly! Thank you for your patience and clear and precise instructions. Very happy to recommend The Unity Soft and will definitely be using them again. Thank you! :-))"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Andrew Wilson",
          "Nb_Reviews": 4,
          "Date": "2023-05-04T20:52:50.000Z",
          "Titre": "Great for windows licenses",
          "Contenu": "I've bought windows licenses from these guys for years, never an issue. Today, for the first time, my new key didn't work. A quick email to support and they gave me a replacement within 20m! Fantastic service, thanks to Mark S!"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Marcus S",
          "Nb_Reviews": 5,
          "Date": "2022-10-03T20:28:50.000Z",
          "Titre": "Great service and support",
          "Contenu": "Great service, quick to offer their support.  Purchased Office 2019, had a small issue with the serial number which was very quickly solved.  Up and running now and all verified and activated.  Also purchased Office for my daughter and her studies and had no issues. Highly recommend and will use again."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Martyn",
          "Nb_Reviews": 9,
          "Date": "2022-08-02T15:50:29.000Z",
          "Titre": "Superb service",
          "Contenu": "I have made several purchases over the last couple of years.  I had a slight installation problem with my recent purchase. I emphasis not the product but my Computer.  Went straight to their support e-mail and had a reply in minutes with a solution and relevant link.  Once done the upgrade went smoothly.  Will continue to use them"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Chris",
          "Nb_Reviews": 20,
          "Date": "2022-08-03T18:03:52.000Z",
          "Titre": "Excellent and immediate customer service",
          "Contenu": "As per previous reviewer. Purchased a license for Office 2016; code didn't work. I contacted them by Chat on their webpage, got immediate replacement/upgrade to Office 2019. Great service, great prices, used them for years with very few problems."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Joshua Kim",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T22:05:06.000Z",
          "Titre": "I purchased a Windows 11 Pro product key",
          "Contenu": "Purchased Windows 11 Pro product key and did not work. Contacted customer service and was given a second key that worked. Customer service agent Mark was extremely quick to respond. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2022-10-05T15:03:51.000Z",
          "Titre": "Excellent Service",
          "Contenu": "I have used this company a number of times to get licences for various Microsoft products without issue. For the first time I received a code that would not work however I received excellent service and received a new code within a few hours after contacting the after sales help team. High recommend!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Tony Jones",
          "Nb_Reviews": 1,
          "Date": "2022-07-04T22:28:56.000Z",
          "Titre": "I was having terrible trouble with my computer",
          "Contenu": "I was having terrible trouble with my computer. None of my Office 2013 programs would run. I decided that I should reinstall it entirely from my disk but it kept failing. I found UnitySoft on line. Iwas able to download and install a new version of my software with fantastic help from their support team. It was great value for money. I was really impressed. I recommend UnitySoft to you."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "info infinitydays",
          "Nb_Reviews": 2,
          "Date": "2023-08-30T01:04:34.000Z",
          "Titre": "I bought some MAC keys last week",
          "Contenu": "I bought some MAC keys last week for our office systems. Linked with my Microsoft account, downloaded, worked perfectly. Amazing."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Paul G",
          "Nb_Reviews": 1,
          "Date": "2022-10-06T13:50:40.000Z",
          "Titre": "Amazing service and great customer…",
          "Contenu": "Amazing service and great customer support.  I've been using them for years for all our company Windows 10 pro upgrades and Microsoft office licences.  Thank you guys, can't recommend them enough"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 8,
          "Date": "2023-03-30T11:47:41.000Z",
          "Titre": "Genuine Microsoft products at bargain prices.",
          "Contenu": "I have used this company for many years and have never experienced anything other than a positive buying experience. The website is very good and the products are easy to find. It goes without saying how competitive the prices are. The moment you complete a purchase,  you receive an email with the necessary installation code, how to download the product and installation instructions.  I cannot comment on their customer service, as I've never had to use it. All products have activated first time with no drama whatsoever. They are my goto company for Microsoft OS and Office."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Imogen Air",
          "Nb_Reviews": 8,
          "Date": "2023-01-05T13:08:43.000Z",
          "Titre": "Really helpful!",
          "Contenu": "Really helpful when i ran into a problem with an update when trying to upgrade to W11 PRO , all sorted within 24 hours. Have purchased twice with Unity Soft now, and will continue to in future."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jules",
          "Nb_Reviews": 7,
          "Date": "2023-03-31T20:13:24.000Z",
          "Titre": "Why wouldn't you...",
          "Contenu": "Straightforward, prompt and always works. I have used theunitysoft.com for over 5 years and have never had a problem. I use them for my business machines and client machines. I won't use anybody until I have used them myself. You can save a significant amount over Microsoft governed retail prices in the UK (ie Currys,  John Lewis et al). I have used them for Win10 Home to Pro upgrades and MS Office for Windows devices and occasionally on Apple devices as well. None of them has failed. Just so nobody thinks I am profiting from using theunitysoft.com, I charge my clients what I paid on their behalf and no more. I charge for my time and the cost of the parts ( at what I paid for them on my clients behalf)."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Michael McGrath",
          "Nb_Reviews": 4,
          "Date": "2022-07-16T06:38:46.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service. I was a bit hesitant to buy from them because their prices are so much lower than everywhere else I was unsure if it was a scam.  But I received my product key immediately after purchase and it activated with no problems."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ian ellis",
          "Nb_Reviews": 3,
          "Date": "2022-11-07T10:29:11.000Z",
          "Titre": "Outstanding Service",
          "Contenu": "Had a problem with a product key that just stopped working. reported it on a Sunday fully expecting to go through some protracted and lengthy toing and froing on the Monday and was over the mooon when I got a response within half an hour and a new product key.  Great service"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Terry Hutchison",
          "Nb_Reviews": 6,
          "Date": "2023-06-20T21:00:45.000Z",
          "Titre": "Quality Custer Service",
          "Contenu": "5 Star service.Download available immediately on purchase.Immediate attention also given to a small problem that I had which was again resolved immediately. Would not hesitate to buy from unitysoft again.Old fashioned customer service so rarely found these days."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Chris Daniel",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T13:03:05.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "I have made a few purchases over the years and they have been competitively priced and quick to deliver.  The customer service is excellent and have fixed any issues I have had such as reinstalling office after upgrading to Windows 11.  Thanks."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ian",
          "Nb_Reviews": 7,
          "Date": "2022-12-25T13:08:24.000Z",
          "Titre": "Great prices, awesome, very fast customer service",
          "Contenu": "I have used software geeks & TheUnitySoft many times over the years for friends, family, and my own pc/laptops. I have never had any problems. My daughter messed up her laptop requiring a full reset and reinstall, Win 10 worked fine, but office 2019 would not reinstall and kept stating the same error each try and wanting me to use Office 365. I upgraded to Win 11 pro, which worked fine, but same error message for Office, My copy was out of warranty, and I spent hours trying to resolve it. In the end, I sent the error details to the unity soft email. Within a very short time, I had a response from Mark @theunitysoft detailing the action required to reinstall the software without the error. I followed the process provided and I was up and running office within the next 30 minutes. I needed to use the telephone activation service now everything is working in time for Christmas. Thank Mark & the Unity soft team for their awesome OOW support."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Bob Watson",
          "Nb_Reviews": 12,
          "Date": "2022-10-02T17:56:20.000Z",
          "Titre": "I build computers as a hobby and for…",
          "Contenu": "I build computers as a hobby and for myself.  I always use Theunitysoft for my software as they are 100% reliable and the download of the valid serial number is within minutes.  I can't ask for anything better and throughly recommend them."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Robert Hutchinson",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T14:41:44.000Z",
          "Titre": "Windows 10 pro activation success",
          "Contenu": "Bought windows 10 activation key for £20, and tbh I thought it might have been a scam as it was very cheap. However Trustpilot reviews were okay so I thought I'd give it a go.worked 100%, I now have a fully active win 10 pro license. very happy"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "cherperler",
          "Nb_Reviews": 19,
          "Date": "2022-11-15T00:42:31.000Z",
          "Titre": "I can only say positive words for this…",
          "Contenu": "I can only say positive words for this company. Very professional,  helpful,  especially as I needed a reminder for my office pro. Product key after I changed the hard drive to my laptop. And I have no hesitation in recommending this company to everyone."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Adam B",
          "Nb_Reviews": 2,
          "Date": "2023-05-04T15:37:23.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service. When I did need to contact support (which has only been necessary once), I received a swift response and resolution. I could not have asked for more."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ethan Davies",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T17:55:57.000Z",
          "Titre": "Great service!",
          "Contenu": "Had an issue with updating from windows home to windows pro. Customer service was quick and effective. Trust these guys, they're good! Shout out to Mark Smith!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "T khan",
          "Nb_Reviews": 1,
          "Date": "2023-07-01T15:11:33.000Z",
          "Titre": "Ordered it received windows 10 pro key…",
          "Contenu": "Ordered it received windows 10 pro key instantly worked without any problems highly recommend for people not trying to spend 200 pounds on a windows key."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Customer",
          "Nb_Reviews": 6,
          "Date": "2023-02-16T18:29:35.000Z",
          "Titre": "Windows professional 11",
          "Contenu": "Bought windows professional 11 and tried following the steps in the document. The steps in the first document are not update to the latest, thus had some difficulty. Contacted company on e-mail and received response within 24hrs. Got the installation working and windows didn't complain about the license once I connected to net and run updates."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Alastair McDonald",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T19:36:40.000Z",
          "Titre": "2 working keys",
          "Contenu": "Bought 2 licence keys, one didnt work so i emailed support, within 10 minutes or so they fixed my problem and all working. Would definitely use again"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "AJ",
          "Nb_Reviews": 3,
          "Date": "2023-06-24T10:04:18.000Z",
          "Titre": "Great service and pricing",
          "Contenu": "Great service and pricing.. I bought Win 10 Pro to upgrade from Windows 7 Home and the support team helped me throughout the installation and activation process.. Will highly recommend them!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Paul McLaughlin",
          "Nb_Reviews": 3,
          "Date": "2022-09-09T13:46:35.000Z",
          "Titre": "If only I could give 10 Stars!",
          "Contenu": "Our experience with unitysoft was excellent in every possible way.  From purchasing the software on their website, from receiving the keys to download, and from installing through to using, everything was done with perfect supervision. The whole experience could not have been choreographed any better. For us, it is unitysoft every time!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Paul Graham",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T16:23:52.000Z",
          "Titre": "Great company to work with",
          "Contenu": "I use Theunitysoft on a regular basis and i must say their customer service is second to none. I cant fault them in any way. They are so fast at getting back to you with anything. I would highly recommend this company to anyone"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cristina Cristabel Polizzi",
          "Nb_Reviews": 1,
          "Date": "2022-10-15T11:15:28.000Z",
          "Titre": "I had a minor issue and the support…",
          "Contenu": "I had a minor issue and the support team has helped me immensely solving my problem. Despite being late Friday they were on call and solved the issue explaining clearly what I needed to do. Star service"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jeremy Anderson",
          "Nb_Reviews": 4,
          "Date": "2022-10-02T08:07:47.000Z",
          "Titre": "I have purchased a number of licences…",
          "Contenu": "I have purchased a number of licences from this company over the years. You may find cheaper but for peace of mind that the license is genuine and if there is a problem, the matter will be resolved quickly."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "PJ B",
          "Nb_Reviews": 6,
          "Date": "2022-09-15T15:44:09.000Z",
          "Titre": "Brilliant customer service and great products!",
          "Contenu": "I have contacted this company many times because I'm not great with computers and they have been super fast with their response and always very helpful and patient. Would recommend to anyone. Brilliant customer service and trustworthy products!"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Umberto",
          "Nb_Reviews": 1,
          "Date": "2023-01-09T10:27:37.000Z",
          "Titre": "Reliable,efficient and fast.",
          "Contenu": "They sell for moderate prices valuable software and I found them, during the past few years I've been a customer, to be very serious vendors ,very quick to reply and reliable. i'd recommend them,definetely!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Andrew",
          "Nb_Reviews": 3,
          "Date": "2023-06-26T23:30:47.000Z",
          "Titre": "Always a good experience",
          "Contenu": "Always a good experience. I've used the UnitySoft and previously Software Geeks. I've only had an issue once and customer support resolved that very quickly"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Pritesh Badiani",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T21:55:20.000Z",
          "Titre": "I found the process very easy and quick…",
          "Contenu": "I found the process very easy and quick from start to finish. When I rebuilt my pc I had issues finding the key and instructions. The support team responded very quick and solved the issue."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Richard",
          "Nb_Reviews": 21,
          "Date": "2023-11-03T13:32:54.000Z",
          "Titre": "Good price and good speed",
          "Contenu": "Bought an LTSC Office version and the confirmation email with the license was in my inbox before I finished swigging my coffee."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Philip Theaker",
          "Nb_Reviews": 2,
          "Date": "2023-05-01T19:57:49.000Z",
          "Titre": "Ordering worked without a hitch",
          "Contenu": "Ordering worked without a hitch!  I've always been a bit wary about buying software keys online, but NO PROBLEMS here!  Would use you shop again."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ian",
          "Nb_Reviews": 6,
          "Date": "2023-03-29T18:57:38.000Z",
          "Titre": "Great purchase. Following the detailed instructions the…",
          "Contenu": "Following the detailed instructions the windows upgrade from win 10 home to win 10 pro worked a treat. No problems yet and I don't expect any. Would recommend."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Smills",
          "Nb_Reviews": 1,
          "Date": "2022-10-18T16:07:08.000Z",
          "Titre": "Win 11 Pro upgrade",
          "Contenu": "Upgraded a Windows PC with the license purchased at unity soft. Wouldn't work initially, but hopped onto the online chat and the issue was resolved in minutes."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Tanya Gale",
          "Nb_Reviews": 2,
          "Date": "2023-03-03T15:55:50.000Z",
          "Titre": "Great Service",
          "Contenu": "I bought two older Office 2019 keys (We're used to that version!). It wouldn't install in W11. Couple of emails later, all working fine. An hour from 'buy it now' to all working on two PCs, fantastic service!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "G Summers",
          "Nb_Reviews": 32,
          "Date": "2023-02-23T21:29:35.000Z",
          "Titre": "Great support.",
          "Contenu": "I had a problem with an installation on a new PC and wasn't sure if it was due to software or hardware. theunitysoft came back the solution within minutes. Great support."
        },
        {
          "Note": 5,
          "Lieu": "MY",
          "Pseudo": "Just William",
          "Nb_Reviews": 4,
          "Date": "2023-01-13T13:28:04.000Z",
          "Titre": "Top deals and a top service",
          "Contenu": "I have been using Unitysoft for the past few years now.  When I build pc's for friends or I buy a new pc with a pesky copy of Windows Home edition.  Only ever had one issue that was resolved within 24 hours.   They keys ive purchased havent had any problems even after 3-4 years.  This is my go to company for MS licenses."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "AwittITQ",
          "Nb_Reviews": 2,
          "Date": "2022-11-03T00:48:02.000Z",
          "Titre": "Very efficient support and service",
          "Contenu": "The price is good, support and service very helpful and efficient. Have made quite a few purchases from this company and very satisfied. Wish they would sell more good software.Look forward to purchase more."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "John Finney",
          "Nb_Reviews": 2,
          "Date": "2023-04-01T11:38:14.000Z",
          "Titre": "Instructions didn't work",
          "Contenu": "Instructions didn't work. Ended up paying for the upgrade at £120. Complete waste of £20 from theunitysoft.com so harsh lesson learnt."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "WASW",
          "Nb_Reviews": 8,
          "Date": "2023-02-09T21:49:57.000Z",
          "Titre": "MS Office Professional Plus 2021 price and support",
          "Contenu": "Bought MS Office Professional Plus 2021 - perpetual license at an excellent price and had a couple of installation queries due to my lack of knowledge which was done via email.  Received replies and support within a day or on the same day - so the rating reflects the price of the product and the excellent support they provide"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Keith Peterpan Bramley",
          "Nb_Reviews": 10,
          "Date": "2022-10-08T20:46:54.000Z",
          "Titre": "Never had any issues with any keys…",
          "Contenu": "Never had any issues with any keys purchased from unitysoft.  always excellent service and very helpful. The only place I buy keys from now after many years in the computer trade."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ann",
          "Nb_Reviews": 2,
          "Date": "2023-10-02T04:20:09.000Z",
          "Titre": "I always have the best service from…",
          "Contenu": "I always have the best service from your company. Your reps are friendly, and knowledgeable. I like your chat feature and they always get back to me the next day. Thank you so much!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Dennis Robinson",
          "Nb_Reviews": 4,
          "Date": "2023-01-09T16:18:54.000Z",
          "Titre": "Really good value products",
          "Contenu": "Really good value products. Not being technically minded it took a bit of sorting out but the help was there when needed and the issue was eventually sorted out."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2022-12-21T13:01:03.000Z",
          "Titre": "Great Value and Great Service",
          "Contenu": "Our company has been purchasing licences from unitysoft for many years. Quick and simple service and quick responses from support if required"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Robinette",
          "Nb_Reviews": 1,
          "Date": "2022-10-07T01:47:19.000Z",
          "Titre": "UnitySoft has the best prices around",
          "Contenu": "UnitySoft has the best prices around. I purchased Win 11 pro for my desktop. Followed instructions to completion with no problem. Purchased Win 10 pro for my laptop on a Friday. However, the key was missing on the email. I replied to it and received the key on Sunday. I upgraded from 8.1 to 10 pro with no problem. Back in 2020 I purchased Office 2019 from UnitySoft and I was able to port it to my new desktop with no problem. Very satisfied."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "josh henneberry",
          "Nb_Reviews": 2,
          "Date": "2023-05-27T05:13:52.000Z",
          "Titre": "had a dummy issue i caused myself",
          "Contenu": "had a dummy issue i caused myself. by installing windows 10 home instead of pro. (this is at 12am my time) sent an email off to their support team, and had answer and solution within 5 mins!! very happy with the support team and product. would buy again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ive Fatovic",
          "Nb_Reviews": 2,
          "Date": "2022-10-05T14:46:38.000Z",
          "Titre": "One of the best sites to buy keys",
          "Contenu": "I have done a lot of orders from this site and I have encountered only one faulty key. I have sent the mail to support and in a less than 20 minutes resolved all problems with their support. I will resume to buy from this site as long they are at this supreme quality."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Customer",
          "Nb_Reviews": 26,
          "Date": "2023-05-23T15:52:10.000Z",
          "Titre": "I have used theunitysoft for quite a…",
          "Contenu": "I have used theunitysoft for quite a few years, they are competive on price and if ever you have any problems they respond very quickly with the solution, highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Steph G",
          "Nb_Reviews": 3,
          "Date": "2022-08-01T08:05:43.000Z",
          "Titre": "Absolutely marvellous",
          "Contenu": "Absolutely marvellous! Needed toget my PC up and running quickly and Unity soft delivered. Quick and reasonable, can't ask for more."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "ACS",
          "Nb_Reviews": 56,
          "Date": "2022-08-03T14:56:40.000Z",
          "Titre": "Office 2016 MacBook Product Key Issue Resolved",
          "Contenu": "I bought a copy of Office 2016 for my MacBook but the product key would not register. I used the chat facility and Tom sorted this issue out for me and Office is now installed.Great service, great price!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arthur",
          "Nb_Reviews": 4,
          "Date": "2022-11-03T16:41:36.000Z",
          "Titre": "Excellent Customer Service",
          "Contenu": "I have used Unitysoft for several years. Each time I have used there software the customer service was excellent when it was needed.Great company to do business with!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Stephen Knox",
          "Nb_Reviews": 7,
          "Date": "2022-10-06T14:50:41.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "Bought a Windows 11 product key from Theunitysoft. I had an issue activating it and they got back to me within minutes with a solution. Excellent customer service."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Chris Hall",
          "Nb_Reviews": 1,
          "Date": "2022-09-28T20:03:05.000Z",
          "Titre": "Due to my own ignorance …",
          "Contenu": "Due to my own ignorance I ordered incorrectly. I was immediately refunded. Thank you so much for your help and making the process easy for a technically challenged person. Me!! I would definitely recommend."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Gary H",
          "Nb_Reviews": 3,
          "Date": "2022-09-28T08:40:53.000Z",
          "Titre": "Great price and brilliant customer…",
          "Contenu": "Great price and brilliant customer service helped resolve an issue I had that was mostly down to me not reading what I was sent.Highly recommend"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Sharon",
          "Nb_Reviews": 2,
          "Date": "2022-08-23T18:47:50.000Z",
          "Titre": "Very Happy Customer!",
          "Contenu": "Activation situation.Theunitysoft sorted it immediately! and followed up with Me to make sure all was rectified and runningsmoothly.Great Service Great Product! Sharon :)"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "hitendra patel",
          "Nb_Reviews": 1,
          "Date": "2022-11-02T19:23:45.000Z",
          "Titre": "Awesome Purchase",
          "Contenu": "The process was very easy and had used them for Windows OS in the past and just like the office purchase everything went well. Followed the instructions and all set up."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Barry Taylor",
          "Nb_Reviews": 2,
          "Date": "2022-10-27T18:57:20.000Z",
          "Titre": "Excellent Customer Service",
          "Contenu": "I had some questions that were immediately resolved in a chat with Tom.From ordering Microsoft Office 2021 to its prompt online delivery through to Tom's advice a very good experience. Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr Kelvin Perry",
          "Nb_Reviews": 9,
          "Date": "2023-01-02T19:04:31.000Z",
          "Titre": "Very competitive price",
          "Contenu": "Very competitive priceProduct as describedDownload and product Key available as soon as payment madeInstalled without issues"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Cliff Thomas",
          "Nb_Reviews": 14,
          "Date": "2022-12-08T17:42:52.000Z",
          "Titre": "Excellent and timely support",
          "Contenu": "Bought a product and had a problem installing. Theunitysoft sorted the issue quickly and satisfactorily. Very pleased. Would highly recommend this company."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Anthony Lewis",
          "Nb_Reviews": 2,
          "Date": "2022-12-06T18:51:19.000Z",
          "Titre": "Awesome Support",
          "Contenu": "Had a problem Activating my software - pinged an email - Mark came back in minutes and helped me resolve the problemThese guys are good !"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Daria Gortchacow",
          "Nb_Reviews": 1,
          "Date": "2022-10-22T11:51:01.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience. I needed to install something urgently. I had some issues during the installation and their response by mail was fast. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "CS",
          "Nb_Reviews": 14,
          "Date": "2023-03-03T10:40:23.000Z",
          "Titre": "Readily available and at a fair price.",
          "Contenu": "Readily available and at a fair price.I was looking for Win10 that was easily available and at a fair price. It was easily searchable, and the process of paying etc. was straightforward."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Daniel Ekema",
          "Nb_Reviews": 2,
          "Date": "2023-05-02T21:55:40.000Z",
          "Titre": "Great service",
          "Contenu": "Had an initial issue with a windows software license but this was very quickly resolved by the support team."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Trevor Corbitt",
          "Nb_Reviews": 2,
          "Date": "2022-08-12T16:07:14.000Z",
          "Titre": "When I made mistake",
          "Contenu": "When I made mistake and bought the Windows version of what I wanted rather than the Apple version. They were very helpful and gave me a full refund without any hassle."
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Henrik Ingmar Paetau",
          "Nb_Reviews": 5,
          "Date": "2023-09-01T16:05:11.000Z",
          "Titre": "You delivered what you promised without…",
          "Contenu": "You delivered what you promised without forcing unnecessary \"side dishes\" to extra costs for the customer - and your solution worked!"
        }
      ]
    }
  ]
}