{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "totalav.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Zedar Thom",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T05:45:37.000Z",
          "Titre": "I don't trust TotalAV if we are talking about anti virus.",
          "Contenu": "It presents more as a bait then a reputable software and despite not clicking the Submit button as I had changed my trust value at that point, the download brought in a pesky popup that continues to spew out false 'detected trojan..', 'your computer is being hacked..' etc etc continuously disturbing your online work with their popups. I am not the only one having this problem with this unauthorized and hidden install by TotalRV, google 'how to remove pesky totalav popup' and you will find many such complains. I wouldn't trust TotalAV."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Rio Noronha",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T19:13:23.000Z",
          "Titre": "Read the reviews before you purchase VPN service",
          "Contenu": "Looking at the reviews and the pricing i switched from current VPN service provide to TotalAV Its been almost 3 weeks and i am not able to use the VPN I contacted the customer service and they are still looking into the issue and i am waiting for them to get back with a solution The very first step to connet  to the VPN is not working and i have done all the troubleshooting steps they have asked me to follow and still it does not work Sadly i am going to discontinue with them after this review as I ran out of pateince of waiting on them its almost a month now . Sad ."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "ItsJonte ItsJonte",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T23:52:47.000Z",
          "Titre": "Shady Advertizments",
          "Contenu": "TotalAV uses VERY shady tatics to get you to install stuff, such as the classic \"Click confirm to verify your not a bot\" for the notifications. your notifications are then spammed with stuff like \"Your computer/phone has been hacked! Click here to stop spying!\" and then it shows a McAfee \"virus\" scan that says you have like 4+ viruses. then it redirects you to download totalav."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Pat",
          "Nb_Reviews": 6,
          "Date": "2023-12-21T19:56:53.000Z",
          "Titre": "Not possible to contact the support…",
          "Contenu": "Not possible to contact the support team, offered permanent protection for £1.99 then charged me £9.95 and can't get a refund. Scam!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Roseanne James",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T01:45:44.000Z",
          "Titre": "I don't even have an accout yet they took £367 out of my bank account!",
          "Contenu": "I don't even have an account with TOTAL AV yet somehow they have managed to take £367 out of my account without me knowing! This went out in two separate sums and do you think i can find a way to contact them?! I found one telephone number and it didn't work. i did a transaction search and they couldn't find an account. i sent an email and was redirected back to pages i'd gone through before and failed to get a result. i eventually found a page where i could send a ticket but how long is that going to take? This is happening a week before Xmas when i REALLY need that money for Family and Grandchildren! And WHY are there no telephone numbers to ring? It's impossible to get hold of these people and to talk to an actual human being who will look into the issue for you! They obviously don't  want the hassle of having to bother with people and their problems otherwise they would make it easier to get hold of them. I will NEVER use this company for my virus software!  I think they're far too devious to trust."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Michael Harridge",
          "Nb_Reviews": 14,
          "Date": "2023-12-19T22:10:34.000Z",
          "Titre": "Total waste of money",
          "Contenu": "AwfulNever seems to work, have to keep re-enabling everything each time I turn a computer on and lots of attempts to action are pop up with error messages.Waste of time and money"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "DesmondoP.",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T07:22:27.000Z",
          "Titre": "Better do not use them",
          "Contenu": "Better do not use them. I was billed as a re-occurring payment for second year of using their software. Their policy gives 30 days money back guarantee. As soon as I sent them all details  and requested refund all communication stopped, and here we are 30 day passed and no refund. really poor customer service....It is sad that this company need 1 star review to contact back customer, and than still will not acknowledge that they failed in a field of customer service as it took them more than 30 days to reply (amazingly money back guarantee period is 30 days)"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T14:39:38.000Z",
          "Titre": "Beware",
          "Contenu": "Beware - they billed me full price for renewal (debited bank account) without any communication - £149 - when I went to cancel future service they offered £ 35 for future renewals because 'they didn't want to lose my account' .......TOO LATE TotalAV ...........LATER : Total AV responded with a refund of £ 126.20 - I've no hassle with their product so everything back to normal."
        },
        {
          "Note": 1,
          "Pseudo": "M.Katsarov",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T19:01:14.000Z",
          "Titre": "these scammers stole 180 euros from me",
          "Contenu": "This company are absolute scammers. I added 1 license for 39 euros. I paid with PAYPAL, these fraudsters have added my address for automatic payment and withdrawn 180 euros. After that my card was blocked and they tried to take money 15 more times but because my card was blocked they didn't succeed. At the moment they are holding me 180 euros which I will probably never get. I urge you not to fall for their fraudulent scheme. They explain that they will protect my computer, but they took the money from me in the most impudent way and will not return it to me. Absolute scammers run away from such companies."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sheila Bragg",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T15:48:43.000Z",
          "Titre": "Don't...just don't.",
          "Contenu": "I purchased this software in February.  I HATED it. It took control of my computers. I cancelled. Went through a 30 minute \"hard sell\" and \"guilt trip\" on cancelling but they \"supposedly\" cancelled. I got a hit on my card today (wasn't even supposed to renew in November), thankfully, it declined.  I've been chatting with another associate for 30 minutes for the same hard sell/guilt trip to close the account.  Whatever you do, do NOT buy this software. Closing your account is a nightmare."
        },
        {
          "Note": 1,
          "Lieu": "ZA",
          "Pseudo": "LE Kitshoff",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T06:36:52.000Z",
          "Titre": "I paid for three subscriptions but…",
          "Contenu": "I paid for three subscriptions but cannot utilize the purchase."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "H Williamson",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T14:04:06.000Z",
          "Titre": "AVOID! Charged three times and customer…",
          "Contenu": "AVOID! Charged three times and customer service is terrible. AVOID. Nightmare. I cannot get a real person or email about cancelling. Already wrote a review and still have not had the refund and cancellation."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hubaldo Alonso",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T23:08:05.000Z",
          "Titre": "I will give my honest review after 4…",
          "Contenu": "I will give my honest review after 4 months, first time trying it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard Davis",
          "Nb_Reviews": 4,
          "Date": "2023-12-11T20:16:13.000Z",
          "Titre": "Beware",
          "Contenu": "I installed this anti-virus program because the rating was good. The customer service appalling. All devices we have this program on are slower and have even more malware or unwanted ads than before. When reviewing my bank statements, I found numerous charges (at different time and amounts) all from this company. After taking days to finally getting in touch with an actual human, instead of trying to help resolve the issues surrounding their software's inability to protect from malware, they just offered a refund of the overcharges.  When I asked them how about resolving the malware issues your software didn't catch, the service rep hung up on me. Further the software places adds promoting different modules you can buy to further protect your computers for additional charges. These all seem mostly related to internet browser security and email protection and are seen everytime you open an internet browser. Very disappointed."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "olwyn sandham",
          "Nb_Reviews": 6,
          "Date": "2023-12-03T17:20:31.000Z",
          "Titre": "Totalav provides an extremely poor…",
          "Contenu": "Totalav provides an extremely poor service. I could not easily contact customer service and when I finally did manage it was only a \"live chat\" where the operator kept me waiting ages between responses. I could not access the app on my Firestick which is the main reason for me wanting a VPN. When I tried to cancel the subscription on the mobile app it would not let me, saying it was an active account so I could not cancel it (even though I am within the 14 day trial period!) I will let PayPal recover my money I think"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bo",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T13:20:26.000Z",
          "Titre": "Did its job too well, now I have corrupted files.",
          "Contenu": "It did its job in removing some threats alright, but it did it a little too well. I purchased this program not even 24 hrs ago and it already deleted some important windows 11 files and corrupted a bunch of other files on my computer. I am now on hour 4 with remote tech support trying to resolve the issue, and it looks like it's going to be even longer. It seems to have a large margin of error in discerning if a threat is actual or not. On the safer side it gets the less obvious security risks. On the downside you could lose hours of work time trying to resolve how to get important missing files back.Edit. Changed it to one star, because total av doesn't even have proper customer support to even discuss this matter as after 9 hours of trying to fix my computer. After going through different tech supports It went no where. Double Edit: you better hope you never have any issues. They won't do a damn thing for you. Even canceling and getting a refund was like pulling teeth.To anyone that reads this, just go with Norton."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Marko Newmanoid",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T12:32:12.000Z",
          "Titre": "Auto renewal Scam-Beware",
          "Contenu": "Avoid this company , they have a business model  of enticing customers with cheap offers and then increasing the charge yearly by 500%.There service is very poorly rated by proffesional people and thia can be verified by using google AVOID THIS COMPANY AT ALL COSTS  -I all so belive they are actively manipulating  trust pilot so it seems they have good reviews"
        },
        {
          "Note": 1,
          "Pseudo": "Suzanne Peoples",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T16:55:00.000Z",
          "Titre": "I had TotalAV installed on both my…",
          "Contenu": "I had TotalAV installed on both my desktop and laptop computers.I paid a monthly payment via my debit card/banking account.Several weeks ago I contacted TotalAV Support and cancelled my subscriptions for both computers.Customer Service confirmed my cancellations Yesterday I noticed on my bank statement that TotalAV has charged me again.Contacted their Support Service and apparently the issue has not been corrected and will be \"investigated\"by their billing department.I contacted my bank - the only way that I can prevent any further charges from TotalAV is to cancel my debit card(a \"stop payment\"is only for checking accounts!!)"
        },
        {
          "Note": 1,
          "Pseudo": "Matthew Byrd",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T04:54:39.000Z",
          "Titre": "TotalAV misses in the customer service department.",
          "Contenu": "I decided to try TotalAV on a whim and used the free version. However, I decided that I did not need the service, so I removed TotalAV from my device. I attempted to delete my free account but was unable to do so, and thus reached out to see if my account could be deleted. I sent multiple emails to multiple addresses and received the same generated response. I called the phone number and was merely directed to the website. Essentially, I was left without answers and couldn't access my free account without purchasing the paid version of TotalAV.I am frustrated with the lack of genuine communication. At the very least, TotalAV needs an actual person to respond to emails and/or phone calls. While its antivirus is well reviewed, I've found that TotalAV doesn't get the simple things right, namely customer service, which is concerning for interested buyers."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "James Towe",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T19:08:51.000Z",
          "Titre": "Scam company!!!!!!",
          "Contenu": "Absolute scam company that tried to take a payment of £1.99 from my card today without my knowledge. I cancelled my subscription a month or two ago after they didn't give me the service when I had paid for. I paid through my phone contract and never got an active subscription for that month. I logged into my account today to try and delete my card details and account. Nope. Can't do that they don't give you the option to remove the card and when I tried to delete the account it said it has an active subscription whilst displaying I should renew and wouldn't let me delete it. I want all my details removed before I seek legal action. You operate in the UK and we have strict GDPR laws (data handling laws). If you don't remove my details and card information within 48 hours I'll seek legal action."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Caroline Brooke",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T19:38:32.000Z",
          "Titre": "Beware of what you're getting into...",
          "Contenu": "Beware of what you're getting into with this company as it may be difficult to leave once you're signed up. I signed up to a trial free offer, and before I knew it, I was subscribed and committed to paying them every month. When I tried to close my account, I realised  they had made it as difficult as possible to find any inforamtion on their website explaining how to do it. I googled and searched for ages and found that lots of other people had the same experience. In the end, all I could do was email them. They then signed me up to OTHER offers which they said would be 'free'. They did not want to close my account and tried every trick in the book to stop me. I have never encountered such persistence, or sub obtuse behaviour. I do not like the way find these people do business and only hope that they have now closed my account. I really don't know!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "AC Smith",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T22:11:07.000Z",
          "Titre": "Useless Product",
          "Contenu": "Useless Product!  They are highly unresponsive.  Attempted to get technical assistance several times.  They do not have help links for Help Tickets or Chat on their support page or the product 'Dashboard'.  The product does not support all browsers.Had to contact a 3rd party just to get information on how to contact them.Unable to use Total Password with Firefox (my primary browser) and Total Password will not import the .csv file I exported from McAfee TrueKey.  I have over 200 accounts with various passwords that I am not going to pay McAfee to  continue to use.Avoid this company at all cost.  I lost $80 for product they would not refund."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "H Williamson",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T09:52:35.000Z",
          "Titre": "Absolutely terrible customer service…",
          "Contenu": "Absolutely terrible customer service and charged my card extra. I do not trust them at all anymore.I ordered one subscription and have been charges\\d two additional charges for 4 times the amount of the initial cost. I have been trying for weeks to get this sorted and cancel my subscription completely, including a full refund of all charges. My emails do not get returned, no customer service. The help centre and live chats do not work.Update:I was only ever sent on invoice for the original service and did not purchase any extras."
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Christoffer Krohn Birkild",
          "Nb_Reviews": 8,
          "Date": "2023-11-24T21:33:33.000Z",
          "Titre": "Absolute scam",
          "Contenu": "Absolute scam. Not only does their antivirus NOT work, but I've spent well over 30 minutes now trying to cancel it. You can't cancel your sub from their site, you have to contact the actual support to cancel your subscription, and they spent a SOLID 30 minutes trying to convince me to stay, I kept saying no, just cancel my subscription, yet they kept on pushing. If you're reading this, I'm the only REAL review here, every single other person is either a bot or is being paid to say good things. DO NOT take the risk. Look at my profile, I'm very clearly a real person unlike everyone else here. Don't fall for this dumb AV, it doesn't work and their support is scammy as hell."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Hastings lady",
          "Nb_Reviews": 6,
          "Date": "2023-12-01T12:11:48.000Z",
          "Titre": "DO NOT USE - future charges not notified",
          "Contenu": "As others have said - DO NOT USEDo not be lured in by the cheap introductory offer,  every year the annual costs goes up and you don't get any notification of the new charge, we only noticed last year as it was shown on a bank statement, I think it was about £80. This year we made a note of the renewal date and cancelled our subscription ahead of this. Despite doing this when we look at our account there is an invoice for the next year for - £149! No money has been taken this time as we cancelled the subscription. We tried to email them about this invoice, to ensure that the sub has been fully cancelled, but all you get in reply to emails is an automated response referring you the their help pages. I have now removed it from my PC ."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Joy Heathcock",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T20:02:35.000Z",
          "Titre": "accepted discount on Early renewal but not received",
          "Contenu": "accepted discount on Early renewal - acknowleged by TotalAV.However confirmation of renewal charged at full rate ie no discount appliedSent 3 e-mails all of which received automatic replies referring back to \"Help Centre\". However no contact point on Help Centre to query the overchargingOnly option to cancel my Account - but advised that this could not be effected until November 2024Not very customer friendly"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Trevor",
          "Nb_Reviews": 7,
          "Date": "2023-12-03T21:51:06.000Z",
          "Titre": "PRICE HIKE",
          "Contenu": "The annual renewal had a large increase and the first I knew about it was when Paypal notified me - too late to do anything about it. So I emailed them as follows,I was very surprised to get a notification from Paypal of my subscription to you at a vastly increased price of £149.00. You did not warn me in advance of this increased price so the payment went through before I could decide whether to continue or not.Last year [2022] you billed me £119.00 which I paid, despite the fact that in 2021 I only paid £35.64. Before this I had been on a monthly subscription of £3.59 per month.This jump from £119 to £149 in one year is completely unacceptable.Please tell me how you are prepared to resolve this.Thank youAll I got was an auto reply. Nobody had read it. Customer care non existent."
        },
        {
          "Note": 1,
          "Pseudo": "Gloria Crotty",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T22:05:30.000Z",
          "Titre": "Warning-avoid this company!",
          "Contenu": "Warning-avoid this company.  I believe their practices are fraudulent.  They took $119.00 out of my account without any warning or my consent.  I canceled my subscription, but then they offered to reduce the subscription fee 50%, I declined.  Then they offered to reduce it to $29/year.  I declined.  But I have not been able to get them to respond when I asked for my money back."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Karin Hickman",
          "Nb_Reviews": 10,
          "Date": "2023-12-02T00:35:56.000Z",
          "Titre": "Terrible experience! I fell for the hype when comparing options",
          "Contenu": "This company has no customer service to speak of. Questions about billing received no response, either via their own website nor via PayPal.It claims to provide a money back guarantee but makes it impossible to access this.  I purchased the software for a total of $101 on 25 November, so cancelled well within the 2-week period.It has not been possible to speak with anyone from the company either via chat or phone. If you click on Contact, you are taken to standard click-through issues.I have gone back to Trend Micro who provide phone numbers and real support.Since my post, Total AV sent a response that does not address the issue:  They advertise MONEY BACK GUARANTEE, but so far have not given back the money nor have they responded to my complaint via PayPal.  Also when trying to cancel the subscription on PayPal, it was possible only for 1 of the 3 items for which I was charged.I have uninstalled their software several days ago."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Sandra Graham",
          "Nb_Reviews": 3,
          "Date": "2023-11-28T03:32:33.000Z",
          "Titre": "TOTAL dissatisfaction",
          "Contenu": "The website is terrible, and I am computer savvy.Not once was my password accepted. I continually requested to change my password, but never successful apart from the FIRST USE of that password.The Help facility is hopeless, one is sent an automated email with a link to change your password…! same story on and on. They recommend the “Support Centre” you are referred simply a list of options. In desperation I searched thecontact phone number, to find it is actually the contact number for a CLEANING business, so it seems that they don’t even monitor their own website. After more than 2 days of trying to solve the problem I have given up…and Uninstalled TotalAv. Don't be lured by the cheap cost which skyrockets anyway upon renewal I paid $97 for a product ruined by its poor & unprofessional interface and NO COMMUNICATION."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cornelius McNally",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T01:24:13.000Z",
          "Titre": "please let me cancel my subscription",
          "Contenu": "please let me cancel my subscription. I am not able to afford. Looks like I'm heading into bankruptcy. Try to cancel following instructions on your site. Attempts have failed. What do I need to do to cancel?"
        },
        {
          "Note": 1,
          "Lieu": "AE",
          "Pseudo": "Rima F Elmasri",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T20:51:35.000Z",
          "Titre": "Still i didn't try,this is the first…",
          "Contenu": "Still i didn't try,this is the first day,and they said everything is covered $19 then they offered the other services by additional money"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Sally",
          "Nb_Reviews": 2,
          "Date": "2023-11-25T16:07:27.000Z",
          "Titre": "No customer service.",
          "Contenu": "I wish to cancel my subscription and stop pending payment but impossible to e mail or phone anyone. I have cancelled for next year, which I think I actually did for this year. I am not impressed. No response I will take this to consumer watchdog."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Richard Paterson",
          "Nb_Reviews": 10,
          "Date": "2023-11-13T18:30:41.000Z",
          "Titre": "Scam practices",
          "Contenu": "On its website this company gives the impression that it treats customers fairly but this is a false impression. When trying to get a refund it sends users into a circular series of pages without ever being able to register the claim. Refund seemed easy to claim when it took money from my bank without permission, but......"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Trevor Hamilton",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T18:17:27.000Z",
          "Titre": "Tech Support was unhelpful and Cancelling was difficult",
          "Contenu": "TotalAV revved my CPU in excess of 30% regularly and it would stay there until I did an \"end task\".  I contacted their tech support 4 different times (I was too generous with my time), and they were not able to solve the problem.I contacted their team to cancel my account and they wasted more of my time and as of this time, they still haven't removed my credit card from my account with them."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Peter T",
          "Nb_Reviews": 7,
          "Date": "2023-12-01T20:00:16.000Z",
          "Titre": "AVOID - Check your bank accounts",
          "Contenu": "I canceled this yet they have still gone and taken the payment. I thought it was cheap and cheerful but it conflicts with to many things and if you use it on your phone it kills your battery.Contacting them is anything but easy and I would not reccomend"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Dennis Lacey",
          "Nb_Reviews": 14,
          "Date": "2023-11-15T15:17:54.000Z",
          "Titre": "Total AV nuisance!",
          "Contenu": "What do I have to do to stop Total AV sending me renewal requests? Having posted a review in respect of this on 6th November, to which they replied that my account had now been closed and details deleted, they have again today sent me a subscription renewal. Warning. If you sign up with Total AV, it would appear you will never get rid of them!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Barbara Furby",
          "Nb_Reviews": 12,
          "Date": "2023-11-23T19:38:36.000Z",
          "Titre": "CANCELLING MY SUBSCRIPTION",
          "Contenu": "I wish to cancel the subscription after 24 hours  and obtain a refund as I have been told that my internet provider gives a free subscription to Norton.  I was sent an automated note to advise me that a code has been sent to my email address.  No code has been received."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Gurjit",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T16:21:28.000Z",
          "Titre": "Says its a Award Winning  Antivirus Provider - not sure how??????",
          "Contenu": "Would not recommend their Virus protection at all.  Their Tech support is only provided via online chat you cannot call them.  The advisors online are like robots do not listen to your issues just provide the same answer over and over again. Have not resolved my issue on redownloading the virus protection so cancelling my subscription even though its valid for another six months.  But cannot deal with a company who do not listen to the issue and who you cannot talk to a person who understands what you are saying."
        },
        {
          "Note": 1,
          "Pseudo": "Doug Forbes",
          "Nb_Reviews": 5,
          "Date": "2023-11-17T19:31:50.000Z",
          "Titre": "A fraudulent company who took a payment…",
          "Contenu": "A fraudulent company who took a payment from my PayPal account and then tried to refuse a full refund. After insisting they eventually promised to refund, but I am in doubt as to whether they actually will do so. They have no contact details on their website and I had to Google then call the US to get my refund... hopefully. Please do not give any details to them"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mr Andrew Cooper",
          "Nb_Reviews": 32,
          "Date": "2023-11-09T00:27:24.000Z",
          "Titre": "Total AV Review",
          "Contenu": "I checked out total av antifirus and all the trustpilot reviews wrote great reviews on Total AV. However, the one gripe I have with Total AV is there's no free version or 30 day free trial options for customers wishing to install onto their computers..to see if it is good enough for them. not everyone can afford to buy antivirus software on their 1st go when they are on a flat rate income...I think they should have a free or free trial version for customers who with to try it before buying."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Reiko A.",
          "Nb_Reviews": 2,
          "Date": "2023-11-14T18:00:04.000Z",
          "Titre": "Unreliable App and the worst customer support",
          "Contenu": "Where do I start? AppLock works only sporadically but does not work most of the time, so I want a refund. However, the company made it impossible to reach anyone. Chat support asks for a chat access code, which I never received. The phone number listed on the Terms of Service & EULA is not operational. The email address on the TotalAV website responds with an automatic message saying to visit the Help Center. The website prompted me to rate TotalAV, so I gave it one star. Then, the website prompted me to provide feedback, so I asked for a refund. I still haven't heard back. This is one of the worst companies I dealt with. It's questionable how this company and TotalAV get such excellent reviews."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "William",
          "Nb_Reviews": 4,
          "Date": "2023-11-14T17:40:02.000Z",
          "Titre": "I read your advertisement which said…",
          "Contenu": "I read your advertisement which said Totalav was free I then discovered when I was billed £9.95 for a monthly subscription that it wasn't I tried to cance my subscription but kept getting put to another page getting nowhere. I would not recommend this company to anyone I have been scammed"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Ann Reith",
          "Nb_Reviews": 24,
          "Date": "2023-11-24T00:20:22.000Z",
          "Titre": "Terrible company to deal with",
          "Contenu": "Terrible company to deal with. I thought I had signed up for an introductory £1.99 but ended up paying 2x£39. £78 in total. Their site is a nightmare to navigate and although I tried to get help by emailing them was asked to go to help centre which again I found difficult to use. I have just spent ages trying to get this refunded but only to be informed no way. I have not used the sites apart from TRYING to use them. I feel that they have got my money under false pretences as surely the original offer should run out BEFORE they sign you up permanently. Although I’m quite elderly I can usually sign up to new stuff without hassle. By way after being informed a refund was NOT going to happen I was shut down!!"
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "Sophie Gotch",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T22:21:10.000Z",
          "Titre": "I would give it zero star if it was…",
          "Contenu": "I would give it zero star if it was possible, my bank card has been canceled due to many attempts of charging while I’m trying to cancel, they make it important in the most disrespectful way! I’m over 1:20 on a chat with “an agent” called Aaron Sanchez who won’t let me cancel it!! Takes around 15/25 minutes to answer you back with statements like “how come you wish to cancel with us??” Honestly, an appalling experience, would say go to any other company, but avoid these scammers at any cost!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bruce",
          "Nb_Reviews": 10,
          "Date": "2023-11-20T13:46:16.000Z",
          "Titre": "I switched Virus Protection to Avast then Total AV",
          "Contenu": "I switched Virus Protection to Avast and they installed  P C App Store which now has a virus - McFee Advert - etc. can not be uninstalled (nwjs). Purchased Total AV Total Security (includes popup blocker). McFee still popping up - showed they made it inactive. Can not contact Total AV. No email, phone number, or chat is available. Appears Total AV is a Total Joke.    Update--------------Got a reply from Total (Still Joke) apparently they didn't read what I wrote. It was one specific item giving me a problem P C App Store installed by Avast. That particular version of that program can not be uninstalled and is located and run from a user folder of Windows. The message from Total was install our software from a clean operating system install or it may not work. Sure --- I will dump and reinstall all 66 installed programs after I reinstall the OS and 3.7Tb of data and hope your program might then pick up things in the future. NOT. Windows Security finally found the problem and took care of it. Thanks Bill."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Debi Kinch",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T14:51:29.000Z",
          "Titre": "Bought spam to my devices",
          "Contenu": "I used Total AV as thought I might need some protection. Totally awful experience. I went from having no spam emails each day to loads of spam coming through. I paid one price then loads of other charges were taken. I cancelled my renewal then they said I could have it for 70 % off. Now after stopping it my spam has reduced greatly even after a few days I do not get half as much and dwindling down daily. Also it kept turning off so you had to keep turning it on it was terrible. Definately not worth spending your hard earned money on"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JKW",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T03:39:36.000Z",
          "Titre": "BLOCKS EVERYTHING",
          "Contenu": "It blocks EVERYTHING, including from respected and safe sites. My ability to do my job was cut in half since installation. Tech support has NO idea waht they are doing and just read form a script. Buyer beware."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Jack",
          "Nb_Reviews": 2,
          "Date": "2023-11-12T04:14:52.000Z",
          "Titre": "Beware they are worse than spammers they are supposed to protect you from.",
          "Contenu": "As with most over reviews they go out of there way to make it impossible to cancel account, any attempt to cancel is met with on selling of products. Live chat is just bots which on-sell then hang up on you. Talking to them on phone is no better. I am still waiting for comfirmation my account has been cancelled. Links to cancel on web site don't work. They are worse than the spammers they are supposed to protect you from. Application never worked on my WIN10 PC and android app was a power drain."
        },
        {
          "Note": 1,
          "Lieu": "BE",
          "Pseudo": "Jean-François Cuylits",
          "Nb_Reviews": 7,
          "Date": "2023-11-19T19:12:15.000Z",
          "Titre": "Customer support is ZERO",
          "Contenu": "Maybe the product is good but the service is ZERO.I got a double billing (119 € on the 18/10/2023 and then 128 € on the 18/11/2023).There is noway to reach the customer support to solve the issue. No email address and when you want to access the chatbot it asks you a code that you cannot find anywhere.The only way I found is to cancel my subscription, and in fact I don't know if they won't continue to bill me ...A nightmare.Product never found a virus on my Mac and my iPhone, so I don't know if it is efficient."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jon Eno",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T02:32:43.000Z",
          "Titre": "Beware of TotalAV billing practices and advertising woes.",
          "Contenu": "I have gone around with TAV last year. They gave me access for $19. I never use Auto Renew. I did not see  anything in the dashboard about autorenew. Well guess what? PayPal had them setup for autorenew. I got billed $159 for software I haven't used in months. I got another product as I continued to get a viruses and the relentless advertising drives you nuts. PayPal was indifferent to my complaint about the $159. I have reached out to TAV half a dozen times, they send me an autoresponse form letter, no answers. The website says 100% money back guarantee but no luck here. Be aware of TAVs billing practices. If I ever hear back from them I will post there response here. Don't hold your breath its been 2 weeks now.Update: It's been over 2wks and no refund. What can I say, people."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mr. Ivan Febbrari",
          "Nb_Reviews": 2,
          "Date": "2023-11-09T16:39:25.000Z",
          "Titre": "automatic renewal without notice",
          "Contenu": "The renewal is automatic and nobody tells you your subscription is going to renew in a few days. That means I got charged £119 for what I didn't want to buy. Very sneaky!! Moreover, I replied to the emails I received last year from Dean and Lewis begging me to renew my subscription and an automatic replied come back telling me to use the \"help centre\". They are not reachable anymore. Have they both left? The automatic email does not say anything about wrong/nonexistent email."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Duncan Head",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T22:11:15.000Z",
          "Titre": "Fake advertising",
          "Contenu": "Fake advertising, I've seen this add. for several months now. Misleading pressuring time limited hype.Illegal."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Donald Gunn",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T18:51:23.000Z",
          "Titre": "i dont understand your pricing",
          "Contenu": "i dont understand your pricing, it shows $100 off for full pkg yet it is asking if i want each additional protection at an added discounted rate. no thank you, if that is the offer please delete. i will de activate the account if so."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tim Hughes",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T11:31:28.000Z",
          "Titre": "Unethical subscription pricing practices",
          "Contenu": "These clowns get you on subscription then charge whatever they want when it renews annually.  If you are not paying attention, you well get screwed!  I paid $29 annually the first year, then it jumped up to $79 the next.  I fought that and it went down to $39 the following year and they just tried to hit my card for $119!  Fortunately my card refused the charge as fraudulent or I may not have caught it.  Their pricing jumps all over the board once they have you on subscription without ANY notice of an increase in rate before charging you or renewing.  DO NOT DO BUSINESS WITH THESE UNETHICAL CLOWNS!!!!!I have searched my email & spam folders.  I NEVER received any email notification telling me the renewal was imminent & the tate would be different.  Stop the lies."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Paul Burlem",
          "Nb_Reviews": 5,
          "Date": "2023-10-14T14:38:31.000Z",
          "Titre": "SCAMMED BY THE PEOPLE MEANT TO PROTECT",
          "Contenu": "Surely the whole point of an Internet Security company is to protect its users.Totalav seems to have a new twist on this. Even though it states it is protecting from outside entities, it is in fact the one that is acting dishonestly towards it's own customers.They keep debiting my bank account for £149.00, with no authorisation whatsoever.Be incredibly careful!! Don't even take advantage of their free period. THEY WILL TAKE YOUR MONEY, REPEATEDLY!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "ikkles",
          "Nb_Reviews": 2,
          "Date": "2023-11-26T10:47:03.000Z",
          "Titre": "AVOID AUTO RENEWAL",
          "Contenu": "After the 1st year they tried to auto renew for £119. . This was my mistake not cancellling auto renewal , which is this companies aim to maximise profits.Please offer your customers a reminder that payment is due and will be taken on a auto renewal agreement.After  attempting to take £119 on a old card payment was refused ,i canceled the auto renewal, where they offererd me the same product for less then £20. Con Merchants AVOID this program .  Cancel auto renewal immediatly.Please google TOTALAV to see honest reviews , reviews here are a little inconsistent.IN RESPONCE TO TOTALAV CUSTOMER SERVICEThere was no email delivered last month  confirming a renwel charge-THIS IS A LIE and not acceptable You(totalav) , not i , ticked the box for  for auto renewl - This is a scam too ,this box should be left unticked , but you auto tick it knowing that 2nd year is where you make your money.Overall i advise anyone not to get this app.They did not scam me for a £119 renewl charge , and i am lucky , many others have to fight to get this renewl charge back and by law they must return the charge.If you do recieve this charge you have limited time to act (consumer rights), immediatly contact your bank or card provider and dispute payment, Immediatly contact  TotalAv and cancel subcription and request payment back.Please google this company for honest reviews before subscibing/installing to, they are not reputable."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Consumer",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T22:13:36.000Z",
          "Titre": "Unable to make contact to get any…",
          "Contenu": "Unable to make contact to get any information or cleaning services."
        },
        {
          "Note": 1,
          "Lieu": "ZA",
          "Pseudo": "debby vanzyl",
          "Nb_Reviews": 3,
          "Date": "2023-11-29T20:49:23.000Z",
          "Titre": "Just don’t do it!!!",
          "Contenu": "So easy to sign on. Bloody impossible to stop your order/unsubscribe. Cheap/free - yes to download app and kuknbetaal for everything else!!!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "CH",
          "Pseudo": "Rach",
          "Nb_Reviews": 2,
          "Date": "2023-10-29T10:09:21.000Z",
          "Titre": "THE WORST COMPANY EVER",
          "Contenu": "I subscribed their services without hesitation because they say on their website that I may cancel the contract within 30 days and NO QUESTIONS ASKED. However, after I canceled the contract but did not receive the refund, I contacted their customer support, they asked me more than 10 times to subscribe again. The worst thing is that after I canceled more than 48 hrs, I still have not receive the refund! I hope someone had warned me before subscribing it. This is a company you would NEVER TRUST!!!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Neil",
          "Nb_Reviews": 13,
          "Date": "2023-11-11T07:29:11.000Z",
          "Titre": "Questionable Company???",
          "Contenu": "With all the reviews, I decided to give TotalAV a go.The televised offer, I couldn't find, when I went looking on the web. Picked the one that included the VPN, nearest to the one advertised on the television. Installation went fine, except for 1 category, that I didn't wish to install.Unfortunately, this was the start of the problems, TotalAV, kept on flagging up with that TotalAV wasn't installed completely (obviously one must install everything, I didn't want to).Their advertisement for the VPN, very questionable.The VPN, strangled my download speed ( upload speed fine, used \"Speedtest\" by \"Ookla\" to the extent that the likes of \"ZOOM\" kept dropping, other web pages kept coming up with security issues, others just blank pages. Their solution wasn't much help either.With all the troubles, asked for a refund.Followed all their instructions and kept getting emails, that I had to verify it. Again followed their instructions, which just led myself to a web page to purchase Total AV, nothing to cancel, except for what I had already done. Took a few weeks before this was sorted out.Why do they make it soo difficult to cancel???"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Malcolm",
          "Nb_Reviews": 8,
          "Date": "2023-10-25T14:23:33.000Z",
          "Titre": "Updated",
          "Contenu": "They constantly attempt to take money from my account despite reporting it they say they don’t but I have the proof. Particularly a problem if you install free version then upgrade. Your laptop is infested with pop ups reminders never ending So annoying will never use again.Update. I am aware of trial period and how that works. It was at the end of a paid subscription period which I didn’t want to renew. I didn’t but you kept using my original payment method. I sent repeated emails and in the end had to block your attempts through the bank. Beware anyone who might be in this position!"
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Jules Caetano",
          "Nb_Reviews": 2,
          "Date": "2023-10-29T14:15:01.000Z",
          "Titre": "REMBOURSEMENT",
          "Contenu": "Hello, in anticipation of Halloween, the only monster I see is TOTAL AV, which is abusing malicious practices to take our money, I asked for a refund which I still have not received... no one to contact me about this... so you are afraid of bad intentions."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Andrew Crew",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T12:52:49.000Z",
          "Titre": "Absolute pack of theives",
          "Contenu": "Absolute pack of theives, they overcharged me once for a service a i dont even remember signing up too, and didnt use. I contacted them and told them to delete all my details, which they told me they had done. Only to find 4 years later they had billed me another 3 times. The fact that they have an unexpected payments section on their website a giveaway...."
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "Val O'brien",
          "Nb_Reviews": 5,
          "Date": "2023-10-20T20:03:06.000Z",
          "Titre": "Absolute thieves",
          "Contenu": "Absolute thieves - I cancelled a renewal - was told it was cancelled and would get a refund after wasting about 30 minutes getting it processed.They then never did it, they say it's still active and won't allow a refund.Beware of these scam artists"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Altosaxx",
          "Nb_Reviews": 28,
          "Date": "2023-10-11T16:00:04.000Z",
          "Titre": "Just be aware that they don't take…",
          "Contenu": "Just be aware that they don't take money for items you don't authorise, I wanted Anti Virus and they took subscriptions for 4 other items, check you PayPal account or similar for what they take subscriptions for. I'm awaiting a refund via their customer service, lets hope. One things for certain ,NEVER AGAIN"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Danuta",
          "Nb_Reviews": 6,
          "Date": "2023-09-11T16:10:32.000Z",
          "Titre": "I feel totally harassed",
          "Contenu": "REPLY TO TOTALAV:I have never been your customer, I have not to uninstall. All messages I have received were sent via Chrome.It's a pity I cannot attach any screenshots here. Bye.I feel totally harassed withaggressive advertisement. Within last 12h I received dozens of fake messages that my mobile is blocked, all my android system has been attached by hackers. These messages keep coming. Miraculously so many good reviews appealing here within last hours. I'm assuming they are bots.Check their Facebook profile, reviews are very bad."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Paul Telfer",
          "Nb_Reviews": 9,
          "Date": "2023-10-04T09:59:59.000Z",
          "Titre": "I will never use Total AV…",
          "Contenu": "I will never use Total AV again.     I informed them twice by email that I will not be renewing my subscription, but they have never replied.Furthermore, my bank informed me again this morning that Total AV are still attempting to take £149 from my account - their 5th attempt over the last 10 weeks.   They are disgrace.   You don't have to believe just me - read other similar reviews!"
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "Rob",
          "Nb_Reviews": 8,
          "Date": "2023-10-09T22:59:15.000Z",
          "Titre": "Watch out for TotalAV",
          "Contenu": "Watch out for TotalAV, first subscribion is cheap but wait after the discounted subscription end. I got now an increase of 4x initial amount and try to get out, terminate my contract with them but very difficult. My bank blocked the transactionas it looks suspicious. Hope that they can resolve it, so watch out before subscribe.They said they will look at my chase to resolve it."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Windy Whistle",
          "Nb_Reviews": 6,
          "Date": "2023-10-14T18:59:28.000Z",
          "Titre": "Total Scam-Do not sign up!",
          "Contenu": "I downloaded this app then cancelled it after couple of days later back  in August but they are still charging me. Their website is completely useless, no customer service help at all. I have no account numbers or details and I can not contact anybody."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Helen Cherry",
          "Nb_Reviews": 22,
          "Date": "2023-10-09T22:16:05.000Z",
          "Titre": "I won't be renewing",
          "Contenu": "I installed Total AV (the paid for version) in March 2023 on two laptops and my mobile phone.  I haven't had any problems with my mobile phone but on the laptops at least twice a week 'Enable Protection' comes up in red but then I get the message that an error has happened and I must reboot.  When this first happened I followed the instructions to completely remove any other anti-virus but this has not made a scrap of difference.  I am very frustrated at having to keep checking whether Total AV is working."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Chris Weiß",
          "Nb_Reviews": 5,
          "Date": "2023-10-25T15:51:27.000Z",
          "Titre": "When you have to google the 10 step process to cancel your subscription...",
          "Contenu": "Like the title says: It was really hard to cancel the subscription, and the software feels like I got a virus on my computer. I needed to decline a handful offers to buy more of the products which are probably as useful as a heater in hell.Edit:Just got an email with the following text:\"TotalAV would love to understand your experience better, so they’ve asked for more details about your review—like an order number or email.If we don’t hear from you within 3 days, your review may be taken offline.\"So basically, I provide my personal data to this scam company or my review gets deleted. Why thanks for nothing then.I would update my review from 1 start to absolute scam."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "CE",
          "Nb_Reviews": 28,
          "Date": "2023-11-13T15:24:45.000Z",
          "Titre": "Don’t bother",
          "Contenu": "Total waste of money more like. On my iPad the VPN randomly switches off, meaning I have to keep checking. On my iPhone it switches off every time the screen closes, so it’s completely useless. I paid for a year at a reduced rate so have already cancelled. They offered me another year at the reduced rate or a low monthly fee to try to keep me. But however low the cost what is the point if you can’t rely on the protection.And now I get a patronizing response. The VPN randomly switches off even when I am using the internet. I am not an idiot, I know how these things work and this doesn’t."
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "Martin Knox",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T08:26:07.000Z",
          "Titre": "They took 100€ from my account without…",
          "Contenu": "They took 99.95€ again from my account without authorization.I cancelled the account in September 2022 because the application did not pick up a serious virus. I'm not happy at all and I want my money back.Martin Knox"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Grace",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T01:58:21.000Z",
          "Titre": "I know there is spyware or something…",
          "Contenu": "I know there is spyware or something malicious on my computer. Everytime I cancel my debit card and enter a new one using my computer on any site for any reason immediately there are persistent withdrawals taken from my bank account. This free scan found nothing."
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "Colm",
          "Nb_Reviews": 12,
          "Date": "2023-10-15T08:58:11.000Z",
          "Titre": "Stay away.",
          "Contenu": "You cannot actually talk to a human being at Total AV.  I was trying to sort out a double payment issue that arose out of an email typo and could'nt get to talk to anyone.  I managed to cancel one account but they shut off the \"real\" account.  Through one of their \"chat\" facilities they passed me to an expert - and I was asked to give credit cards details to pay for the privilege of getting their expert to resolve their issue.  Solution? Block any further payments to Total AV. They were on in a matter of seconds.  Too late - appalling customer service.  Life is too short."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Shona",
          "Nb_Reviews": 4,
          "Date": "2023-10-09T16:45:57.000Z",
          "Titre": "Be aware of auto renew price hike scam…",
          "Contenu": "Be aware that if you allow your cover to automatically renew you will be charged a massive increase. Mine was set to auto renew. The original purchase was £19, the auto renew price was £119! I went into my account to cancel the auto renew and they  then offer to renew for only £19! Why not auto renew at the £19, unless they are deliberately trying to rip off less vigilant customers. I’m taking my custom elsewhere from now own, as this sort of scam can’t be condoned."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Alex",
          "Nb_Reviews": 21,
          "Date": "2023-09-29T22:13:56.000Z",
          "Titre": "Totally destroyed years of work!",
          "Contenu": "So I downloaded Total AV and ran an antivirus scan and a malware scan and junk removal etc. as obviously I wanted to start with a clean slate. During this process all the bookmarks, years of bookmarks in Firefox were removed! I contacted their agent who informed me that there was no way of reversing this. She then ended the chat! I have used many antivirus programs before but have never had this situation occur before. This software has totally screwed up my computer and is designed in such a way that changes can’t be reversed! Brilliant!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paul Watson",
          "Nb_Reviews": 3,
          "Date": "2023-09-14T10:57:03.000Z",
          "Titre": "Says it is free but no free copy available",
          "Contenu": "Says it is free but when open link the only page that opens is asking you to purchase. THRERE IS NO FREE COPY.In reply to the totalav question. an advert popped up supposedly from totalav, whilst surfing the net which said that a free version was available and to click on a link to get the free version. When you click on it you go straight to a subscription page asking for all personal details including all payment card details and gives a price per month rthat will be charged, presumably immediately."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Barry favager",
          "Nb_Reviews": 5,
          "Date": "2023-10-04T17:50:55.000Z",
          "Titre": "Absolute terrible customer service if…",
          "Contenu": "Absolute terrible customer service if you get to chat with them. I bought total av plus add ones before realised how much it was all costing. I immediately cancelled and asked for refund. Was told to click a email to confirm which I did but it only took me to a place offering discount. I am still battling to get my money back even though have never used any of it"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "NPR",
          "Nb_Reviews": 20,
          "Date": "2023-10-31T15:45:22.000Z",
          "Titre": "TotalAV ? Total RipOff more like",
          "Contenu": "Signed up to what I thought was a one year protection for a FREE antivirus. Followed the link from Trustpilot.... A little confused to be asked to pay. Paid £1.99, only to then find out that this was for one month and recurring billing of £9.95 would be taken every month.This was NOT made clear on the site when signing up. Cancelled all recurring payments via PayPal and cancelled account with TotalAV without even downloading it. I'm down £1.99, but at least I noticed it in time to cancel. £111.44 per year for the 'Best Free' antivirus.....?"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Charles Phillips",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T14:37:31.000Z",
          "Titre": "DO NOT USE THIS COMPANY",
          "Contenu": "I recently stopped subscribing as I own an apple and have for some time and although the initial price many moons ago was £30 I got stung with £149. I somehow managed to get in touch via Paypal as it is almost impossible to get in touch with them personally and was told that a refund was out of the question even thoughI had stopped subscribing. It is just another example of grabby poor service. I do not recommend you deal with these guys as they are a faceless company who hike prices up and take the money and run. LOOK ELSEWHERE!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Sharon",
          "Nb_Reviews": 5,
          "Date": "2023-11-14T23:19:06.000Z",
          "Titre": "I have paid for 3 devices to be…",
          "Contenu": "I have paid for 3 devices to be protected but when I click on dashboard I get a pop up message that I am leaving the site and changes will not be saved?"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Gazing Stars",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T10:31:37.000Z",
          "Titre": "Beware!",
          "Contenu": "Beware!! They make it almost impossible to cancel your account. I have been in touch with them five times asking them to cancel the account and process the refund, and I always get the same answer with a link to a page that asks mo to Enable the Auto-Renew, which is exactly what I don't want. It's been 5 days of emails back and forth, and they still don't cancel my account.They want your money and if something goes wrong they won't give it back! Feels a bit like a scam."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "DazD",
          "Nb_Reviews": 4,
          "Date": "2023-09-17T14:07:13.000Z",
          "Titre": "What a rip of company",
          "Contenu": "What a rip of company, they have a product that works at ultra-premium rates. Try to use their cancel function and mysteriously enough you don't get the email verification code to cancel. (Funny that) the fact that I am an IT software technician I know exactly the game they are playing I would like correspondence from their billing manager directly But! mysteriously enough they were never there. Stay Well clear Peep lot more honest companies with security power products out there"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Christine",
          "Nb_Reviews": 86,
          "Date": "2023-10-08T20:06:57.000Z",
          "Titre": "What a scam",
          "Contenu": "What a scam! Have not subscribed to this firm. They out if the blue sent an antivirus alert and said to join immediately for £1 80 per month. I was understandably worried and gave my banking details. They then thanked me for subscribing at £23 80!I JUST CANNOT BELIEVE SUCH SCAM PRACTICES."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Diane",
          "Nb_Reviews": 4,
          "Date": "2023-10-11T03:26:31.000Z",
          "Titre": "Total AV and PayPal beware!",
          "Contenu": "I purchased TotalAV over a year ago for around $30 dollars via PayPal. A few days ago they billed me $119 (almost 4 times the original price???) through PayPal via automatic payments. I never received notification or I would have immediately cancelled - I also never authorized automatic payments with this company. I disputed it with PayPal and they denied it because I didn't cancel ahead of time. I checked my account and there must have been 40 business that were under recurring payments - 3 were legit that I set up - the rest were one time purchases. TotalAV are scammers and PayPal are enablers."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Paul Walker",
          "Nb_Reviews": 7,
          "Date": "2023-10-12T13:13:29.000Z",
          "Titre": "TotalAV - Total RIPOFF",
          "Contenu": "I I decided that a vpn would be of benefit for me, on checking different companies I clicked into Total AV, the site wouldn’t let me explore without giving my bank details.  As soon as I did, they took £19 from my account and sent me a message that this would auto renew at £60 and in order to stop the auto renew I would need to complete my application.  So there we are, I don’t have a VPN, TotalAV have £19 of my money, I’ve had to cancel and change my bank account to stop the auto renew.  Thank you guys, have a couple of beers with my money while you laugh at mugs like me."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Christine King",
          "Nb_Reviews": 9,
          "Date": "2023-11-19T18:30:24.000Z",
          "Titre": "Nightmare trying to cancel",
          "Contenu": "Three years ago I took an offer from Total AV for anti-virus etc. protection. (About £30) At the end of the introductory year they took just over £118 from my account with no warning and without telling me how much I would pay. I sucked this up but decided to cancel at the end of the year. When I tried to so this I was offered another £30 ish year. They then took more than that from my account and I had to request a refund. So, this year I decided to cancel again and was given an offer for 2.99 a month. I accepted this but did not receive a confirmation email. Today I received an email from them saying that 158 euros would be taken from my account. I decided I had had enough of their ineptitude and tried to cancel for once and for all. Now, this post is already long enough so I won’t go through all the steps I had to take but, in total, it took about an hour and a quarter and lots of stress before I was finally able to do this!So, just a word of caution to anyone who is considering using Total AV."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "CEZAR JUNIOR",
          "Nb_Reviews": 3,
          "Date": "2023-09-23T01:11:59.000Z",
          "Titre": "stay way from this comnpany",
          "Contenu": "stay way from this comnpanyThis is FRAUD!!Unauthorized charges to the customer! Malicious auto-renewal options so they can charge you whatever they want. Went from $19.00 to $179 with no notice 3 years later. I DONT EVEN USE THIS APPLICATION!!All these feedbacks are fake. Please do yourself a favor and check other sources of information, and you will see the real feedback. This company is charging customers without their consent.Email sent from Fake Names, there are no account managers or customer service looking after your case, they will do everything for you to give up!Stay away from this company."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Siobhan",
          "Nb_Reviews": 2,
          "Date": "2023-11-02T17:08:39.000Z",
          "Titre": "I have been charged £140 and £119 last 2 years.",
          "Contenu": "I have been charged twice without any email to warn me that I had signed up to a subscription.  There is no complaint system on their website, no contact phone number just some computer telling you the terms.  I was not aware that I had an account as no email told me there was one, with bills to tell me what I had signed up for. They do not make it clear what you are signing up."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Dennis Lacey",
          "Nb_Reviews": 14,
          "Date": "2023-11-06T16:02:51.000Z",
          "Titre": "Sick and tired!",
          "Contenu": "I am sick and tired of unwanted emails from Total AV to renew my subscription. I do not use Total AV, do not want Total AV, and as much as I tell them, they still keep sending me renewal emails. If you are reading this Total AV, please stop now!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Zedar Thome",
          "Nb_Reviews": 3,
          "Date": "2023-10-31T22:10:13.000Z",
          "Titre": "Unauthorized access when they are 'anti virus'?",
          "Contenu": "I am sure it offers some form of anti viral care. In today's world of privacy infringement, please be very aware of what the backend is doing. I did not go through download or install and had halted halfway - without submitting the order but instantly, charges went through! TotalAV did issue a refund, but what is worrisome is this software had already inserted something (unauthorized) into my Mac which constantly pops up on the top right corner a Notification warning \"your Cloud has been hacked..\" , \" Detected Trojan X.YZ  ...\" etc etc very tiresome and none is true which makes you wonder if all these alerts that we need their 'total care' is not a marketing ploy. Connected with their tech support who had no idea why the alerts kept popping up despite that nothing of their software 'totalav' was found in my applications (reminder: I did not download nor installed so it was unauthorized access). Their tech support had no idea how to remove the annoying notifications every 5-10 mins and asked that I bring my Mac to a local tech geek. Sadly, it's like welcoming a 'thief' who then says they are protecting your PC. So many of the anti virus nowadays are this 'self fulfilling prophecy' ploy so be careful. Look for reputable ones - check who owns the company and locations."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "velton",
          "Nb_Reviews": 13,
          "Date": "2023-09-25T18:23:49.000Z",
          "Titre": "I signed up to get a cure for browser…",
          "Contenu": "I signed up to get a cure for browser hijack. Totalav did not find the virus. So I went to cancel (2 days after signing up) BUT Totalav make it impossible to cancel. Thank goodness I paid via Paypal. Any honest company would not put a customer through hula-loops to cancel."
        },
        {
          "Note": 1,
          "Lieu": "TR",
          "Pseudo": "Christopher Cunliffe",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T11:45:31.000Z",
          "Titre": "MISS-SOLD",
          "Contenu": "MISS-SOLDadvert said VPN as included, i even clicked on the link for VPN, took me to payment page, again said VPN was included, along with lots of free pc health and cleaning features.  None is true, once paid my first subscription, it now says it wants an Additional £39.99 to activate the VPN.total miss-sell... will be contacting TotalAV for refund.... gunna stick with AVG like i should have done"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Brian Fogg",
          "Nb_Reviews": 5,
          "Date": "2023-10-08T03:54:20.000Z",
          "Titre": "Took payment to renew that I had not…",
          "Contenu": "Took payment to renew that I had not authorised,and did not want. shady company and wont acknowledge taking payment of £119. Natwest useless at trying to stop payment. 8/10/23. still not acknowlged payment. just keeps wanting me to pay AGAIN."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Geoffrey Foxall",
          "Nb_Reviews": 23,
          "Date": "2023-12-01T20:40:20.000Z",
          "Titre": "Being charged for products that you didn't ask for.",
          "Contenu": "A common thread running through many of the reviews that I have read of this company, is that people have made a small 'one off' payment for a service, only to find that they that they have signed up to a subscription to that or even more products that they were completely unaware off.In my case, I responded to an ad. offering Antivirus PRO for the much reduced price of £1.99. I was more than happy to give it a go for that price, believing that if I wasn't satisfied with it, it wasn't very much to lose.Imagine my horror when later in the day I received a communication from my bank warning me of possible fraud because they were querying not just the £1.99 but a further £39.00 for another product, of which I knew nothing. According to TotalAV I had agreed to buy a subscription for Safe Browsing (VPN) as well, where both were subscriptions that were due to be renewed at a later date.Fortunately, my bank was on the ball. After a short conversation where they informed me that they were unable to stop the payments, they gave me a phone number that allowed me to contact to the accounts department of TotalAV directly, and that I should speak to them about cancelling. To be fair to TotalAV I spoke to a very helpful and polite gentleman who eventually cancelled all payments and subscriptions with the promise of a refund within 48 hours. However, he did offer other other services for free or reduced rates which I politely declined. I told him that a bond of trust between myself and his company had been broken.On reading the reviews, it appears that the management response  in most cases is to assure it's clients that all costs will be refunded - and so far I have no reason to deny this. However I have yet to read a response that explains why they sign people up by stealth for services they haven’t asked for.I am interested to find out and await response.For your information the direct number to their accounts department is 0800357602."
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "A. Al Labadi",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T01:50:19.000Z",
          "Titre": "Avoid! Avoid! Avoid!",
          "Contenu": "I recently had an unfortunate experience with TotalAV and felt compelled to share my dissatisfaction. I purchased their antivirus program for 29.0 euros, but due to a confusing website interface, I unintentionally subscribed to additional features, incurring extra charges of 170 euros.When I reached out to their customer care, the experience was appalling. The first agent was dismissive and unhelpful, insisting that I would not be charged beyond the initial 29.0 euros. Subsequently, my bank flagged suspicious transactions attempting to charge the additional 170 euros.Upon contacting customer care again, the second agent, after an unusually long conversation, conveniently ended the chat, claiming it was due to a system error. This felt like a deliberate attempt to avoid addressing the issue. My attempts to seek resolution through customer care have been a nightmare and made my lose any trust in this company. And after reading the reviews on this website-which I wish I had done previously!-I decided to have my account cancelled and request a refund for the 29.0 euros. The third agent I spoke to was even worse! She treated me as if I were unreasonable for seeking a refund for a money they never received according to her! And to make matters worse, she unilaterally ended the chat, leaving me without any resolution except for \"Check with your bank and call us again\"!The Help Center and live chat proved to be utterly useless, redirecting me in circles without resolving the problem. The lack of transparency and unhelpful customer service have left me deeply dissatisfied.I hope others can learn from my experience, and I strongly advise potential customers to exercise caution. The company's inability to address and resolve customer issues reflects poorly on their commitment to customer satisfaction."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Isabel",
          "Nb_Reviews": 3,
          "Date": "2023-10-18T16:42:46.000Z",
          "Titre": "Thieves and robbers",
          "Contenu": "They took £119 from my account without permission and won’t give it back.  No one to help just robots keep directing me to help.totalav.com continually which is frustrating and NO HELP AT ALL.   THIS COMPANY HAVE STOLEN MY MONEY!!!   And I apparently have no way of getting it back"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "edward ball",
          "Nb_Reviews": 2,
          "Date": "2023-10-12T23:51:35.000Z",
          "Titre": "I was a subscriber but I decided to…",
          "Contenu": "I was a subscriber but I decided to cancel. I was then sent a message giving me a price of $19 to resubscribe. I took up this offer but was charged $81 instead of $19.Have tried to contact you but I get no replies. Be very careful dealing with these people as they rip you off and don't abide by their offers or have no customer service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sharon Mcnamara",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T22:12:51.000Z",
          "Titre": "Areas to hard to understand",
          "Contenu": "Areas to hard to understand, unable to get in to password protection. Said I had 2 computers (PC's) and only have one. So was I being charged extra for a pc I didn't have?"
        },
        {
          "Note": 2,
          "Lieu": "CH",
          "Pseudo": "Jürg Wyler",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T18:38:16.000Z",
          "Titre": "After cancelling Total AV",
          "Contenu": "After cancelling Total AV, a discount of 80% will be offered, instead of €139 per year, i.e. €27.80 per year. On the invoice, however, only 80 € discount was deducted, i.e. 59 € was charged. This is a rip-off!"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Maurice Lloyd",
          "Nb_Reviews": 26,
          "Date": "2023-11-28T17:30:27.000Z",
          "Titre": "This company took an unauthorised…",
          "Contenu": "This company took an unauthorised payment from my PayPal account. I found it impossible  to claim a refund under their refund system. I had to claim refund through PayPal.  They in fact conned me into subscribing to their company."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Peggy G",
          "Nb_Reviews": 9,
          "Date": "2023-11-25T18:24:00.000Z",
          "Titre": "Two stars because it was only $19 for…",
          "Contenu": "Two stars because it was only $19 for the year, then it's $99. First downloaded on 11/6/2023. Uninstalled on 11/24/2023. This program slowed down my computer to an unacceptable speed. When I tapped to run a scan, a msg window appears that says an error occurred and to reboot computer. I did this 4 times, kept getting same error msg. One window says I'm not protected yet when I tap on the TotalAV icon it says I am protected. I'm done. I uninstalled  it. Can't believe all the rave reviews are real. I wasted so much time doing exactly what the msgs said to do. What a sham."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Suzanne",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T18:24:53.000Z",
          "Titre": "I tried 2 payment cards-no errors .Then…",
          "Contenu": "I tried 2 payment cards-no errors .Then PayPal was accepted!"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "RE",
          "Nb_Reviews": 11,
          "Date": "2023-11-17T12:05:33.000Z",
          "Titre": "Annoying pop ups",
          "Contenu": "The installation process isn't straight forward, you don't download one file and click install.   You need to log in and there add bits on.Now I keep getting messages when I open up saying it isn't active.   More annoyingly though when I open up chrome I get the pop up window saying I'm not protected for the dark web.   Click here for the dark web.   I click, I get a pop up saying an email with instructions has been sent.   I never receive the email.   I think the dark web protection was extra which I didn't choose as I don't go on the dark web.   So I wish they would stop with the pop up for each window.   No  tech support available to contact."
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "Mojok",
          "Nb_Reviews": 2,
          "Date": "2023-10-13T06:00:05.000Z",
          "Titre": "You can't get off the hook easily",
          "Contenu": "Once you have an account and subscriptions it's like pulling a bone from a dog !!You can't remove your cards details one stays as default and even if you stop your subscription it gets pushed in Auto mode after a year or two... If you pending for a refund don't close your account or you can get it and once you do they keep directing you to discounted offers and you seem to go into a loop where you won't reach to close your account or chat with anyone. Only solution is to ask for a new card from your bank."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Terry boccius",
          "Nb_Reviews": 7,
          "Date": "2023-11-05T19:27:39.000Z",
          "Titre": "Each month they take payment you have…",
          "Contenu": "Each month they take payment you have to start your app again, Uninstal and  reinstall they don't continue service after payment as been made..Got fed up setting up each time so I cancelled my account"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Courtney Buchanan",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T05:19:03.000Z",
          "Titre": "I wish everything was in one button and…",
          "Contenu": "I wish everything was in one button and I didnt have to download one thousand different protection. Its just too much and takes way to long to download everything one by one. But besides that you guys are WOUNDERFUL!!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ken Kies",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T00:04:09.000Z",
          "Titre": "3rd attempt to get a response that works.",
          "Contenu": "Far too many ads for its own add-on software being pushed.  Can't block or shut them off.  Very annoying.  The basic reason I got it (needed a good antivirus) is being overwhelmed by the annoying quantity of ads.Considering deleting it. Beginning to feel that the benefits are far outweighed by the ads.12/04/23 I am responding to Total AV response. It was not satisfactory. Was told that I am not logged in. Was told to log in at startup screen Sent me screen shot of start up screen but my startup screen does not have the login. I have to go to the General  screen to see my startup link and that shows that I am signed in.Next they suggested that I may have the wrong version of totalav. Suggested that I download and install Pro version of Total Av and sign in. I cannot find any version labeled as Total AV Pro.  Tried to acess thru chat. Clicked icon but only got spinning icon. Never connected. No way to contact them by phone or email regarding tech/install issues. Couldn't even respond to them directly to their response for more support.  Had to come back to trust pilot to continue the dialog.Not a happy camper.12/04/2023 TotalAV responded with the same response - make sure I am logged in. I have confirmed. Both times that on my end I am showing as logged in contrary to what it says at TOTAV’s end. I can scan for viruses despite what Totav is saying. But I can’t get rid of all their pop up ads which is my original request. The inability of the Tech staff to comprehend my issues and respond with a fix makes me believe that this app is just as bad as others have said. Maybe the app is good, but the support sucks. And what’s one without the other. I am requesting procedures from Total Av for a refund request. From what I’ve read, this will be just as hard as the support request. We’ll see."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Ray Nock",
          "Nb_Reviews": 30,
          "Date": "2023-10-05T17:34:45.000Z",
          "Titre": "Check the small print first.",
          "Contenu": "Purchased Total AV as they were offering a decent discount. Turns out the discounted price actually gives you very little. It seems everything you want to do on the app requires another payment. Seven day free trial and then you are locked into so much a month after that. My advice is to look very carefully at what you get for you initial payment. In my opinion it is very little. The other problem is if you want anything to work you have to agree to give total control to Total AV and they actually warn you against doing that. Will not be renewing at the end of my term."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lloyd Mcglasson",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T21:23:46.000Z",
          "Titre": "i dont do revievs"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "GSS Tox",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T22:21:51.000Z",
          "Titre": "Too many upsell requests…",
          "Contenu": "Too many \"upsells.\"  Unclear whether each one is in addition to previously purchased options or whether I need to just pay the difference.  Constantly showing popups with upsells."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Alistair Lawrie",
          "Nb_Reviews": 10,
          "Date": "2023-09-12T14:55:18.000Z",
          "Titre": "There is a spelling error on website",
          "Contenu": "There is a spelling error on website.   But there is no way to register concerns or complaints that do not fall into predetermined conditions.Now questioning my first assertion I see TotalAV have misspelt my name. It is Alistair"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "albert sza",
          "Nb_Reviews": 7,
          "Date": "2023-07-12T20:48:15.000Z",
          "Titre": "I'm wondering about a problem that has…",
          "Contenu": "I'm wondering about a problem that has been bothering me lately, namely VPN has not been working on Total AV for some time.  VPN and IKEv2 setup also fails.  It is possible that the reason for the not working VPN is Windows, some update brought me unexpected changes and the VPN did not work.  It's frustrating that the program didn't work as expected."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Ian",
          "Nb_Reviews": 18,
          "Date": "2023-10-28T10:21:23.000Z",
          "Titre": "Avoid - This is a Scam!",
          "Contenu": "The advert totally avoids the mention of the fact that this is a monthly subscription with other facilities added on at extra cost.  When trying to unsubscribe, they are slow to react and just keep offering discounts - don't even bother to expect a refund! 🤬🤬"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Steven Mccarty",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T04:39:19.000Z",
          "Titre": "Every time I turn my computer back on",
          "Contenu": "Every time I turn my computer back on, there is more viruses & Mcafee is still in my computer telling me I need to run it. Is this true? I don't know who is right, who is Trust worthy. Will there be a time when TotalAV is the only Antivirus Program I see running on my system?"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mônica Salerno",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T03:12:34.000Z",
          "Titre": "app kept crashing/ disapearing and TERRIBLE customer service",
          "Contenu": "The mobile app kept crashing in one mobile and disappeared from another. Just reinstalled them, but had to wait 24h to do so (leaving my mobiles unprotected). Also, your xustomer service is TERRIBLE!No reply to emails asking for help or asking about potential dogdy websites for months on end. Pick up your game,  or you might stay behind..."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mr Paul",
          "Nb_Reviews": 13,
          "Date": "2023-08-09T23:08:53.000Z",
          "Titre": "Signed up for TotalAv for advertised £3…",
          "Contenu": "Signed up for TotalAv for advertised £3 but was billed for £29. Obviously I'd signed up for other packages when I downloaded TotalAV. Perhaps Microsoft's Marketing Dept should be a little more transparent. Caveat emptor etc."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Tony Powell",
          "Nb_Reviews": 10,
          "Date": "2023-05-06T15:52:39.000Z",
          "Titre": "Auto renewal cancellation.",
          "Contenu": "I cancelled my auto renewal TotalAV some time ago and have had an email stating this. When my renewal date came up, TotalAV tried to take money out of my account. The payment failed because I decided to go with another provider and had changed my account details.Perhaps TotalAV ought to read their own emails before attempting to take money out of an account.I am also still getting popups inviting me to buy TotalAV products."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Bashir Mohammed Warsame",
          "Nb_Reviews": 1,
          "Date": "2023-01-01T23:55:34.000Z",
          "Titre": "Telephone support portal personnel are…",
          "Contenu": "Telephone support portal personnel are weak and irresponsible to hold this responsibility. She was not keeping and hosting customer perfectly. she was laughing  and making disruptions with dialogue of another staff. while I was giving my personal details which caused me to be scared if she were HACKER."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tommy Lamb",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T12:21:57.000Z",
          "Titre": "i just wanted to renew i had things to…",
          "Contenu": "i just wanted to renew i had things to do.   instead, you flood me with more and more ads. the hell with putting the protection back up lets just see how much money can separate me from my wallet i get it your a business but you dont have to be so f***king obvious about it and you suppose add a couple things free, RIGHT! The way it looks i Bearley got the basics. and finally, on rating were you leave the message its F**KING rude by asking what is it this time. no worries it will be the last. Merry Christmas"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Josh Smith",
          "Nb_Reviews": 3,
          "Date": "2023-07-16T22:48:04.000Z",
          "Titre": "Bad client service",
          "Contenu": "AV itself isn't that bad, but their site and client service are really lacking. I'm unable to pay for another year due to some bugs on their site and their chat assistant can't do nothing other than repeat itself like a parrot without any valuable informations. Had to do business with another company."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "ann kelly",
          "Nb_Reviews": 24,
          "Date": "2023-01-14T13:41:24.000Z",
          "Titre": "Disappointing",
          "Contenu": "I tried to get customer support help as to why I keep getting messages to renew when I still have three months of subscription left.  Plus I got a message telling me my trial had ended.  I canceled auto-renew a couple of weeks ago, I hate that method.  Trying to communicate with customer service is frustrating and annoying.  They tell you you are chatting with someone but do not even acknowledge they are there.  Feels like talking to a ghost.  Everything is great until it's not.   Customer service needs emergency medical help"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "John Tetaert",
          "Nb_Reviews": 2,
          "Date": "2023-11-24T01:21:33.000Z",
          "Titre": "Your program keeps reloading over and…",
          "Contenu": "Your program keeps reloading over and over. It has asked to be installed 5 times!! What is going on?"
        },
        {
          "Note": 2,
          "Lieu": "SE",
          "Pseudo": "Tanya",
          "Nb_Reviews": 23,
          "Date": "2023-05-11T11:55:56.000Z",
          "Titre": "I am not satisfied",
          "Contenu": "I am not satisfied. I was hoping for a more user friendly service: It's a bit hard to understand the different scanning/cleaning processes and how to on my own determine what to delete. I was also hoping for a memory cleaning feature and was disappointed. In the buying process there was also hidden fees. And be aware: there is no way to cancel automatic renewal which i find quite unserious and fraud-like. Next time I will go back to Mackeeper."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "S B",
          "Nb_Reviews": 3,
          "Date": "2023-08-25T19:52:46.000Z",
          "Titre": "Beware of their OWN spam!",
          "Contenu": "As much as Total AV eliminates most web page ads, there is 1 significant problem ... It puts its OWN spammy ads on many pages!Granted I'm using it in Free mode, but it's still a terrible advert for their own product!No way am I gonna pay for that!"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Ian",
          "Nb_Reviews": 9,
          "Date": "2023-07-07T12:55:21.000Z",
          "Titre": "TotalAV works well on Windows 11 .... BUT!!",
          "Contenu": "TotalAV works well on Windows 11 - my issue came at renewal time. My fault I hadn't turned off auto renewal and TotalAV tried to take £119 from my old bank account. Fortunately for me they couldnt. When I then went to cancel my account they said 'Stay with us for £44 a year'. Therefore my renewal was ripping me off be £75. If they wanted me to stay they should have renewed me at £44 per year. Will go elsewhere now !"
        },
        {
          "Note": 2,
          "Lieu": "IE",
          "Pseudo": "simon",
          "Nb_Reviews": 3,
          "Date": "2023-06-07T22:16:02.000Z",
          "Titre": "They will not allow me to cancel with…",
          "Contenu": "They will not allow me to cancel with them.I have fought and fought and they will only offer discount to stay, when I refuse they say they will leave the chat if they receive no response as if they have been kept waiting. Regardless of what you say to them they still end the chat.They are enfuriating to deal with. I will be contacting g my bank to block any further payments being taken by these thieving low lives.Edit* whoever responded to this has gained this company 1 extra star, they are the only department within TotalAV that have helped me. So thank you."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Anthony",
          "Nb_Reviews": 66,
          "Date": "2023-07-22T21:57:00.000Z",
          "Titre": "Signed up for total Av on a…",
          "Contenu": "Signed up for total Av on a complimentary £1.99 for the 1st month then my bank contacted me to say total Av tried to take another £39 2 mins later without my consent  which they stoppedThank god as I was not aware of this amount won't be using them again and I have since cancelled my orderI've since signed up to Avast a free site I didn't make a request for ad ons but they still tried taking £39My bank contacted me to say there was a unauthorised attempt of £39 from my account"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Ed",
          "Nb_Reviews": 21,
          "Date": "2023-03-07T19:54:38.000Z",
          "Titre": "WHY IS IT NOT POSSIBLE TO CONTACT THEM…",
          "Contenu": "WHY IS IT NOT POSSIBLE TO CONTACT THEM BY E-MAIL??My renewal date was 18 Feb 23, so, 3 weeks earlier I replied requesting the cost of renewal. I had no reply, I asked 4 times and all I kept getting were warning notices about not being covered. Finally I managed to renew, but now my additional user is getting warning messages about not being covered, and I just cannot get it sorted out - their notices have no relation to my problems. WHY CAN I NOT CONTACT ANYONE AT TOTALAV ??!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Terry Romstad",
          "Nb_Reviews": 2,
          "Date": "2023-07-24T04:28:03.000Z",
          "Titre": "I have not used the account  because I am too stupid to follow your instructions.",
          "Contenu": "I have not used the account because I am too stupid to follow your instructions.A BIGGER ISSUE:  Would you take a look at what I have been billed and cancel all but the $39.00 Total AV?  I have tried three times to download and activate Total AV on my phone without success. It keeps saying I have bought a free Total AV product and must buy another copy for my phone.  Once I get help and get my phone covered; then, I will try to install Total AV on my wife's devices.Also, I may have selected AdBlock in the confusion.  Please be sure I did not want to buy or use that application."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Meredith Hopkins",
          "Nb_Reviews": 16,
          "Date": "2023-08-10T14:19:38.000Z",
          "Titre": "Avoid like the plague! However, refund was prompt.",
          "Contenu": "Avoid like the plague!Once you have downloaded their software (which may or may not be good)this company bombards you with intrusive screen messages. It's virtually impossible to remove their software from your device and they activate automatic resubscriptions that are impossible to stop.I cancelled a subscription 11 months ago, after a 1 month trial. I deleted the program yet I have just had £120 taken out of my account. No customer service whatsoever and it appears there is little chance of being refunded for something I do not use or need. Do not download their software as you will never get away from them.10.08.23 To be fair to them, once I negotiated their circular customer support website and found the right button to push, I have, today, received a refund in full with no questions asked.That was good."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Walter",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T17:26:42.000Z",
          "Titre": "Totalav Support…. Really",
          "Contenu": "Purchased Totalav, Total Security.  Have unlimited devices and eighteen licenses to share. My devices are all fine. Sent license to wife’s email. After many tries, got one of her devices covered. The second device looking to create another account. Totalav does not recognize either or her email or password. Problem is there is no one with blood in their veins to talk to. Only chats and they are always looking to move on to next customer. Fix a problem then move on"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Vicky Maclean",
          "Nb_Reviews": 14,
          "Date": "2023-03-22T02:24:09.000Z",
          "Titre": "Took 3 separate payments from me for…",
          "Contenu": "Took 3 separate payments from me for product services I don't want. Tried emailing regarding two refunds but the service email provided is no longer available. Cancelled my account now and hoping to get some resolution if I can actually get hold of someone to sort out rather than click on a customer service options that doesn’t help resolve issue."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Teri Auman",
          "Nb_Reviews": 2,
          "Date": "2023-10-19T03:53:11.000Z",
          "Titre": "I signed up for TotalAV a few years ago…",
          "Contenu": "I signed up for TotalAV a few years ago for s similar low price.  The next time my bill came it was around 89. 99 !  I called the credit card company and TotalAV . The higher price is a monthly charge. I had it removed from my credit card  and canceled TotalAV.  TotalAV said to read the terms and etc and that I would have seen this information  There was no terms and etc. So I was lucky and got out of the high price and canceled."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "sally slick",
          "Nb_Reviews": 4,
          "Date": "2023-03-18T01:00:38.000Z",
          "Titre": "Spam flooding in since changing to them",
          "Contenu": "What I hate is that I am getting ten times, at least, more spam e mails than with Malwarebytes!  I have tried e mailing them but they never bother to respond - wish I had not gone with them.  Also only a couple of 'unsafe site' notices whereas I would get a few a day from the other company"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T09:52:32.000Z",
          "Titre": "I keep getting popups from TotalAV to…",
          "Contenu": "I keep getting popups from TotalAV to purchase upgrades. Wanting me to upgrade to pro version I am paying for what I want I don’t need the ads to upgrade to another version if I wanted it I would have paid for those services."
        },
        {
          "Note": 2,
          "Lieu": "IT",
          "Pseudo": "Gail Brewster",
          "Nb_Reviews": 5,
          "Date": "2023-08-15T01:29:26.000Z",
          "Titre": "I just installed this yesterday but…",
          "Contenu": "I just installed this yesterday but it's not stopping the pop up ads as it said it would. I've tried several times to email them but it doesn't go through.  I want to cancel my subscription but can't."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Darrell Adams",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T20:13:51.000Z",
          "Titre": "Your ad said download 100% free",
          "Contenu": "Your ad said download 100% free. after downloading and running scan to clear up the problems you require an activation that cost $29.00. That is misleading advertisement and you should be prosecuted for the offense. I refuse to participate in such practice.Darrell Adams"
        },
        {
          "Note": 2,
          "Lieu": "IE",
          "Pseudo": "Paul Fox",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T13:16:59.000Z",
          "Titre": "Can't stop the money being taken from…",
          "Contenu": "Can't stop the money being taken from my account. Tried to cancel my account but keep getting into trouble. Find it very hard to cancel. No matter what I do I cannot cancel my account. When I go into my account it will not let me cancel."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Pamela L Misuraca",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T03:39:26.000Z",
          "Titre": "Trouble getting app to work on cell phone",
          "Contenu": "Needed guidance on Getting total and block on my cell phone I spent Uber 1 hour trying to figure out my own but your videos and instructions could not do it now here I go again trying it again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Harold Willett",
          "Nb_Reviews": 2,
          "Date": "2023-05-25T14:35:21.000Z",
          "Titre": "Don't believe everything you read",
          "Contenu": "Don't believe everything you read. People need to learn how to read the fine print before they get screwed with All the Deceptive Marketing Methods going on these Days. Do you've a favor and start reading them All. 9 times out of 10 you'll be glad you did and walk away. We are living in a time where deception is very prevalent in our society. Most of it is coming from these Democrats and liberals. I know some won't like reading this but it's TRUTH and FACTS. Just like watching TV it's all trying to push you towards there ideas and they only thing it's doing is taking your Money. You've been warned. Now I'm being ask for more information is this sun be taken down. Really seems self explanatory to me"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael Wozniak",
          "Nb_Reviews": 1,
          "Date": "2022-11-26T05:35:36.000Z",
          "Titre": "I've been receiving Unwanted robo…",
          "Contenu": "I've been receiving Unwanted robo calls, multiple times a day,for approximately 2 weeks now! Yesterday I received a text from Credit Karma, stating that some of my personal info was compromised thru a third-party that was hacked. I just purchased Total AV, ran a security scan, and your product scan of my android phone found nothing amiss with my phone!?!?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jess",
          "Nb_Reviews": 1,
          "Date": "2022-11-26T11:32:29.000Z",
          "Titre": "It was VERY easy and simple",
          "Contenu": "I recently bought a new laptop and I got this pamplet with the TOTALAV info inside. I gotta say it was easy breezy downloading the program and sdthe instructions were easy enough. I know Im gonna luv this extra protection knowing that my personal info and my kids are safe from web rats and anti-viruses is priceless. Thankx TOTALAV."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "KB",
          "Nb_Reviews": 1,
          "Date": "2023-08-27T09:52:01.000Z",
          "Titre": "E-mail Issues",
          "Contenu": "I have no bad experience with regard to the protection the software provides but I keep on getting notifications from TotalAV that I should activate additional safety schemes. If I accept I am informed that an E-mail has been sent to me allowing me to activate the software. However, I do not receive any E-mails although my address is correctly registered."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ZeeP",
          "Nb_Reviews": 2,
          "Date": "2023-11-12T16:31:25.000Z",
          "Titre": "The app that takes my credit card…",
          "Contenu": "The app that takes my credit card number and infokept messing up on my card. It charged my bank 4 different times for this! They locked down my card and it really pissed me off!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Frederick Reklau",
          "Nb_Reviews": 3,
          "Date": "2023-10-11T17:06:24.000Z",
          "Titre": "I'm not tech-savvy",
          "Contenu": "I'm not tech-savvy, so it is unclear to me how to share my subscription with our laptop (and tablets or phones)."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kim",
          "Nb_Reviews": 1,
          "Date": "2023-07-29T01:55:25.000Z",
          "Titre": "Okay up until I tried to share my subscription",
          "Contenu": "Everything seemed to be going good, up until I tried to share the protection with my sister. I paid for my version of Total AV and from the beginning it stated I could share up to 3 times, The first time I tried to share with my sister and she opened the link it was asking her to pay. So I went to check on my account why it would do that and it stated I had the free version, which is not true.  I tried every way and everything to correct the problem and was not able to, I paid for my version and now I keep getting all these popup from TOTal AV asking me to pay for this and pay for that. Who does that crap. I will never purchase this product again, I just paid for my subscription on Mar 28, 2023 and now it is telling me I have the free version"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": ".Deborah Butler",
          "Nb_Reviews": 34,
          "Date": "2023-02-20T16:50:28.000Z",
          "Titre": "I have not found the site easy to…",
          "Contenu": "I have not found the site easy to navigate and the number listed states it cannot be accessed by Android users.I am not happy that I have been unable to speak to a person, maybe that makes me a dinosaur."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "soaringhawk",
          "Nb_Reviews": 1,
          "Date": "2023-06-25T18:53:13.000Z",
          "Titre": "I am not able to download the product…",
          "Contenu": "I am not able to download the product after purchasing. The website is confusing and should be made clearer. I emailed my concerns and received no reply, just a generic return email."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Aaron Blomeley",
          "Nb_Reviews": 4,
          "Date": "2023-04-01T03:39:52.000Z",
          "Titre": "Customer service",
          "Contenu": "I recently wrote a review, listing my poor experience with the Australian number for their call centre.I have subsequently been in touch with their online customer service and they have identified that the use of Total AV is difficult when using a Mac.  The online customer service has been helpful but the problem is not yet solved"
        },
        {
          "Note": 2,
          "Lieu": "BG",
          "Pseudo": "Peter John Bosse",
          "Nb_Reviews": 36,
          "Date": "2022-12-17T13:28:55.000Z",
          "Titre": "Cheaters watch out they took 166 euro…",
          "Contenu": "Cheaters watch out they took 166 euro from PayPalThey give a eMail billing@ and soon after a mail back with: this email address is not being monitoredUpdate PayPal stept in and will get a refund"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mike Pfaff",
          "Nb_Reviews": 3,
          "Date": "2023-04-06T13:56:09.000Z",
          "Titre": "Buy a different product",
          "Contenu": "I bought this product with the recommendation of Kurt the Cyberguy.  I've been highly disappointed with this product and the recommendation, so much so I dropped his newsletter.  You can't use Webshield and VPN simultaneously on an Android phone. And when you use the VPN only, it continuously drops the connection. Also can't run a security scan on Chromebook.  I will chalk up the money lost as a learning experience and buy another product.  I gave it a 2 because the price is good.  Dah!When it comes to my Android mobile device(s), I have 2. When I set-up my profile, I can only run one profile at a time, either VPN or WebShield antivirus.  It won’t run 2 connections at a time as I thought when I purchased the product.I have the ability on my Android smartphone to run a “security scan” of all my files and apps on the phone.  The software for my Samsung Chromebook does not have a selection for me to run a security scan.I reached out to Total Av support on March 8th about my issues/concerns and never received a response."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mary Kat Edmons",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T20:12:26.000Z",
          "Titre": "TotalAV Has Sneaky Billing Practices",
          "Contenu": "I bought TotalAV last year for $29. I guess I assumed I would get a billing reminder at least a week before it came due. I did not get any reminder. TotalAV tried a total of five times to take money through my PayPal to my bank account. My bank and I first thought it was fraud, so they closed my debit card. I went to totalav and canceled it, once I realized it was on automatic billing. This did not work. They billed PayPal. I called them and told them thus, and was told they did not see a cancelation, so cancelled it and I emailed them back the cancelation request I received. I was told my money would be refunded to PayPal. No such thing happened. PayPal took the $119 out of my account. I was also charged a $29 overdraft fee for those times totalav tried to take money. On top of that, I was charged $66 for an international call to to totalav, because the online cancelation did not work. I have been charged a total of $214 for this delema l! We experience a medical emergency and a pay cut recently, so this money has taken away groceries and doctor bills for us. I am more than upset with this company's billing practice. I feel that it is sneaky. I want my money back!"
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "Gavriel",
          "Nb_Reviews": 1,
          "Date": "2022-11-24T05:05:12.000Z",
          "Titre": "AV turns itself off which is a real…",
          "Contenu": "AV turns itself off which is a real worry - I have Never seen an antivirus program do this which suggest that a 3rd party may be interfering with it. Not good as it means my pc may be compromised. This is not a one off as this has occurred many times over the past 2-3 months"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Shelley Edlington",
          "Nb_Reviews": 4,
          "Date": "2023-08-04T08:09:00.000Z",
          "Titre": "Trouble stopping auto renew",
          "Contenu": "I am trying to disable my auto renew and no code is coming through to my email, been trying for a while and checked all folders. This makes me a bit suspicious"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Trevor rushforth",
          "Nb_Reviews": 17,
          "Date": "2023-09-09T13:00:08.000Z",
          "Titre": "with offers state price is £19",
          "Contenu": "with offers state price is £19, but then other charges regected, still not sure if I am only paying £19?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Shane",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T21:31:04.000Z",
          "Titre": "notification popped up saying i need this app...…",
          "Contenu": "Well a notification just popped up an told me I had 5 threating viruses an to  I needed to pay for this service right away or my phone was in threat of being damaged. So I download an it scans my phone an tells me their is nothing wrong with it. Sooo...what's the deal..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Shelia Glenn",
          "Nb_Reviews": 1,
          "Date": "2023-01-30T05:56:44.000Z",
          "Titre": "At the end of each month my account is…",
          "Contenu": "At the end of each month my account is deactivated even though my account is auto-pay. So payment is never late but my devices are at risk until you all catch-up to real-time."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Jane Dehaan",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T20:56:24.000Z",
          "Titre": "I find the product does the job but…",
          "Contenu": "I find the product does the job but your billing system does not say if it is a monthly fee or annual. I am assuming it is annual."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Carol",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T09:34:40.000Z",
          "Titre": "I have been paying for this service and…",
          "Contenu": "I have been paying for this service and have been unable to use it. Just renewed and $119 and $198 charged to my account. I no longer have access to the email I opened the account with so can’t verify for password reset. Made 2 requests to recover the account with no luck they just send back links I can’t access. I can’t even cancel the service I can’t use. Thank You for your response. But I have made the request for account recovery twice. I have been to help. I have sent other emails with old email address explaining I no longer have access. I have downloaded the app and tried logging on. I just want to ensure I am not going to charged again. The last 2 charges Feb 2nd and Mar 2nd were not expected and threw my budgeting off. considering this is a service I have never used."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "jorge",
          "Nb_Reviews": 2,
          "Date": "2023-04-08T23:01:30.000Z",
          "Titre": "You said it was free",
          "Contenu": "You said it was free, but you make it  so people end up paying by necessity, I hope that you are as good as you said you are and  do all you said you  will I hope I did not made a mistake."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Edward Sumner",
          "Nb_Reviews": 2,
          "Date": "2023-04-16T22:07:21.000Z",
          "Titre": "I don't even know if this thing works yet I don't even know if this app works i don't even know if this app works",
          "Contenu": "How good of a review can you expect when I have not even use your app? isn't it more like a scam, when you can't even find out if this app works, but are expected to be rating it? and of course,it will not be able to use until I rate it!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lori L. Hamilton",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T18:48:01.000Z",
          "Titre": "How was this not detected by Total AV",
          "Contenu": "First, why when I come on here to write a review from my phone which has Total AV Premium running on it, & I go to hit 2 stars, my phone freezes & wont do anything, yet I hit 5 stars it opens right up?  Their operating systems is not very clear, or maybe it’s just my ignorance however when I go to the icon & open up Total AV, go into my account info.  It shows my devices & that I’m protected, yet there is a Download Now button there?  This to me, is confusing.  I purchased Total AV Premium because I don’t have home Wi-Fi & have to run my laptop on an open network. Last week  my Facebook account was froze due to inappropriate content being posted.  Because this was ‘out of the norm’ I was contacted by FB that someone had hacked my account & that they had froze the account until I was able to retrieve it.  Upon investigating this I also discovered unfamiliar devices logged into my Google & my Apple account. By fault of my own, due to a billing issue, I had a lapse in my coverage from Total AV for a couple of days & I am assuming this happened during the lapse of coverage.  I am definitely not very cybersecurity savvy, however I don’t understand how, I have 3 separate devices: cell phone, an IPad an an Apple Laptop, all 3 with Total AV Premium installed & running on them, have run scans & I have not received at least an alert from Total AV.  How is this possible & is this not what the protection is for?  I do not blame Total AV for this, due to my coverage lapse, however I feel this should have been detected."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Cheryl Norton",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T04:04:32.000Z",
          "Titre": "I have been billed twice in 2 weeks",
          "Contenu": "I have been billed twice in 2 weeks, tried to find live chat or a number to call, absolutely nothing. If there is any live chats etc it's impossible to find!!Not happy"
        },
        {
          "Note": 2,
          "Lieu": "SG",
          "Pseudo": "Mary Anne Miranda",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T13:18:13.000Z",
          "Titre": "NOt easy to download Total AV slow…",
          "Contenu": "NOt easy to download Total AV slow downloading. I bought the anti virus but when downloading slow always error"
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "Arnout Griepsma",
          "Nb_Reviews": 14,
          "Date": "2023-02-28T12:48:36.000Z",
          "Titre": "NO heads up, just deducted an outrageous amount from my paypal!!…",
          "Contenu": "I was surprised by a renewal of €180,29!!! I initially paid around € 80. Then I asked for a refund immediately because I did not agree with this kind of business.. I checked their website and found a lot of discounted offers. Even when I tried to cancel my subscription I got an offer for € 98 discount to stay. But no respons to my refund request (I mailed to their billing dept. as they asked me to TWICE!!). No respons and money gone so far. What a sad and bad way to do business like this. Since it was an online purchase I have my legal 14 days money-back-period, but they just do not respond. Very bad, BE CAREFUL with these people!!After the answer of them, I checked their claim again about having sent me a reminder. Nothing! Not in my spam, not in my account....They have reimbursed the subscription, so I updated to 2 stars. I still do not agree with their way of conducting business and stating that you get a discount when you first come to them and later you get billed an enormous amount....but after cancelling/complaining again a big discount. So people who do not raise their voices get to pay the highest price."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "DAVE HUMBERT",
          "Nb_Reviews": 1,
          "Date": "2023-02-04T17:02:46.000Z",
          "Titre": "Update on 1/12/2023",
          "Contenu": "ON JAN 15TH, I purchased your $19.00 special offer as well as an additional $35 through PayPal.  I downloaded it as per your instructions. It indicated it was successful, BUT, it was nowhere on my MacAir in the list of Applications.  I again downloaded the program, but the same thing happened.NO TOTALAV on my Mac.  Sooo, I decided to implement your Tech Support . Don N. Breslin was the support person and basically his suggestions were not effective.. He advised to download app again which I did, BUT no Total AV.  Then he sent me links from your company to install.  These also were of no avail. Since TOTAL AV gets excellent ratings, I would like to be able to have it on my Macair.  I obviously have Safari.This incident has taken far more time than I wished to expend.  I would like a refund if a resolution to this problem cannot be found..I have contacted Total AV on two occasions re: this, but to date, I have received no responseResponse from Total AV on Jan 23rd:  Agent recommended that I use their Tech Assistance and links they recommended.  Evidently, Tech did not read initial review. All of them were tried will no success.  After reading complaints of Total AV on Google, I will request a refund through Pay Pal."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Linda Rainville",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T10:15:00.000Z",
          "Titre": "Cancllation~Please cancel anything after the $3…",
          "Contenu": "Please cancel anything after the $3 charge I only want the $1.99 initial charge and only $3 a month afterwards please cancel any mistakes"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Demetria Anderson",
          "Nb_Reviews": 1,
          "Date": "2023-04-16T14:44:07.000Z",
          "Titre": "Way to Safe",
          "Contenu": "Every site I go on Total AV blocks it.  Its a Microsoft site for God's sake.  I can't even download SAFE files.  I have to turn off the WebShield for files I know are safe.  Will be going back to my old product BITDEFENDER once this year is over."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Andiehayden",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T00:18:59.000Z",
          "Titre": "Scam",
          "Contenu": "It isn't fair to scare people into buying things when there is nothing wrong."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Hallie Bradly",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T19:50:06.000Z",
          "Titre": "I have been sent multiple messages about malware and other threats yet your system failed to detect any. Please advise.",
          "Contenu": "I am both confused and upset as my phone continues to tell me I have a virus but you application didn't scan any."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "SoulMan",
          "Nb_Reviews": 4,
          "Date": "2023-03-28T17:46:39.000Z",
          "Titre": "Beware! Maybe a good antivirus but poor and time-wasting customer care",
          "Contenu": "My mother acquired a TotalAv subscription in the hopes that a paid antivirus would work well and serve her purposes. However, after a first small payment, the company upped the amount and after a year or two, were charging a much much higher rate.We wrote an email as requested on the website's terms and conditions, only to receive responses that totally ignored our requests. Sometimes they were simply warning us that a computer without their anti-virus was vulnerable, another time they offered us some reductions, together with some free offers, but they never acknowledged our request to have a refund and cancel the contract.This continued for various emails, both ignoring our requests to cancel the contract and our requests for a refund.So this is a warning: the anti-virus may even be effective but the customer care is appalling. Likewise, beware that if you sign up you may be faced with an automatic renewal that you aren't requested and also may see the price of the contract spiral upwards. Finally, our case is not alone. There are many, many other reviews of cases online (TrustPilot, BestBusinessBureau, Reddit), that describe exactly the same situation, ie NO cancellation and NO refund.Beware!*EDIT: since I last wrote, TotalAV have infact refunded most or all of the money spent on the rather high subscription. For this reason, I am upping my review from 1 to 2 stars."
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "Mathieu Herkersdorf",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T14:20:38.000Z",
          "Titre": "Is this a renewal scam?",
          "Contenu": "This is my first time rating something and I did it because I'm angry again. I also did it because I don't want anyone else to be caught off guard.First things first, Total AV is a good antivirus program which never gives me trouble and the troubles I had were easy enough to fix.The problem is with billing. The first two years were alright but in the third year the bill was to high and I'm not talking about higher than than sign up bonus which would be normal, I'm talking about higher than the \"normal\" rate promised on the website. Instead of paying 117,81 € like in my second year for the antivirus pro suscribtion, they tried to charge me €141.61. After talking to costumer support, they offered me an discount of 85%. Only paying the regular price would have been fine with me. Last year they charged me for €149,00. This was after they promised the year before they weren't going to this. I tried to reason with them again, but this time I didn't get a refund as they said they would terminate my suscribtion. The end of the story is that I had to terminate my suscribtion this year myself because they tried to charge me €165.41. Let's see how this goes.To summerize:- Good antivirus program- Be careful around billing time, because they charge you more than the suscribtion amount and try to bury the new prices, which are vastly different from the ones posted online, in the lower sections of an E-Mail."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Brian Davies",
          "Nb_Reviews": 19,
          "Date": "2023-02-16T16:12:30.000Z",
          "Titre": "I needed the protection this company…",
          "Contenu": "I needed the protection this company was offering. However after downloading the apps I wanted and making provision for a single payment my bank contacted me 3 hours later with an urgent warning about unauthorised payments . I spent some time talking to the fraud and retail arms of my bank, they confirmed that this company had taken 3 payments instead of the single one authorised. I emailed the company who said they would refund within 7 days. But they did nor argue or present any explanation of why the payments had been taken. At the very least I felt the company's financial operations are sloppy, and therefore have no confidence in their general ability to keep me safe and happy. So I have cancelled all their services and now use a competitor. This hasn't prevented an incessant stream of aggravating advertising to persuade me to rejoin them. All I can say is that their business model and protocols for customer service are not for me, and many others on these pages agree."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Crawford L. Kenney",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T05:37:24.000Z",
          "Titre": "You frustrated me with moving forward…",
          "Contenu": "You frustrated me with moving forward with the install"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "A. Halter",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T00:15:13.000Z",
          "Titre": "Sneaky marketing, hidden costs",
          "Contenu": "For the average person - Be aware TotalAV will use deceptive marketing tactics to suggest that everything is included in the 'pro' version, when in fact it is not, and then strongly imply you must buy a bunch of extras. The purchase options for these are bright green labelled as \"activate X\" and \"activate Y\" - for time poor people it looks as though you are activating included extras, when in fact you are purchasing extra; so a $19 deal suddenly becomes $119 on automatic subscription. If you try to cancel, it requires multiple emails, logins and following various email links, with multiple confirmation steps (one of more honestly could be easily missed for the less savvy).....Sneaky tactics undermine what otherwise I'm told should have been a good product, put me right off these guys for future. And yes these tactics are common and used in many places, but seriously, it's been a rough time globally, it's time to be the bigger guy and give the average consumer who's just trying to get by an F-ing break."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "UserName",
          "Nb_Reviews": 1,
          "Date": "2023-06-04T18:44:25.000Z",
          "Titre": "You have to clean your phone too often",
          "Contenu": "You have to clean your phone too often. Pop-up messages keep appearing on the phone stating phone has a bug"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Sandra",
          "Nb_Reviews": 2,
          "Date": "2023-03-30T04:46:36.000Z",
          "Titre": "The company could have set up the…",
          "Contenu": "The company could have set up the settings for online Browsing VPN protection to multiple devices with using the same email to set up tindividual devices then having to go through more setting up through each individual device sepeartely"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David R Chavez",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T11:23:31.000Z",
          "Titre": "Hassle",
          "Contenu": "You bother to much for recognition . Top sking people to rate up your app very minute."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Eric",
          "Nb_Reviews": 9,
          "Date": "2023-02-13T20:31:27.000Z",
          "Titre": "Still can't get any help",
          "Contenu": "The app works OK, but it keeps sending a popup telling me I need to update my login details. I have done this many times, but the popups still keep cluttering my screen. There is nothing in their Help section, and although they claim 24/7 support, it is only online FAQs on offer. There is no phone number or link to a real person, and when I looked up an email contact via Google all I got was an autoreply directing me back to their website. I don't think this qualifies as customer service.UPDATETotal AV replied, giving a phone number: I chose the option for Tech support, but all I got was a recorded message saying \"Go to web site\", and was cut off.I also used their email support, but an autoreply directed me back to the web site.I am utterly disillusioned.A further update.Another email from Total AV referring me to their web \"Help\" section. This is back to where we started!They obviously wish to have no contact with their customers once they have bought the product.My screen is still being  plagued with their popup."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Stuart Taylor",
          "Nb_Reviews": 2,
          "Date": "2023-02-28T15:06:17.000Z",
          "Titre": "Trying to clean up the hard disk",
          "Contenu": "Trying to clean up the hard disk. Your prog keeps telling me to close microsoft edge. It is closed but your prog doesn't recognize it.?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joseph Lewis",
          "Nb_Reviews": 2,
          "Date": "2023-03-28T20:49:41.000Z",
          "Titre": "Your constant delaying attempts to…",
          "Contenu": "Your constant delaying attempts to upsell me are seriously not appreciated. I REALLY DO NOT LIKE FEELING LIKE A PRISONER!"
        },
        {
          "Note": 2,
          "Lieu": "IE",
          "Pseudo": "Michael Malone",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T18:56:33.000Z",
          "Titre": "TotalAV told me the site I was on i.e 'Total AV'was a phishing site.",
          "Contenu": "TotalAV told me the site I was on i.e 'Total AV' was a phishing site."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Veronica McDowell RN",
          "Nb_Reviews": 5,
          "Date": "2023-07-23T17:42:51.000Z",
          "Titre": "Easy to download",
          "Contenu": "Very aggressive in download.  Took a few minutes to complete download."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Monty",
          "Nb_Reviews": 3,
          "Date": "2022-11-21T02:40:01.000Z",
          "Titre": "I already purchased your product",
          "Contenu": "I already purchased your product, how come I keep getting your pop-up about purchasing it again, and when will it turn off?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tyrrell",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T08:25:06.000Z",
          "Titre": "I paid for unlimited devices and it…",
          "Contenu": "I paid for unlimited devices and it didn't work for 4. Computer and 3 phones. Keeps adding more stuff for more money.  Paid $19, $19 & $39"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Anna S.",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T09:23:21.000Z",
          "Titre": "I can't get download on couple od the…",
          "Contenu": "I can't get download on couple od the apps. Phone says chrome is dangerous.  Could have a virus. I'm not good at this so not your fault"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jot",
          "Nb_Reviews": 1,
          "Date": "2023-04-30T14:19:08.000Z",
          "Titre": "Want to exit",
          "Contenu": "Didn't want to give a review but had to in order to move forward"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "David Bannister",
          "Nb_Reviews": 2,
          "Date": "2023-04-30T09:08:11.000Z",
          "Titre": "Once logged in not a problem",
          "Contenu": "Once logged in not a problem. Have found it easy to use, find your way around, and generally user friendly."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gloria Sasser",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T04:54:57.000Z",
          "Titre": "Getting help to install",
          "Contenu": "Not sure what went wrong.Thank you for helping to finish installing."
        },
        {
          "Note": 2,
          "Lieu": "GU",
          "Pseudo": "Vicente Mesa",
          "Nb_Reviews": 3,
          "Date": "2023-01-16T11:02:28.000Z",
          "Titre": "TotalAV keeps failing",
          "Contenu": "TotalAV keeps failing. It tells me to restart computer. But, it keeps failing. Don't know what to do!"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Naren Petlu",
          "Nb_Reviews": 4,
          "Date": "2023-08-30T15:52:47.000Z",
          "Titre": "Do not sign up for \"Auto Renewal\"",
          "Contenu": "Do not sign up for \"Auto Renewal\" with TotalAV - The Price would be 3 to 5 times your 1st purchase - Unless careful to follow the emails from T-AV which is long and winding with the renewal prices indicated at the end of a long email - I missed it and paid the price - The following year price again goes up by 70% - And Cancelling the subscription is a long and painful process - I had to go through 5 chat sessions who will try to sell the product than honouring the Cancellation request - If one is lucky possibly the right guy enters the chat and confirms the cancellation request -"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "liz jones",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T17:39:22.000Z",
          "Titre": "I feel like I have been scammed",
          "Contenu": "I feel like I have been scammed. I searched the web for “Best antivirus “ and this company came out with lots of Trusst Pilot 4+ stars and an apparently great rating. Then I went to their website and they tricked me into buying a much more expensive product than I wanted or needed. I kept trying to just buy the one computer, one antivirus solution which would have cost me an affordable £45. However, every time I tried to check-out, the message on the screen told me that “for only £39”… , I could have extra security and features, which I “must” need and the pricing is deceptive….as if they had priced the first main antivirus at £44 and the second, “must have” at £40 they would be same total price, but at the prices they showed, it tricks you into thinking that you won’t be paying so much (…. Just a total of £80!! ). Then, I found it difficult to find the information about Unsubscribe and having read some of the reviews here about how people found that even when they unsubscribed they were still charged, I am not confident that I won’t be charged. Edit: Additionally, after managing to unsubscribe, I was sent repeated emails that told me that I would no longer be covered if I didn’t re-subscribe! (I paid for a full years cover so It isn’t like I am saying I will not pay my monthly subscription). And, the company want my personal details (an email sent via the TrustPilot site to me, stated that unless I filled in the form with my personal details, my review here would be taken down. ! I really feel that it just doesn’t benefit anyone if one takes the time to write a fact based, honest review that happens to be negative and states why the negative review has been written. Now, I am worrying that my personal details may be used by this company for nefarious purposes. How does any person with who is struggling with the minefield that is computer protection, cope ? Not everyone has access to more computer literate children, or IT department personnel who can advise. I looked up the consumer body, ‘Which’ and couldn’t even find this company listed in their “Best Antivirus “ reviews, so I feel that I have been unduly swayed by looking at the ‘Trust Pilot’ reviews that this company plastered all over their advertising on the web search page. Additionally, I do not want to install this AV on my computer after reading negative reviews here about how difficult it has been for those people in said reviews, to remove the program from their computers. Conclusion: I have just spent £80 for nothing. I wish I had simply given it to a charity, as they would have benefitted. Yes, I should have researched more thoroughly before I spent the money, but I do feel that their advertising and their sign up page were very deceptive and persuasive, unlike some other very good products, that Which magazine praise for their products and because they have free antivirus software that works very well (unless you are browsing indiscriminately or do need a more comprehensive program)."
        },
        {
          "Note": 2,
          "Lieu": "ZA",
          "Pseudo": "Ian Henderson",
          "Nb_Reviews": 2,
          "Date": "2023-07-25T10:15:35.000Z",
          "Titre": "Far too many questions",
          "Contenu": "Far too many questions. I just wanted protection."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Paul Mrozinsky",
          "Nb_Reviews": 2,
          "Date": "2023-08-26T07:23:02.000Z",
          "Titre": "Total Adblocker is conflicting with my…",
          "Contenu": "Total Adblocker is conflicting with my TotalAV through which I already had Total Adblocker."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Cody",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T02:55:01.000Z",
          "Titre": "Mystery virus",
          "Contenu": "Something is wrong with my phone but this app can't find the issue"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jessie Rose",
          "Nb_Reviews": 1,
          "Date": "2023-04-22T01:17:51.000Z",
          "Titre": "Did not accept my pw OR offer \"change…",
          "Contenu": "Did not accept my pw OR offer \"change pw\"option"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Doug Minde",
          "Nb_Reviews": 32,
          "Date": "2023-01-27T14:39:41.000Z",
          "Titre": "Reply to Total AV",
          "Contenu": "I ask again: is this free or not? People in here seem to be paying for it. Answer please.Thanks for your response, but this is not clear on your web site."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James Kroon",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T15:08:15.000Z",
          "Titre": "Sign Up Total AV and get all kinds of messages to sign up for more",
          "Contenu": "Sign up is easy BUT after that you are bombarded with so many options to add to your subscription and of course to an EXTRA cost. You basic good price will end up being very expensive if you accept."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Fi",
          "Nb_Reviews": 19,
          "Date": "2023-12-18T13:58:53.000Z",
          "Titre": "It’s impossible to speak or E mail a…",
          "Contenu": "Update I’ve tried the form as suggested. Keeps saying ‘Issue submitting your ticket please try again’. I’ve done the ‘ I’mNot a Robot ‘. Nothing works. Infuriating. What’s wrong with a direct e mail to a person … every thing is no reply e mail. It’s impossible to speak or E mail a human being. It sends you around in circles. I have managed to subscribe twice and I’m unable to cancel. It’s scaring me as I don’t have the money. It’s probably a good system but trying to get any help just can’t be done."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bradley A Perkins",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T20:29:21.000Z",
          "Titre": "the amount of declines at the end were…",
          "Contenu": "the amount of declines at the end were annoying. other than that it was fine"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joyce Atwood",
          "Nb_Reviews": 6,
          "Date": "2023-12-09T19:11:42.000Z",
          "Titre": "The download was quick and easy",
          "Contenu": "The download was quick and easy.  I already have several free virus and malware programs on my devices and it would have been helpful to know what I can remove from my devices.  I'm left to assume I can remove everything I currently have installed and just use the Total AV which was my goal."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charles Phillips Sr",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T21:51:07.000Z",
          "Titre": "I’m not happy with your product I’ve…",
          "Contenu": "I’m not happy with your product I’ve been trying to download your product I paid for it with PayPal and I still haven’t received the product yet so I’m going through and thinking about canceling your product thank you for your time"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Darwin W Bushong",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T23:54:44.000Z",
          "Titre": "giving it a try",
          "Contenu": "I was told by a friend that has been in the computer business for years that I need to get Total AV."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Mahr",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T02:35:47.000Z",
          "Titre": "Answer",
          "Contenu": "easy, fast, secure but received confirmation email along with invoice,  when I try to answer or to find away to contact them , couldn't find an easy way to explain for any future payment"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Ann Reith",
          "Nb_Reviews": 24,
          "Date": "2023-11-29T18:05:20.000Z",
          "Titre": "Have increased my original review to 3*…",
          "Contenu": "Have increased my original review to 3* from 1*. This is due to their response to my 1* review being looked into by TotalAV and accepted that I erroneously signed up to apps which I found difficulty using. I only signed up for the original offer which would have expired on 7 December 2023. Mind you if they had accepted the error to start with, a few weeks ago, I would not have needed to go to all this upset.  But due where it is due I thank them for the forthcoming refund."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T05:00:33.000Z",
          "Titre": "Annoying sales push",
          "Contenu": "I felt like I was being pushed to add additional service.  I am an adult and know what I am going to purchase."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "K Sanli",
          "Nb_Reviews": 4,
          "Date": "2023-12-17T08:58:47.000Z",
          "Titre": "Total Av Experience",
          "Contenu": "I bought the Total Av last year, and it is working ok. In my opinion one part of the company doesn’t know the other part of the company they are spamming with the product they have, they have no idea what you have or you are already using very product they are trying to sell. Because they have my email therefore they can spam whenever they want. They should not be allowed. Just a few weeks ago pushing again Total Adblock. At the time I didn’t remembered I already have it and I bought it again. A couple of days later when I check the bill which is located on their site, after login their site under billing section you can see what you have. Later that day I complained and I ask for a refund. They ask me information, and I give to them invoice number which is at their site. They came back, they cannot find the invoice. I check it myself, invoice was not there, it appears it is deleted. After 5-6 days later they are still looking to find it. Now needless to say only Antivirus is working all the other futures are VPN, Adblock, Identy Protection are gone. They cannot find the invoice.They reinstated my position, everything is working as it should as of December 13. By the way they refund the money as well. thanks"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Wade Miller",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T22:57:24.000Z",
          "Titre": "Total AV protection purchase",
          "Contenu": "As I was going thru the items, they showed included, and then came up with a $39 charge.  when this happened, I contacted Total AV and was directed to someone in a foreign country that was extremely hard to understand. I told this person that I felt that I was getting ripped off and wanted to cancel my purchase, instead of $28.30 for a one-year subscription, I was now being charged $108. He assured me that it was just $28.30. In the meantime, I received a possible fraud call from my credit card provider, and now my card is blocked until I can call them tomorrow,"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dr. Jim Shipley",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T00:01:34.000Z",
          "Titre": "I honestly do not know enough about it yet, to review",
          "Contenu": "I honestly do not know enough about Trustpilot to justify any evaluation.  However, it looks promising."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Paul Rossi",
          "Nb_Reviews": 4,
          "Date": "2023-10-08T10:02:58.000Z",
          "Titre": "Frustrating",
          "Contenu": "Used for another account, as I am looking for good antivirus that does not try every trick in the book to constantly try to sell extras, once installed. I have found this software difficult to leave, once loaded, and I tend to receive more TotalAV ads/pop ups, once I turn off auto renew, than from any other company I have tried. Can be very frustrating. Trial period, for me, was long enough. Let's hope that the refund experience is better."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Robert George Thoday",
          "Nb_Reviews": 3,
          "Date": "2023-11-11T17:55:50.000Z",
          "Titre": "THE PROMISED  $100 WAS REDUCED TO $60.00",
          "Contenu": "THE PROMISED discount of $100 WAS NOT HONORED.I have to apologise!  The payment request needs editing as it offered only $60 however when I checked with my bank the promised discount had been applied and I was debited with the lower amount.Sorry   Bob T"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Peter Wareing",
          "Nb_Reviews": 13,
          "Date": "2023-11-21T09:33:55.000Z",
          "Titre": "I like total av",
          "Contenu": "I like total av, but just had a question and tried to get an answer from them.unable to sort on the help page.connected to live twice  chat, what a waste of time. Now a different problem and still unable to get it sorted. they keep sending me to the help page, that is not going to help me.Some of us are not good on computers, but they talk like we are experts.kept getting message up on internet that dark web has been disconnected, asked av if this was them.sent me to a page with the gear wheel turning, this, was turning for 2 hrs with the message you will be connected soon.today 11/11/23. on microsoft edge message that computer is locked, do not shut down but phone this number.no responce from av in blocking this message. and once again no easy way of contacting them to sort it out.AV contacted due to there message on this review, still not sorted and still getting the dark web message with enable the protection that does nothing"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Ebony chand",
          "Nb_Reviews": 5,
          "Date": "2023-10-25T20:36:44.000Z",
          "Titre": "Good protection for devices. Prices subject to change",
          "Contenu": "*amended review. Legit software easy to install on your phone. However, I agreed to pay $4.99 monthly only to have it increase without notice to $10.03 monthly. After emailing (back and forth) I have received my refund for one charge.Just be careful of what you agree to pay in the beginning and be aware prices are \"subject to change\". I have also changed my rating to 3 from 2 out of good faith. I personally won't be using this service again but recommend for those who want good protection on their devices."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Allan Katz",
          "Nb_Reviews": 6,
          "Date": "2023-09-13T16:34:06.000Z",
          "Titre": "First I was getting pop up warnings…",
          "Contenu": "First I was getting pop up warnings that my computer had been hacked.  My TotalAV program didn't catch any of them.  I went to their Website and couldn't find any way to contact a tech for help. No phone number, no text help, only directions.  I uploaded another program to stop the popups.  It didn't work, but TotalAV stopped entirely.  There apparently isn't a way to directly contact a human being to help.  Very frustrating."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Marlis Doriean  AKA  KIM",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T15:36:18.000Z",
          "Titre": "I liked the easy instructions to…",
          "Contenu": "I liked the easy instructions to download this App, I didn't like all the extra add on's they tried to sell.   Also I didn't like the way they advertised this App as totally free and then they tell you it's only free for 48 hours and basically force you to sign up and pay for it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "xx",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T17:07:00.000Z",
          "Titre": "As usual",
          "Contenu": "As usual, the further I went into the install the more it cost. OF course, every app sounds great since my mind is in a security-conscious mode."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Anthony Harland",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T19:15:01.000Z",
          "Titre": "Support could be better",
          "Contenu": "I’ve had the product for a year and as most reviewers have found it works well. My problem started with the renewal which used an old credit card and was therefore declined. I went online and renewed using the new card, and then the problems started. TotalAV no longer worked so I contacted support. As other people have found they are useless, in fact I don’t think “they” are people as I got the same answers word for word the 3 times I went to their site. I suspect they are using a computer to answer standard questions.  In the end I gave up and decided to ditch the product.  So to summarise a good product until you have a problem and then it’s useless.  Postscript - after posting my review I received a reply from Support and my renewal was sorted, so that was good. Still didn't solve why software wouldn't run so I just uninstalled it and then re-installed, and .... it worked fine."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "John Hirst",
          "Nb_Reviews": 2,
          "Date": "2023-08-18T17:03:01.000Z",
          "Titre": "Excellent antivirus but beware of…",
          "Contenu": "Excellent antivirus but beware of billing experience.  They do not issue bill before taking money in the hope that you don't notice you are going from intro price to vastly inflated renewal. When queried they agreed to renew at intro rate which is more than enough for the product when compared to other deals available.  Also finding it impossible to turn off autorenewal which is available on website but does not appear to work."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Maxie Bennett",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T12:27:53.000Z",
          "Titre": "Simplicity. Just having purchased the app, I ran a full scan hoping to uncover so odd & troubling system behavior. At this point the results are yet to be seen. Once I learn how to clain that & other,",
          "Contenu": "Just bought & downloaded. Ran a fill scan without glitch or incident. Once I discover how to use the app, I will be in a better position to give a genuine & realistic rating.I did not care for the traditional upscale sales pitches while attemting to procure this product."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dana Ferguson",
          "Nb_Reviews": 4,
          "Date": "2023-11-11T01:14:47.000Z",
          "Titre": "Don't use this!",
          "Contenu": "At end of license, constant pop-ups used until I finally gave in. My thoughts on TOTALAV: Totally obnoxious!1"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kurt Phillips",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T16:38:45.000Z",
          "Titre": "It implied that the Ad Blocker was…",
          "Contenu": "It implied that the Ad Blocker was included in the purchase but evidently not as upon completion of the purchase I was offered the option to purchase that feature along with many others as well  That did not impress me.  We'll see how the service works and then I will leave another updated review."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Arthur Pooley",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T21:59:15.000Z",
          "Titre": "I would like a q7uicker way to view and…",
          "Contenu": "I would like a q7uicker way to view and delete duplicate files with a bigger viewing area"
        },
        {
          "Note": 3,
          "Lieu": "BE",
          "Pseudo": "Yannick Wawrzyniak",
          "Nb_Reviews": 2,
          "Date": "2023-08-31T21:17:57.000Z",
          "Titre": "One-year deals",
          "Contenu": "I wish there was a way of having deals of 1/2/3 or plus years as oppose to a great deal first time then full price renewed yearly. Would help customers stick to TotalAV as oppose to find others every 2 years."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Collier Jones",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T18:41:40.000Z",
          "Titre": "I like the idea of offering protecting…",
          "Contenu": "I like the idea of offering protecting me from online viruses, but i thought it was a total protection, then you upsell more protection leaving me to believe that what i got for $19 was not total security as your name implies. At this point I'm nervous  because to totally secure me from the evil out there on this offer alone would cost $175 and that's just the introductory cost. If I should comment to protection over the years then I have no idea except the basic virus protect at regular prices of 119 annually. The other charges are not evident  except to get in on the intro at $39+ annually. it all sounds good except I can't afford your unknown, or to have you protect me long term and of course that's not good for me or you. Stop shrouding your protect with mystery, your not any better that those that try and steal from me which is why I need you. But isn't it all the same, you're the criminal that hit my store up and then offer me protect from you.huh?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 2,
          "Date": "2023-09-20T14:46:41.000Z",
          "Titre": "Too many advertisement popups",
          "Contenu": "Too many advertisement popups, it's almost like your software is it's own kind of malware (a statement made by my housemate and I share the statement). Otherwise it seems to work great so far."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Edward Rowles",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T11:05:58.000Z",
          "Titre": "Initial Review.",
          "Contenu": "Make answers more complete and informative.. I am new to this service, and I am not happy to be schooled on how to express my opinions and responses."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Justin Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T05:31:25.000Z",
          "Titre": "This should be for free androids",
          "Contenu": "U know I wish a person would not ever have to purchase this sh!t! Pardon my language.. these bullsh!t apps u need 4 an android yet I never had 2 on my old IPhone 7?? Very disappointed on androids & there $ making marketing schemes"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JAMES THOMAS",
          "Nb_Reviews": 3,
          "Date": "2023-08-06T05:31:42.000Z",
          "Titre": "The constant interruption by Total AV…",
          "Contenu": "The constant interruption by Total AV promoting other services. You are the Ad Blocking guys & yet you are the 1st & repeated offender. let us enjoy the program we just bought."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Gunvant Changala",
          "Nb_Reviews": 17,
          "Date": "2023-07-31T20:55:21.000Z",
          "Titre": "Just bought the new TotalAV software",
          "Contenu": "Just bought the new TotalAV software. Later on, after few months having used the program will experience while using and to see how useful and helpful this software is at the same time how this software is able to perform only after experience we can give the exact result."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Harry Decker",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T20:53:53.000Z",
          "Titre": "It seemed the price went up $10 as I was…",
          "Contenu": "It seemed the price went up $10 I was checking out."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Trequan Burnett",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T22:32:55.000Z",
          "Titre": "secure",
          "Contenu": "I love it and its reliable :)"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carol",
          "Nb_Reviews": 4,
          "Date": "2023-10-10T18:20:00.000Z",
          "Titre": "Company jumped in for a rating",
          "Contenu": "Company jumped in for a rating before I finished initializing the programs.  Too soon to tell if I like the software or not yet!"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "H",
          "Nb_Reviews": 5,
          "Date": "2023-07-12T14:07:20.000Z",
          "Titre": "Very Good & Room for improvement",
          "Contenu": "Keep doingThe product seems to work well on my PC. No up selling pop-ups.On my tablet after I ran a check TotalAV didn't find the spam app Securecaptcha. top that managed to get onto my tablet.The popup star rating request for TotalAV was presented before I could see the results from the scan."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Wendy Lawson",
          "Nb_Reviews": 2,
          "Date": "2023-08-14T02:06:41.000Z",
          "Titre": "it was promoted as free but you were…",
          "Contenu": "it was promoted as free but you were trying to get payments for everything.  Wasn't  expecting that.  Not working in any industry retired and basic user"
        },
        {
          "Note": 3,
          "Lieu": "SE",
          "Pseudo": "Per Stenborg",
          "Nb_Reviews": 3,
          "Date": "2023-11-22T08:57:15.000Z",
          "Titre": "legit, scam or AI",
          "Contenu": "I may be old fashioned, but I like to have the freedom to renew my licenses manually and not via auto-renewal unless I have specifically chosen to do so myself. Thus, I bought the 19 Euro offer and then turned of auto-renewal in my account (which was quite easy). One thing that I didn't like is that some of the functionality is turned off only because you change the way to renew the license – they were included in the 19 Euro deal. After all changing the way to pay does not mean that I will not renew – if I think the program does a good job.This is an email I received today:“Some time ago, you chose to deactivate your automatic renewal of your TotalAV service. After November 14, 2024, you will no longer be able to access your account.Not only that, but in 48 hours, you'll also lose all the additional services you've received, at no extra cost, as part of our great Continuous Protection package.”Other malware scanners (like Malware bytes)  detects total av as a malware, which is a bit concerning (although it could be a way to try to get rid of a competitor). Some sites consider total av as a scam, or rogue programs (including Wikipedia), why it is hardly surprising that many people are skeptical about the program.It would be good to get comments/explanations from TotalAV Customer Care Team or someone else at the company concerning the scam/rogue accusations. Even Wikipedia can be wrong of course. And things can have changed since 2019, when the Wikipedia article was written.Added 11/22/2023After reading the answer from the Customer Care Team I am not much wiser. The answer is almost identical to every other answer they have given. I wanted them to comment on their classifications as a rough company/software by wikipedia (check their \"List_of_rogue_security_software\"), and other sites and forums that has classified them as scam. Thus it becomes kind of nonsensical to ask for my phone number and additional email info, (I gave trustpilot my email to begin with). The answers are robotic/AI-like.I was also unpleasantly surprised by a mail from trustpilot where they tell me that my review may be deleted within two day's unless I comply with total ai:s requests (i.e. giving them additional contact details). That is also odd as I gave them three stars and wrote that I may well renew my license depending on my experience of the software over the coming year. By the way this is what trustpilot wrote to me:\"TotalAV would love to understand your experience better, so they’ve asked for more details about your review—like an order number or email.If we don’t hear from you within 3 days, your review may be taken offline.\"I assume they don't do that with five-star reviews..."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Dalton London",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T22:16:49.000Z",
          "Titre": "renewal",
          "Contenu": "I got a note saying my card information was no longer active.  I pay using PayPal and have never had a problem but I cannot find the link to updating my information."
        },
        {
          "Note": 3,
          "Lieu": "SG",
          "Pseudo": "MK",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T13:01:57.000Z",
          "Titre": "The add-on products are too many and…",
          "Contenu": "The add-on products are too many and quite annoying"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "New purchaser",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T03:18:19.000Z",
          "Titre": "I expected a crap load of stuff on my…",
          "Contenu": "I expected a crap load of stuff on my phone by the why you advertised it. My phone was hacked a few weeks ago. You did nothing that a factory reboot didn't  fix already for me. Very disappointed so far. Can you get all the scam calls to stop that's how I got hacked. They just keep calling over and over. You stop answering your phone and miss the real calls."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Walter T Edwards",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T15:22:28.000Z",
          "Titre": "BUYER BEWARE!",
          "Contenu": "THE BILLING is weird.YOU ASK FOR 1.99 ( AS A COME-ON). THEN Citi Bank sends an email to me warning of an International Transaction for $1.99, then another for $39.00 Then you send another invoice for $40.99.(This makes me doubt Total AV.I am calling Citi Bank Now to make sure I am not HACKED!."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tonya Wolteche",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T12:12:50.000Z",
          "Titre": "Well I just really started with this so…",
          "Contenu": "Well I just really started with this so I can't really give a rating based on long experience so maybe as this goes later on I'll be able to give a more accurate rating"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joseph C Musa",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T19:33:05.000Z",
          "Titre": "received recommedation from a it expertneed to show all pricing before the…",
          "Contenu": "need to show all pricing before the consumer goes forward."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Angela Boone",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T15:53:50.000Z",
          "Titre": "To be determined...",
          "Contenu": "To be determined. I have new device & protection not transfered after seveal attempts, I THOUGHT I had protection. Now 5 new viruses on new phone & NEW PLAN PURCHASE."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Frida Rios",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T18:10:45.000Z",
          "Titre": "your going to download 2 files.",
          "Contenu": "i haven't really tried the software yet but its nit complicated to download but like i said still haven't tried it out."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Peter Thomas",
          "Nb_Reviews": 6,
          "Date": "2023-09-24T01:14:12.000Z",
          "Titre": "Did not accept card number this took…",
          "Contenu": "Did not accept card number this took three goes including my wife's bank details."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Alexandra Gilbert",
          "Nb_Reviews": 4,
          "Date": "2023-11-02T12:54:07.000Z",
          "Titre": "Better deals if you try to cancel you auto-sub",
          "Contenu": "Have had TotalAV for several years.  Assume that at nearly £200 p.a. it's been telling the truth when it scans etc, so had nothing to grumble about.  No longer need personal anti-vac as back under company scheme, so with 6-months left on my 'service' plan, I tried to cancel and ideally get a refund for those months.  The 2 email addresses I had on joining correspondence and which I was advised to use bounced back, so I went on the website and tried to cancel there, it took some time to find a page which wasn't FAQ info.  On the page where I could act, the verification code never appeared in my email, and told me that I couldn't re-try and to wait 2 mins.  This I did and the same message appeared, so I went to the 'livechat' bot who then passed me to someone who confirmed they were human.  The responses were very slow and the first 20 mins were frustrating as all they did was encourage me not to cancel.  They gave me a new verification code and tried to cease the chat.  I told them to remain on line which was smart on my part because the code didn't work.  They gave me another number which did, the cancellation process then started and took me to screens offering me ever increasing discounts to renew next year which as I refused went up each time I declined.  The final one was 60% off - this exceeded the 50% refund I was requesting for leaving 6 months into the annual contract.  Got back to livechat and she asked me what further discount I would accept to stay.  I pointed out that they were now offering me a discount that exceeded my refund request, so give me the refund.  She refused again, matter closed. 45 mins of my time for an over-lengthy process that jaded my view of TotalAV.  It wasn't about not getting a refund it was the number of barriers put in the way to cancelling.  The refund policy is 30 days after renewal for a 12 month plan.  Had I known I would not be working from home any more in May/June I could have got a refund and had I tried to leave at this years auto-renewal I would have only paid 40% of what I did.  Be smart and use this information to get a better deal if you join and want to renew."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Harneet Kaur",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T00:50:25.000Z",
          "Titre": "safe and reliable2023",
          "Contenu": "perfect and safe couldn't be easier to be a part of the Trustpilot community. Using your Trustpilot account, you can write, edit and share your experiences from one convenient location"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "S Davidson",
          "Nb_Reviews": 2,
          "Date": "2023-09-17T19:11:45.000Z",
          "Titre": "easy enough to install but is now displaying an error message stating unable to rewrite???",
          "Contenu": "Im unable to finish the install on my pc as it is telling me there is an error with the rewriting"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Donna  Monroe",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T02:44:29.000Z",
          "Titre": "You need to notify customers  when it…",
          "Contenu": "You need to notify customers  when it is time to renew so that they don't  get caught  in your high annual cost."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "K L Varley",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T16:42:20.000Z",
          "Titre": "proof",
          "Contenu": "I have just signed up having been hacked before I look forward to see if this works or if its just about money, as its my life"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jody Ritchie",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T08:34:06.000Z",
          "Titre": "So far it's been okay we will see how…",
          "Contenu": "So far it's been okay we will see how the app progresses and as it goes and I will give you a much thorough review then"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Mr P Thorpe",
          "Nb_Reviews": 10,
          "Date": "2023-11-27T23:30:20.000Z",
          "Titre": "TOTAL AVERT OFFER",
          "Contenu": "WHEN PURCHASING TOTAL AV STOP PESTERING WITH ADDITIONAL ADD ONS"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Manuel Romero",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T23:38:26.000Z",
          "Titre": "First time I used TOTAL AV All good"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Elizabeth Howland",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T02:58:06.000Z",
          "Titre": "REQUESTING MORE MONEY FOR OTHER THINGS"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ludivino Villaluna",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T22:37:44.000Z",
          "Titre": "I really don't know yet until I use it…once I use it it might be good",
          "Contenu": "I really don't know yet until I use it since I just just download today I hope I could use it to other device that I have"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jones",
          "Nb_Reviews": 4,
          "Date": "2023-07-14T21:04:01.000Z",
          "Titre": "easy to install: ? how safe",
          "Contenu": "Very easy to  install,but noticed poor reviews while installing it-wondering if  I did the right thing"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Keith colvacceshia",
          "Nb_Reviews": 7,
          "Date": "2023-09-25T07:50:16.000Z",
          "Titre": "hidden charges",
          "Contenu": "all the hidden charges making it out that there is just one payment to make in which there is 4 or 5"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Betty",
          "Nb_Reviews": 4,
          "Date": "2023-11-17T01:30:31.000Z",
          "Titre": "After a few bumps in the road",
          "Contenu": "After a few bumps in the road, I was able to download and install the software.  So far, so good.  We will see."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "RonZapp",
          "Nb_Reviews": 3,
          "Date": "2023-07-21T23:06:57.000Z",
          "Titre": "I was unclear about some of the start…",
          "Contenu": "I was unclear about some of the start up costs...did every time requested a serice it was an additional cost??"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Andrew White",
          "Nb_Reviews": 6,
          "Date": "2023-07-31T10:45:52.000Z",
          "Titre": "It's not as cheap as it looks",
          "Contenu": "It's not as cheap as it looks. An introductory offer that automatically takes further payments monthly until cancelled"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ed Kaufman",
          "Nb_Reviews": 3,
          "Date": "2023-08-02T01:20:45.000Z",
          "Titre": "I was looking for malware that puts…",
          "Contenu": "I was looking for malware that puts suspicious websites on my phone. This did not detect it!"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Helen Rowell",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T08:41:13.000Z",
          "Titre": "Taking a long time to do final setup"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Shelley",
          "Nb_Reviews": 3,
          "Date": "2023-08-04T09:03:04.000Z",
          "Titre": "Smart Scan not doing anything",
          "Contenu": "I just loaded the free app and tried to run the Smart Scan. It has been running for at least 10 minutes and nothing has happened - No files or folders scanned - nothing"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shirley",
          "Nb_Reviews": 3,
          "Date": "2023-07-21T02:12:31.000Z",
          "Titre": "I was told I'd spend $19.99 for first…",
          "Contenu": "I was told I'd spend $19.99 for first year and it's $29.99 - thought the program was free and now if I want all devices protected, I have to pay an additional $39.99.  Not really happy so far."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael A Bujard",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T04:00:18.000Z",
          "Titre": "trouble creating account",
          "Contenu": "trouble creating account. It's like they were afraid I wouldn't buy the product if they made things too simple."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paula Cobb",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T23:07:17.000Z",
          "Titre": "it was a great experiance"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bob P",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T20:18:25.000Z",
          "Titre": "Had trouble using credit card had to…",
          "Contenu": "Had trouble using credit card had to create paypal??"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Craig A Cruse",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T23:54:36.000Z",
          "Titre": "I'm still test driving the program :)"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John P. Kirby",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T23:14:57.000Z",
          "Titre": "Getting download from your site is very…",
          "Contenu": "Getting download from your site is very difficult and took 30 minutes to complete"
        },
        {
          "Note": 3,
          "Lieu": "SG",
          "Pseudo": "Edward Yong",
          "Nb_Reviews": 2,
          "Date": "2023-10-13T03:16:04.000Z",
          "Titre": "too much features add-on adv after I…",
          "Contenu": "too much features add-on adv after I click my purchase"
        },
        {
          "Note": 3,
          "Lieu": "MT",
          "Pseudo": "REUBEN MIFSUD",
          "Nb_Reviews": 2,
          "Date": "2023-07-25T11:51:42.000Z",
          "Titre": "New Client",
          "Contenu": "nothing yet i am only just buying it.... & why do I have to take this review if I am a new customer?????"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Skaeling",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T19:59:13.000Z",
          "Titre": "Did about how I expected",
          "Contenu": "Did about how I expected.  Found 10 tracking cookies Microsoft missed:)"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T04:33:40.000Z",
          "Titre": "Excessive Chrome Warnings",
          "Contenu": "You didn't find either:Cause for Chrome warningsorSource of false Chrome warnings....Maybe I'm just a target, not the place of origin?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Mclachlan",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T16:39:42.000Z",
          "Titre": "I found process difficult",
          "Contenu": "I found process difficult. I still have doubt about what I purchased"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "DKJ",
          "Nb_Reviews": 13,
          "Date": "2023-06-29T18:05:55.000Z",
          "Titre": "Found instructions for registering not…",
          "Contenu": "Found instructions for registering not easy to follow, took quite a long time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "jameslmcarthy",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T07:53:43.000Z",
          "Titre": "I didn't like the way it was presented",
          "Contenu": "I didn't like the way it was presented. Told me all the things it could do then wanted to charge for each one separately"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-07-15T14:10:07.000Z",
          "Titre": "I am finding everything easily except…",
          "Contenu": "I am finding everything easily except for changing my credit card."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Graham Bell",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T07:28:10.000Z",
          "Titre": "Cannot give an opinion yet as i have…",
          "Contenu": "Cannot give an opinion yet as i have not had time to as only just downloaded it"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Benjamin Caridad",
          "Nb_Reviews": 1,
          "Date": "2023-07-30T18:28:33.000Z",
          "Titre": "Nice addition",
          "Contenu": "Nice addition. May just end up to lead to greater experience."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jennifer McGrath",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T17:58:00.000Z",
          "Titre": "TotalAVProtection",
          "Contenu": "This experience of registering for TOTAL AV Protection was the easiest and fastest Registration Process for an antiviral protection program for my laptop. I'm very glad that Windows 11 was listed as an acceptable program!"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Peter Spooner",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T02:36:42.000Z",
          "Titre": "It is a very good program. BUT is very hard to install on other devices once you have set up on one device. I have had to delete program on other devices because program kept wanting more money",
          "Contenu": "Program kept asking for more money when installing on 2nd & 3rd devices. Every time I opened browser"
        },
        {
          "Note": 3,
          "Lieu": "ES",
          "Pseudo": "JUDY JACKSON",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T12:03:28.000Z",
          "Titre": "REVIEW",
          "Contenu": "OK APART FROM GOING TO THIS REVIEW BEFORE CONTINUING."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jinger Jones",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T01:37:10.000Z",
          "Titre": "Good protection",
          "Contenu": "Had a hard time getting started. Not seeing password,"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dalia Durdo",
          "Nb_Reviews": 1,
          "Date": "2023-07-29T12:25:54.000Z",
          "Titre": "Company is doing good with the ad…",
          "Contenu": "Company is doing good with the ad blocking and the malware blocking"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Stanleymathers",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T04:07:31.000Z",
          "Titre": "Trying to get in touch with you and adds coming over the phone while I am trying to contact you",
          "Contenu": "Advertising your products for 1/90 and then charge me 91 dollars"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Chuck Reid",
          "Nb_Reviews": 2,
          "Date": "2023-08-26T01:31:38.000Z",
          "Titre": "Not enough info for people that don't…",
          "Contenu": "Not enough info for people that don't even know about what this is or does. I for 1 have no idea what I just did that cost me money"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carroll",
          "Nb_Reviews": 3,
          "Date": "2023-08-26T01:48:32.000Z",
          "Titre": "Sorry but I haven't had a chance to…",
          "Contenu": "Sorry but I haven't had a chance to really check out how this is going to work yet."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brandin Hyde",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T15:16:25.000Z",
          "Titre": "It was good and easy to use I got a virus and I'm hoping it helps",
          "Contenu": "I'm hoping this helps it seeks very easy to use my a y God have mercy on my phone"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sara R R Davis",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T04:29:01.000Z",
          "Titre": "Cleaning",
          "Contenu": "I'm looking forward to seeing the end of the cleaning!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Enrique Silva Jimenez",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T23:08:20.000Z",
          "Titre": "Slow",
          "Contenu": "It tends to offer more than you actually need. Let's just hope it works."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Suzanne Oglesby",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T01:05:00.000Z",
          "Titre": "Indifferent",
          "Contenu": "I haven't had a chance to evaluate the program as of yet."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Christopher Palmer",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T16:02:58.000Z",
          "Titre": "All is well",
          "Contenu": "All is well. The only thing that I can think of is; it's slow scanning some of the time. Other then that, it's a pretty nice app."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Sandra Owens",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T21:47:09.000Z",
          "Titre": "It's  hard to do a review before the…",
          "Contenu": "It's  hard to do a review before the scan is complete."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "J C Turnmire",
          "Nb_Reviews": 1,
          "Date": "2023-07-09T16:58:03.000Z",
          "Titre": "Rating came on too quick..",
          "Contenu": "Rating came on too quick... Did not have time to review Total AV report"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Doug Hoerber",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T22:02:32.000Z",
          "Titre": "I don't know if it removed any thing or…",
          "Contenu": "I don't know if it removed any thing or just wanted me to give you $each year."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Janice",
          "Nb_Reviews": 2,
          "Date": "2023-08-08T01:40:49.000Z",
          "Titre": "Unclear about what I have and don't…",
          "Contenu": "Unclear about what I have and don't have and how to set TotalAV  up on my other devices. 2023"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Gowins",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T10:38:03.000Z",
          "Titre": "It says there's no threats found but…",
          "Contenu": "It says there's no threats found but yet I've got stuff popping up on my phone"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cobalterz",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T13:34:53.000Z",
          "Titre": "Looking for a FREE scan since phone…",
          "Contenu": "Looking for a FREE scan since phone said 67% infected. Scan said None Found."
        },
        {
          "Note": 4,
          "Lieu": "JM",
          "Pseudo": "RICHARD GRAHAM",
          "Nb_Reviews": 4,
          "Date": "2023-12-08T00:29:30.000Z",
          "Titre": "Antivirus worthy of its price... lets see.",
          "Contenu": "TotalAV seems to have made some degree of adjustment with what the end user needs to see. I am pleased that they have a listening ear, in Trust Pilot. I will be monitoring and making my pointers as I am moved. Allow you virus capture information to be sidelined to a much smaller caption possibly in the lower right side as a default. We want to know your doing your jib, yes, but not at the expense of annoying blocking of our information. thanks tho"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Melvin Allen",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T14:55:52.000Z",
          "Titre": "good AV",
          "Contenu": "this is a easy buy, but the ad ons at the end of the sale should be pointed out before hand."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shirley Flowers",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T06:41:22.000Z",
          "Titre": "I'm not finished going over everthing…",
          "Contenu": "I'm not finished going over everthing they have done.  I know it will be a 5 star rating when I am through lookimg and reading things."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dawn",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T17:41:45.000Z",
          "Titre": "easy to sign up however to many after…",
          "Contenu": "easy to sign up however to many after purchase prompts"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Benny Ward",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T04:27:35.000Z",
          "Titre": "Let see what happens and will get back!not sure about your service yet",
          "Contenu": "not sure about your service yet, hope your service cleans up my computer so it works better. So far like interface and download capabilities!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Wing",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T20:58:11.000Z",
          "Titre": "Will stick with them",
          "Contenu": "I hate companies that default to auto-renew on your credit card without asking.  ie all of them ! (as far as I can see). SO much of my judgment is the ease of being able to opt out of auto-renew.  Total AV geta a 4 out of 5 on this. ie its not too obscure.. and cleverly they did give an extremely good next year renewal option which kept me 'in' (so good marketing !).  Otherwise, seems a pretty good product doing what they all do but offering a user friendly interface."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gregory Fink",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T01:44:50.000Z",
          "Titre": "Guardian",
          "Contenu": "Watching over my computer!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "George C Thompson",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T09:08:40.000Z",
          "Titre": "TotalAV seems to be good software but Customer Service is lacking",
          "Contenu": "TotalAV seems to be good software that, for the most part, does exactly what is intended.  That's why I chose 4 Stars.  I wonder about Ad Block because I still see a lot of ad pop-ups at various times, especially about TotalAV products! Another concern I have is that it seems sometimes it is difficult for the Customer Service group (mostly in India that I've spoken with) to understand my concerns or questions.  Therefore it has taken two or three calls to get my concern answered.Another concern is that the charges for software vary all over the place.  Therefore is quite possible not to know what a charge is for when you first see it on your credit card.Lastly, I don't like that I can't get a refund on a product that I have not installed or used at all (confirmed by TotalAV), only because the time lapse is more than a two or three months since I purchased the product."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Graham Lindley",
          "Nb_Reviews": 4,
          "Date": "2023-12-19T19:50:56.000Z",
          "Titre": "You do what you advertise."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "George C Thompson",
          "Nb_Reviews": 2,
          "Date": "2023-11-07T20:42:19.000Z",
          "Titre": "I haven't used TrustPilot",
          "Contenu": "I haven't used TrustPilot, however I believe it will be a good experience once I start.  What I did not like is that I tried to load TotalAV onto this computer, it didn't load but I continued to get ad pop-ups about TrustPilot.  That was annoying!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Heidi Felten Bangart",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T01:16:27.000Z",
          "Titre": "IT WORKS",
          "Contenu": "It works really smooth. I have had others that locked up my computer. TOTAL AV NEVER LOCKED UP MY COMPUTER! In fact I NEVER had an issue. So I WILL CONTINUE TO USE TOTAL AV FOR ALL MY OPTIMIZING AND PROTECTION NEED!!!"
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "SilverLionfang",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T12:23:23.000Z",
          "Titre": "I think it helped me, eventually",
          "Contenu": "I suspected some leftover virus messing up data in my pc and found a way to download the program. It already had good reviews, but downloading it was still a hassle.Every time I tried to land on the website, my browser claimed it didn't exist. When I tried another browser, it even warned me of the dangers the website possesses and the money people have lost on it.When I honed in my search function, I eventually found a download link on a help page where I was finally able to download it. It immediately warned me of malware left on my PC and got rid of it. Happy to accept it, but still wary whether my PC is safe. I'd rather run some more tests, but this is my review currently."
        },
        {
          "Note": 4,
          "Lieu": "EE",
          "Pseudo": "Heiti Mäemees",
          "Nb_Reviews": 2,
          "Date": "2023-11-23T16:16:45.000Z",
          "Titre": "Runs smoothly and good support",
          "Contenu": "Runs smoothly so far. Good support. Could be more VPN servers globally. Beware recurring billing to avoid surprises."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "John Young",
          "Nb_Reviews": 24,
          "Date": "2023-11-26T15:56:38.000Z",
          "Titre": "I was a bit slow understanding the…",
          "Contenu": "I was a bit slow understanding the process. I clicked paypal first and I do not know if this payment method was accepted?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Craig Maccorkle",
          "Nb_Reviews": 3,
          "Date": "2023-09-18T22:16:28.000Z",
          "Titre": "TotalAV is a well engineered antivirus program",
          "Contenu": "TotalAV is a well engineered antivirus program thatoperates unobtrusively in the background, giving anydevice it is installed on good coverage against allcurrently known malware. If it detects a 'threat' or a questionable website being visited, it will bring itto the viewer's attention so that the threat can beremove promptly. The support services are fullyprofessional. I have TotalAV on my home computerit gets a three thumbs up 👍👍👍 😊"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Greene",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T01:19:24.000Z",
          "Titre": "Payment problems",
          "Contenu": "had problem paying and system charged my credit card many times. Received email and tried to pay again with another CC and started"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Edward Irish II",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T02:55:36.000Z",
          "Titre": "You got only 4 stars for not letting me…",
          "Contenu": "You got only 4 stars for not letting me into every adult site I wish to visit. You need to prevent children from such access, not 76 year old men living alone in a hotel room with a pet cat."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mr Ruth",
          "Nb_Reviews": 9,
          "Date": "2023-11-30T10:54:17.000Z",
          "Titre": "PRIVACY",
          "Contenu": "PRIVACY IS THE MOST IMPORTANT THING AND JOINING TOTAL A V IT SHOULD BE ASSURED"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mrs. YAR",
          "Nb_Reviews": 4,
          "Date": "2023-11-06T18:52:15.000Z",
          "Titre": "A Great Antivirus to Have!",
          "Contenu": "I first purchased Total AV protection about two years ago.  I think it is a very good and trustworthy antivirus program to have installed on your computer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Francis Diamond",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T01:32:25.000Z",
          "Titre": "Well I haven't finished yet"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ronald Clough",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T13:50:10.000Z",
          "Titre": "I thought I had purchases this…",
          "Contenu": "I thought I had purchases this protection before, but when I try to use it, I was not able to do so. So I thought I better reorder incase something went wrong with the first attempt. If you find I already have purchased previously, and can tell me why I cannot activate my protection. I would appreciate the help. Ron"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patricia  Purkey",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T03:01:19.000Z",
          "Titre": "They are taking care of my laptop and…",
          "Contenu": "They are taking care of my laptop and all my personal business for me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Agnes",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T20:59:24.000Z",
          "Titre": "Just downloaded",
          "Contenu": "Just downloaded, that process was smooth. Have to wait and see if it really works"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Oz",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T23:05:15.000Z",
          "Titre": "It works good for the reason I got it…",
          "Contenu": "It works good for the reason I got it but id like for the vpn and other extensions to be free. I would even be fine if you added ads to the side of the TotalAV app not on the pc its self but when you open the app to scan or whatever have them there and make money that way but if the others extensions were free them I would give a full 5 stars but it works great for what I got it for"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul Runtich",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T21:19:53.000Z",
          "Titre": "Seems like it may be good not sure yet…",
          "Contenu": "Seems like it may be good not sure yet will try it"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Allan Katz",
          "Nb_Reviews": 6,
          "Date": "2023-09-26T19:00:59.000Z",
          "Titre": "TotalAV finally up and running, but...",
          "Contenu": "I was able to get TotalAV up and running again.  It turned out that once I had downloaded an additional software to try and eliminate popups, TotalAV wouldn't launch and their software to prevent popups wouldn't install.  When I described my issues in a post here, a few weeks ago, including the additional software download, nobody told me that could be the problem.  I deleted the second program and reinstalled TotalAV, added their Total Adblock, and their software seems to be doing the trick. Everything installed - and so far no more annoying \"virus warning popups.\"  So, I'm quite happy with their program. My only issue is that I had to do my own problem solving and after a month or so I still never had a direct email address, or helpline phone number."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RONALD BOWENS",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T03:33:39.000Z",
          "Titre": "THE ONLY THING WAS THAT IT WAS HARD TO…",
          "Contenu": "THE ONLY THING WAS THAT IT WAS HARD TO PAY FOR THE SERVICE ON YOUR WEBSITE"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert A",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T08:51:07.000Z",
          "Titre": "Pre-flight TBD",
          "Contenu": "I will have to actually give this a run-through before I'm able to give an honest point eval. However, I will leave you with this - So far pretty impressive Plan Layout and a pain free registration. Thank You!"
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Sharon Morris",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T04:49:14.000Z",
          "Titre": "the speed of installation"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Frank Eaton",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T18:13:56.000Z",
          "Titre": "Good Job",
          "Contenu": "TOTALAV cleaned and fixed my system in no time. Excellent software and very easy to install, setup, and start using to ensure my system is protected."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Ben Katipa",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T04:02:28.000Z",
          "Titre": "Great Product without a doult",
          "Contenu": "Great Product without a doult, i recommend this product to any future prospect !I rated \"4 stars\" due to the fact of the confusion from my side, however more clarity required for people who like me !"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ceboz",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T08:34:32.000Z",
          "Titre": "I had somehow lost my connection to…",
          "Contenu": "I had somehow lost my connection to Total AV when they sent info for me to upgrade.  I did so gladly.  But have a question  Is this an add to my current account which I already paid. or is this an additional change.... tried support and cannot seem to get connected with the right department.."
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Chidozie",
          "Nb_Reviews": 1,
          "Date": "2023-09-17T23:47:23.000Z",
          "Titre": "There are lots of added features to…",
          "Contenu": "There are lots of added features to TotalAV Pro; however, I have two concerns. First, you need to be straight with your customers right out of the gate that some features like VPN is not included in TotalAV Pro. You have to buy it as an add-on. And second, let's say, I want to stream Netflix UK with your VPN; it doesn't load Netflix UK. It will load the country where I live. That means your VPNs are blocked by Netflix. If you can update it more often, I will keep my subscription longer, if not, after a year I'm out."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Howard Calvert",
          "Nb_Reviews": 3,
          "Date": "2023-09-26T23:19:13.000Z",
          "Titre": "All well now after some installation confusion",
          "Contenu": "Had some difficulties installing as some of the buttons took me to the wrong pages. Once installed, I have tried using it and it went well. Very happy now although I was getting frustrated with the installation. Useful tools in the box too."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nada McGrew",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T21:27:58.000Z",
          "Titre": "The company is known for good…",
          "Contenu": "The company is known for good protecting and trustworthy. I am 87 years old and have difficulty understanding what Im supposed to do when there are too many options. Not Sure I did everything right."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Susan",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T18:56:46.000Z",
          "Titre": "A little confusing to start but I am…",
          "Contenu": "A little confusing to start but I am hoping for clarity as I go through this cleaning."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marilyn",
          "Nb_Reviews": 8,
          "Date": "2023-12-08T03:45:55.000Z",
          "Titre": "Needed help cleaning up my computer and…",
          "Contenu": "Needed help cleaning up my computer and this was pretty easy"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tanya Renee Shelton",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T00:03:18.000Z",
          "Titre": "Cant rate this site yet",
          "Contenu": "I am not sure if this site will earn a 4 star because I have not utilized it yet. I have only paid. These surveys should be done in appox one week after you download their service to get a true review."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stewart A Kingsley",
          "Nb_Reviews": 2,
          "Date": "2023-09-19T20:09:46.000Z",
          "Titre": "I have had to reset this computer…",
          "Contenu": "I have had to reset this computer because it had been hacked and lost a lot of time. Your program is not always active and often I had to active it manually also it often times out in this process."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mitch W.",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T04:09:48.000Z",
          "Titre": "Great Performance, not so great processing",
          "Contenu": "Total AV does great at scanning files and cleaning up junk. I just wish it didn't use so much of my processor."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Maya Gutierrez",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T07:55:01.000Z",
          "Titre": "Total AV does its job thoroughly and…",
          "Contenu": "Total AV does its job thoroughly and completely.I feel my laptop refreshes after getting the application.Thank you, people who work for, this application.Maya"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "maland Silvio",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T20:47:35.000Z",
          "Titre": "understand my point",
          "Contenu": "want to thank u for taking to explain to me! i had an extremely busy day and could not find a way to get out of writing the review. i like ur product and that was my point . Have a good Thanksgiving and Christmas ! sincerely, MSilvio"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "SS KAR",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T08:09:48.000Z",
          "Titre": "Cleans malware",
          "Contenu": "Cleans malware, but takes a lot of time."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Gordon Sailer",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T15:00:54.000Z",
          "Titre": "Peace of Mind",
          "Contenu": "Let me know when my device is protected or not!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Curtis Aljets",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T17:11:04.000Z",
          "Titre": "Feed Back",
          "Contenu": "It was easy to enroll, but the piecemeal way of getting complete coverage is confusing.  It should be presented as a list of options and not one at a time."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "CHRISTIANE C LASSEN",
          "Nb_Reviews": 3,
          "Date": "2023-11-03T02:30:10.000Z",
          "Titre": "i am struggling to download  to my 2nd…",
          "Contenu": "i am struggling to download  to my 2nd device, because of ,I feel, this intrusive rating ....which wont go away util you do it!2023"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "LEE",
          "Nb_Reviews": 2,
          "Date": "2023-11-19T07:20:40.000Z",
          "Titre": "My PC has not had any viruses since…",
          "Contenu": "My PC has not had any viruses since having your antivirus installed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nora Hammerschmidt",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T20:37:48.000Z",
          "Titre": "Nora",
          "Contenu": "All went fine and I am pleased with your service I was with you a long time ago and will be coming back slowing as my finances say go."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ANISSA M BOSS",
          "Nb_Reviews": 4,
          "Date": "2023-10-27T19:02:44.000Z",
          "Titre": "A lot of ads for additional stuff that…",
          "Contenu": "A lot of ads for additional stuff that was not explained for what was advertised as a free product"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rocker Blast",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T18:03:57.000Z",
          "Titre": "I figured it was worth a shoot to see…",
          "Contenu": "I figured it was worth a shoot to see what the hubba was about and it looks like I was hooked. It seems just as reliable as Malwarebytes, so, I love it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T10:05:23.000Z",
          "Titre": "The ease of getting the antivirus was…",
          "Contenu": "The ease of getting the antivirus was good. The other 5 offers i got for extra was unnecessary. just post the packages and have the customer pick."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lloyd",
          "Nb_Reviews": 6,
          "Date": "2023-10-22T01:58:36.000Z",
          "Titre": "I am still having problems getting the…",
          "Contenu": "I am still having problems getting the program installed on my primary computer, though the backup computer seen to accept the program without any problems"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ray Hughes",
          "Nb_Reviews": 2,
          "Date": "2023-09-29T02:05:42.000Z",
          "Titre": "It was fast and easy",
          "Contenu": "It was fast,easy, and I got incentive for signing up. So far a quality service. It is affordable, but seems the issue with that is there is no way to email or call anyone. Have to figure it out yourself."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 2,
          "Date": "2023-09-23T20:50:32.000Z",
          "Titre": "So far Total AV has been a really great…",
          "Contenu": "So far Total AV has been a really great protector of my computer. I appreciate having the added security. Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Domingo Dizon",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T11:13:03.000Z",
          "Titre": "Too early to say but the installation…",
          "Contenu": "Too early to say but the installation process is very simple"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Luna.rae. April",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T19:49:45.000Z",
          "Titre": "I was getting a message on my phone",
          "Contenu": "I was getting a message on my phone, the I had a virus of some kind that would compromise all my data.  So I did a scan. The scan didn't show anything was wrong with my phone.  I hope I don't get that message again. Thanks for keeping my phone safe."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Deborah W Spradlin",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T00:10:30.000Z",
          "Titre": "avast",
          "Contenu": "used years before"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Elwood C Peele",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T20:45:19.000Z",
          "Titre": "It actually wasn't that good",
          "Contenu": "It actually wasn't that good. It has taken me several tries to get what I wanted to come up."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "S. Myers",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T02:40:26.000Z",
          "Titre": "It took a bit of work to download to the third computer.",
          "Contenu": "If the company is true to its words; I am hoping that my information is safe."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Byron Engaston",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T13:59:51.000Z",
          "Titre": "i just started Total AV",
          "Contenu": "i just started Total AV, ill add another star incase the result is satisfying."
        },
        {
          "Note": 4,
          "Lieu": "AE",
          "Pseudo": "Johan Robin",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T15:28:28.000Z",
          "Titre": "It is good!!!",
          "Contenu": "I mean it's good. But I want the latest 2024 version free or else I would've given a 5."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alain Atangana",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T23:55:23.000Z",
          "Titre": "they addressing issues rapidly"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Jennison",
          "Nb_Reviews": 3,
          "Date": "2023-12-10T13:06:42.000Z",
          "Titre": "good",
          "Contenu": "easy install"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Anthony",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T12:16:01.000Z",
          "Titre": "Have I done this before",
          "Contenu": "Have I done this before? Renewed this time around twice?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ernest Doucette",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T22:52:12.000Z",
          "Titre": "Great Anti-virus",
          "Contenu": "Great Anti-virus, Too many Pop Up Ads.from Total AV."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer  Frank D Mileto AIA P",
          "Nb_Reviews": 3,
          "Date": "2023-12-11T17:34:17.000Z",
          "Titre": "Easy",
          "Contenu": "Easy, helpful, correct"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Benjamin F. McMillan",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T19:43:57.000Z",
          "Titre": "Providing this serviceSomething needeed",
          "Contenu": "Providing this service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karen Frey",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T13:00:08.000Z",
          "Titre": "easy to do thanks"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Robert St-james",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T19:08:26.000Z",
          "Titre": "needed protection and it recommended",
          "Contenu": "I just needed protection for my PC and it was recommended"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Kishore Makadia",
          "Nb_Reviews": 5,
          "Date": "2023-11-25T12:02:55.000Z",
          "Titre": "i had no problem downloading it",
          "Contenu": "i had no problem downloading it. it is easy to use ."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Miss Underwood",
          "Nb_Reviews": 3,
          "Date": "2023-11-04T14:29:24.000Z",
          "Titre": "Peace of mind. I Feel Totally confident in the protection this service provides",
          "Contenu": "I Feel Totally confident in the protection this service provides"
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "R J Campbell",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T01:51:03.000Z",
          "Titre": "simple and easy to use"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "terry middlemist",
          "Nb_Reviews": 4,
          "Date": "2023-09-28T22:17:30.000Z",
          "Titre": "Good news",
          "Contenu": "i found the instuctions clear and easy to follow and this says a lot as i,m not very good on the computer.still at 75 that,s aloud .Now i await to see if it does what it says."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Philip",
          "Nb_Reviews": 11,
          "Date": "2023-12-02T17:15:33.000Z",
          "Titre": "Easy to install easy to pay just got to…",
          "Contenu": "Easy to install easy to pay just got to try it out now"
        },
        {
          "Note": 4,
          "Lieu": "AE",
          "Pseudo": "Mohamed rajh",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T22:13:58.000Z",
          "Titre": "best antivirus i used so far",
          "Contenu": "best antivirus i used so far the only downside is the free trail is too short :("
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Customer",
          "Nb_Reviews": 8,
          "Date": "2023-11-19T20:52:04.000Z",
          "Titre": "Found a problem with card acceptance!"
        },
        {
          "Note": 4,
          "Lieu": "CW",
          "Pseudo": "Otmar Sasso",
          "Nb_Reviews": 4,
          "Date": "2023-10-19T19:00:22.000Z",
          "Titre": "The application does have the most…",
          "Contenu": "The application does have the most essential tools for your pc."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T05:23:24.000Z",
          "Titre": "Good",
          "Contenu": "useful to me"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paula Crites",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T14:25:46.000Z",
          "Titre": "The price was great",
          "Contenu": "The price was great. Easy Pay process. the only thing I didnt like was all the pop ups trying to  get you to buy more things."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Nestot Harina",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T02:58:14.000Z",
          "Titre": "Later comment please after I had been…",
          "Contenu": "Later comment please after I had been familiarized. Thanks a lot."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DAWN COZAD",
          "Nb_Reviews": 3,
          "Date": "2023-09-27T01:54:13.000Z",
          "Titre": "Easy to navigate on the phone the PC…",
          "Contenu": "Easy to navigate on the phone the PC seems to be a little more difficult."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Nicholas Tartt",
          "Nb_Reviews": 4,
          "Date": "2023-11-02T12:18:22.000Z",
          "Titre": "trying TotalAV out for now so I Don't…",
          "Contenu": "trying TotalAV out for now so I Don't know what it's like just now.."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "valerie McLawrence",
          "Nb_Reviews": 6,
          "Date": "2023-09-26T13:48:05.000Z",
          "Titre": "Reconcillation and resolve…",
          "Contenu": "so far the support person I spoke with this am  was professional polite and appeared to know how to provide the needed information to clarify my concerns"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Liz Perrott",
          "Nb_Reviews": 7,
          "Date": "2023-11-18T23:09:38.000Z",
          "Titre": "EASE",
          "Contenu": "THE INSTRUCTIONS WERE EASY TO FOLLOW"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mrs Lorraine Crisp",
          "Nb_Reviews": 2,
          "Date": "2023-10-22T16:41:47.000Z",
          "Titre": "Considering I find it very aggravating…",
          "Contenu": "Considering I find it very aggravating to spend valuable time on my computer Trust Pilot is vert efficient."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Linda Shapiro",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T22:37:40.000Z",
          "Titre": "Works great",
          "Contenu": "Works great, gives complete details when it finds a problem."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephen Lo",
          "Nb_Reviews": 17,
          "Date": "2023-09-19T08:16:52.000Z",
          "Titre": "There is a little confusion in entering…",
          "Contenu": "There is a little confusion in entering the credit card data."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Allan Carranza",
          "Nb_Reviews": 2,
          "Date": "2023-10-27T22:31:55.000Z",
          "Titre": "A little annoying ads trying to sign up."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Prince Strickland",
          "Nb_Reviews": 2,
          "Date": "2023-10-18T23:47:18.000Z",
          "Titre": "i like the company they are great",
          "Contenu": "i like the company they are great, very professional"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chester",
          "Nb_Reviews": 3,
          "Date": "2023-09-29T21:02:16.000Z",
          "Titre": "Reliable product for the money",
          "Contenu": "The product performs on par with similar products by other companies"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lou Anne Cooper",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T19:39:24.000Z",
          "Titre": "safer",
          "Contenu": "Was easy to install and not to expensive"
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Dianne Adams",
          "Nb_Reviews": 6,
          "Date": "2023-10-06T03:13:48.000Z",
          "Titre": "I thought this was free",
          "Contenu": "I thought this was free - turns out it wasn't.However if it does what it says it does, then it's money well spent"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Gordon Jensen",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T17:32:10.000Z",
          "Titre": "Ad blocker doesn't block all adverts."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T20:39:23.000Z",
          "Titre": "good interface simple to use",
          "Contenu": "good interface easy to useeffective product"
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Philomena Manga",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T01:20:55.000Z",
          "Titre": "I Am very sorry for being late' I Just…",
          "Contenu": "I Am very sorry for being late' I Just arrived home thank you  P Manga"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Don",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T17:29:12.000Z",
          "Titre": "To many add on suggestions",
          "Contenu": "To many add on suggestions. I would rather a total price no sales pressure."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mrs Maureen Mills",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T15:34:06.000Z",
          "Titre": "All good",
          "Contenu": "All good, apart from the 'extras' that you asked for."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Blake",
          "Nb_Reviews": 2,
          "Date": "2023-11-12T01:06:20.000Z",
          "Titre": "Good reputation",
          "Contenu": "Good reputation.  Easy to install."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Jitendra Bhatt",
          "Nb_Reviews": 20,
          "Date": "2023-11-07T12:56:47.000Z",
          "Titre": "Issue resolved",
          "Contenu": "Had some issues, took some times but was resolved. Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sandra L Mount",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T10:10:03.000Z",
          "Titre": "Quick and VERY easy to set up.",
          "Contenu": "Quick and VERY easy to set up.Excellent price point."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "terrylynngo",
          "Nb_Reviews": 4,
          "Date": "2023-12-21T14:57:01.000Z",
          "Titre": "OMG!!",
          "Contenu": "OMG!!! Using the internet without ads is a little piece of Heaven. I actually gets things done online without all the annoying ads that always pop up. I recommend to everyone to install TotalAV. Besides Total Adblock, the entire TotalAV package is the most wonderful Security, cleaner, etc., has all my devices covered."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mrs Christine Fogden",
          "Nb_Reviews": 16,
          "Date": "2023-12-21T19:10:21.000Z",
          "Titre": "Total AV is fantastic",
          "Contenu": "Total AV is fantastic. For years I was with McAfee but very dissatisfied with their. I cancelled my annual subscriptionin favour and yet they keep e-mailing me saying my subscription has expired, which they are fully aware of."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ryan Campbll",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T01:37:57.000Z",
          "Titre": "Easy to use, Low maintenence, Great price",
          "Contenu": "Easy to use, works in the backround with little interference on your day--to day, used to be with Avast but the pop-ups were annoying, to be honest I forgot i had it installed which, to me, is the hallmark of a great antivirus. Love it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lamarr Wilson",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T01:58:13.000Z",
          "Titre": "Initiall trouble networking system",
          "Contenu": "Initially I had some trouble getting my PC, LapTop and smart phone (Android) all connected, initiated and synced.  Once I got all of that together, the system works like a charm."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T21:52:10.000Z",
          "Titre": "Easy to download and add to phone and…",
          "Contenu": "Easy to download and add to phone and computer. Scans quickly and easy to see what it scanned and delete junk files. Also was great to scan duplicate, bad and screen shots on the phone so that I felt comfortable deleting unnecessary ones. So far seems like a much easier and less annoying program than Norton or Kaspersky"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wanda",
          "Nb_Reviews": 8,
          "Date": "2023-12-20T00:26:20.000Z",
          "Titre": "It's important to have",
          "Contenu": "It's important to have.  It couldn't be easier to install/download.  The system will help keep my laptop running well and not spitting out junk and infecting my friends' systems."
        },
        {
          "Note": 5,
          "Lieu": "MT",
          "Pseudo": "David Camilleri",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T20:49:21.000Z",
          "Titre": "It looks superb to use",
          "Contenu": "It looks promising and fast as a browser. It´s easy and friendly to use. I am still discovering this new browser and I am hoping it will be a successful and interesting journey."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Khadijah Atkins",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T19:49:23.000Z",
          "Titre": "1st Things, 1st!",
          "Contenu": "My brother works in IT so when I don't know I ask him. My PC has been running a little strange and so I asked him what to do and the 1st thing he said was \"if you don't have AV on you system download it 1st, run a scan, then reboot. From there let me know if you have anymore issues.\" Well that's what I did, and AV found the viruse cleaned it up alone with a lot of trash and now my PC is back to normal. Thank you soooo much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary W.",
          "Nb_Reviews": 4,
          "Date": "2023-12-17T10:33:23.000Z",
          "Titre": "TOTALAV is the best protection I've ever used .",
          "Contenu": "The process is completely explained in easy language! It was easy to set up, & started working immediately. Only took about a minute to complete! I've used it on another computer & have always been impressed!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Des",
          "Nb_Reviews": 7,
          "Date": "2023-12-20T07:23:09.000Z",
          "Titre": "Excellent product",
          "Contenu": "Excellent product, I always feel protected. I have been using this product for some time now and have never had any issues related to online security."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Beverly Melton",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T23:51:43.000Z",
          "Titre": "TOTAL AV is safety first, when it comes to setting up technology.",
          "Contenu": "This computer has been offline for five years and I just had it setup today so it could be utilized. The TOTAL AV program was an added bonus as it has given me confidence that it will safe to use as it ran through all the files and found items that needed to be removed and did so. Thank you TOTAL AV for easing my mind in regard to safety for an 80 year old female.dence that"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Madjibaye Nataroum",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T02:58:34.000Z",
          "Titre": "Very Good Antivirus",
          "Contenu": "Wow, my computer was very slow. When I checked my antivirus TotalAV was expired. I just renewed it. and one click and everything back to normal. That was amusing..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lizz",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T04:07:57.000Z",
          "Titre": "It's very thorough and it's easy to use.",
          "Contenu": "It's very thorough and it's easy to use. Once you install it, it knows what to do and requires very little input from the user. It asked if I wanted to scan for junk files and then if I wanted to remove them once it found them. It's great for people like me who like the computer but don't know much about what runs in the background."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Myers",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T09:11:18.000Z",
          "Titre": "PC Professionals stand by your product",
          "Contenu": "I was told by a local computer store that your anti virus was the best in their opinion. When I saw the deal you were offering online I said I couldn't turn it down."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Burnham",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T16:13:49.000Z",
          "Titre": "Total AV makes me feel much safer using…",
          "Contenu": "Total AV makes me feel much safer using the applications on my Desktop PC. I can run a Smart Scan to check for any security breaches, or spyware on my Desktop PC, Michael from Greensboro, NC."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rams",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T15:06:29.000Z",
          "Titre": "Great protection and deals",
          "Contenu": "I have had a great experience and feel that my personal information is protected at all times. The application is simple to use and works well in the background, the additional services and low rates make it an ideal one stop \"it protection\" shop. Billing information is accurate and clear. Real time support. Keep it up!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "A I Norton",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T17:44:09.000Z",
          "Titre": "New user…",
          "Contenu": "Had no real chance to judge the use of the system.The download was rather complicated and it was not known there was a charge until the download was complete. Thought I would try instead of Kaspersky."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CH McCutcheon",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T02:44:16.000Z",
          "Titre": "Always has your back",
          "Contenu": "I know that my computer is protected and optimized when it runs a cleanup function. I know I'm protected from internet crap and bad sites, because the program will pop up a warning."
        },
        {
          "Note": 5,
          "Lieu": "PR",
          "Pseudo": "Betsy E Burgos Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T16:09:31.000Z",
          "Titre": "THE COMPUTER HAS TO BE PROTECTED AGAINST ANY TYPE OF MALWARE.",
          "Contenu": "HAVING MY LAPTOP PROTECTED AGAINST MALWARE AND ITS PRICE. OTHERWISE, I COULD NOT AFFORD IT!THANK YOU VERY MUCH."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "I Byrne",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T13:31:13.000Z",
          "Titre": "Light touch security",
          "Contenu": "Does the job of keeping me and my files safe online without bombarding me with messages and ads for features i don't have - a relief after my experience with Norton"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DB",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T19:01:43.000Z",
          "Titre": "Works as it should",
          "Contenu": "Works as it should. Blocks a lot of unwanted tracking and potentially unsafe items."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "H Roberts",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T19:00:47.000Z",
          "Titre": "Reminders but not overly insistent --…",
          "Contenu": "Reminders but not overly insistent -- hits that sweet spot for me.  So far working great!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Thaver Mohammed",
          "Nb_Reviews": 16,
          "Date": "2023-12-21T17:46:04.000Z",
          "Titre": "Simple but EFFECTIVE !!!",
          "Contenu": "I was getting messed round with different websites and so called discounts.AV = SIMPLE !!£29.99 and I got the LOT !!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandra Kennedy",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T13:45:14.000Z",
          "Titre": "I l like not seeing ads",
          "Contenu": "I l like not seeing ads, but your ad for Total AV was annoying when it expired.  That is the only reason I finally renewsd after seeing it pop up for over a year.  Also when completing the $19.00 it kept asking me to spend more money.  Otherwise, good to have.  Why not check out our website, JW.ORG.  Thanks."
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Karin Millar",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T14:18:48.000Z",
          "Titre": "That my Pc is clean from intruders and bugs",
          "Contenu": "Sorry, but I am not so good at this! I was looking for some help to what I need to protect my PC with. Have a note coming up all the time, telling me that an USB has something wrong or do not work ok. Do not have an USB! It has going on for a few weeks. Have also mails from other company that tells me I have a lot of problems with my PC and a lot of viruses.  What to do? Please help! I scan with your Total Av and it looks perfect. I am confused over this."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "WB",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T02:25:08.000Z",
          "Titre": "Ease of use",
          "Contenu": "Ease of use. Complete identification of threats with ability to remove them quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sheri Clark",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T08:50:03.000Z",
          "Titre": "The assistant Adam Mitchell promptly…",
          "Contenu": "The assistant Adam Mitchell promptly took care of my problem no problems no questions asked compensated me and fixed it all very kind and I very much appreciate it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 5,
          "Date": "2023-12-18T16:56:05.000Z",
          "Titre": "I am a newby",
          "Contenu": "I am a newby, had a little problem getting my sign in but the program appears to check my PC for evrything!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jennifer Collings",
          "Nb_Reviews": 4,
          "Date": "2023-12-19T12:00:37.000Z",
          "Titre": "Simple to install and pay",
          "Contenu": "Simple to install and pay.  No instruction on how to add to additional devises though."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lac Van Tran",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T12:08:34.000Z",
          "Titre": "Awesome",
          "Contenu": "Awesome! After installing the TOTALAV software, it scanned and removed all the junk files in my laptop very fast. Now, my laptop is running faster than as before."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jimmie Woolly",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T21:32:34.000Z",
          "Titre": "this was easy",
          "Contenu": "this was easy to buy and download and the fact it can be canceled anytime is good."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "John Martin",
          "Nb_Reviews": 5,
          "Date": "2023-12-20T23:18:08.000Z",
          "Titre": "So far so good",
          "Contenu": "Showed how much I needed to remove to get my pc in a better order. It had so much that it was slowing it down. Money well spent"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ron Johnson",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T00:00:07.000Z",
          "Titre": "Lottery Tickets",
          "Contenu": "At first I said NO. Then after listening to the Rep I saw that this program is better than Norton so I bought it at a hella good price! A good deal it was."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Henry Madia",
          "Nb_Reviews": 3,
          "Date": "2023-12-14T21:40:36.000Z",
          "Titre": "First time user",
          "Contenu": "Just downloaded and began to use TOTALav for my protection.  I've loaded it on 2 windows 10 machines and 1 android device.  So far, it works as expected.  Is easy to use and has all the features I was looking for."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Lorraine Addy",
          "Nb_Reviews": 5,
          "Date": "2023-12-19T17:02:46.000Z",
          "Titre": "does exactly what Total AV should do",
          "Contenu": "does exactly what Total AV should do. Keep you safe while using the www. Plus deletes unwanted files, spam etc..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Kaleta",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T22:25:07.000Z",
          "Titre": "found everything that was causing…",
          "Contenu": "found everything that was causing problems on my desktop!. Cant wait to download it on my mobile device"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas R Evans",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T02:07:33.000Z",
          "Titre": "Prior experience with Total AV and…",
          "Contenu": "Prior experience with Total AV and intro pricing attractive.  Recent fraud occurrence prompted us to cover our PC"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Colin Gray",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T07:15:07.000Z",
          "Titre": "Easy to follow and setup",
          "Contenu": "Disatisfied with so many other security services.I can only hope TOTAL AV will be there for my needs."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Mt Dajao",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T16:01:52.000Z",
          "Titre": "I trusted this company and feels like…",
          "Contenu": "I trusted this company and feels like my laptop/computer is safe..."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "No",
          "Nb_Reviews": 14,
          "Date": "2023-12-16T14:34:40.000Z",
          "Titre": "Great Protection",
          "Contenu": "I have tried numerous security software to protect my computers and phones, none have come up to standard to give me the protection I need.  I have experienced hackers taking  information from my computer a couple of times, it is frightening.  TotalAV antivirus software is the only software to protect personal and sensitive information. I highly recommend their software if you are dealing with finances online."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Colin White",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T09:13:09.000Z",
          "Titre": "Reinstalling the software is easy and…",
          "Contenu": "Reinstalling the software is easy and runing well CW."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ken",
          "Nb_Reviews": 7,
          "Date": "2023-12-17T06:53:29.000Z",
          "Titre": "For one dollar",
          "Contenu": "For one dollar, I can cover my new computer unyil I can transfer my progtam.   sorry for the spelling.."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan Milioni",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T21:40:46.000Z",
          "Titre": "Very Good and easy",
          "Contenu": "Very Good and easy. It truly does remove everything. I love it and would definitely recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patricia A Turner-Brown",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T17:28:45.000Z",
          "Titre": "Total AV has worked well on my Laptop",
          "Contenu": "Total AV has worked well on my computer. It keeps me aware and up to date on any potential virus attacks that may pop up. I am satisfied with the service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TM",
          "Nb_Reviews": 7,
          "Date": "2023-12-21T16:06:24.000Z",
          "Titre": "I trust the security you provide from…",
          "Contenu": "I trust the security you provide from being  scamed'"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Prem Vaishnava",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T23:09:06.000Z",
          "Titre": "The company did a good job cleaning…",
          "Contenu": "The company did a good job cleaning junk and unnecessary files occupying2023 more than 3GB space."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ray Weber",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T23:23:42.000Z",
          "Titre": "Total AV was recommended by two IT…",
          "Contenu": "Total AV was recommended by two IT friends & Kim Komando.It is very easy to install and easy to use"
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Mohammed Ramzi",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T06:55:02.000Z",
          "Titre": "great  remove all virus attach my pc…",
          "Contenu": "great  remove all virus attach my pc easly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Opal S, Pepiton",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T22:28:49.000Z",
          "Titre": "It was not that great and I wish that I…",
          "Contenu": "It was not that great and I wish that I understood more of the language you use."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Alfred J Young",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T21:23:30.000Z",
          "Titre": "I've dealt with Total AV previously and…",
          "Contenu": "I've dealt with Total AV previously and have been total satisfied with the quality of their product and the effectiveness of their product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patricia Seabaugh",
          "Nb_Reviews": 6,
          "Date": "2023-12-18T06:11:00.000Z",
          "Titre": "Confused",
          "Contenu": "I just got it so I don't know how I'm going to like it. I paid for a year and everything I go into says its 7.99 a month. confusing as hell. Don't know what I paid for in my one year? it should be all the stuff that comes up."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Defrancesco",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T01:59:53.000Z",
          "Titre": "This is the first time I am using Total…",
          "Contenu": "This is the first time I am using Total Security.I hope it is as good as it claims!I'll let you know!!!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "tony jabbour",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T10:34:12.000Z",
          "Titre": "i used to use mcafee and i wasn't happy…",
          "Contenu": "i used to use mcafee and i wasn't happy with them,since i changed to totalAV,I STOPPED having any issues."
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "manos",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T06:12:15.000Z",
          "Titre": "my experiance i ver good very strong…",
          "Contenu": "my experiance i ver good very strong and very good antivirus"
        },
        {
          "Note": 5,
          "Lieu": "MK",
          "Pseudo": "ss",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T12:57:02.000Z",
          "Titre": "bro this isnt even 5 stars",
          "Contenu": "bro this isnt even 5 stars, it should be 15 stars. this is the best antivirus i have ever had. proud of whoever made this."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leah Darleen Strid",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T03:39:40.000Z",
          "Titre": "Fast download",
          "Contenu": "Fast download - I have used this product before and was always happy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Albert Saddler",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T05:57:00.000Z",
          "Titre": "There was an issue with malware TotalAV…",
          "Contenu": "There was an issue with malware TotalAV resolved it right away!                THANK U! and your TEAM"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas Edmond",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T16:09:07.000Z",
          "Titre": "The application ran quickly and…",
          "Contenu": "The application ran quickly and reported status of PC in an easily understood format."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angelika Williams",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T21:38:57.000Z",
          "Titre": "it thoroughly cleaned my pc and im very…",
          "Contenu": "it thoroughly cleaned my pc and im very satisfied."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Steve",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T10:02:11.000Z",
          "Titre": "Easy to use unlike other anti virus…",
          "Contenu": "Easy to use unlike other anti virus software"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Laforge",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T03:56:42.000Z",
          "Titre": "I believe Total AV is a complete…",
          "Contenu": "I believe Total AV is a complete application to protect my PC from Hacker's and Scammers."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "koysur miah",
          "Nb_Reviews": 6,
          "Date": "2023-12-21T19:19:49.000Z",
          "Titre": "easy to use",
          "Contenu": "easy to use, price is reasonable"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "GMT",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T18:13:10.000Z",
          "Titre": "Really easy to download",
          "Contenu": "Really easy to download.  Scanned quickly. Gave details of what was found and suggestions for what to do."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debra Parsons",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T22:59:39.000Z",
          "Titre": "no problems with viruses while using"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jack A. Harbour",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T00:09:59.000Z",
          "Titre": "new user",
          "Contenu": "Read the recommendations and added AV for my computer protection.  Hope it works as advertised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer Keierleber",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T21:02:41.000Z",
          "Titre": "Its nice to know my device is protected",
          "Contenu": "easy to use and happy to be protected at such a great price."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Keith Hobbs",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T08:15:24.000Z",
          "Titre": "A thoroughly safe and secure programme",
          "Contenu": "Simple and efficient to install and use."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Penelope Wadsworth",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T16:31:11.000Z",
          "Titre": "Quick and easy to do and the reasonable…",
          "Contenu": "Quick and easy to do and the reasonable cost"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "robert young",
          "Nb_Reviews": 5,
          "Date": "2023-12-20T23:49:21.000Z",
          "Titre": "good",
          "Contenu": "got it off internet"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T04:51:25.000Z",
          "Titre": "download took time",
          "Contenu": "once it was loaded it worked fine. getting it downloaded was confusing and took quite awhile. I'm happy with it now. Once it was downloaded it was fine."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Behbazhi",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T16:37:33.000Z",
          "Titre": "confidence to get on my computer"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lee Nguyen",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T03:04:21.000Z",
          "Titre": "Best virus app in the business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cindy B",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T22:15:33.000Z",
          "Titre": "Good virus protection",
          "Contenu": "Easy to activate and access."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim McFadyen",
          "Nb_Reviews": 4,
          "Date": "2023-12-18T20:04:45.000Z",
          "Titre": "Very easy experience",
          "Contenu": "Very easy experience. So far so good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brayden Maultsby",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T20:54:53.000Z",
          "Titre": "It was very helpful, and helped me complete my goal quick and easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chuck Miller",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T18:26:56.000Z",
          "Titre": "Great System To Have installed on your computer",
          "Contenu": "Keeps me safe and protected 24/7"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Manuel Fraywashington",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T15:37:27.000Z",
          "Titre": "safe all my electronic"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bruce E Fritz`",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T13:46:34.000Z",
          "Titre": "Was positive experience to date so far…",
          "Contenu": "Was positive experience to date so far i am happy"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Tony Riedle",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T06:17:26.000Z",
          "Titre": "Easy to install and a fast scanning and…",
          "Contenu": "Easy to install and a fast scanning and cleanup."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Steve Day",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T11:00:17.000Z",
          "Titre": "Good reviews",
          "Contenu": "Good reviews, good price and easy to purchase"
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Esteban",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T16:51:23.000Z",
          "Titre": "smooth experience",
          "Contenu": "Straightforward application, no ads, no constant requests to buy additional functionalities such as with other competitive softwares"
        },
        {
          "Note": 5,
          "Lieu": "CR",
          "Pseudo": "Cesar Ramirez Soto",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T02:33:15.000Z",
          "Titre": "great software"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nancy",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T17:47:52.000Z",
          "Titre": "Easy",
          "Contenu": "Easy, helpful"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Sue Hampton",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T21:51:19.000Z",
          "Titre": "proof of the pudding !",
          "Contenu": "Can't say anything more other than...........EASY to install."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Jovelle",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T19:37:51.000Z",
          "Titre": "This app protected my computer really…",
          "Contenu": "This app protected my computer really well"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brent Pastor",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T22:43:56.000Z",
          "Titre": "Easy to download and understand."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Veronica",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T05:17:58.000Z",
          "Titre": "TotalAV",
          "Contenu": "Helpful and easy to navigate"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alexander Roop",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T22:00:15.000Z",
          "Titre": "makes cleaning up forgotten files easier"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "D.loosemsn.com",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T21:38:55.000Z",
          "Titre": "Need more time to really evaluate",
          "Contenu": "Need more time to really evaluate the program"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Ian Spence",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T17:21:14.000Z",
          "Titre": "Simple to use",
          "Contenu": "Simple to use. Thorough detection and removal of malware."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Horatio A Millin",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T19:06:37.000Z",
          "Titre": "Comprehensiveness and ease of use of…",
          "Contenu": "Comprehensiveness and ease of use of program."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Michael Thomas Myton",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T14:30:22.000Z",
          "Titre": "perfect all rounder"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joyce L Spalding",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T01:17:06.000Z",
          "Titre": "it's easy",
          "Contenu": "It's easy to do and the cost is reasonable"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sammy Lee Holt, SR.",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T15:50:48.000Z",
          "Titre": "WELL SO FAR",
          "Contenu": "WELL SO FAR, NO PROBLEMS."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ROBERT SMITH",
          "Nb_Reviews": 5,
          "Date": "2023-12-20T15:13:36.000Z",
          "Titre": "Ease of download,2023"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Stuart Rees",
          "Nb_Reviews": 9,
          "Date": "2023-12-21T11:28:17.000Z",
          "Titre": "Easy to download to all my devices."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mrs K",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T18:35:30.000Z",
          "Titre": "It was easy and affordable."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Sujak Rahman",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T03:06:52.000Z",
          "Titre": "What a Wonderful world",
          "Contenu": "safe and security, led it be"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Diane Melnick",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T17:07:51.000Z",
          "Titre": "It is supposed to get rid of popups",
          "Contenu": "It is supposed to get rid of popups, and I guess it does."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Gemma F Buse",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T02:58:21.000Z",
          "Titre": "very efficient with the install and…",
          "Contenu": "very efficient with the install and download"
        }
      ]
    }
  ]
}