{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "treblab.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard G",
          "Nb_Reviews": 3,
          "Date": "2023-12-13T04:06:38.000Z",
          "Titre": "I purchased 2 cords and they both do…",
          "Contenu": "I purchased 2 cords and they both do not fit my speaker. I was quite disappointed when I went to plug it in to charge, it was the wrong one. I bought the HD 77 speaker. These are the ones I need. Thanks"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dee",
          "Nb_Reviews": 1,
          "Date": "2022-07-21T21:54:12.000Z",
          "Titre": "Didn't Receive what I ordered",
          "Contenu": "I ordered 2 packages equaling 6 pairs eartips  for XPRO 3 earbuds. I received a total of 4 pr tips + 2 wire holders for wired earbuds. 3 emails + pics later issue is not resolved. Recvd 2 identical responses from support both at 2:01am that didn't address my complaint, just \"hate to bother you...would love to hear how it's going...\" Now I'm waiting for a call back from support to resolve issue"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Justin",
          "Nb_Reviews": 1,
          "Date": "2021-07-30T20:14:39.000Z",
          "Titre": "X3 Pro",
          "Contenu": "I ordered the x3 pro earbuds not long ago. The audio is decent enough, so I'd probably rate them highly, if they didn't independently power off every 5-10 minutes. I've gone through the factory reset tips, powered off and back on before connecting to my phone... nothing seems to remedy this issue.I originally wrote a second review here after receiving a replacement pair of earbuds, as the issue mentioned above did not happen with them on first use. Upon using them a second time, the issue returned in full. Seeing as the only response to support ticket is to ship yet another pair of earbuds, I can only advise AGAINST the X3 pro."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Fernando Quirindongo",
          "Nb_Reviews": 2,
          "Date": "2022-02-28T21:47:52.000Z",
          "Titre": "Apparently the unit received where…",
          "Contenu": "Apparently the unit received where defective, a replacement was shipped to the wrong address. It has taken some time since my complaint (several weeks) and still don’t have a good working Treblab X5. A total disappointment because I really like Treblab."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Matt Weber",
          "Nb_Reviews": 1,
          "Date": "2022-07-05T15:03:03.000Z",
          "Titre": "Need to change my review",
          "Contenu": "I gave a poor review concerning treblab customer service. It turns out that my emails were a mess and much of the issue was on my end. Once I got those issues resolved the return went smoothly. I did apologize for my poor review."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dan  Zerby",
          "Nb_Reviews": 2,
          "Date": "2022-06-15T14:59:37.000Z",
          "Titre": "Overall",
          "Contenu": "Overall, not happy with delivery experience or product.  Item did NOT arrive as promised.  Got one email saying I would have today, but never showed.  Next email from company stated it will arrive on a date that was PRIOR to their own email.  Totally disappointed.  The product itself is just OK.  It has too much treble and not enough base.  Sound quality not what I was used to with my other brand.  Will not go through hassle to return, but will order my original brand next time, since the quality of sound is MUCH BETTER!  Sorry Treblab, but not a fan!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Laura",
          "Nb_Reviews": 1,
          "Date": "2022-09-09T18:50:13.000Z",
          "Titre": "AWFUL CUSTOMER SERVICE/COMPANY",
          "Contenu": "Not happy with customer service!  Bought a HD Max speaker a little over a year ago and now am unable to charge.  I'm assuming because the port is on the bottom of the speaker, it will wear out and be problematic.  Anyway....Trying to communicate to Treblab that I want to have it repaired (at my cost) is proving to be a chore.  I'm a week in to emails to be told that the warranty is expired (no kidding) and they will give me a 15% discount for another purchase.  I truly LOVE this speaker and was just trying to get it repaired.  The customer service has been just awful! UPDATE....Now customer service said they do NOT Repair their own products.  I will NEVER recommend or buy anything from Treblab!!!!  $200 for a speaker that I used for a little more than a year.....NOPE"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gentry C",
          "Nb_Reviews": 1,
          "Date": "2022-03-01T13:05:31.000Z",
          "Titre": "Connectivity issues.",
          "Contenu": "Every time I put these things on It only connects to one OR the other earbuds. I’ve tried to reset numerous times but but this keep happening. Sucks cause the sound quality is amidst the best."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Laura Kay",
          "Nb_Reviews": 2,
          "Date": "2023-03-27T22:13:34.000Z",
          "Titre": "Absolutely LOVED my HD Max speaker",
          "Contenu": "Absolutely LOVED my HD Max speaker.  Sounded great and worked perfectly UNTIL it wouldn't charge any more.  The charging port is at the bottom of the speaker and apparently very fragile.  Had this speaker for just over a year.  Now I own a BRICK.  Spoke with customer service to try to have repaired (at my cost) and was told that they could not repair but they would be happy to give me a discount on a new speaker.  I don't know about anyone else but I don't appreciate spending close to $200.00 for a speaker that works for just over 1 year.  EVEN IF I decided to buy a new one, how long would it last and would I be in the same boat with the charger.  I am very disappointed with Treblab.  I will go with another company that can stand behind their product and be able to fix it if it goes bad. I DO NOT recommend this speaker."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "james brailey",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T15:53:01.000Z",
          "Titre": "Took four weeks to arrive",
          "Contenu": "Took four weeks to arrive, when it did focus adjuster was broken off and customer service was no help."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Darren Angulski",
          "Nb_Reviews": 1,
          "Date": "2021-06-08T16:09:02.000Z",
          "Titre": "Speaker will only operate for 5 hours…",
          "Contenu": "Speaker will only operate for 5 hours max at medium volume. Speaker will disconnect for no reason also shows multiple colors and no explanation in instructions what the different colors mean. Speaker sounds good when working. Dislike Speaker immensely."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeffrey  Rivera",
          "Nb_Reviews": 1,
          "Date": "2022-06-20T16:10:53.000Z",
          "Titre": "I love the earbuds but the charging…",
          "Contenu": "I love the earbuds but the charging case went out literally after one week of use. It's the second one that's done this to me and now i have 2 useless sets of earbuds i can't charge."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jon Gindick",
          "Nb_Reviews": 5,
          "Date": "2022-09-14T04:09:42.000Z",
          "Titre": "Nobody's home!",
          "Contenu": "After sending me wrong charging cable for Treblab 77 speaker, they wrote me a note saying they had “reached out” to try to resolve the mix-up but they never sent the e-mail or text These reviews appear to be the only way to communicate with Treblab."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "james talbot",
          "Nb_Reviews": 2,
          "Date": "2022-04-08T13:31:07.000Z",
          "Titre": "ordered a charging cable for my TREBLAB…",
          "Contenu": "ordered a charging cable for my TREBLAB HD77 got a 5 inch cable that does NOT fit! I am pleased you wish to resolve the problem. If you would be so kind as to send me a charging cable that will fit my HD77, I will gladly revise my review to a five star rating. Thank you!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Jackie",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T18:50:00.000Z",
          "Titre": "Ordered a month ago",
          "Contenu": "Ordered a month ago, still haven't received my product.  Went to cancel my order and still haven't heard back from them in over a week.  Will be never dealing this company again"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jon Gindick",
          "Nb_Reviews": 5,
          "Date": "2022-09-12T17:01:43.000Z",
          "Titre": "Bogus charging cables from Trelab.",
          "Contenu": "From your website, I ordered two charging cables for my Trelab blue tooth speaker. None fit into the charging port. Bogus!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "SCOTT SOMMERFELD",
          "Nb_Reviews": 1,
          "Date": "2022-07-09T16:59:46.000Z",
          "Titre": "They advertise a white X3 Pro and then…",
          "Contenu": "They advertise a white X3 Pro and then say the white is only the logo.Lousy communication"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scott Stevens",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T22:34:50.000Z",
          "Titre": "Hasn't Shipped",
          "Contenu": "I ordered TREBLAB WX8 earbuds on 05 March 2023. It is now 20 March 2023 and my order hasn't shipped."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Joanne Papadopoulos",
          "Nb_Reviews": 1,
          "Date": "2022-11-28T17:27:35.000Z",
          "Titre": "No estimated time for delivery and $13…",
          "Contenu": "No estimated time for delivery and $13 delivery charge for a $6 item."
        },
        {
          "Note": 1,
          "Lieu": "SG",
          "Pseudo": "Kevin Chu",
          "Nb_Reviews": 1,
          "Date": "2022-08-30T02:33:43.000Z",
          "Titre": "Item taking too long to arrive"
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "AAron Barreras",
          "Nb_Reviews": 1,
          "Date": "2021-11-10T23:01:52.000Z",
          "Titre": "right side not working in only 2 months"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scott Halliburton",
          "Nb_Reviews": 1,
          "Date": "2022-09-07T00:47:50.000Z",
          "Titre": "You sent me the wrong charging cord"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Gregory Leahy",
          "Nb_Reviews": 1,
          "Date": "2021-09-09T14:16:59.000Z",
          "Titre": "I still haven’t received them yet!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "William Coney",
          "Nb_Reviews": 5,
          "Date": "2023-10-19T17:27:18.000Z",
          "Titre": "Searched for charging cable for HD77",
          "Contenu": "Searched for charging cable for HD77. Ordered the only  one that popped up. Doesn’t fit. Would have thought the correct charging cable would have been available to purchase."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2022-02-12T18:43:28.000Z",
          "Titre": "Connection issues.",
          "Contenu": "These headphones are very comfortable but have a connection problem. They disconnect often and the power turns itself off at times. Sorry I bought them."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Den Haynes",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T05:41:24.000Z",
          "Titre": "Treblabx3 blue tooth connects for left…",
          "Contenu": "Treblabx3 blue tooth connects for left side or right side, but not both. I did reset the pair as the instruction say. iPhone 11 Pro. Can not listen to both ears. Tried for over a day.  This isn’t making any sense why you would even set the software to separately program left or right side."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Lily Hewitt",
          "Nb_Reviews": 1,
          "Date": "2022-04-05T00:40:12.000Z",
          "Titre": "Just got my headphones two days ago and…",
          "Contenu": "Just got my headphones two days ago and are already making strange noises, similar to a record skipping. However they are comfortable."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Angie Baby in Baltimore",
          "Nb_Reviews": 1,
          "Date": "2022-04-11T13:48:31.000Z",
          "Titre": "Treblab Earphones",
          "Contenu": "Very unhappy with this purchase. With my cell phone volume on max, the volume coming from the headphones are low.  Do not buy these."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "errico",
          "Nb_Reviews": 1,
          "Date": "2022-01-08T07:14:37.000Z",
          "Titre": "Lacks an app interface",
          "Contenu": "Lacks an app interface.  Connection to the left earbud occasionally dropped."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 5,
          "Date": "2023-12-08T21:36:50.000Z",
          "Titre": "The headset audio is fine, the controls ...",
          "Contenu": "The headset audio is fine. The new touch controls are iffy at best. They need more work. Plus, the touch controls should be described in the manual. They are not."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark Hinkel",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T15:56:26.000Z",
          "Titre": "service \"so far\"",
          "Contenu": "service \"so far\", has been great. Unfortunately the product purchased has been sub-par for is sound quality compared to the previous Treblab XR500 I've owned for several years now."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Bookish from L,hhardt",
          "Nb_Reviews": 4,
          "Date": "2023-01-20T22:34:31.000Z",
          "Titre": "Trelab needs to better program  their…",
          "Contenu": "Trelab need to better program  their robots. This was my second reminder in a couple of days and I have yet to receive the item. Fix up your algorithm so you don’t aggravate customers"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anthony Edwards",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T14:47:07.000Z",
          "Titre": "There is no after purchase service",
          "Contenu": "There is no after purchase service.  After many attempts get Z2 headphones repaired - I was finally told there are no spare parts to be purchased even if requested.  No ear pads.  and no clip for the headliner.This is close to a scam as it relates to after sale support.  There is none"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cristy Johnson",
          "Nb_Reviews": 1,
          "Date": "2022-06-24T11:55:40.000Z",
          "Titre": "Products were great but it wasn’t…",
          "Contenu": "Products were great but it wasn’t explained that if you bought twoDifferent models they would not sync together"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul Foster",
          "Nb_Reviews": 2,
          "Date": "2021-08-18T14:20:45.000Z",
          "Titre": "Product Disappointing, but customer service excellent",
          "Contenu": "As an update to my review below, I was contacted by Treblab customer service who were very good and helpful, and were able to issue me a refund. A special thanks to Ksenia!I have had the Treblab X2 for years and loved it. The fit is good and they are comfortable, and the sound is very good, so when I wanted a 2nd pair of buds, I ordered a pair of the X5's. I made the mistake of getting them directly from Treblab (rather than Amazon) for the 10% discount, and was disappointed as soon as they arrived. The fit and comfort were just \"so so\" and the sound is completely lacking in bass. To make matters worse, after about 1 week they stopped working. My phone showed them to be connected and the music showed it was playing, but there was absolutely no sound coming from the buds. I contacted Treblab    and the only option I was given was to send them back and once they received them, they would send a new pair, i.e., there was no return for refund option as I would have had with Amazon. And just as an aside, I mailed them back 6 days agona nd haven't heard a word back."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "gary watson",
          "Nb_Reviews": 3,
          "Date": "2021-12-03T14:39:15.000Z",
          "Titre": "The experience was ok",
          "Contenu": "The experience was ok. But sent wrong item. They were veryquick to fix but as of yet have not received correct one.Will updateafter that."
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "Kevin Medina Gomez",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T18:15:44.000Z",
          "Titre": "I suggest using a different delivery…",
          "Contenu": "I suggest using a different delivery post service, at least for Mexican destinations. For instance, Estafeta is far more efficient than Mexican post office."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "FRANK MASCOLA",
          "Nb_Reviews": 2,
          "Date": "2022-05-20T04:07:51.000Z",
          "Titre": "Works great in my right ear",
          "Contenu": "Works great in my right ear. I get no sound at all in my left. I tried to email mail twice. This is the only communication I received"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Peter Warner",
          "Nb_Reviews": 4,
          "Date": "2021-11-03T17:38:35.000Z",
          "Titre": "I purchased two bluetooth audio…",
          "Contenu": "I purchased two bluetooth audio headsets recently: N8 ear buds, and Z2 headphones.  The former arrived with instructions for use, whereas the Z2 had no instructions included (an empty disc pocket in the case for ???).  I had to spend lots of time fitting the N8 ear buds, and after trying all combinations of the bud covers and the ear hooks, one ear bud still does not fit well -- I really don't see how these would stay lodged in ears when someone is running or exercising vigorously.  Once I learned the controls on the headphones, they've worked fine (when they stay connected to the audio source*) and are comfortable, although without instructions I learned that the on-off button is not associated with the control for a bluetooth connection, and I've had to re-charge a few times following short periods of use (2 hours).  *Another issue is that both earbuds and headphones shut down during use - initially connected fine with computer sound source, but then mysteriously I hear \"power off.\"  Some of these issues may be associated with operator unfamiliarity or error, all the more reason why clear, written instructions for use are an important feature that have become an afterthought with many electronic devices of late, a complaint I've heard from others about purchased products lacking sufficient instructions and trouble-shooting information."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "FRANK MASCOLA",
          "Nb_Reviews": 2,
          "Date": "2022-05-19T19:51:45.000Z",
          "Titre": "I can not  hear out of the left ear…",
          "Contenu": "I can not  hear out of the left ear pod. I have tried twice, no one has connected nor have they sent me a new one"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "R. Robinson",
          "Nb_Reviews": 3,
          "Date": "2023-09-21T17:01:33.000Z",
          "Titre": "I Have bought around six pairs of XR700…",
          "Contenu": "I Have bought around six pairs of XR700 headphones and compared to what is out there on the market they are by far the best headphones around. Keep up the good work TREBLAB!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jorge F.",
          "Nb_Reviews": 1,
          "Date": "2021-06-11T03:45:30.000Z",
          "Titre": "Quite Impressed",
          "Contenu": "Reasonably ImpressedThis speaker blasts! Amazing volume--excellent for outdoor use! Good battery life.Shipped promptly. It is built quite sturdily, durable materials--The carrying strap is handy. Sound quality? Okay. I BT music with my Samsung S7. Found that in the default, sound quality is a bit muddled, with lower bass producing a rattle. However, I adjusted my equalizer and everything cleared up.Can't beat the value-comparable speakers cost $100s more."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Vincent Barbera",
          "Nb_Reviews": 8,
          "Date": "2023-01-17T17:12:06.000Z",
          "Titre": "The earphones connect easily enough",
          "Contenu": "The earphones connect easily enough, features are great (better than Apple pods) but you lose a small bit of volume.  Not a problem, but I am already hard of hearing, so i noticed it.Great fit, especially in helmets  I have tried many other premium brands, but these are the best."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Sam",
          "Nb_Reviews": 1,
          "Date": "2023-02-25T00:14:54.000Z",
          "Titre": "Very happy with these headphones over all.",
          "Contenu": "The sound quality on these are a 5/5.Comfort wise the ear pieces are very comfortable but the top padding is a little harder than I first expected but I'm sure I'll get used to them. Shipping did take about a month which was 100% okay because it was international but it was unfortunate that the tracking stopped after about 2 days so it looked like the whole time it was still in the same place.The noise cancelling is quite good, it blocked out most noises in the gym and u love how they have a water resistant rating as well as a 1 year warranty.Over all very happy with my product so far."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris N.",
          "Nb_Reviews": 6,
          "Date": "2023-08-16T21:57:34.000Z",
          "Titre": "Looks like quality equipment ...",
          "Contenu": "Looks like quality equipment and shipment was quick.This is a gift and we will find out later about how well the equipment works."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kenny",
          "Nb_Reviews": 1,
          "Date": "2021-10-02T04:04:18.000Z",
          "Titre": "Pretty great but there's one issue...",
          "Contenu": "Shipping was crazy fast for these headphones! I love everything about them except they aren't as loud as I thought they were going to be based on other reviews. My airpods are quite a bit louder than these and it's been disappointing to say the least, so I'm not sure if maybe I received a defective pair or what the deal is. BUT other than that everything else about these headphones are great. Nice bass, nice fit and they stay on when working out!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CharlesCaltagirone",
          "Nb_Reviews": 5,
          "Date": "2022-07-14T14:18:19.000Z",
          "Titre": "Lost cord which one to buy?",
          "Contenu": "I lost the charging cord for a HD77 and went on the website and ordered a new one.  However, I didn't know and wasn't told that there were 2 types of cords and the website only showed 1.  So, I ordered it and found out it was the wrong cord.  I worked with customer service on the refund and replacement - but still frustrated - could used that info up front."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Diana Meyncke",
          "Nb_Reviews": 1,
          "Date": "2021-07-06T14:48:46.000Z",
          "Titre": "My boyfriend bought me the XPro3 for me…",
          "Contenu": "My boyfriend bought me the XPro3 for me and I love them. I used them all the time the pros are the quality of sounds and the ease of use. The cons are my ears are tiny and the part that goes around the ear well for me so much less secure when performing HITT workouts or something like that. Also they stopped connecting to each other but costumer service was awesome and sent me another pair very quickly. All over love them but a few hiccups along the way."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ivan  Long",
          "Nb_Reviews": 1,
          "Date": "2021-08-19T17:45:40.000Z",
          "Titre": "I was using a different brand and lost…",
          "Contenu": "I was using a different brand and lost the charger so in shopping around and reading reviews I purchased a pair from Treblab. I spend a lot of time outdoors and ride motorcycle.  The sound is Great,  controls are handy and friendly...BUT I have big ears and they don't fit well.  I need a Headwear to hold them in place. One blew off while riding,  picked it up in the highway!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 3,
          "Date": "2022-03-29T12:26:49.000Z",
          "Titre": "X-3 Pro",
          "Contenu": "X-3 Pro Giving a 4 star because of not including a set of memory foam ear tips. I have 2 sets of XR-800 that both came with the foam as well as the silicone tips. No excuse at this price point they should be included. The foam tips make a huge difference in background noise. Other than this they sound just like the XR-800 which is great. Fit is also very good. Bluetooth range is outstanding."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris McDaniel",
          "Nb_Reviews": 2,
          "Date": "2022-03-31T03:48:55.000Z",
          "Titre": "While the headphones sound good",
          "Contenu": "While the headphones sound good, connectivity via Bluetooth isn't the greatest. It isn't synced with the phone. Sometimes only 1 earbud will sync to the phone and then i have to put them back and reset them. Not a fan to continue that process."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Connor Gordon",
          "Nb_Reviews": 1,
          "Date": "2022-03-29T09:52:19.000Z",
          "Titre": "Could be louder but still good",
          "Contenu": "Could be louder. My second generation AirPod's were louder and the sound quality was the same. I do like the noise cancellation and it being sweat-proof. The case is good quality and what you want in a headphone case."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "T Watson",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T19:20:12.000Z",
          "Titre": "Good sound quality",
          "Contenu": "Good sound quality, the ear pieces for switching to could be more comfortable like the first original set, xr100"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cliff",
          "Nb_Reviews": 1,
          "Date": "2022-06-09T16:58:36.000Z",
          "Titre": "Sound quality is great",
          "Contenu": "Sound quality is great, only issue I've had is the earbuds don't stay in during hard workouts. They'll stay in place walking or slow jogging though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 2,
          "Date": "2021-06-19T01:30:11.000Z",
          "Titre": "Good workout Buds! Sound quality is decent and wish they could be better.",
          "Contenu": "I’ve had the product for about 3 weeks now and it’s satisfactory. I was having issues in the beginning with the earbuds not linking to each other and I was about to return the product. In the process, I found instructions with trouble shooting and was able to resolve the issue. The X3 Pros do what’s advertised and stay in your ear while you workout. I’ve jumped rope and lifted weights in these and so far so good. Haven’t tested how water resistant they are and am reluctant to do so because I do t want to break them. So in that regard, I’ll have to wait and see during my cardio events. The sound quality is decently loud but not as satisfying as I’m used to. I like to listen to Rap or rock when I workout and sometimes bass is not as good. You’ll have to find that happy medium with turning up the headphones and the volume on your phone because they don’t exactly align. Voices and music could get kind of staticky or muffled which is annoying when I’m trying to get motivated with the music. Even though the music doesn’t exactly have the quality I am used to, it does get plenty loud and you could drown out your surroundings which is a plus for me. This product checks my boxes for a workout partner and I hope that future earbuds made can attain that better quality sound that I’d prefer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RajB",
          "Nb_Reviews": 1,
          "Date": "2021-08-18T01:21:36.000Z",
          "Titre": "The return policy of Treblab seems out…",
          "Contenu": "Latest UpdateTreblab contacted me immediately via email after my prior post to TrustPilot. The person who I had been contacting shared that she escalated the issue to her manager and they agreed to discount my purchase further.  I apppreciated her efforts and attention and decided to take the offer.  The agent seemed to go out of her to resolve the issue and wanted to make sure I was satisfied with the outcome despite Treblab's Return Policy.   From now on I'll be more careful buying speakers over the Internet.The return policy of Treblab seems out of sync with other leading internet shopping sites for electronics.  Specifically, the day I received my speaker, I contacted customer service to ask how to return it because it was too big and did not sound as good as I expected.  There is no way to know this until after the speaker is received an listened to.  After following-up on the email, I learned that Treblab would withhold 20% (or possibly more) of the price of my speaker.  Further, it wasn't until I asked a second time that I learned that Treblab would take 10% off of the cost if I kept it - a small discount at best.I am not happy at all with the policy and the need to have multiple interactions with Treblab to help resolve this.  Still waiting on my 10% credit confirmation"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chuck",
          "Nb_Reviews": 5,
          "Date": "2022-03-07T17:23:53.000Z",
          "Titre": "Great headphones at a good value.",
          "Contenu": "Nice product well packaged and shipped promptly, As advertised, but the sound, although good, did not \"blow me away\"."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chad Eggen",
          "Nb_Reviews": 1,
          "Date": "2021-06-30T01:30:09.000Z",
          "Titre": "I received these ahead of schedule",
          "Contenu": "I received these ahead of schedule. This is my 2nd pair of Treblab and I like them better than other brands as they are the only earbuds that can stay in my ears and have good quality. It would be nice to have a little more bass though. Overall, good product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 3,
          "Date": "2021-10-17T19:22:10.000Z",
          "Titre": "The item I bought was the correct item",
          "Contenu": "The item I bought was the correct item.  It arrived to me on time,and overall, I am very satisfied with the service I received."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Haven Goggans",
          "Nb_Reviews": 1,
          "Date": "2022-12-12T23:49:54.000Z",
          "Titre": "Yall took care of my discrepancy but…",
          "Contenu": "Yall took care of my discrepancy but the discount could be better."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Francis Bausch",
          "Nb_Reviews": 1,
          "Date": "2022-03-22T20:47:59.000Z",
          "Titre": "The phones arrived Ok and they are…",
          "Contenu": "The phones arrived Ok and they are good. I would like them more if they sounded better, clearer and less muffled."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Atum Ra",
          "Nb_Reviews": 1,
          "Date": "2021-07-02T20:25:42.000Z",
          "Titre": "Great and slick earbuds",
          "Contenu": "When one earbud is in the case the other earbud outside the case doesn't work."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Thisones",
          "Nb_Reviews": 1,
          "Date": "2021-10-28T14:53:36.000Z",
          "Titre": "Good",
          "Contenu": "I received my product. Quick reply and good service from the company.Did not try the product yet."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Neil Adler",
          "Nb_Reviews": 1,
          "Date": "2022-07-07T06:14:18.000Z",
          "Titre": "Diffucult to understand why various…",
          "Contenu": "Diffucult to understand why various unmarked versions will not pair together"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2022-05-17T22:02:16.000Z",
          "Titre": "Great product could use a longer cord"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Goose",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T12:15:10.000Z",
          "Titre": "Quality",
          "Contenu": "Outstanding service, online user friendly. My second pair of ear buds. Quality product!!!!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Mannie",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T03:31:59.000Z",
          "Titre": "Excellent customer service- had some…",
          "Contenu": "Excellent customer service- had some concerns wth my order - customer service resolved my issue and went beyond that was required.  Love the product and will recommend  to friends and family"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T23:08:02.000Z",
          "Titre": "Bot enuf TRELAB that I know product…",
          "Contenu": "Bot enuf TRELAB that I know product will arrive well packaged/designed, and it will work as promoted."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-12-12T22:31:55.000Z",
          "Titre": "Great ear buds",
          "Contenu": "Great ear buds. They stay in and work. Easy purchase online"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nadine Boydston",
          "Nb_Reviews": 2,
          "Date": "2023-08-10T03:21:05.000Z",
          "Titre": "Crystal clear sounding headphones to…",
          "Contenu": "Crystal clear sounding headphones to block out the noise and music at the gym, which I needed desperately. A much better price than the big name headphones, too. Even better, I have inflammation in my brain, so headphones that are too tight cause pain, but these are pain free. The case is a surprise bonus. It’s solid construction keep the headphones secure and stored neatly. Happy customer! Here’s hoping they last a long time. I really needed these."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phillip Markel",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T12:53:40.000Z",
          "Titre": "Love Treblab's products",
          "Contenu": "Love Treblab's products.  Due to a sale they were having, I was able to buy a brand new pair of earbuds directly from them for less than a used paired from other sellers.  Great products, Excellent prices, and Fast shipping!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JD",
          "Nb_Reviews": 1,
          "Date": "2023-06-18T03:08:32.000Z",
          "Titre": "Best wireless earbuds to date",
          "Contenu": "Best wireless earbuds to date! I purchased a set of the TREBLAB X3 PRO - and they are the most productive and comfortable set I’ve owned so far. I’m constantly in meetings and on the go, and the clarity (both voice and sound) of each call has made a tremendous difference. I appreciate the life span of the batteries. Keep up the great research and work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dusk Tippets",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T05:51:03.000Z",
          "Titre": "Great quality headphones",
          "Contenu": "I'm always wearing headphones, and i go on runs wearing them. They last a really long time, and have great nose cancelling"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Derryl York",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T02:56:44.000Z",
          "Titre": "I got the return handeled extremely…",
          "Contenu": "I got the return handeled extremely timely and expeditiously, but still wondering if I will get the correct part will be shipped. They have solid products and customer service seems to work well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric Micha'el Leventhal",
          "Nb_Reviews": 1,
          "Date": "2022-06-17T00:37:29.000Z",
          "Titre": "First-rate customer service",
          "Contenu": "I'm so impressed with Treblab's handling of my recent service issue... I'd placed two separate orders for the HD77 speaker, a little more than a year apart. Sadly I was unable to pair the two for surround sound, owing to an unforeseen Bluetooth discrepancy. The Treblab customer support team swept in to the rescue by offering to accept both units for a no-fee return and to replace them with two brand new matching units. The sound pairing is amazing and I am 100% satisfied — shout-out to Ksenia and Svetlana for their help! 🙌🏽🌻"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "MoarPye",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T10:14:01.000Z",
          "Titre": "Returning Customer",
          "Contenu": "Returning customer. I've tried other brands, including one that features heavily in YouTube and podcast sponsored content, but I've never been as happy as I am with my TREBLAB earbuds. I get a separate pair for two different devices, and I've done that three times now... That's 6 sets of earbuds in total, replaced roughly every 2 years when the battery life starts getting low.But please, please, please TREBLAB folks, if you're seeing this, BRING BACK THE XR800's! Those were my favourite earbuds by far. The XR700's have the same great sound quality and bass to them, but they're just not as comfortable, and the charge port on the 800's was in a much better spot, with a better water-tight plug."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jefferson Thomas",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T18:47:26.000Z",
          "Titre": "Comfort with a warranty.",
          "Contenu": "I’m pleased, they are very comfortable and they sound great!I have never owned a pair of over the ear headphones or ANC headphones before because the price of competitors seemed outrageous, but these have a reasonable price tag and I am glad I bought them. Even though they are not expensive they feel like they aren’t going to break, and they came with a warranty incase they do! All in all, I am very pleased with Treblabs product and service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arthur E",
          "Nb_Reviews": 2,
          "Date": "2021-05-12T23:01:13.000Z",
          "Titre": "TREBLAB comes through for their customers [Updated review]",
          "Contenu": "**UPDATE-5/12/2021**A year after my ordeal with StackCommerce & Entrepreneur.com's web store - they're still on my blacklist of companies to never deal with again. However, the product manufacturer, TREBLAB, actually cares about customers. Thankfully, I got my refund.In other news, I got a pair of their Z2 noise-cancelling headphones. I was able to stress-test this by taking it on my 3 hour flight last weekend and it shined. Not only was I able to successfully drown out crying baby sounds, but also able to enjoy some relaxing audiobooks connected to my iPhone's Bluetooth.The battery life on this thing is also impressive. Anyway, TREBLAB is good.StackCommerce, Entrepreneur.com - they're still trash companies that don't care about customers.Have a great day!-Original-My experience with them could have been better but I never received my product due to their distribution partners being scammers. Beware of how you order these products and avoid sites like Entrepreneur Store and StackCommerce. No way to reach customer service by phone. Had to get credit card fraud department to help get my refund. Not worth the hassle."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jake H.",
          "Nb_Reviews": 1,
          "Date": "2022-06-08T15:04:38.000Z",
          "Titre": "Solid",
          "Contenu": "Solid, affordable pair of wireless headphones! Treblab's Z2's covered all the key points that I wanted to get in a pair of headphones. Comfortable, durable, sound quality, affordable, and good looking! Treblab was able to accomplish all of those for me so I would definitely recommend them!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Teasdale",
          "Nb_Reviews": 4,
          "Date": "2022-10-25T13:14:21.000Z",
          "Titre": "Great sound and noise cancelling!!",
          "Contenu": "Excellent sound, quick blutooth pairing, quality noise reduction with the active noise cancelling feature. I love Treblab, I own the HD 77 speaker and this year I purchased the Z2 headphones which I use in the gym almost daily."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laurent",
          "Nb_Reviews": 1,
          "Date": "2021-09-13T11:10:05.000Z",
          "Titre": "This rating is only based on one transaction",
          "Contenu": "I am a bit hesitant about leaving a review on Trustpilot when I only had one transaction with TREBLAB. Fortunately, everything went smoothly and there is neither reason to complain nor submit anything less than 5 stars. However, I don't see the likelyhood of purchasing anything else in the future specefically from TREBLAB, so this one positive experience will have to do for now. Otherwise, I am open to editing this review."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "james",
          "Nb_Reviews": 2,
          "Date": "2022-04-05T01:18:13.000Z",
          "Titre": "Z7 Pro Amazing , where were these 10 years ago",
          "Contenu": "Ok my initial response I wanted to give 3 or 4 stars due to the shipping delays but , I can't fault TREBLAB for that ....or can I??? Any ways  just got them, out of the box they were 90% charged and ready to go ,huge plus , pairing was done in mere seconds again huge plus , tosses them on and maxed out the volume to listen to some of my Fav Metal tunes and the sound was amazing , best part my wife couldn't hear anything  standing 3 feet away , also the noises from the kitchen and the dog ripping around / kids being kids were non existence... I was lost in the music and in my world , by far these are thee best Noise canceling head phones I've had or had the pleasure of using , comfortable and wearing for hours during a flight will not be an issue , nor will hearing others on the plane.... only draw back I see happening is missing the drink cart on my next flight as I won't be able to hear her .... again amazing wish I found these years ago"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dale",
          "Nb_Reviews": 9,
          "Date": "2023-09-22T17:30:31.000Z",
          "Titre": "I have purchase 3 other treblab…",
          "Contenu": "I have purchase 3 other treblab products and have found to be constantly high quality and a very good value. Would recommend this company and it's products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James G",
          "Nb_Reviews": 1,
          "Date": "2021-10-07T13:43:35.000Z",
          "Titre": "My Treblab X3Pro earbuds are very…",
          "Contenu": "My Treblab X3Pro earbuds are very comfortable and secure.  While mountain biking I sustained a crash on a trail and they remained in my ears…the sound is excellent as well.  Very happy with the purchase which was affordable and so far the earbuds are a quality product…"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mitch Cofman",
          "Nb_Reviews": 1,
          "Date": "2021-07-09T18:09:43.000Z",
          "Titre": "TREBLAB Beats My Expectations!",
          "Contenu": "TREBLAB Beats My Expectations!I have been researching for a new headset and the TREBLAB Z2 hit on all my requirements and kept the cost under $100, which is what I set for the limit. They sound great, are lite weight and very comfortable to wear. The ability to turn on and off the ANC was an added bonus. Last but not least it be the expected delivery date by a few days. What a nice surprise. I have already recommended these headphones to a co-worker. That is how much I love these headphones."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Lynch",
          "Nb_Reviews": 1,
          "Date": "2021-09-29T01:58:02.000Z",
          "Titre": "Excellent product and support team.",
          "Contenu": "I purchased the X3 Pro ear buds and had an issue with the charging case. The support team, Ksenia and Marina, were extremely professional and a pleasure to deal with. They took care of the problem immediately. I love the ear buds because the sound is great and the audio on phone calls is clear on both ends. Their service only adds to a great product!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matt Mosca",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T23:48:18.000Z",
          "Titre": "Great speaker!!",
          "Contenu": "I love my treblab HD max! I bought this speaker to go with my new ebike. The speaker I had was not loud enough to hear at 20+ mph. I bought this speaker because all the reviews said \"it's loud\", guess what it is. I have yet to turn it up past 3\\4 max volume and I have absolutely no trouble hear my music at 30+ mph. With the bass this speaker puts out it is almost like I have a little mini subwoofer system for my ebike! It definitely turns heads. The only thing louder would be a wired system for power. I definitely recommend the HD max if you are looking for something that is battery powered and still provides you with a decent amount of bass."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Coach Dan",
          "Nb_Reviews": 4,
          "Date": "2023-06-12T21:40:35.000Z",
          "Titre": "I love the product",
          "Contenu": "I love the product, and ordering was simple and delivery was swift.  I use the earphones for workouts on my rowing machine, and because they are sweatproof, they are ideal for my situation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cady",
          "Nb_Reviews": 1,
          "Date": "2021-08-07T19:08:17.000Z",
          "Titre": "These headphones are well worth it",
          "Contenu": "These headphones are well worth it. Awesome noise-cancellation, fantastic sound. They don’t slip or bounce at all when I’m running which is crucial. 10/10 recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sonia Huerta",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T03:11:10.000Z",
          "Titre": "Am satisfied of the Treblab charger I…",
          "Contenu": "Am satisfied of the Treblab charger I received recently. The order process and went shipment went successfully well! No problems and complaints. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Demetrios N Tasheuras",
          "Nb_Reviews": 2,
          "Date": "2022-01-07T18:34:39.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service. Ordered the product online, shipped within a day and arrived as promised. These were replacement headphones for ones that I ran over. I have tried others but nothing like the quality and sound that I get with TREBLAB."
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "Mikhail Nelson",
          "Nb_Reviews": 1,
          "Date": "2022-02-26T16:18:49.000Z",
          "Titre": "This is one of the best experiences…",
          "Contenu": "This is one of the best experiences I've had with an retailer. You guys really try to do your best for your customers. I expect to be purchasing your products for years to come. Please keep up your standard in products and service for these comparatively low prices."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "R. Robinson",
          "Nb_Reviews": 3,
          "Date": "2021-09-20T00:03:44.000Z",
          "Titre": "At first things were frustrating with…",
          "Contenu": "At first things were frustrating with customer service but once I talked to another employee, who helped more then the first person, which made things a lot better. One of the best products on the market!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erika",
          "Nb_Reviews": 1,
          "Date": "2021-11-06T15:57:51.000Z",
          "Titre": "This has been one of the best company’s…",
          "Contenu": "This has been one of the best company’s I have dealt with. Shipping was extremely fast and even though my husbands headphones had a malfunction they were so quick to get it fixed for us. Would definitely recommend them to family and friends. Not to mention the sound is amazing perfect for my husband with his line of work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan Perkins",
          "Nb_Reviews": 1,
          "Date": "2021-12-09T22:43:21.000Z",
          "Titre": "Treblab Z2 headphones are fantastic!",
          "Contenu": "These headphones are fantastic in every respect and the best phones bar none < $250!  Don't waste your money on Bose or Sony when you can buy the Treblab Z2.  Magnificent headphones in every respect!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicholas Ornelas",
          "Nb_Reviews": 2,
          "Date": "2022-05-23T02:20:43.000Z",
          "Titre": "Very great customer service",
          "Contenu": "Very great customer service.   I've purchased products in the past and have been very pleased with the quality.  When the product failed, customer service is quick to resolve the issue by any means.  Will continue to buy from Treblab."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Earl Thompson",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T21:26:24.000Z",
          "Titre": "Extremely pleased Ordering the Treblab headphones was…",
          "Contenu": "Ordering the Treblab headphones was easy. The product was promptly delivered, it was packaged extremely well. I have used my headphones daily in my workouts. They sound terrific! I’m am a sweater and so far they have performed extremely well and remained on my ears and head. Great product!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Levoy",
          "Nb_Reviews": 1,
          "Date": "2022-11-07T19:38:54.000Z",
          "Titre": "Motorcycle worthy",
          "Contenu": "I wanted to listen to bluetooth without the expensive in helmet speakers. I was able enjoy  listening to my smartphone with plenty of volume and sound quality while wearing my helmet."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Corey Lomelino",
          "Nb_Reviews": 1,
          "Date": "2022-01-13T23:51:18.000Z",
          "Titre": "I have Treblab headphones and Bluetooth…",
          "Contenu": "I have Treblab headphones and Bluetooth speake. They both sound amazing, absolutely love them.Had an issue with a speaker and the help from them was quick and professional. Awesome customer service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryan Akins",
          "Nb_Reviews": 4,
          "Date": "2021-05-31T23:44:25.000Z",
          "Titre": "The best ear buds for your dollar...",
          "Contenu": "The best ear buds for your dollar.... this is my 3rd pair.  Will not even look at another company when it comes to my ear buds. These are the best ear buds per dollar on the market and have better sound quality than many competitors that charge way more for their product.  Don't know how they do it? But if you want quality these are what your looking for. Extremely satisfied."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sarah Lack",
          "Nb_Reviews": 1,
          "Date": "2022-05-03T11:34:15.000Z",
          "Titre": "I ordered some earbuds last summer and…",
          "Contenu": "I ordered some earbuds last summer and when I got them, there were some connectivity issues when I would use both, but I knew I would very rarely wear both (I mostly wear when mowing or walking my dog and want to be able to hear if I need to), so I wasn't too concerned. Now we are still less then a year since I got them and the one ear bud I hardly ever wear broke. The button and cover broke off and I can't get it back together. I just ordered and received the X3 Pro pair as a 2nd pair to keep on hand at work, but now I can't use the original pair because they are even more wonky since the left is broke.ETA: Ksenia was so great about helping me with this issue. They sent me a new pair of the old model I had, but they were defective and sent me a new pair of the X1 earphones that, so far, are working great! I really appreciate the fast and wonderful service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jolie Jenee",
          "Nb_Reviews": 1,
          "Date": "2021-06-17T18:01:03.000Z",
          "Titre": "The sound is great and I like the size…",
          "Contenu": "The sound is great and I like the size of, and mobility of the speaker.  And the product team at TREBLAB has been amazing with their customer service.  It is incredible to have a company that truly cares about my happiness with their product.  I would highly recommend this speaker and company!."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "james talbot",
          "Nb_Reviews": 2,
          "Date": "2022-04-13T19:49:59.000Z",
          "Titre": "I am very happy with my TREBLAB HD77",
          "Contenu": "I am very happy with my TREBLAB HD77! The unit is stylish and has good heft. The sound is excellent! Crisp with little to no distortion. delivers strong loud sound. (I am often told to turn it down) The charging cable is unique, so don't lose it, I did. I ordered a new one and was delivered quickly. Great speaker and great customer service.  I highly recommend the speaker and the company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 1,
          "Date": "2022-02-14T23:41:46.000Z",
          "Titre": "Had no problems with service or…",
          "Contenu": "Had no problems with service or product. Have not had a chance to use when riding motorcycle and is main reason for purchase. Not sure how long they will last but right now we are very pleased. Riding season almost here."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2021-04-15T05:50:12.000Z",
          "Titre": "Good products",
          "Contenu": "I have bought a few products from this company. And all of them are very good. I have two Bluetooth speakers - HD 55 and HD Max and two headphones - X5 and Z2.I choose electronics very scrupulously. Now there are a lot of manufacturers, so I order 7-10 products from different companies to choose 1-2 that I like. As a result, I still have all the Treblab products. Good price and good sound."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Vadym",
          "Nb_Reviews": 2,
          "Date": "2021-12-06T13:46:12.000Z",
          "Titre": "Great choice",
          "Contenu": "Customer Service Team was very helpful, product is of high quality. I’ve been looking to this moment all year, to finally get ahold of this speaker :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "The Captain",
          "Nb_Reviews": 5,
          "Date": "2022-05-08T16:32:52.000Z",
          "Titre": "This is a great little sound system for…",
          "Contenu": "This is a great little sound system for the price!  Glad I ordered it from the company because it was , quick and the warranty, customer support is friendly and accesible if there's a need to contact.  Thank you Treblab Crew!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan T",
          "Nb_Reviews": 1,
          "Date": "2022-04-16T03:15:25.000Z",
          "Titre": "Great sound",
          "Contenu": "Great sound.  Compared to Sony headphones and Treblab was better sound.  Comfortable to wear during a 6 hour flight. Easy to connect and use. Would recommend to others."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Glenn",
          "Nb_Reviews": 1,
          "Date": "2021-07-21T18:46:32.000Z",
          "Titre": "X3Pro Black",
          "Contenu": "Have had these headphones for almost 3 weeks and have put them through a lot of exercise and hikes. The headphones stay attached well with the ear loop which I like. Be sure to play with the ear plug sizes as the right one will help ensure good fit. Charging case seems to hold up well..I have only had to re-charge the case once so far. These headphones have seen a lot sweat and some water from spray and haven't had any issues. Overall great product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stan",
          "Nb_Reviews": 1,
          "Date": "2021-08-05T05:25:37.000Z",
          "Titre": "Highly recommend TrebLab in all categories including product and support.",
          "Contenu": "The TrebLab support team provided quick responses to detailed technical specification questions I had before I purchased the Z2 headphones.  The headphones paired with my audio source without any issues, have excellent sound quality and are comfortable to wear for extended periods.Highly recommend TrebLab in all categories."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Consumer",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T17:48:54.000Z",
          "Titre": "It sounds super good!",
          "Contenu": "It sounds super good!! Beautiful sound and look amazing… not to heavy to carry!!! I will order this again and tell everyone about it!!! Thank you…"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hugo Costa Jr.",
          "Nb_Reviews": 1,
          "Date": "2022-02-25T15:51:51.000Z",
          "Titre": "Great Website & Great Product",
          "Contenu": "Very user friendly website. Choosing the items and check out was easy. The free shipping is also really fast. Got a message my item was being shipped later the same afternoon.As far as the product, the Treblab X3 Pro earbuds, they are fantastic. I ordered a set 2 weeks ago. I liked them so much, I came back now and ordered 2 more pair; one for my work laptop and one for my personal laptop."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen McIntosh",
          "Nb_Reviews": 1,
          "Date": "2023-03-18T20:39:26.000Z",
          "Titre": "Headphones are great easy Bluetooth…",
          "Contenu": "Headphones are great easy Bluetooth connection and Google battery life. I use them at the gym and at home connected to the television."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "R. Robinson",
          "Nb_Reviews": 3,
          "Date": "2023-03-02T02:12:48.000Z",
          "Titre": "The fif!",
          "Contenu": "Probably the fifth pair of workout headphones I have bought from TREBLAB. Even had an issue and TREBLAB cleared it up with minimal damage to my wallet."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harlan Slack",
          "Nb_Reviews": 1,
          "Date": "2021-05-29T13:14:17.000Z",
          "Titre": "only received one iem out of the two…",
          "Contenu": "only received one iem out of the two that were order, agent got copies of my paper work and sent the missing item.  quick and satisfactory"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "T Garrova",
          "Nb_Reviews": 2,
          "Date": "2021-08-13T22:36:37.000Z",
          "Titre": "Great Headphones!",
          "Contenu": "I use these headphones while doing yard work. It’s hot and humid where I live and, so far, these headphones hold up very well. The sound quality is great and the controls are very easy to use. I was using my old Bose headphones, but the ear pieces are now shot due to sweat. The ear pieces on the Treblabs are much more durable, and I hope to get many years of service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eduardo Vasquez",
          "Nb_Reviews": 1,
          "Date": "2021-07-09T13:56:05.000Z",
          "Titre": "Great product and even better customer…",
          "Contenu": "Great product and even better customer service. I am considering buying a second speaker and some headphones..A BRAND AND A COMPANY YOU CAN TRUST!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Johann Muller",
          "Nb_Reviews": 2,
          "Date": "2023-05-30T04:36:53.000Z",
          "Titre": "As advertised",
          "Contenu": "As advertised! Sweat proof for over a year. The only reason I replaced my ear buds was the magnets wore off. Wouldn't lock into the case to charge. Great sound and long battery life."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stanley Ward",
          "Nb_Reviews": 3,
          "Date": "2021-05-26T14:58:56.000Z",
          "Titre": "These are thus far the best headphones…",
          "Contenu": "These are thus far the best headphones I’ve experienced. My left earbud had a minor defect. I told them the issue and sent a pic. I got my replacement very quick. That made me happy. As I stated before, you guys are so awesome"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristen Koehnemann",
          "Nb_Reviews": 2,
          "Date": "2021-06-04T05:06:59.000Z",
          "Titre": "BETTER Than Beats !!!!!!",
          "Contenu": "I have been using Treblab earbuds for many years now.  I have used many different kinds of earbuds and headphones in the past, and I always LOVE Treblab!  Not only is their customer service BEYOND EXCEPTIONAL, they have quality products for a reasonable cost.  They always back their products up and I am forever grateful for that.  Every customer service agent that I have worked with in the past has been phenomenal!   I am a workout addict and workout 5-7 days a week for years now, and I ONLY use Treblab. My backup pair are my Beats, (that were a gift).  I hate the sound quality on them and their fit.  I do not get NEAR the insane workout I do with the Beats as I do with my Treblabs.  I have recommended Treblab to multiple friends who are just as happy with their purchase as I am.  There isn't enough positive things I can say about the products, the seamless quality, the superior customer service, and exceptional care I receive through Treblab!  Their products are so good, I plan on purchasing a new bluetooth speaker soon for the summer months, as well. I promise, you won't be disappointed!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Max S.",
          "Nb_Reviews": 1,
          "Date": "2023-06-25T23:34:29.000Z",
          "Titre": "I got this speaker to bring to the…beach",
          "Contenu": "I got this speaker to bring to the beach for when I train. Love how loud it is without ruining the sound quality.Highly recommend this speaker."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nolton Bigelow",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T22:00:54.000Z",
          "Titre": "The headphone was excellent quality",
          "Contenu": "The headphone was excellent quality. The sound is great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rita Scanio",
          "Nb_Reviews": 2,
          "Date": "2023-04-21T03:59:27.000Z",
          "Titre": "Fast delivery",
          "Contenu": "Fast delivery, easy web site and my bluetooth is the best I have  found.  the clarity and comfort of them is second to none especially when the price is as good as the product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deb Van Houten",
          "Nb_Reviews": 2,
          "Date": "2022-02-28T22:30:42.000Z",
          "Titre": "I couldn’t find the replacement covers…",
          "Contenu": "I couldn’t find the replacement covers for the ear piece. Customer Service was wonderful. Called me back promptly, knew what I needed and sent me the link. I received exactly what I needed. Thank You!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alex Jenkins",
          "Nb_Reviews": 1,
          "Date": "2022-08-08T20:24:15.000Z",
          "Titre": "Perfect headphones, excellent customer service.",
          "Contenu": "Just got the XR700's to add to my collection of Z2's and X3 pro's. Love them all. Great response time and resolution when I had to reach out to customer service, as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave B.",
          "Nb_Reviews": 1,
          "Date": "2022-05-15T20:53:26.000Z",
          "Titre": "Great noise reduction on a 60 hp diesel…",
          "Contenu": "Great noise reduction on a 60 hp diesel 72\" commercial lawn mower.   If you turn on the music you don't even notice the mower noise.. quality sound.. if you go faster than 15 mph you can here wind sound.... 3 weeks...So far very happy..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary DeCaire",
          "Nb_Reviews": 3,
          "Date": "2022-05-09T00:33:06.000Z",
          "Titre": "Excellent sound",
          "Contenu": "Rec’d speaker in the mail a couple days after ordering.  Happily surprised.  Easy to set up and sound is so crisp!   Very pleased with my purchase!!!   Will order another one for travel."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher Hernandez",
          "Nb_Reviews": 1,
          "Date": "2022-05-12T08:25:45.000Z",
          "Titre": "Excellent Customer Service and Great Headphones",
          "Contenu": "Svetlana provided excellent customer service. Treblab Z2 Headphones are great, love them, sound really nice"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Kelly R",
          "Nb_Reviews": 1,
          "Date": "2022-05-23T16:29:01.000Z",
          "Titre": "International headphones order",
          "Contenu": "Ordered internationally to Uk. Received product within expectation of 2-weeks. Online tracking was helpful and easy to follow. Package was in good condition and loving the headphones so far!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PJ",
          "Nb_Reviews": 1,
          "Date": "2022-03-16T15:00:34.000Z",
          "Titre": "An excellent set of workout headphones",
          "Contenu": "An excellent set of workout headphones. They're stable, sound quality is good, sweat-resistant, and the noise cancellation is solid. Would recommend."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Mohamed Eldah",
          "Nb_Reviews": 1,
          "Date": "2022-01-25T18:41:39.000Z",
          "Titre": "Headphones work great. Supply chain delays but not companys fault",
          "Contenu": "Edit: headphones recieved and customer service followed up. Thank you for your efforts. Headphones work great. Be well"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Travis Grim",
          "Nb_Reviews": 2,
          "Date": "2022-08-08T19:40:17.000Z",
          "Titre": "I used my x100s until they wore out",
          "Contenu": "I used my x100s until they wore out. 11 hours a day 5 days a week for 2 years. Absolutely love the sound quality and fit. Finally wore them out so I got the x500s this time. They have worked just as well. I recommend these anytime someone wants headphones"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ron B.",
          "Nb_Reviews": 2,
          "Date": "2021-10-10T22:22:35.000Z",
          "Titre": "HD77 Speakers",
          "Contenu": "They can be paired together for more of a stereo sound or used separately. Very easy to pair with my Bluetooth devices. They are well constructed and produce a good sound. Thus far I am very pleased with your product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Teasdale",
          "Nb_Reviews": 4,
          "Date": "2022-09-06T15:22:23.000Z",
          "Titre": "Durable with quality sound!",
          "Contenu": "I have two HD 77 speakers and now the Z2 headphones. I'm a huge fan of the treblab sound quality and the durability of every product I buy from them-robbie"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roger Carter",
          "Nb_Reviews": 1,
          "Date": "2022-03-01T21:36:27.000Z",
          "Titre": "I am thrilled with the sound quality of…",
          "Contenu": "I am thrilled with the sound quality of my new speaker. Sounds fabulous. My fellow golfers are enjoying my tunes. I only wish it had a magnet on it to affix to a golf cart post."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Taylor Fincher",
          "Nb_Reviews": 2,
          "Date": "2021-10-26T16:07:55.000Z",
          "Titre": "Professional",
          "Contenu": "Professional, top quality and all around great product. I’m a life long customer for trelab products. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Columbus Baker",
          "Nb_Reviews": 1,
          "Date": "2022-10-17T23:48:06.000Z",
          "Titre": "Great product",
          "Contenu": "Great product & great value. I found that the ear muffs were wearing badly until I figured out that my one to two day whiskers were damaging the ear muffs if I took them off and wore the speakers around my neck. Easy fix"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keffus Falls III",
          "Nb_Reviews": 2,
          "Date": "2021-04-26T14:36:35.000Z",
          "Titre": "TREBLAB has been my go-to brand since…",
          "Contenu": "TREBLAB has been my go-to brand since 2018. I haven’t looked back ever since!The X5 earbuds are the best of the best, and I highly recommend them to anyone looking for reliable brand."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles Richardson",
          "Nb_Reviews": 1,
          "Date": "2023-01-14T20:32:06.000Z",
          "Titre": "I have several different products of…",
          "Contenu": "I have several different products of you and they all work great,  I always have received my order in a timely manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jon Heeren",
          "Nb_Reviews": 1,
          "Date": "2021-09-18T15:33:09.000Z",
          "Titre": "Treblab makes good products",
          "Contenu": "Treblab makes good products. If there’s an issue with something they are great at responding and solving the issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ROBERT DONAHUE",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T22:52:27.000Z",
          "Titre": "No problem returning an incorrect item",
          "Contenu": "No problem returning an incorrect item. Great service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wini Williams",
          "Nb_Reviews": 2,
          "Date": "2022-02-24T18:38:13.000Z",
          "Titre": "Although it took a while to resolve my…",
          "Contenu": "Although it took a while to resolve my issue, the customer service was very eager to help me and very easy to work with.I love the speaker."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donald Gallagher",
          "Nb_Reviews": 1,
          "Date": "2022-01-10T16:08:44.000Z",
          "Titre": "Marine1/3",
          "Contenu": "WOW! Totally awesome headphones! Bought a pair for my wife and she love's them. She let me put them on and they were GREAT. Very lightweight, very comfortable indeed. The headphones are very soft and comfortable on the ears. The audio is super, Great bass sound to it. Very nice carry case with it. This is a GREAT BUY for the money. Very well worth the money that you pay for them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ray Williams",
          "Nb_Reviews": 1,
          "Date": "2022-02-27T04:28:09.000Z",
          "Titre": "I purchased the X 3 Pro",
          "Contenu": "I purchased the X 3 Pro, I love them, they fit well on ears they are very comfortable and sound amazing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chad",
          "Nb_Reviews": 1,
          "Date": "2022-06-06T20:55:09.000Z",
          "Titre": "Best ones I've come across for the…",
          "Contenu": "Best ones I've come across for the money.  I spent a lot more on BLX earbuds and they are junk.  Treblab products have been great and work well even when riding a commercial mower all day."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Renee LeFever",
          "Nb_Reviews": 1,
          "Date": "2022-01-21T15:03:13.000Z",
          "Titre": "Because of other reviews I chose these…",
          "Contenu": "Because of other reviews I chose these headphones for a gift for my husband. This is the first headphone that he has. He has been happy with them"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fran Vernon",
          "Nb_Reviews": 1,
          "Date": "2021-08-07T20:20:54.000Z",
          "Titre": "This is the second Trelab speaker I…",
          "Contenu": "This is the second Trelab speaker I have purchased.   Sound quality on both is fantastic."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan",
          "Nb_Reviews": 2,
          "Date": "2022-09-27T03:01:52.000Z",
          "Titre": "Purchased from this company 2 other…",
          "Contenu": "Purchased from this company 2 other times. Always great quality and fast service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick Godown",
          "Nb_Reviews": 1,
          "Date": "2021-06-15T22:39:33.000Z",
          "Titre": "Everything went well from the order to…",
          "Contenu": "Everything went well from the order to deliver and Treblab wireless earbuds work great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ulrike",
          "Nb_Reviews": 8,
          "Date": "2023-10-28T03:48:57.000Z",
          "Titre": "great sound",
          "Contenu": "great sound@ Functions perfectly and easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris H.",
          "Nb_Reviews": 1,
          "Date": "2022-05-23T23:25:44.000Z",
          "Titre": "These are some quality wireless…",
          "Contenu": "These are some quality wireless headphones! Great sound and comfortable. I am very pleased with them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dale Clark",
          "Nb_Reviews": 1,
          "Date": "2022-09-23T21:43:28.000Z",
          "Titre": "I ordered a Bluetooth speaker online",
          "Contenu": "I ordered a Bluetooth speaker online.   I got a quick service.  I am very happy with my speaker.   I highly recommend Treblab"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Lucas",
          "Nb_Reviews": 3,
          "Date": "2021-07-01T11:49:48.000Z",
          "Titre": "The sound is incredible",
          "Contenu": "The sound is incredible, the small size makes it easy to carry around and the unit is beautiful !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bei-Min Hoffnagle",
          "Nb_Reviews": 1,
          "Date": "2023-04-18T00:34:41.000Z",
          "Titre": "Received exactly what I needed in a…",
          "Contenu": "Received exactly what I needed in a short amount of time and the quality of the item is great"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mitchell Jones",
          "Nb_Reviews": 1,
          "Date": "2021-08-16T18:51:31.000Z",
          "Titre": "Product is exactly what i wanted",
          "Contenu": "Product is exactly what i wanted. I’ve been using Treblab for years. I sweat all day outside and in attics and they’ e always been great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Baldwin",
          "Nb_Reviews": 1,
          "Date": "2022-01-18T23:38:24.000Z",
          "Titre": "Love the Touch Controls",
          "Contenu": "Love the Touch Controls. They Pair Up Easily.I've been Looking for These Headphones for Years.A Hidden Gem!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dmr",
          "Nb_Reviews": 1,
          "Date": "2022-01-25T08:45:50.000Z",
          "Titre": "This review received 5 stars because…",
          "Contenu": "This review received 5 stars because item was delivered as scheduled and in good condition."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Johann Muller",
          "Nb_Reviews": 2,
          "Date": "2023-08-28T03:15:46.000Z",
          "Titre": "Great product",
          "Contenu": "Super fast shipping and great product.  Long battery life and can handle the sweat."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Teasdale",
          "Nb_Reviews": 4,
          "Date": "2021-05-24T11:59:48.000Z",
          "Titre": "Amazing quality for the price",
          "Contenu": "Amazing quality for the price! I will be trying more TrebLab products in the future. I have 2 HD 77 speakers now and I love them so much!!!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Beth Craig",
          "Nb_Reviews": 1,
          "Date": "2022-02-03T18:33:10.000Z",
          "Titre": "Loving the headphones.",
          "Contenu": "Finally arrived. Loving the headphones. They have all the features need."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian D. Stone",
          "Nb_Reviews": 2,
          "Date": "2021-06-21T18:50:17.000Z",
          "Titre": "GREAT EARPHONES FOR THE $",
          "Contenu": "The first pair of TREBLAB wireless earphones I had worked so well I wanted the exact same pair again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rich B",
          "Nb_Reviews": 1,
          "Date": "2022-09-23T22:04:32.000Z",
          "Titre": "Great Customer service",
          "Contenu": "Excellent customer service.  A company that seems to care about its customers and solving their problems quickly and professionally"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "German Melendez",
          "Nb_Reviews": 2,
          "Date": "2022-08-16T01:43:09.000Z",
          "Titre": "Very nice and easy proses",
          "Contenu": "Very nice and easy proses. Really the company are very professional company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PattiP",
          "Nb_Reviews": 2,
          "Date": "2023-03-20T22:53:23.000Z",
          "Titre": "Satisfied",
          "Contenu": "Everything was as is said it was.  Easy to navigate your site, and place order.  Shipping was also quick."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Hobson",
          "Nb_Reviews": 1,
          "Date": "2021-12-06T17:58:40.000Z",
          "Titre": "Good Job",
          "Contenu": "Awesome job.  Package arrived on time and in good condition."
        }
      ]
    }
  ]
}