{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "truconnect.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T18:25:13.000Z",
          "Titre": "I want to cancel this transactional",
          "Contenu": "I want to cancel this transaction, if you can call it that, immediately. I refuse any charges. I cannot reach a live person to cancel. I am calling the AG Consumer Fraud division today if someone does not get back to me immediately I want nothing from you including charges. Your con artist representatives came around to my apartment complex scamming older, vulnerable people including those incapable of making decisions.I want you to not use any of my information and cancel everything immediately without charge.And please keep your con artist representatives away from this Senior complex."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:20:04.000Z",
          "Titre": "It'started out great and then I paid…",
          "Contenu": "It'started out great and then I paid $50.00 for a phone & tablet but I didn't get the tablet the same day I was told to wait at least 24 hrs and to call 611 from the phone I got and give my info and they would send me the tablet but it was another phone I got (not a tablet) and it was smaller than the 1st phone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Victim of fraud",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T18:17:03.000Z",
          "Titre": "A fraudulent account was set up in my…",
          "Contenu": "A fraudulent account was set up in my name and I have repeatedly tried to reach out to them via email and phone. No one has returned my phone call or email. My biggest fear is that this company has zero desire to investigate this criminal act. I would offer zero*if possible. Do yourself a favor and run your credit to ensure that your account has not been fraudulently created."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T02:49:14.000Z",
          "Titre": "Horrible customer service",
          "Contenu": "Horrible customer service! This programs sucks, we never got our free breakfast which was the reason why we ordered in the first place. No one spoke Spanish. They wouldn’t change nor cancel the order for us over the phone and ended up charging us some extra money for what we didn’t want."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Birdie Birdie",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T16:18:21.000Z",
          "Titre": "I haven't been able to make any long…",
          "Contenu": "I haven't been able to make any long distance calls since I received this phone a month ago. I've called everyday with no resolution just that a ticket has 🐝 generated."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:32:04.000Z",
          "Titre": "The representative giving or selling…",
          "Contenu": "The representative giving or selling phones DID NOT ask my permission to take my ACP government discount. I did not want to change it from cox to truconnect. My government discount is for my cox internet!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Debbie Drummond",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T08:03:01.000Z",
          "Titre": "I can't make any calls because I got Verizon WiFi…",
          "Contenu": "I can't make any calls because I got Verizon WiFi it doesn't work. I was never told that! Before I didn't have any WiFi and it worked. So I guess your company is full of crap. So someone can come get the phone!! I never heard of such bull crap before! What does it matter what WiFi a person has! So thanks for nothing!!! You suck!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T18:10:24.000Z",
          "Titre": "The sales representative never came…",
          "Contenu": "The sales representative never came back with the tablet as he promised and we never heard from him again. He did not provide his contact information neither. I can't help but to wonder if this company is a scam. That's unfortunate."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T23:59:37.000Z",
          "Titre": "Customer service was very rude",
          "Contenu": "Customer service was very rude. Talked to us like we were stupid and accused us of impersonating and had service then no service for being a free phone"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T18:10:44.000Z",
          "Titre": "Failed Tech and Zero HELP",
          "Contenu": "I needed help setting it up and no one got back to me. THEN a week after getting the phone, it turned off and won't turn back on no matter how long it's on the charger. And AGAIN, NO RESPONSE. No physical damage done to the phone. Just stopped working."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T19:16:17.000Z",
          "Titre": "No resolution to the problem",
          "Contenu": "No resolution to the problemCannot receive texts from my bank to verify my new phone number or from my patient portal so I cannot do any online banking or go into my patient portal. I also cannot receive phone calls from certain people"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vanessa Hollowood",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T22:16:15.000Z",
          "Titre": "I've been trying to buy the tablet for…",
          "Contenu": "I've been trying to buy the tablet for $10 for 3 days. Every time I do it online it doesn't go through. Every time I talk to a representative they can't help me and nobody will call me back"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tatiana Wright",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T21:21:30.000Z",
          "Titre": "My daughter phone has start working and…",
          "Contenu": "My daughter phone has start working and she just got it the mobile network on and she connected to WiFi but she can’t get calls or call out , it’s was just working perfectly fine this afternoon she was able to get calls . She just got this phone too"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Danielle Brown",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T14:00:41.000Z",
          "Titre": "I was sent a tablet that didn't work",
          "Contenu": "I was sent a tablet that didn't work, I didn't get the choice between the 2 tablets if so I would have chosen the Amazon Fire HD, so I had to send it back which then it  cost me $15 shipping and handling... This program is to help us not create more chaos in our lives.. I hope this is resolved soon.."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Heidi Bennett",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T18:41:30.000Z",
          "Titre": "When I applied I requested my old…",
          "Contenu": "When I applied I requested my old number and did not get it. They were supposed to activate the SIM card yesterday yet it’s still not activated. I received an email saying my ACP was approved and the customer service agent told me no it wasn’t and hung up on me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cherie jackson",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T15:13:28.000Z",
          "Titre": "This phone that you sent me is complete…",
          "Contenu": "This phone that you sent me is complete garbage. The battery was dead so I put it on the charger 5 minutes after being on the charger the phone shattered and there's a burn mark by the earpiece from this and I cannot hear out of the phone"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T10:08:18.000Z",
          "Titre": "Received the phone activated it up and…",
          "Contenu": "Received the phone activated it up and there was no mobile data on the phone it says disconnected . Very disappointed still don't have service ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Fraud Victim",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T22:05:44.000Z",
          "Titre": "TruConnect will not close Fraudulent accounts",
          "Contenu": "Someone in California (I am in Illinois) has used my name and email address to obtain government-funded telecom and Internet benefits. I did not sign up for benefits so I called to cancel the benefits. After speaking with 4 people and opening two tickets they will not cancel this account because I cannot produce the birthday that the fraudster used.TruConnect is in the business of connecting fraudulent accounts so as to embezzle ACP Benefit money from the US government."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Elizabeth Gurrola",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T12:11:27.000Z",
          "Titre": "I have no phone and no internet…",
          "Contenu": "I have no phone and no internet service. I have tried truconnect , access, unity, ACP, and all these programs have quit working for me claiming that I don't qualify any more.  Nothing in my income has changed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T18:56:56.000Z",
          "Titre": "I am already a customer n I got sent…",
          "Contenu": "I am already a customer n I got sent out a different chip with a different number. I do not want to switch numbers . Also my plan of unlimited talk text data isn’t not added to my account. I am already approved fornthe acp why didn’t it get added to my same phone plan I signed up with"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Azrael",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T21:24:00.000Z",
          "Titre": "This so far has been the worst customer…",
          "Contenu": "This so far has been the worst customer service experience with any company I have ever had in my life at the age of 46 years. No one has absolutely any interest in helping me solve my problem. Thanks for nothing you guys!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Desiree Jones",
          "Nb_Reviews": 3,
          "Date": "2023-12-14T21:51:35.000Z",
          "Titre": "I wouldn't even give them one star but…",
          "Contenu": "I wouldn't even give them one star but I wanted to rate them so I had to give them one star. The deals are fake scams I was charged but never received device & they said I wasn't charged or refunded but it doesn't show on my bank statement. The customer service is nearly non existent then after 6 calls and hour on hold they hung up on me! Sent me to the survey the nerve this is the worst provider ever. The last time I attempted to use them the device didn't work & there is no customer service to assist with Anything I wouldn't recommend them"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tabetha Barlow",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T06:53:43.000Z",
          "Titre": "Your employee promoting this program…",
          "Contenu": "Your employee promoting this program failed to tell me my current service would be interrupted and lost forever. On the day I'm waiting for the phone call to sign papers on the sell of my home."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jerry H.",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T23:08:42.000Z",
          "Titre": "1st strike, 2nd strike, one more I change providers.",
          "Contenu": "1st, truConnect has no option to get your phone to you in a timely manner, even though I offered to pay for it. I was told typically 5-7 days minium. No next day, no express shipping. Secondly, on my initial application and all other correspondence, I made it clear that I intended to keep my number, and when my phone finally arrived it doesn't have a blank sim card, when I complained, I was told no problem I just have to wait another week for it to arrive.In this day and time, no one can do without their phone for One day , much less 5-7 days."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T12:30:26.000Z",
          "Titre": "I want the service that I just got back…",
          "Contenu": "I want the service that I just got back on someone else transferred my lifeline somehow I want to reinstate this brand new cloud mobile phone and sim I already have."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T06:11:59.000Z",
          "Titre": "I have been scammed by the dumb ass…",
          "Contenu": "I have been scammed by the dumb ass lady who signed me up for the cheap Chinese tablet!! She also lied to me about one year of Amazon prime and that I could talk and text with the stupid tablet , all lies !"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Evelyn Causey",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T00:20:55.000Z",
          "Titre": "I've been going back and forth with SIM…",
          "Contenu": "I've been going back and forth with SIM cards for at least a week if not more now I have no service on the phone that you sent me and I have no service on the phone that I was trying to transfer to the phone you sent me. Not have the am very frustrated at this point."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joe Mahma",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T01:19:53.000Z",
          "Titre": "Absolute garbage customer service",
          "Contenu": "Absolute garbage customer service. It takes at least 30 minutes of being put on hold before speaking to a live person. Once you speak to a Truconnect customer service representative, you discover that they are not knowledgeable, uncaring, rude, ill mannered, and will HANG UP ON YOU."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T12:41:54.000Z",
          "Titre": "My phone got dent to wrong address and…",
          "Contenu": "My phone got sent to wrong address and then customer service acted rudly and told me that there was nothing they could to help me!!@"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T23:53:25.000Z",
          "Titre": "Didn't expect for my other phone to be…",
          "Contenu": "Didn't expect for my other phone to be turned off! Was not the plan, very disappointed"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T02:06:55.000Z",
          "Titre": "The tablet has no service so it's no…sims not working",
          "Contenu": "The tablet has no service so it's no good for anything but wifi the sims is not working"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T19:45:00.000Z",
          "Titre": "No response",
          "Contenu": "No response, need to cancel my account as I never intended to set one up. Called and was on hold for over an hour and no answer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T12:20:41.000Z",
          "Titre": "4 to 5 days and still has my numbstill no serviceer in…",
          "Contenu": "4 to 5 days and still has my number in limbo with no working service . sim did not come with my number ported, this is a nighmare"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T14:34:05.000Z",
          "Titre": "I never signed up for TC",
          "Contenu": "I never signed up for TC. Don’t know how my account got started. Tried to cancel by phone but had no luck with non English speaking person. Tried to cancel by email and was told that they can’t cancel by email."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "LJ",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T17:35:39.000Z",
          "Titre": "Misleading/false advertising",
          "Contenu": "Misleading/false advertising. States you will be given the option to buy a tablet after you sign up for service. Will be reporting. Says once you are approved for the plan, which I was. This is illegal, and a means to entice customers to go through this service instead of finding other options. Will be reporting for false advertising."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T22:02:06.000Z",
          "Titre": "Scammed, lied to, and stuck with broken  phone",
          "Contenu": "The lady who signed me up sold me a free phone for $60, saying it was upgraded, it doesn't work, nobody can hear me on calls, it will not play games, which is why I paid $60 for the upgrade. Now I am told I got the \"free phone\" and she told me I got Amazon prime free for a year with the upgrade and I called in and was told that's nowhere on my account. I got hustled, and stuck $60 thrown away for a free phone that cannot be used. And nobody is willing to fix the problem"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:46:39.000Z",
          "Titre": "Calling the company is a hassle",
          "Contenu": "Calling the company is a hassle. I was on hold waiting to speak to a representative for a total of over 2 hours!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard Phillips",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T17:40:01.000Z",
          "Titre": "The sim card",
          "Contenu": "The sim card, isn't allowing me to make calls or receive text messages and I called yesterday to fix it and it still isn't working"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Justin Kremer",
          "Nb_Reviews": 4,
          "Date": "2023-12-18T20:46:35.000Z",
          "Titre": "They set up an account without my permission",
          "Contenu": "I received an email notification that I apparently have purchased service from TruConnect. I DID NOT. I have tried to reach out to support, but they have ignored me. DO NOT TRUST THEM!--I need to add more information to account for the response that was received. I have been in contact with 5 different support people via various methods, and none of them can (or will) help me because I don't know all of the details that the person used to fraudulently open an account using my information. Whoever designed their security implicitly trusts whoever signs up and there is no recourse for someone who has been impersonated. THIS IS THE WRONG WAY TO DO SECURITY! Verify before trusting!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lori",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T07:05:47.000Z",
          "Titre": "Completely Unsatisfied",
          "Contenu": "This company really got me good. I never received my cellphone from them. When I spoke with the company nobody cared at all. They did however push me into purchasing a hotspot device leading me to believe that I could have the hotspot and a cell phone. Oh and also, the hotspot would not work! I made a complaint to the BBB and they turned around and lied to them. Take my advice and save yourself a whole lot of pain and aggravation. Pick a different lifeline company than Truconnect because it will be a Truheadache and they will rob you if they can."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pissed off customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T18:50:08.000Z",
          "Titre": "I was unable to transfer my phone…",
          "Contenu": "I was unable to transfer my phone number to my new phone because of your system was down. Or some excuse the customer service lady gave me. She says call back Tuesday. It is now Sunday. Where's my phone?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T06:03:29.000Z",
          "Titre": "*CASE#01843045",
          "Contenu": "*CASE#01843045.  This is Mrs Opal Hamilton,ORD#25469619 /#25469615APPLICATION #B50004-64164PIN#3137It’s been a long journey dealing with your company, the pho doesn’t work Properly, will not Unlock, is on Airplane Mode, when I changed the phone, showed it on Airplane Mode, and Phone will not Unlock.*I called several times, and I were told by your representative, that I need to Purchase a Device $89.00 to unlock the cellphone. I went through some much to receive a Cellphone that isn’t unlocked. *I have called and called your Customer Service, were told to purchase a device for $89.00to unlock this cellphone. I am so unhappy. *I have not received my $10.01 refund for a Tablet that were with the Plan I chose(The Get More From Your Tru-Connect Plan”) , which I made Two $10.01 pmts online,were made on 12/1/23 Case#01745339(I did receive refund- I have not received 12/2/23, my Case #01773563 - $10.01 (ORDER#25361040 - APPLICATION ID#B58484-99649PIN#1112 - I did process this order online, it were counseled by TruConnect, I never received a tablet nor phone, from this order.Will you please send me a replacementCellphone for this Defected property. I can’t afford that device to unlock this cellphone  $89.00 . I have never had this problem, so many issues to get a FreeGovt Phone. I am 86yr old fully disabled female. I have had a government free phone years back. I have never had sucha problem. Going through all this is sad. ***My prayer- I plead the blood 🩸 of JESUS over all those who are making it so very hard to get help. Asking God, do this government company know what They’re doing, do they just don’t want to help.Sincerely & Respectfully Mrs Opal Hamilton Message No#(817)557-7031"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Oliver Ransom",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T15:51:58.000Z",
          "Titre": "Their customer servicThe service and the devices are equally…",
          "Contenu": "The service and the devices are equally garbage but it was free.For instance I'm telling my device I want to rate true connect service and devices as one star seeing as how I can't rate them any lower but for some reason I simply can't do that. My data is service is updated the beginning of every month we'll say about the second or the third by the 5th of the 6th I'm completely out of data. I received a tablet as well that I paid $15 for it's never worked not a single day I'm trying to contact customer service but nothing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T21:01:54.000Z",
          "Titre": "They lie and take your acp benefit.",
          "Contenu": "The sales person Cameron came to my house. He said that truconnect doesn't take the acp benefit but in reality, they take the acp. I told him not to take it, I already have a phone service. Since they took the acp, I have to get it back on my phone service. This caused a great inconvenience in my life and I wont be recommending truconnect to anyone. Truconnect lies to your face about the truth of their service. Already notified the BBB."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T19:18:47.000Z",
          "Titre": "You didn't give me a phone nor tablet…",
          "Contenu": "You didn't give me a phone nor tablet but instead a phone number that I cannot call without a phone. You also gave me a Sim card that doesn't work."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tawanya Mussori",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T00:12:32.000Z",
          "Titre": "I was told this was free you charged me…",
          "Contenu": "I was told this was free you charged me $12 I'm going to rebuke it I'm not paying for something you said was free that's a scam Ms. MUSSORI 12.22.23"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nicholas M.",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T17:54:19.000Z",
          "Titre": "All I want to do was to port a #",
          "Contenu": "All I want to do was to port a # to TrueConnect.I do not have the app (No google account to download  it) so I went on the web, but once registered and logged in, there was no way to initiated the process. From the phone, I dialed 611 and believe it or not I had t wait literally over 90 minutes. Once your representative came on line it was very hard to understand him The background noise was overwhelming. I understand it was a call center, but there is no excuse for such loud noise. My suggestion is to have on the web, same feature that (apparently) are on the app. Change contracted call center or have them working from home so that people can hear and understand them; also 90 minutes waiting is not really acceptable. Do not believe me, PLEASE call yourself and see what happens. Over all I hope that the representative was able to initiate the porting of the number."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "P. Alexander.",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:43:22.000Z",
          "Titre": "Cheap phones",
          "Contenu": "The phones you provide are slow with very few options to customize your home screen. Very poor processing speeds."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Justin Eplin",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T18:51:41.000Z",
          "Titre": "My service just all of the sudden quit…",
          "Contenu": "My service just all of the sudden quit working.  Can't find a number to talk to and I just don't know who do from here"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paul Falvella",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T22:55:59.000Z",
          "Titre": "I was given false information when I…",
          "Contenu": "I was given false information when I signed up. I cannot contact anyone at your “company “. Please contact me. You have no customer service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T00:00:05.000Z",
          "Titre": "They Shystie people that you guys have…",
          "Contenu": "They Shystie people that you guys have coming out to our homes selling this is bull crap when we are already on your program only to not go south so that the government don’t pay for a couple of months will it be till we straighten this crap out take the phone in the tablet and shove it up your butt leave my Internet, my home Internet, the F alone"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T07:59:45.000Z",
          "Titre": "The customer service agent could not…",
          "Contenu": "The customer service agent could not explain himself. The language barrier made the conversation useless. I'll have to call back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T21:29:24.000Z",
          "Titre": "I felt uncomfortable with your…",
          "Contenu": "I felt uncomfortable with your representative.  She held me up for almost 2 hours after I told her nevermind she forced me into keeping your phone. She opened it and set the phone up anyway."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "confused customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T19:27:50.000Z",
          "Titre": "Please stop trying to steal my benefits.",
          "Contenu": "I did NOT apply for ACP benefits from you. I've never heard of your company and want nothing and have received nothing from you.I want Verizon to continue to receive it. Please stop trying to steal my benefits."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "T. Sepulveda",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T19:03:56.000Z",
          "Titre": "Poor customer assistance",
          "Contenu": "I did not get the help I  needed. The customer assistance referred me to another assistant that never called me back to fix the problem I'm having. I cannot sign in, so the phone is no use to me"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Not a customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T06:17:46.000Z",
          "Titre": "You do not verify customer email…",
          "Contenu": "You do not verify customer email addresses. All of the email for a new customer with, I am guessing, a similar name (Stephen Spencer) is going to me, and not to your customer. My email address is stephen.spencer (at) gmail.com - it’s not theirs.Also, why not allow email addresses in reviews? How else are you going to contact customers with complaints?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer no longer I hope",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T00:29:10.000Z",
          "Titre": "Predatory program",
          "Contenu": "I called to cancel service, rep was not friendly and my ACP benefit was transferred to truconnect without my permission"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Phil",
          "Nb_Reviews": 6,
          "Date": "2023-12-07T18:26:06.000Z",
          "Titre": "Verify email addresses first!",
          "Contenu": "This company did not check the email address was correct before sending me details about another person. This is a basic, probably THE most basic thing to do - verify an email address. If they are incapable of doing that how much else do you think they are getting wrong?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "D. Davila",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T13:36:10.000Z",
          "Titre": "Save yourself the headache & avoid this company",
          "Contenu": "From the sales lady who came to our door & lied about how easy it would be to port my # from Assurance into the new device I had just purchased from these guys, to the customer service agents who give you incorrect answers to all your questions (when & IF they decide to p/u the phone & answer your call) all the way to the strangely ALWAYS UNAVAILABLE supervisors whenever you ask to speak w/1. This company is shoddy & dodgy. Be prepared to wait just under 2wks for them to mail you a new SIM card 4 your old # 2 port into new device. Oh and have ALL your info from old provider so the request to release your # can be made. And pls know the minute you request to port the #, your old # will be disconnected. That's right, the whole time you're waiting 4 the new sim you'll have NO ACCESS 2 ur old #. These guys need to take honesty training or just plain train your employees better. Better yet, do us all a favor, set your building on fire & call it a day. The world will thank you. Ppl u have been warned..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T15:08:45.000Z",
          "Titre": "My phone doesn't read the sim card and…",
          "Contenu": "My phone doesn't read the sim card and has to have a system reset to work.  The service is very slow and have trouble using apps that I do work from"
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T10:37:29.000Z",
          "Titre": "sign in without my consent",
          "Contenu": "send mail to approve my account, but i never go on their website and never wanted to use their service.th support didn't answer..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Melissa",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T15:43:06.000Z",
          "Titre": "Took to much money and never return part",
          "Contenu": "I got a phone which was good. But I was told that I pay 12 dollars and get free prime and Amazon music. Which I was told that will come soon. I still haven't received that but I figured that will take a little time. Which the gentlemen told me about. But I payed the 12 dollars and it charged me twice on my  zelle so I payed 24 and when I asked the person which I have his name and number to return 12 back to me. I have no response from him at all. So I think it is unfair what this guy is doing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joseph",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T12:15:45.000Z",
          "Titre": "Did not even get to try it,all I got…",
          "Contenu": "Did not even get to try it,all I got was a sim card,I needed a phone,then it was cut off before I got to even try it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jonathan delaneystomer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T02:15:18.000Z",
          "Titre": "Horrible they throttle the Internet its…",
          "Contenu": "Horrible they throttle the Internet its all ready slow as hell they throttled it down 3 xs"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T19:12:25.000Z",
          "Titre": "He transferred my APC without telling…",
          "Contenu": "He transferred my APC without telling me and I don't appreciate that"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael DeWire",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T04:07:29.000Z",
          "Titre": "I only wanted a SIM card",
          "Contenu": "I only wanted a SIM card to put in an iPhone that my son gave me, because he purchased a newer phone. I talked with a person representing reconnect. He told me that the SIM card in the android phone could be used in the iPhone SE. That is not compatible with the iPhone!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T13:27:40.000Z",
          "Titre": "My package was stolen off my porch and…",
          "Contenu": "My package was stolen off my porch and they won't even replace or cancel my phone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Margaret Skoog",
          "Nb_Reviews": 22,
          "Date": "2023-12-13T18:49:34.000Z",
          "Titre": "Day One Was Great And Then It Went DownhillI was thrilled with TC for one day",
          "Contenu": "I was thrilled with TC for one day. Even gave them a 5 star review. On day 2 I had no internet and spent hours on the phone trying to get it fixed. No luck. I will be canceling this service and finding another provider. They also kept trying to sell me a phone and other items."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brittany Carter",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T15:26:09.000Z",
          "Titre": "I received a broken tablet in the mail…",
          "Contenu": "I received a broken tablet in the mail that I paid for and now I have to pay for the shipping to send it back and wait forever to get a new one not good customer service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T18:34:38.000Z",
          "Titre": "The first one they sent worked but now…",
          "Contenu": "The first one they sent worked but now this second one isn't so idk what it's about"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T06:37:24.000Z",
          "Titre": "I can't find the first time here on the…",
          "Contenu": "I can't find the first time here on the Link to activate my phone service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Annoyed customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T18:53:23.000Z",
          "Titre": "They are trying to force me with their…",
          "Contenu": "They are trying to force me with their service after I adamantly told them that I only want the phone if I am eligible for a tablet also!  I have informed them that I will refuse shipment if it arrives! I initially qualified for the phone with a street vendor and I am awaiting the decision of eligibility for the tablet which is supposed to occur Monday. The customer service agent is trying to force a shipment for the phone only!  I received an email regarding shipment after I expressed my conditions of acceptance!  They have even provided me with a phone number in an email!  I did not take the device in which I qualified for from the vendor and I will refuse the device if it’s shipped except under the terms that I specified!  Your customer service agents must be desperate for commission!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nancy Talavera",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T14:46:26.000Z",
          "Titre": "Received phone turned it on used for a…",
          "Contenu": "Received phone turned it on used for a week then turned off carrier network said I had another network if u can help me find out who's my network 813)-397-7594"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T22:22:47.000Z",
          "Titre": "The service itself is great the girl…",
          "Contenu": "The service itself is great the girl who gave me the phone sucks. She said I could transfer my phone number and I can’t. So I hate my phone number"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T06:00:06.000Z",
          "Titre": "Your agent lied to my face",
          "Contenu": "Your agent lied to my face. She told me her Jon was to make sure I received this phone. I told her I don't need it. I have a perfectly good phone and don't need a cheap \"free\" phone. Additionally I explained I have Lifeline with my cable provider. She told me that in no way would this stop me from receiving Lifeline with my cable provider. I grilled her very hard about this fact. She lied and I have lost Lifeline with my cable provider. I never turned the phone on and have since canceled the account. It is unethical to have agents lie. I will be contacting corporate about this matter to make she her employment is terminated."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T21:08:04.000Z",
          "Titre": "I don’t understand how u give someone…",
          "Contenu": "I don’t understand how u give someone service for three day then take the service away for no reason at all l!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer Ronnie smith",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T18:07:33.000Z",
          "Titre": "Never gt my free phone but I gt the sim…",
          "Contenu": "Never gt my free phone but I gt the sim but it's no good with out my free phone so I gave a bad report srry"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T19:51:13.000Z",
          "Titre": "You do not guarantee your packages if…",
          "Contenu": "You do not guarantee your packages if lost or stolen. I paid 11.01 for a tablet I never received and I checked with USPS and they could not find it either. I had proof that at the date time it states it was delivered it was not. Truconnect was not helpful at all and customer care was rude."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Monica",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T02:52:33.000Z",
          "Titre": "I was lied to!",
          "Contenu": "I was lied to!! I was told this wouldn't affect my original phone on lifeline and it did! My original phone stopped working. I'm really upset 😡"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sean Davison",
          "Nb_Reviews": 3,
          "Date": "2023-12-10T12:14:48.000Z",
          "Titre": "Sold me something that took away my…",
          "Contenu": "Sold me something that took away my internet discount while purposely knowing so. Now I have to go through process of cancellation to try to regain my internet discount."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T22:59:42.000Z",
          "Titre": "I never signed up for an account",
          "Contenu": "I never signed up for an account, and can't reach anyone to cancel an account that should have never been opened."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T16:40:53.000Z",
          "Titre": "I asked if it was going to affect my…",
          "Contenu": "I asked if it was going to affect my ACP program they guaranteed me it wouldn’t and it did I called u guys to fix it and u guys aside it’s my problem to fix !!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T03:23:30.000Z",
          "Titre": "My phone was stolen in I haven't been…",
          "Contenu": "My phone was stolen in I haven't been able to get a new one it was stolen out the mail box"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T17:58:54.000Z",
          "Titre": "I didn’t receive my device and was told…",
          "Contenu": "I didn’t receive my device and was told I can’t receive one now since it says delivered. The representative told me I can buy a phone and get another SIM card. She wasn’t helpful at all."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "michael zarro",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T02:32:10.000Z",
          "Titre": "A real joke sends cheap phones and…",
          "Contenu": "A real joke sends cheap phones and customer service is a joke. Do not use them you will be sorry."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "natasha wilcox",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T18:25:54.000Z",
          "Titre": "account was set up fraudulently using…",
          "Contenu": "account was set up fraudulently using my information. I did not sign up from this account. This company is a scam!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T18:55:32.000Z",
          "Titre": "Customer support was awful spoke with 3…",
          "Contenu": "Customer support was awful spoke with 3 people nothing resolved and lack of knowledge and ability to communicate English was extremely poor. On hold for hours"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T22:04:57.000Z",
          "Titre": "Could not get to work",
          "Contenu": "Could not get to work, customer service talked down to me and then said they couldn't help me that it wouldn't work. So I went back to my old company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kala Wright",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T18:46:20.000Z",
          "Titre": "I did not sign up for this service and…",
          "Contenu": "I did not sign up for this service and you keep sending me emails! Get it together. Check your client’s email. And unsubscribe me!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michelle leader",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T19:53:06.000Z",
          "Titre": "My phone will not turn on after…help",
          "Contenu": "My phone will not turn on after charging it I get to to verify its me on my old state phone now phone will not turn on"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tina Whittle-Stocks",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T17:41:21.000Z",
          "Titre": "Worthless",
          "Contenu": "Service is still not working.. it's ridiculous."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Teounta Lewis",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T22:42:40.000Z",
          "Titre": "My number was cut off due to another…",
          "Contenu": "My number was cut off due to another line being added I do not want the new number I would like to have my old number back 804-933-4354. All of my information is with that number"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Don't know",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T15:22:55.000Z",
          "Titre": "Identity Theft Central",
          "Contenu": "Truconnect allows customers to use other peoples identities - and won't fix it when its pointed out.Dishonest company"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T17:53:27.000Z",
          "Titre": "I was told I would get 1 year of Amazon…",
          "Contenu": "I was told I would get 1 year of Amazon prime from the sales person. Which is untrue I only get 2 months free. Very unsatisfied, do not tell customers what you offer and don’t."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T17:54:01.000Z",
          "Titre": "I had a free phone already through acp…",
          "Contenu": "I had a free phone already through acp . They wanted me to help them so I agreed to get their phone , only if it wouldn’t mess with my other line or cut it off which it did. So they lied to me ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "See through the b",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T20:04:46.000Z",
          "Titre": "It's fraudulent they are scammers scammers Liars thieves stealing people's personal information should be reported to the BBB",
          "Contenu": "This s*** stinks to high heaven fraudulent, they are scammers, Liars, thieves, Miss representation, false advertising and the list goes on taking people's personal information and doing God knows what with it.... in my opinion"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T06:21:30.000Z",
          "Titre": "I did not receive anything even and…",
          "Contenu": "I did not receive anything even and getting emails saying thank for your purchase"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T17:32:10.000Z",
          "Titre": "The service was trash basically a waste…",
          "Contenu": "The service was trash basically a waste of time purchased"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T02:54:37.000Z",
          "Titre": "Bad service",
          "Contenu": "You have and expired website I was unable to reach you by phone or Email"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Spencer green",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T04:38:43.000Z",
          "Titre": "I still haven't received my phone I…",
          "Contenu": "I still haven't received my phone I signed up for it and the person doing the sign ups said I didn't get verified and kept my phone"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sandy",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T20:01:30.000Z",
          "Titre": "Need work all way around this company not good",
          "Contenu": "Everything got my plan to sign up for messed up can't get it fixed I'm having to do all the damn online work and research instead of something y'all done y'all feed y'all y'all down just too much work for customer"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Heather",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T19:31:10.000Z",
          "Titre": "The person that signed me up told me…",
          "Contenu": "The person that signed me up told me that it would not interfere with my Verizon ACP but, it certainly did. I spent hours trying to fix things and still need to re-apply after this billing cycle.If you already have a provider either stay with them or with is my suggestion."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Satisfied",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T03:19:25.000Z",
          "Titre": "The Representative I spoke with was…",
          "Contenu": "The Representative I spoke with was nice but the problem was that I asked for unlimited Wi-Fi service in November and I received a hotspot modem that I was charged $60 for. It cost me over $10 to ship it all back, waste of time. The Representatives should know what a wifi router is vs a hotspot modem. I shouldn't have to spend my money to ship incorrect equipment back......"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Henry L. Franklin",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T04:36:20.000Z",
          "Titre": "Given Incorrect info. by your representative. I was told that  I would  insert my old  Sky  Device Send Card into my new Tru connect  mobile phone and receive incoming calls from both numbers.",
          "Contenu": "I WAS GIVEN INCORRECT INFO. BY YOUR REPRESENTATIVE. I WAS INFORMED THAT IS COULD INSERT MY OLD SENT CARD INTO THE NEW TRUCONNECT  PHONE AND MAINTAIN MY OLD PHONE NUMBER FROM THE SKY DEVICE. THAT DO NOT APPEAR TO BE TRUE!!! HOW DO I TRANSFER MY OLD PHONE NUMBER TO MY NEW DEVICE??? MY OLD PHONE NUMBER IS VERY  IMPORTANT TO ME TO MAINTAIN OLD PHONE ### AND CONTACTS.  RESPECTFULLY SUBMITTED, HENRY FRANKLIN   12/12/2023"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Patricia y Tate",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T16:46:25.000Z",
          "Titre": "I still dont have the ACP program on my…",
          "Contenu": "I still dont have the ACP program on my phone it says its still under review it has been since 12/6/23 that I put it in. Please I can not seem to resolve it thank you"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T08:38:14.000Z",
          "Titre": "Sent the completely wrong phone",
          "Contenu": "Sent the completely wrong phone. Was supposed to be receiving a Samsung galaxy OAs or something to that effect and received a cloud mobile something. Had already ordered case and screen protectors for a galaxy so now I'm out that money and still need a case and screen protector for this other phone."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T01:45:26.000Z",
          "Titre": "Told them I wanted to keep my number…",
          "Contenu": "Told them I wanted to keep my number and transfer my fb. He put his own fb and email? I fixed that myself but nothing that I asked before he started , he didn’t do even though he said yes he would!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stationmonitor",
          "Nb_Reviews": 5,
          "Date": "2023-12-17T17:45:41.000Z",
          "Titre": "Read Read Again & Ask Questions!!",
          "Contenu": "The tablet was not suitable for me. Each time I picked it up to use it it had to update & restart. If something is free why did I have to pay $22, while the contract said $12? This program may be ideal for some, but it was a no for me. But thanks anyway.🤔"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael Powell",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T18:05:31.000Z",
          "Titre": "I ordered the duel service",
          "Contenu": "I ordered the duel service. Suppose to get a tablet also. Paid the additional money and did not recieve it!!! Thats not cool.  Phone said it came with a case, no, none there just a screen protector."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Isagani Angeles",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T16:44:39.000Z",
          "Titre": "I'm very confused on how to access some…",
          "Contenu": "I'm very confused on how to access some app and looking for settings to make changes, like setting up my bluethooth connection with my devices."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T05:25:57.000Z",
          "Titre": "The experience with truConnect is the…",
          "Contenu": "The experience with truConnect is the internet goes by to quick and by the time you download the apps to get more internet it's gone and you can't use Wifi to play the games and now you have to wait until they top up the internet and that's if they do it or not my friend is waiting two weeks to get his and still nothing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T19:11:03.000Z",
          "Titre": "I signed up for the life line and acp…",
          "Contenu": "I signed up for the life line and acp with the free phone and to keep my phone number. I received a sim card, no phone was was given a different number. When I called the agent was more interested in trying to sell me a phone then in fixing the issue. So i lost the phone number that I have had for years and have to use a phone with a cracked screen that cuts me in order to have phone service after waiting for several weeks with out phone service at all because when I applied with truconnect my old service shut of my account."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "YMK",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T20:30:31.000Z",
          "Titre": "You do not have live representative…",
          "Contenu": "You do not have live representative available to help new customers with their questions.  When I called I get computer generated requests.  Your online help area does not address my issue either.  I need to speak with a live person."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T13:48:33.000Z",
          "Titre": "Placed my order was told I would…",
          "Contenu": "Placed my order was told I would receive an email if I was approved, which I never received, phone arrived , had to call because I was supposed to receive a year of Amazon prime with my upgraded plan, I called and a beyond rude customer service rep , basically called me a liar !! Oddly enough after talking to rep , email arrived!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Amanda sellards",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T14:50:42.000Z",
          "Titre": "The phone doesn't work well the cell…",
          "Contenu": "The phone doesn't work well the cell phone has a poor connection problem in my area."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tammy",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T17:47:32.000Z",
          "Titre": "Nice people",
          "Contenu": "The young man was very friendly and informative. I  got home after purchasing the phone and the tablet and the tablet is faulty. It keeps shutting down to update when I am trying to set up my truconnect account. The gentleman told me while I was there that they would only be there as long as they had phones available.  So where do I return my tablet?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T06:32:13.000Z",
          "Titre": "The phone is small graphics suck it's…",
          "Contenu": "The phone is small graphics suck it's slow as hell n u only get 5gb of data how is that going to work when I don't work cause I can't have to tv I don't have wifi 24/7 n I have drs appointments n meetings online to do 6-8 times a week for an HR at a time y can't live be easy?? Or at least my phone"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kristen Hathcock",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T16:11:05.000Z",
          "Titre": "My phone has been lost/stolen and when…",
          "Contenu": "My phone has been lost/stolen and when I tried to email customer care it tells me it’s an invalid email address. What should I do?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Christine Marotte",
          "Nb_Reviews": 3,
          "Date": "2023-12-01T23:54:38.000Z",
          "Titre": "I cannot recommend Truconnect",
          "Contenu": "I cannot recommend Truconnect. Dealing with them for anything was not simple. Only extremely time consuming.  I do not believe they are capable of handling the services they claim to offer.  If you have an enrollment ID with another service, the second you sign up with them you lose your service.  And then Truconnect takes their time.  So be prepared to be without a phone.  Almost immediately upon switching to Truconnect I felt it was a mistake.  And you are not able to switch again for thirty days.  Then received an email stating the sim card had arrived.  It was not there.  Got another sim card was only able to put in a previous Stratus C5 which is terrible.  Not staying with Truconnect."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T13:39:15.000Z",
          "Titre": "A lifeline that could cost me my life",
          "Contenu": "A: have an American who knows more than just what computer screen says.    B: make better antennas for your phones.  Mine is a supposedly a lifeline phone, but do the poor reception I get where I live, if my life were actually in peril, it would  be a high probability  that I will be harmed.    I'm only a couple of miles from the tower, yet my signals goes in and out, or I don't get one at all.    If I am not home I get signal, but that does help me because I can't run a mile done the road in the event that something happens.    In actuality I am not able to run a mile at all."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T19:44:45.000Z",
          "Titre": "The performance of the phone and or the…",
          "Contenu": "The performance of the phone and or the signal strength is very poor.."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alexa",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T10:22:16.000Z",
          "Titre": "I ordered a new SIM card from this…",
          "Contenu": "I ordered a new SIM card from this company, because my old one couldn’t see to help me figure out why I couldn’t use my data. So when I ordered the new SIM card it took forever to receive. It took almost 2 weeks for it to finally arrive. Then I registered it to the address I’m currently staying, and I barely get signal. I don’t get signal for the life of me when I’m out trying to complete a DoorDash. I changed phone companies because I didn’t want to deal with not being able use my phone. Now it looks like I’m dealing with it again unfortunately. It sucks because you guys seem like a great phone company, but not where I live I guess. So you need to improve your signal quality in the country because it definitely doesn’t like to receive signal. Other than that, you guys have been a great company."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Becky Brickner",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T18:01:09.000Z",
          "Titre": "Paid extra and got a SIM card only. Disappointed.",
          "Contenu": "I paid extra money to receive a new phone, faster speeds  and a tablet. Waited several weeks to finally get my package and got neither a phone nor a tablet. The only thing I was sent was a SIM card and it is now in a very old phone I happened to have. Not so happy and looking for a new company to switch to asap."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "SUNSHINE",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T18:02:31.000Z",
          "Titre": "My Phone Keep Prompting Me",
          "Contenu": "My phone keep talking to me. It is giving me tenique difficulty. Bad experience! I do apologize for poor rating. What shall I do next?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jerilyn Vogelsang",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T18:35:33.000Z",
          "Titre": "I was told my old phone number would be…",
          "Contenu": "I was told my old phone number would be ported over immediately after I received your SIM card.  Today, I find out you have to send me a blank sim and start over!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T23:55:47.000Z",
          "Titre": "The phone service wasn’t great as…",
          "Contenu": "The phone service wasn’t great as promised, the phone wasn’t responding well to touch, I had to constantly turn it on and off multiple times a day and I just don’t use my phone that much"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T17:55:46.000Z",
          "Titre": "Not sure I thought since I’m a lifeline…",
          "Contenu": "Not sure I thought since I’m a lifeline customer it was free phone,and service not understanding"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Wayne stinehart",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T01:25:11.000Z",
          "Titre": "Phone stopped working no service"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T18:42:05.000Z",
          "Titre": "Spoke with customer service and was…",
          "Contenu": "Spoke with customer service and was informed that we really don’t have unlimited data. Although the plan clearly states UNLIMITED. Once you have used the LIMITED 5G there is no more data. Absolutely deceitful!!!!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jennifer",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T22:28:04.000Z",
          "Titre": "Good.. Not Good!",
          "Contenu": "The service itself worked; however, the purpose of it was to have a phone.  The device received was a hotspot with sms and phone capabilities... Fine if the number calling had no prompts because then it was not recognized!  Needless to say, customer service was no help in getting me what I needed so I ended up ordering from another company"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Shelly Henderson",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T05:53:15.000Z",
          "Titre": "well the service is glitchy when i…",
          "Contenu": "well the service is glitchy when i imput my number says not valid i am a terminally ill person so its to be my life line im sorry but not happy"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ric Powell",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T16:56:20.000Z",
          "Titre": "Unlimited my a**!",
          "Contenu": "Lol! What went wrong THIS time, you ask?Well, for starters, when I switched providers it was because of the \"UNLIMITED\" data I was told I'd be getting......THAT'S laughable! NOT really, I'm actually pissed off!! I'm easily pissed off as it is,I really DON'T need the turtle-slow data to send me into a child-like temper tantrum and DESTROY \"MY PHONE\"(not your provided one)I was totally misled on the unlimited data, I expected to experience a slowdown at around 35 gigs......NOT 10 gigs!!! NOT A HAPPY CAMPER, NOT AT ALL (You should read the review I'm going to leave you ) Good Day!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T05:27:10.000Z",
          "Titre": "Bad signal and service",
          "Contenu": "Was traveling from Mesa Arizona to Colorado and many black spots when my dad had service on his phone service Verizon"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Patricia Cipolla",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T18:10:46.000Z",
          "Titre": "I don't have the internet so hiw can I use a government phone",
          "Contenu": "How can I use a government phone when I don't even have the internet that's not right"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ashley Belanger",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T19:47:49.000Z",
          "Titre": "I ordered a whole phone even picked out…",
          "Contenu": "I ordered a whole phone even picked out the phone and everything bu all I got was a SIM card"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Daneya",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T17:30:31.000Z",
          "Titre": "Bad Representation",
          "Contenu": "First of all the representative at the location was under a tent from a completely different company. He did not inform me that he was going to sign me up for something that required an ACP account. Because of that my ACP discount on my home internet service was canceled and now I have to reapply. Please tell your technicians to be upfront and honest when dealing with people everything changed and I have to fix it and I didn't even get the tablet that he was trying to give me"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nolan",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T02:12:33.000Z",
          "Titre": "Unable to sign up to true connect online"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T17:36:25.000Z",
          "Titre": "Let people know that they have a…",
          "Contenu": "Let people know that they have a payment to make because I was highly unaware."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Janel Brown",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T20:06:01.000Z",
          "Titre": "Didn't get the service I was promised",
          "Contenu": "My phone was disconnected because someone who lives near me got your service and I didn't have service for over a week and lost prospective employment because I couldn't be reached. When I got the SIM card I was also supposed to get a phone but I didn't. Also when I reapplied for service I was given the option of keeping my same number but was given a new one"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Vanessa",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T10:53:42.000Z",
          "Titre": "Help from YouTube",
          "Contenu": "It was okay. If someone really had taken the time to actually help me, maybe it wouldn't have taken me more than an hour to just get to the home screen. I actually had to go to YouTube and find a video to help me. That's how my experience was. Hopefully I wouldn't be needing any help in the future."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T20:28:10.000Z",
          "Titre": "Signing up cost  $60",
          "Contenu": "When I sign up I was told I qualified. But instead of lifeline the agent got me qualified for ACP..which is different. Was not. Only charge $30. More this month and spent the entire day correcting this error.i will be charge another $30 because I takes up to 30 days for them to process another application. So it a cost of $60 total. Not real pleased."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T02:11:03.000Z",
          "Titre": "Promises not delivered",
          "Contenu": "Signal is not very good and data drops completely very frequently and no such thing as the \"high speed internet\" I was encouraged to pay extra for"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T17:38:49.000Z",
          "Titre": "I have the salesman 10$ for Amazon…",
          "Contenu": "I have the salesman 10$ for Amazon Prime. He said I'd receive 1 yr subscription. So far I don't have that service and no way of getting my money back"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T21:58:18.000Z",
          "Titre": "Help!",
          "Contenu": "I was unable to chat w. a csr due to lack of time (I was on a public computer). Waiting for a call back to help w. troubleshooting my phone."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mandi",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T05:42:52.000Z",
          "Titre": "Trustworthy Websites",
          "Contenu": "The certain websites are manageable, but sometimes can be hard to find. Getting onto the web through this site almost made me sick and left me feeling uneasy. I heard a couple a people tell me I shouldn't use this website. I would like to know why before making a purchase. What would you do in this instance and how would you help your customers navigate the web more easily? What would make your customers/including myself trust you, as a web-friendly company, and a trust-worthy salesman?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Vanessa Martinez",
          "Nb_Reviews": 2,
          "Date": "2023-11-14T20:39:41.000Z",
          "Titre": "Don't know if it is freeor pay as you…",
          "Contenu": "Don't know if it is freeor pay as you go with credit card. My voicemail was working now no more and some calls don't connect. Hope I can fix it however not sure I can call Truconnect."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Andrea Lee",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T04:49:52.000Z",
          "Titre": "I signed up for unlimited service and…",
          "Contenu": "I signed up for unlimited service and was approved and now my service is off because I went over data so they cut my whole phone off didn't know that you could go over data with unlimited service!😤 What's the whole point of having unlimited service if it's gonna turn off on you..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Becky",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T23:56:00.000Z",
          "Titre": "SIM card issues",
          "Contenu": "I got the SIM card in the mail the 1st time and my devices would connect but wouldn't connect to the Internet. TruConnect sent me a 2nd SIM card through the mail and the same EXACT issue occurred."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T19:55:06.000Z",
          "Titre": "The phone has issuesissues from the start",
          "Contenu": "The phone has issues. Got stuck during set up and can not complete. Receiving calls from overseas. Not happy"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer LB",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T04:20:42.000Z",
          "Titre": "Well I'm new guy's",
          "Contenu": "Well I'm new, but not a new member to truconect. The experience is well so far, but so far and out, I'm just staying tru to my connect."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Daisy",
          "Nb_Reviews": 2,
          "Date": "2023-10-12T07:23:33.000Z",
          "Titre": "Internet problem",
          "Contenu": "I got Cloud C7 phone from TruConnect booth on 10/9//23. Did everything to setup, but internet is still not working to view any videos without wifi and most times cannot get any internet without wifi.  I have called customer care who tried to help, but still not working."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T17:00:35.000Z",
          "Titre": "What to do?",
          "Contenu": "No communication on what you need to do next."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T08:54:15.000Z",
          "Titre": "Wasn’t notified about activation fees…",
          "Contenu": "Wasn’t notified about activation fees until having all the information he needed I say let the Costner know that there is a Cash fee with no receipt available for the activation fee?????"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ishaan kelley",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T18:38:20.000Z",
          "Titre": "I’m unable to activate a sim with no…",
          "Contenu": "I’m unable to activate a sim with no sim given"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T05:52:44.000Z",
          "Titre": "I need my service back on my phone I…",
          "Contenu": "I need my service back on my phone I still have the phone but no service I can give you the imed"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T02:34:42.000Z",
          "Titre": "I signed up to get a certain new phone…",
          "Contenu": "I signed up to get a certain new phone cause my phone got stolen and I was sent an entirely different phone which is ok but I also wasn't able to transfer my number because of the different brand phone."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Shirley",
          "Nb_Reviews": 6,
          "Date": "2023-11-04T02:36:32.000Z",
          "Titre": "The tablet is not working properly…",
          "Contenu": "The tablet is not working properly there are delays when touch screen. It's very slow when using internet. May I return the tablet for a proper working tablet."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T23:28:00.000Z",
          "Titre": "you say unlimited data",
          "Contenu": "you say unlimited data, but in truth, it is not and you force consumers to either buy more data or wait until the renewal date comes back around."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Susan",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T20:42:20.000Z",
          "Titre": "Having problem getting my tablet to…",
          "Contenu": "Having problem getting my tablet to work on its on."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T20:39:59.000Z",
          "Titre": "It's very slow and won't let me…",
          "Contenu": "It's very slow and won't let me download apps"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Karen Elshoff",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T00:30:38.000Z",
          "Titre": "Only thing about this phone is it will…",
          "Contenu": "Only thing about this phone is it will not allow me to set up voicemail. I've called your help line but could understand the person who answered. Went online and was told the phone had been reset. But when someone calls to leave a voicemail it says, that voicemail mailbox is invalid."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T21:03:15.000Z",
          "Titre": "Old number did not transfer so I called…",
          "Contenu": "Old number did not transfer so I called customer service I got a rep whose accent prevented me from understanding her.  She also was short on patient and I could tell she did not want to be there."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Julio Padilla",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T23:32:27.000Z",
          "Titre": "Representative s need more training",
          "Contenu": "The person that gave me my new phn didn't have the right training and was not able to explain on how to keep my number The majority of employees have forgotten how important a customer is act like they don't have enough time.I lost my number as the help I had for my home Internet.I m disabled and can not work right now.I was not having does issues before."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "mosecustomer",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T19:30:15.000Z",
          "Titre": "Pay attention",
          "Contenu": "after telling the agent I just recertified my acp account he still sold me the tablet and tried to make me lose my acp. Then gave me the wrong sim card. It was for another customers tablet"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mike Wick",
          "Nb_Reviews": 3,
          "Date": "2023-10-03T18:01:25.000Z",
          "Titre": "What's good, What's not so good",
          "Contenu": "What's good: received the Elite device, have been able to populate with many apps I need, I'm at the point where I need to re-port my phone. I did receive a phone # for the account 4097848729.What's not so good: I am still unable to get from Truconnect the guidance needed to complete setting up the tablet. Thanks"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Blanca",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T18:51:25.000Z",
          "Titre": "Im having some issues with the tablet…",
          "Contenu": "Im having some issues with the tablet it turns off by it self"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T17:25:47.000Z",
          "Titre": "The internet is to slow ..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kimberly C",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T21:49:58.000Z",
          "Titre": "Well it started with me transferring…",
          "Contenu": "Well it started with me transferring carriers cause I needed a phone Mine broke. I chose a phome but when it arrived I got a hot spot not a phone. So when I called about it they said they can't fix it I can only order 1 thing per year. So I can receive the SIM card but that's it. So now I'm out a phone . such a bummer."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Agnes D.",
          "Nb_Reviews": 2,
          "Date": "2023-09-26T05:14:34.000Z",
          "Titre": "Tablet",
          "Contenu": "As of now my experience with the tablet I got, not satisfied.  The unit is always on and off, the battery I fully recharged I just used not even an hour become low battery and always turn off automatically. The tablet is a  good deal but not a good quality."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dawyn",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T18:06:10.000Z",
          "Titre": "Disappointed",
          "Contenu": "Sorry to complain but my phone won't work and I don't know the number to this phone."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rhonda Bays",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T12:31:28.000Z",
          "Titre": "Wifi calling"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Christopher",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T07:28:34.000Z",
          "Titre": "Phone service goes in and out",
          "Contenu": "Phone service goes in and out. Txt message don't go through most of the time. Phone calls disconnect every 3 mins. Data works when it wants to."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Wilma Jimenez",
          "Nb_Reviews": 4,
          "Date": "2023-12-07T16:34:49.000Z",
          "Titre": "Can't connect new phone n help phone…",
          "Contenu": "Can't connect new phone n help phone didn't work either.upset"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "cuAndystomer",
          "Nb_Reviews": 2,
          "Date": "2023-11-09T21:45:54.000Z",
          "Titre": "My voicemail doesn't work and I can't get into my Facebook account either so I'm not very happy about it right now, I've called about ten times to fix my problems and it wasn't taken care of yet!!!",
          "Contenu": "My voicemail doesn't work and I can't get into my Facebook account either, still after calling ten times!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Veronica Longoria",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T20:32:54.000Z",
          "Titre": "I have been calling and chatting with…",
          "Contenu": "I have been calling and chatting with representatives and still no help .. my email is incorrect and I cannot log out because I don’t know password because it’s wrong email"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lethea Henderson",
          "Nb_Reviews": 4,
          "Date": "2023-10-31T18:14:06.000Z",
          "Titre": "The phone card didn't work",
          "Contenu": "The phone card didn't work, my phone kept giving me the message \"USSD\" connected or something like that, not exactly sure of the letters."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customerDeborah Frazier",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T18:31:15.000Z",
          "Titre": "I received a phone that I can't use it…",
          "Contenu": "I received a phone that I can't use it have no service"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "FhNwVeH",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T07:26:45.000Z",
          "Titre": "Fh2Nw4VeH1",
          "Contenu": "Hi I think this is a good company they just need more support for their customers it's hard to get in touch with them to renew your plan or even get a new phone like I need myself other then them not being to hands on with their customers it's a decent company actually"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-10-15T17:53:16.000Z",
          "Titre": "Cannot transfer items from one phone to…",
          "Contenu": "Cannot transfer items from one phone to another when I asked operator questions he was not helpful at all. Couldn't give me straight answers"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jermaine grant",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T21:47:01.000Z",
          "Titre": "This is my first time haven't true…",
          "Contenu": "This is my first time haven't true connect n I had my phone for two weeks no water damage or nothing but it don't work n I need help"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Melissa McCrary",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T01:32:36.000Z",
          "Titre": "I was \"approved\" for a phone and…",
          "Contenu": "I was \"approved\" for a phone and tablet.    Only received tablet.     Sim card already in but now can't connect to internet.     I need help sos"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Really Pierre",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T04:27:25.000Z",
          "Titre": "The service didn't stay long it keeps…",
          "Contenu": "The service didn't stay long it keeps saying there are problems not enough Data etc so it's not doing what it claims it can"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Luong Lam",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T08:13:13.000Z",
          "Titre": "Different iPhone Number",
          "Contenu": "I specifically chose to keep my same iPhone number, but you guys still gave me a new number in the SIM card, leading me to not be able to use my unlimited data that I applied for."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "M C",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T00:58:44.000Z",
          "Titre": "The phone doesn't work",
          "Contenu": "The phone doesn't work, no one can hear me from it and there is rarely any signal."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Shantae",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T03:29:39.000Z",
          "Titre": "I was approved for a phone but was told…",
          "Contenu": "I was approved for a phone but was told I wasn't and had to wait three days to get a phone that I was supposed to receive when I signed up with the promise of a free tablet then told I had to reapply for the tablet and pay $30"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T16:55:53.000Z",
          "Titre": "Bad phone",
          "Contenu": "Phone could run smoother very slow"
        },
        {
          "Note": 2,
          "Lieu": "BZ",
          "Pseudo": "Donovan Cacho",
          "Nb_Reviews": 2,
          "Date": "2023-11-19T23:21:23.000Z",
          "Titre": "I just got the tablet with no idea…",
          "Contenu": "I just got the tablet with no idea about what to do. Still don't know if the chip in there provides internet service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mane",
          "Nb_Reviews": 2,
          "Date": "2023-09-14T10:08:47.000Z",
          "Titre": "Hopeful for better follow up next time.",
          "Contenu": "The gentleman who helped us was very helpful and was great overall on the day that he came by. But he was supposed to get back to us regarding our tablet and our change in cash was not given to us. Were not so much even bothered by the change, but it was his word. He did not own up to it. We have still yet to receive any notice or follow up."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ira Stern",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T20:15:03.000Z",
          "Titre": "I am unable to dial out",
          "Contenu": "I am unable to dial out. I spoke to your customer rep twice and they could not help me! I am very frustrated by this! Every time I dial out it says call ended"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customerdonna nelson",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T00:18:30.000Z",
          "Titre": "I can not use this phone!!",
          "Contenu": "I can not use this phone!!! At 68 years old,i cant even see the letters!!! This was a big disappointment. A phone from the 80's. I didnt even activate it!!! Useless."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T02:55:46.000Z",
          "Titre": "The first customer serviced hung up on…",
          "Contenu": "The first customer serviced hung up on me. The second customer service was very good but I would like to cancel the service through TruConnect. Please I would like to send back the cell phone and the tablet. My Son doesn't want them."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer Linda",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T18:52:41.000Z",
          "Titre": "The phone is really slow and some of…",
          "Contenu": "The phone is really slow and some of the features on the phone are turned off so I can’t use it but the service is great"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer Doug",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T23:01:34.000Z",
          "Titre": "The agent I spoke to on the phone was…",
          "Contenu": "The engine I spoke to on the phone was rude and when chatting online with an agent they answered a couple questions and then the chat ended I wasn't ready for that so I think the service sucked"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robbie Barrow",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T20:19:18.000Z",
          "Titre": "Your emails keep saying that I'm…",
          "Contenu": "Your emails keep saying that I'm connected but I cannot make or send calls or text and I can't receive either one"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ariel shamp",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T00:17:04.000Z",
          "Titre": "I got to be honest to your guys's…",
          "Contenu": "I got to be honest to your guys's phones that you send out are just very low quality and not very good I don't know if it's the service or if it's the phone but anytime I've ever gone through you guys it takes a very very long time to accomplish anything on your guys's devices"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Crystal",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T06:43:17.000Z",
          "Titre": "Connection is horrible  my calls drop…",
          "Contenu": "Connection is horrible  my calls drop all day"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T12:02:16.000Z",
          "Titre": "Internet is too slow and never works"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Frank Dawson",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T01:53:29.000Z",
          "Titre": "False advertising …",
          "Contenu": "I did not get the phone that was on you Facebook commercial.  No one answers the phone. A bit of a joke."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rodney Baltimore",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T19:37:45.000Z",
          "Titre": "Representatives are not very not much…",
          "Contenu": "Representatives are not very not much help"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mk",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T23:27:04.000Z",
          "Titre": "Voice mail issues- 2 weeks",
          "Contenu": "No one could leave voice mail.  Took 2 weeks to correct. Tablet has never worked."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Christopher",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T21:50:31.000Z",
          "Titre": "Lifeline only program only gets a free SIM card.  Otherwise good experience.",
          "Contenu": "I docked you 2 significant stars because…. Verses what you make on phones from the government Lifeline and ACP and what Cloud (vendor) charges You for each phone, those only subscribing to Lifeline should get a free Stratus_C7 phone!!!!  Not just a free SIM card.  Had greed not consumed your CEO and board, I’d have given you 5 stars for this encounter with Truconnect."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customerA",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T18:39:04.000Z",
          "Titre": "I didn’t like that I was forced to keep…",
          "Contenu": "I didn’t like that I was forced to keep a phone I don’t need. The sales person was insistent she couldn’t leave without leaving the phone because it’s already registered to the home but proceded to ask for all my information and what she was doing was activating a phone that wasn’t wanted. She was nice but lying isn’t a great way to do sales."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T14:40:24.000Z",
          "Titre": "Conflicting Info: Customer Service",
          "Contenu": "I was told by the first agent that I must call back to activate the tablet and cell phone when I receive them. I called and was told by another agent that these are already activated and there was no need for my call after being in the line for almost 10mins trying to verify and activate my account"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T19:27:03.000Z",
          "Titre": "Phone came fairly quickly",
          "Contenu": "Phone came fairly quickly. Scared me by saying I had ACP which I didn't want. 50/50 on getting a customer service person who knows what is going on. On hold a king time before getting a person. Phone has a glitch with keyboard. 2-4 weeks to get new one"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T14:29:29.000Z",
          "Titre": "Company seems all God and well i had no…",
          "Contenu": "Company seems all God and well i had no issues the helped me get a new phone but the phone i got ismt truly up to speed with today's living wish i had a more up to speed phone bot that im complaining cuase life line is a grwt help..thanks again"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Fadil",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T17:34:14.000Z",
          "Titre": "I disliked that I was poorly informed…",
          "Contenu": "I disliked that I was poorly informed that it would be easy to  switch my old number to the new phone. But other than that the customer service representative was pleasantly nice."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ludie Gueye",
          "Nb_Reviews": 4,
          "Date": "2023-12-15T21:52:40.000Z",
          "Titre": "Didn’t like giving lots of very…",
          "Contenu": "Didn’t like giving lots of very personal information taking pictures of my id both sides of DL made me very uncomfortable I wanted the IPad in which I didn’t qualify because I was on the ACP program which I felt didn’t make sense to me I was told having EBT or ACP qualified me I was disappointed The people were very nice but not very knowledgeable about the program"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Barso mcmillen",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T22:32:17.000Z",
          "Titre": "I just started using trueconnet this…",
          "Contenu": "I just started using trueconnet this month . So far they are great. Thank you for this opportunity."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T18:20:03.000Z",
          "Titre": "Incomprehensible",
          "Contenu": "I still don't fully understand this process. It says that this will only last for one month, and I do not know how to extend it. This company is not forthcoming on this information; they seem to think that subscribers wish to remain in the dark"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jessica urquhart",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T13:05:03.000Z",
          "Titre": "I'm not sure why but my Internet isn't working isn't…",
          "Contenu": "I'm not sure why but my Internet isn't working it worked great for like 3 days and it just stopped. Also I have the broadband thing so I thought it was free but I had to pay 12 dollars I don't know why.. I'm just wondering why the data is not working"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jaazaniah IG:solereaderko",
          "Nb_Reviews": 3,
          "Date": "2023-12-14T22:19:36.000Z",
          "Titre": "The website is old and needs an update",
          "Contenu": "The website is old and needs an update, I didn't receive a tracking number, I waited 11 days to receive the phone. I had to call several times until I spoke to the owner and he told me what was going on. I also dont like the fact I have to wait 7-10 business days just to transfer my old number. But since it was free and has a free unlimited plan I gave it stars nonetheless."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T08:32:42.000Z",
          "Titre": "I bought the phone",
          "Contenu": "I bought the phone, had problems turning it on. You cancelled my warranty period. I had to reapply for Lifeline. Then only get 4.5 GB of Data on my phone? Thank you for finally turning it on though. It just took to long."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "One option??",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T15:34:52.000Z",
          "Titre": "Should offer the mifi units at a far…",
          "Contenu": "Should offer the mifi units at a far cheaper price. I am on a limited income and cannot afford the $60 the mifi hotspot is available for, but there was no other options offered."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T19:44:32.000Z",
          "Titre": "I'm paying $12 for wifi and I  thought…",
          "Contenu": "I'm paying $12 for wifi and I  thought I'd be for the house but I just got a phone witch is ok since I new that was coming but it's already out of database."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customerYLM",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T03:54:52.000Z",
          "Titre": "Watch out even in the least expected places.",
          "Contenu": "I have only had good experiences with Tru Connect. My only downside is the phone. I got the phone and I had to pay $12 when it was supposed to be free, and the tablet was not included. The representative stated it would cost $30 if I wanted the tabletĝ with the plan and the phone. My plan is the Government plan which is supposed to be free. I needed a phone so I paid the $12 dollars. The representative or explanation of service how to or contact information for the provider. I did report this to Tru Connect and so far I haven't heard back.Be mindful of scams even ones you would never suspect and thorough with exchanging information. I wasnt.. I trusted I was getting a bargain."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brent Hansen",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T15:00:41.000Z",
          "Titre": "First install of sim and was getting a…",
          "Contenu": "Update from first install, still having connection problems were my phone ask to stop running task that isnt responding. Have no bars on signal . First install of sim and was getting a mmi code issue, there isn't any singal out here in Kent nd. Soon as I found 1 bar, it connected, still having issues with signing up to truconnect. The app keep telling me there is a network error.  Been going thru troubleshooting. Speedtest give the connection speed at or under 5 mb for downloads. I own a samsung galaxy s10e and has been my phone since it was removed from box. From what I see is the t mobile towers are too far away. Around here.   I feel that this review will not help my issue and they will not get back to me about it. Seems these reviews go unseen or not going to look into it. Free service, means, be happy with what you got."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "anita",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T19:25:37.000Z",
          "Titre": "one of the representatives I spoke with…",
          "Contenu": "one of the representatives I spoke with was very rude. she had a language barrier and accused me of yelling at her when in fact I just needed her to be clear about what she was saying her English was very broken and it was hard understanding her."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Gillens",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T17:45:10.000Z",
          "Titre": "Did not receive a free phone and did…",
          "Contenu": "Did not receive a free phone and did not want to change acp for free internet"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T21:02:17.000Z",
          "Titre": "Didn't receive what I signed up for",
          "Contenu": "Didn't receive what I signed up for. Customer service Didn't reply to my inquiry email."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Douglas Higgins customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T23:22:40.000Z",
          "Titre": "I needed a large screen and didn’t get it Well I can’t see very well because of…",
          "Contenu": "Well I can’t see very well because of my disability and I asked specifically for a large screen phone so that I can make the font larger so that I can read what’s on the screen. And well that didn’t happen so I’m not sure what to do about this mistake"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shay",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T14:15:13.000Z",
          "Titre": "The unlimited data isn’t really…",
          "Contenu": "The unlimited data isn’t really unlimited. But calling and texting is great !"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Johnathan Clark",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T18:43:40.000Z",
          "Titre": "The sim card arrived on time ,but I…",
          "Contenu": "The sim card arrived on time ,but I can't seem to find a cellphone to get it to work. The phones I have are AT&T old phones. The sim card is in this table I'm using right now but I don't want to use it as my phone.  I thought I programmed the sim card to work because I made a call and texted a message but that doesn't seem to work anymore, so after that I tried to sign in and I can't use the password. And after I get it working, would I be able to change it from this tablet to a phone"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Belinda",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T20:11:10.000Z",
          "Titre": "Assistance",
          "Contenu": "I tried calling the 1-800 number. Was not able to speak with anyone. It was all automated. No number to choose to speak with an agent."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T23:22:56.000Z",
          "Titre": "Jill P Rieger",
          "Contenu": "Jill P RiegerI do like the service however it did take longer to get my phone than other companies but as far as I know your the only company that gives Amazon prime free for 3 months and that's awesome however I have no clue how to get the 3 months of free prime I would say so far so good!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T17:47:03.000Z",
          "Titre": "I would like a phone since mine doesn't work with your service",
          "Contenu": "I. Dislike that i got it and it said would would work for my phone and and my phone is supposed to be unlocked so I can use any carrier"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Renee Nash",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T17:40:48.000Z",
          "Titre": "They are helpful in getting you connected",
          "Contenu": "When I signed up I thought I was going to get a new phone but I didn't I got a SIM card.. card works good no issues with the card, was just hoping to get a phone.. my experience with true connect has been great.."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ann",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T04:26:49.000Z",
          "Titre": "My experience has been alright",
          "Contenu": "My experience has been alright. Only not wonderful because there’s not much / enough high speed internet on the mobile hotspot and it only lasted 20 hours before it was all gone."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Elijah",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T06:41:19.000Z",
          "Titre": "MISLEAD ; DUPPED; and such synonyms",
          "Contenu": "I feel as if the advertisements were very misleading to start, I was told getting the tablet and the phone and both were supposed to be connected to the internet but they were 🚫 not .only the phone . speaking of internet I was told if I paid extra I would get FASTER INTERNET speeds and I did for 12.5 gigs and then I got absolutely NO internet. So I don't care what's the point of getting faster speeds just to 12.5 gigs ? Thanks but no thanks. I think I should also let you note: I'm at ADP and lifeline Customer"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MsDee",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T19:16:51.000Z",
          "Titre": "Pro:nice phone",
          "Contenu": "Pro:Nice phone.. Con:I transferred my info from another phone & All the Data was Used.. I haven't had it for 24hours yet..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael whitehurst",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T17:08:40.000Z",
          "Titre": "My phone broke a few months after I got…",
          "Contenu": "My phone broke a few months after I got this service and they refused to help me out by sending me a replacement phone. And I ended up canceling my service completely because I couldn't afford to buy a brand new or even used phone"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Maria L.",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T05:27:07.000Z",
          "Titre": "Cloudy Days",
          "Contenu": "I love the quality of the pictures. The phone has clear sound when I am listening to music. it is small and I like the size."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Allen D Houston",
          "Nb_Reviews": 3,
          "Date": "2023-12-05T18:07:28.000Z",
          "Titre": "I got a couple of attitude and rest…",
          "Contenu": "I got a couple of attitude and rest alsome people I talked to over the phone.. I almost didn't get service, because first person told me can't keep same number have to send a chip again. I call 5 days later told me no problem.."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "mikie",
          "Nb_Reviews": 2,
          "Date": "2023-11-26T20:57:39.000Z",
          "Titre": "Just ok...",
          "Contenu": "I've had a mixed experience. Signed up, even paid $22.01 for extras, the delivery time was awful, almost 2 weeks. Thought I was getting an actual device but didn't, only the SIM card. Phoned customer service & was informed  $10 would be refunded & I would need to purchase a device or use my own (don't have my own). Lots of mixed feelings with this experience. Was excited when signed up now I'm let down to be honest."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nate",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T21:09:11.000Z",
          "Titre": "Mailing address was different than the address it was sent",
          "Contenu": "The phone and service are great but when you mailed the phone it didn't get shipped to the correct address... You asked if I wanted the phone mailed to a different address than the temporary address I was staying at.. I said yes and gave a different address but still ended up getting delivered to the wrong one. Luckily I was still able to get the phone but it definitely caused me some issues when I realized it didn't arrive where I had intended for it to."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nettiegurl",
          "Nb_Reviews": 32,
          "Date": "2023-11-26T23:41:19.000Z",
          "Titre": "Decent burner phone",
          "Contenu": "I wasn't expecting a prime Samsung phone, but definitely not a dollar store burner type. Very poor signal next to battery life. Matching its description to a T. So apparently it IS an extra 'burner'"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bo Jann",
          "Nb_Reviews": 3,
          "Date": "2023-12-12T17:56:17.000Z",
          "Titre": "SCAM! SCAM! The tablet offer is a scam! They deceive you then will cheat you out of it later! SCAM! SCAM!",
          "Contenu": "When I ordered the phone there was no tablet available for $10, but I saw it after on the phone they sent for $10, so I tried to order it. It gave me some kind of error and a number to call. I called and the man said I don’t qualify for it because I didn’t order it with the phone. I told him there was no offer then that I saw with the phone. He said there was an offer I just didn’t choose it. He said it’s $99 now. I told him we can’t afford that and he said there was nothing he could do. A close friend of mine ordered one after he got his phone and there was no problem. He said he can’t help me and was very pushy to get off the phone. I told him this was not fair and I wanted to speak to the manager and he had already hung up on me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Melody",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T20:48:30.000Z",
          "Titre": "Trying out TruConnect",
          "Contenu": "We are just starting out with TruConnect. I can't really say anything about it just yet."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ronald Summerville",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T20:42:11.000Z",
          "Titre": "I'm sure this is a good app here about…",
          "Contenu": "I'm sure this is a good app here about it all the time. But when my family phone rang in place of my true connect phone I was Done. I'll be back but not right back."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T23:44:48.000Z",
          "Titre": "First of all the sim card took 3 weeks…",
          "Contenu": "First of all the sim card took 3 weeks to get to me 2nd it was supposed to be unlimited talk text and data my data cut off yesterday so that wasn't true I'm calling customer service today."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T08:24:21.000Z",
          "Titre": "be more honest",
          "Contenu": "the sales guy did not do a very good job. I was told I have unlimited Wi-Fi and the carrier was Verizon, but when I got home and look at the tablet it says I only have 2g, getting the data from T-Mobile. Wifi was already half way done after my 2yrs son was watching couple of you-tube video. The phone was free but I have to paid for the tablet. I was hoping it was free like other phone carrier. I wouldn't recommended them to my friends and now I feel like I was lied to."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T17:39:48.000Z",
          "Titre": "Well I got the phone and went to try…",
          "Contenu": "Well I got the phone and went to try and check something it started doing some type of reboot and never worked"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Crystal Carpenter",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T03:08:41.000Z",
          "Titre": "Cheap, out of date phone!",
          "Contenu": "The website was easy to navigate. I received my phone with ACP benefits already loaded and ready to use. I really dislike the phone sent to me though. It doesn't have any advanced features such as face id or even fingerprint sensor. It seems very cheap and out of date. I'm used to iphone with iOS system and this phone is android. I am not happy with it at all."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brandy Wells",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T19:05:45.000Z",
          "Titre": "I recently switched from another…",
          "Contenu": "I recently switched from another government phone program to TruConnect because I was having issues with my phone and the service. I love my new phone! The only problem I had was when I tried to use my camera. It wouldn't say \"unsupported media\" when I would go to view the images I took. After I took my SD card out and restarted my phone I was able to take a picture and see the images."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "james s hadfieldcustomer",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T20:01:58.000Z",
          "Titre": "missing my internet",
          "Contenu": "well, what happened to me was, everything was good. had phone a couple of weeks and then I seen an add for a free tablet if you were poor on food stamps (like what true-connect has)  so I didn't know if I applied for the tablet I would lose the internet on your phone!   and on top of that I didn't even get to fill out entire application I don't know why I got shut off for that?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alonso Enriquez",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T20:51:45.000Z",
          "Titre": "Its over all a nice small phone not…",
          "Contenu": "Its over all a nice small phone not gonna lie it's hard to type on with my hands haha"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:34:19.000Z",
          "Titre": "Wish the 4G signal was better."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Seth",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T03:48:17.000Z",
          "Titre": "need stronger signal Service works where I live but doesn't…",
          "Contenu": "Service works where I live but doesn't get higher than half of signal or lower internet stops and says to check my Wi-Fi but otherwise it still works just would like better signal"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "mke",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T23:58:29.000Z",
          "Titre": "I tried to call a few times for help,",
          "Contenu": "I tried to call a few times for help,, stayed on line over 1/2 hour before i finally gave up"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Luis Hernandez",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T17:44:11.000Z",
          "Titre": "Trascendental",
          "Contenu": "Ok, I noticed my address was in, the reason, I don't know hard to setup"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T15:20:09.000Z",
          "Titre": "The screen to the phone is out of sync",
          "Contenu": "The screen to the phone is out of sync, it doesn't work well but I appreciate the shipping speed and the amount of data"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T17:40:57.000Z",
          "Titre": "Where's the offered phone",
          "Contenu": "Love the service, but the phone I was told I was going to get is definitely not the one I received. The only reason I left the carrier I was with is because if the offered phone. I am seriously considering sending this POS phone back and going back to the carrier I was with. SMH can't even get a phone that doesn't constantly freeze up and work halfway decent"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T05:37:05.000Z",
          "Titre": "The phones and tablets are of poor…",
          "Contenu": "The phones and tablets are of poor quality and I didn't come to realize this until I got home.After the transaction I was expected to fork out $22.00.That was a surprise charge I wasn't expecting."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cherie Sortillon",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T07:00:58.000Z",
          "Titre": "Person advertising delivering product. She was great. Nice and curtious",
          "Contenu": "Person was fine. Very curtious and friendly.   Problem I have is with my purchase.  Tablet glitches and consistently freezes.  Not happy with this."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T07:36:13.000Z",
          "Titre": "They keep sending me emaifor surveys…",
          "Contenu": "They keep sending me emaifor surveys and I don’t even have my phone yet"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Check1two",
          "Nb_Reviews": 2,
          "Date": "2023-11-16T17:52:50.000Z",
          "Titre": "Lack of Organization",
          "Contenu": "Phone arrived a lot quicker than stated.    Instead of them transferring my phone number they just made it my emergency phone number and when I asked about it they treated me like I was stupid.      Now I have to wait 7-10 business days for the sim card they are sending and then I have to call them back to activate it.  Noted, your lack of organization will not be forgotten.     They asked me if I knew my pin and I know I set one.    Instead, again, I was talked to like I was stupid, he told me the pin, it ended up being the last 4 digits of my social so they obviously defaulted my answer to that.    Again a lack of organization, makes me wonder who and how are they handling the applicationsOther than having to deal with the pettyness the service is working well.    I guess it's a hiring issue, probably has a group of lazy college graduates who never worked a real job in their life."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "thomas scott",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T18:24:38.000Z",
          "Titre": "phone iffy",
          "Contenu": "service seems good,phone is ok,not enough storage,but works good"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "SHEHOUD/OMAR MOHAMEDYOUSEF",
          "Nb_Reviews": 3,
          "Date": "2023-11-12T12:06:01.000Z",
          "Titre": "Almost no signal",
          "Contenu": "Customer service is good when I called to ask questions they answered professionally and was polite. But I almost have no signal or service  at home, to need to make a call I have to be next the window so I can get a signal. I'm still waiting for the tablet."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T17:32:37.000Z",
          "Titre": "I was under the assumption I was…",
          "Contenu": "I was under the assumption I was getting a new phone and all I received was a SIM card."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T23:47:07.000Z",
          "Titre": "Current dislike",
          "Contenu": "Current dislike, but it might have more to do with where I call to, but when I call one friend the connection keeps cutting out. But when I call them with my old phone, the connection is better.  But other than that, have used the Google maps for navigation purposes and it worked well."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Amber Marie",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T19:42:27.000Z",
          "Titre": "Paying for someone else’s mistakes",
          "Contenu": "Everything was really great until I realized my order was screwed up. I chose a phone and I bought a tablet. Instead of putting the service on the phone they put unlimited talk text and data on a tablet that you clearly only use internet on only. Because of this mistake I had to spend over $50 for another phone just to be able to use the service that I choose for the APC."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Levy",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T00:00:46.000Z",
          "Titre": "Confusing start-up methods",
          "Contenu": "There were several routes to getting started. A phone rep told me to just make any call, but the package had much more complex directions."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michele Dodds",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T10:28:20.000Z",
          "Titre": "I was impressed with the speed .",
          "Contenu": "I was impressed with the speed .. at first. Then for some reason the speed went dead n I barely can load a single site at all ."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jm",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T02:09:16.000Z",
          "Titre": "Customer service",
          "Contenu": "It was unfair the customer service because the lady attended  other customer before me despite I came first."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pat Mcgrew",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T07:44:49.000Z",
          "Titre": "Internet",
          "Contenu": "Since I have had this phone service it has been a week .The service provider has dropped the internet access 4 times and once over 8 hours  . I also have a nother phone t- mobile and it never drops just the internet portion of the service ok thanks pat"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T20:11:47.000Z",
          "Titre": "That is wright",
          "Contenu": "Very cool app its awesome thanks.."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T18:47:09.000Z",
          "Titre": "My service shut off before it was…",
          "Contenu": "My service shut off before it was supposed to and I had to call customer service. Other than. That it was alright."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T17:39:35.000Z",
          "Titre": "Because I wanted a phone with a new…",
          "Contenu": "Because I wanted a phone with a new number and they sent me a Wi-Fi box to use Wi-Fi and I can't return it because they don't let you return it and I don't think that's right"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T07:25:38.000Z",
          "Titre": "You keep saying my data running out…",
          "Contenu": "You keep saying my data running out even that it 15gb data also it works slow"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nikki",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T07:45:33.000Z",
          "Titre": "As a company you have two strikes as of…",
          "Contenu": "As a company you have two strikes as of now. I have tried you for the second time and so far so good but you really should get your act together. I know and trust Verizon so I hope this will be the last time I have to move to another company."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Grateful anyway customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T06:34:32.000Z",
          "Titre": "Phone doesn’t make international calls…",
          "Contenu": "Phone doesn’t make international calls even on free apps"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Samie",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T01:51:59.000Z",
          "Titre": "Glitchy phone",
          "Contenu": "The phone itself is very glitchy and sometimes dose not respond to touch, have to tap it a few times before it will respond."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T23:53:26.000Z",
          "Titre": "Doesnt have enough space.",
          "Contenu": "The phones are a slow and doesn't have enough space but other things is fine"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "VERMYIL THOMAS",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T00:21:32.000Z",
          "Titre": "Well I was also offered a tablet.",
          "Contenu": "Well I was also offered a tablet in addition to the phone and I did not have enough cash or a payment app for the $30 one-time activation fee. I was told that they would return in about 11/2 hours so that I could get the payment and they never returned. I am 65 years old and are skeptical about payment apps as most at my age are.  They should have returned as promised. My daughter has a payment app and was going to make the payment for me. How do I still get the tablet."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JAMES J HERMAN SR",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T19:04:18.000Z",
          "Titre": "We so far so good but I was supposed to…",
          "Contenu": "Well, so far so good but I was supposed to get a tablet with my order and it was not there"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T22:04:37.000Z",
          "Titre": "They said i qualified for a new…",
          "Contenu": "They said i qualified for a new smartphone and I only got a sim card sent to me so when I called he said I have to purchase one though it's been over a yr or use an old device. Which I was looking forward to a new phone as well which is also why u transferred from QLink to TruConnect. I was upsett."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ona Roller",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T02:12:32.000Z",
          "Titre": "The phone sucks",
          "Contenu": "The phone sucks! It has a mind of it's own, seriously! I'm happy to get the phone and service free but phone could work little better."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kathleen Depetro",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T17:53:44.000Z",
          "Titre": "When I got my phone",
          "Contenu": "When I got my phone, I had trouble getting it to connect to the wi-fi instead j can only use my hotspot. The instructions don't explain it to good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tia",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T05:09:02.000Z",
          "Titre": "Really wanted that tablet…",
          "Contenu": "Only didn't give it five stars bc I wanted to purchase the tablet as well and I had eleven dollars on my card and it took a dollar off for hold so I no longer had enough to purchase it so it didn't go thru. But the phone did arrive quickly even tho it said it didn't take. I really wanted that ten dollar tablet. I wasn't aware it was gonna take a dollar hold or I would have waited till I had more money."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charles cowboy austin",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T07:36:27.000Z",
          "Titre": "The phone lagging alot.",
          "Contenu": "The phone lagging alot. Not sure why. Drops calls. I know it's free government phone but shouldn't be lagging."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lisa Zanoni",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T08:47:03.000Z",
          "Titre": "TruConnect was super fast at getting me…",
          "Contenu": "TruConnect was super fast at getting me a phone so I could get started. What I didn't know is you only get 2 gigs of data and turn around and offer unlimited now. Disappointed for sure."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customerFhelan Joe",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T17:42:33.000Z",
          "Titre": "Instagram doesn't play videos"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T19:47:58.000Z",
          "Titre": "thank you for your service"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customerarikka conner",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T04:32:26.000Z",
          "Titre": "i did not recieve a phone only a sim…",
          "Contenu": "i did not recieve a phone only a sim card"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cassandra Wright",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T05:31:10.000Z",
          "Titre": "It was good but the phone is so thin I…",
          "Contenu": "It was good but the phone is so thin I accidentally sat on mine and broke mine and I need mine for doctors appointments."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customJacqueline Blaylock",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T17:20:35.000Z",
          "Titre": "Approve on phone but when they came it…",
          "Contenu": "Approve on phone but when they came it was another thing. Not honest, why take my information on phone then you can't find it in person?? Was not very professional at all."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert Simpson",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T09:32:29.000Z",
          "Titre": "So far so good with one exception I put…",
          "Contenu": "So far so good with one exception I put your sim card in my phone that I had checked for compatibility everything was fine until I dropped my phone and shattered the screen. Not your fault. But what can I do with my sim card?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T19:01:05.000Z",
          "Titre": "I love the service and unlimited…",
          "Contenu": "I love the service and unlimited everything just didnt like the phone that was delivered its extremely outdated and doesnt seem to load anything"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T05:00:57.000Z",
          "Titre": "I am not happy the internet does not…",
          "Contenu": "I am not happy the internet does not work when I leave my home,and work.."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anne Molinari",
          "Nb_Reviews": 3,
          "Date": "2023-11-16T20:20:12.000Z",
          "Titre": "Only request not fulfilled",
          "Contenu": "I requested keeping my phone number and even gave it to the CSA, but it's not the number on my phone.  I'll call and if corrected will give 5 stars!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:04:24.000Z",
          "Titre": "Don't know how many gig a bites I have"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Phillip Atkins",
          "Nb_Reviews": 2,
          "Date": "2023-11-09T19:06:03.000Z",
          "Titre": "Not really happy at all..",
          "Contenu": "I'm happy with the service and how simple it is to receive a sim and put it in your device and that's it, new phone number and connection.Customer service is awful.. They are a waste of time, they have no ability to assist with lifeline issues and give you an 800 number that they know can't help you either. I don't know what they are even there for.Also my screen broke on my phone, there is nothing they will do to help and want $80 for an equivalent phone, $50 for trash or $30 for a flip phone.They know many of these phones are going to the disabled but don't provide or offer cheap cases for phones that stores do not carry cases for and there is no return or exchange, no repairs..I'm on disability, I can't even afford a phone, it's why I'm here.. so obviously I don't have any money.. I just want a device that's not broken. There is glass in my pockets all the time and you can see the hold strip that connects the camera, I had to remove the screen protector just to make the screen respond to touch at all bc it broke that bad.When I'm able to eventually get another free phone, I will order it from another provider and switch my service to them if truconnect doesn't send me another phone to replace this one soon."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T20:08:13.000Z",
          "Titre": "It didn't come with a charger and it…",
          "Contenu": "It didn't come with a charger and it didn't explain if it was already set up or not when I received it."
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "Alice",
          "Nb_Reviews": 5,
          "Date": "2023-11-28T20:05:04.000Z",
          "Titre": "I signed up for SIM card and I thought…",
          "Contenu": "I signed up for SIM card and I thought a tablet for $10.  I received SIM card but no tablet. I called and they said I didn’t sign up for tablet but I have receipt for $12.00. He said I could buy one tho with them over $100. Not a happy camper."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T01:27:46.000Z",
          "Titre": "I love the unlimited talk and text",
          "Contenu": "I love the unlimited talk and text, but the internet runs out so fast."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Job seeker",
          "Nb_Reviews": 2,
          "Date": "2023-10-18T02:53:02.000Z",
          "Titre": "It was super easy to sign up",
          "Contenu": "It was super easy to sign up. A little Miss leading on the phone and it’s capabilities. The phone does it stay charged for long. And other than that a satisfying experience."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T19:36:57.000Z",
          "Titre": "Glad I qualifies for free cellular…",
          "Contenu": "Glad I qualifies for free cellular service. Did not get my same phone # as ordered. I am still waiting for different sim card with my old #."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T21:56:46.000Z",
          "Titre": "Stuff connects but don’t do anything…",
          "Contenu": "Stuff connects but don’t do anything random ppl call it more then I can even use the thing"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T04:31:48.000Z",
          "Titre": "The network is slow and when I use…",
          "Contenu": "The network is slow and when I use hotspot for connect other device the network interump"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dale Williams",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T20:18:48.000Z",
          "Titre": "Confused",
          "Contenu": "I like the service but I was looking for the tablet and not cellphone cause I already have a cellphone and now I got another cell phone"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T21:08:37.000Z",
          "Titre": "I wish the phone was a more current…",
          "Contenu": "I wish the phone was a more current type of smart phone like Samsung s20- s23 and was bigger for a bigger screen this phone feel more outdated"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lacey",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T22:13:50.000Z",
          "Titre": "Good service but.......",
          "Contenu": "Good service and connection but the phone will not let me answer incoming calls! I've tried everything to fix it but nothing works.   Other than that it's pretty good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mdmasum",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T22:55:20.000Z",
          "Titre": "Service is great but free phone really…",
          "Contenu": "Service is great but free phone really very low quality than others ACP and life line wireless service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T16:06:11.000Z",
          "Titre": "What made my experience great was it’s…",
          "Contenu": "What made my experience great was it’s a free phone and it helps out so much with not having to worry about having a phone bill, only down side was the phone it’s self did not work I had to buy one from a friend that would work with the SIM card."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:36:18.000Z",
          "Titre": "Good Service",
          "Contenu": "My phone came in a timely manner. My service is clear and efficient. The internet service is a little slow."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Juan Bautista Garcia c",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T17:59:12.000Z",
          "Titre": "The service is great it's just the…",
          "Contenu": "The service is great it's just the cheap phone that glitch and gets stuck other then that truconnect has great service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Mills",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T22:30:35.000Z",
          "Titre": "it was quick and easy",
          "Contenu": "it was quick and easy. The website is easy to understand and I got the phone before time delivery date"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cassandra",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T16:58:03.000Z",
          "Titre": "Go with TruConnect",
          "Contenu": "Received my phone very quickly. Not the best phone but it's free and so far the service is good. Would recommend TruConnect for anyone looking to get a decent phone and good service for free."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer Rosa Calderon",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T18:50:21.000Z",
          "Titre": "Its a great phone",
          "Contenu": "It's small and it's a great phone to have when you can't afford a phone this is the phone for people that can't afford a phone."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim fox.",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T00:02:17.000Z",
          "Titre": "I had a little trouble at first",
          "Contenu": "I had a little trouble at first. It was my fault because I used my abbreviated name on the application. Once I called them and cleared that up it was  all good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T12:22:06.000Z",
          "Titre": "It's not great for unlimited data we…",
          "Contenu": "It's not great for unlimited data we sure do run out of data real fast I think we should get unlimited data foreal"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Johnny C.",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T00:37:47.000Z",
          "Titre": "Reliable Carrier",
          "Contenu": "Had my device mailed to me Good network coverageReceived a free phone that seems to work well ..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gates",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T17:51:35.000Z",
          "Titre": "It's a good phone, a little slow but over all good phone",
          "Contenu": "It's a good phone, already set up and ready to use and is helpful when your down on your luck, at least you can stay in contact with people."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dale",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T11:36:22.000Z",
          "Titre": "New chance for connection",
          "Contenu": "I've heard of this company and all this stuff for many people for years and now I finally decide to get into it because my main phone carrier is not taking care of the phone that I have insurance on and everything and I paid $350 and they're not doing anything so now I figured I'd give this a try it's so far I'm liking it better"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Porkchop",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T06:19:43.000Z",
          "Titre": "Amazing service",
          "Contenu": "Amazing service, super fast T-Mobile 5g. Only 4 stars because you don't offer a free phone. Give a decent phone and this would easily be the top company"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Randy Mcelhaney",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T18:35:02.000Z",
          "Titre": "Would have been better but it too two…",
          "Contenu": "Would have been better but it too two different agents the 1st was no help and signed me up for things I didn't want. The 2nd was helpful and took care of the issues"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T19:51:31.000Z",
          "Titre": "East to get started I am having signal…",
          "Contenu": "East to get started I am having signal issues when I am In the house but I am sure I can find a resolution for it"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ramona",
          "Nb_Reviews": 7,
          "Date": "2023-12-10T13:11:18.000Z",
          "Titre": "Reason not 5 stars",
          "Contenu": "When I finally got hold of you amd got the card activated I though everything was fine except I couldn't make a phone call as it keep telling me I didn't have service. but the next day I was able to make calls."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matt",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T10:14:28.000Z",
          "Titre": "I received this tablet and I am…",
          "Contenu": "I received this tablet and I am thoroughly happy with it great service great customer service great device"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer Algeria Barfield",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T21:08:09.000Z",
          "Titre": "Everything is good",
          "Contenu": "Everything is good, sometimes the internet server only holds for so long, a lot of buffering other than that the phone is great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nate",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T22:51:13.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good. Very helpful to have, would be nice for phone to be a better quality but it's free so what do ya expect? For what it is tho, not bad. Comes ready to go, can get new number or transfer an existing. Phone comes with screen protector, etc."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T19:26:19.000Z",
          "Titre": "So far so good only time will tell",
          "Contenu": "So far so good only time will tell. Was delivered quickly. A decent phone. So far though that my connect app is not working correctly keeps giving me a network error."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T19:42:57.000Z",
          "Titre": "I like it does exactly what it says…",
          "Contenu": "I like it does exactly what it says it's going to do when I make a phone call it goes through I like that the cause do not drop basically overall it's a trustworthy phone great for what I need. Thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Isa",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T19:38:11.000Z",
          "Titre": "A big help!",
          "Contenu": "A free service because you have government assistance is a good idea there’s some people who are still struggling from the COVID crisis so that is a great help!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T19:46:16.000Z",
          "Titre": "I made an online request and followed…",
          "Contenu": "I made an online request and followed the steps to get my phone within the scheduled timeframe.  The instruction tells me how to do it, so I don't need to call the support to use it.  Thanks."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T06:52:58.000Z",
          "Titre": "No problems with phone it's self just…",
          "Contenu": "No problems with phone it's self just slow wifi connection doesn't matter who's I'm on so I always use data"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Manuel Olivas",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T04:01:16.000Z",
          "Titre": "I bit slow",
          "Contenu": "I bit slow but better than the one I had before, the phone is better also I wish the phone was bigger because of my eyesight problem"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Olivia",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T23:49:06.000Z",
          "Titre": "The young lady was respectful and she…",
          "Contenu": "The young lady was respectful and she answered all my questions. It was convenient that she came to the house instead of me going to them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Linda Terrell",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T12:57:56.000Z",
          "Titre": "Don't have one just yet",
          "Contenu": "I have not experience anything yet I just gotten with this service  but so far so good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T11:46:56.000Z",
          "Titre": "I had a good experience with this…had an overall good experience",
          "Contenu": "I had a good experience with this company, there workers are fast at getting you approved and on with a phone in no time. Provided the necessary information you will need to get started."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dawn Gross",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T09:32:13.000Z",
          "Titre": "No SIM card.",
          "Contenu": "Most everything is straight forward. The only issue was they did not include the SIM, and I need one. Will call this week and get it squared sway."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T19:08:36.000Z",
          "Titre": "The experience was great because I got…",
          "Contenu": "The experience was great because I got front door access to the items and it was great customer service and the network is great"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T23:31:52.000Z",
          "Titre": "It is important now and days to stay…",
          "Contenu": "It is important now and days to stay connected to family and the world. To learn and have wifi and a phone so thanks for providing services for low income families."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T19:45:39.000Z",
          "Titre": "The representative answered all my…",
          "Contenu": "The representative answered all my questions and setup my phone and service great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kevin Joshua murphy",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T00:28:32.000Z",
          "Titre": "It was simple to go through the…",
          "Contenu": "It was simple to go through the application process and you actually get a phone worth a heck and it pics up I live where airtalk straight talk and at&t so on and so forth don't get any signal but I actually get and did mention how nice the phone actually is thanks tru connect best disesion it made was switching over to y'all 😁😎🤔🥳🤣😆😁🥳"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wayne",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T06:04:37.000Z",
          "Titre": "I'm just learning how to operate the my…",
          "Contenu": "I'm just learning how to operate the my tablet , not really tech savvy"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T20:47:26.000Z",
          "Titre": "Love the thought behind this whole…",
          "Contenu": "Love the thought behind this whole thing! It's a very helpful tool for people and me and my family as well! My only issue is the phone and tablets offered are very slow when using. But can't really complain when it's free and very helpful!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T10:12:25.000Z",
          "Titre": "Phone signals are good where i live....",
          "Contenu": "Phone signals are good where i live....Don't have any bad experiences with his company yet."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sharon DiDomizio",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T01:06:57.000Z",
          "Titre": "So far my overall experience with…Pleasantly Pleasant",
          "Contenu": "So far my overall experience with TruConnect has been hassle free and pleasant... Have a Happy Day,!!! Smile!!!😁"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dawnie D",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T16:08:39.000Z",
          "Titre": "Awesome phone and great service so far, BUT, no tablet/service for $10.01?",
          "Contenu": "So far, service is fantastic, and very nice phone! Just did not receive any info on the offer to get a new tablet and Internet services for $10.01.  I tried to do so, but there was no place on website to request the offer.  I had to email customer service and am awaiting a response."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:14:32.000Z",
          "Titre": "I lost my service and true connect…",
          "Contenu": "I lost my service and true connect really came through."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daviey Mitchell",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T00:10:59.000Z",
          "Titre": "The experience was very good",
          "Contenu": "The experience was very good. Your rep was very informative, pleasant, and helpful. He answered all my questions and did all that was needed with minimum efforts from me. He was efficient and did not waste my time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Debra Lohmeyer",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T18:20:48.000Z",
          "Titre": "Customer service made me feel…",
          "Contenu": "Customer service made me feel important, they were people friendly, knowledgeable, and professional.  I will send my friends and family to them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Faith Wallace",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T02:59:24.000Z",
          "Titre": "My experience was great",
          "Contenu": "My experience was great, I had some issues with activation but when I opened the back of my phone and figured out that the sim card was inserted but the holder wasn't locked into place to hold it in, but I am very pleased with everything so far, I received it within 3days of putting in my application"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amber Schoen",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T20:00:50.000Z",
          "Titre": "Phones are worshiped",
          "Contenu": "Service was awesome and on time"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kristin",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T04:43:12.000Z",
          "Titre": "They are very easy to work with and…",
          "Contenu": "They are very easy to work with and have great business ethics!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T23:44:35.000Z",
          "Titre": "Found it very easy to start up phone",
          "Contenu": "Found it very easy to start up phone. I was unable to even use phones in the past due to difficulty in understanding process. I'm thrilled to be able to find a phone that is 1,2,3 simple. Thank you. I love this phone.Janet Ann Baker"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T05:13:44.000Z",
          "Titre": "Well fast data and internet to able to…",
          "Contenu": "Well fast data and internet to able to stay connected with my family and friends, so thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Greg",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T15:06:24.000Z",
          "Titre": "The service was quick and on point",
          "Contenu": "The service was quick and on point. The setup of the phone was simple and easy.  Doing an amazing job truconnect...keep up the great work"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephen Williams",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T18:23:13.000Z",
          "Titre": "The representative that gave me my phone was fantastic good job.",
          "Contenu": "The rep that gave me my phone was fantastic she explained everything to me she did a great job."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "cjennifer tucker",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T05:05:29.000Z",
          "Titre": "the guy was very helpful and friendly…",
          "Contenu": "the guy was very helpful and friendly the prosses was quick and he made sure my device was working correctly befor i left i would def refer friends"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tiffiny",
          "Nb_Reviews": 2,
          "Date": "2023-11-25T18:23:11.000Z",
          "Titre": "New # who dis?",
          "Contenu": "Phone numbers need to sit dormant for a bit before being given to a new customer. I had a ton of texts for the old customer as SOON as I turned phone on, then the phone calls for that person began. It's a hassle NOBODY wants."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T02:02:19.000Z",
          "Titre": "Easy to connect and activate whole…",
          "Contenu": "Easy to connect and activate whole process from applying and activating service was only3 or 4 days total only took a couple min after receiving Sim card"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JM",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T21:32:12.000Z",
          "Titre": "Easy to apply",
          "Contenu": "Easy to apply, insert sim card. Wait time for shipping was slow! Card sat at distribution center for a week before being shipped to me"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Spence.",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T17:58:41.000Z",
          "Titre": "Good phone, excellent puick and easy.",
          "Contenu": "Just in the time of need. Your representative did very well. Have a question about the free year of Amazon prime video. If you could get back to me it would be greatly appreciated"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer. Mr. Larkin.",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T21:54:03.000Z",
          "Titre": "It was good I didn't know I could get…",
          "Contenu": "It was good I didn't know I could get it the young man was very helpful with hooking up the technology."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T13:07:55.000Z",
          "Titre": "Overall great just wish you used more…",
          "Contenu": "Overall great just wish you used more towers"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Leola",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T00:53:42.000Z",
          "Titre": "Good customer support is important and my customer representative was knowledgeable and helpful.",
          "Contenu": "The customer service representative. Helped me to get out of service l did not approve and get signed in to my new service. She did an excellent job."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephen",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T20:57:16.000Z",
          "Titre": "Easy process and the young man was very…",
          "Contenu": "Easy process and the young man was very engaging."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Isbel Gonzalez",
          "Nb_Reviews": 3,
          "Date": "2023-12-10T02:17:27.000Z",
          "Titre": "Good phone and easy",
          "Contenu": "So far good phone, fast easy set up. Customer service is helpful and friendly"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MICHAEL WILKERSON",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T21:39:42.000Z",
          "Titre": "I thank the True Connect for this free…",
          "Contenu": "I thank the True Connect for this free phone for I am on SDI and this phone will allow me to eat better and still have a phone that works. May God bless you all who help others."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T18:52:33.000Z",
          "Titre": "Quickness of getting it"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T19:04:54.000Z",
          "Titre": "Well u said that u were doing something…",
          "Contenu": "Well u said that u were doing something and u kept ur word thank u"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alice Fuentes",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T03:22:10.000Z",
          "Titre": "The representative was very helpful and…",
          "Contenu": "The representative was very helpful and I got thru application quicker then my past ones"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Smith",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T17:45:34.000Z",
          "Titre": "Ok… but",
          "Contenu": "Everything went well except the the fact I was billed for Amazon prime and I didn’t want it"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shirley  moniz",
          "Nb_Reviews": 4,
          "Date": "2023-11-23T07:46:40.000Z",
          "Titre": "I had to call Customer Service because…",
          "Contenu": "I had to call Customer Service because I was having some trouble with my phone signing up. Customer Service was very friendly and helped me quickly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Margurite Lamb",
          "Nb_Reviews": 2,
          "Date": "2023-11-25T17:39:20.000Z",
          "Titre": "Service was great shipping was fast",
          "Contenu": "Service was great shipping was fast. My only problem is activating the phone I can’t get pass the area code it froze the phone completely."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T01:55:16.000Z",
          "Titre": "Just received my package from…",
          "Contenu": "Just received my package from TruConnect and so far everything has worked fine."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T21:09:05.000Z",
          "Titre": "It was easy to start the phone",
          "Contenu": "It was easy to start the phone. But the data went out and I had to contact customer service to fix it. I'm glad it only took one quick call to fix it, so, overall the service has been good.  👍"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Edward",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T17:50:31.000Z",
          "Titre": "No hassle of SIM connection to…",
          "Contenu": "No hassle of SIM connection to installed into phone"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Fred Cabansag",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:57:17.000Z",
          "Titre": "great services"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Samantha Anderson",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T17:55:39.000Z",
          "Titre": "Very happy with my service the delivery…",
          "Contenu": "Very happy with my service the delivery of my phone was so very prompt I received it within 2 days of being accepted I definitely would recommend trueconnect"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Derick",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:12:59.000Z",
          "Titre": "Came quickly",
          "Contenu": "Came quickly,  phone is cheap but you can't beat free 🤷‍♂️"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shelly",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T03:29:37.000Z",
          "Titre": "My package came on time and with…",
          "Contenu": "My package came on time and with everything I was promised. Also, everything worked."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T04:28:30.000Z",
          "Titre": "My services and phone actually work"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "cuWanda Harris stomer",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T22:17:22.000Z",
          "Titre": "Nice to get a phone and tablet",
          "Contenu": "Nice to get a phone and tablet.  The representative was professional and nice and explained well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T18:17:00.000Z",
          "Titre": "Better than expected",
          "Contenu": "The phone is ready and arrived quickly. Not a small cheap phone but not top of the line better quality than I thought it would be."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T15:54:43.000Z",
          "Titre": "Good service about truconnect",
          "Contenu": "It was good the phones could be a little updated and a little newer but other than that it was Farley good"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer Robert",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T20:31:23.000Z",
          "Titre": "Truconnect it's the way to go",
          "Contenu": "Well for starters I didn't know I had the SIM card and it's been like 2 weeks I haven't put it in my phone and it took it right away"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T04:45:16.000Z",
          "Titre": "I received everything just fine",
          "Contenu": "I received everything just fine. It was difficult to set up the phone. It took several hours."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dorothy",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T02:16:27.000Z",
          "Titre": "It's a great phone-clearpicture-ring on…",
          "Contenu": "It's a great phone-clearpicture-ring on the phone is great. the only thing I have with the phone is I don't like how I have to turn phone to get into phone"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T23:31:26.000Z",
          "Titre": "I like the phone service for myself and…",
          "Contenu": "I like the phone service for myself and  tablet now. The company offered both items at very good low price. RAVINA FRY"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T18:09:43.000Z",
          "Titre": "My service rep was very knowledgeable…",
          "Contenu": "My service rep was very knowledgeable and answered all my questions. The whole process was safe and very quick."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lee",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T17:48:00.000Z",
          "Titre": "It wasn't great",
          "Contenu": "It wasn't great. But it was okay. I honestly thought your company and offer were a scamHappy to find out you weren't."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T17:56:57.000Z",
          "Titre": "Person who help me was very polite…",
          "Contenu": "Person who help me was very polite explain things to my understanding well manner rep"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T02:44:20.000Z",
          "Titre": "Quick delivery of phone but the phone…",
          "Contenu": "Quick delivery of phone but the phone could be a little bit more technologically advanced"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel Mathew Edmunds",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T23:54:11.000Z",
          "Titre": "great customer service also appreciated…",
          "Contenu": "great customer service also appreciated the patience that Ms. Angel had. Highly appreciate all the help that i received"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charita Hopkins",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T18:43:33.000Z",
          "Titre": "I was promised a 2 month free…",
          "Contenu": "I was promised a 2 month free subscription to Amazon, and I didn't receive my subscription."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thressa Babers",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T19:16:07.000Z",
          "Titre": "The representative was every friendly…",
          "Contenu": "The representative was every friendly and knowledgeable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dakota Rose",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T05:23:13.000Z",
          "Titre": "The sales reps that I was privileged to…",
          "Contenu": "The sales reps that I was privileged to meet and probably the roughest neighborhood in San Francisco, the tenderloin District, they were relatable, Interactive and cute af!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brad McCune",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T17:59:48.000Z",
          "Titre": "Service is phenomenal but the phone is…",
          "Contenu": "Service is phenomenal but the phone is very basic"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T17:58:29.000Z",
          "Titre": "Got it super fast very simple to set up…",
          "Contenu": "Got it super fast very simple to set up thank you!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T23:47:50.000Z",
          "Titre": "Very easy to deal with",
          "Contenu": "Very easy to deal with. They sent me my phone quickly and now I have a phone that I can use for almost every thing that a normal phone plan would have minus the cost! A real life saver"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Coretta Harris",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T20:34:01.000Z",
          "Titre": "The Salesperson Was Really NICE &…",
          "Contenu": "The Salesperson Was Really NICE & POLITE!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gloria Shafer",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T18:56:14.000Z",
          "Titre": "Great experience",
          "Contenu": "The young representatives were very helpful.  I was thrilled that I qualified for this service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T18:02:16.000Z",
          "Titre": "Thank you",
          "Contenu": "Thank you, You came at a time  in need!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tacinca Laducer",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T09:53:13.000Z",
          "Titre": "helpful when ask questions"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T02:59:57.000Z",
          "Titre": "customer service was great however got…",
          "Contenu": "customer service was great however got several emails saying order was incomplete so I called and customer service continued to say the order was being shipped which it did"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephanie h",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T21:20:40.000Z",
          "Titre": "I mean so far since I've been using…",
          "Contenu": "I mean so far since I've been using this phone I have had no problem I am able to log in to everything service has been working very fast the phone they sent me is awesome as well and I'm just happy they care to help all there customers with a new phone and free plan to help us make it in life without having to worry how to get a hold of family and jobs offers thank you guys"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tamara",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T05:27:27.000Z",
          "Titre": "Ease of use and excellent quality calls"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "demareia saxon jones",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T15:50:19.000Z",
          "Titre": "Came in handy for me when we needed it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sally Lee Crouch",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T20:14:19.000Z",
          "Titre": "Joseph",
          "Contenu": "Joseph, was an exceptional representative who was going door to door with Tru connect phones and tablets. He expressed great information as well as patience explaining how it works and not to mention setti g it up for me. He was great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melissa W",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:54:06.000Z",
          "Titre": "don't ever go through assurance wireless",
          "Contenu": "I just received my new phone on December 19th.  I am really impressed on how quickly my application got processed and delivered.  I already had been without a phone for over a month due to circumstances with the other provider I was using (assurance wireless) and they had disconnected my phone. because of none use. Phone broke and they would not replace it. Received a lot nicer phone too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michelle Van Ness",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T21:22:35.000Z",
          "Titre": "Excellent Customer Service",
          "Contenu": "I had a representative come to my door to offer me this wonderful phone & tablet on this service.  My current service refuses to upgrade me even though I've been with them for over 2 years. The Rep got me qualified and activated both for cell service and the tablet and explained thoroughly how to get my number transferred to the new phone. When I called to get the number transferred that Rep was very kind and also thoroughly explained the process of getting my number transferred. In all I've had a great experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T08:06:32.000Z",
          "Titre": "A Professional/Sincere Presentation",
          "Contenu": "The people introducing the program are extremely important.  Must relate well to the public. Must be personable, not pushy.    Must know their product and be able to explain the program clearly and understandably.  Must convey a sense of caring and desire to help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brent Hudson",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T20:10:39.000Z",
          "Titre": "True Connect Helps Me Stay Connected",
          "Contenu": "I returned from a job to find my new phone waiting securely in my mail box. Set up was easy and I was pleased that my sim card was already installed and I could start making calls right away.As a senior citizen on a fixed income with a chronic disease, I find True Connect and the ACP program to be essential."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew Customer Nance",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T22:54:58.000Z",
          "Titre": "Review",
          "Contenu": "Well, Just to be honest, I have to say that I'm very impressed with the service and some of the features. The phone I got wasn't the greatest phone but one thing is for surethe price was right so that being said I'm not complaining. AT ALL! I am actually quite greatful in fact!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T21:32:06.000Z",
          "Titre": "I had no idea I qualified and it was…",
          "Contenu": "I had no idea I qualified and it was sooo fast to find out! Absolutely blown away at the quality of the products as well!!! As a full time college student this was such a blessing and the lady that helped me was absolutely wonderful to work with 🙂"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shannon Mullaney",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T19:05:33.000Z",
          "Titre": "I want to say thank you if it wasn't…",
          "Contenu": "I want to say thank you if it wasn't for true connect I wouldn't b able to things that I couldn't before like get a phone call for jobs and for other important stuff I have going on in my life I have been having a wonderful experience with my new phone and I can hear clearly and I get every phone call. So thank you so very much from the bottom of my heart."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amber Conner",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T17:38:27.000Z",
          "Titre": "My benefits changed over fast",
          "Contenu": "My benefits changed over fast. My phone arrived very very fast. Set up was easy but I needed a little bit of help with the voicemail because I couldn't figure it out. I spoke to one of your customer service reps I think her name was Rhonda. She was very nice, polite and professional. She explained things clearly. The rest of the setup went very easy because she helped me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin W",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T17:49:25.000Z",
          "Titre": "The sign up process was very easy and…",
          "Contenu": "The sign up process was very easy and explain thoroughly. I promptly got accepted. And guided to the next steps. It only took a few days for my phone to arrive. My experience has been wonderful so far!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andres Luz",
          "Nb_Reviews": 4,
          "Date": "2023-12-21T20:42:00.000Z",
          "Titre": "Easy, low-cost sign-up",
          "Contenu": "I like how the program utilizes the ACP benefit such that there is little upfront charge for the end-user upon sign-up which includes a 12-month service agreement in place."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Kennedy",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T19:40:22.000Z",
          "Titre": "I would recommend friends to do this",
          "Contenu": "I would recommend friends to do this. It was fast and easy process. Also the product is very nice. The phone is easy to use and you also have the option to get a nice tablet for $10.00. The customer service lady was very nice and answered questions that I asked and very helpful. There is no question about truconnect if you have the opportunity take it and you would be very satisfied.  Thank you truconnect"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank B.",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T17:54:38.000Z",
          "Titre": "Worry Free",
          "Contenu": "It was simple, transparent, and no waiting. Did exactly what they said they would do and amazingly fast getting me connected. I didn't really expect things to be this good. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tina marie",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T17:07:14.000Z",
          "Titre": "I always have service as that as I call out the 1st of every month",
          "Contenu": "I love it I'm thankful 4 this phone and service plus I have low income and this helps and I can keep up with my doctors appointments and my family also ty true connect"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T19:10:34.000Z",
          "Titre": "Because we don't have Wi-Fi",
          "Contenu": "Because we don't have Wi-Fi, I needed a little information to set up the phone. The customer service was helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lorena",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T01:51:32.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service, Alondra was very friendly but also professional. Service was explained thoroughly.  And fast and easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kris",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T16:37:18.000Z",
          "Titre": "Phone Came Ready To Use With Just 1…",
          "Contenu": "Phone Came Ready To Use With Just 1 Call an Creation of A Google Account. By Far Best Free Phone I’ve Ever Owned Before. Used Other Providers In The Past An The Phone Alone Sucked. Came Broken/Non Working After Shipment To Me.  An You Had to Wait For Sim Cards to Go With Hence With This Provider You Don’t Have to It Comes Ready. Quick Phone. Not Too Cheap Looking."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T22:23:02.000Z",
          "Titre": "No Id required!",
          "Contenu": "For those who need a phone and are receiving benefits through the state and have no Id, this company is will help you get a phone asap."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Emma Hunte García Ocampo",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T17:53:55.000Z",
          "Titre": "I'm a proud USMC veteran who served 10 Years over seas for this country",
          "Contenu": "I'm a proud USMC veteran who servido 10 Years over seas for this country and i'm a proud proud customer"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joann Payne",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T17:38:12.000Z",
          "Titre": "I love the understanding and help from…",
          "Contenu": "I love the understanding and help from the people who I spoke with and thankful for them helping me switch from assurance wireless. I will not be going back to assurance wireless"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T00:41:42.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use. Able to retrieve old important information easily. Fast. Arrives with screen protector. Fast at charging."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aaron Davis",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T20:50:33.000Z",
          "Titre": "Y'all are the best cause now I get to…",
          "Contenu": "Y'all are the best cause now I get to talk to my brother and I get to try and get back in school online cause I can't walk thank you all for everything"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T17:56:31.000Z",
          "Titre": "Phone works great easy service…",
          "Contenu": "Phone works great easy service activation when phone arrives also gets great service everywhere so far. So far I'm really pleased"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peggy Wood",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T18:12:47.000Z",
          "Titre": "This phone works better than the one I…",
          "Contenu": "This phone works better than the one I paid a couple of hundred dollars for. And the connection is even better"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T20:03:35.000Z",
          "Titre": "It’s a wonderful service",
          "Contenu": "The experience with Tru Connect gives me freedom to use a phone service without having to pay a monthly bill when I am on  bc a fixed income"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barbara Boudokhane",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T18:22:03.000Z",
          "Titre": "the representative was top notch",
          "Contenu": "the representative was top notch. The service is free. i am low income and it will save me roughly 600$ next year....consequential savings"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Annette",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T19:25:30.000Z",
          "Titre": "Was able to walk me thru the process of…",
          "Contenu": "Was able to walk me thru the process of installing my chip and keeping my same phone number"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T18:59:14.000Z",
          "Titre": "I got my phone in the matter of 10…",
          "Contenu": "I got my phone in the matter of 10 minutes when I tried to do it online. It wouldn't go thso when I seen them sit in outside of Kroger's. I tried again and it went through within ten minutes and the service has been great so far"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T20:23:03.000Z",
          "Titre": "I just love my new phone and the…",
          "Contenu": "I just love my new phone and the experiments on it overall it's a great phone thank you all very much Merry Christmas"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T21:34:20.000Z",
          "Titre": "Number transfer was seamless",
          "Contenu": "Number transfer was seamless, painless, incredibly quick and easy. Outstanding customer service with little to no wait time. Superb company"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Crystal Barton",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T17:41:17.000Z",
          "Titre": "… excellent customer service",
          "Contenu": "Fast approval you get your sim card quickly the service is great so far I love it thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:44:35.000Z",
          "Titre": "very nice people and great customer…",
          "Contenu": "very nice people and great customer service ! explain well there services !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carolyn Leatherman",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T23:15:16.000Z",
          "Titre": "So far so good I'm going to see how the…",
          "Contenu": "So far so good I'm going to see how the service works and hopefully I'll be able to leave this rating"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T13:17:08.000Z",
          "Titre": "They was sweet and very nice",
          "Contenu": "They was sweet and very nice, answered every question I had answered I can tell through the phone from their voice they had a smile on their face."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T17:58:02.000Z",
          "Titre": "Making sure that the customer is all…",
          "Contenu": "Making sure that the customer is all right with everything and satisfied."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Johnny Macias",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T19:48:40.000Z",
          "Titre": "I recently became a tru connect…",
          "Contenu": "I recently became a tru connect customer and this service is my favorite because I have this service that I can rely on, thanks for the help tru connect."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T19:11:19.000Z",
          "Titre": "Sending me a free phone",
          "Contenu": "Sending me a free phone. But was not to happy that it was sent to my mail box though when it should of went to my PO box. But I got it. I don't use my mail box at all because of ppl taken stuff outta them"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Timothy Webster",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:48:30.000Z",
          "Titre": "Essential service …",
          "Contenu": "Having Verizon will help me stay in touch with my family and friends"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deb Douglas",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T20:13:16.000Z",
          "Titre": "Speed of acceptance…",
          "Contenu": "Quick turnaround getting phone except that I clicked on getting a tablet for $10.01I would like that option"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Katina",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T04:09:32.000Z",
          "Titre": "I love it working good so far I wish o…",
          "Contenu": "I love it working good so far I wish o can see my information on the app"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T18:12:49.000Z",
          "Titre": "Am happy with my unlimited talk text an…",
          "Contenu": "Am happy with my unlimited talk text an data I will let other know about True Comet"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:20:18.000Z",
          "Titre": "It was a very easy application and easy…",
          "Contenu": "It was a very easy application and easy to have my service transferred. My devices came 3days later very happy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:22:17.000Z",
          "Titre": "Happy to have a phone I couldn't afford…",
          "Contenu": "Happy to have a phone I couldn't afford one before or a monthly payment"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T06:10:58.000Z",
          "Titre": "I am enjoying my truconnect and it was…",
          "Contenu": "I am enjoying my truconnect and it was easy to sign up. It came in a timely manner and I can now reach the people I need to. Thanks TryConnect"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T19:38:41.000Z",
          "Titre": "Everything about it was fantastic",
          "Contenu": "Everything about it was fantastic! I would highly recommend to everyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Renay Ivana",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T19:15:57.000Z",
          "Titre": "Other companies never lived up to my expectations",
          "Contenu": "I have tried to sign up for other companies for a free cell phone service and free cell phone through the ACP program and never received the phone or the SIM cards and truconnect sent me my phone so quick and the service was actually on the phone and I'm really happy that happened , thank you so much truconnect."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janet",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T03:36:02.000Z",
          "Titre": "Great Experience…",
          "Contenu": "The salesperson was great and a surprise visit. My phone was running in a few minutes. Thank you for the free mobile phone!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lynette Sheldon",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T17:48:16.000Z",
          "Titre": "Great customer service",
          "Contenu": "The vendor was very polite and personable. He made my Autistic son feel very comfortable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rodney Anderson",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T19:25:27.000Z",
          "Titre": "I returned to truconnect after trying…",
          "Contenu": "I returned to truconnect after trying another carrier I should have stayed with them I've always had service and they treat me like they appreciate my business"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erick",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T09:06:59.000Z",
          "Titre": "So easy",
          "Contenu": "So easy, every aspect of the process that I can only be grateful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BRENDA RIVERA",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T17:12:26.000Z",
          "Titre": "The individual that set up my devices…",
          "Contenu": "The individual that set up my devices was friendly and helpful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deanne",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T22:33:08.000Z",
          "Titre": "New to Tru",
          "Contenu": "I received order fast and everything was ready and super easy to get started ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Todd Eley",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:47:01.000Z",
          "Titre": "The call quality is good and the plans…",
          "Contenu": "The call quality is good and the plans are reasonable I'm happy with my phone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gregory G",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T18:15:35.000Z",
          "Titre": "Satisfied Experience",
          "Contenu": "I was approved and received the phone in a very timely manner. Setting up the phone was a breeze as well. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "PR",
          "Pseudo": "Ernesto Robles",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T16:20:55.000Z",
          "Titre": "Norma have a very Nice scence of what's…",
          "Contenu": "Norma have a very Nice scence of what's customer service it THANKS"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer Ernestine Booker",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T18:00:47.000Z",
          "Titre": "The young lady was very professional…",
          "Contenu": "The young lady was very professional and she explained everything about the phone to me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laura",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T16:12:54.000Z",
          "Titre": "It was fast convenient and easy",
          "Contenu": "It was fast convenient and easy. No headaches or hiccups. Great company so far"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tonya Olerich",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T21:36:05.000Z",
          "Titre": "It's a great government phone and it…",
          "Contenu": "It's a great government phone and it works great thank you I will tell my friends about you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fernando Hernandez",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T09:42:51.000Z",
          "Titre": "Great connection fast Internet keep up…",
          "Contenu": "Great connection fast Internet keep up the Great work it is appreciated"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T18:01:12.000Z",
          "Titre": "Great and knowledgeable…",
          "Contenu": "They were very polite and knowledgeable of the product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T20:43:23.000Z",
          "Titre": "Very helpful with giving the right…",
          "Contenu": "Very helpful with giving the right information I needed. Professional and kind."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T15:07:25.000Z",
          "Titre": "The associate that helped me @ orange…",
          "Contenu": "The associate that helped me @ orange county social services office went above n beyond 2 fix my phone issue n I am so appreciative of the knowledgeable helpful young man, great personality even better customer service he needs 2 b promoted!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vancillia Oliver",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T20:21:39.000Z",
          "Titre": "The quality of the products",
          "Contenu": "The quality of the products. They are just like all the other name brand phones and tablets. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T21:12:04.000Z",
          "Titre": "I just got the phone",
          "Contenu": "I just got the phone a day or so ago, so this is a preliminary rating...."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:19:23.000Z",
          "Titre": "Easy for 70+ people …",
          "Contenu": "The sign up experience was easy for those of us over 70+"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tinamarie Toves",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T10:52:39.000Z",
          "Titre": "Great service..no glitches..and better…",
          "Contenu": "Great service..no glitches..and better than most companies."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pookie",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:41:12.000Z",
          "Titre": "So far I'm very pleased with my phone.",
          "Contenu": "So far I'm very pleased with my TruConnect phone. It works so fast and was easy to get it going."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T18:42:35.000Z",
          "Titre": "This is a great experience and the help…",
          "Contenu": "This is a great experience and the help is very needed"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brandie W.",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T16:16:10.000Z",
          "Titre": "They were very helpful and quickly…",
          "Contenu": "They were very helpful and quickly responded to my needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chance last",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T16:09:40.000Z",
          "Titre": "Great service",
          "Contenu": "Great serviceGood experience good service everything you can expect"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T19:07:46.000Z",
          "Titre": "The delivery was fast and the service is great",
          "Contenu": "I'm very happy happy with how fast my phone was delivered and the service is great thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T20:00:35.000Z",
          "Titre": "The guy was extremely helpful and…",
          "Contenu": "The guy was extremely helpful and patient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "X Cortes",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T17:41:23.000Z",
          "Titre": "Xavier review …",
          "Contenu": "This made it easier to connect wit people I love thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barbara J. Osborn",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T20:28:43.000Z",
          "Titre": "The best deal ever!",
          "Contenu": "I am very pleased with my new smart phone.  It’s easy to operate and fun to use!  This is my first smart phone ever!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles Lockhart Nash Jr",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T20:15:43.000Z",
          "Titre": "Brand new phone.... Simple to activate",
          "Contenu": "The phone was delivered straight to my mailbox.. IT CAN'T GET NO BETTER THAN THAT"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T03:29:37.000Z",
          "Titre": "The delivery was fast and the service…",
          "Contenu": "The delivery was fast and the service is Great"
        },
        {
          "Note": 5,
          "Lieu": "PR",
          "Pseudo": "Jose pagan",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:38:53.000Z",
          "Titre": "Fast ...and great phone help me a lot",
          "Contenu": "Fast ...and great phone help me a lotJose pagan padilla from puerto rico"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T18:59:28.000Z",
          "Titre": "Easy",
          "Contenu": "Easy! So happy to have the assistance as I try to get back on my feet! I went 2 months without a phone and needed emergency calls. Thank you for the help!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ITONGWA/ADELIN LUSAGILA",
          "Nb_Reviews": 4,
          "Date": "2023-12-21T20:28:14.000Z",
          "Titre": "Im very excited with the connection"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ash",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T16:01:35.000Z",
          "Titre": "Phone service works perfect no issues",
          "Contenu": "Phone service works perfect no issues. I’m satisfied!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roberta Willette Boltz",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T20:46:35.000Z",
          "Titre": "So far it's been great",
          "Contenu": "So far it's been great. I can breathe knowing I have phone service now. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T17:45:24.000Z",
          "Titre": "They gave me unlimited talk",
          "Contenu": "They gave me unlimited talk, text, and data."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T23:37:37.000Z",
          "Titre": "Great service",
          "Contenu": "Great service provided by the person helping"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:54:49.000Z",
          "Titre": "Shipping and enrollment was easy and…",
          "Contenu": "Shipping and enrollment was easy and fast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Martha",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T19:27:36.000Z",
          "Titre": "Quick and easy process",
          "Contenu": "Quick and easy process. Would highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda Britton",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T19:38:22.000Z",
          "Titre": "When I got my phone it was easy to set…",
          "Contenu": "When I got my phone it was easy to set up and the sim card was already in the phone. It was great just to turn it on and use it right away. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Naytelle O",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:37:20.000Z",
          "Titre": "thank you so much for this amazing…",
          "Contenu": "thank you so much for this amazing phone and fast service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T23:40:55.000Z",
          "Titre": "Help in time of need",
          "Contenu": "Help in time of need. Time is not easy for everyone.  U guys are awesome."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customerTim",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T07:36:27.000Z",
          "Titre": "Great Produxt",
          "Contenu": "Clear reception. Service works great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T04:38:57.000Z",
          "Titre": "The service is good and fast delivery"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T03:41:39.000Z",
          "Titre": "My experience with TruConnect was the…",
          "Contenu": "My experience with TruConnect was the speed and accuracy regarding my shipment.  The staff was very professional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristen",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T20:11:04.000Z",
          "Titre": "Super nice respectful and professional…",
          "Contenu": "Super nice respectful and professional that guy needs a raise"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "claudio",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T17:43:47.000Z",
          "Titre": "Its fast and it works well im satisfied"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Wilson",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T00:10:32.000Z",
          "Titre": "Very quick shipment",
          "Contenu": "Very quick shipment. Very easy process. Great experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:24:10.000Z",
          "Titre": "Fast service on approval and devices"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T18:08:01.000Z",
          "Titre": "Phone",
          "Contenu": "Nice lady. Good customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Antwan tucker",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T22:37:19.000Z",
          "Titre": "Work great no problem setting up sim card",
          "Contenu": "It's was is to switch from the other company"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Smith",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T16:33:38.000Z",
          "Titre": "The service works great",
          "Contenu": "The service works great, and the customer service is awesome."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T23:23:07.000Z",
          "Titre": "Extremely pleased with product and…",
          "Contenu": "Extremely pleased with product and service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "K. DAVIS",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T05:39:10.000Z",
          "Titre": "love the phone and the services haven't…",
          "Contenu": "love the phone and the services haven't found any complaints yet."
        }
      ]
    }
  ]
}