{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "trutrade.io",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "natalie",
          "Nb_Reviews": 4,
          "Date": "2023-12-08T03:10:46.000Z",
          "Titre": "There is still no information available…",
          "Contenu": "There is still no information available about these bots. I left a review before and they had it removed. When I complained that YouTube has no info whatsoever about this bot ANYWHERE except by trutrade themselves, they find a guy named Guiellmo to start putting them up there, but he's the only one. Once again, no mention of price, trial runs, etc. If you know your bot works, let us try it out. If we don't like it, fine. Someone in the comments below mentioned $500 a month - and that's fair - especially considering they wanted 10 GRAND AT ONE POINT. I get they can possibly have a winning combination here, but all these steps we have to go through just to give an ounce of info is ridiculous.Edit: so the last time I left a review, you all took it down. I asked you for information, and you refuse to give it to me. I looked for information on my own, I couldn't find any. I complained that YouTube did not have any videos from anywhere by anyone except your company and then you found one single solitary person to put videos up on youtube.Now that you all have had that one taken down, you want to change the narrative and say that I'm mad because I can't get the robot for free. Nobody knows how much it cost! Say how much it cost right here in the review and all of this will be killed. If there's nothing wrong with your company, we should not have to do such stringent investigations to get more information about you. This is childish and this is why nobody is leaving you high reviews and the ones who are aren't giving any information about the price either because they are your employees."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ChiefPro",
          "Nb_Reviews": 4,
          "Date": "2023-10-03T09:38:39.000Z",
          "Titre": "Brian is so rude",
          "Contenu": "Brian is so rude, we're at the sales stage yet he act vulgar.. plus $500 per account monthly subscription! if anyone know other AI bot company DM.I wouldn't buy their products due to their tacky attitude and all the negative comments."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 1,
          "Date": "2022-12-15T02:00:41.000Z",
          "Titre": "No Transparency",
          "Contenu": "Essentially they talk down to you on the initial sales call and refuse to give any real live preview or trial of the bot. Their reasoning is \"trials or monthly subscriptions are not a viable business model\" which is absolute crap. I'm not spending 10k (entry price) on something I cannot see live or try myself."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "iQX Corp",
          "Nb_Reviews": 1,
          "Date": "2021-04-27T18:15:23.000Z",
          "Titre": "These folks are useless don't go near…",
          "Contenu": "These folks are useless don't go near them.They won't answer basic questions, don't listen, try to pitch using high pressure, insults and honestly, just stupid dialogue. They have no idea how to capture customers, their sales and support appear to be useless."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "PTSD",
          "Nb_Reviews": 2,
          "Date": "2023-08-09T01:03:26.000Z",
          "Titre": "Once they get you on the hook for $30K…",
          "Contenu": "Once they get you on the hook for $30K they disappear on you. Customer Support is non existent and apparently hate their job as they don’t want to help anyone. Customer Support takes 2-3 days to respond and then they just make up an excuse not to help and then take another 2-3 days to respond by complaint about the customer. There is no management in place to take care of issues. I guess I have to file suit in AZ Superior Court to get help or a refund. They say they support a  Navy Seal Foundation but they won’t even help a 100% disabled veteran  get the software they purchased up and running. AI Ripper purchase is not hands off and no VPS included despite sales videos stating such. This comes after I was to receive the Ripper AI with 5 nodes but due to a family emergency despite being told my package was on hold - I was downgraded to 2 nodes because the sale was over and my package being on hold was apparently not true.   I would love to leave an awesome review- especially if this software works like they claim but I have  been abandoned after signing up for $30K."
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "Kirk",
          "Nb_Reviews": 1,
          "Date": "2022-11-27T16:48:29.000Z",
          "Titre": "Not transparent, stay away!",
          "Contenu": "Once again, its no surprise that the highest ratings are similar and most likely not real. These guys are anything but transparent. The reason provided for no pricing on the site is quoted as ‘based on individual requirements'. They are offering products to retail traders, the fact they don’t even have a baseline cost for an initial product should be concerning and would not be surprised if the cost varies for each individual for the same product during the initial call and getting a view of how much one is willing to give. Its astonishing they are charging $25k + for one of the products and the concept of the ‘DRAMM’ is nothing unique, its essentially a martingale approach with an ATM and that’s worse, recipe for blowing up an account.All you need to do is look at the videos posted, no track record, likely trading demo and at points trading 25-30 contracts…."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "sun auto",
          "Nb_Reviews": 2,
          "Date": "2022-03-29T19:24:01.000Z",
          "Titre": "Unbelievable ignorance from phone rep",
          "Contenu": "Unbelievable ignorance from phone rep, started by stating that $9500.00 was peanuts to spend and got upset anytime I asked a question.  The entire dialog was pretty much do you have the money or not!  Hard to believe they have any customers, even if it works, if this is how they treat people."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cole M",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T17:39:24.000Z",
          "Titre": "This company is a scam",
          "Contenu": "I purchased the Market Ripper bot from Trutrade.io last year after being allured by the YouTube videos of the bots winning trade after trade. I ended up paying thousands of dollars and it is a complete rip-off. It turns out that those videos only show the bot during rare and unpredictable market conditions. There is nothing special about their bots/strategies which have a terrible win rate in live markets. The actual automation trades like a drunk person. There is no real way to back test the strategy because it uses Renko bars (these bars trick the software into registering all trades as winning trades). I gave this company the benefit of the doubt and followed all of their instructions and quickly got ghosted by their customer support. After wasting several months trading (and losing) with the bot and following their instructions, it is clear that this is just a cash grab and all of the positive reviews are likely paid for. After doing even a small amount of research, it is obvious that automation is much more complicated than just buying a pre-made system. Unless you can properly back test the strategy yourself (using walk forward and monte carlo analysis), stay away."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Greg Atias",
          "Nb_Reviews": 1,
          "Date": "2022-04-06T21:43:07.000Z",
          "Titre": "Honestly it is hard to imagine that any…",
          "Contenu": "Honestly it is hard to imagine that any of these reviews here were not paid by this guy Danny, the 1 man show who says he has thousands of customers, like hedgefunds, etc. absolute full of crap.Guy is an arrogant person.give you 1 hint, if you were a company doing millions in business, why in the world would you have to point out that you near the Apple store. really?The product comes with a 1 page documentation, and then you are on your own.there is no tech support, no one will every answer your phone once you pay, so remember your were warned.i believe he is a hokes, he has maybe 10 suckers that paid for his program, other then that i believe he'll be out of business in 6 months after ripping off as many as he can.you can find other bots and automation for .03 cents on the dollar."
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "Brent Phillips",
          "Nb_Reviews": 1,
          "Date": "2021-09-18T22:57:12.000Z",
          "Titre": "Not Very Pleased",
          "Contenu": "This is going to be the most honest review that you will see about these guys.  Danny, \"vetted\" me to see if I was a fit to be his customer. After I paid, I got one video that was 1hr 45mins of Danny talking about basic stuff that any trader already knows. There was 5 minutes of specifics about settings. These bots are nothing special and I can't believe they are acting like it is. Decide for yourself. However, I will no longer be doing business with them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel K",
          "Nb_Reviews": 1,
          "Date": "2022-11-28T01:42:53.000Z",
          "Titre": "I paid thousands of dollars for this…",
          "Contenu": "I paid thousands of dollars for this product, almost 10k. I can tell you for a fact that this is a total scam. This will burn through your account very fast, regardless of lot size. They just want to sell their crap software. Forget any technical or customer support. Once they get your money you are on your own. They do high pressure sales tactics, then you are on your own. If you have money to burn, go for it. I managed to find a system, not automated and now I am doing just fine. Avoid this like the plague. Wish I could rate this with negative stars."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Trader",
          "Nb_Reviews": 1,
          "Date": "2022-08-01T04:19:42.000Z",
          "Titre": "Scammers they take your money and drop…",
          "Contenu": "Scammers they take your money and drop you"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "La Zima",
          "Nb_Reviews": 2,
          "Date": "2023-09-22T12:41:41.000Z",
          "Titre": "Pending more results to provide an update on AI bot's performance",
          "Contenu": "Initially had issues with TruTrade's support due to their slow response to a technical glitch, things are looking better at this time as they have finally corrected the error and have gone above and beyond to assist with the issues. Still need more time to determine the performance of the AI bots"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "cee west",
          "Nb_Reviews": 1,
          "Date": "2021-05-31T23:42:33.000Z",
          "Titre": "My wife and I have been trading for…",
          "Contenu": "My wife and I have been trading for several months Currently we are trading Futures.I was doing some research on automated trading systems and True Trade stood out to us as the system of choice for various reasons.They cater to the novice trader on to the most experienced.We have had the Market Ripper system for 1 month now and since this time, we have been using the bot on simulation mode until we gain some experience and learn the product.Thus far, the Market Ripper product has been on the winning side of tradesDanny recommended we use the Market Ripper based upon the instrument that we wanted to trade; however, True Trade has other trading bots that trade to your trading style.He very professional and extremely knowledgeable during the consultation phase.Easy setup and lock step instructions provided when you purchase the Market Ripper.We look forward to seeing what the Market Ripper can do in the live market as I am sure it will not disappoint. Venise & Chris West"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kiera Dunn",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T17:16:23.000Z",
          "Titre": "acquired Powertrend",
          "Contenu": "acquired Powertrend, whose software offers incredibly advanced options and settings. My likes are the features related to position management. I contacted Danny and gave him some short-term scalping when I started to become a little impatient. He was my assistance! Real deal, buy now without hesitation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony Fuller",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T17:13:02.000Z",
          "Titre": "I've been using this trading for over a…",
          "Contenu": "I've been using this trading for over a year, and I'm happy that I found it. It's quite simple to use, and the customer service is top-notch. Even at this late hour of the night, they are always willing to help me with any queries or problems I have. Taking everything into account, I wholeheartedly endorse Trutrade.io!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rhys Kerr",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T06:39:28.000Z",
          "Titre": "I invested in Powertrend",
          "Contenu": "I invested in Powertrend, and I must say, their software boasts some premium features and configurations. The position management functions stand out as my top pick. As a short-term scalper, I faced some challenges, but a quick call to Danny sorted everything out. It's genuinely worth the investment – don't hesitate!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leo Myers",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T16:09:35.000Z",
          "Titre": "Watch Trutrade over 6 months and…",
          "Contenu": "Watch Trutrade over 6 months and finally jumped in with both feet last month. I agree with most of theae post, once you take profits and hit goals stop for the day. I get to excited sometimes and I over trade. Overall it's a positive experience"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jude Blackburn",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T06:40:58.000Z",
          "Titre": "I acquired Powertrend and was…",
          "Contenu": "I acquired Powertrend and was immediately impressed by its high-quality features and settings. The position management tools are particularly remarkable. As someone who engages in short-term scalping, I encountered a hiccup, but a prompt consultation with Danny resolved it seamlessly. Truly an exceptional product – no second thoughts needed!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ethan Kirk",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T08:44:47.000Z",
          "Titre": "Since then I have yet to have an issue…",
          "Contenu": "Since then I have yet to have an issue with the Market Ripper and I have noticed myself to become a lot more consistent while trading and my confidence has increased a lot. I highly recommend reaching out to customer service where they will provide you with a product that best fits you. And if you have any issues or concerns while using the product, reach out to customer service and they will help you very quickly. They emphasize their desire to help you succeed so I see this as a no brainer decision to improve your trading."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Evan Curtis",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T05:44:52.000Z",
          "Titre": "Having used TruTrade's products for…",
          "Contenu": "Having used TruTrade's products for about a year, I can state with certainty that their software is of a high caliber. It has been a pleasure working with them as well. I appreciate Danny considering my situation and best interests when he suggested an automated trading system to me. He also gave me some really useful usage tips. These people truly want to gain your trust and create high-quality items, not just take your money and disappear. I'm really happy with TruTrade's software's functionality and use, and I was surprised by how profitable it was in my first live market use! I believe in Danny and the team now."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ellis Dobson",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T05:43:32.000Z",
          "Titre": "I adore these boys so much",
          "Contenu": "I adore these boys so much. TruTrade is an excellent company with very competent employees and excellent management. Easily among the top locations for BOT/auto trading systems. These folks have dedicated a great deal of work to crafting these products to accommodate various trading styles. By interacting with traders and determining what suits your style, they aim to improve trading skills for everyone. I've spoken with Danny and Brian a few times, and each time they go above and beyond to make sure you receive the correct merchandise. Fantastic People, Fantastic Place, and Fantastic Products. Continue as is."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Louis Middleton",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T06:54:08.000Z",
          "Titre": "On my last day of researching products",
          "Contenu": "On my last day of researching products, I came across TruTrade and it's market ripper product. I enjoyed the videos that explained the product along with the videos of the product trading on live data. This was a game changer and I immediately got into contact with their customer support in order to purchase the mini Market Ripper. The customer service got back to me within a day and explained to me how to purchase the product and set up a time where they would show me how to use the product on my computer remotely. Furthermore, they described to me multiple products and asked me a few questions about myself so they were sure I was choosing the best product for my circumstances."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dick  Wright",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T08:13:15.000Z",
          "Titre": "I bought an Autoripper Pro a few months…",
          "Contenu": "I bought an Autoripper Pro a few months ago as a newbie trader and felt obligated to write about my experience. Brian and Danny were my first contacts, and they gave me confidence in my decision to buy. I tried two other firms without success before I found this one. Even though I'm still learning how to use the program, their professional advise has made it extremely profitable. The first three to four weeks of learning curve were combined with getting acquainted with a new platform. The TruTrade service is excellent, and the Autoripper is fantastic for anyone who isn't sure!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan May",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T08:43:35.000Z",
          "Titre": "So after deciding to purchase the…",
          "Contenu": "So after deciding to purchase the Market Ripper, I made an account with TruTrade which gave me a plethora of information on how to use the product I just purchased and they even gave me recommended settings for trading certain futures instruments. Then I had a live meeting with one of their support and they told me to use the product with paper trading until I got to hang of it because they wanted me to be successful. They said understand the product first before I trade with real money so I could use the bot to the best of my ability and to increase my ratio of winning to losing trades."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amelia Smart",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T22:22:24.000Z",
          "Titre": "When I initially learned about…",
          "Contenu": "When I initially learned about TruTrade, I had my doubts about it. I eventually went to see a trader that I had been watching on YouTube. In the end, I purchased one of their less expensive bots. After a week, SIM still amazes me. It ought to be out soon!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Louis Cooper",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T12:16:20.000Z",
          "Titre": "After diligently researching for over a…",
          "Contenu": "After diligently researching for over a year to find a software that could outpace my manual trading skills, I explored more than 10 solutions. My conversation with Danny convinced me to partner with his company, and I couldn't be happier with the decision. Before going live, I meticulously followed the guidelines and honed my skills over several weeks. The results have been outstanding – I've achieved several of my trading goals with its help. I wholeheartedly recommend TruTrade to anyone in search of reliable and efficient trading solutions. - Scot"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cameron Berry",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T06:06:11.000Z",
          "Titre": "As a novice trader",
          "Contenu": "As a novice trader, the thought of utilizing a trading bot scared me. However, TruTrade.io offers great customer service and is incredibly user-friendly. From the beginning, I have been able to make winning deals."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom Stokes",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T07:53:48.000Z",
          "Titre": "TruTrade.io is the most customizable…",
          "Contenu": "TruTrade.io is the most customizable trading bot I've ever used. I can backtest and optimize my strategies to perfection. I'm really impressed with the results."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Holly Stephens",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T11:47:08.000Z",
          "Titre": "I've been day trading for a long time",
          "Contenu": "I've been day trading for a long time. I've experimented with various automations and expert advisors, but ultimately I went back to manual trading because it always seemed to perform better. Even while I still use the Shotbot and Ripperone in addition to manually trading, I am beginning to avoid it because the bots earn more money than I do and I often miss trades while waiting for my setups. Fantastic staff and assistance at Trutrade. They never fail to help me when I need them, and I have no doubt they will be around for a very long time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Georgia Todd",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T20:46:06.000Z",
          "Titre": "Finally got a response from TruTrade…",
          "Contenu": "Finally got a response from TruTrade and they have kindly assisted with complementary VPS hosting, Key resets and a few months off their prop trading fees. Still have issues but TruTrade is making an effort to making things work. Initially had issues with TruTrade's support due to their slow response to a technical glitch, things are looking better at this time as they have finally corrected the error. Still need more time to determine the performance of the AI bots"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan Marsh",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T21:28:47.000Z",
          "Titre": "For me",
          "Contenu": "For me, TruTrade.io has changed the game. As a full-time trader, I was finding it difficult to stay up to date with the markets. I've been able to automate my trading technique and free up time thanks to TruTrade.io. I'm experiencing less stress and more consistent profits."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Henry Slater",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T04:39:35.000Z",
          "Titre": "It was a little scary for me to use a…",
          "Contenu": "It was a little scary for me to use a trading bot. However, TruTrade.io's intuitive design and excellent customer support have allowed me to quickly close profitable trades."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luke Watson",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T07:55:21.000Z",
          "Titre": "TruTrade.io is a must-have for any…",
          "Contenu": "TruTrade.io is a must-have for any serious trader. It's easy to use, customizable, and profitable. I highly recommend it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Declan Henry",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T06:53:26.000Z",
          "Titre": "The Pinnacle of Trading Systems",
          "Contenu": "TruTrade stands out as a paragon in the BOT/Auto trading landscape. Their dedicated efforts to craft products suited to diverse trading styles are commendable. Their commitment to enhancing traders' experiences is evident in my interactions with Danny and Brian, who consistently go the extra mile. With top-notch products and a stellar team, TruTrade sets the gold standard."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George Ahmed",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T06:36:10.000Z",
          "Titre": "Here's my video review of TruTrade…",
          "Contenu": "Here's my video review of TruTrade (TruTrade.io). I've been employing their MAPro on NinjaTrader8, and it's truly an outstanding instrument. In my next steps, I plan to acquire the Global Market Ripper."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Finlay Hargreaves",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T06:43:18.000Z",
          "Titre": "I acquired the Global Autoripper",
          "Contenu": "I acquired the Global Autoripper, enabling me to simultaneously trade NQ, ES, and CL without the need to individually manage each. Manual trading used to be draining, but thanks to TruTrade's exceptional software, things have become much easier. Kudos to them!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Solly Borhane",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T06:00:01.000Z",
          "Titre": "Initial Skepticism",
          "Contenu": "I approached TruTrade with a degree of skepticism. After watching numerous traders on YouTube and consulting with one, I opted for one of their more affordable bots. A week's simulation has left me pleasantly surprised, and I'm excited about transitioning to live trading."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kian Hale",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T04:34:16.000Z",
          "Titre": "The trading bot flexibility benchmark…",
          "Contenu": "The trading bot flexibility benchmark has been surpassed by TruTrade.io. Its ability to refine and backtest my strategies is unmatched, producing incredibly good results."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mahmood",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T06:01:26.000Z",
          "Titre": "A Year with TruTrade",
          "Contenu": "My experience with TruTrade over the past year confirms their software's top-tier status. Danny's insightful recommendations tailored to my needs, coupled with invaluable usage tips, showcases their commitment to genuine client welfare. TruTrade's software not only impresses in terms of usability but its profitability was a pleasant revelation during its first live market test. Danny and his team have earned my trust, and I eagerly await their future innovations."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Lee",
          "Nb_Reviews": 28,
          "Date": "2023-10-24T09:16:20.000Z",
          "Titre": "If you're looking for a steady hand in…",
          "Contenu": "If you're looking for a steady hand in the tumultuous world of trading, look no further than Trutrade paired with RipperONE Ai. I can now focus on refining my strategies rather than constantly worrying about the market's erratic behavior."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "KillioN MkJ",
          "Nb_Reviews": 23,
          "Date": "2023-05-04T09:27:49.000Z",
          "Titre": "I've been trading a handful of their…",
          "Contenu": "I've been trading a handful of their bots that I received in a package for what seems like forever, and I'm always impressed by their service. They make sure I have all the knowledge I need to succeed, whether it's through the more recent training films or just being available to call. My earnings also show this to be true. I make sure to trade every day, and I've been lucrative from it the entire time. Congratulations to TruTrade for providing such great personal service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristyn Barbrick",
          "Nb_Reviews": 1,
          "Date": "2022-12-23T22:34:27.000Z",
          "Titre": "I have been trading stock options for a…",
          "Contenu": "I have been trading stock options for a few years now, but never been able to be comfortable enough to trade more than making $50-$100 profit per day. Came across Trutrade when I was looking up trading bots and excited to trade futures full time. Seems a lot easier without all of the different strike prices and expiration dates. I'm glad I was able to run it in SIM right before the holiday. Best Christmas gift to myself!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Parag Sathe",
          "Nb_Reviews": 3,
          "Date": "2021-06-11T23:59:52.000Z",
          "Titre": "I had never used any automated BOT…",
          "Contenu": "I had never used any automated BOT before but its completely changed my  thoughts, the moment I have started using this amazing products. I have been using TRUTRADE Market Ripper and MA Cloud strategy offered by this company and works amazingly. Thanks Danny for a gret customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tony D",
          "Nb_Reviews": 1,
          "Date": "2022-06-22T18:00:24.000Z",
          "Titre": "Very Happy with TruTrade Software and Support",
          "Contenu": "I purchased AutoRipper Pro in March and am very pleased with software. It has proven to be extremely effective and has helped me get a funded account so that I could trade using other people's money :) I am now looking to purchase one of their more advanced bots to help me get to the next level of my trading. Great addition to your trading arsenal. I highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Guillermo Sandoval",
          "Nb_Reviews": 1,
          "Date": "2022-06-22T06:47:05.000Z",
          "Titre": "Highly recommend! Automation for beginner and advanced traders.",
          "Contenu": "I have been a TruTrade customer since April of 2021. Since then, I have upgraded to more advanced automation. I got serious with my trading in November of last year; watched the training and setup videos, practiced in SIM and now I'm a 4x funded trader with $200,000 in trading capital. I'm currently working on two accounts for an additional $100,000 in trading capital. I consider myself to be a beginner and the automation software has worked for me. The guys at TruTrade have been helpful, nice and easy going. If you are looking for automation to help your trading, consider giving TruTrade a try."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Isaac Leonard",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T05:58:17.000Z",
          "Titre": "Years of Day Trading Experience",
          "Contenu": "Throughout my years of day trading, I've experimented with various EAs and automation tools, but always found manual trading more effective. However, with the advent of Shotbot and Ripperone, I'm slowly transitioning towards automation. These bots often outperform me, capitalizing on opportunities I miss. Kudos to the TruTrade team for their unwavering support; they demonstrate longevity and reliability in this industry."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ken Kendall",
          "Nb_Reviews": 1,
          "Date": "2021-05-27T04:11:25.000Z",
          "Titre": "Very Happy with their software",
          "Contenu": "I am very pleased with Tru Trade and their services.  I have been using their software for about 6 months and am happy with it.  Their customer support is good and Danny has been very patient with me and has reached out to make sure my questions were answered.  I am excited to use their software in the futures market to supplement my income and help with my retirement in the future.Ken    Utah, USA"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KACE VANG",
          "Nb_Reviews": 1,
          "Date": "2021-06-10T23:11:47.000Z",
          "Titre": "Fully Automated Trading System",
          "Contenu": "I've used a few automated systems in the past but didn't find success. Trutrade.io made their bot easy to use and better than any human being can execute trades.  If you like fully automated trading and know what you want, Trutrade.io can help you to win the market."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adolfo Fernandez",
          "Nb_Reviews": 1,
          "Date": "2021-05-27T23:27:52.000Z",
          "Titre": "Algorithm Trading with TruTrade",
          "Contenu": "I started algorithm trading about 6 months ago. I found most companies sold you bad products that were successful  in backtesting but never when trading live. TruTrade has been clear and honest about their services. They have great products and I ended up choosing the EMini Ripper and have really appreciated it. Their customer service is great and they will help you one-on-one with their product so you can become successful with it. I would recommend reaching out to them by phone and letting them help you choose a product that suits you. They are a very flexible company and will help you get the right trading algorithm that fits you. I wouldn’t recommend any other algorithm company than this one. They are truly meant to help the individual trader excel in large markets."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BrianaAllen",
          "Nb_Reviews": 1,
          "Date": "2022-05-11T23:08:13.000Z",
          "Titre": "I'm trading with the PowerRipper with a…",
          "Contenu": "I'm trading with the PowerRipper with a 37k trading account currently. Blows my mind how this company builds their systems. I'm trading the ES CL NQ currently all at the same time but also I have 2 strategies for each. It minimizes my losses like I have never seen. I catch the full moves of big days as it trades tight however losing days are minimal which I praise them for. I'm hovering at 71-76% win rate when trading this way. If you have the money to trade and can afford their software you will be good to go. Talking with them about their multi-bar networks already. Will pist on that when I purchase it down the road."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LindaMary",
          "Nb_Reviews": 1,
          "Date": "2022-06-15T05:58:36.000Z",
          "Titre": "Provide services at competitive prices.",
          "Contenu": "Trutrade.io provide services at competitive prices, with simple online ordering and delivery. I got my best experience with this company and share them to my friend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Hershey",
          "Nb_Reviews": 2,
          "Date": "2021-05-21T22:14:03.000Z",
          "Titre": "Awesome products",
          "Contenu": "I was looking for software that was automated for daily trading I happened along these guys in my google search, decided to give them a try and have not been disappointed yet, there accuracy is unreal, and they have videos that help with install and materials that explain everything they leave nothing out. They even have support that gets back to you promptly, There is videos that explain there strategy and how to use there software watch them until you fully understand them you wont be disappointed,"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Damon wilson",
          "Nb_Reviews": 1,
          "Date": "2021-06-10T21:19:05.000Z",
          "Titre": "This software and product is the top of…",
          "Contenu": "This software and product is the top of the line ! I’m new to trading futures and this helps my with my entries and exits and I’m completely satisfied. I will do business again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "kontra wolf",
          "Nb_Reviews": 2,
          "Date": "2021-06-16T14:47:39.000Z",
          "Titre": "the ripper is pretty good i took me a…",
          "Contenu": "the ripper is pretty good i took me a min to get use to it but i still learning"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "John Bryce",
          "Nb_Reviews": 9,
          "Date": "2022-12-26T13:14:35.000Z",
          "Titre": "Great experience purchasing my bots and…",
          "Contenu": "Great experience purchasing my bots and support afterwards which is the most important thing in a company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marina Alexia",
          "Nb_Reviews": 1,
          "Date": "2021-09-16T23:04:44.000Z",
          "Titre": "The best company of its kind!",
          "Contenu": "I purchased Autoripper Pro a few months back and I wanted to share my experience. I spoke with two guys, Brian and then Danny just before I purchased. I have to say I'm extremely happy thus far. I wasted my money with two other companies before I found this company. I'm still in the early stages with this software however been profitable following their guidance. Took me about 3-4 weeks to get it down but some of that process was learning a new platform at the same time. Please do not hesitate the autoripper is awesome and the guys over at trutrade rock!- Marina"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason Dickson",
          "Nb_Reviews": 1,
          "Date": "2021-09-17T01:03:39.000Z",
          "Titre": "purchased the PowerTrend about 2 months…",
          "Contenu": "purchased the PowerTrend about 2 months ago. Danny was a huge help got me in the right track. Awesome bot very happy"
        }
      ]
    }
  ]
}