{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "tryshift.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Ben Whatling",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T14:13:14.000Z",
          "Titre": "Can't split apps, doesn't work with slack huddles",
          "Contenu": "I was advertised this product quite a bit and thought it'd be a good way to consolidate all of my applications and be able to manage my workflow's much better. Little did I know that you can't even split tabs (i.e. two tabs in a workspace vertically or horizontally), nor can you use screen sharing on Slack due to not being able to have pop out windows. I've purchased Rambox instead, which has all of those features and seems like a much better product."
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "Vincenzo Pisani",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T12:12:19.000Z",
          "Titre": "not useful at this price",
          "Contenu": "Honestly, using Chrome I already have access to multiple account of mail, drive, calendar simply clicking on the tab. Paying $150/year to have the same thing seems to me impractical for a company that already pays subscriptions to other apps such as asana, trello or microsoft which, however, have no substitutes. Not worth the expense"
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Richard Andrew",
          "Nb_Reviews": 5,
          "Date": "2023-08-03T22:22:03.000Z",
          "Titre": "From massive fan to extremely annoyed Shift user",
          "Contenu": "For 3+ years I was a massive fan of Shift. I couldn't operate without it. I loved it mostly because I could operate all 3 Google accounts and their Drives in ONE place - as well as - LinkedIn, Grammarly, Calendly, Messenger, Weebky and AWeber. But mostly, every app or email account had its own set of independent tabs. THAT was gold. Then came Shift Ultra, and that's when issues began for me. Now all the tabs are shared (which defeats the main advantage of Shift). So you have to create Workspaces - which I don't need - to get an independent suite of tabs (as it was before). And there have been numerous other annoying glitches - mostly random setting changes as a result of the upgrade.  I've spent 3-4 hours with customer service (who have been excellent, I must add) trying to get Shift to operate somewhere near as effective as it was, and I'm not there yet. What frustrates me a lot is Shift keeps raving about how good the 'Ultra' upgrade is for workflow, yet there IS NOT ONE VIDEO demonstrating WHY and HOW the new version is superior. But I can't see how it's better. I need that video demo! To Shift's credit, they have offered me a sweet deal for the next year but I'm still wanting to see how the upgrade is an improvement!"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "P.B",
          "Nb_Reviews": 1,
          "Date": "2022-10-09T11:08:52.000Z",
          "Titre": "Initial experience incredible...  now, not so much.",
          "Contenu": "My initial experience with Shift was incredible!  Running all of my Google Suite apps through it really helped my computer run more efficiently instead of running everything in multiple Chrome tabs.  But since upgrading to v8 I have had numerous problems.  Opening Google Sheets or Docs often results in a white window that does nothing. Switching between my 2 gmail accounts often does the same thing.  Shift used to be a helpful tool... now it's pretty frustrating."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-07-07T22:55:30.000Z",
          "Titre": "the app crashes a lot",
          "Contenu": "the app crashes a lot, windows and mac both. I know you have an advantage in the market since your app idea is not widely available. But if you don't fix these bugs i might as well just build my own app in the future, or you never know someone might create a similar app with better performance. I suggest you focus your resources on making the app seamless and smooth as the highest priority because you will lose so many costumers if you don't."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Vikas Rana",
          "Nb_Reviews": 1,
          "Date": "2022-11-23T11:44:29.000Z",
          "Titre": "This is very spamy app",
          "Contenu": "This is very spamy app. I experienced issues like slow mac and some links started opening via Facebook. basically weird things happened. WORSE - Even after removing the app from my mac and MacBook, it still left its files somewhere and keep trying to open links from shift app. I cross checked the app was def. deleted but its effect is still there. Also my mac is weirdly restarting itself since then.Feature wise also I found it nothing different than a browser. Just another sidebar which I don't need as I can just make folders in my browser for quick links anyway"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stephen C.",
          "Nb_Reviews": 13,
          "Date": "2023-08-25T13:41:11.000Z",
          "Titre": "Too many bugs, and solving them means I need to delete the app. LOL",
          "Contenu": "Later edit: The new version has a bunch of annoying bugs, and when I went to support, after 13 emails back and forth with screen recordings, they told me, \"I'm doing everything right; we don't know,\" and then asked me to download the \"Alpha\" version of Shift, which guess what: the Alpha version won't work on my MacBook. And yes, I did download the MacBook version. Now, I deleted the buggy version of the app, and Alpha won't work for fuc* knows what reason. So I need to download the old app again to get access to work. Guys, stick to Opera, it's free. Random idea: Instead of spending tons on ads to acquire customers, what about some more tech engineers? It makes sense to sell only annuals, right? The retention problem is solved. If this was a free app, fair enough, but I paid an annual, and I expect bugs to be solved, NOT ME BEING ASKED TO GODDAMN DELETE WHO KNOWS WHAT FOLDERS AND THEN THE APP ITSELF. Bugs: Google Calendar freezes, opening new windows from an app integrated won't work, email freezes sometimes, maps works on and off, extensions are cra sometimes (Grammarly, for example)Below is the 4-star review, edited above after more use:****This tool has a lot of potential and was exactly what I needed. Multiple workspaces, so I don't always need to open a bunch of Chrome windows, which is a nightmare.The only problem is this is buggy; the screen freezes randomly here and there, then Gmail freezes, and some extensions are not working properly. The other day I was in Google Maps, and it just did not work, so I had to open Chrome to look for whatever. Then Grammarly acts weird, and so on.Support is great, but if bug fixes are not coming soon, I'll use Opera; it offers literally the same functions for free."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Coco",
          "Nb_Reviews": 1,
          "Date": "2022-08-21T09:37:20.000Z",
          "Titre": "Garbage",
          "Contenu": "I never write reviews but I feel compelled to in this case. As others have said, the new v8 version is garbage. They already had a buggy and slow product, and they actually managed to make it worse. Basic features have been removed during the 'upgrade' (?!) and it's worse than ever at loading up applications.I've been paying for $100 a year for the last 2 years and have now cancelled. They made no attempt to keep me as a customer or ask for feedback, so if that doesn't tell you what they think about their customers, just look to see if they've responded to any of the critical comments on here (spoiler: they haven't).I've now downloaded Franz and - although it's early days - already having a better experience on the free version than I ever did using Shift."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Elliott Greenman",
          "Nb_Reviews": 4,
          "Date": "2022-06-11T14:04:15.000Z",
          "Titre": "Great idea but poor execution - Bad on Macbook M1",
          "Contenu": "Great idea but poor execution. Using a Macbook Pro M1 and the software is very buggy, and because of that actually cost me more time. Asked for a refund within the 14day trial (which in my opinion isn't long enough to get to know and use the tool properly to build a workflow) and the support person persuaded me to stay and use the new beta v8 version which has lots of updates for Macbook M1. This version may have been worse than the previous version. It really doesn't offer that much over using programs individually as it slows your computer down considerably and when the apps break, you have to open and use them anyway. Now they won't refund me my money because i'm outside the 14 day period. Bad execution on building the software and poor support rules. Not what you'd expect from a new SaaS company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shawn Budde",
          "Nb_Reviews": 1,
          "Date": "2022-08-16T15:36:14.000Z",
          "Titre": "Shift v8 is the worst \"upgrade\" ever",
          "Contenu": "I found v7 on an M1 mac to be a useful overlay on the chromium engine. For reasons that are not clear to be they have been very aggressive in pushing me to v8 which has, literally, none of the useful features I used. It is VASTLY inferior. It is literally just Chrome with a sidebar.I could not be more angry. And there is no way to opt out of the constant upgrade reminders."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Katherine",
          "Nb_Reviews": 2,
          "Date": "2022-06-10T13:04:29.000Z",
          "Titre": "Predatory Trial & Cancelation Policy",
          "Contenu": "Scammy. They offer a free trial and then make it difficult to cancel. If you're one day outside of the 14 day trial window, they absolutely refuse to give you a refund. I used it for one day and they made me pay for the whole year. Their cancelation policies are predatory. If the Shift.com software was that good, they wouldn't have to rely on such a short trial window to profit off of people who don't need the software."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Gerard Martin Stadalius",
          "Nb_Reviews": 46,
          "Date": "2023-04-18T03:52:03.000Z",
          "Titre": "Customer support is not good and application requires alpha or beta signup to get full potential.",
          "Contenu": "So i decided that i would try shift for an all in one browser,app application so that all my services were in the one place with easy access.How wrong could i have been considering to even access workspaces as in individual workspaces you have to sign up for the alpha or beta programme.Considering the amount of money that you pay for the application i am definitely certain i am not paying that kind of money for a application that requires you to sign up for the alpha or beta to get the full potential of the software.The customer support i received as well were very rude indeed,closed my ticket without my knowledge and basically left me standing.There are much better applications out there so think before you purchase this,just know what you are signing up for and know what you are prepared to experience.Not Recommended.Find an alternative application thats my advice."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Simon",
          "Nb_Reviews": 14,
          "Date": "2023-03-13T18:22:47.000Z",
          "Titre": "Seriously annoying, CTO needs to open eyes!",
          "Contenu": "Seriously annoying. It’s randomly crashes my PC and it’s so heavy. Just loads a black screen, then kills my laptop. This product should be pulled. I should bill my wasted time or claim via indemnity cover (100% would if I was US based!)"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "really angry customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-31T16:31:14.000Z",
          "Titre": "you suck ass",
          "Contenu": "you guys charge on a yearly basis when it originally was a 1-time payment for life.you won't allow having all of my google and 3rd party apps in a single place. I have to jump from account to workspace.This f#$%n thing was supposed to replace google work suit and now is all over the place. get your s%^t together or I rather run natively on my system for next year"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-05T15:50:11.000Z",
          "Titre": "Went from janky to nonfunctional",
          "Contenu": "Shift was always janky. For the past few months it has not worked at all. I want my $99 back.Edit: To their credit, the support team has been consistently friendly and eager to help but has not been able to provide much in the way of actual solutions. I have already sunk too many hours into getting shift to work across too many problems. I’m done."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Scott Pritchard",
          "Nb_Reviews": 2,
          "Date": "2022-01-07T18:26:10.000Z",
          "Titre": "Not worth it",
          "Contenu": "I decided to try out Shift because I thought it'd be a great way to centralise apps.It's not. The free plan is extremely limited and they spam all hell out of your inbox. Within the first 24 hours of having an account, they had sent me 7 emails in addition to the 'welcome' emails. I thought that this might correct itself over time, but nope - still getting a huge number of emails filtered through to my spam folder (I added an email rule specifically for this).The biggest gripe I have is that the unsubscribe link in their emails do not work! I contacted them on Twitter about this, and they informed me that I should open a support ticket.Judging by the reviews, I'm glad I didn't bother as it sounds like they simply don't respond. In the end, I decided to block them at email server level as I was tired of their emails filling up my spam folder. You know a company is bad when you get frustrated by their emails being delivered to a folder specifically designed for spam."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Nicholas",
          "Nb_Reviews": 1,
          "Date": "2022-03-09T22:12:35.000Z",
          "Titre": "Lack of support",
          "Contenu": "Was great software.  Was happy to see that they support Linux, however, there is a known bug with google drive in the Linux version that has not been dealt with for some time.  Shift appears to now have dropped Linux support instead of fixing it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dustin",
          "Nb_Reviews": 2,
          "Date": "2023-01-05T02:24:17.000Z",
          "Titre": "bad customer service",
          "Contenu": "bad customer service, changed login process. I cancelled and no one responds to emails. Did a charge back"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Greg Kasparian",
          "Nb_Reviews": 1,
          "Date": "2023-01-10T18:33:30.000Z",
          "Titre": "the system is too clunky for me and I…",
          "Contenu": "the system is too clunky for me and I haven't used it most of 2022. Please cancel and refund the remaining balance"
        },
        {
          "Note": 1,
          "Lieu": "UY",
          "Pseudo": "Mauricio Vuljevas",
          "Nb_Reviews": 8,
          "Date": "2023-06-01T02:38:47.000Z",
          "Titre": "This is just a wrapped Chrome browser…",
          "Contenu": "This is just a wrapped Chrome browser with the tabs around the \"App\", totally waste of money, wish to have my money back. Fake advertising."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-26T18:28:15.000Z",
          "Titre": "Loosing passwords",
          "Contenu": "If I restart my computer I have to enter all passwords again. That is what I wanted to avoid when installing Shift"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Steven Easther",
          "Nb_Reviews": 1,
          "Date": "2021-06-14T05:12:22.000Z",
          "Titre": "Cancelled my subscription over a year…",
          "Contenu": "Cancelled my subscription over a year ago, but they continue to charge me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sarah Farlee",
          "Nb_Reviews": 2,
          "Date": "2022-05-16T14:20:11.000Z",
          "Titre": "I can't seem to cancel this",
          "Contenu": "I can't seem to cancel this. I've tried. I don't want it anymore, and it keeps getting charged. It's frustrating."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Maximilian Hersam",
          "Nb_Reviews": 2,
          "Date": "2022-07-10T08:44:41.000Z",
          "Titre": "just a mess",
          "Contenu": "This app is just a mess. If you install it and open it asks you to upgrade but u cant close it or do anything."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-13T14:57:19.000Z",
          "Titre": "I asked to have my account cancelled…",
          "Contenu": "I asked to have my account cancelled and nobody responded to me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-11-19T12:22:48.000Z",
          "Titre": "Just seem to be working with the new…",
          "Contenu": "Doesnt seem to be working with the new MacBook update"
        },
        {
          "Note": 1,
          "Lieu": "PH",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T16:05:22.000Z",
          "Titre": "I have to restart the application every…",
          "Contenu": "I have to restart the application every 3-4 minutes because it cannot load the inbox and notifications are not displayed."
        },
        {
          "Note": 1,
          "Lieu": "CZ",
          "Pseudo": "Lubomír Merta",
          "Nb_Reviews": 1,
          "Date": "2022-10-25T09:22:39.000Z",
          "Titre": "No time for testing without premium upgrade...",
          "Contenu": "No time for testing without premium..."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Teresa Vine",
          "Nb_Reviews": 2,
          "Date": "2021-05-16T08:41:28.000Z",
          "Titre": "Absolute SCAM",
          "Contenu": "Absolute SCAM. They auto renew, they let you know it's coming up for renewal but ignore you if you try to cancel prior to renewal, still take your money & then do not respond to your emails requesting cancellation & a refund as they should never have renewed the membership. I've reached out to them on every platform possible several times & still no response. Do not give them payment details or you'll lose money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Zach",
          "Nb_Reviews": 3,
          "Date": "2021-01-17T23:49:23.000Z",
          "Titre": "Paying for this is an IQ test you failed",
          "Contenu": "This is a web browser that rebrands free websites as apps that it sells you access to. You'd have to be colossally stupid to pay for this. I can't believe all the positive reviews. I feel like I'm taking crazy pills. It's just a web browser. It's not even a client like Thunderbird or Outlook. It just renders web pages for a monthly fee! WHO ARE THESE PEOPLE PAYING FOR A WEB BROWSER LOL"
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Benjamin Lasseri",
          "Nb_Reviews": 1,
          "Date": "2020-02-14T12:52:01.000Z",
          "Titre": "Bugged !! Use Franz instead",
          "Contenu": "CTRL + Z in France - where the W is at the same spot than the Z on a QWERTY keyboard - will close your window. So it's impossible to use. I've paid for the full solution and it worked great until this bugged happen. They won't fix it and they wont refund me so I switched to Franz. Generally speaking, it's a better option."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "doreen moreira",
          "Nb_Reviews": 2,
          "Date": "2020-09-06T21:09:30.000Z",
          "Titre": "Hard to Cancel",
          "Contenu": "Hard to Cancelbad and really dorgy!! I really don't like this company at all. Never answered phone calls !! Customer support is just outright bad.you cant cancel the subscription and it is not what i expected for 30days plan!! made it hard to cancel!!!I had to cancel my bank card!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Michael Chapman-Johns",
          "Nb_Reviews": 23,
          "Date": "2019-10-21T15:47:24.000Z",
          "Titre": "Avoid !!! Great Idea, BAD SERVICE",
          "Contenu": "Software is an amazing idea, but it keeps logging me out Xero and Gocardless so it's basically useless. I paid for the upgraded pro and asked for a refund the next day. My request as been ignored, I emailed them 3 times and each time I have not had a reply. I even reached out on social media and NOTHING"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Aaron Gray",
          "Nb_Reviews": 4,
          "Date": "2020-07-03T12:01:47.000Z",
          "Titre": "Hard to Cancel",
          "Contenu": "I really don't like this company at all. You have to redownload the app to cancel and customer support is just outright bad. A really poor platform which eats all of your power on your PC too. Maybe you should work on your customer support and not make it hard to cancel!!!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Laila Eddine",
          "Nb_Reviews": 1,
          "Date": "2021-03-09T07:23:24.000Z",
          "Titre": "The concept is not bad but it is still…",
          "Contenu": "The concept is not bad but it is still quite slow and needs to be improved. I use fresh works to work and it doesn't function properly with Shift, when I reached out to the customer service team about it they just told me they were aware of it, without offering any type of solution or setting an expectation for when it would be solved. After all this when I saw that they only offered a yearly subscription I deleted it. Honestly when you have a new service you can't expect people to blindly commit and pay upfront for a year. Had it been 10 a month with no commitment I may have,  but this screams desperate to me."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Ben",
          "Nb_Reviews": 4,
          "Date": "2020-03-18T20:28:55.000Z",
          "Titre": "This is a great idea but...",
          "Contenu": "This is a great idea, however, the system can be slow and functionality not work which ends up being frustrating. It's the level of customer service that leads me to give Shift 1 star. I sent two initial emails to cancel and be refunded, with no reply. When I did then receive contact from their customer service team, it took nearly two weeks to action the refund. They also ignored requests in my emails for instructions regarding how my colleagues can also cancel their subscriptions. Good customer service is important and my experiences with Shift have not left a good impression."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Michael Chapman-Johns",
          "Nb_Reviews": 23,
          "Date": "2020-10-25T08:39:20.000Z",
          "Titre": "Cancelling can cost you, even a year later. Be aware.",
          "Contenu": "I cancelled my shift plan a year ago, but yoy still took yhe renewal out my account. I did email you when i got the reminder email too. But still a payment of £75 was taken, when I arranged a refund, I got £71 back. Not happy at all."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-05-21T22:18:20.000Z",
          "Titre": "Not a very useful app",
          "Contenu": "Not a very useful app; I deleted it after I realized I couldn't even send emails from it without being forced to include \"sent with Shift\" at the end. This should be a lightweight app, yet its the opposite."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jennifer Kelly",
          "Nb_Reviews": 1,
          "Date": "2021-05-21T02:15:46.000Z",
          "Titre": "I have had the same problem",
          "Contenu": "I have had the same problem. I am trying to cancel my membership, I go through their “customer support” get nothing. No one answers their phone and no one ever emails you! It’s a total SCAM!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Karim",
          "Nb_Reviews": 7,
          "Date": "2019-06-18T21:24:30.000Z",
          "Titre": "no customer support",
          "Contenu": "No response from customer support regarding a refund request, even though I have sent 3 emails and reached out on twitter.Purchase at your own risk, especially since they only offer yearly payments upfront!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Saverio Grisorio",
          "Nb_Reviews": 4,
          "Date": "2019-09-05T09:20:49.000Z",
          "Titre": "Can't get past the initial setup with a…",
          "Contenu": "Can't get past the initial setup with a Gmail account. Receiving an error: This site can't be reached, even though the connection is active and there is no firewall in the way. Uninstalling it."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-05-21T23:44:39.000Z",
          "Titre": "What pisses me off with your service is…",
          "Contenu": "What pisses me off with your service is that I have now pressed unsubscribe several fûcking times and yet you still send me emails. STOP SENDING ME THESE BÛLLSHIT EMAILS"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-05-12T08:19:09.000Z",
          "Titre": "Very buggy doesnt load apps well"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Trust Warrior",
          "Nb_Reviews": 18,
          "Date": "2020-07-28T19:27:11.000Z",
          "Titre": "Prospecting outreach...epic fail!",
          "Contenu": "I received an outreach from a Client Strategy lead that was disingenuous and self-serving.  I kindly provided feedback on a better approach with higher message effectiveness.  Of course, I heard nothing back. That prompted me to check out their reviews.  As I suspected, there’s social proof of their self-interested orientation and shill tactics.  There’s too much competition to deal with companies who don’t care about your time.  As a rule, if they don’t show love when prospecting you, it’s a strong indication that you’ll get worse treatment when you become a customer.  Only then they have your time and money!I also suspect that many of the 5 star reviews are internally motivated.  Who leaves a 5 star review with the only text: Great customer service when all the 1 star reviews indicate the opposite. Another sign of fake reviews is many are from people that have only written one review for Shift."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Roger P",
          "Nb_Reviews": 1,
          "Date": "2022-09-29T14:11:04.000Z",
          "Titre": "Nice concept poor execution"
        },
        {
          "Note": 1,
          "Lieu": "SG",
          "Pseudo": "Jovin",
          "Nb_Reviews": 1,
          "Date": "2020-06-13T04:51:01.000Z",
          "Titre": "Really just a polished pop-up ad",
          "Contenu": "I've tried the app but not only is it kinda slow and clunky, but it's also filled with needless pop-ups and links to the Shift website. Also, if you subscribe to the basic plan you don't actually get access to probably the main reason why you'd want the app in the first place: a platform where you can manage multiple apps and emails at once. In other words, unless you subscribe to their service (which is annual by the way so you can't try it out for a month) you literally only have a tool that lets you switch between inboxes. You also get flooded with pop-ups that keep trying to get you to subscribe. And have fun sending out emails, because it's going to be signed off with 'Sent from Shift' which can only be removed if you pay $99 per year for their premium plans.Shift is clearly designed by the same people who think spam and pop-up ads are a good way to convince users that your product is good. If you think that's a software that suits you, then go ahead."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Andreas Minch",
          "Nb_Reviews": 3,
          "Date": "2019-09-21T05:02:26.000Z",
          "Titre": "Useless software!",
          "Contenu": "I had this running on my mac (Paid advanced version) since I have a lot of apps and programs with different account logins and Google Mails. It seems like I had more problems with the login and handling of the app than I had before Shift. You still have to log in every couple of days, sometimes even once or twice per day, which totally negates the reason for buying the advanced version. Essentially, all it does is combine all your accounts in one browser-like set-up - (What the heck?!) I can do that with chrome or safari as well - no added value there.What annoyed me most is that when you run into a problem, you have to fill out a whole service ticket with all kinds of information about your account and name and stuff (when you're paying advanced, you might expect to not have to do that). And then the solutions I got was mostly stuff like \"Log out of everything and delete app data and log back in\". OK, that is exactly what I DON'T want to do - that's why I got this software :DI do NOT recommend this software to anyone! Waste of money!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "S H",
          "Nb_Reviews": 1,
          "Date": "2020-05-13T14:08:21.000Z",
          "Titre": "Will not install",
          "Contenu": "Installation file is failing to install. So can't get past the first step, which is unfortunate."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-05-21T15:27:04.000Z",
          "Titre": "Your app is intrusive...",
          "Contenu": "Your app is intrusive and always wanting to update for an additional fee."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 1,
          "Date": "2020-11-18T00:33:27.000Z",
          "Titre": "On going issues with application",
          "Contenu": "On going issues with application. New email contact don’t populate."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-05-28T13:44:07.000Z",
          "Titre": "it stopped opening and working",
          "Contenu": "it stopped opening and working. already removed it from my imac"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kenneth Getz",
          "Nb_Reviews": 3,
          "Date": "2021-05-21T15:52:08.000Z",
          "Titre": "Personally",
          "Contenu": "Personally, didn't much care for it."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-05-21T08:22:59.000Z",
          "Titre": "Very bad app",
          "Contenu": "Very bad appUseless"
        },
        {
          "Note": 1,
          "Lieu": "AE",
          "Pseudo": "Ron Bush",
          "Nb_Reviews": 1,
          "Date": "2019-08-11T16:58:12.000Z",
          "Titre": "Data Theifs",
          "Contenu": "Data Theifs - Malware"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Darragh",
          "Nb_Reviews": 3,
          "Date": "2023-06-19T02:00:51.000Z",
          "Titre": "Riddled with performance-related bugs",
          "Contenu": "Riddled with performance-related bugs. I was a huge advocate for this software over the last 3+ years but one particular bug that has surfaced in the last few months prompted me to cancel my subscription. This bug caused Shift to crash at random intervals when closing browser windows and it has easily reversed every minute of time I've saved using this software over the last three years. This became particularly frustrating mid-conference call when trying to multitask. Crash logs were supplied to the support team but not much action came of them, sadly. I've since moved to Chrome with pinned tabs and my efficiency has sky-rocketed. A disappointing end to a great journey."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T20:10:25.000Z",
          "Titre": "Dislike that you're actively removing…",
          "Contenu": "Dislike that you're actively removing features as you roll through upgrades. You've taken away stuff that I was using.I also dislike that you don't provide any sort of warning before annual auto renewal. That's just tacky. Give your customers a fair shot at updating billing info, or even deciding they don't want to renew. Build a relationship with your customers, don't pretend you're a gym."
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-03T12:46:52.000Z",
          "Titre": "often doesn't log in / blank gateway no…",
          "Contenu": "often doesn't log in / blank gateway no way out - is getting better at this slowly though still annoyingsync with google problematic often with unnecessary prompts to re-login oftenstill can't get one of my accounts not to 400 error constantlyotherwise in terms of when it's working well - it works good and is a total bonus to my work"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tommy Vu",
          "Nb_Reviews": 2,
          "Date": "2023-02-24T00:15:17.000Z",
          "Titre": "Product removed main feature after purchase",
          "Contenu": "When I first purchased this product, the most useful feature was the workspaces for me. Since then, they have removed it and it has been close to a year without that feature, rendering the platform pretty bare bones and not worth the money, especially when I'm having to relog in constantly anyway and tabs from one device won't carry over to another device. I wouldn't have purchased nor did I intend to renew the program if I knew that it would be missing these features for a while. Not to mention the immense amount of bugs I encountered while using it and the countless customer support emails I've had to go through with no solution. As a concept it's amazing, it's execution has been faulty."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 2,
          "Date": "2023-04-20T07:15:11.000Z",
          "Titre": "Buggy Product and HUGE price increase",
          "Contenu": "This product has a couple decent concepts. For people who have dozens (or hundreds) of chrome tabs open, particularly with more than one google account, it is a great concept. Unfortunately, the execution is fairly poor. The product is very buggy. Every day, multiple times, the entire program just completely shuts down. When you email customer support, you'll get an answer a day later that basically asks for more information and says that their engineers are working on it, but you won't get any resolution for months (if ever). But, as buggy as the product is and as frustrating as the poor CS is, I was strongly considering renewing at the previous rate. But, instead they jacked up the prices. It's now $150 per year for what is basically a browser that allows multiple logins at once. But, good luck expressing to them how absurd this is. All you ever hear back is how much they've thought about the price increases and how rare complaints are. Okay, if you say so. When your churn goes through the roof, do me a favor and don't come begging your old clients to come back. You had a chance to take care of the longstanding clients and instead you decided to ignore concerns and jack up the prices."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Andreas Reuter",
          "Nb_Reviews": 8,
          "Date": "2022-09-03T18:15:10.000Z",
          "Titre": "After 2 years I gave it another chance",
          "Contenu": "After 2 years I gave it another chance. I thought they improved and fixed the bugs. Unfortunately, nothing is better. They still have performance problems, app opens always on mail links and they usually don’t refund, support people wants to get videos recorded of problems they actually aware about, and more. I don’t recommend to buy this app."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael Transon",
          "Nb_Reviews": 1,
          "Date": "2021-08-11T18:31:58.000Z",
          "Titre": "Forces you to brand your emails with their name",
          "Contenu": "If you’re a paying customer they, without notifying you, add their branding to your email signature as a free advertisement to anyone you email through the platform. You have to dive deep into their settings to find a way to turn it off (you can’t delete the advertisement they place in your emails). Fair warning."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Phil Arundell",
          "Nb_Reviews": 14,
          "Date": "2021-11-24T06:24:21.000Z",
          "Titre": "Desperately needs an M1 native version",
          "Contenu": "Apple did almost too good a job with Rosetta 2 because it has meant quite a few companies have been lazy about making their apps M1 native, and Tryshift appear to be one of them - it works, but is very slow on an M1 macOn my old Intel mac it was probably my most used app and saved me loads of time. However, on my new M1 it's painfully slow at times.Microsoft have shown with Visual Studio Code that Electron based apps can be fluid, fast and M1 native and Tryshift need to move to the M1 native version of Electron sooner rather than later. If there isn't an M1 native version available when my subscription is up for renewal, I will be looking elsewhere"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tad Schnitzer",
          "Nb_Reviews": 5,
          "Date": "2022-01-25T21:31:45.000Z",
          "Titre": "Not very great",
          "Contenu": "Not very great. Great concept, but it just doesnt save your stuff in a proper fashion. It crashes almost every restart and resets your settings. Even though I contacted support over a year ago and they provided a half solution, it has not been fixed in the many updates since then. I'm not sure what causes the issue, but I'm not wasting my time on this program any longer."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2022-06-03T12:35:23.000Z",
          "Titre": "Honestly I wish i could get a refund",
          "Contenu": "Honestly I wish i could get a refund. I loved the idea of the whole system but it just crashes my computer deeming it completely useless. I tried the beta and alpha versions along with the main version and none of them work properly. They would constantly log me out of my accounts. I'm pretty disappointed. Even with a discount it was still 60 bucks, which is a good chunk of change for me. Especially right now."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "helen grady",
          "Nb_Reviews": 7,
          "Date": "2022-08-01T01:31:37.000Z",
          "Titre": "Not a stable app",
          "Contenu": "Used this app for about 6 months then they try to force an update on you that doesn't not have key functionality that I use every day.   Then last night I shut down computer and go to start up this morning and its lost every setting and trying to set up a new account.   These things should work and don't.  Moving on."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-23T17:22:36.000Z",
          "Titre": "Great idea, platform still glitchy",
          "Contenu": "I love the concept of Shift but I still encounter numerous issues with the platform which ultimately leads me to use a regular internet browser. The platform is very slow, some of my accounts simply do not load, and my extensions have to be uninstalled and reinstalled often."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-19T11:55:07.000Z",
          "Titre": "Each time a new update is released it…",
          "Contenu": "Each time a new update is released it breaks major components of the program.  I have had to completely uninstall and do a total database rebuild on numerous occasions after an \"upgrade.\" QC is entirely lacking."
        },
        {
          "Note": 2,
          "Lieu": "ES",
          "Pseudo": "Agustín",
          "Nb_Reviews": 1,
          "Date": "2022-11-10T10:53:51.000Z",
          "Titre": "No full search and loading issues",
          "Contenu": "New version don't have the integrated search. Also is not working properly, I have to restart the app all the time in order to see the email or drive in all accounts"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Adam",
          "Nb_Reviews": 1,
          "Date": "2021-06-24T22:08:03.000Z",
          "Titre": "Expensive fancy re-pack of a browser, does not work offline",
          "Contenu": "Trialed the software and after 3 days I think it quite useful. I haven't had the glitches (yet)  that others have had. However, there is no OFFLINE capabilities. For the cost it's unfathomable."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-09T19:09:50.000Z",
          "Titre": "Reliably crashes Cinnamon desktop when…",
          "Contenu": "Reliably crashes Cinnamon desktop when startedCan't login today; app just sits there waiting for Google authentication to load."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Former User",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T19:34:34.000Z",
          "Titre": "Updates rendered it almost un-usable",
          "Contenu": "Updates rendered it almost un-usable.  Good idea but not practical in day to day high use."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeff Foster - Convuent",
          "Nb_Reviews": 1,
          "Date": "2021-06-22T13:49:01.000Z",
          "Titre": "Have been using Shift for over a year",
          "Contenu": "Have been using Shift for over a year. Just a month after signing up for a paid pro version, I found that there were too many bugs in the system and tried to cancel my subscription. Upon doing so, the shift team offered me a full year of the pro version for free. So, they refunded me and I took the offer.  I must say that while the platform was useful, it comes with challenges.  Every other day there would be a glitch somewhere in the dashboard, or a new update.  Many times the dashboard would open up, but would not function.  Meaning I could not navigate through any of my mail, folders, drafts..   This was extremely frustrating.While support would have me uninstall the software, try an alpha or beta version instead, each with their own bugs and glitches, which I gladly would create a support ticket for.  I just was fed up with having to be their guinea pig and never any real fix or improvement.When I saw that my subscription was about to expire, I did reach out to them to see if they would continue my free \"pro\" subscription since I was a loyal customer and they simply told me NO!  Not even a substantial discount. #TryshiftfailWhile I am always looking at new technology and innovative products for my team, TryShift just doesn't make the mark for both their product or their support! Poor customer ExperienceThey Don't Listen#ShiftFail#too expensive"
        },
        {
          "Note": 2,
          "Lieu": "BE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-01T08:35:54.000Z",
          "Titre": "Shift often blocks and needs a restart",
          "Contenu": "Shift often blocks and needs a restart. Very annoying"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "KMW",
          "Nb_Reviews": 2,
          "Date": "2022-09-09T16:32:58.000Z",
          "Titre": "Shift was great…",
          "Contenu": "Shift was great! Now it’s a chromium skin…Huge downgrade"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeremy Smith",
          "Nb_Reviews": 2,
          "Date": "2022-04-02T16:37:54.000Z",
          "Titre": "It's fine but very slow and buggy for…",
          "Contenu": "It's fine but very slow and buggy for me. Gave up and went back to doing everything in the browser."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Andrew",
          "Nb_Reviews": 1,
          "Date": "2021-05-21T08:49:54.000Z",
          "Titre": "Lousy customer service and over-reach from marketing",
          "Contenu": "Please stop emailing me the same email every day with my “special offer” to upgrade (as I’m “only human” and missed the original fabulous offer)! It is so counter-productive and BORING! I would be more receptive if you laid off the over-enthusiasm or perhaps at least wrote different things. See…I can’t even think about whether I like your software or not. Maybe next time. Customer service counts. You got a fail."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2021-04-11T21:24:09.000Z",
          "Titre": "SLOW",
          "Contenu": "Shift is ok if you have less than 10 accounts, but anything more and the app crashes and is super slow. I use it for work, and have about 30 accounts with 2 tabs open in each, and my brand new ASUS laptop can't handle it. Shift uses so much CPU, and their customer support is a joke. Also, it will randomly log you out of your accounts, and even delete the bubbles on the left hand side. I end up using Google chrome browser for everything else, and avoid opening tabs in shift. Don't waste your money"
        },
        {
          "Note": 2,
          "Lieu": "PE",
          "Pseudo": "CCC",
          "Nb_Reviews": 1,
          "Date": "2020-06-14T01:18:38.000Z",
          "Titre": "Nope",
          "Contenu": "A few minutes to setup... ooo, nice UI... then realizing it’s basically a pop-up email client, but only with a long term subscription. Ooo, but they offer a coupon. NOPE not interested. Not only that, it somehow relaunched after closing with ANOTHER coupon... like, “no, human, wait don’t go”.  I uninstalled it quick. Great effort guys, looked promising. but you come off Creepy, weirdly."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Duncan",
          "Nb_Reviews": 1,
          "Date": "2020-11-18T00:10:00.000Z",
          "Titre": "Extensions slow down Shift!",
          "Contenu": "It used to be amazing but recently discovered that many of the extensions slow Shift down to an unusable pace - I have a high performance machine, but I am also using a lot more native Gmail apps that aren't available on Shift.  Shame as I liked the experience but I won't be renewing my premium license."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Heero Miketta",
          "Nb_Reviews": 8,
          "Date": "2021-02-19T20:38:57.000Z",
          "Titre": "Overpriced wrapper for web pages",
          "Contenu": "It is just a wrapper for web pages. There is a good thing: You can have multiple accounts of any app, which is neat. But that is the only thing that sets it apart from a tabbed browser. I would like it if it was a quid a month. But 99 Dollar a year? For a web wrapper? It really is outrageous."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alex Azoury",
          "Nb_Reviews": 2,
          "Date": "2020-04-10T23:33:01.000Z",
          "Titre": "Prepare to be squeezed like lime",
          "Contenu": "Honestly, you can’t even try this properly before they start slamming your work limits and notifications to ‘upgrade’My ‘free trial’ allowed me to add 2Measly email accounts. Woo! (Sarcasm). That’s not a time saving tool.I’d consider buying this if they actually offered some type of useable trial. And didn’t spam my email to hell in the process"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Zoran Bravo",
          "Nb_Reviews": 2,
          "Date": "2020-02-01T02:41:22.000Z",
          "Titre": "SHIFTy",
          "Contenu": "SHIFTy!   yes the app is free, as free as opening a new tab in chrome but that's it, then to actually be useful is $99USD per year!Then you immediately close and begin pulling the plug and it magically becomes $49USD per year!You continue flipping the bird as you begin to close down and disable the app and it become \"FREE\" for 30 days as a trial using code TRIAL30.Read the T&Cs and privacy policy, Nope Nope Nope! trySHIFTy at own peril."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Blu Vegas",
          "Nb_Reviews": 2,
          "Date": "2020-08-15T15:43:30.000Z",
          "Titre": "Overcharged and unhappy",
          "Contenu": "I like shift, don't get me wrong, but when I bought the yearly plan, I expected it to charge me what they said they would charge me. $99. So when I checked my bank account to find they had actually charged me $140, I was understandably concerned. They need to get on to fixing this."
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "Emma",
          "Nb_Reviews": 1,
          "Date": "2020-11-18T03:43:08.000Z",
          "Titre": "Never seems to connect to the server",
          "Contenu": "Never seems to connect to the server. Love the idea behind it though and do hope they can get it flowing quickly one day (gutted I paid for the full version when I don't actually get to use it)."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Isabelle Mercier",
          "Nb_Reviews": 7,
          "Date": "2020-11-17T23:30:10.000Z",
          "Titre": "It's a great tool that I love to use…",
          "Contenu": "It's a great tool that I love to use however, it's a huge memory drain and it makes my system heat up....and I have a great \"gaming\" computer with 32gigs of ram..."
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "Anne",
          "Nb_Reviews": 1,
          "Date": "2019-06-01T10:39:12.000Z",
          "Titre": "Brilliant unless you're a student or individual",
          "Contenu": "From what I've seen it looks great. Integration of various apps (including TickTick, which is rather notorious for not supporting Zapier or IFTTT, and Bitwarden, even blackboard!), a neat UI, and overall easy to use. Such a shame though that the free version only allows for integration of up to two email accounts, which makes it absolutely useless. If you want to use other applications like Trello, Whatsapp, or anything that's not an email account, you have to pay for the Advanced version, which is $99.99 a year. The Pro version only allows for the use of multiple email accounts, and costs $29.99 a year. The only subscription option is yearly for both versions. Would have absolutely loved this, but $99 upfront is just too much if you're still in school/college/university. Might have considered to keep using it if there had been a trial period or a monthly subscription."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Bespoke",
          "Nb_Reviews": 1,
          "Date": "2020-11-03T10:17:15.000Z",
          "Titre": "So many bugs",
          "Contenu": "So many bugs! It crashes fairly frequently, and then you cannot get the support you need - you can only get an open-ended ticket."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Darren",
          "Nb_Reviews": 4,
          "Date": "2019-06-06T11:36:52.000Z",
          "Titre": "Nothing special",
          "Contenu": "Nothing special - basically a tab shifter and within a few minutes of signing up I was being asked to pay."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert Hibbs",
          "Nb_Reviews": 2,
          "Date": "2021-11-19T12:35:32.000Z",
          "Titre": "App is very quirky",
          "Contenu": "App is very quirky.  Takes forever to load."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Lucas Roach",
          "Nb_Reviews": 1,
          "Date": "2020-11-24T23:39:02.000Z",
          "Titre": "Shift significantly slows down my…",
          "Contenu": "Shift significantly slows down my computer. I have stopped using it because of this reason."
        },
        {
          "Note": 2,
          "Lieu": "RS",
          "Pseudo": "Lorin McCann",
          "Nb_Reviews": 2,
          "Date": "2019-12-13T23:12:49.000Z",
          "Titre": "Amazing Product, Awful Support",
          "Contenu": "The product is excellent but I'm extremely disappointed by support. I was offered a free year long trial of the beta version of Premium by a senior member of the team after having buggy experiences earlier on. A few months in I was loving it and planning to upgrade to Premium after the year. Having apps and accounts streamlined really boosted my workflow, productivity, and mental clarity.However, after a few months, the account was spontaneously downgraded. After almost 2 additional months of back and forth with support, I still didn't have access to the original subscription. The person I was in communication with was friendly and responsive at first, but literally did not acknowledge the nature of the issue and kept asking for the credit card on file (there was none since I never had a paid account). I question whether or not she actually read the emails. Eventually she stopped responding unless I followed up, became less and less friendly, and I finally just deleted the account. I loved the product but felt there was a significant disconnect with customer support that made it impossible to benefit from the Shift in a reliable way. Ultimately, the issues with customer support cost a great deal of time and I lost all of the benefits of streamlined productivity."
        },
        {
          "Note": 3,
          "Lieu": "BE",
          "Pseudo": "Kees",
          "Nb_Reviews": 2,
          "Date": "2023-04-19T15:20:42.000Z",
          "Titre": "50% price increase is saying F#CK to your customers",
          "Contenu": "I am using Shift for years.But a 50% price rise is robbery. I understand that everyone wants to make extra profits these days. But to be honest: 50% price increase doesn't meet 50% extra features."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-17T22:12:43.000Z",
          "Titre": "Good with some significant limitations",
          "Contenu": "I like having everything in one place, but there are major limitations to the browser. For example, I can't use my Gmail boomerang extension because the pop-up doesn't appear. It also times me out for links that I need to use SSO for. Lastly, some of the online software I use for work doesn't fully work in Shift but works in Chrome."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rejess Marshall",
          "Nb_Reviews": 2,
          "Date": "2023-01-05T18:13:29.000Z",
          "Titre": "When I signed up shift had workspaces…",
          "Contenu": "When I signed up shift had workspaces which really worked well for my working style and managing multiple things. This new design isn't as friendly or functional for me. I'm holding on hope that workspaces return and the master calendar would be an excellent addition."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-04T22:51:57.000Z",
          "Titre": "Add-ons don't work anymore",
          "Contenu": "Add-ons don't work anymore, specifically Grammarly. It doesn't underline my corrections so I'm left guessing. It's one thing if you don't support an add-on but if you do, make sure it works. Also, the Salesforce integration doesn't work at ALL."
        },
        {
          "Note": 3,
          "Lieu": "FI",
          "Pseudo": "Ia Ensterä",
          "Nb_Reviews": 3,
          "Date": "2022-08-15T10:55:53.000Z",
          "Titre": "Has removed some steps in accessing…",
          "Contenu": "Has removed some steps in accessing apps (positive), but has also added some steps in downloading things (negative). Not sure yet if it is worth putting on my other computers."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Ellen",
          "Nb_Reviews": 3,
          "Date": "2022-10-06T10:23:35.000Z",
          "Titre": "I love having everything in one place",
          "Contenu": "I love having everything in one place. BUT, there are glitches.  Small things sometimes but stressful nonetheless as they completely eradicate the ease the system should bring."
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "Marco",
          "Nb_Reviews": 1,
          "Date": "2022-08-06T10:07:17.000Z",
          "Titre": "V8 version is just a Chromium browser…",
          "Contenu": "V8 version is just a Chromium browser fork with less functions than the previous version.However, I've tried really each other solution and Shift is the best for now."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stanley Bogode",
          "Nb_Reviews": 1,
          "Date": "2022-03-23T20:11:28.000Z",
          "Titre": "I really REALLY wanted to like Shift",
          "Contenu": "I really REALLY wanted to like Shift, it helped me organize my work mentally into categories. However, a few things hold it back.1. Performance. With several workspaces and even when using a high-end machine, it's just too slow compared to the browser. That might have something to do with the 32-bit mode that it operates in (on Windows at least)2. Extension support. Ultimately, this is where a lot of little bridges are burned since there's a wealth of extensions that make Chrome and other browsers that much more useful.However, A+ to their customer support.If you're in the same boat as I was, try Workona instead, it's a game-changer that achieves a lot of what Shift tries to achieve, but does it all in the browser."
        },
        {
          "Note": 3,
          "Lieu": "AE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T12:13:30.000Z",
          "Titre": "There should be search option available…",
          "Contenu": "There should be search option available (as before) where we can do a full search on all the emails from one place."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-03-06T21:14:28.000Z",
          "Titre": "Good but not perfect yet",
          "Contenu": "The app is perfect for my workflow; however it is so unbelievably slow and laggy no matter what computer I use it on. If they could lighten the app on resources it would be epic."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jonathan Jeong",
          "Nb_Reviews": 2,
          "Date": "2023-01-04T17:36:43.000Z",
          "Titre": "Regularly buggy",
          "Contenu": "Regularly buggy. Applications are constantly not loading and I have an inconsistent experience across laptops, where this should be adding more consistency."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-09-05T18:36:19.000Z",
          "Titre": "I’ve been waiting for the features from…",
          "Contenu": "I’ve been waiting for the features from V7 like workspaces to come into V8, I heavily rely on those"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2022-07-13T18:58:15.000Z",
          "Titre": "The software works just fine when I…",
          "Contenu": "The software works just fine when I use, but I am only able to use it for about 10-15 minutes before it starts to make my laptop overheat. So, I don't use it often or at all."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-02T14:02:54.000Z",
          "Titre": "Slows down my computers significantly",
          "Contenu": "Slows down my computers significantly. Password vault doesn’t always work and I have to continually log into to different apps"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-06-09T16:12:09.000Z",
          "Titre": "I love the idea of Shift but the system…",
          "Contenu": "I love the idea of Shift but the system is fenticky. It crashes a lot. My vault won't sync across computers even when I follow all the instructions. And it keeps logging me out of my accounts."
        },
        {
          "Note": 3,
          "Lieu": "RU",
          "Pseudo": "Mihail Matyushko",
          "Nb_Reviews": 2,
          "Date": "2021-11-19T13:15:00.000Z",
          "Titre": "On a Mac (m1 pro) it doesn't work well",
          "Contenu": "On a Mac (m1 pro) it doesn't work well. Slow, waiting constantly for CPU and 5 GB RAM (for 3 gmail emails).I regret that I bought it for a year."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Count",
          "Nb_Reviews": 1,
          "Date": "2022-11-05T21:10:31.000Z",
          "Titre": "Lately",
          "Contenu": "Lately, I have to reload the app constantly to see all of the email accounts."
        },
        {
          "Note": 3,
          "Lieu": "JP",
          "Pseudo": "Uc",
          "Nb_Reviews": 1,
          "Date": "2022-01-07T09:16:38.000Z",
          "Titre": "Want to add Gmail add-on",
          "Contenu": "I use 16 Gmail accounts.It is good for me but I want to add Gmail add-on like HubSpot."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Alexandre Gauvin",
          "Nb_Reviews": 2,
          "Date": "2021-01-18T15:30:13.000Z",
          "Titre": "Free version doesn't offer enough options",
          "Contenu": "Seems like an interesting app, but the free version does not offer enough space to try with. 2 accounts and 1 app, muted notifs, no extensions and no search ? Come on guys ! What do you want us to even test with such a few functionality ? With these limitations, Chrome does a better job.Maybe if the free version could offer something like 1 week full version. And then fall back to the limitation of free version."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Nimrod Ganon",
          "Nb_Reviews": 2,
          "Date": "2020-11-17T23:34:50.000Z",
          "Titre": "Great products when it Works, but there are many issues.",
          "Contenu": "Wile the product when it works, is AMAZING, You will need minimum 16GB of Ram if not double depends on how may emails and app you will have, it always asking you to put the lg ins of you emails in randomly times which is so annoying and it never remember the password. You will find your self restarting the Mac at list once a week or you wont be able to type any emails. but when it works well, it is GREAT."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ruben",
          "Nb_Reviews": 1,
          "Date": "2020-11-18T18:13:50.000Z",
          "Titre": "I've actually had some issues with the…",
          "Contenu": "I've actually had some issues with the Shift while it is a great concept for organizing workspaces and apps, it still has trouble running these apps efficiently and the built-in browser tabs have trouble performing well than it would in a more popular browser like Google Chrome, where those problems would cease to exist."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sean Coakley",
          "Nb_Reviews": 2,
          "Date": "2020-11-17T23:33:10.000Z",
          "Titre": "Overall I am happy that I chose Shift.",
          "Contenu": "Overall I am happy that I chose Shift.. as I am a multi google account user it has provided me the functionality I need to work from all my accounts all day.  I wish there was a way  to move or reorder browser tabs on each account...also I can’t get dashlane to auto login to accounts like I css as n in a google browser..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Caelan Mars",
          "Nb_Reviews": 2,
          "Date": "2020-11-25T15:01:02.000Z",
          "Titre": "Beautifully flawwed.",
          "Contenu": "I love the convenience of the service, however it doesn't seem to be as stable as other browsers. My favorite thing about it is how I can easily jump between drive accounts and emails with ease.I wish it would keep me logged in to my accounts...."
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "Rick C.",
          "Nb_Reviews": 1,
          "Date": "2020-06-10T10:28:23.000Z",
          "Titre": "This is the third time I give Shift try, and it still pretty aweful.",
          "Contenu": "This is the third time I give Shift a try over the past couple of years. It has been improving a lot but still super buggy. Free account is down to merely two email accounts, which is pretty silly to start with.  Still, many useful extensions are missing. In-built web browser is super laggy, gets stuck more often than not.I got a 1-week trial (1 week???) to test it out.. after which email and action spam came into action.I tried to use different apps i currently use from shift and they were all much slower than from firefox or opera (chrome based).Overall I do still like the idea but too many things dont work, and burns way too much resources from my laptop. Is a no, too many limitations."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-03-06T12:08:03.000Z",
          "Titre": "It's ok",
          "Contenu": "It's ok, didn't rock my world"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Helpha",
          "Nb_Reviews": 3,
          "Date": "2020-12-08T13:47:40.000Z",
          "Titre": "It used to work great",
          "Contenu": "It used to work great, but I have a feeling that things have really deteriorated over the last few months. Sometimes there's a huge performance hit and it has to be rebooted, apps get disconnected of they freeze and you have to remove them a re-add them or you get ghost notifications that won't get away. I have a huge gamer PC, I doubt that the performance problems are related to hardware.Also, one of the features that made me unsubscribe was that the update alt-tabbed everything 2 or 3 times before showing up. Let's say you're in a game, and the update finishes, shift will minimize your game but there's nothing, so you re-open the game, then it will minimize it again, with nothing to show you, of course. Then on the 3rd time, it will tell you that there's been an update and that it needs to restart. It can't get any more annoying than that when you're playing an online game.I used to like it, but for 100USD/year it has to be better."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "LaurieB",
          "Nb_Reviews": 1,
          "Date": "2020-11-18T01:45:41.000Z",
          "Titre": "Unstable solution",
          "Contenu": "There is a significant delay in receiving mail. Constant freezing, and very slow. Not a result of my internet connection"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Brittany Norris",
          "Nb_Reviews": 1,
          "Date": "2020-11-18T17:05:02.000Z",
          "Titre": "Need to add video calling and screen…",
          "Contenu": "Need to add video calling and screen sharing options to Slack App!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robkeem",
          "Nb_Reviews": 1,
          "Date": "2020-11-17T23:57:42.000Z",
          "Titre": "Lastpass plug in rarely works",
          "Contenu": "Lastpass plug in rarely works. One drive does not work either"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-07-09T16:48:13.000Z",
          "Titre": "A bit fiddly but ok!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Philleep Florence",
          "Nb_Reviews": 1,
          "Date": "2020-11-18T00:24:25.000Z",
          "Titre": "Memory and Browser Tabs",
          "Contenu": "Memory can always be more efficient for apps and open tabs."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Lisa DeGara",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T07:37:29.000Z",
          "Titre": "Genuinely useful and effective program",
          "Contenu": "Genuinely useful and effective program! I have had Shift for several years to support my multiple email accounts from different sources. It is easy to use, simple, and helpful. The only reason why I don't give this five stars is that I doesn't have perfect integration with all emails. I recommend this program."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Martin",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T02:05:07.000Z",
          "Titre": "Great product but would like more payment options",
          "Contenu": "Great product.  The only thing that I have an issue with is that I am using this in our company because we have multiple teams being used. More of our members could use this, however I asked about purchase orders and check payments like our other vendors. I was told that was not available, so I renewed with my personal card. We will not be adding to other users in the company, however I will continue to use it."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Steffen",
          "Nb_Reviews": 3,
          "Date": "2023-02-03T10:29:18.000Z",
          "Titre": "Good concept, but...",
          "Contenu": "in theory very handy, but the download manager for Outlook is very, very, very, VERY poor. Downloads of attachments over 4-5MB often fail and I need to try 4,5,6..10 times until the download is successful. Alternatively, I open Outlook desktop and download it from there, or save to OneDrive and download from OneDrive. That really beats the whole idea! Since latest update, downloads sometimes just don't happen at all, regardless of size of attachment. Very annoying. Requires serious improvement."
        },
        {
          "Note": 4,
          "Lieu": "IL",
          "Pseudo": "TAMIR",
          "Nb_Reviews": 1,
          "Date": "2022-01-13T14:58:15.000Z",
          "Titre": "works great, but...",
          "Contenu": "Shift works grean and the workflow is very fluent.However, while showing \"focused\" and important emails while minimized as tray icon, it lacks the option to reopen at the last app used, i.e. \"Whatsapp\" and others...If the option to open on last opened app will be available, would be the perfect software for workflow hub and inteface cosolidation"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Matt",
          "Nb_Reviews": 3,
          "Date": "2022-07-08T11:08:03.000Z",
          "Titre": "It Has Most Definitely Saved Me a Lot of Time",
          "Contenu": "Very helpful tool to keep multiple email accounts organised and easily accessible. It has most definitely saved me a lot of time by having it all in one place. Well worth the cost when looking at the time saved. I have had no issue with functionality but, it doesn't get 5 stars due to some minor aesthetic issues."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Beth M",
          "Nb_Reviews": 1,
          "Date": "2022-06-01T14:24:18.000Z",
          "Titre": "Shift is a game changer when you deal…",
          "Contenu": "Shift is a game changer when you deal with multiple clients or want to switch to different accounts.  It has helped me immensely in my business.  The only issue is sometimes when I collaborate with someone else, not all the items transfer over which causes an issue.  Also, my gmail account will often need to be signed into regularly and it will freeze between workspaces.  I'm giving a 4 only because there are a few glitches to work out, but this is one of the best apps I've every used for business.  Highly recommend."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Maureen",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T20:45:40.000Z",
          "Titre": "Everything was great!",
          "Contenu": "Everything was great!  Had to transition my primary account and it went smoothly once initiated.  Only drawback is that I'm on the east coast, so although I work as late as 5:00 pacific coast time, I start at 8:00 east coast time.  I started my ticket late and had to wait for pacific coast to catch up to my work day."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Katina Lockhart",
          "Nb_Reviews": 1,
          "Date": "2022-04-03T13:13:44.000Z",
          "Titre": "I enjoy using this service",
          "Contenu": "I enjoy using this service, it has reduced the number of windows opened in my computer & all of my notifications are in one place. The only thing I disliked so far is that it wasn’t clear how the free trial worked. Overall a great experience thus far."
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Zachary",
          "Nb_Reviews": 2,
          "Date": "2023-04-12T18:16:19.000Z",
          "Titre": "Great app",
          "Contenu": "I love how the app let's me easily and quickly access my google calendar without having to open my browser every time. I enjoy dedicated apps for specific things, so I use Shift exclusively for my calendar, and I love it."
        },
        {
          "Note": 4,
          "Lieu": "NO",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2023-02-18T10:08:29.000Z",
          "Titre": "In the main this is a great app for…",
          "Contenu": "In the main this is a great app for freelancers. I can collate all of my clients apps in one window and monitor multiple incoming sources at once. It’s sometimes a little glitchy and no mobile version yet. 🤞🏻"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chad",
          "Nb_Reviews": 3,
          "Date": "2023-05-10T04:15:59.000Z",
          "Titre": "Great software - just needs a few minor fixes!",
          "Contenu": "I've been using Shift for over two years, and it's very impressive how everything is shaping up. There are currently just three issues for me that prevent it from being a five star app. 1.) For those of us with a ton of apps open (discord, slack, gchat, linked in, etc etc), it would be great to be able to group and expand/collapse the app icons on the side of shift. The way discord does with its server management works perfect. You can google examples of how this works.2.) When doing video chats or huddles with screen sharing, I need to be able to pop that out to a floating window I can move away from the shift window. You used to be able to do this in shift 7.3.) Whenever someone replies to a thread in slack, i don't get any notifications."
        },
        {
          "Note": 4,
          "Lieu": "IL",
          "Pseudo": "Ron Heiblum",
          "Nb_Reviews": 2,
          "Date": "2023-01-11T01:06:52.000Z",
          "Titre": "Fast response hope they fix it",
          "Contenu": "Fast response, good answer with a good feeling that they took it seriously.I hope they are going to add my request due to the fact I need it, and I am actually still using Chrome for that reason :("
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-22T14:23:26.000Z",
          "Titre": "Helpful for sure but definitely buggy…",
          "Contenu": "Helpful for sure but definitely buggy at times. Makes it a little annoying to have to force close and reopen bc it won’t let me minimize the screen, or play a video etc."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shar Findahl",
          "Nb_Reviews": 4,
          "Date": "2021-11-27T20:34:27.000Z",
          "Titre": "Enjoy the ease of being able to login…",
          "Contenu": "Enjoy the ease of being able to login and go to any or all of my sites from one location.  Still seems slow and still has a couple of clitches but I'm sure you are working on everything and so I'm not complaining."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Tony McHugh",
          "Nb_Reviews": 3,
          "Date": "2023-03-07T13:31:57.000Z",
          "Titre": "It's just a great idea overall and the…",
          "Contenu": "It's just a great idea overall and the inclusion of chrome extensions was a game charger for me personally. I'd give 5 stars if I weren't waiting so long for the re-introduction of the workspaces feature"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rodrigo",
          "Nb_Reviews": 1,
          "Date": "2022-04-01T19:10:51.000Z",
          "Titre": "(Basically) Loving It",
          "Contenu": "I want to give you 5 stars, but I think your app is not quite there yet.Pros: layout is perfect, the concept fantastic, UX greatly done. My experience has improved 200% with this, that's why I **want** to give you 5 stars.Cons 1: there is *only* one con that's prompting me to write this review and remove one star... REFRESH. There are some applications that I need to know in advance that there's a message, click somewhere, and then back (or refresh directly which is a pita) in order to get an updated list with new messages. It's a pita that I'm ok living with, but it's preventing the app from being perfect. Refreshing needs to be your biggest priority in my mind, WhatsApp requires SOOOO many clicks in-and-out for the notification to get updated.Con 2: I understand that the concept works *only* for web-based applications, but I think you guys should really figure out a way to make non-web-based apps (e.g. Signal) to work with it... it's still silly having to have Signal opened somewhere else. Not a dealbreaker, but stillRecommendation: Remove the \"[+] Add to Shift\" from the panel and move it to the \"... Options\", once you've installed all the stuff you need, that icon there is just ugly (or make it optional in the config panel)."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Doug Schneider",
          "Nb_Reviews": 2,
          "Date": "2023-05-27T00:07:15.000Z",
          "Titre": "Zoom In Feature Lacking",
          "Contenu": "One of the things the Shift development team could work on is the zooming in feature.  You should be able to hold the Ctrl key down and scroll the mouse to amplify the screen size...but this app does not do that."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Heather M",
          "Nb_Reviews": 1,
          "Date": "2021-11-19T18:41:56.000Z",
          "Titre": "I love Shift!",
          "Contenu": "I love Shift! It's my new favorite thing. The only issue I have is the pop out windows. Sometimes everything opens up in a new tab, but other times they open up in a new window. That can be very frustrating and distracting. I would give it 5 stars if this wasn't an issue. Otherwise, I give it a solid 4.5!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rigel",
          "Nb_Reviews": 1,
          "Date": "2022-04-06T18:45:51.000Z",
          "Titre": "Great but iPad app seriously needed!",
          "Contenu": "Shift would be a perfect tool if they offer an iPad app, for now, perfect for desktops but the world is going mobile a long time ago"
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "Giuseppe Kobayashi",
          "Nb_Reviews": 2,
          "Date": "2022-04-07T08:31:13.000Z",
          "Titre": "Add 1Password to the application list",
          "Contenu": "Add 1Password to the application list.  I currently have to re-open the URL at the default browser each to use login via 1Password."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "KR",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T15:41:40.000Z",
          "Titre": "Love the platform",
          "Contenu": "Love the platform, just wish you wouldn't have made the change to make your default account non-movable."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mr Wheeler",
          "Nb_Reviews": 3,
          "Date": "2023-05-25T09:29:10.000Z",
          "Titre": "Quick response to query",
          "Contenu": "Response time to query measured in a few hours.  Didn't solve my problem but I know they're working on it"
        },
        {
          "Note": 4,
          "Lieu": "GR",
          "Pseudo": "Artemis Kavgalaki",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T17:13:24.000Z",
          "Titre": "Very concise and detailed instructions…",
          "Contenu": "Very concise and detailed instructions about how to proceed with problem solving Remies are very polite and supportive to their human co-workers...!"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-08-29T10:52:31.000Z",
          "Titre": "Overall great tool",
          "Contenu": "Overall great tool, but some apps don't work perfectly like Chrome. Creates tabs when it should be the base app etc..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nhan",
          "Nb_Reviews": 1,
          "Date": "2022-05-02T12:43:34.000Z",
          "Titre": "Great product",
          "Contenu": "Great product. If you work out the little bugs like automatic password filling for Google that works most of the time, I would give 5 star"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Bart",
          "Nb_Reviews": 1,
          "Date": "2022-02-15T20:49:15.000Z",
          "Titre": "Shift takes care of productivity.",
          "Contenu": "Great product, more productive. Great way to organize all the apps you are using..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-11-19T18:09:47.000Z",
          "Titre": "Great w a hiccup",
          "Contenu": "Love the features and functionality.Too many times does it freeze or such."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Omi V",
          "Nb_Reviews": 2,
          "Date": "2022-10-29T17:15:55.000Z",
          "Titre": "Shift is fantastic",
          "Contenu": "Shift is fantastic. Only comment, I’d like the platform to be faster :)"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Erilda Simone Urbach",
          "Nb_Reviews": 1,
          "Date": "2022-10-12T11:15:26.000Z",
          "Titre": "Saves me so much time",
          "Contenu": "Saves me so much time. I am just waiting for workspaces to be available on V8"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Genevieve",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T00:46:52.000Z",
          "Titre": "Communications are great",
          "Contenu": "Communications are great, but the problem still remain."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Pamela Young",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T21:37:45.000Z",
          "Titre": "Quick response and solution."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nikki",
          "Nb_Reviews": 1,
          "Date": "2020-11-24T23:32:29.000Z",
          "Titre": "I love SHIFT",
          "Contenu": "I love SHIFT, my only reason for not giving them 5 stars is how much power it uses on my computer, there are a few little glitches with syncing to the drive as well. But honestly, I would hate working without it. It's a lifesaver on many levels. MUST have for anyone with multiple emails that need to be utilized throughout the day and you don't want a million & 1 tabs open."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Doug Sinning",
          "Nb_Reviews": 1,
          "Date": "2020-11-25T23:20:00.000Z",
          "Titre": "I love Shift, but...",
          "Contenu": "I love Shift, but there was an update that made my Shift start opening up the \"EDIT APPLICATION\" window for almost every app that I click on to open.  (You know the same window that says to \"choose the color\")VERY ANNOYING.  All subsequent updates still have NOT fixed this issue.It's wasting my time.  Which is counter-intuitive of this app.  This is the ONLY reason that it's getting 4 stars out of 5."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dana Reese",
          "Nb_Reviews": 1,
          "Date": "2020-11-18T04:41:09.000Z",
          "Titre": "I love the ease that Shift brings",
          "Contenu": "I love the ease that Shift brings; being able to see all of my clients' email accounts and apps in one workstation is great. My only complaint is that Shift sometimes shut down on me, requiring that I log into each account again. With over 30 total accounts connected, this is a bit irritating. Hopefully this is fixed soon and I'll have a 5-star experience!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Owen Johnson",
          "Nb_Reviews": 1,
          "Date": "2020-11-18T12:24:27.000Z",
          "Titre": "No Support for Salesforce, even though app is there. However great concept and usage. Love it.",
          "Contenu": "No Support for Salesforce, which is annoying. However I love this software. I would request that there is an option to show websites in the main window as an APP. So as a \"nested\" icon to the left nav bar and not as an added tab in the main window. Otherwise I would give the software a 5 star review."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JT",
          "Nb_Reviews": 1,
          "Date": "2020-11-25T03:47:59.000Z",
          "Titre": "good software",
          "Contenu": "Nice program, although over the last year it's given me a few routine blips. In general it acts a little strange and slow/refresh-loops with tabs, especially links from emails for example, and also whenever an external window is up such as viewing a pdf \"inside\" shift. The ctrl+tab feature almost always hides my buttons and freezes up but the program itself stays active.I use this program all day for work and personal on my 2nd monitor. It makes for a great permanent hub in full screen mode."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Richard",
          "Nb_Reviews": 9,
          "Date": "2019-09-02T19:55:21.000Z",
          "Titre": "So far I'm liking it",
          "Contenu": "So far I'm liking it. One place of all my project work, internal comms, loads more. I don't have to juggle a dozen apps. And looks like they're just getting started with new feature in the pipeline I really like the sound of (tabs). Customer service is a little slower than the best companies but I've had much worse from big names. So far they've been helpful and offered discounts."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-08-10T10:39:45.000Z",
          "Titre": "Good app.",
          "Contenu": "Good app.but less usage of memory and CPUs make me more happy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephen Redgrift",
          "Nb_Reviews": 1,
          "Date": "2020-11-29T23:39:53.000Z",
          "Titre": "Shift Review",
          "Contenu": "You cannot copy and paste a URL from the Chrome browser - it want's to open a new tab. Because of Chrome, can be a resource hog. Occasionally cannot close Shift - have to use the task manager. Shift is otherwise an excellent email package for handling multiple email accounts."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Brandon Skeete",
          "Nb_Reviews": 1,
          "Date": "2020-11-18T12:30:56.000Z",
          "Titre": "Great App! Excellent Workflow!",
          "Contenu": "The only reason I didn't give 5 stars is that I'd like to see more features! Shift is loaded with so many great workflow features there's just a few missing that I'd really like to see! the main one being Chromecast support within the shift browser tabs."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Chloe W",
          "Nb_Reviews": 1,
          "Date": "2020-11-18T20:20:12.000Z",
          "Titre": "Shift has been a fantastic tool for…",
          "Contenu": "Shift has been a fantastic tool for making areas of my work efficient!I have my work and personal emails all setup to access quickly and easily and I have separate work spaces setup for the different categories I manage as well as quick access to 2 other apps I use weekly. Everything I need is all in one place, I never have to open up new browser tabs, they all stay open in their relevant groups, it's amazing and such a time saver.The only concern I have is the email history in my sent emails doesn't go back very far and if my inbox gets too full, I have to clear some before I can view the older emails as this also seems to be limited."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Mat Davy",
          "Nb_Reviews": 1,
          "Date": "2020-11-20T16:57:37.000Z",
          "Titre": "Shift is adjectively awesome.",
          "Contenu": "Shift is an excellent tool for folks that have multiple entry points of communication it has helped me organize my life and save time immensely.Great if you have  multiple gmails and want to access them all quickly.As well as the internet. As someone with adhd this has helped me to be organized more efficiently.A few cons 1. I think it has become slower the more complex it becomes. The more i can do the slower it goes...2. It logs me out and resets and then I have to re-log into every account. Not sure if this is glitch in the matrix or if it is a feauture that doesn't existAll in all I would say the pro's faaaar out way the cons.Thanks for the work you do. I will continue to use shift and happy to pay for it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ms. Harris",
          "Nb_Reviews": 2,
          "Date": "2020-09-21T22:19:52.000Z",
          "Titre": "Shift Is A Productivity Booster",
          "Contenu": "I started using Shift because I was managing multiple social media, Google accounts, and project management account for myself and clients. I was tired of having to switch between browsers or use incognito windows and so on. I was wasting so much time.Shift allows me to seamlessly switch between multiple accounts on the same platform, this is exactly what I needed. I use it everyday and it's the first app I open. While it's a great tool some improvements would be that is a resource drain on my computer. There are times I have to close it. It can be glitchy, but there are improvements being made constantly. Customer support was immediately responsive, and followed up afterwards to make sure everything was working properly again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rob",
          "Nb_Reviews": 5,
          "Date": "2020-11-18T01:58:41.000Z",
          "Titre": "Very functional program that really…",
          "Contenu": "Very functional program that really condeses all your different app and emails in one area. I love it. The only thing I can say it that it sometimes lags in terms of speed switching between apps."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carolyn Chivetta",
          "Nb_Reviews": 1,
          "Date": "2020-11-18T02:09:09.000Z",
          "Titre": "I love the convenience of having all my…",
          "Contenu": "I love the convenience of having all my tabs together HOWEVER there are a few things that could be improved. - workspaces is still clunky and doesn't always load correctly- opening a link opens a tab, but only a tab in that application. the option of opening all tabs in one place or always opening new tabs in the default browser would be nice - in some applications (like gmail) - shift seems to cut off the bottom of the application - there are a ton of applications available (bravo!) but not alot of extensions. I'm in Sales and track with multiple tools. Being able to use those plugins are important and almost made me quit using Shift because the there wasn't a plugin available to track email opens. Overall, very happy and will probably re-up my premium subscription."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "jacob preciado",
          "Nb_Reviews": 2,
          "Date": "2020-11-18T01:20:34.000Z",
          "Titre": "World changer for a person like me with…",
          "Contenu": "World changer for a person like me with multiple inboxes, apps, and companies I do work for. Helps me keep on top of stuff much easier and see my whole day/workload at a glance."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kat",
          "Nb_Reviews": 2,
          "Date": "2020-11-18T01:11:26.000Z",
          "Titre": "Decent application for multiple email addresses",
          "Contenu": "EDIT: Review updated after receiving a quick response. It is a tad bothersome that no one responded to my previous contacts, but the minute I post a review, I get a response. At least they have helped me fix the things I needed, so thank you. Adding a star.ORIGINAL: While I like the ease of having all my emails together so that I can see them all at the same time, the company did me a little wrong. I bought the version where the \"Sent with Shift\" message was not supposed to show up on my emails, but it did and I had tons of people asking about Shift. I don't mind helping others out, but do not think it's ethical for a company to expect me to do advertising for them when I had already paid not to. I contacted Shift twice about this and never received a response. Besides that, I don't like how it opens up links in the app and not opening them up in my browser."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marc",
          "Nb_Reviews": 1,
          "Date": "2020-11-17T23:35:25.000Z",
          "Titre": "It's ok",
          "Contenu": "With every update you have to update your access to programs. Very frustrating because they update often. Customer service is clunky based on my experiences."
        },
        {
          "Note": 4,
          "Lieu": "AR",
          "Pseudo": "Walter Caballero",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T18:36:03.000Z",
          "Titre": "The platform is a bit heavy."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Till Pape",
          "Nb_Reviews": 3,
          "Date": "2023-01-30T12:25:37.000Z",
          "Titre": "It is doing what it should"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TheBlackSuperman",
          "Nb_Reviews": 1,
          "Date": "2021-05-06T23:51:19.000Z",
          "Titre": "Not too bad of an experience!",
          "Contenu": "If I could rate each aspect of this program this is how I would rate it:Customer service: 5 stars! Anytime I had answers for the Shift team, they never took more than a 5 hours (unless I submitted my response after office hours) after my response to answer it! Efficiency with navigating through 4 accounts: 3 stars. Although I loved the ability to navigate through my accounts throughout the free trial period, every time I tried to navigate from one account to the next, the amount of time it took seemed like countless minutes. It made me check my internet speed to see if I was the problem, but I had all 4 bars. Billing process after free trial period: 5 stars! This program will allow you to stay connected with them for as long as you want with a (free) Shift account. You are not billed anything after the free trial period, but it is completely up to you to upgrade to the advanced Shift account or to leave them altogether. I really admire this program and would highly recommend this application for anyone who uses multiple accounts on a daily basis! Thanks Shift!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bruce Etzcorn",
          "Nb_Reviews": 2,
          "Date": "2021-01-21T18:02:01.000Z",
          "Titre": "Their product is great and their support is great too...",
          "Contenu": "Their product is great and their support matches the product. Great job guys!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Simon Dove",
          "Nb_Reviews": 3,
          "Date": "2020-05-18T14:36:13.000Z",
          "Titre": "Good service",
          "Contenu": "Good service, can't complain."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Khaled Ben Said",
          "Nb_Reviews": 1,
          "Date": "2020-06-01T19:08:51.000Z",
          "Titre": "Great customer service"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Evert Wiesenekker",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T20:03:05.000Z",
          "Titre": "Great product",
          "Contenu": "Great product. Before Shift I sometimes got mad when logging into different systems. Shift does it automatically at keeps the sessions alive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adam",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T18:22:28.000Z",
          "Titre": "Quick, Efficient and Helpful",
          "Contenu": "I received a very quick response to my questions and my issue was resolved first time without having to go back and forth, which I really appreciated."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Giles Padmore",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T19:26:17.000Z",
          "Titre": "Just great",
          "Contenu": "I was dealt with promptly, courteously and efficiently"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Thomas",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T20:55:34.000Z",
          "Titre": "Wonderful solution and great support",
          "Contenu": "This solution makes life so much easier as a freelancer working for multiple companies at the same time. Works like a charm and is saving me a lot of time!Incredible customer support that goes the extra mile!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TK",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T17:31:34.000Z",
          "Titre": "Works great!  A stand-alone app for multiple email accounts",
          "Contenu": "Everything is great except that sometimes the printing of an email doesn't work.  It may be the fault of my computer because when I reboot, it starts working again.  But when printing is not working in shift, I can still go to mail.google.com and print from there.Otherwise it's a great product and a stand alone app, not buried in countless browser windows and tabs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tommy Linsley",
          "Nb_Reviews": 3,
          "Date": "2023-11-30T04:53:57.000Z",
          "Titre": "Great support, efficient and helpful.",
          "Contenu": "Shift makes life easier when having to log into several different accounts for business and personal online work.  Their support team is top-notch."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "M Kassinen",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T22:12:52.000Z",
          "Titre": "Great Follow up",
          "Contenu": "I appreciated that the team kept checking in to see if my issue had been fixed. It took a few tries, but we got there and I'm super happy about that!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Tom Marchant",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T16:55:48.000Z",
          "Titre": "Shift has been a blessing. Best thing i ever did.",
          "Contenu": "As a digital marketeer logging in and out of multiple Google accounts and over 15 pieces of software per day, Shift has been a blessing. Best thing i ever did."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tommy Linsley",
          "Nb_Reviews": 3,
          "Date": "2023-11-08T19:15:15.000Z",
          "Titre": "First-class support and TryShift is only software I know of that offers complete business-oriented (and agency-oriented) replacement for the inherent technical hurdles of internet browsers",
          "Contenu": "Shift support desk and reps are great!  They work quickly to provide help.  TryShift is the only software I know of that offers a complete business-oriented (and agency-oriented) replacement for the inherent technical hurdles of modern internet browsers when it comes to multi-login support.  Yes, there are still technical hurdles since, of course, Google et al do not want people straying away from their coveted ecosystem.  Due to this, Shift has it's difficulties (to be honest, I've experienced many technical glitches, but probably because my laptop is 13-years-old).  But, Shift is still the best thing available in their particular business browser category, so I have to give them 5-stars for effort and ingenuity."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-10-09T01:02:23.000Z",
          "Titre": "Save me LOADS of time!",
          "Contenu": "Shift helps me streamline my days by having all of my productivity apps in one place: email, calendar, CRM, Trello & social media. It helps me stay organised, and makes it really easy to navigate between everything that I need, rather than having to have lots of browser tabs open, saving me LOADS of time!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nick Krautter",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T18:06:08.000Z",
          "Titre": "Quick response",
          "Contenu": "Quick response. Agreed to credit my account without fighting over it. Awesome customer service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brittany Clark",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T20:39:34.000Z",
          "Titre": "responsive and eager to Resolve",
          "Contenu": "Shift is always responsive and eager to get the problem resolved."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher Hattery",
          "Nb_Reviews": 2,
          "Date": "2023-10-16T18:18:36.000Z",
          "Titre": "Multi-Account Management",
          "Contenu": "If you manage multiple Gmail/Docs/Drive accounts, Shift makes the process many times easier. I've been using it for about 3 years to be able to quickly move in and out of multiple gmail accounts used for multiple businesses."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T03:44:59.000Z",
          "Titre": "Thank You and Reccomendation",
          "Contenu": "You added the ability to add custom logos back! It may seem small, but it keeps me so much more organized. A potential new feature would be a way to integrate the calendars of your accounts. Like CalendarBridge."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Kevin Hayes",
          "Nb_Reviews": 10,
          "Date": "2023-08-11T22:13:52.000Z",
          "Titre": "🤩 Brings order to disorder - All my tools in one place - email, chat, social",
          "Contenu": "I am a guy who gets message across so many different platforms (slack, Monday.com, google chat, WhatsApp, Twitter, Messenger, the list goes on), and Shift makes organizing all my comms and saas products in one easy-to-manage tool. This has seriously been a stress reducer for me as I have one app to view 20+ different tools I use. It's a serious lifesaver."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gretta Goldstein // Program Ma",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T19:59:05.000Z",
          "Titre": "I couldn't do something as small as…",
          "Contenu": "I couldn't do something as small as bookmark a page, and we went back and forth probably 5 or 6 emails, and the Shift team was always very prompt and clear on what they needed from me. Honestly, I held off on contacting because I felt it wasn't worth the hassle, and I wish I'd reached out sooner. Very impressed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T17:28:56.000Z",
          "Titre": "Do Away with Multiple Browsers and Tabs",
          "Contenu": "Before shift I had three monitors with three different browsers- Chrome, Edge, and Firefox- open with 20+ tabs each. Finding things was next to impossible and the amount of memory that was taken up by all these open tabs was just insane. Shift and workspaces makes all of that unnecessary."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Austin Graham",
          "Nb_Reviews": 2,
          "Date": "2023-07-11T15:13:14.000Z",
          "Titre": "Great product.",
          "Contenu": "Great product that has eliminated many extra open programs on my desktop. Regular updates let you know the team is active and constantly improving the platform. I'm a contractor so I need to be checking multiple email inboxes constantly. I can just leave Shift open on one of my monitors and know that I will get notified any time I need to act on something without having to switch email logins every few minutes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jacob",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T18:35:36.000Z",
          "Titre": "Thorough help",
          "Contenu": "Melissa was thorough in tracking down the existing bug that I reported and providing potential solutions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wyatt R",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T22:31:38.000Z",
          "Titre": "What would I do without Shift?",
          "Contenu": "Since starting to use Shift, my work organization has been perfect! I run two small businesses, and manage for another, so having ALL my emails and docs available in once place is super helpful. There have been some small software issues in the past, but the Shift Team is SO FAST to fixing it. They're always available to answer questions, and they make it make sense. I tell everyone about Shift! Love it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Guzman Team Francesco at",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T01:23:01.000Z",
          "Titre": "Truly Understanding a Customer's Issue",
          "Contenu": "The representative understood my financial situation and was able to get me a full refund at a time where every penny counts. They put the customer and consumer first and they came through! i am so grateful. Very friendly and helpful since the first communication with them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marisa C.",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T06:43:40.000Z",
          "Titre": "Improves your focus and reduces overwhelm",
          "Contenu": "I love using Shift to manage and organize all my projects! The ability to segment workspaces helps with focus and productivity."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Ryan Schilling",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T17:45:38.000Z",
          "Titre": "The most important product change you…",
          "Contenu": "The most important product change you can make is figuring out a way to break out a new shift window.  I know it seems counterintuitive but when I have a client who uses goog meet/hangouts, I can't share the tab and view them like I would in zoom.  It's a real headache.  I have to open up chrome, log into the right gmail account and then share my deck on that window in chrome because I can't easily do it in Shift."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrea Ames",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T18:29:20.000Z",
          "Titre": "Excellent and very fast service",
          "Contenu": "Excellent and very fast serviceI had issues (known) with the tool, and the team reached out to me to let me know that the software update I'd been waiting for was ready -- very proactive.I updated and had another issue, and they VERY quickly got back to me to let me know how to fix the glitch caused by the update.I thought I would have to uninstall and reinstall Shift, but in less than 2 minutes, with the support instructions, I was back up and running."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Russell Hawkins",
          "Nb_Reviews": 1,
          "Date": "2022-06-15T01:03:57.000Z",
          "Titre": "I absolutely love Shift!",
          "Contenu": "I absolutely love Shift! I am a software developer and I am constantly switching between Gmail, Slack, Jira, Bitbucket, Discord, etc. as well as referencing multiple Chrome tabs and checking my calendar (plus I'm an avid Chrome Extension user) Shift lets me manage allllll of that in one app while keeping the experience lightweight and manageable.I honestly don't know how I was doing everything before Shift."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rai Cornell",
          "Nb_Reviews": 2,
          "Date": "2023-04-13T00:42:25.000Z",
          "Titre": "A Dream Come True for Agency Work!",
          "Contenu": "As a content marketing agency owner, I have a lot of email accounts that I log into for clients, a lot of roles to fill, and a lot of platforms that I have multiple usernames and passwords for. Shift allows me to stay logged into all of them at once and allows me to organize my browser based on the client project I'm working on. Shift has been a HUGE time- and stress-saver. I don't know how I managed without it before!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Osborne",
          "Nb_Reviews": 1,
          "Date": "2023-04-29T18:26:36.000Z",
          "Titre": "Shift has improved my workflow…",
          "Contenu": "Shift has improved my workflow significantly. It is no longer an inconvenience to have as many email accounts as I do for work. My productivity has improved and I don’t get lost in what I am doing trying to find things. Perfect application for anyone in IT that works for an MSP"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Chambers",
          "Nb_Reviews": 2,
          "Date": "2022-06-09T22:36:42.000Z",
          "Titre": "Ben was amazing!",
          "Contenu": "Ben was amazing! I had an obscure and specific issue with a third-party app causing a conflict with my two connected email accounts. Ben did a John Oliver level deep dive into my problem and wrote a well-researched and highly detailed 26-step workaround to my issue. I've never seen anything like it. Then he contacted me several times to follow up until my issue was fully resolved. Shift is a fantastic desktop platform that makes navigating my various apps and online accounts much more manageable. And Shift is lucky to have someone like Ben working for them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carson Price",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T11:14:03.000Z",
          "Titre": "best support for best product.",
          "Contenu": "Thank you so much for being patient with me and helping me get back into my account. I love this product and am so glad the support is just as great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Edward",
          "Nb_Reviews": 8,
          "Date": "2023-07-25T23:00:11.000Z",
          "Titre": "some issues with software but support has been stellar",
          "Contenu": "Have had several issues with the software recently and on both occassions support has been timely and very helpful to resolve the issues. The software has really been a lifesaver to the multiple accounts and apps I use and has made the madness into a very convenient way to manage all my accounts in one place. Well done and highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Williams",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T20:22:52.000Z",
          "Titre": "Shift has undeniably changed my life…",
          "Contenu": "Shift has undeniably changed my life and I didn't think it was possible to tame my ADHD brain, but it has done it. Google is such a pain when managing multiple accounts, and of the 140+ accounts in my organization, I access a dozen of them on a consistent basis. The four or five accounts that I find I need to keep open perpetually, I have right at my fingertips with Shift Workspaces. I also love, in regards to Workspaces, how easy it is to keep my browsing compartments separated. As an IT Manager, anything related to my job managing the security and operations of technology goes in my IT email workspace. My personal work email, I can keep browser tabs open that are my individualized and my personal Gmail account has browser tabs for recipes to suggest to my wife, and birthday party planning for my kids, etc...As if that wasn't enough, the apps within each (or some/all workspaces) that you can add are tailored to your specific workspaces and also right at your fingertips. But no need to clutter that up by also having your Gmail, Google Calendar, Drive, etc apps there as well. There's a dedicated, dynamically changing set of icons at the top right of your app to hop right into your Google Workspace apps without taking up unnecessary space elsewhere.Seriously, Shift has done the impossible. I only regret that I didn't find out about/adopt it sooner. If you don't get this app, my heart goes out to you."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Hursh Dodhia Shah",
          "Nb_Reviews": 2,
          "Date": "2022-07-18T03:56:44.000Z",
          "Titre": "Can't live without shift!",
          "Contenu": "Our agency team cannot live without Shift and their consistent upgrades to the user experience of using it is fantastic. I literally cannot imagine life without it and neither can the team. Their support team is on point as well, always happy to help and make life easier. The only thing is that they should make all invoices accessible via your dashboard so you don't have to email them to get an invoice, but aside from that, these guys are perfect!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lowcountry Paper Co.",
          "Nb_Reviews": 3,
          "Date": "2022-10-16T21:23:58.000Z",
          "Titre": "LOVE Shift!!",
          "Contenu": "LOVE Shift!!! I absolutely can't stand having a million tabs open but I definitely have the need for easy access to all of my email accounts and apps for regular business activities, so Shift has been an absolute game changer in my productivity. Having everything all in one place make my life so much easier. Thank you Shift Team for an amazing product!!!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Gavin Brightman",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T11:45:09.000Z",
          "Titre": "Essential app, just brilliant",
          "Contenu": "I've been using this app for over a year now and it is hands down the best investment I have made for my workflow. For a self confessed Tab wh*re like me, it is an essential tool that helps keep me organised and handles anything I throw at it. Just brilliant!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Taylor",
          "Nb_Reviews": 2,
          "Date": "2023-09-28T02:52:48.000Z",
          "Titre": "Excellent team of people",
          "Contenu": "Excellent team of people who offered me assistance with my billing/payment issue. I never had to repeat myself and three separate people helped me fluidly."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Robyn Henke",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T02:16:04.000Z",
          "Titre": "I absolutely love this tool",
          "Contenu": "I absolutely love this tool for managing multiple clients! I am juggling so many tools, passwords, bookmarks, emails on a given day, and the typical browser just couldn’t handle it."
        },
        {
          "Note": 5,
          "Lieu": "IS",
          "Pseudo": "Doddi",
          "Nb_Reviews": 4,
          "Date": "2023-01-20T12:15:15.000Z",
          "Titre": "In general... it's about convenience!!",
          "Contenu": "The convenience factor is of course a huge huge thing for me, and also the fact that the team at tryshift.com seems to answer my questions pretty fast :-) Everything about Shift is great and even though I sometimes ask myself: should I save money this year and skip Shift? I always end up answering \"no\", because the convenience factor is just so huge! :-)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cassandra Haavisto",
          "Nb_Reviews": 2,
          "Date": "2023-07-19T22:12:46.000Z",
          "Titre": "I LOVE Shift",
          "Contenu": "I LOVE Shift.  Fantastic user experience. Sometimes I have time to dig and dig for an answer.  Sometimes I need to cross it off my list for the moment since I will have pressing tasks.  I need to ask and move on to get to the item waiting for me.  I KNOW I'll get an answer 'soon.'I have been able to share with others I refer that \"Shift has awesome support, too!\"  My web person appreciated my referencing that.  With their workload, that's important.  I believe they even enroll/signed up!  We are both really enjoying the entire experience.  I have a few more questions about items I'm not sure working with, but I was fully operational in a short time, and continue to function just fine---but I'm attempting to tighten my experience. I have done very little research on my own (tutorials) to get to this point in two weeks time.I have also suggested a staff member utilize Shift.  LOVING it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Doug Felteau",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T18:02:36.000Z",
          "Titre": "Don't need support often, but when you do it's great!",
          "Contenu": "First time I've needed to use support in about 1.5 years and the process was as simple as sending an email and support was engaged until the problem was solved.  I needed to change my main email address and once I had done one or two steps on my side, support completed the process within hours."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tomio Denver-Nagano",
          "Nb_Reviews": 2,
          "Date": "2022-04-01T19:39:45.000Z",
          "Titre": "I absolutely love Shift",
          "Contenu": "I absolutely love Shift. It's a bit pricey for the premium version, but it was exactly what I needed for work and well worth the price. My only quibble is that, because it can only run web-based apps, it cannot integrate the full features of email clients. Which for me means that I continue to use an email client in a separate window. But it's fantastic to have all social media, Gmail, Todoist, and project management apps all in the same window. And as best I can tell, its RAM usage is lower than if I had all those same apps open in Chrome."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wyatt Rutt",
          "Nb_Reviews": 1,
          "Date": "2022-07-22T18:59:51.000Z",
          "Titre": "Shift is a great tool backed by a…",
          "Contenu": "Shift is a great tool backed by a greater team! They have always been so quick to respond when I have questions or need help. I am a small business owner and freelancer so having quick access to all my emails, G Drives, and calendars is so helpful!When my accounts were bugging out, Joren was able to help me reset my Shift app and get back to work in a couple of hours!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Evan Knutson",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T23:29:16.000Z",
          "Titre": "Worked with a team member to cancel and…",
          "Contenu": "Worked with a team member to cancel and refund my service because I wasn't using it to it's fullest potential. They were able to direct me to the right place and solving it was easy. I told them I'd gladly recommend Shift to other people as I have members of my team that love the workflow."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Kevin Hayes",
          "Nb_Reviews": 10,
          "Date": "2022-05-09T16:22:09.000Z",
          "Titre": "Great product and stellar customer support.",
          "Contenu": "If any of you are SaaS junkies like me, know that Shift is one of maybe 3 apps I pay for annually as opposed to month to month. That's how committed I am to Shift. As a guy who has a lot of communication apps and a lot of email addresses, comms management is difficult for me if I don't have organization. Shift brings order to my disorder. Order and structure is really important if I am to achieve all my goals. Love the app.Also, customer service is top-shelf."
        },
        {
          "Note": 5,
          "Lieu": "TH",
          "Pseudo": "Jeff Flynn",
          "Nb_Reviews": 2,
          "Date": "2022-08-30T10:06:55.000Z",
          "Titre": "The product works well",
          "Contenu": "The product works well.  The latest release seems to have also reduced the amount of memory consumed, especially when I have idle mail accounts opened (I have 11 that I need for work).  My favorite aspect however has been the excellent customer support experiences."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Caleb Saunders",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T00:58:18.000Z",
          "Titre": "The response was quick and easy to…",
          "Contenu": "The response was quick and easy to follow as well as fixed the problem that I was having."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jack",
          "Nb_Reviews": 3,
          "Date": "2023-03-23T20:22:35.000Z",
          "Titre": "Quick resolution to my issue.",
          "Contenu": "My ticket was responded to quickly and with some great advice for solving my issues.  While my issue was not completely resolved immediately, support stayed engaged with me until we had it resolved.  It was awesome that it was handled so quickly and completely."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Admin Support for Growing Busi",
          "Nb_Reviews": 2,
          "Date": "2022-05-10T17:44:07.000Z",
          "Titre": "I use Shift every day for work",
          "Contenu": "I use Shift every day for work. It helps me access different apps all at the same time without having to open a new tab and log in every time. I can see notifications quickly, and navigate task flows without much effort. I recommend this to my other co-workers who do similar work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "June",
          "Nb_Reviews": 2,
          "Date": "2023-10-14T17:28:47.000Z",
          "Titre": "Problem Solved Quickly",
          "Contenu": "They were quick to respond to my issue and, within a few hours, had solved the problem. Excellent communication via emails and extremely helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erik Berglund",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T19:57:42.000Z",
          "Titre": "This tool is extremely helpful for me",
          "Contenu": "This tool is extremely helpful for me. I run 3 businesses and have a personal email - It's awesome to have it all in one screen. The addition of calendars + gdrive is amazing. Thanks for making it so helpful!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Tim Phillipps",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T07:05:56.000Z",
          "Titre": "The TryShift team are super responsive…",
          "Contenu": "The TryShift team are super responsive and responded back to me back quickly with clarification and suggestions.  In my recent case, their suggestion simply and immediately fixed an issue created by another piece of software on my system.   (long before I got any response from the other vendor who failed dismally)"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Nahuel Montera Vena",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T23:23:56.000Z",
          "Titre": "The technical support has been impeccable",
          "Contenu": "The technical support has been impeccable; they took very little time to respond and have efficiently and clearly solved all the problems that have arisen for me. Very satisfied with the assistance received."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Krista",
          "Nb_Reviews": 5,
          "Date": "2022-09-28T13:59:58.000Z",
          "Titre": "Beyond happy with SHIFT",
          "Contenu": "Beyond happy with SHIFT. Truly the answer to my prayers. With 7+ emails that I'm having to monitor between (gmail + outlook) I am now able to view them all in one browser versus the multiple tabs I'd have open 24/7. As well! I can have ALL my apps in there too; quickbooks, google drive, trello, clockify, Instagram, Facebook, Pinterest, Teams, Slack, etc… etc… It's truly a game changer for anyone with multiple apps and emails that want organization. My soul is calmer now. And the transitions between all is perfection. Worth every single penny. I no longer need Firefox or Safari. Shift has everything."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "amd",
          "Nb_Reviews": 2,
          "Date": "2023-09-15T19:32:26.000Z",
          "Titre": "Quick Support",
          "Contenu": "Shift is always extremely helpful when I need to adjust something. I love the product and it's nice when support is just as strong as the offerings! :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aminat",
          "Nb_Reviews": 2,
          "Date": "2022-11-24T04:18:46.000Z",
          "Titre": "A great tool",
          "Contenu": "Shift was recommended to me almost 3 years ago when I posted on FB about wishing for a service that could aggregate all of emails and various applications. It has been a godsend since. Being able to have one “application” and see all of my email accounts (personal, work, and business)  as well as all of the other apps I use (Quickbooks, slack, FB, WhatsApp, etc) in one place has been great. And their customer service has very responsive."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Richard Andrew",
          "Nb_Reviews": 5,
          "Date": "2022-10-18T10:47:44.000Z",
          "Titre": "I couldn't function without Shift",
          "Contenu": "Been using Shift for a couple of years now. It's one of those workflow efficiency tools that doesn't seem like a big deal until you fully embrace its functionality. I have no idea how I functioned without it. Thanks team."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-21T16:21:09.000Z",
          "Titre": "Consultants Dream",
          "Contenu": "I work at a large consulting firm and often need to have access to multiple iterations of Microsoft Teams open at the same time; this tool is the only way to make that happen seamlessly and ensure that I am accessible. I find Shift so helpful, I pay for it out of pocket."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rebekah Radice",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T16:03:38.000Z",
          "Titre": "Highly impressed",
          "Contenu": "Theodore was quick to respond, attentive, friendly, and provided a solution in a very short amount of time. Highly impressed with the level of interest and empathy in each of his interactions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Al Sejcek",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T01:02:18.000Z",
          "Titre": "Awesome for multiple email accounts",
          "Contenu": "Great product that allows me to manage 7 gmail accounts and one Outlook account.  Wish I could see a consolidated calendar view, but between this program and iCal I am all set."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MK",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T17:57:16.000Z",
          "Titre": "Essential tool to manage multiple accounts",
          "Contenu": "When multiple accounts are in a platform (Gmail, Slack, etc), it is cumbersome to switch them. Shift made it super-easy and it saved much time. The list of platforms are expanding and evolving. Once you get used to Shift, you will not live without it. Try Shift and increase your productivity!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robb Murray",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T17:52:14.000Z",
          "Titre": "I have been using Shift for a few years…",
          "Contenu": "I have been using Shift for a few years now and love how organized it keeps my business separated from my personal tech. Keep up the good work!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 4,
          "Date": "2023-10-18T21:25:50.000Z",
          "Titre": "exceptional service",
          "Contenu": "The customer service person I was working with at shift was incredibly understanding and helpful. They made sure that all of my needs were met in my consideration to not use the product, and we're understanding for specific reasons why."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brittany",
          "Nb_Reviews": 2,
          "Date": "2023-08-24T21:06:09.000Z",
          "Titre": "Very responsive and Took Accountability",
          "Contenu": "Shift Support was very responsive and thoroughly explained the step by step process of what they needed from me. The issue ended up resolving itself, but they were eager to help, knowledgeable in their process, and willing to take accountability.The experience was very unproblematic and I appreciate Shift."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Natalina Medici",
          "Nb_Reviews": 2,
          "Date": "2023-05-24T18:51:08.000Z",
          "Titre": "Shift is an extremely useful product…",
          "Contenu": "Shift is an extremely useful product for me as I usually work on several different Google profiles at a time. When I reached out to support, they responded very quickly and helped me immediately. The customer support is fantastic!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kasie Sly",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T18:28:00.000Z",
          "Titre": "Shift Closing as soon as it opened- Resolved",
          "Contenu": "I had an issue with Shift closing as soon as it opened.  I logged a ticket and within a few hours they had a fix for me!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-09-28T15:28:32.000Z",
          "Titre": "To date I love using shift as it gives…",
          "Contenu": "To date I love using shift as it gives me the flexibility of keeping all of my clients emails, apps and software in one central place and keeps me focused.All I need back is the option of workspace, that I miss."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rob",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T00:15:01.000Z",
          "Titre": "Great software even BETTER people",
          "Contenu": "great software but even better people in the support team. i had an issue that i couldn't find the answer to online so i requested direct support and they sent a zoom link and we fixed the issue :) amazing people and very knowledgeable!!!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Inquiring_Mind",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T12:57:08.000Z",
          "Titre": "Fantastic tool",
          "Contenu": "I've been using Shift for around 3 years now and it's an indispensable tool for my workflows, both work and personal. I live in Shift essentially 😂Customer service is quick and on the ball."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Oscar",
          "Nb_Reviews": 2,
          "Date": "2023-03-07T12:44:43.000Z",
          "Titre": "A great email organiser",
          "Contenu": "Shift has done very well in providing this platform. It is very helpful in keeping all of my organising and emailing in 1 mainframe and allows me to be more efficient with all my work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephanie Gamble",
          "Nb_Reviews": 2,
          "Date": "2022-02-13T17:09:53.000Z",
          "Titre": "Shift has been a game changer!",
          "Contenu": "Shift has numerous benefits and has been an amazing resource in my professional and personal life. The simplicity of having multiple accounts along with the essential apps I use daily located within one source saves me so much time and adds so much value. I can move efficiently between my multiple business accounts and personal accounts without missing a beat. I am empowered to focus on specific tasks when needed with one click limiting the number of distractions. Shift also helps me to be a resource in meetings, keeping me organized to gather valuable data on the fly. Shift has been a game changer for me and I would highly recommend it to anyone looking to make their virtual life easier and more organized."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Jordan Hall",
          "Nb_Reviews": 2,
          "Date": "2022-04-08T08:07:11.000Z",
          "Titre": "Shift has been a gamechanger for…",
          "Contenu": "Shift has been a gamechanger for productivity and keeping things in a uniform order. It's great to have workspaces that can combine apps into one place for a given context (e.g. work, side hustle etc). The speed of loading apps is fantastic and I love how it manages to keep all your apps open in RAM. On a machine with decent memory, it never seems to struggle or have to boot off old apps. It just works greatly and I'm more than happy to pay for such a powerful tool. The time savings you receive from using Shift is well worth the price!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patrick Carver",
          "Nb_Reviews": 2,
          "Date": "2023-05-02T00:02:14.000Z",
          "Titre": "Although I ultimately stopped using…",
          "Contenu": "Although I ultimately stopped using Shift, I had a great experience. It wasn't an issue with the tool, just a change in our strategy and no longer needed it. The staff was great when I encountered an issue. Will use again when the need strikes."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Gus White",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T22:29:42.000Z",
          "Titre": "Excellent experience",
          "Contenu": "It was an excellent experience and the team was a very helpful resolving all my log in issues"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Reyno Davis",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T19:58:38.000Z",
          "Titre": "Helpful and prompt response",
          "Contenu": "The team was helpful with ticket request! Also loved the friendly reminder email to complete steps for the ticket, as I forgot about it and was able to accomplish the steps as a result of getting the reminder email! Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2022-10-26T10:13:16.000Z",
          "Titre": "Shift has been a game changer for me in…",
          "Contenu": "Shift has been a game changer for me in making me more efficient with my day to day.  Having all my accounts (3 businesses and personal accounts) all in one place is super helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Wilson",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T21:11:26.000Z",
          "Titre": "Wrong Primary Email Address",
          "Contenu": "I used the wrong email address to set up my Shift account.  I contacted support, who helped me switch the account with no problems. Great job!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tammy Rae",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T21:35:57.000Z",
          "Titre": "Friendly staff and great customer…",
          "Contenu": "Friendly staff and great customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-01T11:18:18.000Z",
          "Titre": "I’ve been using shift for a year",
          "Contenu": "I’ve been using shift for a year. I almost didn’t realize how helpful it was until my teammate was struggling with multiple logins. I’m going to set her up with shift too"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Soleiman Bolour",
          "Nb_Reviews": 3,
          "Date": "2023-02-16T10:40:17.000Z",
          "Titre": "This is the best software ever…",
          "Contenu": "This is the best software every business owner should have. I have been using Shift now for over 3 years and I can't do without it. It saves me time and money for sure. I don't have to keep going to different browsers to find what I am looking for. All the main software's I use are in Shift for easy access. If you are a business owner and have several emails or softwares you need to get to, you need Shift."
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Raine",
          "Nb_Reviews": 1,
          "Date": "2022-05-19T15:30:17.000Z",
          "Titre": "My company changed my email from \"com\"…",
          "Contenu": "My company changed my email from \"com\" to \"io\". I have a team of 15 VAs under my account so it means by changing my email will loose all the access. Emailed Support and Joren was so helpful and patient, help me out the whole process and gave me back  full access to my team in less 24 hours. Imagine loosing that access would be a nightmare. Thanks Joren and to Kassy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michelle McCauley",
          "Nb_Reviews": 1,
          "Date": "2022-03-18T19:16:02.000Z",
          "Titre": "Oh so tidy",
          "Contenu": "I really like the ability to compartmentalize everything. Love having multiple workspaces. Although I'm still learning my way around the platform, I think this is the beginning of a lifelong relationship ❤"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Mitch W",
          "Nb_Reviews": 1,
          "Date": "2022-11-01T01:36:10.000Z",
          "Titre": "Super helpful productivity tool",
          "Contenu": "Shift helps with productive management of multiple email inboxes, communication tools and apps in a single platform.This removes the need to many many browser tabs/windows and helps improve laptop performance."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Logan Speights",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T18:13:36.000Z",
          "Titre": "Fast Simple Solution",
          "Contenu": "I had an issue that was bugging me for weeks, the support team gave me the fix for it quickly and simply allowing me to get back to work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cameron Strittmatter",
          "Nb_Reviews": 1,
          "Date": "2023-02-11T20:40:58.000Z",
          "Titre": "the chatbot was fantastically useful--…",
          "Contenu": "the chatbot was fantastically useful-- it quickly narrowed down my problem, provided instructions, and connected me with a solution.Two days earlier I went down the same route and got a less useful answer-- a similar solution, but one that involved me finding the address for and contacting support myself.  I was very impressed when, after gritting my teeth to implement the solution, the bot had been updated to solve the problem and contact support on my behalf."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mellis",
          "Nb_Reviews": 2,
          "Date": "2023-06-29T14:25:00.000Z",
          "Titre": "Great system",
          "Contenu": "Great system. Works flawless. Has no problem blends with sellers do far myself do can't comment on refunds."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Hursh Dodhia Shah",
          "Nb_Reviews": 2,
          "Date": "2022-10-12T05:10:07.000Z",
          "Titre": "Great software and great support…",
          "Contenu": "Great software and great support always, definitely could NOT imagine my life without Shift now. Their support team is always helpful!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "CURTIS SAMA",
          "Nb_Reviews": 7,
          "Date": "2023-09-26T23:53:44.000Z",
          "Titre": "I resolved my issue within 15 minutes…",
          "Contenu": "I resolved my issue within 15 minutes after a service representative got back to me. Thanks for the efficiency!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Don Burks",
          "Nb_Reviews": 1,
          "Date": "2023-03-05T01:38:43.000Z",
          "Titre": "Genuine, real customer service",
          "Contenu": "Quick answer, told me exactly what I needed to know. And they were personable, friendly, they demonstrated that they had actually read my email."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kyber Digital - Jay Miller",
          "Nb_Reviews": 4,
          "Date": "2022-03-11T14:33:26.000Z",
          "Titre": "Tabs on the left vs tabs in a browser",
          "Contenu": "Well I like about shift is the fact that you can have apps that you would otherwise not be able to have such as WhatsApp on your computer which really allows for a more productive workflow"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Hanna Taylor",
          "Nb_Reviews": 2,
          "Date": "2023-02-05T08:01:46.000Z",
          "Titre": "I was replied to very quickly and…",
          "Contenu": "I was replied to very quickly and offered the student discount which I really appreciate as this helps work Shift into my budget."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T21:21:28.000Z",
          "Titre": "Perfect A+",
          "Contenu": "Changing my Primary Email address could have been a nightmare, but it all worked effortlessly and flawlessly."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Emily Armstrong",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T21:49:45.000Z",
          "Titre": "Quick resolution to a simple problem",
          "Contenu": "Quick resolution to a simple problem - we reduced the number of users on our team and got a full refund for the unused seats."
        },
        {
          "Note": 5,
          "Lieu": "MD",
          "Pseudo": "Silvia Grant",
          "Nb_Reviews": 1,
          "Date": "2023-04-30T20:17:48.000Z",
          "Titre": "A great tool",
          "Contenu": "A great tool that helps me manage efficiently my daily workload in different professional areas. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kyle Wilkinson",
          "Nb_Reviews": 2,
          "Date": "2023-04-20T15:28:10.000Z",
          "Titre": "Finally! A human instead of a bot!",
          "Contenu": "I had an issue with my account that was mostly my fault and instead of getting a chatbot I got a person that was able to email back and forth with me until the issue was resolved."
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Marcin Duma",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T21:10:14.000Z",
          "Titre": "Great app to work on MacOS and Windows",
          "Contenu": "Great app to work on MacOS and Windows. Simple and fast app to work with web apps and many different Google, Microsoft accounts"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Victor",
          "Nb_Reviews": 3,
          "Date": "2023-12-11T16:29:05.000Z",
          "Titre": "Super quick turnaround response",
          "Contenu": "Super quick turnaround response, addressed my issue immediately."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Theresa Trageser Hernandez",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T20:32:26.000Z",
          "Titre": "I turned out I didn't actually need…",
          "Contenu": "I turned out I didn't actually need support, but they still got back to me quickly!"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Angelo Victoria",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T17:56:12.000Z",
          "Titre": "Keeps your browser looking clean and organized",
          "Contenu": "It does help with lining up all facebook accounts at one browser and it keeps the desktop not messy!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Jamie",
          "Nb_Reviews": 1,
          "Date": "2022-09-15T13:07:19.000Z",
          "Titre": "Worth it",
          "Contenu": "A great tool, worthy of the cost to streamline work and help keep your head clear (in normally a multi-window environment chaos)."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "K_Stuffler",
          "Nb_Reviews": 3,
          "Date": "2022-03-03T16:45:28.000Z",
          "Titre": "This is the most fantastic app ever",
          "Contenu": "This is the most fantastic app ever! It helps me multiply my productivity 1000%.  With the click of the mouse I have instant access to emails, tools, websites.  I just love Shift!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Albert Raney",
          "Nb_Reviews": 1,
          "Date": "2023-02-09T00:11:44.000Z",
          "Titre": "Response was prompt and it was clear…",
          "Contenu": "Response was prompt and it was clear they had actually read the detail I provided on what my issue was. They were thorough and helpful."
        }
      ]
    }
  ]
}