{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "twowayradiogear.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ben janke",
          "Nb_Reviews": 3,
          "Date": "2023-12-07T22:14:40.000Z",
          "Titre": "you have products on your website you…",
          "Contenu": "you have products on your website you dont have !!!!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "C. Delvas",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T01:24:30.000Z",
          "Titre": "My order is stuck on \"Order Placed.\" TWR customer service is unresponsive.",
          "Contenu": "I placed the order for my radios on July 19, 2023. We are eight days later, and the status of my order is still \"Order Placed.\"I messaged their customer service about it, and the answer was that my order should ship soon and I should wait.I hope this can be resolved shortly. Otherwise, I would have to cancel my order."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Victor Mejia",
          "Nb_Reviews": 1,
          "Date": "2021-09-30T15:55:36.000Z",
          "Titre": "Is simple my radios got lost and now…",
          "Contenu": "Is simple my radios got lost and now they are not even answering my phone calls to see when I will get them sent again or to find out who drop the ball if UPS or them. They already took the money from my account so I don't have my equipment but already paying for service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Olatunde Lawrence",
          "Nb_Reviews": 3,
          "Date": "2021-06-04T13:16:22.000Z",
          "Titre": "Terrible experience",
          "Contenu": "Terrible experience. This people isn’t worth doing business with.  What you order isn’t what you get. I ordered just a simple single Radio and yet, you couldn’t get what you paid for. It’s frustrating. There website shows certain items, but it’s not what their actually are… ‘You cannot transact business with this company. I had to pay return shipping from my pocket. This isn’t OK at all."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tulio Panesso",
          "Nb_Reviews": 1,
          "Date": "2022-06-03T18:23:08.000Z",
          "Titre": "The shipping of 1 item is ridiculous",
          "Contenu": "The shipping of 1 item cost allocated the same amount as the item. I should’ve taken more time searching the item in other sites."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Gordon",
          "Nb_Reviews": 1,
          "Date": "2022-10-30T01:07:44.000Z",
          "Titre": "Volume is too low.batteries don’t last…",
          "Contenu": "Volume is too low.batteries don’t last very long"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "markhwhite",
          "Nb_Reviews": 1,
          "Date": "2019-04-26T00:12:22.000Z",
          "Titre": "sent by UPS",
          "Contenu": "sent by UPS, the most expensive way possible.  cost CAD31.45.  could have been sent by Canada Post letter mail for for CAD5.35.  this for an item that only cost CAD40.00.  when questioned, they didn't care.  if you want it this is how we ship.  i don't like being ripped of on shipping because the seller doesn't care.  not a company i would do business with in the future."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thank",
          "Nb_Reviews": 1,
          "Date": "2016-09-15T17:58:51.000Z",
          "Titre": "Two Defective products",
          "Contenu": "I bought twelve 2 way radios model CLS 1110 and two of them the battery came defective.  Two Way Radio Gear send me to call Motorola Warranty department instead of resolving the issue directly.  I had to pay the shipping to get the batteries replaced.  Very poor customer service."
        },
        {
          "Note": 1,
          "Lieu": "BR",
          "Pseudo": "Felipe",
          "Nb_Reviews": 2,
          "Date": "2019-08-08T21:13:41.000Z",
          "Titre": "Freight with wrong information",
          "Contenu": "I bought the following products:1 CAT Active Urban Hybrid Carry Case $ 39.991 CAT Active Urban Rugged Earphones $ 59.99Total: 99.98Freight payment was $ 9.30, considering the products should be in Canada, according to Two Way Radio Gear at the time of purchase.Upon purchase, I was informed that the product would be shipped from the US and that an additional $ 25.89 of freight would be charged. And I paid that amount without problems.And today UPS charged over $ 61.82 in fees.That is, I bought a product that was supposed to be $ 109.28 (Products + Shipping) and became $ 196.99.Again, at the time of purchase the freight was calculated from Canada to Canada."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Fernando",
          "Nb_Reviews": 1,
          "Date": "2019-01-06T15:26:51.000Z",
          "Titre": "This web site is a scam!!!",
          "Contenu": "This web site is a scam!!!They will take yuor money and never sent the product you bought.I placed my order on nov. 20th 2018,right after the firs lie, that this was a special order and need two weeks to get delivered( they never say that when I placed my order)Three week after that, nothing,after sending few e-mails, the second lie, the product is been delivered to our wherehouse and we will send it to you as soon as we get it!!By junuary 4 2019 nothing yet, they send me a receip of the purchase , I e-mail them again to see what that hell with the product and they told me it was sended decem31th at 7:00 pm. They gave me a old trucking number that looks like scam too.These people are thieves, stay away!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robyn",
          "Nb_Reviews": 3,
          "Date": "2021-02-25T19:55:51.000Z",
          "Titre": "Horrible customer service",
          "Contenu": "We purchased two Motorola radios for our self storage property about 2 years go from Two Way Radio Gear.  About two months ago one radio had an issue with the communicate button on the side and stopped working.  We reached to Two Way Radio Gear several times and Joe did not return calls. We finally spoke with Joe and went over warranty coverage and sent the pictures he requested.  We waited weeks and did not hear back from Joe regarding next steps.  We called today and asked for a supervisor and were directed to Erin who said she was a customer service supervisor.  She apologized and promised to mail us a new radio today when she had a tracking number that ours was being returned to them.  We were waiting for the tracking email and Erin called back and said she could not do that now.  We had to pay and go through Motorola.  This company has horrible customer service, no follow up on warranty calls and then promises something they cannot do.  Our 17 facilities will find a new company to purchase our radios."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Michelle",
          "Nb_Reviews": 1,
          "Date": "2020-06-17T22:47:44.000Z",
          "Titre": "There's Also A Canadian Website!!",
          "Contenu": "We are located in Canada and ordered from the US website. As per the website, we were advised shipping to Canada had a charge. After placing the order, someone called us to say that shipping was an additional $30.00.We then get a call from UPS that our package is at the border and requires an additional $90 in brokerage fees. In calling back to complain about this, I come to find out they have a Canadian website...1) If you have a customer telling you it's being shipped from the US to a Canadian address, why don't you ask if they're aware of the Canadian website?2) Nowhere on their website does it mention that they have a Canadian website... this information would be helpful for this exact scenario.3) While I understand that anything travelling from the US to Canada has to go through customs, this company need to make it very clear that either a) Brokerage is included in the cost of their shipping or b) Additional brokerage fees will apply.Their website and customer service lacks basic information to best serve the customer. We will not be ordering from them again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "NC State College of Engineering",
          "Nb_Reviews": 1,
          "Date": "2020-03-05T14:05:37.000Z",
          "Titre": "Product not working properly",
          "Contenu": "Product not working properly.  Sales rep promised to email us with his contact info.  We never received the email."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2019-07-29T14:20:06.000Z",
          "Titre": "Was promised a Motorola Rebate",
          "Contenu": "Was promised a Motorola Rebate, but Motorola won't process it.  Waste of my time and money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Harvey",
          "Nb_Reviews": 1,
          "Date": "2018-08-24T23:37:16.000Z",
          "Titre": "Radio's good, service not so much.",
          "Contenu": "Radios seem to be good quality.  When I talked with the rep, I specifically said I needed to access channels one and two for each specific school site. I was told that they were being programmed. When I received the radios they had bleed over from another set of radios in the area due to these channels being \"generic Motorola\" channels. I was told to use a higher channel (like channels 8 and 9).  This does not lend itself to ease of use and not acceptable in my mind given what I paid for the two way radios with programming. I was given two options 1) send the radios back so they can be programmed or 2) send me a cable so I can program each of the 17 radios I purchased to which I would be charged $35 if I did not return the cable.  Seriously?  What is my time worth?  What will it cost for me to have my tech guy come in and do this billing me for his time alone?  The radios seem fine and of good quality. Not sure about the customer service nor \"programming\" that came as part of the package. Two way radios that come with generic channels that have bleed over, nor get the weather channel do not seem like they have been programmed. And, NO, I am not boxing them up to send them back. If they are going to charge me for a $35, I can only imagine who will pay the shipping for sending them all back?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bernerd",
          "Nb_Reviews": 1,
          "Date": "2015-01-06T22:29:30.000Z",
          "Titre": "Disapointed with order.",
          "Contenu": "Not happy. my name is Bernard not vernarnd. I was not pleased with the recent order."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gary",
          "Nb_Reviews": 4,
          "Date": "2017-02-15T17:23:01.000Z",
          "Titre": "Great Experience",
          "Contenu": "Great customer service skills."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Blake",
          "Nb_Reviews": 1,
          "Date": "2018-09-19T02:45:27.000Z",
          "Titre": "Couldn’t program radio"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 2,
          "Date": "2023-02-09T00:43:22.000Z",
          "Titre": "Please share shipping/tracking information.",
          "Contenu": "It’d be nice if you shared status updates/shipping/tracking information. I’m not sure if you’ve shipped the order. Or if the product is back ordered."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ted Cosgrove",
          "Nb_Reviews": 1,
          "Date": "2023-01-19T04:45:30.000Z",
          "Titre": "Extremely quiet volume",
          "Contenu": "Good shipping, nice product, unfortunately the volume is WAY TOO QUIET, and it is unusable unless in a dead quiet environment"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "From Hawaii",
          "Nb_Reviews": 1,
          "Date": "2014-11-10T15:56:59.000Z",
          "Titre": "Harder to operate than I thought",
          "Contenu": "We used to use Motorola radios in the 90s and it was simple.  Select channel based on the repeater and it works.  The vertex EVX539s have so much buttons that if inadvertently pressed, you are not on the same channel and won't know it for a while.  The 2 buttons below the push to talk button can change your channel.  I would like to have my techs use them but I can see it will take some time for them to work them properly.  I should have went with the cheapest not the top of the line."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Corey",
          "Nb_Reviews": 1,
          "Date": "2019-09-26T22:02:09.000Z",
          "Titre": "order arrived C.O.D. after paying extra.",
          "Contenu": "Was contacted to pay additional shipping after order was placed, gave them what they requested. When order arrived it was c.o.d, had to pay an additional $37 to receive it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Diana",
          "Nb_Reviews": 6,
          "Date": "2019-03-14T00:01:34.000Z",
          "Titre": "Quick and professional service",
          "Contenu": "Quick and professional service for new products as well as questions about previously purchased items. The 2 way radios have made running my business so much more efficient."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Xavier Mesko",
          "Nb_Reviews": 1,
          "Date": "2023-04-09T23:05:43.000Z",
          "Titre": "Well it's good I won't lie on that but…",
          "Contenu": "Well it's good I won't lie on that but I can't tell oh long the battery life is because I'll charge it over night then halfway through my shift it just stops working even though it looks like it still has power when I contact my dispatch it's a dead mic as soon as I remove it from my walkie my dispatch hears me instantly"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "William Bogdala",
          "Nb_Reviews": 1,
          "Date": "2022-09-02T20:04:53.000Z",
          "Titre": "Tlk 100",
          "Contenu": "All the accessories I’ve purchased have been great. The radios when they have a signal work great. My complaints are, I have to restart the radio sometimes 3 times day in order to communicate with my partner . The battery doesn’t last long compared to my other Motorola products. And it must lose and regain signal 15 times a day, the radio will be on belt and then it screams out “CHANNEL ONE”. It’s very annoying."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pat",
          "Nb_Reviews": 2,
          "Date": "2021-04-15T15:49:39.000Z",
          "Titre": "This is our 2nd purchase of radios and…",
          "Contenu": "This is our 2nd purchase of radios and we asked that the radios in this order be programmed to work with our 1st order. After unpacking we discovered that the radios will not communicate on Channel 1. Channels 2-8 are compatible. I called and was told that it was a programming error and was asked to send them back. The radios are needed for emergency use for our teachers and students in portables, therefore maximizing their safety outweighs the loss of one channel at this time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Malatinsky",
          "Nb_Reviews": 3,
          "Date": "2022-05-05T00:30:22.000Z",
          "Titre": "Good, But......",
          "Contenu": "The product is fine, your price and delivery cost are excessive."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Christopher",
          "Nb_Reviews": 1,
          "Date": "2021-02-28T18:18:37.000Z",
          "Titre": "I got my parts fine but I have had…",
          "Contenu": "I got my parts fine but I have had nothing but problems when it comes to downloading the programming for the radio.  I have contacted them on three occasions to advise them of my problem and have not received a reply to my last message.  Since I have a $200.00 radio which can not be programmed until I can download a good running copy of the programming, I am stuck with an expensive paperweight.  Still wondering if I made a mistake trusting Two Way Radio Gear with my purchase."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2020-09-14T20:15:11.000Z",
          "Titre": "The order process was a 5 star",
          "Contenu": "The order process was a 5 star, shipping was fast and arrived a day early. My concern in the actual headset. We switched from a Kyocera PTT phone and the headset was $80, however, it was a thicker cable wrapped in a heavy mesh like material. He PTT button was larger and did not feel lime i was going to break it. I would not have a problem paying more for a stronger option."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Gareth",
          "Nb_Reviews": 1,
          "Date": "2019-04-09T20:15:38.000Z",
          "Titre": "The delivery service by UPS is terrible",
          "Contenu": "The delivery service by UPS is somewhat annoying, notifications come if not at all, and I found out that they don't deliver to PO Box addresses. You'd think that ups would just drop the package off at a Canada post office instead of spinning their ears trying to find an alternative address. Even USPS transfers packages from them to Canada post so there's no hassle in finding when the package is arriving."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Raymond",
          "Nb_Reviews": 1,
          "Date": "2018-08-21T16:18:02.000Z",
          "Titre": "Excellent response from TWR in making…",
          "Contenu": "Excellent response from TWR in making the purchase but they chose to ship via UPS and I never got the radios and have failed to actively engage TWR in dealing with UPS who really are not responding to me. I cannot comment on the radios themselves or the custom programing as they have not been delivered although promised delivery was 5 days ago and I remained on site to receive the shipment all that day."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Grant",
          "Nb_Reviews": 1,
          "Date": "2018-02-26T17:20:18.000Z",
          "Titre": "Great service and good product",
          "Contenu": "Great service and good product.  Only complaint is that the webaite let me place in my address (I am in Canada) and gave me aa shipping cost.  After I placed the order I then got another emailed telling me I had to pay more to ship to Canada even though I had already put that address and got a shipping cost in the initial order.  Very poor webaite design in my mind if it cant calculate basic shipping costs."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pat",
          "Nb_Reviews": 2,
          "Date": "2018-10-01T19:42:39.000Z",
          "Titre": "We faxed an order on 8/29 and after not…",
          "Contenu": "We faxed an order on 8/29 and after not hearing from the company or receiving the goods by 9/21, we contacted them only to find that the fax had been mixed up in a stack of papers and had not been processed. We finally received the order on 9/25. Everything else was good.  I would recommend that you contact the company after sending a fax..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sharon",
          "Nb_Reviews": 1,
          "Date": "2015-01-14T21:53:43.000Z",
          "Titre": "two way radios",
          "Contenu": "We purchased several sets of radios within the last year and two sets have already quit working.  We have changed batteries but nothing works.  They can call us but cannot hear a response.  I emailed this information to you and the response was - they don't last that long because they are the cheaper ones and I should probably buy different ones. I did buy two more sets because we need them.  We are an elementary school and cannot really afford to buy the most expensive radios.  I do believe they should last longer than they did."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MSO. Lee Holton",
          "Nb_Reviews": 1,
          "Date": "2020-05-12T18:41:51.000Z",
          "Titre": "Customer Service Rating",
          "Contenu": "Products exceptional,Benny and Cody was great with their customer service ! Although the representative Who took my order lacked inefficiency and Courteous,professionalism to place Order when he was supposed to causing my company to give me unneeded or unwarranted disciplinary action because the order did not arrive as promised and guaranteed by paying the fastest rush order fees, On time as needed the day they were supposed to arrive, being a day late. Had placed several calls to 2 way radio gear speaking to Benny, and Cody who showed exceptional customer service an professionalism in handling my problem and situation and giving me a resolution they were fantastic."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2015-05-19T14:07:43.000Z",
          "Titre": "Shipping Error",
          "Contenu": "When I placed my online order, I entered a shipping address to my workplace in WI.The order was shipped to my billing address in CA, so I am still waiting for my shipment to arrive. This is hampering safety and production in our workplace."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "RCS",
          "Nb_Reviews": 2,
          "Date": "2020-11-11T15:44:17.000Z",
          "Titre": "Poor Inventory Control",
          "Contenu": "Due to the item being discontinued the inventory available was not accurate on two sites that they are part of and unfortunately we were unable to complete the customer's request."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Melba",
          "Nb_Reviews": 1,
          "Date": "2017-03-03T15:39:18.000Z",
          "Titre": "RADIO GEAR",
          "Contenu": "I did not have any problem with the website or with ordering.  However, once i received the product we realized that everything was not included.  i emailed Two Way Radio Gear and still have had not response."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tom Bailot",
          "Nb_Reviews": 1,
          "Date": "2019-03-26T18:19:56.000Z",
          "Titre": "Confused",
          "Contenu": "Hi, recently my company purchased four VX-261-G7 Two way radio's, I understand that Motorola bought Vertex, I was never told that the four radio had a different frequency than our original. So I talked to Benny and he said to just send them back with one of ours and they will Re-Program the radios to the Readers. The problem is he said that I will have to pay for the radio's to be shipped back to your company, I already paid over $800.00 for them plus another $30.00 to send them back. We have 8 maintenance staff members on hand plus 3 office workers and they all require using the radio's. I will have to think twice about my next order with you, our radio's are 5-6 years old so I'll be looking to purchase other radio's but not if it's going to cost me more money. Sorry this is so long but I had to tell someone about what happened. Thanks Tom Bailot, Facility Director"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bryan",
          "Nb_Reviews": 2,
          "Date": "2015-12-30T20:40:46.413Z",
          "Titre": "Had to work for my order.",
          "Contenu": "Called, sent written verification of my order, and had to call two more times to get my order shipped.\rI am a repeat customer, not what I expected."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gary",
          "Nb_Reviews": 4,
          "Date": "2018-05-02T18:24:27.000Z",
          "Titre": "Slow follow up",
          "Contenu": "Good but follow up time on a needed purchase was fairly slow due to manpower shortage. Still waiting for follow up."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Joan",
          "Nb_Reviews": 1,
          "Date": "2019-06-04T21:22:39.000Z",
          "Titre": "I'm putting three only because I…",
          "Contenu": "I'm putting three only because I haven't received the radios yet."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Chacon",
          "Nb_Reviews": 1,
          "Date": "2019-04-20T01:32:33.000Z",
          "Titre": "Hello",
          "Contenu": "Hello, Nobody is answering my cancel order anybody home ?"
        },
        {
          "Note": 4,
          "Lieu": "IL",
          "Pseudo": "eli Yaron",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T08:06:40.000Z",
          "Titre": "fast respond",
          "Contenu": "you reply fairly fast. i did not get the order yet so I cannot comon on that.thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gregory",
          "Nb_Reviews": 1,
          "Date": "2022-01-07T19:18:33.000Z",
          "Titre": "When customer orders the DTR410…",
          "Contenu": "When customer orders the DTR410 computer to radio cable it would be nice for complementary assistance, that the SERIAL to USB Gender/Changer came alone with the order $70.00 is a bit steep!!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 1,
          "Date": "2021-04-14T18:54:38.000Z",
          "Titre": "Great ear set",
          "Contenu": "Great ear set. Much more comfortable than I was expecting.  Length was perfect for the use I need. Only minor thing not a fan of the part that goes in the ear. But that's just nit picking. Recommended to all my co workers."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel Moreno",
          "Nb_Reviews": 1,
          "Date": "2021-06-28T13:56:00.000Z",
          "Titre": "Everything I needed and more",
          "Contenu": "The website was good and had everything I needed in one site. Was very appreciated that sites like this are out there. I try to look for radio gear all over town locally. No luck at all no one in town sells the kind of gear I needed for work. All the stores I had gone to told me the same think you going have to go online. The only thing that was not great was the shipping information after ordering items. Had no idea when they where going to be shipped or time frame when I was getting my item's. I did know it was going to be ups ground shipping but didn't give me a options to upgrade to try get items faster than what I did. But I know that not the sites fault that is more of a shipping problem."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Shubham Tamoli",
          "Nb_Reviews": 1,
          "Date": "2022-05-16T14:17:07.000Z",
          "Titre": "I highly recommend this because it's…",
          "Contenu": "I highly recommend this because it's one of the best radio platform. I suggest go for it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2021-04-30T16:41:31.000Z",
          "Titre": "Good work radios",
          "Contenu": "there is a little lag in the response time when keying up other than that a good radio"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 2,
          "Date": "2022-01-06T22:50:27.000Z",
          "Titre": "love the radios but but dispatch…",
          "Contenu": "love the radios but but dispatch program still not computer or chrome"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Denise",
          "Nb_Reviews": 1,
          "Date": "2021-10-08T18:45:32.000Z",
          "Titre": "Great Service",
          "Contenu": "Great Service, Quick Turnaround.  Always a pleasure to work with."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ken",
          "Nb_Reviews": 1,
          "Date": "2021-10-26T11:34:11.000Z",
          "Titre": "Very helpful in making a selection of…",
          "Contenu": "Very helpful in making a selection of radios.Thanks again"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Omar",
          "Nb_Reviews": 1,
          "Date": "2021-09-22T14:13:52.000Z",
          "Titre": "I believe they are a good company with…",
          "Contenu": "I believe they are a good company with great values"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kascie Smith",
          "Nb_Reviews": 1,
          "Date": "2022-05-04T15:54:44.000Z",
          "Titre": "Thanks",
          "Contenu": "The product was delivered in a timely fashion and works well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Justin M",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T14:37:43.000Z",
          "Titre": "Easy Process",
          "Contenu": "Easy to work with, good pricing, and decent communication throughout the ordering process."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Renee V",
          "Nb_Reviews": 1,
          "Date": "2019-03-30T00:49:23.000Z",
          "Titre": "We were very pleased with the product…",
          "Contenu": "We were very pleased with the product and the customer service. The only issue: We paid the premium shipping to have it shipped to an updated address before Sunday. However, it was shipped to the original address, which caused a delay, so we didn't receive it until the following week. Other than that, great service! (Thus, the reason for 4 stars)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 1,
          "Date": "2018-06-03T05:46:00.000Z",
          "Titre": "The company and the radios are great.",
          "Contenu": "The company was great and assisted me with all my needs.  The radios are very good for what they are designed for.  If you need basic two-way FM radios, these are better than any retail store bought GMRS radio you will find.  I own some good quality GMRS radios and I like them but, these Motorola RDU4160D radios work better overall.  I would recommend them and Two Way Radio Gear company as well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jon Speare",
          "Nb_Reviews": 1,
          "Date": "2016-05-27T18:58:44.000Z",
          "Titre": "Overall very good experience",
          "Contenu": "I was extremely impressed with Dean, he was very knowledgeable and made the buying experience fast and as simple as possible. The only issue I had was with Chris one of the Chat help associates. He was unable to assist with my programming issue due to it being after normal business hours. He should not have been available after hours of he was not able to at least assist with my needs."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charles",
          "Nb_Reviews": 2,
          "Date": "2019-01-18T20:58:09.000Z",
          "Titre": "3rd purchase from Two Way Radio Gear.",
          "Contenu": "3rd purchase from Two Way Radio Gear.A hiccup with their processing department delayed the transaction and we got the radios later then we desired. But Two Way Radio Gear resolved the issue with great service and satisfaction. If needed we will continue to order from them, they are a trusted seller."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2019-07-25T15:49:56.000Z",
          "Titre": "We ordered a rather big order",
          "Contenu": "We had ordered a rather big order, (21 radios) but a handful (4-5) were not working. Either the screen didn't work and the radios still communicated or the radios didn't communicate at all. Either way we had to send some back. Other then that the radios works great!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael M. K.",
          "Nb_Reviews": 3,
          "Date": "2017-11-17T20:11:00.000Z",
          "Titre": "Ordering and shipping was truly …",
          "Contenu": "Ordering and shipping was truly outstanding, item received is unfortunately not what I expected per the description.  What I need is not available on this site, but will definitely recommend 'Two Way Radio Gear' and will order again from them as needed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hugh",
          "Nb_Reviews": 1,
          "Date": "2017-05-11T21:22:01.000Z",
          "Titre": "Easy to order",
          "Contenu": "Easy to order, no concerns.   Only problem was with shipping, done through USPS.   They caused a delay over the weekend getting the headset.  Would recommend shipping through a more reliable source such as Fedex or UPS.  Otherwise, would have been five stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Continental Rx",
          "Nb_Reviews": 1,
          "Date": "2016-08-17T16:01:29.449Z",
          "Titre": "Great Store, Little Pricey.",
          "Contenu": "Store has a lot of different products you can choose from; the only thing is that they are a little on the expensive side. However, their customer service, concern and how helpful they are when you call in has been incredible every single time I have called in."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dean",
          "Nb_Reviews": 2,
          "Date": "2019-07-10T12:58:05.000Z",
          "Titre": "Two Way Radio has been awesome to work…",
          "Contenu": "Two Way Radio has been awesome to work with, the only reason I didn't give them a five star rating is do to the shipping time of the product I order. that's probably because I live in the West and they are shipping from the East."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2019-12-16T15:15:30.000Z",
          "Titre": "Had some issues with getting shipment…",
          "Contenu": "Had some issues with getting shipment info and had issues with getting staff to respond to questions regarding order delay. Overall I have had great response and great quality items. Had one negative order with no communication."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tim",
          "Nb_Reviews": 1,
          "Date": "2019-12-02T16:31:57.000Z",
          "Titre": "Had a rough start with one of the…",
          "Contenu": "Had a rough start with one of the salesman who seemed more interested in making a sale, than getting us the right radios.  Once the company was aware of the situation they have went above and beyond to address our radio needs."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2020-08-12T15:13:32.000Z",
          "Titre": "Good prices and selection of equipment",
          "Contenu": "Good prices and selection of equipment.  If you know what your looking for, your in luck. If your not certain,  ask lots of questions as not everyone there is 100% knowledgeable.  Other than that, a hood company."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Danielle",
          "Nb_Reviews": 1,
          "Date": "2021-01-26T14:38:40.000Z",
          "Titre": "We ordered two casings for our radios…",
          "Contenu": "We ordered two casings for our radios and while there was a shipping error, they made it right immediately and sent the missing item overnight. Will order from them again. Thank you for your service!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paradise Elem",
          "Nb_Reviews": 1,
          "Date": "2017-10-04T21:04:30.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service - good information on products to fit our needs. The only reason for 4 stars is I didn't get notified of shipping-  it took longer than expected so I needed to ask about the expected ship date/arrival."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thank",
          "Nb_Reviews": 1,
          "Date": "2016-10-01T13:49:02.000Z",
          "Titre": "Business Manager",
          "Contenu": "They are all good and helpful except rebate process :) there are several step that costumers need to follow up for getting that rebate. That is why i gave 4 starts.... it is unnecessary to be honest !!!! FYI. Thanks again!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tony Pirkle",
          "Nb_Reviews": 6,
          "Date": "2017-09-04T04:58:54.000Z",
          "Titre": "Vertex radios miss their earpiece compannion",
          "Contenu": "I have purchased several radios,head sets, and earpieces from TWRG. Online experience has been easy up until this last order. I'm having difficult time receiving ear pieces for my vertex radios I have bought"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2016-07-24T14:57:10.000Z",
          "Titre": "Hand Held Radios",
          "Contenu": "Since they only focus on radios, they are able to give a higher level of customer support that a company that handles a variety of products. The product lines they carry are top notch and hold up well to daily use."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brett",
          "Nb_Reviews": 2,
          "Date": "2017-05-30T21:10:20.000Z",
          "Titre": "Order process for the batteries I …",
          "Contenu": "Order process for the batteries I ordered took a long period of time.  Orders normally come in quicker than this which was shocking.  I got a handy new flashlight out of the deal but still delayed our operations"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Don",
          "Nb_Reviews": 1,
          "Date": "2017-05-31T22:51:57.000Z",
          "Titre": "Fast service and great pricing",
          "Contenu": "Fast service and great pricing, only complaint is that the radios were supposed to have our frequencies programmed into them and they were not. We sent them to a local shop for programming to save time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Linda Nawrocki",
          "Nb_Reviews": 1,
          "Date": "2021-03-09T16:30:17.000Z",
          "Titre": "I had a problem with submitting a claim…",
          "Contenu": "I had a problem with submitting a claim and Josh G checked into it and helped resolve the issue so I could move forward with the claim. He was timely, helpful, and thorough."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thank",
          "Nb_Reviews": 1,
          "Date": "2016-12-17T17:12:34.000Z",
          "Titre": "Great customer service",
          "Contenu": "The service is fantastic and the radios are good but the headsets are sketchy...I've had a couple go out on me in the first couple of months. It may be a fluke but thought you should know."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gary",
          "Nb_Reviews": 1,
          "Date": "2020-07-27T18:44:03.000Z",
          "Titre": "this was my first time using Two way…",
          "Contenu": "this was my first time using Two way radio for our warehouse radios, and I was pleasantly surprised with the customer service and quick turnaround on my new Motorola Radios."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thank",
          "Nb_Reviews": 1,
          "Date": "2016-06-10T20:02:42.000Z",
          "Titre": "dragon slayer",
          "Contenu": "the salesmen all know what they are doing, I never have one issue with either placing a order or receiving said orders, they know the equipment and are always there to help any time I call."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ron",
          "Nb_Reviews": 1,
          "Date": "2020-06-19T14:51:54.000Z",
          "Titre": "Great customer care",
          "Contenu": "Great customer care, I had a mixed up item sent out by mistake. I called them the next morning and they had it corrected immediately with the new item sent out same day."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carlos",
          "Nb_Reviews": 1,
          "Date": "2018-05-25T19:30:54.000Z",
          "Titre": "Good  information about item's  fast …",
          "Contenu": "Good  information about item's  fast  delivery   easy to  buy on website also  good price better  than Amazon will  buy again  for my  two  way  radios  parts  and accessories"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nairda",
          "Nb_Reviews": 1,
          "Date": "2016-01-07T17:26:41.666Z",
          "Titre": "Enjoyed working with company",
          "Contenu": "Two Way Radio Gear was very supportive and communicative.  I started with a cold call regarding some radio challenges with local vendors.  The sales manager spoke with me, spent 'tons' of time with me, never passed me off to someone else all without an expectation of an order.\r My business utilized Two Way Radio Gear for programming our radios.  They worked with us to ship and program very quickly in a limited window.\r I would have rated 5 stars except we had a programming issue which seemed to come from a minor communications glitch.  Both Two Way Radio Gear and I accepted our mutual responsibility with the error and plan to have it corrected in the near future.\r I will continue to use Two Way Radio Gear, I see them and their sales manager as a very honorable, reputable business."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael - St. Augustine, Florida",
          "Nb_Reviews": 2,
          "Date": "2014-11-11T13:53:10.000Z",
          "Titre": "Great planning with NO over sell!",
          "Contenu": "Very knowledgeable folks with very good support team. Feel very comfortable dealing with them and plan on continuing to plan and purchase radios from Tow Way Radio in the future!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 1,
          "Date": "2021-07-20T14:32:43.000Z",
          "Titre": "Ordered and got quick will order again"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Martin",
          "Nb_Reviews": 1,
          "Date": "2019-10-14T15:21:36.000Z",
          "Titre": "Was easy and service was overall good",
          "Contenu": "Was easy and service was overall good. I did call and leave a message asking for a call back which I didn't receive. But overall they did a great job."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vonda",
          "Nb_Reviews": 1,
          "Date": "2019-01-10T03:17:37.000Z",
          "Titre": "Thank you for the great service .",
          "Contenu": "I found two way radio gear company experience to be very honest. Purchased professional headphones gear ,well packed, good quality . I would reorder"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2021-01-05T16:08:22.000Z",
          "Titre": "Very friendly & quick replies",
          "Contenu": "Very friendly & quick replies. The shipping cost as much as my order (I am in Canada) but the part I needed was hard to find here."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cherisse",
          "Nb_Reviews": 1,
          "Date": "2019-09-25T14:19:24.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service. Got me a better deal then anywhere online. I appreciated all their help on finding the right headsets for our office."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karen",
          "Nb_Reviews": 1,
          "Date": "2019-10-30T13:53:08.000Z",
          "Titre": "Originally they forgot to send all of…",
          "Contenu": "Originally they forgot to send all of my order but quickly resolved the issue by getting my radios out in the next three business days"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2018-04-04T01:22:33.000Z",
          "Titre": "They initially sent me the wrong ear…",
          "Contenu": "They initially sent me the wrong ear pieces, but corrected it quickly.  I would purchase items from them again.  Good people."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Satisfied, will return",
          "Nb_Reviews": 1,
          "Date": "2017-01-26T14:55:47.000Z",
          "Titre": "****",
          "Contenu": "Got the equipment I ordered on time and as promised.  The receipt was slow getting to me, but it did get there.  No problems."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeanie",
          "Nb_Reviews": 1,
          "Date": "2018-06-27T20:34:44.000Z",
          "Titre": "Wish there was a section online to let…",
          "Contenu": "Wish there was a section online to let customers know what the shipping fees will be if they are ordering internationally."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2015-03-04T21:38:44.000Z",
          "Titre": "Good Service, Great Price",
          "Contenu": "The sales rep was helpful, and knowledgeable.  The price for the Vertex VX-231 was the best I could find, locally and online."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Doug",
          "Nb_Reviews": 2,
          "Date": "2020-11-04T14:08:12.000Z",
          "Titre": "Good Job",
          "Contenu": "For the most part the overall experience was excellent. i think the website could provide more product info."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tim",
          "Nb_Reviews": 1,
          "Date": "2018-08-29T13:12:51.000Z",
          "Titre": "Spent x amount on shipping to get it in…",
          "Contenu": "Spent x amount on shipping to get it in 3 days and it ended up being a week to get otherwise overall great product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Beth",
          "Nb_Reviews": 1,
          "Date": "2018-03-09T21:49:50.000Z",
          "Titre": "Radio",
          "Contenu": "Our order was delayed since it never sent to accounting. However they were able to fix it right away."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2019-02-06T12:59:38.000Z",
          "Titre": "Started Bumpy Ended Pretty Good",
          "Contenu": "We are very pleased with the products that we purchased. Once our products were delivered we were unable to use them with our existing walkies. In the initial conversation to find a solution, it was stated that this was on us and that we would have to pay for the return shipping for your company to pair to one of our existing walkies. In the following discussions, we were able to determine that we had informed the sales representative when making our purchase that we had existing walkies. For that reason, all cost that were inquired were taken care of and the turn around time on receiving our walkies back was very impressive. When our walkies were returned to us following the first reprogramming there was one walkie that was sent back that was still not operational and we did have to go through the process to send it back again. This provided an added stress to our school as we utilize our walkies for security purposes and it put us at an added disadvantage having to send in a walkie to pair it to twice. With all that said I rated the 4 Stars because of the response time and turn around when working with the customer service team. I would recommend purchasing products from Two Way Radio Gear to friends and colleagues."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RDJ",
          "Nb_Reviews": 1,
          "Date": "2020-04-09T15:32:55.000Z",
          "Titre": "Helpful staff",
          "Contenu": "Helpful staff.  Some confusion over allocation of appropriate frequencies and GMRS licensing"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robin Amundson",
          "Nb_Reviews": 1,
          "Date": "2016-04-28T15:55:41.000Z",
          "Titre": "2 way radios",
          "Contenu": "Great guys to work with.  Any problems they addressed right away and we were up and running."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Doug",
          "Nb_Reviews": 1,
          "Date": "2016-01-26T23:14:48.382Z",
          "Titre": "Two Way Radio Gear",
          "Contenu": "Fast response. Excellent service. Customer service called and answered all of my questions."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thank",
          "Nb_Reviews": 1,
          "Date": "2016-08-05T00:32:19.000Z",
          "Titre": "Good idea to use these guys!",
          "Contenu": "I needed a charger that was dicontinued and they did a great job finding combat ability ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patrick",
          "Nb_Reviews": 1,
          "Date": "2018-05-17T15:34:32.000Z",
          "Titre": "only work with a specific portion of…",
          "Contenu": "only work with a specific portion of our account, but has been smooth and no problems"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ronnie Fowler",
          "Nb_Reviews": 1,
          "Date": "2016-02-27T22:59:36.810Z",
          "Titre": "Will Recomend to Others.",
          "Contenu": "Sales department are awesome to work with. Very helpful. Will recommend to others."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott mosher",
          "Nb_Reviews": 1,
          "Date": "2017-09-02T01:34:32.000Z",
          "Titre": "Service great",
          "Contenu": "Service great,  lead time spectacular and sales professional was awesoE"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Darrell",
          "Nb_Reviews": 1,
          "Date": "2021-08-12T14:20:51.000Z",
          "Titre": "Mic for my radio",
          "Contenu": "Product was worth the price"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Omar",
          "Nb_Reviews": 1,
          "Date": "2018-03-13T19:01:02.000Z",
          "Titre": "Great reliable products",
          "Contenu": "Great reliable products. Easy check out process online."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carlos",
          "Nb_Reviews": 1,
          "Date": "2021-03-09T18:03:45.000Z",
          "Titre": "The battery does not connect well to…",
          "Contenu": "The battery does not connect well to the radio."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kris",
          "Nb_Reviews": 2,
          "Date": "2016-01-23T01:01:15.117Z",
          "Titre": "Quick Service",
          "Contenu": "Quick service, just wish they had a better inventory."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Renee",
          "Nb_Reviews": 1,
          "Date": "2017-02-09T16:29:09.000Z",
          "Titre": "Easy to work with",
          "Contenu": "Fast shipping, fair prices and good communication."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amy",
          "Nb_Reviews": 1,
          "Date": "2020-01-23T14:02:09.000Z",
          "Titre": "Good customer service",
          "Contenu": "Good customer service.  Helpful information."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AJ M",
          "Nb_Reviews": 2,
          "Date": "2017-08-18T21:26:39.000Z",
          "Titre": "Delivers what they promise",
          "Contenu": "Delivers what they promise, year after year."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2020-07-06T15:20:08.000Z",
          "Titre": "nice people",
          "Contenu": "nice people, fast service quality gear"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bruce",
          "Nb_Reviews": 2,
          "Date": "2020-05-18T20:30:14.000Z",
          "Titre": "good radio",
          "Contenu": "good radio, easy online order"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Margaret",
          "Nb_Reviews": 1,
          "Date": "2020-06-10T16:03:19.000Z",
          "Titre": "This is just what I needed."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2020-06-25T13:00:14.000Z",
          "Titre": "no issues on a uk delivery"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Terri Carrasco",
          "Nb_Reviews": 6,
          "Date": "2018-11-26T16:58:30.000Z",
          "Titre": "Excellent Customer Service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2014-12-09T20:00:56.000Z",
          "Titre": "online",
          "Contenu": "Ordered a headset for work."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Gerry H.",
          "Nb_Reviews": 1,
          "Date": "2016-09-27T14:18:59.000Z",
          "Titre": "Great Product!",
          "Contenu": "Radios are working well !"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tevis",
          "Nb_Reviews": 1,
          "Date": "2020-05-25T19:48:30.000Z",
          "Titre": "Very good service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Oscar Lara",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T09:56:16.000Z",
          "Titre": "good timing on shipment"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2021-03-25T16:34:36.000Z",
          "Titre": "This is what customer service is…",
          "Contenu": "This is what customer service is supposed to look like! No sales pressure, only answers. Cody worked with us extensively to determine our needs, not only with which direction to go, but with technical questions as well as demos to make sure we were comfortable- and then even took the time figure out ways to save us more money. He was always available and willing and knowledgable to answer everything we threw at him. What an incredible experience and such a refreshing difference these days. Many thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ashley",
          "Nb_Reviews": 1,
          "Date": "2021-06-10T20:38:22.000Z",
          "Titre": "Top Notch Customer Service",
          "Contenu": "Cody (our sales rep) is incredibly responsive. I don't think it's ever been more than 24 hours to get a response, and I usually hear from him within a couple hours of contacting him. He knows exactly what each of our locations prefers in terms of radios and headsets and always keeps me up to date on relevant promotions. If the rest of the staff at Two Way Radio is anywhere near as on point as Cody is, then I can't see how anyone could fail to have an outstanding experience with them.  Also, the turnaround time on orders is quick and efficient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wendy",
          "Nb_Reviews": 2,
          "Date": "2021-12-17T17:16:34.000Z",
          "Titre": "Second to non customer service",
          "Contenu": "I am in wholesale business and deal with customer service/customer support on a daily basis.  My experiences with Cody at Two Way Radio Gear is second to none.  His responses are timely, my orders are filled promptly, and he goes above and beyond when there is warranty work involved.  I would hire him in an instant."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tony Pirkle",
          "Nb_Reviews": 6,
          "Date": "2023-04-17T20:29:50.000Z",
          "Titre": "A Long Time Customer",
          "Contenu": "As a repeat customer, I know I can count on the great customer service I’ve always received when I call. Joe and Bennie have always listened to what I needed radios for, and suggested practical options to meet my needs. Their knowledge is top notch and they take the time to understand what works best for me and my budget. I will continue to use them in the future. Great company. I have used their products for 10 years"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stacy Deangelis",
          "Nb_Reviews": 2,
          "Date": "2021-10-22T17:59:24.000Z",
          "Titre": "We've been working working with Two Way…",
          "Contenu": "We've been working working with Two Way Radio Gear for a few years now, and the service is always excellent.  Our rep, Cody, is so helpful.  He knows our history and always has time and the knowledge to give us suggestions regarding what we need to solve our issue(s).  I don't know how we managed before getting our 2-way radios.  Best decision we ever made to get them, and we're SO pleased that Two Way Radio Gear is where we decided to buy them from.  We highly recommend this company!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2021-06-15T11:23:49.000Z",
          "Titre": "Looking to replace 10 plus year radios",
          "Contenu": "Looking to replace 10 plus year radios, couldn't get a call back from any local companies.Found Two Way Radio Gear on the WEB.Called telephone number on Web Site to get a few questions answered and spoke to Joe N. He was very informative and took my order over the phone. Had my radios 2 days later.  Very pleased with prompt service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Stone",
          "Nb_Reviews": 1,
          "Date": "2021-07-08T14:53:21.000Z",
          "Titre": "We have been doing business with Joe at…",
          "Contenu": "We have been doing business with Joe at two way radio gear for years. Here at The Stuart Jet Center, we have always received the very best and professional service that you can find in our industry from Joe and two way gear, and will continue as long as we get the quality and service that this company has given to us. So here's a shout out, and don't forget the Airshow this year.                             John Stone, Line Supervisor                               The Stuart Jet Center"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Kimel",
          "Nb_Reviews": 1,
          "Date": "2021-06-21T18:59:49.000Z",
          "Titre": "I am a former two-way radio shop owner…",
          "Contenu": "I am a former two-way radio shop owner (from back in the 70s, 80s and 90s) and have found this company perfect to work with.  They take the time to find our how they can best help you, then make recommendations on what products will best fit your needs.  I find their pricing to be highly competitive and see no reason why anyone would buy a Motorola radio from anyone but a certified dealer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Director of Operations",
          "Nb_Reviews": 1,
          "Date": "2021-10-04T19:29:13.000Z",
          "Titre": "Deliver every time!",
          "Contenu": "We have been working with Two Way Radio gear since around 2017 and they have always come through with great solutions to our communications needs.  Being an outdoor sports and adventure facility quick and clear coms are a necessity.  Big thanks to Josh for always delivering!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer",
          "Nb_Reviews": 3,
          "Date": "2021-04-06T14:09:02.000Z",
          "Titre": "We have been ordering from Two Way…",
          "Contenu": "We have been ordering from Two Way Radio gear for years now and have been extremely happy with their customer service. They are quick to make things right  for the customer. Also, they have very competitive rates and we can find extra earpieces for our radios that we can't find anywhere else."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "STEVE BURCHAM",
          "Nb_Reviews": 3,
          "Date": "2022-08-08T22:58:39.000Z",
          "Titre": "New radio, New gear",
          "Contenu": "I bought a new radio, so I needed some new accessories. The remote ear piece is something I haven't tried before, I like it. The sound travelling through the tube reduces the harsh high's, so that it is pleasant to use. I will likely get ones for my other radios. The speaker mic is made well, I don't think it is particularly special, but it does seem to be solid enough to last for some time, and all of these at a reasonable price! I will certainly return here for more gear as I have a need for it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kim McCarty",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T22:12:53.000Z",
          "Titre": "Great deal for schools!",
          "Contenu": "Great deal.  Excellent quality.  Fast shipping.Will buy again and again.  For schools, this was a fantastic find.  Helping to keep our kids safe."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zach",
          "Nb_Reviews": 1,
          "Date": "2021-08-06T13:11:39.000Z",
          "Titre": "My school was needing to get some new…",
          "Contenu": "My school was needing to get some new radios for our administrators and teachers, so I called Two Way Radio Gear and talked to Joe Noach.  He was very helpful with advice and suggesting the radios that would best suit our needs.  We placed our order and in a few weeks we had our new radios and we love them.  I highly recommend Two Way Radio Gear and Joe Noach!  We will definitely be doing more business with them in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2022-01-08T18:49:56.000Z",
          "Titre": "These guys are the real deal",
          "Contenu": "These guys are knowledgeable and found the right radio set for me and our company.  We have a small team of three operators feeding a crushing plant two way radio picked the radios that are tough and operational and they where $150 bucks a piece cheaper than any other place or even Amazon."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2021-11-04T14:32:20.000Z",
          "Titre": "Purchased portable radios",
          "Contenu": "Purchased portable radios.  Prices were better than competitors.  Josh was very easy to deal with, very helpful.  Only glitch was the delivery where I had to reenter an address for UPS, however the address you used was the correct address so not your fault."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 5,
          "Date": "2022-01-07T18:29:09.000Z",
          "Titre": "The standard for excellence!",
          "Contenu": "Two Way Radio Gear, once again, surpassed the standard for excellence.  With one short phone call, I was greeted professionally, my questions answered, my order placed and notification of product shipped was emailed to me.  It can't get any better than this!Thank you, Two Way Radio Gear!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Myron",
          "Nb_Reviews": 1,
          "Date": "2021-03-27T12:51:58.000Z",
          "Titre": "Slow processing time....updated review",
          "Contenu": "Slow processing time. I placed my order 4 days ago, and it is still processing. I need a company with a faster turn around time. I can only imagine how long it will take for the order to be shipped.UPDATE!!! I apologize for the incorrect review. I honestly got you guy confused with another company with a similar name that I sometimes use. You guys are awesome. Your turnaround time was excellent. Sorry for the confusion."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "urso bus",
          "Nb_Reviews": 2,
          "Date": "2021-08-10T17:01:24.000Z",
          "Titre": "Fantastic company!",
          "Contenu": "Fantastic company!! very receptive and fast, Kevin Walsh our rep. is very helpful, setting up our radios and is always available if we have any questions or concerns. Top notch!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Goober",
          "Nb_Reviews": 2,
          "Date": "2021-05-28T13:24:03.000Z",
          "Titre": "Back for more!",
          "Contenu": "Bought these radios again. We have another brand and model but my employees prefer this model radio so I bought more. Holds up well in our excavating environment. Easy to hear, rugged, and water tight."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 1,
          "Date": "2021-08-16T12:59:04.000Z",
          "Titre": "We recently had problems with our…",
          "Contenu": "We recently had problems with our vendor being able to provide radios.  I looked online and found TWO WAY RADIO GEAR.  They were able to ship radios to us the same day and at a much better price point.  Great service and great communication etc."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bub",
          "Nb_Reviews": 1,
          "Date": "2021-10-11T00:32:53.000Z",
          "Titre": "Kevin is extremely knowledgeable and…",
          "Contenu": "Kevin is extremely knowledgeable and helpful. He is always pleasant to work with no matter how simple of a question that I have. I highly recommend these folks as they are a do what it takes team and they make our team stronger. We are not a large customer but still feel important when we call them for help. If 10 stars were an option Id still wan to give them more!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AM",
          "Nb_Reviews": 1,
          "Date": "2021-05-04T15:25:59.000Z",
          "Titre": "Absolutely clueless....until I talked to them!",
          "Contenu": "We've struggled for years with our radios, and have bought retail and other inexpensive radios for our team to use in our factory - however, we never could get the range and quality we needed to hear each other from one end of the building to another.After talking to their rep, he spent quite a bit of time educating me on the technologies, and why each was/wasn't something that would ultimately solve my issues.They sent us 4 loaner devices, which worked perfectly.  Great consultation over phone, great sales experience - highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lion Tigers & Bears",
          "Nb_Reviews": 1,
          "Date": "2021-08-09T17:12:59.000Z",
          "Titre": "We are so happy we were able to get the…",
          "Contenu": "We are so happy we were able to get the same radios we already have but the model had been discontinued. They were delivered quickly and programmed. So far we have not had any issues. It is very important we have good quality and working radios at our sanctuary. Very happy!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tony Pirkle",
          "Nb_Reviews": 6,
          "Date": "2021-08-21T12:57:42.000Z",
          "Titre": "Long time customer",
          "Contenu": "Always great customer service. I have used TWRG for 10 plus years as my source for radios, headsets, and earpieces. You can talk to knowledgeable professionals at any time if you require assistance. Quality products and quality service. They have never disappointed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sonya Z.",
          "Nb_Reviews": 1,
          "Date": "2021-06-17T14:30:24.000Z",
          "Titre": "Good Price Great Customer Service",
          "Contenu": "I dealt with Brian and he was wonderful!!!  He was so patient, helpful and really worked hard to help me get what I needed on a very short notice.  Since I was asked to get some radios to match others we already had (and I know nothing about them) I really needed their help and guidance. Brian even caught a mistake my IT department made when providing me info on what to get so they would work together. I would say he definitely went out of his way which was fantastic on top of the companies good prices.  Usually they say you get what you pay for but with these is purchase I got so much more!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dustin",
          "Nb_Reviews": 2,
          "Date": "2021-07-16T19:56:37.000Z",
          "Titre": "The guys at Two way radio have always…",
          "Contenu": "The guys at Two way radio have always jumped at any challenge or questions that our company has had. We are returning customers and I don't see that changing anytime soon."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nate",
          "Nb_Reviews": 1,
          "Date": "2021-04-16T16:50:55.000Z",
          "Titre": "Our experience with Two way radio has…",
          "Contenu": "Our experience with Two way radio has been a positive one for our business. There team is quick to answer questions, and they always have the products we order in stock and ships quickly. I recommend them to any business looking to enhance there communication onsite."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 3,
          "Date": "2022-10-25T22:06:22.000Z",
          "Titre": "Amazing customer service",
          "Contenu": "Amazing customer service, great product, and fast response.  The team there care about their customer the way everyone should be treated.  Repeat customer time and time again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony",
          "Nb_Reviews": 2,
          "Date": "2021-08-06T15:15:20.000Z",
          "Titre": "Quick fix!",
          "Contenu": "I had an issue with a malfunctioning earpiece that came with a set of 4 Motorola CLIPe 1010 radios. The representative listened to my issue, confirmed my diagnosis of the problem, and explained the next step (to have a colleage reach out).  The colleage reached out very quickly without me having to follow up and decided to have a a replacement sent ASAP.  Great customer service to take a problem and address it quickly without generating additional headache."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "COUNTRY GLEN PATROL",
          "Nb_Reviews": 2,
          "Date": "2021-07-23T18:26:40.000Z",
          "Titre": "I had the pleasure of dealing with…",
          "Contenu": "I had the pleasure of dealing with Kevin Ward and he was professional and had product knowledge. Very good at handling the transaction. I will be for sure using Two Way Radio Gear for my needs in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony",
          "Nb_Reviews": 1,
          "Date": "2021-08-17T17:53:43.000Z",
          "Titre": "Great Service",
          "Contenu": "I contacted Two Way Radio Gear to get some radios for our Church. Cody was very helpful in answering questions and getting us fitted with great equipment that meets our needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Ross",
          "Nb_Reviews": 2,
          "Date": "2021-12-17T23:23:35.000Z",
          "Titre": "Tony has been great",
          "Contenu": "Tony has been great. he listened to what are needs were, made suggestions.The quote was professional and crystal clear. Our order was shipped within a week of ordering and was complete. Tony has been helping with setup and installs. So far the product is working great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 2,
          "Date": "2021-10-26T23:57:57.000Z",
          "Titre": "We love the new radios",
          "Contenu": "We love the new radios, we use these for our seasonal business and they seem to be much better than the others we've used. I like that other walkies can't interfere with these."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephanie",
          "Nb_Reviews": 1,
          "Date": "2021-11-16T14:38:46.000Z",
          "Titre": "Totally proficient and professional",
          "Contenu": "I have been purchasing Motorola two-way radios for the company for years.  I appreciate Two Way Radio Gear's prompt service and courteous sales personnel.  On my recent purchase Joe was able to look up previous radio purchases to insure that they new ones would be compatible.  Totally proficient and professional and I would recommend Two Way Radio Gear over any other company out there."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 2,
          "Date": "2021-08-09T21:16:24.000Z",
          "Titre": "Every time I need to purchase radios…",
          "Contenu": "Every time I need to purchase radios for our school, I am met with awesome customer service and great prices.  They are helpful and genuinely care about their customers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Randall Shaw",
          "Nb_Reviews": 1,
          "Date": "2021-09-09T15:20:51.000Z",
          "Titre": "Tony has been a great help with getting…",
          "Contenu": "Tony has been a great help with getting me started. And i can only imagine of one giy is this helpful well that leaves one conclusion about the rest of the company. Thank you all for your dedication and support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cameron",
          "Nb_Reviews": 2,
          "Date": "2021-06-09T18:55:11.000Z",
          "Titre": "Always outstanding service from this…",
          "Contenu": "Always outstanding service from this team of experts!  They always seem to have the products I need and get they out to me extremely fast!  I will continue to recommend them to others and always go to them for the Radio needs I have."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony",
          "Nb_Reviews": 3,
          "Date": "2021-05-18T13:28:53.000Z",
          "Titre": "Great company",
          "Contenu": "The company was very friendly to deal with. They were the only company offering the item I was looking for and offered it at a very fair price. Selection is great and shipping is fast. I highly recommend ordering from them in the future. I will personally order from them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Tingle",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T22:45:08.000Z",
          "Titre": "Great Service",
          "Contenu": "Communication and Service were exceptional. Sales rep Joe N. worked with our schedule to get the product to us quickly."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Luis A Manrique DL",
          "Nb_Reviews": 2,
          "Date": "2023-10-30T15:59:11.000Z",
          "Titre": "Availability of Stock",
          "Contenu": "Availability of Stock, Price, Easy Web Ordering process.Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harold  Bray",
          "Nb_Reviews": 5,
          "Date": "2021-12-01T15:27:56.000Z",
          "Titre": "The ordering was smooth and efficient.",
          "Contenu": "The ordering was smooth and efficient.All I had to do was order 4 radios and they had my information on their records, so payment was made and about one week later the working radios were in our shop."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John K",
          "Nb_Reviews": 4,
          "Date": "2021-06-28T19:58:25.000Z",
          "Titre": "As a retired former owner of a two-way…",
          "Contenu": "As a retired former owner of a two-way radio shop myself, I was totally satisfied with my shopping experience with Two-Way Radio Gear.  I needed to purchase radios for the maintenance staff at my large condo building, and account manager Josh was able to recommend the perfect Motorola radios for us at a very fair price.  W would recommend this company to anyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryan Dougherty",
          "Nb_Reviews": 4,
          "Date": "2021-08-10T16:50:19.000Z",
          "Titre": "Cody Stewart always does a great job",
          "Contenu": "Cody Stewart always does a great job!  When I place an order, the product always arrives soon afterwards.Thank you Two Way Radio.Bryan"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cameron",
          "Nb_Reviews": 2,
          "Date": "2023-01-17T21:10:22.000Z",
          "Titre": "The staff is extremely helpful",
          "Contenu": "The staff is extremely helpful.  Always getting a human to talk to is great and very helpful when asking questions and getting the right thing ordered."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2021-04-09T13:55:06.000Z",
          "Titre": "Great service they have helped me right…",
          "Contenu": "Great service they have helped me right away with any issues I come across as far as understanding the device. Very prompt response time all around great to do business with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 2,
          "Date": "2021-07-07T16:38:32.000Z",
          "Titre": "Extremely helpful when it came to…",
          "Contenu": "Extremely helpful when it came to getting my new radios programmed to match the existing ones.  Could not ask for anything better.  A+++"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Derek",
          "Nb_Reviews": 2,
          "Date": "2021-06-22T13:32:34.000Z",
          "Titre": "The TLK100 /  Wave on Cloud product and…",
          "Contenu": "The TLK100 /  Wave on Cloud product and user interface are both very solid and easy to manage. Only to be trumped by amazing customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chip",
          "Nb_Reviews": 1,
          "Date": "2021-04-30T15:47:45.000Z",
          "Titre": "First time using Two Way Radio was good",
          "Contenu": "First time using Two Way Radio and all was good.  Notes data on the order apparently didn't go through with the order and they had to call me to learn info I typed in the notes, but it was all good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Llama Lama Ding Dong",
          "Nb_Reviews": 6,
          "Date": "2021-05-18T18:26:27.000Z",
          "Titre": "Quick and Easy!",
          "Contenu": "Very friendly & responsive customer service. I shopped for my radio with ease and they help programmed it for me as well. Shipping was fast and got my radio pretty quickly too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 2,
          "Date": "2022-01-12T16:47:32.000Z",
          "Titre": "One of the best vendors I have ever…",
          "Contenu": "One of the best vendors I have ever dealt with.The absolutely best radio vendor experience possible.E-mail or call Tony and it is dealt with in minutes.I cannot say enough good things.With 2-way radio I am not doing the vendor's job or chasing the vendor to do it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Clifton",
          "Nb_Reviews": 1,
          "Date": "2021-06-18T14:19:52.000Z",
          "Titre": "Excellent service,,",
          "Contenu": "Excellent service,,, very personal sales staff. I have Cody's number in my phone now. This is my new radio service and support, dealer !!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Manuel Cruz",
          "Nb_Reviews": 2,
          "Date": "2022-08-22T18:30:26.000Z",
          "Titre": "100% Recommended",
          "Contenu": "I just want to say that they have the best price online than anyone else. Customer service is the best, there was an issue with my order and she managed to fix it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nick",
          "Nb_Reviews": 1,
          "Date": "2021-08-23T14:23:24.000Z",
          "Titre": "This product has been great for us",
          "Contenu": "This product has been great for us. Reception reaches far and is clearly heard throughout the building and across campus. Customer service was great as well!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jill",
          "Nb_Reviews": 1,
          "Date": "2021-04-14T13:24:27.000Z",
          "Titre": "Listen...this company is the best!!!",
          "Contenu": "Listen...this company is the best!!!! Two Way Radio Gear is very fortunate to have Tierre as a programming tech!  Number one...I got Tierre on the first call...no wait times..no leave a message..I am not use to this type of customer service as my previous radio supplier for our school system was hardly ever available (never a phone call answered in real time...had to leave message...may get a call back in a week or two...maybe not). Tierre was a very patient and knowledgeable programming technician.  He spent over an hour with me today troubleshooting a problem that I caused when I sent in the wrong programming frequencies with my order.  I cannot say enough about the support.  He sent me upgraded software and worked tireless with me to resolve the problem.  All my radio business for my school district, because of the support I received from Tierre and Joe in sales, will be with Two Way Radio Gear.  Thank you much!  Jill"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "COUNTRY GLEN PATROL",
          "Nb_Reviews": 2,
          "Date": "2021-07-30T22:20:53.000Z",
          "Titre": "The representatives for Two Way Radio…",
          "Contenu": "The representatives for Two Way Radio Gear were awesome. My radios were shipped very quickly and they gave excellent support in the set up."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph",
          "Nb_Reviews": 2,
          "Date": "2021-06-30T13:49:10.000Z",
          "Titre": "Two-Way Radio Gear is the best in two-way communications needs and services",
          "Contenu": "Our experience with Two Way Radio Gear has been and continues to be, outstanding! Our rep, \"Joe\" does a great job. When I first contact the company for our two-way needs, he knew just the right product. We ordered six. Then, we found ourselves in need of one more. I called Joe and we had it the next day. We then needed parts. Joe came through! Then, we needed yet another two-way radio. Again, had it the next day, again Joe was right on it. I can't say enough about TWRG and especially Joe! He is one GREAT sales rep and his customer service cannot be beat! He is always on point- Thank you TWRG for your outstanding sales and service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 2,
          "Date": "2022-01-23T19:23:18.000Z",
          "Titre": "Great Customer Service!",
          "Contenu": "Cody provided great customer service. I couldn’t be happier with my radios (Motorola CP200D) and the simple process of getting them programmed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom Reber",
          "Nb_Reviews": 1,
          "Date": "2021-09-10T14:09:44.000Z",
          "Titre": "Josh is wonderful to work with!",
          "Contenu": "I've been a customer with TWRG for a number of years now, and recently decided to upgrade our radio system and fleet at work. Josh was incredibly helpful and responsive in guiding me through the process of FCC licensing (we were using MURS previously), repeater specs, system construction and building a new codeplug for our existing fleet. We're up and running on our new system seamlessly and with phenomenal support & guidance!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wb Scrap Recycling",
          "Nb_Reviews": 1,
          "Date": "2021-10-29T13:05:27.000Z",
          "Titre": "We’ve been using two way radio gear for…",
          "Contenu": "We’ve been using two way radio gear for years. Their prices and customer service are top notch, shipping was very fast as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edward",
          "Nb_Reviews": 2,
          "Date": "2021-05-17T17:21:50.000Z",
          "Titre": "very good company",
          "Contenu": "very good company, talked to Joe Noach a few times made very good suggestions for our noisy work environment, radio work awesome."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2021-05-29T20:43:02.000Z",
          "Titre": "Product delivered as scheduled",
          "Contenu": "Product delivered as scheduled. One minor product item was resolved quickly. I would recommend to anyone and would do business again with this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen Edelstein",
          "Nb_Reviews": 1,
          "Date": "2022-05-26T16:20:51.000Z",
          "Titre": "Joe Noach is great at what he does",
          "Contenu": "Joe Noach is great at what he does.  He educated me on a subject I knew little of.  He was very helpful.  Give him a raise!!!!!He is not pushy, he listens then he tells you what you need to know, sounds like a seasoned veteran who was well trained.  I will be calling him from now on for any orders, concerns!!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lee Thomson",
          "Nb_Reviews": 3,
          "Date": "2023-05-17T20:04:31.000Z",
          "Titre": "Won’t order anywhere else !!",
          "Contenu": "Won’t order anywhere else , this place is fast easy and best pricing out there 💪🏻 keep up the good work"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 1,
          "Date": "2021-08-30T18:56:14.000Z",
          "Titre": "Excellent",
          "Contenu": "Excellent, professional service, and high quality products. The representative, Josh Galavan, was very knowledgeable and pleasant to work with. This is my second time to purchase radios from Two Way Radio Gear and I will be returning for another purchase soon."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rebecca",
          "Nb_Reviews": 1,
          "Date": "2021-07-23T13:57:40.000Z",
          "Titre": "The team at Two Way Radio Gear is very…",
          "Contenu": "The team at Two Way Radio Gear is very helpful and professional!  I received my radios quickly and without any issues!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LONGOS MECH CONTRACTORS",
          "Nb_Reviews": 1,
          "Date": "2021-06-25T16:09:24.000Z",
          "Titre": "It was an awsome experience from the…",
          "Contenu": "It was an awsome experience from the first phone call when I spoke with Josh Glavan!  I was not sure what model radio to go with for our business . I gave him the two model numbers and he asked how the radios were going to be used and other important questions .Then he explained that the Motorola Mag one BPR 40 would be good fit for our Crane Operators to use!He sent me more info than I had requested ! I sent him several e mails with more and more questions and about cost !He always replied promptly and even called me twice to follow up and make sure there was anything else i needed to decide on mu order!My Owner changed his mind 3 times and Josh never got fustrated he just kept sending me what i needed to get my Owner to see what he really wanted and all the diffrent offers! Have to say we did get price quote from 2 other Radio suppliers and Two - Way Won hands down !!Not only in price but customer service and prentation Glad I called them! Josh is AWSOME!  Will highly recommend them! 5 STAR !!!! Thank you !!! For Being AWSOME ! In this day and time thats a rare thing!!!   Thank you! Longos Mechamical ! Robin."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 1,
          "Date": "2021-04-01T14:42:31.000Z",
          "Titre": "I like this company and my Rep",
          "Contenu": "I like this company and my Rep. We try to keep up on our inventory here but sometimes you have to have some equipment right away to continue business. My Rep is very prompt and takes care of our needs.Thank You"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debbie",
          "Nb_Reviews": 1,
          "Date": "2021-10-05T15:34:53.000Z",
          "Titre": "Great experience and customer service",
          "Contenu": "Great experience and customer service. All order were taken in a timely manner and delivered within 2-3 daysVery Happy!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2021-09-22T14:35:03.000Z",
          "Titre": "They allowed us a demo trial run of a…",
          "Contenu": "They allowed us a demo trial run of a radio for a week  Although that radio will not work for use it was great to have a refundable trial period"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keith",
          "Nb_Reviews": 1,
          "Date": "2021-10-13T14:18:48.000Z",
          "Titre": "Radio Order",
          "Contenu": "I spoke to Josh and Cody.  Cody helped me right away.  I had the radios I ordered and programmed within a couple days! Thank you!Keith AlbertChief of SecurityStroudsburg Area SD.Stroudsburg Pa"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 5,
          "Date": "2021-08-20T21:12:37.000Z",
          "Titre": "Helpful and hospitable",
          "Contenu": "As always, Two Way Radio Gear and the staff are helpful and hospitable.  I wouldn't buy from anyone else!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angie Stark",
          "Nb_Reviews": 1,
          "Date": "2022-10-04T13:10:37.000Z",
          "Titre": "Good local service",
          "Contenu": "We went from a national vendor to this one.  They program the radios to match the ones we already have for no extra charge."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jaime",
          "Nb_Reviews": 1,
          "Date": "2021-10-20T14:05:24.000Z",
          "Titre": "Two way radio has been a great help for…",
          "Contenu": "Two way radio has been a great help for my business needs. The radios they advised me to purchase are working out great. Thank you for all your help..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2021-07-20T15:31:42.000Z",
          "Titre": "We have had good experiences with this…",
          "Contenu": "We have had good experiences with this company. I will continue to send them all my radio orders going forward."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 2,
          "Date": "2022-03-24T16:39:06.000Z",
          "Titre": "love my twoway radios never lose signal…",
          "Contenu": "love my twoway radios never lose signal or dead spotscustmer sev. great as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laurence",
          "Nb_Reviews": 1,
          "Date": "2021-09-27T12:58:53.000Z",
          "Titre": "Motorola Radios",
          "Contenu": "I purchased 6 Motorola radios after searching the internet for the best place to purchase from. My customer experience was exceptional. An actual person called once the order was placed and went through the programming requirements and the radios were shipped immediately. I highly recommend Two Way Radio!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charlie",
          "Nb_Reviews": 1,
          "Date": "2021-11-24T16:44:15.000Z",
          "Titre": "I had made a mistake on the number of…",
          "Contenu": "I had made a mistake on the number of channels I needed and this supplier went out of their way to correct my mistake at no cost to me saying they wanted my repeat business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kim L Knight",
          "Nb_Reviews": 2,
          "Date": "2023-06-22T04:36:56.000Z",
          "Titre": "Great Service",
          "Contenu": "Great Service, pricing and equipment.  Looking forward in utilizing your services for our business needs"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julie",
          "Nb_Reviews": 2,
          "Date": "2021-11-30T16:47:08.000Z",
          "Titre": "Two Way Radio Gear always responds…",
          "Contenu": "Two Way Radio Gear always responds quickly and ships same day when possible.  I use them for all our farm radio needs!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sherman",
          "Nb_Reviews": 1,
          "Date": "2021-11-29T19:46:55.000Z",
          "Titre": "If I could give 10 Stars I would!",
          "Contenu": "If I could give 10 Stars to Two Way Radio Gear, I WOULD! They are the epitome of professionalism and expertise. They understand how business gets done and conduct themselves in a manner that is optimum for their customers as opposed to just themselves.They offer a demo program that allows potential clients the opportunity to trial FULLY working radios in the field to verify that the coverage areas extend to where they need it. The pricing is completely justifiable to even the most cost-conscious CFO, and the nation-wide coverage (yes, I took the demo units all over the country, from east to west coasts and points in between) is a boon to companies such as ours that have projects far and wide.And I would be remiss if I didn't mention the excellent customer support - I had a question at 5:15pm on a Friday evening and was able to get Tony on the phone to walk me through the portal and reactivate a radio that I had screwed up the programmable features on. That is service above and beyond.I wholeheartedly recommend Two Way Radio Gear to all my subs and to anyone who needs PTT service that just plain works without the hassles of FCC license filings and/or constant frequency reprogramming of multiple radios."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ray",
          "Nb_Reviews": 1,
          "Date": "2021-11-17T20:41:18.000Z",
          "Titre": "The most knowledgeable",
          "Contenu": "The most knowledgeable, patient and helpful people in the business!They are now my only vendor for anything communications."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Mcclernan",
          "Nb_Reviews": 4,
          "Date": "2021-06-10T18:59:44.000Z",
          "Titre": "Tony was AWESOME",
          "Contenu": "Tony was AWESOME. Love my Wave radios for my Detective Company. Life is much easier with the Waves! Thanks Tony!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maria A",
          "Nb_Reviews": 1,
          "Date": "2021-05-10T12:29:24.000Z",
          "Titre": "Customer service is great and…",
          "Contenu": "Customer service is great and explaining everything and helping you to get what you need for the best quality and best price"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Diego",
          "Nb_Reviews": 1,
          "Date": "2021-10-11T15:52:32.000Z",
          "Titre": "Two Way Radio",
          "Contenu": "Two Way Radio, has great Customer Support. Every time there has been a problem, I just call or email Josh and I get help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2021-05-12T13:46:03.000Z",
          "Titre": "Website very useful",
          "Contenu": "Website very useful. Easy to find what I was looking for. Shipping was quick with package following."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jenn",
          "Nb_Reviews": 2,
          "Date": "2021-04-09T16:15:04.000Z",
          "Titre": "Great Solutions!",
          "Contenu": "Everyone I spoke to at this company was extremely helpful!  It was a pleasure doing business with them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony",
          "Nb_Reviews": 1,
          "Date": "2021-04-02T15:01:12.000Z",
          "Titre": "I ordered 6 radios with headphones and…",
          "Contenu": "I ordered 6 radios with headphones and was treated with respect and my order reached me on time and as ordered..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2021-05-08T03:15:30.000Z",
          "Titre": "So glad I saw these at the florida tow…",
          "Contenu": "So glad I saw these at the florida tow show.  They work great and crystal clear reception.  I will be ordering more very soon!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anon",
          "Nb_Reviews": 1,
          "Date": "2021-06-06T16:01:23.000Z",
          "Titre": "Excellent",
          "Contenu": "Best pricing and the level of customer service has been refreshing. You have earned my loyalty."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2021-09-15T18:53:50.000Z",
          "Titre": "4 radios",
          "Contenu": "I received exactly what I ordered and they work great. I will order more from this company if the occasion arises."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Floyd “Flip” Metz",
          "Nb_Reviews": 1,
          "Date": "2021-12-31T15:32:20.000Z",
          "Titre": "A great company to do business with…",
          "Contenu": "A great company to do business with service is prompt there was nobody better in the system from the north east from Boston to Florida Florida Texas Texas to California this is the company to deal with with two way radios"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ted",
          "Nb_Reviews": 2,
          "Date": "2021-08-23T23:46:11.000Z",
          "Titre": "Exceptional service!",
          "Contenu": "Friendly staff, efficient, very knowledgeable.  Order was filled and shipped quickly, and the order was accurate."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jimmy",
          "Nb_Reviews": 2,
          "Date": "2021-04-09T15:48:43.000Z",
          "Titre": "I love working with this company",
          "Contenu": "I love working with this company!  Service is always prompt!  Customer service is Top Notch!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 2,
          "Date": "2022-06-10T18:58:20.000Z",
          "Titre": "Easy to order",
          "Contenu": "Easy to order. Items arrived as expected. Great service. Never disappointed when I’ve ordered before."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thank",
          "Nb_Reviews": 1,
          "Date": "2021-11-30T14:46:24.000Z",
          "Titre": "Very helpful and great service.",
          "Contenu": "Very helpful and great service.Provided advice that assisted in making the correct decision."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 2,
          "Date": "2021-07-01T13:33:33.000Z",
          "Titre": "Joe was a great help in giving me what…",
          "Contenu": "Joe was a great help in giving me what i was looking for in the radios , which help me to sell them to my customer Great people to do business with"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Grant Ebensteiner",
          "Nb_Reviews": 1,
          "Date": "2023-01-26T18:57:38.000Z",
          "Titre": "Works perfect",
          "Contenu": "Works perfect, I will order another one from here if ever needed"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephanie D'Arcy",
          "Nb_Reviews": 1,
          "Date": "2022-05-04T19:39:14.000Z",
          "Titre": "Quick and easy ordering",
          "Contenu": "Quick and easy ordering.  Shipment came very quickly.  Excellent prices. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lowell Hardin",
          "Nb_Reviews": 4,
          "Date": "2021-05-07T20:32:04.000Z",
          "Titre": "Great Team",
          "Contenu": "I enjoy working with the team at Two Way Radio Gear. They are friendly and have extremely prompt service."
        }
      ]
    }
  ]
}