{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "typhur.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "FL rider",
          "Nb_Reviews": 7,
          "Date": "2023-12-06T18:56:49.000Z",
          "Titre": "TYPHUR App is dangerously intrusive…",
          "Contenu": "TYPHUR App is dangerously intrusive demanding access to contacts, emails, photos and videos, and access to your entire phone. What the ... !!! Communist chinese made device with app taking all your personal data and shipping it to communist china and the world. NO THANKS TYPHUR. Now go subvert your own phones. Leave ours alone. You should be ashamed of yourselves.SIDENOTE:  Trustpilot removed my initial review citing ILLEGAL OR HARMFUL content.  What a surprise!  Perhaps this communist chinese company influenced Trustpilot.  That is especially dangerous since Denmark has strict privacy laws for its citizens.  I guess Trustpilot does not care about anyone outside Denmark.  NOTED"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scott Tibbetts",
          "Nb_Reviews": 4,
          "Date": "2023-12-06T16:33:17.000Z",
          "Titre": "Terrible Service!",
          "Contenu": "Placed Order 11/23.  Get a notice 11/24 shipping label created and a tracking number.  Keep checking tracking and no change since label created.  Now two weeks later and no change.  Sent email to Typhur support and no reply.  Service sucks!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "FLPirate",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T15:23:17.000Z",
          "Titre": "I have been waiting for my order since…November 18",
          "Contenu": "I have been waiting for my order since I placed the order on November 18. Tracking information indicates the package is in Miami since November 28.There was a security issue with my order. My mailing address differed from my indicated network location. I responded to the request to clarify the discrepancy on November 23 via email that I use a VPN service. I also called and left messages after that since I had not heard back from customer service.Customer service is not one of your companies fortes. I have made four attempts to contact customer service without much success using phone and email messages. It was only until yesterday that someone attempted to contact me via a phone call. No one has responded to my original email message requesting a reply."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T15:39:32.000Z",
          "Titre": "Never received product",
          "Contenu": "Never received product. Please credit my card"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rudolph Hennigan",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T14:20:23.000Z",
          "Titre": "I still don't have my thermometer after over a week.",
          "Contenu": "I still don't have my thermometer.I believe your shipping has not sent me any kind of tracking and I am kind of wondering what went with my money.I received no incentive to write this review."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bladimir Garza",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T06:24:07.000Z",
          "Titre": "Not worth it",
          "Contenu": "Finaly, I got to use the probe and it was a huge disappointment. It didn't show the right temperature. So instead of getting medium rare it came out well done. Probe 1 was overheating, so I pulled the stake and probe out at 92C from the 2 inch thick ribeye and noticed no juices coming out. I let it rest for about 15 minutes before cutting it up. Well done. Not impressed at all. Not worth the price."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Wagner",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T03:26:05.000Z",
          "Titre": "Ordered on November 29",
          "Contenu": "Ordered on November 29, package still awaiting pick up by USPS as of December 6th."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ronald Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T19:54:00.000Z",
          "Titre": "Stuck in Shipping",
          "Contenu": "Ordered on 11/24. Today is 12/2 and my product is still sitting in Southern California waiting to be picked up by USPS."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joe Maiurano",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T14:01:18.000Z",
          "Titre": "The service is horrible",
          "Contenu": "The service is horrible. The product may be good, but I have not even used it but the service, the website is absolutely horrendous and difficult to use."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sean Cline",
          "Nb_Reviews": 1,
          "Date": "2023-04-26T21:40:49.000Z",
          "Titre": "Perfect Probe",
          "Contenu": "Updated review, I was able to get a new probe and it is awesome!! The customer service in fixing my issue was outstanding. It's nice to see people still personally care about their companies. The new probe arrived just in time for a barbecue competition and it works great. The display is amazing, nice and bright in the sunlight and dark. Thank you for everything!! I will pass this along to everyone I come in contact with that cooks."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Aubrey Parsons",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T14:41:08.000Z",
          "Titre": "Haven't received the thermometer that i…",
          "Contenu": "Haven't received the thermometer that i ordered before Thanksgiving."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Oleg",
          "Nb_Reviews": 4,
          "Date": "2023-04-10T12:41:03.000Z",
          "Titre": "An email to the company was ignored.",
          "Contenu": "I have sent an email to the company describing the issue- the email was Ingred. I received the thermos probe a little while ago.Did not open it right away, as I was traveling.However, I am cooking a roast today, so had a first chance to try it.My problems with it started even before I had a chance to actually use it.Following the instructions, I unscrewed the battery cover, and pooled at the screw, expecting the cover to lift.Instead, the screw came out – battery cover did not.I tried prying it out with fingers, nail, a tiny screwdriver – nothing works. The cover stayed on as if glued.I was able to pry it open by using a small pin, but scratched the cover (and my fingers) in the process.I inserted batteries and replaced the cover. The cover fits too tight (so I WILL have more headache when the time comes to change the batteries) – which on one hand is great, as it prevents moisture getting in, than, you should have designed the screw in such a way, that it cannot be pulled out at all. Even then, it is too difficult to open the cover, using the screw as a handle. This issue may be unique to this particular probe – that I do not know."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tim Darrin",
          "Nb_Reviews": 3,
          "Date": "2023-06-16T03:09:18.000Z",
          "Titre": "Where is my order",
          "Contenu": "Where is my order?  It says it was delivered but it’s not here at this address.  Nothing can be stolen from this house, so don’t think it was.  Where is tracking information?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mitchell Klein",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T15:56:56.000Z",
          "Titre": "Don’t know.",
          "Contenu": "Don’t know..  it has not arrived yet!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Douglas Shorb",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T22:36:24.000Z",
          "Titre": "Forces rest period, This is not a tool, it's an experiment.",
          "Contenu": "I am sorely disappointed by the arrogance of your design team. Their failure to actually imagine there is any other use case for this thermometer then cooking a steak show how little you know about your customers.   The case in point is that the thermometer FORCES a rest time. If I want to set my temperature to 150 degrees, why are you stopping it at 142 forcing a resting time. Not everything I cook has a MANDORY rest period.  I’m not saying that the thermometer doesn’t have some nice features, but now I need to compensate for your design teams lack of vision."
        },
        {
          "Note": 2,
          "Lieu": "SA",
          "Pseudo": "mohammed kholidan",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T09:09:19.000Z",
          "Titre": "Apps",
          "Contenu": "Products looks amazing haven't used it yet cuz im still super disappointed about the apps for both devices can't be used unless US OR UK resident."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "renato rodriguez",
          "Nb_Reviews": 2,
          "Date": "2023-06-09T18:39:26.000Z",
          "Titre": "the construction is very fragile…",
          "Contenu": "the construction is very fragile looking compared to the thermapen. I am not sure if your product will hold out for the long run. The thermapen is still constructed better."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Clay M",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T15:00:29.000Z",
          "Titre": "Item was missing. Shippers refused to help.",
          "Contenu": "**UPDATE** The box was finally delivered without notice 6 DAYS after all tracking information said it had been. My address was on the label where the return address would normally be and where the delivery address would be was an aggressive message about lithium-ion batteries not being allowed on passenger aircraft. I increased my star rating a bit because this all looks to be the fault of the shipper. Free shipping is great and all, but I'd have happily paid to avoid all this.I have no idea who Swiship is. I got no shipping updates then all of a sudden it went from \"Package left seller's premises\" to \"Oh... actually we delivered it two days ago\". I didn't get a package to my letterbox, package delivery area, and the nosy old ladies in my condo complex confirmed no packages had been delivered. Swiship customer support refused to help and forwarded me to Amazon Logistics. Amazon Logistics refused to help and forwarded me to Swiship. Neither would or could provide actual proof of delivery. Guess I'm just out $200. From now on I'll have to ensure I buy from a company that uses FedEx, UPS, USPS, someone reputable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bruce Kennedy",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T05:34:20.000Z",
          "Titre": "Products works great",
          "Contenu": "Products works great. Have done two cooks. First was thick strip steak and the other a boneless turkey breast. Both turned out o expectations. Tender and juicy. Easy to use and set up. Only issue was a slightly longer shipping time than presented but understand the seasonal issue. Recommend over the other popular remote thermometer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Mulder",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T19:41:01.000Z",
          "Titre": "Quality product",
          "Contenu": "Quality product, visually pleasing, and intuitive. Had some issues on initial use trying to reset temp and probe placement. Didn't know how to restart 1 probe while leaving the other alone. Not a huge deal but it was Thanksgiving and made me nervous.  Most likely user error."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dana Horner",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T17:46:31.000Z",
          "Titre": "The unit is very good looking",
          "Contenu": "The unit is very good looking. I am disappointed that there was not a cookbook included."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jean Souliere",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T16:32:07.000Z",
          "Titre": "Well built machine",
          "Contenu": "Solid, made from quality materials, very easy to clean and maintain, a very well built machine.  Large flat basket capacity is good for larger portions and promotes even cooking.  Single basket configuration makes this air fryer an excellent compliment to your kitchen, but if you are looking for full meal from one device convenience this is not your machine.  You are paying for quality build and aesthetics, it performs no better or worse than other more mainstream options.  It's a premium product, I am glad I purchased it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Dory",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T15:16:22.000Z",
          "Titre": "Wonderful thermometer and looks great!",
          "Contenu": "Wonderful thermometer and looks great!! Easy to use and works great. Gave four stars because it is not pocket friendly. The probe doesn’t click into anything to hold it down. Would still buy again and recommend……update after almost a month…..my friends probe broke at the hinge and my battery cover is breaking. Neither have been dropped and we work in a high end restaurant. Can not have these break so fast. Cool design, not built for professional use, at least in a kitchen"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Luis Garcia",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T16:18:18.000Z",
          "Titre": "Love the product just hope when they…",
          "Contenu": "Love the product just hope when they make the next one they find away to protect the prob it would get stuck or pinch on my chef coat pockets but man what a great and accurate reading product"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Forest Young",
          "Nb_Reviews": 1,
          "Date": "2023-05-21T20:36:03.000Z",
          "Titre": "Packaging and demos are great / probe…",
          "Contenu": "Packaging and demos are great / probe reader shut off at 459 degrees while trying to get pan to 545 / I’ve since purchased an ambient temp reader but was expecting the 572 range to hold for spot measures"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kevin Gentry",
          "Nb_Reviews": 1,
          "Date": "2023-05-27T17:06:02.000Z",
          "Titre": "I'd give it a 4.5",
          "Contenu": "I'd give it a 4.5. Half a point removed for not having a protective slot for the tip."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eric Runyon",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T14:27:34.000Z",
          "Titre": "Temperature reading blinks",
          "Contenu": "Beautiful thermometer.  Temperature reading flashes instead of staying solid on the screen."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chef Randolph",
          "Nb_Reviews": 4,
          "Date": "2023-12-06T16:04:15.000Z",
          "Titre": "A category of one!",
          "Contenu": "As a chef I have had dozens of instant read thermometers over the years. Most professionals consider them as a consumable because manufacturers are constantly trying to cut costs in what has been a race to the bottom. None of the ones on the market last very long. Typhur went the other direction. They set out to build a serious tool for professionals and they succeeded. I will update this review in six months but it's my expectation is this will be the last one I have to buy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deborah Hayes",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T12:28:58.000Z",
          "Titre": "I saw this product on utube",
          "Contenu": "I saw this product on utube. The fellow was cooking a turkey.  It worked just as he described.  I also used \"meater \" thermometer set. Don't waste your money on the \"meater\", just purchase typhur thermometer set."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harry Dudley",
          "Nb_Reviews": 4,
          "Date": "2023-12-01T17:39:34.000Z",
          "Titre": "HIGH Quality Wi-Fi / Bluetooth thermometer",
          "Contenu": "Other than an extended wait for delivery due to Black Friday,l the unit arrived in good order. It is sure high quality unit and I have set it up for both Bluetooth  and Wi -Fi but have not yet used it on a cook. Can't wait. I am very impressed with the feel and quality of the product and can't wait to use oit."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeffrey Y",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T04:16:34.000Z",
          "Titre": "Fantastic thermometer, joy to use.",
          "Contenu": "Shipped fast. Device feels very high quality. UI is intuitive and works well. App is nice and simple. Thermometers are easy to use, responsive, and accurate. Hopefully they continue to work for years to come. Only nitpick is the probes are a little thick, but that shouldn't matter nearly always."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J Rizzutto",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T02:49:37.000Z",
          "Titre": "I saw this product on YouTube…",
          "Contenu": "I saw this product on YouTube ThatDudeCanCook.  It looked amazing. My husband LOVES IT!!!  He used it the next day on a chicken he cooked in his smoker.  He was very happy that it could handle temps up to 700.  Thanks!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-12-05T20:19:07.000Z",
          "Titre": "Best instant read I’ve experienced",
          "Contenu": "Another instant read as a gift for my Dad, the best instant probe I’ve experienced"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patrick Dix",
          "Nb_Reviews": 3,
          "Date": "2023-12-07T02:18:40.000Z",
          "Titre": "I've had good luck with the handheld…",
          "Contenu": "I've had good luck with the handheld thermometer.  I'm hoping for the same experience from the wireless thermometer!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Loreto Doucet",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T22:31:55.000Z",
          "Titre": "So easy.",
          "Contenu": "Hi,Your Sousvide is amazing. I really lake it!!!!Everithing is perfect. The time, the package is perfect, the machine is beautiful.Yesterday i make my ferst recipe. I make the pork tenderloin and is spectacular!!!Many thanks!!!!Loreto Doucet."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 2,
          "Date": "2023-11-23T18:40:13.000Z",
          "Titre": "High quality product and wifi/bluetooth…",
          "Contenu": "High quality product and wifi/bluetooth connectivity works flawlessly. Previously, used the Meater probe and struggled keeping it paired with my phone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas Black",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T12:20:59.000Z",
          "Titre": "I have received the product",
          "Contenu": "I have received the product, it's definitely next level in its look and function, I am having my kitchen remodeled at this moment and cannot wait to use it, I will rate its performance then but for now I will give it ⭐⭐⭐⭐⭐  for its modern design,look and function"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Philip Ferrara",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T03:35:16.000Z",
          "Titre": "Used the wireless meat probes twice…",
          "Contenu": "Used the wireless meat probes twice now.  Super accurate and convenient on both phone and base unit.Fast shipping and package was really nice as a gift"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roger Webster",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T06:14:47.000Z",
          "Titre": "Received a prompt response from support…",
          "Contenu": "Received a prompt response from support regarding a bluetooth issue and updating the app to support the newest version of Android 14. Thank you again and for a great product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Gondara",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T17:21:28.000Z",
          "Titre": "Game Changer",
          "Contenu": "The product is simply exceeding at all levels. I delayed purchasing air fryer all this time because there wasn’t one available that would meet my requirements. Typhur Dome not only met but exceeded my expectations. Aesthetics, size, technology, speed, quietness, everything matters …and this product delivers on all these factors!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KATHERINE  HINDS",
          "Nb_Reviews": 2,
          "Date": "2023-11-19T21:18:59.000Z",
          "Titre": "I own the Instaprobe and recently…",
          "Contenu": "I own the Instaprobe and recently purchased the Sync. The instaprobe is the most useful tool in my food truck. I recently purchased the Sync to use for our bbq. This tool frees up a lot of my time. Because of the ambient temperature feature. I know when it time to ass more wood to the fire."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christie Watkins",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T12:33:45.000Z",
          "Titre": "EXCELLENT AIR FRYER",
          "Contenu": "EXCELLENT AIR FRYER. I had one before but returned it because I was not satisfied. The food turned out unevenly cooked and nothing like I expected so I was a bit hesitant with this purchase and prepared to return it as well!  Instead the food turns out juicy, evenly cooked and full of flavor!  I’m extremely happy with my purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Helen J.",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T16:34:50.000Z",
          "Titre": "Great product!",
          "Contenu": "I love my new air fryer! I replaced my old with Typhur because of its size and speed. The day I received it I made buffalo wings for the whole family and they came out fantastic! The only downside of this product is its weight. But if you’re leaving it on your counter, there would be no issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wayne Hodge",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T10:35:58.000Z",
          "Titre": "Don’t cook with out it!!",
          "Contenu": "This cooking tool takes all the guess work out of cooking baking and grilling"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T15:52:20.000Z",
          "Titre": "I like the quick response."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adison Purchase",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T03:54:01.000Z",
          "Titre": "This is my second time ordering from…",
          "Contenu": "This is my second time ordering from Typher and it went even smoother than the first."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 3,
          "Date": "2023-11-21T17:18:44.000Z",
          "Titre": "Works great",
          "Contenu": "Great looking product, easy to use, very accurate."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "V Charles Misail",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T17:35:34.000Z",
          "Titre": "Typhur: Two for Two",
          "Contenu": "I have two of Typhur's products: their InstaProbe thermometer and newly released Dome air fryer. Both are rock-solid in build quality, incredibly well-suited in what they do, easy to use (and pretty cool looking, if you can consider a thermometer or air fryer to be \"cool looking.\")I hope they continue to expand their design philosophy into other products. So far, these are winners."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ricky Bornemeier",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T15:20:27.000Z",
          "Titre": "They were delivered fast.",
          "Contenu": "They were delivered fast.They are hot tho when pulled out so be careful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "christine cooper",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T04:55:07.000Z",
          "Titre": "The Dome is awesome!",
          "Contenu": "Our Dome was packed perfectly. We love the dome and it has only been 3 days. Game changer in our house! Very easy to use, clean, and enjoy. Excellent product worth every penny."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mohamad Dbouk",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T13:40:52.000Z",
          "Titre": "Amazing product"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 2,
          "Date": "2023-07-19T02:28:36.000Z",
          "Titre": "Fantastic customer service",
          "Contenu": "I had dropped my insta probe right after I purchased it and it broke. called customer service. Not only did they immediately call me back but refunded my money and sent me a new unit. Top notch customer service!!! I will purchase again!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John P Griffin",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T14:48:10.000Z",
          "Titre": "Very pleased with my purchase",
          "Contenu": "The device arrived very well packaged. The instructions were very clear and the device performed as expected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bradley Mendelson",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T12:20:07.000Z",
          "Titre": "I have had air fryers before",
          "Contenu": "I have had air fryers before.  This one works faster and its tray size allows for air frying more at the same time.  Easy to operate."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony Armstrong",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T20:07:47.000Z",
          "Titre": "The New Standard",
          "Contenu": "Fulfillment and Shipping were quick, and the product is exactly as described! This will be my go-to tool to measure temperatures for liquids, and foods in the oven, on the stove, or on my smoker outside. The quickness of the reading and the enhanced visibility is outstanding!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Reid Mason",
          "Nb_Reviews": 1,
          "Date": "2023-07-01T05:46:25.000Z",
          "Titre": "The item arrived quickly and in perfect…",
          "Contenu": "The item arrived quickly and in perfect working condition. I was able to hand it over to my church so they could get a head start on their upcoming cook-outs and holiday get-togethers, and they plan of making good use of it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen Anderson",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T00:40:33.000Z",
          "Titre": "Updated",
          "Contenu": "I found the typhur to be fast and accurate as described. However I was disappointed that having had it about 3 months, the plastic at the base holding the probe broke. They were very responsive to my email about the problem and sent me a new one in less than a week! Great service and a great product!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fred",
          "Nb_Reviews": 2,
          "Date": "2023-06-10T01:35:22.000Z",
          "Titre": "Don’t usually do reviews",
          "Contenu": "Don’t usually do reviews. But this product deserves one. Having real instant read is exceptional. I never have gloves in so it really makes a difference. Great product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JOSEPH MEEHAN",
          "Nb_Reviews": 2,
          "Date": "2023-09-19T17:21:06.000Z",
          "Titre": "Delivered at promised time",
          "Contenu": "Delivered at promised time. Very well packaged not a chance of damage. Makes amazing wings as advertised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Russell Reese",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T19:10:49.000Z",
          "Titre": "Sale and delivery were smooth and…",
          "Contenu": "Sale and delivery were smooth and timely."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Chasteen",
          "Nb_Reviews": 2,
          "Date": "2023-05-07T17:18:22.000Z",
          "Titre": "Best instant read thermometer I’ve ever…",
          "Contenu": "Best instant read thermometer I’ve ever owned.  It’s sleek easy to use and very quick results.  It’s pricey but worth it when you compare replacement of multiple cheaper units."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Troy Tandy",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T15:40:11.000Z",
          "Titre": "The speed of this thermometer is a game…",
          "Contenu": "The speed of this thermometer is a game changer.  Have been using the “other” instant read thermometer for over a decade and have been blown away with the visibility, speed and accuracy of the Typhur thermometer!  Never going back."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Murray",
          "Nb_Reviews": 2,
          "Date": "2023-10-26T19:42:46.000Z",
          "Titre": "Best digital thermometer I've ever tried!",
          "Contenu": "Best digital thermometer I've ever tried! The very first day it arrived, I was cooking a 3 lb \"spoon roast\" on my 3 burner grill. I had tried other digital thermometers, but Typhur's instant temp. intrigued me. All the other digital thermometers basically failed. With the Typhur I liked that it powers by 2 AAA batteries. I don't have to rely on having it USB charged [so many times my previous digital thermometers were not up to the charge leaving me frustrated that I hadn't planned ahead] Here you just make sure you have 2 AAA batteries and you are ready no matter when.  As soon as I popped in the 2 batteries, the extended probe immediately showed me the current air temperature. To turn it off I simply moved the probe alongside the unit. Getting back to my roast. It hadn't been thoroughly defrosted [as we realized], so when I had the grill hot enough, I turned off the middle burner, lower the left and right burners to about 50% [I've learned that I get a pretty steady 375-400°F heat as I would in an oven.]  The Typhus worked extremely well. After 30 minutes, I usually insert our oven thermometer into the roast. I use it as a rough guide, but when I inserted the Typhur, the read was immediate, and because the roast was still cold in the center, the Typhur read was a lot less than the oven thermometer.  Which one did I trust?  Well, I took off the roast when the oven thermometer reached over 170°F; the Typhur was a lot less [sorry, I don't recall the actual temp.]. I hadn't trusted the Typhur, but when I took the roast off, let it sit for awhile, and then sliced into it, it was dark red at the end...not good. Fortunately, I hadn't shut down my grill. I put the roast back on and waited for the Typhur to read around 170° [we like it to be closer to medium]. It came out perfectly! [note: I did NOT leave the probe in; you are instructed not to; I inserted the probe in the thickest part of the roast for only a brief moment from time to time because the reading on the unit is immediate, not necessary or needed to leave the probe in as in the case for the oven thermometer.  So, my first experience with the Typhur proved to be quick and accurate for me.  Plus, it is magnetic so the unit can conveniently stay near me where I have steel back door next to my grill. [I do take it in after and it stores in my basement on the post of my metal cabinets.]  I plan on purchasing 2 more Typhur thermometers for Christmas presents for our 2 adult daughters."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sharon  Kerr",
          "Nb_Reviews": 2,
          "Date": "2023-05-21T23:51:01.000Z",
          "Titre": "Searched online reviews on meat…",
          "Contenu": "Searched online reviews on meat thermometers. Found great reviews on your product. Eady to order. Received quickly. Have used it twice and very pleased."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sara H",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T16:05:40.000Z",
          "Titre": "Fast delivery",
          "Contenu": "Fast delivery, great service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adison Purchase",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T23:13:56.000Z",
          "Titre": "So far it has been great.",
          "Contenu": "The customer support was quick to respond when ordering and everything arrived undamaged and in a reasonable time frame."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Torland Wingfield",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T20:55:03.000Z",
          "Titre": "Great fast service with no issues",
          "Contenu": "Great fast service with no issues.  product is as advertised, fast and very high quality."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicholas Moscato",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T16:15:44.000Z",
          "Titre": "Very nice air fryer draw could’ve been deeper Draw should’ve came out even with the counter",
          "Contenu": "Very nice air fryer. Draw could’ve been deeper. The draw should’ve came out even with the countertop. I couldn’t even fit a baked potato in it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ronda Fields",
          "Nb_Reviews": 2,
          "Date": "2023-10-24T17:18:48.000Z",
          "Titre": "Great Company!",
          "Contenu": "They were quick to help me and I appreciate that."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elizabeth Bagwell",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T14:09:23.000Z",
          "Titre": "It was amazing how it cooked chicken…",
          "Contenu": "It was amazing how it cooked chicken wings"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-11-15T03:59:13.000Z",
          "Titre": "Product exceeded expectations",
          "Contenu": "Product exceeded expectations. Fastest instant read thermometer I’ve used!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T16:06:55.000Z",
          "Titre": "Typhur Dome Air Fryer",
          "Contenu": "Quiet and does not blow hot air into the room like other air fryers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Arndt",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T16:36:43.000Z",
          "Titre": "Fast and accurate",
          "Contenu": "Big display, can use protection of some sort for the tip when not in use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MAGDY M Abdelmoneim",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T15:25:40.000Z",
          "Titre": "It was amazing to use that thermometer…",
          "Contenu": "It was amazing to use that thermometer with such ease and fast reading"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rodney Parks",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T16:41:20.000Z",
          "Titre": "I like the the monitor looks like it's…",
          "Contenu": "I like the the monitor looks like it's in good quality used at one time so far so good"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 2,
          "Date": "2023-07-17T05:17:13.000Z",
          "Titre": "Nice Temp Probe !",
          "Contenu": "The product arrived quickly , and was as described . I am happy with this temp probe , and would recommend it !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larry W",
          "Nb_Reviews": 2,
          "Date": "2023-10-29T22:53:57.000Z",
          "Titre": "Fast",
          "Contenu": "Oh, it's fast just as advertised. Wow"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chase Jordan",
          "Nb_Reviews": 2,
          "Date": "2023-04-25T22:06:47.000Z",
          "Titre": "Outstanding product",
          "Contenu": "Outstanding product. Light speed and beautiful. Acura vu is spot on. We use it daily and I love the magnet. You can keep it close at hand."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Dayton",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T21:46:30.000Z",
          "Titre": "Typhur Temperature probe is great!!",
          "Contenu": "The Typhur temperature probe works great.   Very quick and accurate.  Very easy to read!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gary Bisdorf",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T23:45:25.000Z",
          "Titre": "They solved my issue"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Tann",
          "Nb_Reviews": 2,
          "Date": "2023-06-26T03:37:18.000Z",
          "Titre": "Received order quickly",
          "Contenu": "Received order quickly. Haven't had an opportunity to get to use your thermometer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jerold",
          "Nb_Reviews": 6,
          "Date": "2023-04-17T14:07:17.000Z",
          "Titre": "Expensive but WORTH it!",
          "Contenu": "Beautiful design and ease of use. Love the magnetic feature. Super rapid."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kelly Lewis",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T12:31:56.000Z",
          "Titre": "Best In Class",
          "Contenu": "I do not cook anything without the Typhur probe by my side.This is a great product and love that it’s waterproof"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas McConnel",
          "Nb_Reviews": 5,
          "Date": "2023-06-22T22:37:54.000Z",
          "Titre": "Product arrived very fast",
          "Contenu": "Product arrived very fast. That thermometer is wicked fast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maurice Ann Morris",
          "Nb_Reviews": 2,
          "Date": "2023-05-10T09:01:04.000Z",
          "Titre": "Everything worked pretty well through…",
          "Contenu": "Everything worked pretty well through Shop. I haven’t liked Shop in the past but it worked well this time with the tracking and updates."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PB",
          "Nb_Reviews": 2,
          "Date": "2023-04-20T20:00:21.000Z",
          "Titre": "This tech is so cool!",
          "Contenu": "This tech is so cool. Plus you’ve made it magnetic so it sticks right in my fridge. I always know where it is."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T21:21:40.000Z",
          "Titre": "Got a thermometer from these guys and…",
          "Contenu": "Got a thermometer from these guys and it’s crazy fasts."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Douglas Albers",
          "Nb_Reviews": 5,
          "Date": "2023-07-02T01:58:41.000Z",
          "Titre": "Timely delivery and the product was as…",
          "Contenu": "Timely delivery and the product was as advertised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AA",
          "Nb_Reviews": 6,
          "Date": "2023-10-03T15:30:26.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use, even for my kids. And so quiet and washing it is pretty simple. We love it!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stuart Whitten",
          "Nb_Reviews": 2,
          "Date": "2023-06-17T20:45:14.000Z",
          "Titre": "So far working as advertised.",
          "Contenu": "So far working as advertised.It’s quick!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shelley Slack",
          "Nb_Reviews": 1,
          "Date": "2023-06-17T12:17:13.000Z",
          "Titre": "I love my Typhur Instaprobe!!",
          "Contenu": "I love my Typhur Instaprobe!!! I would highly recommend!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Simeon Grater",
          "Nb_Reviews": 22,
          "Date": "2023-06-27T14:51:36.000Z",
          "Titre": "A great new product.",
          "Contenu": "Beautifully made, accurate as advertised.I am VERY pleased."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "K.Boettner",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T14:08:55.000Z",
          "Titre": "Customer service was awesome and the…",
          "Contenu": "Customer service was awesome and the product is amazing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lois Eaglin",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T04:08:30.000Z",
          "Titre": "A very good product to have."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven P",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T04:43:27.000Z",
          "Titre": "Works Great",
          "Contenu": "Quick and accurate. Best one I’ve used so far."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hans",
          "Nb_Reviews": 6,
          "Date": "2023-11-18T14:27:29.000Z",
          "Titre": "Good construction and accurate"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda Wilson",
          "Nb_Reviews": 1,
          "Date": "2023-06-10T04:11:07.000Z",
          "Titre": "Your product is excellent"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barry Cofield",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T11:49:51.000Z",
          "Titre": "Good product and experience"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Brown",
          "Nb_Reviews": 4,
          "Date": "2023-04-28T14:37:38.000Z",
          "Titre": "This tool is incredible",
          "Contenu": "This tool is incredible.  The engineering and quality are impeccable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charlie Plumley",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T15:19:35.000Z",
          "Titre": "Love it so far"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joshua Manis",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T01:40:02.000Z",
          "Titre": "Shipped promptly and works like magic."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter Giglio",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T13:04:11.000Z",
          "Titre": "Great product",
          "Contenu": "Great product. Would order an again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew",
          "Nb_Reviews": 3,
          "Date": "2023-04-10T14:33:36.000Z",
          "Titre": "Amazing product and customer service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Francisco Mangoba",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T00:14:15.000Z",
          "Titre": "Cool to used easy to use thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryan Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T18:17:10.000Z",
          "Titre": "Great product",
          "Contenu": "As advertised.  Awesome."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff Finney",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T23:28:02.000Z",
          "Titre": "Great temp probe"
        }
      ]
    }
  ]
}