{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "uk.crucial.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "STEPHEN RYAN",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T15:12:59.000Z",
          "Titre": "I ordered 2 nvme T500 drives on…",
          "Contenu": "I ordered 2 nvme T500 drives on 8December for my sons birthday on 19th thinking they were coming from UK stock. Now the 20th and still no drives, frdex has shown customs delay since 13th december, called customer support 3 different days and told to wait 5 business days, each customer rep HUNG UP on me when I explained my sitiluation .  Fedex said its out of their hands....not impressed, i have built many pc' and used MX  and BX drives , ballistix memory etc all came from uk stock in days , time for a rethink 🤬 Also how is it in UK we must pay for priority shipping and in europe its free shipping ????**** YOU SAY YOU HAVE REQUESTED MORE INFO FROM ME BUT YOU HAVENT SAID WHERE OR HOW ****"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Alex",
          "Nb_Reviews": 49,
          "Date": "2023-12-22T00:07:36.000Z",
          "Titre": "Promised refund non existent",
          "Contenu": "I received some RAM which I realised I didn’t need shortly after ordering but the product arrived.I set up an RMA with Crucial for the unopened product and Crucial accepted the return.I sent the item Royal Mail Special Delivery and have contacted many times chasing the refund.Customer services kept saying it will be with you soon, wait until x date. So I then contact them on that date and they said we promise it will be with you by two days ago.No refund received. Contact Crucial customer services and they said they will now escalate it and the refund will be processed within 24 hours.Have I received a refund? No. I have to keep chasing and provide the same information over and over again.I am thinking of reporting Crucial to the trading standards as by law they must refund me in a swift manner, and this has been going on over a month now.Beware!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Tomasz Czeczennikow",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T15:00:40.000Z",
          "Titre": "Poor customer service. Long delivery",
          "Contenu": "I placed an order for an SSD hard drive and RAM with Crucial on December 1, 2023, with an expected delivery time of 5 business days. Unfortunately, it took them 19 days to deliver my package, greatly exceeding the promised timeframe. Moreover, I had to proactively reach out to customer service to obtain a tracking number, which should have been provided promptly after the order. The customer service consultant I spoke to was not only unhelpful but also exhibited rudeness. Overall, my experience with Crucial was disappointing and did not meet the standards one would expect from a reputable company."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "andy webster",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T22:34:12.000Z",
          "Titre": "Crucial-----so so dissapointing. avoid",
          "Contenu": "ordered 2 banks of ddr4  and am waiting, and waiting, and waiting, it is currently held at stanstead airport where its been for the last 4 days. if i knew this i would never have orderd of this company. i thought they were a well respected company, how wrong i am.  i need this ram asap, and i fear i will be without my laptop  over christmas due to Crucials inability to ship items in a more timely manner.  id have thought a company like these would have something better in place. im going to buy off kingston  and get a refund off crucial...  do not, and will deffinatly NOT  reccommend this shoddy company to anyone.  let down massively."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Simon Clinton",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T16:18:17.000Z",
          "Titre": "i am still waiting on my parts",
          "Contenu": "i am still waiting on my parts, when i asked the first time in costumer support, they eventually gave me the value of the expediated delivery and an investigation which would take ten days,all well and good except i am still waiting on the parts and it has been well over ten days, i tried to talk to the costumer service the second time and they cut the conversation off, forcing me to phone them directly in which they inform me that i have to wait yet another ten days. as of this review it has been 16 days since i ordered."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Richard",
          "Nb_Reviews": 5,
          "Date": "2023-12-15T00:16:19.000Z",
          "Titre": "Slow delivery",
          "Contenu": "I got an email to give a review, my order hasn't arrived yet and is showing as processing ordering. I read that my order would take upto 10 days to arrive, so to be fair i'm just at the end of that period.I will update my review once i have received my order."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Peter",
          "Nb_Reviews": 16,
          "Date": "2023-12-07T00:26:11.000Z",
          "Titre": "Sorry, I can't recommend Crucial.",
          "Contenu": "I asked crucial if laptop memory would be single rank (1R) or dual rank (2R), as dual is better, reply from crucial.. we dont know if it will be 1R or 2R ..Delivery advertised as royal mail 24hr, what they don't tell you is it takes 10 days to be shipped from Prague to the UK then it's 24hr royal mail.If there were other options available I wouldn't use crucial at all."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "IAN READ",
          "Nb_Reviews": 39,
          "Date": "2023-12-17T18:59:59.000Z",
          "Titre": "Never received the goods I paid for…",
          "Contenu": "Never received the goods I paid for also paid for 48hour postage but after 17 days nothing has been delivered I’ve emailed them on numerous occasions but they failed to respond they have taken my money and have failed to provide the goods false advertising at its best"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Peter Gilder",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T11:13:59.000Z",
          "Titre": "Took payment for hard drive but could…",
          "Contenu": "Took payment for hard drive but could not supply it. Wasn’t told this at the time of ordering. Only when I contacted them 3 weeks later so had to cancel order and source from elsewhere"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Ian Read",
          "Nb_Reviews": 17,
          "Date": "2023-12-15T15:34:17.000Z",
          "Titre": "Here we go again 14 days ago I placed…",
          "Contenu": "Here we go again 14 days ago I placed an order with these people and paid for next day delivery my parcel never arrived and all I get told is one excuse after another I would seriously recommend that people stay away from these con artists as you never get the goods or your money back next stop is trading standards"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Billy-paul Atherton",
          "Nb_Reviews": 6,
          "Date": "2023-12-16T06:34:11.000Z",
          "Titre": "I still have not received my package…",
          "Contenu": "I still have not received my package its been stopped at customs Nearly 4 weeks since I ordered it"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Stuart Miles",
          "Nb_Reviews": 4,
          "Date": "2023-12-17T12:50:05.000Z",
          "Titre": "Still haven’t received my items…awful…",
          "Contenu": "Still haven’t received my items…awful service"
        },
        {
          "Note": 1,
          "Lieu": "BN",
          "Pseudo": "AH",
          "Nb_Reviews": 5,
          "Date": "2023-11-24T12:13:53.000Z",
          "Titre": "I ordered 10pm I tried to cancel 8am…",
          "Contenu": "I ordered 10pm I tried to cancel 8am the next day.  Support team was hopeless.  Part arrived I immediately send back.  Costs you time and money and me.Improvement : remove the can not mindset from your offshored support team.  They need to provide customer service.  I've been a customer of yours for many years.  This is sad to see."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "IAN READ",
          "Nb_Reviews": 39,
          "Date": "2023-12-06T15:32:38.000Z",
          "Titre": "Recently purchased an ssd for these…",
          "Contenu": "Recently purchased an ssd from these people I also paid for 48 hour delivery 4 days later it still saying my order is pending and that it is now being dispatched from the chech republic to the uk a total scam charging people for stuff they don’t provide"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T13:45:42.000Z",
          "Titre": "X6 Drive not received and no reply to my email",
          "Contenu": "X6 Drive not received and no reply to my email belowI understand that you sent the parcel but my complaint is that the parcel was received in damaged condition and the contents were missing.The package was sent \"Tracked 24\" by Royal Mail and no signature was required. The package was posted through my letter box with the rest of my mail so I had no chance to reject it. In order to make a claim on Royal Mail after using Tracked 24 it must be the sender that makes the claim as the sender will have the information required to make the claim. Goods sent using Tracked 24 are insured up to the value of £200 so what needs to happen is that Crucial makes a claim on Royal Mail for the value of the missing goods and send me replacements for the goods I have not received, preferably  using registered post for which a signature is required."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "N Carr",
          "Nb_Reviews": 16,
          "Date": "2023-11-15T14:09:23.000Z",
          "Titre": "Bad start when the Crucial scanner…",
          "Contenu": "Bad start when the Crucial scanner reported “Well, this is embarrassing! No system match was found”.I then contacted Crucial’s chat line. I advised that I had 8GB and was told that a further 8GB was the max for a Dell OptiPlex 9020. A link was provided to Amazon and I purchased from there understanding that inserting the purchased Amazon/Crucial memory would fill the only remaining RAM slot and provide 16GB in total. Unfortunately, when I subsequently opened the computer, I had 4GB in each existing slot and therefore now have a just 12GB after upgrade. The Crucial technical direction was misleading and I would not have purchased if the advice had been clearer. I raised this with Crucial but they offered no assistance. Disappointed ☹"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "M Mullins",
          "Nb_Reviews": 9,
          "Date": "2023-11-28T15:03:34.000Z",
          "Titre": "Customer services is very poor",
          "Contenu": "Customer services is very poor. Made three call attempts all answered, but we’re all having a private chats with other people. It was like they didn’t know the answer to call to me. So still didn’t get the issue resolved"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Christian Adams",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T14:09:06.000Z",
          "Titre": "You took my money and then told me it…",
          "Contenu": "You took my money and then told me it wasn't in stock. I still have no communication to even tell me that my order is going to be fulfilled, never mind when.EDIT: after this review Crucial did get back to me and were professional and have satisfied my complaint."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Tony Cotton",
          "Nb_Reviews": 27,
          "Date": "2023-11-29T21:59:10.000Z",
          "Titre": "Money taken, order not shipped",
          "Contenu": "After 7 days my order is shown by Crucial as \"shipped\" but their carrrier shows it as \"expected\". I tried to use their \"contact us\" system to request help but after filling it out and pressing the \"submit\" button nothing happens. Poor customer service attitude, which is a pity as they used to be OK.Edit - although the tracking number links to somebody called Spring, that then links to Royal Mail 24. Crucial help chat say that free shipping takes 10 working days. So beware, their free shipping is a very poor service.Edit 2 - Crucial have said that they do not have details to comment on so here they are. Shipment Tracking Numbers: QS332482815GB (spring) Product SKU\t CT1000T500SSD8\tCrucial T500 1TB PCIe Gen4 NVMe M.2 SSD\tOrder Number: 1111933534339 Order Date: 20 November 2023Edit 3 - I've now had 2 separate emails from Crucial. Both confirm that the goods were shipped on 26 November. I had earlier had an email saying they were shipped on 21 November and so payment had been taken. I wonder which is true? Both the emails say that free shipping (apologies I am a cheapjack) means 10 working days. Therefore one tells me to wait until 8 December before chasing and the other (with the same information) 11 December. Not too hot on accuracy these folk as they can't seem to even agree internally. I'm minded to bin the thing when I get it as I have completely lost any trust in the company. The more they justify themselves the worse it gets."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "David Marks",
          "Nb_Reviews": 3,
          "Date": "2023-11-05T21:34:30.000Z",
          "Titre": "Waited two weeks for the memory I paid…",
          "Contenu": "Waited two weeks for the memory I paid extra for a quick delivery. I had to contact the (not helpful) support who said they'd investigate. I never heard from them again. I ordered more memory from a different company for another laptop and it arrived in 2 days. I won't be using Crucial again."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Patrick",
          "Nb_Reviews": 5,
          "Date": "2023-11-14T09:08:33.000Z",
          "Titre": "After 18 days still waiting for…",
          "Contenu": "After 18 days still waiting for delivery , tried to contact them today but no customer services on this MondayI have now managed to speak to them and they have agreed a full refund"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "GB",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T12:57:43.000Z",
          "Titre": "Very slow delivery",
          "Contenu": "Your products are good the delivery times are very slow. Nowhere on the site leads you to believe that it is anything other than royal mail 48h...Inreality I ordered on the 26th and it arrived on the 5th! Tracking the parcel said the parcel came on international post. As others have said amazon offers next day delivery on the same products. I have used Crucial before with none of these problems."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Teresa James",
          "Nb_Reviews": 3,
          "Date": "2023-09-12T12:12:38.000Z",
          "Titre": "Ordered computer memory from Crucial on…",
          "Contenu": "Ordered computer memory from Crucial on 27th August. Received a message on 8th September saying they had been 'shipped' along with a Royal Mail reference tracking number for 24-hour delivery - still waiting as at 12th September (after today's postal delivery)very poor service - would not recommend"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Stephen Green",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T14:02:56.000Z",
          "Titre": "Still waiting for a replacement",
          "Contenu": "I returned a faulty SSD drive under warranty to Crucial UK (K Line logistics returns). The product was recommended to me by my IT advisor. The SSD drive ceased working only 7 months into its life. I expected a smooth and event free replacement service under warranty for what was a premium product. I followed the returns process using an RMA code supplied. The SSD drive was confirmed as received at K Line on 12 October. I was advised that I needed to allow 10 working days before a replacement could be issued to me. The 10 days have expired and still absolutely no feedback or contact from Crucial. I have spoken to the customer team in an overseas office 3 times and the chat service 4 times. They said it would be escalated and I would hear immediately - I did not. Given that the SSD drive was used to back up my computer files I am left exposed whilst awaiting a resolution of this painful process. I am mightily unimpressed with the whole process. If someone from Crucial reads this would you have the decency to get in touch with me. I am at the end of my tether with this."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "David Grierson",
          "Nb_Reviews": 15,
          "Date": "2023-10-26T10:28:18.000Z",
          "Titre": "paid for quick delivery but that got…",
          "Contenu": "paid for quick delivery but that got refunded then told 3-5 days but no drive delivered Had to go away on day 6 for business which is why i bought the ssd so sorry Crucial not for me in future ScanDisk saved the day"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "John Stafford",
          "Nb_Reviews": 14,
          "Date": "2023-04-16T22:10:53.000Z",
          "Titre": "Crucial - a downhill slide...",
          "Contenu": "I'm used to receiving Crucial orders in one or two - maybe three - days.  Always been happy up to now but this last order took nearly two weeks (and followed a tortuous journey from Prague through various European countries).  Absolutely unacceptable!Next memory order goes to MrMemory!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "SRD",
          "Nb_Reviews": 9,
          "Date": "2022-12-14T13:28:30.000Z",
          "Titre": "Misleading - Not a UK stockist",
          "Contenu": "No UK warehouse, which means the ‘UK’ orders ship from the czec republic. This means minimum of ten business days, but up to 15 - none of which is made clear prior to ordering. They know full well that if they were upfront about this, they’d lose the order. I used to order all my memory upgrades from them and they used to be very good - but this is not the case anymore. Avoid, and find a true UK stockist."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mr Hildrew",
          "Nb_Reviews": 12,
          "Date": "2022-12-17T09:13:32.000Z",
          "Titre": "UK order comes from CZ!!!!",
          "Contenu": "If I had known the UK order was being delivered from the Czech Republic I wouldn’t have bothered. I’m still waiting for the order to arrive despite the order being placed THREE weeks ago. I checked the tracking after a week thinking our postal strike had some impact on the delivery. Nope. The items were travelling to Germany and then onto customs in the Netherlands. Will not use again and do not recommend anyone else does either."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "David",
          "Nb_Reviews": 4,
          "Date": "2022-12-07T02:07:29.000Z",
          "Titre": "Been waiting months and nothing…",
          "Contenu": "Been waiting months and nothing arrived! And it’s meant to be crucial.co.uk. And it’s still stuck in the F***ing hague. So calling it uk.crucial is a complete lie and me spending over £100 on it weeks ago is fraud and a scam! Will it ever arrive? F*** knows! I work building websites and needed it weeks ago! Should have gone to PC world instead!! 😭"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Tom",
          "Nb_Reviews": 6,
          "Date": "2022-12-08T21:38:21.000Z",
          "Titre": "avoid - 1month since order and still nothing",
          "Contenu": "extremely poor service - ordered a month ago - due to their low stock my order was only dispatched after 12 days..expected delivery time has been passed..staff is fake and does not do anything. i asked to speak to manager 5 times - they give me empty promises, do not have audacity even reach back to me.spent £150+ for the order that should have come to me in 4-5days.0 care or troubleshooting skills. extremely disappointed. going to request for a refund and never again, crucial"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T18:58:55.000Z",
          "Titre": "Poor customer service.",
          "Contenu": "Part ordered online with delivery of a few days. Subsequently told that part wasn’t available with no indication of when they will be in stock.  This is needed for Christmas so not having a date for delivery is very frustrating.  Trying to contact Crucial, phone number doesn’t work. Online chat was slow and text book answers given that were no more informative.  Very frustrating experience. Discount offered but still no idea if/when part will be available.  Terrible customer service."
        },
        {
          "Note": 1,
          "Lieu": "JE",
          "Pseudo": "Christopher",
          "Nb_Reviews": 5,
          "Date": "2023-10-08T14:54:37.000Z",
          "Titre": "Dispatch problem",
          "Contenu": "This is the second time that my order has been returned to sender before being shipped out of the originating country.  No communication from Crucial about it and if I had not tracked the order I would have been none the wiser."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mr Carl Nightingale",
          "Nb_Reviews": 11,
          "Date": "2022-12-14T22:23:06.000Z",
          "Titre": "Very poor delivery service",
          "Contenu": "Crucial website states 4 to 8 working day delivery. I contacted them after 8 days and was told a further 5 days delay were possible because of Royal mail strikes. According to the parcel tracking service, my parcel arrived in the UK after 10 working days and hasn't even made it to Royal mail yet. Very poor service."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Nick",
          "Nb_Reviews": 8,
          "Date": "2022-12-08T20:14:07.000Z",
          "Titre": "Very slow and misleading shipping info…",
          "Contenu": "Very slow and misleading shipping info from ordering direct on crucial.com website.Ordered: 30 Nov.Email saying it had shipped: 5 DecemberRoyal Mail still haven't received it: 8 DecemberCrucial phone support now indicates it has shipped from Czech Republic.Wish I'd bought the same product via Amazon."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Chris James",
          "Nb_Reviews": 1,
          "Date": "2022-12-21T19:31:08.000Z",
          "Titre": "Haven’t received items yet",
          "Contenu": "Haven’t received items yet, and have had no indication they will arrive within next week or so 😤Apparently posted 13th Dec via Royal Mail - 24 hour tracked delivery.Very surprised you trust a company like this with your deliveries.There are far better couriers in this day and age."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "David",
          "Nb_Reviews": 3,
          "Date": "2023-07-15T11:19:42.000Z",
          "Titre": "Extremely long delivery times.",
          "Contenu": "Extremely long delivery times.Site makes you believe you're ordering from a UK company (UK in site name; Royal Mail tracking number) but delivery takes 10 days.Avoid at all costs"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "The Maverick",
          "Nb_Reviews": 81,
          "Date": "2023-02-11T13:12:49.000Z",
          "Titre": "Absolute shambles of a website",
          "Contenu": "Absolute shambles of a website.  None of the tools work, the memory selector won't accept Dell as a manufacturer - in fact it won't accept anything.  So that's the first fail.Second their system scanner won't download or do anything - the website just crashes.So despite trying several browsers, even with ad blockers and shields off, none of the tools will work.So another waste of time and this does not bode well for the company if they can't get their website operating properly, so I won't be shopping there."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "N CARR",
          "Nb_Reviews": 9,
          "Date": "2023-11-12T22:43:26.000Z",
          "Titre": "I placed an order and paid for express…",
          "Contenu": "I placed an order and paid for express delivery. The order hadn't been shipped over a week later, so I had to get a refund."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Dilz",
          "Nb_Reviews": 9,
          "Date": "2023-07-17T15:09:36.000Z",
          "Titre": "Horrible experience",
          "Contenu": "Horrible experience. Bought a SSD memory card, then got told its out of stock by email two days after purchase. Chased up twice, both times the customer service assured me that the stock had \"just arrived and going to be dispatched within 24 hours\"....didn't happen. In the end I asked order to be cancelled as I didn't want to deal with them any more. I would avoid this company!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Roofer taunton",
          "Nb_Reviews": 2,
          "Date": "2023-10-20T22:31:45.000Z",
          "Titre": "Customer service is poor..over 2 weeks…",
          "Contenu": "Customer service is poor..over 2 weeks for delivery then it was wrong part...still waiting for return update now 3weeks later"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Paul Williamson",
          "Nb_Reviews": 3,
          "Date": "2022-12-28T17:26:18.000Z",
          "Titre": "Still waiting on my m2 drive.",
          "Contenu": "Still waiting on my m2 drive.Seems to be sitting in a post office and has been for over a week.Ordered on 14th  today 28th customer  care told me to wait  as it can take 10 working days to arrive.Not the service I have had or expectJust arrived this afternoon"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Paul",
          "Nb_Reviews": 53,
          "Date": "2023-10-28T16:05:23.000Z",
          "Titre": "I paid extra for Express Delivery and…",
          "Contenu": "I paid extra for Express Delivery and five days later I’ve still not received my order. Why offer such a service?"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Kurt Madgunner Holden",
          "Nb_Reviews": 8,
          "Date": "2023-08-11T12:58:25.000Z",
          "Titre": "Order never arrived",
          "Contenu": "Order never arrived. Got made to wait 10 business days before reporting it missing. Finally got issued a refund, but have to wait 5 business day,   no apology for no items or way I was treated"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Martin_F",
          "Nb_Reviews": 3,
          "Date": "2023-05-29T15:18:14.000Z",
          "Titre": "May 29 still no delivery.",
          "Contenu": "May 29 still no delivery The crucial item is possibly OK when I receive it. Why choose a carrier (Royal Mail) that sends the item from SOUTHALL, MIDDLESEX MC to GREENFORD MC then to BRISTOL MC then to SWINDON MC then back to BRISTOL MC when my delivery address is Bristol. Doesn't any carrier go from Southall to Bristol."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Andy Durham",
          "Nb_Reviews": 10,
          "Date": "2023-02-08T17:20:01.000Z",
          "Titre": "Poor I always thought Crucial were the…",
          "Contenu": "I always thought Crucial were the company to go to . Waiting weeks for memory to be delivered from foreign shores . i could have done that myself. I wanted a quality product delivered fast for a project. Now im late for the project because there was no warning of how long that delivery would be and apparently according to the robotic customer service it could be up til 17th February  ordered 266th January ......Sad"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Richard",
          "Nb_Reviews": 2,
          "Date": "2023-03-06T21:40:28.000Z",
          "Titre": "I wonder where my memory is......?",
          "Contenu": "Placed my order. Money was taken from the bank. (Fair comment, I expect to pay for goods immediately). Received an email 3-4 days later informing me that they didn't (& I presume still don't) have the item in stock & it'll be circa 10 days until stock is replenished, but might be longer. Currently, I await my purchase to be delivered........"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "rob p",
          "Nb_Reviews": 12,
          "Date": "2023-06-13T21:37:17.000Z",
          "Titre": "Complaint",
          "Contenu": "Complaint: Slow and Misleading Shipping Experience with Crucial.com- Ordered: 2nd of June- Email stating shipment: 5th of June- UPS has yet to receive the package: 13th June- Crucial phone support now reveals shipment from Czech RepublicI am extremely disappointed with the shipping process I have encountered while ordering directly from the Crucial.com website. The delivery has been incredibly slow, and the information provided regarding the shipment has been misleading."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "anthony black",
          "Nb_Reviews": 9,
          "Date": "2023-10-23T09:23:45.000Z",
          "Titre": "Delivery still hasn't arrived.",
          "Contenu": "You are asking for feed back.Frankly check what you have been paid to do before asking how well you did it.DELIVERY HASN'T ARRIVED YET !!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "KB from Brentwood",
          "Nb_Reviews": 8,
          "Date": "2023-06-06T19:38:29.000Z",
          "Titre": "Great Prices.....Crap Service",
          "Contenu": "You discounted the SSD I wanted to a very attractive price. Then when I ordered you took my money but had no stock. I got a message saying 7-10 days for stock.After 14 days I queried this and you still cannot give me a delivery date. What a way to do business???Update after Crucial pitched in:   Since this review I have asked repeatedly for a delivery date and just got the same cut & paste email over and over again. But don't worry; today I emailled Mr Sanjay Mehrota the CEO of your parent company Micron Technology. Let's see if he cares about his customers, because you don't!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Richard Brodie",
          "Nb_Reviews": 11,
          "Date": "2022-12-10T00:29:07.000Z",
          "Titre": "Very poor service.  Slow beyond belief",
          "Contenu": "Delivery times are dreadful.  And it nothing to do with Royal Mail. This will probably be the last time I buy from this company.  How can Crucial ask me for how my recent experience with them was, when I still haven’t got the goods."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Photos Massos",
          "Nb_Reviews": 1,
          "Date": "2023-05-06T16:09:20.000Z",
          "Titre": "Memory return",
          "Contenu": "The unit I bought the memory for report errors with the memory installed. Your return process, doesn't allow for any support. I am now unsure whether the memory bought was correct and faulty, the unit sent is incorrect. I am awaiting your refund. You've had my feedback, how about some from you?"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "a suter",
          "Nb_Reviews": 6,
          "Date": "2023-01-02T21:41:57.000Z",
          "Titre": "Very poor communication from crucial",
          "Contenu": "Very poor communication from crucial. Yodel said they tried to deliver my order twice and that they had left a card. We were at home both times the non existent delivery took place. We the rearranged the delivery twice and they failed to deliver on both confirmed dates. I tried to contact crucial but just kept on being redirected to the courier's website. Cancelled the order eventually and Will never use them again as the item was a Christmas present which I had to reorder from a more reliable company ."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Holy Moley",
          "Nb_Reviews": 17,
          "Date": "2023-02-10T17:37:17.000Z",
          "Titre": "SSD Not compatible",
          "Contenu": "Despite the categorical assurance from Crucial prior to my order that the purchased SSD M.2 would be 100% compatible with my system, Conversations with Dell confirm that the Crucial SSD is not compatible and I need to arrange a return and refund.I called Crucial about a refund and was informed that just raising the RMA would take 4 hours!4 hours to raise an RMA Return is ridiculous! I would expect 4 minutes at the outside, not 4 hours."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mr Netto",
          "Nb_Reviews": 3,
          "Date": "2022-12-09T16:18:37.000Z",
          "Titre": "I still havent received my item",
          "Contenu": "I still havent received my item. I keep checking the delivery website and it says that the Item is still a few miles from me since last week . Well, I couldn't say anything about the product once it takes forever the get to me."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "anna maria",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T14:46:42.000Z",
          "Titre": "Order Cancelled by System",
          "Contenu": "Order Cancelled by System Try 12 times now , via different emails or cards ,  no luck to purchase anything , try to purchase to my holiday address outside UK ,as well Order Cancelled by System , no one can explain why they block their customers , and how to purchase anything , disappointed a lot. CS is helpless."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Sean",
          "Nb_Reviews": 8,
          "Date": "2022-11-28T16:45:22.000Z",
          "Titre": "Slow, unpredicatable awful service",
          "Contenu": "The website implies that the components come from within the UK.  They don't! They come from Prague.  They take forever to get to The Hague, and then get lost.  Customer service is apalling!!!  Go elsewhere."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jeff",
          "Nb_Reviews": 9,
          "Date": "2023-05-30T18:21:37.000Z",
          "Titre": "Took too long for DELIVERY",
          "Contenu": "Took too long for DELIVERY, Was buying from a UK company, it took 22 days to arrive from Prague apparently?Charged me £55.99 but receipt says £45.99 no mention of Delivery cost on receipt."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Christopher Richmond",
          "Nb_Reviews": 10,
          "Date": "2023-06-22T09:48:22.000Z",
          "Titre": "When is “Royal Mail Tracked 24” not 24…",
          "Contenu": "When is “Royal Mail Tracked 24” not 24 hour delivery?When it is from Crucial.2 weeks for delivery from UK to UK is a complete disgrace.UPDATE:Your response is noted, and all you did was point out your bull-crap shipping policy.The truth about Crucial UK is that you deceive your UK customers. CRUCIAL DO NOT HAVE ANY STOCK IN THE UK. (FACT) and they try to say the extended shipping time is because of the amount of orders they receive.It is actually because it is sent from the The Czech Republic.PROOF:2023-06-21 14:03:33\tINTERNATIONAL TRANSPORT\tDEPARTURETHE HAGUE, 2491 DA, NL2023-06-21 09:36:16\tINFORMATION\tEXPORT DECLARATION RELEASED2023-06-21 09:15:56\tIN CUSTOMS\tCUSTOMS EXPORT DECLARATIONTHE HAGUE, 2491 DA, NL2023-06-20 11:57:25\tINTERNATIONAL TRANSPORT\tDEPARTUREPULHEIM, 50259, DE2023-06-19 23:09:21\tINTERNATIONAL TRANSPORT\tDEPARTUREPRAGUE, 252 61, CZ2023-06-19 21:29:22\tACCEPTANCE\tPRAGUE, 252 61, CZ2023-06-16 08:39:28\tPARCEL CREATED———————————Order Number: 1098829784339"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Rev Rob Anning.",
          "Nb_Reviews": 15,
          "Date": "2023-02-24T18:00:17.000Z",
          "Titre": "I thought my purchases were coming from…",
          "Contenu": "I thought my purchases were coming from the UK or Eire only to find that the SSD I purchased took 10 days to arrive from Slovakia, via Germany, Holland and then to the UK. This should be made clear when purchasing. Had I known, I would not have bothered with Crucial."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Paul Swift",
          "Nb_Reviews": 17,
          "Date": "2023-09-02T12:01:25.000Z",
          "Titre": "Delivery times are unbelievable",
          "Contenu": "Delivery times are unbelievable. 11 days and still waiting, just unacceptable in this day and age. Won't be back or ever recommend"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "DLF",
          "Nb_Reviews": 20,
          "Date": "2022-12-29T14:24:42.000Z",
          "Titre": "A \"UK\" business but sent from Czechia!",
          "Contenu": "I ordered on the 13th December and received it on the 28th. It took ages to get here not just because of a Post Office strike but, even though I ordered from a \"UK\" business, it is sent from Czech Republic!. It came via Prague, Pulheim (Germany), The Hague (Netherlands) then arrived in the UK. I haven't even put it in my PC yet so hoping it works!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Customer",
          "Nb_Reviews": 8,
          "Date": "2023-02-28T13:46:04.000Z",
          "Titre": "Terrible service DO NOT USE",
          "Contenu": "Ordered on the 6th Feb, advised 2 days later 8th Feb no stock, and 7 to 10 days waiting, took the payment on the 9th Feb and 20 days later, no contact and no order, when I contacted them, still no ETA on the order.Very poor service, will never order from them again."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Craig Skayman",
          "Nb_Reviews": 4,
          "Date": "2023-03-09T09:23:31.000Z",
          "Titre": "M.2 incompatible.",
          "Contenu": "The M.2 Nvme drive that your scanner indicated would be suitable for my Dell 3390 2 in 1 is not detected at all, I have tried everything to fix the problem but with no success, I am very disappointed with it."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mr KIRKUP",
          "Nb_Reviews": 5,
          "Date": "2022-12-16T19:15:24.000Z",
          "Titre": "Still not receivedp",
          "Contenu": "Still not received, 10days after email from you , telling me that it had been sent. In the meantime bought one from Amazon with next day delivery and it's installed and still waiting for yours to arrive."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "MR Breeze",
          "Nb_Reviews": 12,
          "Date": "2023-06-08T15:37:19.000Z",
          "Titre": "Disappointing. Misleading. Lacklustre.",
          "Contenu": "What a disappointing experience. I placed 2 orders using a voucher code after price checking against amazon.co.uk.The 2nd order the code was accepted and went through,  only after it processed did a box pop up saying the discount was unavailable. At the top off the page it quite clearly states offers are a maximum of 5 per person, and the sale had been agreed at the lower price in the cart.  I contacted customer services by Web chat. They were unhelpful but escalated for me. 48hrs later I've still no update. Equally,  6 days later neither order has actually shipped. 1 sent via royal mail still says we are awaiting your parcel and UPS says the same thing.As the code was overturned on my second order I could have ordered from amazon, for less and with next day delivery. I reached out to customer services a third time and have only received lip service. Only buy your ram for crucial if your prepared to wait 2 weeks and pay more than you can elsewhere."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mel Davies",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T11:20:04.000Z",
          "Titre": "You were unable to fulfil the order…",
          "Contenu": "You were unable to fulfil the order even though you accepted it, and your website said you had plenty of stock.Kingston Technology managed to provide the item."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Brian Wallace",
          "Nb_Reviews": 2,
          "Date": "2022-12-06T15:51:24.000Z",
          "Titre": "Delivery times",
          "Contenu": "When you purchase an item you expect a delivery time that is not 2 weeks away and still waiting!! I was also told it will be delivered at the latest 5th December it has now past and still no delivery."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "ADRIAN LOWE",
          "Nb_Reviews": 2,
          "Date": "2023-04-18T10:57:11.000Z",
          "Titre": "Delivery took far too long",
          "Contenu": "Delivery took far too long, 12 days since placing the order. Dispatched from Czec Republic by an Irish company, when UK stock was available. Awful customer service and communication. Will NEVER order from CRUCIAL directly again. Useless!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Daz",
          "Nb_Reviews": 6,
          "Date": "2022-12-09T19:49:34.000Z",
          "Titre": "Still waiting for the item",
          "Contenu": "Still waiting for the item, thought they it was being shipped from UK, but tracking shows various EU countries,  Spoke to Customer Services who weren't helpful.  Told me to wait another week."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Michael Sidebottom",
          "Nb_Reviews": 9,
          "Date": "2023-05-10T14:33:12.000Z",
          "Titre": "The memory supplied this time was fine",
          "Contenu": "The memory supplied this time was fine. It booted fine in the iMac. The previous memory failed after two years. It still worked as long as it did not have to boot from the crucial memory. Unfortunately another engineer was involved without my knowledge so I can not be sure that engineer did not damage or misreplace the memory. This is the first time I have had a problem with Crucial memory.When tested by Apple, they did not approve of the mixture of 2X4GB Apple memory and 2X8GB Crucial memory. Apple called it a “memory mismatch”. At present the iMac is only using the replacement 2X8GB Crucial memory."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "A Patel",
          "Nb_Reviews": 3,
          "Date": "2023-06-29T12:25:04.000Z",
          "Titre": "Delivery not made in time",
          "Contenu": "Delivery not made in time, in fact still awaiting for the delivery and your customer service agent when called asked to wait another 10 days??? I needed this for a reason."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Richard H",
          "Nb_Reviews": 7,
          "Date": "2023-10-18T15:18:57.000Z",
          "Titre": "Not delivered, no tracking, won't resend. AVOID",
          "Contenu": "Ordered a lot of ram for a server, est. delivery was 3 - 5 working days. we are now well over a week after i ordered, the tracking says the label has been printed and nothing else. It has not been scanned by UPS once. I contacted Crucial last week and was told they wouldn't do anything until today. Contacted this morning and all they say it the will send to the \"concern\" team which may take 10 business days before they will consider resending or refunding the obviously lost order. It has been 11 days since i placed my order and not one bit of tracking has been logged by UPS. Clearly been shipped from Czechia but looks like it was never picked up by UPS. I used to use crucial for work purchases but they are now far too unreliable to use again. If i had realized it was coming from abroad i would never have used them for what is an urgent order. Telling me it will take upwards of 3 weeks all in to get my money back or send replacements is simply not good enough.#UPDATE: this morning i was promised an email back updating me on where my parcel was and i have had nothing. I phoned customer support again who repeated the same lines saying it has been escalated and they want a few days to look into it. This was meant to be shipped on a 3 - 5 day expediated delivery and the tracking still says it was never shipped. UPDATE2# crucial did contact me and all they have said is i have to wait up to 10 days before they will either consider refunding or replacing. I will be lucky if i get the memory i ordered within a month of ordering it. They seem to be doing as almost nothing to resolve this issue, they are just sitting on it and hoping it will turn up. # reposted here as i had linked to us site rather than uk.crucial.com. Issue still stand though"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Conor McKeown",
          "Nb_Reviews": 2,
          "Date": "2022-12-25T17:42:06.000Z",
          "Titre": "14 days later and I’m still waiting on…",
          "Contenu": "14 days later and I’m still waiting on my delivery!Definitely not the same Crucial I’ve been using for 10+ years.Let’s hope this is a one-off, when my order eventually does arrive."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "VERITY B",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T23:58:56.000Z",
          "Titre": "Useless customer services",
          "Contenu": "Useless customer services. Delivered the extra ram on time, but then I received an invoice demand from Fedex for import tax. Have been in a useless conversation with customer services ever since. They know nothing, do nothing and give me no answers. Meanwhile Fedex are threatening legal action. Ongoing since December."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jay Jo",
          "Nb_Reviews": 4,
          "Date": "2023-08-08T18:19:10.000Z",
          "Titre": "I understand brexit BS made this…",
          "Contenu": "I understand brexit BS made this difficult but you stated 3-5 days delivery and it is now 10 and im still waiting. A bit f you"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Peter Copp",
          "Nb_Reviews": 3,
          "Date": "2023-02-17T19:21:41.000Z",
          "Titre": "Part (MX500 SSD) ordered 30/1/1923",
          "Contenu": "Part (MX500 SSD) ordered 30/1/1923, arrived after 2 weeks.Unable to fit to my laptop without cable and 4 screws, which I had assumed would come with the ssd. Contacted Crucial on phone, woman I spoke to did not have much  of a clue of products she sold. I have ordered required parts from Ebay( China), another 2 weeks delay!! Not too pleased."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "michael",
          "Nb_Reviews": 9,
          "Date": "2023-09-11T16:05:06.000Z",
          "Titre": "Item was £10 cheaper on amazon with…",
          "Contenu": "Item was £10 cheaper on amazon with next day delivery, this took ages to come, I thought buying direct from the manufacturer would be best, i know better now, customer service was a waste of time"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "DAVID JOHN BETTS",
          "Nb_Reviews": 31,
          "Date": "2022-12-13T17:38:43.000Z",
          "Titre": "Poor shipping process.",
          "Contenu": "I have yet to receive this shipment and cannot understand why it takes so long. I could have got next day delivery through Amazon. Use courier service instead of Royal Mail."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Alec Simmance",
          "Nb_Reviews": 3,
          "Date": "2023-09-01T16:05:00.000Z",
          "Titre": "Terrible delivery Time",
          "Contenu": "it is 11 days since you received my order. I still do not have the goods. Your delivery times are terrible I am starting to wonder if i will get what i ordered"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Tel Kirton",
          "Nb_Reviews": 10,
          "Date": "2023-09-27T14:25:33.000Z",
          "Titre": "Great company for SSD and Memory…",
          "Contenu": "The company is fine and my husband has used you for years, but the post taking 5/6 days to get to me was a long time, I will pay extra for a quicker posting service or buy from Amazon which offers next day postage, but say that I will always use a great product, Thanks.."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "David Goodfield",
          "Nb_Reviews": 3,
          "Date": "2022-11-21T21:38:00.000Z",
          "Titre": "After checking my Acer 3 Swift your RAM…",
          "Contenu": "After checking my Acer 3 Swift your RAM app told me I could insert a 16GB DDR4 SODimm into it and increase the RAM to 20gb so I purchased the RAM.  Your app lied. The RAM in my Laptop is soldered in and I cannot change it. As far as I am concerned your app needs work on it and I wastyed money."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Terry",
          "Nb_Reviews": 179,
          "Date": "2023-03-17T15:38:11.000Z",
          "Titre": "Online scanner wrong, returns nightmare",
          "Contenu": "I used there online scanner to check what Ram upgrade and SSD I could put in my laptop.Placed my order choosing out of what was listed, and waited for delivery, delivery was slow not the Royal Mail 24 due to fact it did not even come from in the UK.On arrival I had problems and the parts were not compatible, I contacted the Manufacture who advised  what I had purchased would not work in my machine.I started the return process and followed the instructions, Return postage was on me even though I purchased what they told me would work.Items shown delivered on 01.03.2023 and proof of postage shows my package on a desk.I still do not have a refund and it shows waiting for return, I phoned them on the 09.03.2023 and was told yes we have it and it takes 15 days, today is 17 days and an agent just told me they have not received it, until I shown it was delivered and now he is puzzled and does not know what to say.So I am out of pocket £120, hopefully paypal will sort this mess out and get my refund.There online scanner is not 100% correct even though they say it is, and there returns are a night mare."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "JB",
          "Nb_Reviews": 44,
          "Date": "2023-01-10T12:57:14.000Z",
          "Titre": "They used to be so good",
          "Contenu": "I used to use Crucial a lot and was always pleased with their service.  However, something has changed.  Their delivery is now pants.  I ordered an item with a delivery of 10 working days.  They didn’t ship the order until 6 days after my order.  Since then, it has been crawling across Europe from Prague to Pulheim and to The Hague.  I don’t have a problem with the delivery method but every stop causes a lengthy delay.  For example, it got to The Hague 4 days ago.  I have no idea if or when it will start moving again.  I would not order from Crucial again.  The end of an era.I’m still waiting for my item.  It’s not in the UK so it misses the promised 10 working day delivery.  I’ll give it until the end of the week and then I will claim a refund."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Nick Kirkwood",
          "Nb_Reviews": 6,
          "Date": "2023-09-01T19:55:38.000Z",
          "Titre": "No Delivery and no communication. delivered over ten",
          "Contenu": "Device not yet delivered over ten later. No emails to advise on problems. Product may be excellent - it would good to see it."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "ElizabethRandall",
          "Nb_Reviews": 13,
          "Date": "2023-03-26T17:16:55.000Z",
          "Titre": "Despite the Curcial page guaranteeing…",
          "Contenu": "Despite the Curcial page guaranteeing the RAM was definitely for my computer it's toally wrong. I wanted RAM for a desktop and they sent one for a laptop."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Doug Smith",
          "Nb_Reviews": 14,
          "Date": "2023-02-03T09:24:03.000Z",
          "Titre": "Took too long to deliver",
          "Contenu": "Took too long to deliver. Had to go and buy a competitor product and will return the crucial memory, whenever it arrives."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Anthony Aitken",
          "Nb_Reviews": 2,
          "Date": "2023-07-04T13:41:21.000Z",
          "Titre": "Still not arrived three weeks later",
          "Contenu": "Still not arrived three weeks laterDate/Time\tEvent\tComments2023-06-27 10:12:48\tIN CUSTOMS\tCUSTOMS IMPORT SCAN COMPLETEDSOUTHALL, MIDDLESEX UB2 5LF, GB2023-06-27 08:59:45\tITEM RELEASED FROM CUSTOMS\tIMPORT DECLARATION RELEASED2023-06-27 08:59:25\tIN CUSTOMS\tCUSTOMS IMPORT DECLARATIONSOUTHALL, MIDDLESEX UB2 5LF, GB2023-06-27 08:38:13\tCROSSDOCK\tARRIVALSOUTHALL, MIDDLESEX UB2 5LF, GB2023-06-25 17:13:10\tINTERNATIONAL TRANSPORT\tDEPARTURETHE HAGUE, 2491 DA, NL2023-06-25 15:27:01\tINFORMATION\tEXPORT DECLARATION RELEASED2023-06-25 15:24:45\tIN CUSTOMS\tCUSTOMS EXPORT DECLARATIONTHE HAGUE, 2491 DA, NL2023-06-25 13:02:50\tCROSSDOCK\tARRIVALTHE HAGUE, 2491 DA, NL2023-06-23 10:28:35\tINTERNATIONAL TRANSPORT\tDEPARTUREPULHEIM, 50259, DE2023-06-22 13:17:36\tCROSSDOCK\tARRIVALPULHEIM, 50259, DE2023-06-21 23:35:23\tINTERNATIONAL TRANSPORT\tDEPARTUREPRAGUE, 252 61, CZ2023-06-21 22:09:33\tACCEPTANCE\tPRAGUE, 252 61, CZ2023-06-20 10:25:20\tPARCEL CREATED"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-09-16T19:12:54.000Z",
          "Titre": "You far too long to deliver my RAM…",
          "Contenu": "You far too long to deliver my RAM Chips....it says Royal Mail 24 hours.  I didn't get them for over a week. Poor service !"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Stu Last",
          "Nb_Reviews": 21,
          "Date": "2023-02-10T14:17:27.000Z",
          "Titre": "Dreadful service from beginning to end!",
          "Contenu": "Dreadful service from beginning to end!1.  Even though I paid for priority delivery, this was never put in place.2.  Logistics paperwork failure means my order is now stuck in customs.3.  On contacting Crucial about the failure of priority delivery, the customer service agent made no attempt to ensure a speedy delivery was made.4 On contacting Crucial about items being stuck in customs due to paperwork issues, the First Custome4 Support Agent cut me off after failing to understand th3 complaint, and the second one refused to agree to a cancellation of a no longer needed or wanted product ( due to the ongoing delays) or arrange a refund for the undelivered product within the agreed contract timescale.I’ve been using Crucial for nearly 10 years but the last 18 months have seen a rapid and devastating collapse of customer service, due in part to a wholly disinterested and deliberately obstructive outsourced customer services team, but also due to a complete failure of Crucial to ensure reasonable supply chain mechanisms.Do not shop with Crucial.  Their new approach to customer service is a clear indication that the quality of their products is soon to decline too."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Roy Grindrod",
          "Nb_Reviews": 12,
          "Date": "2023-03-11T01:29:40.000Z",
          "Titre": "Not received yet",
          "Contenu": "Not received yet. Apparently out of stock but nobody thought to advise me until I made contact."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Anesu Sean Majonga",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T00:06:06.000Z",
          "Titre": "Its been a month and no product",
          "Contenu": "Its been a month and i have not received my product. No information or consolidation has been shared.."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "MR blobby",
          "Nb_Reviews": 19,
          "Date": "2022-11-19T13:59:12.000Z",
          "Titre": "they weren't very helpful when it came…",
          "Contenu": "they weren't very helpful when it came to transferring  data from drive to drive they couldn't supply or recommend any product to help with this and left me to find out the hard way"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Gerard Tutton",
          "Nb_Reviews": 4,
          "Date": "2023-01-09T16:03:11.000Z",
          "Titre": "If I could give ZERO Stars",
          "Contenu": "If I could give ZERO Stars, I wouldTook far too long to deliver.I used to get fantastic serviceI will never buy from Crucial.com again"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jenny Fletcher",
          "Nb_Reviews": 3,
          "Date": "2023-04-01T10:37:03.000Z",
          "Titre": "Parcel that wasn't delivered",
          "Contenu": "Parcel had excellent tracking information for the first 4 days then nothing, spoke to customer service who was rubbish!!! No help at all, very disappointed"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mike",
          "Nb_Reviews": 3,
          "Date": "2023-02-02T18:49:09.000Z",
          "Titre": "Not enough tracking information.",
          "Contenu": "Not enough tracking information.This item has not arrived yet and we have no idea when it should be here."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Graeme Morrison",
          "Nb_Reviews": 5,
          "Date": "2023-02-01T18:23:53.000Z",
          "Titre": "ordered from Crucial on 18 January 2023…",
          "Contenu": "ordered from Crucial on 18 January 2023 now first February an no sign of order"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Rigzzy Rigs",
          "Nb_Reviews": 2,
          "Date": "2023-07-09T16:02:41.000Z",
          "Titre": "crucial is crap",
          "Contenu": "crucial is crapi bought 64 gb's off ram and it said it was in stock when i bought it that was 12/06/2023 it is now 09/07/2023 and my order is Order Status:  Order in Process"
        },
        {
          "Note": 1,
          "Lieu": "IM",
          "Pseudo": "Frank",
          "Nb_Reviews": 3,
          "Date": "2022-12-11T01:16:25.000Z",
          "Titre": "10 12 22 not delivered",
          "Contenu": "10 12 22 not delivered, in UK 06 12 22.  On 8th shown as being on IOM.  10th shown as not found on IOM.  Shown 06 12 22 in UK."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Vijeth Bhat",
          "Nb_Reviews": 2,
          "Date": "2023-08-10T14:39:26.000Z",
          "Titre": "I ordered ssd 15 days back and still…",
          "Contenu": "I ordered ssd 15 days back and still haven’t received it. Lol. This is the  last time I’m ordering from crucial. Thanks for your service.You suck"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Chris King",
          "Nb_Reviews": 12,
          "Date": "2023-05-23T16:13:15.000Z",
          "Titre": "A complaint from a UK Customer who ordered from Crucial Online.",
          "Contenu": "A complaint from a customer in the UK who ordered from UK-CRUCIAL.COM, but as yet hasn't receive their goods despite the fact I was advised it was on 24 tracked delivery from RM. I ordered 2 x 32gb SSD for my PC from uk-crucial.com on the 17th May. On the 18th May, I was advised of the RM tracking number on Royal Mail 24. However the info on RM never updated, and by 22nd May, the tracking had not changed and there was no record of the goods being processed via RM.I contact RM who advised they hadn't received it and if they had, that it would be in their system in under 12 hrs. I contacted Crucial twice on Monday 22nd May and on both instances I was misfed information and it was not made clear. The first online support agent, told me that it was near a weekend and the system in RM had not had a chance to update - I needed to allow 10 days. - yeah right, it was not a Bank Holiday weekendThe second support agent again said was part of the Spring shipping (This was never explained to me), it could take 10 days and if i hadnt received it by 2nd June, to contact them again.Today I contacted them again by phone, this time it started to be clearer, the memory I ordered came from Prague, it is shipped by a courier company called SPRING, and travels from Prague to UK on their service and then when it arrives in UK, it is picked up by Royal Mail on a 24 hr delivery. They supplied me with the link to Spring, and I can see my goods were shipped on the 18th, and currently on the 23rd May its in Germany, I was advised it will hit the UK for delivery on 25th or 26th May, with the latest being Monday 29th May!So the information about 24hr Royal Mail is in effect not true, its only 24hr from when Royal Mail receive it, which will be 9/10 days from when it was \"posted\" in Prague. Be warned. NOT a good service and I would suggest using Amazon who will deliver on Prime in 24hrs! It would be helpful is UK Crucial advised their customers of the International part and that goods can take longer and not to rely on the RM Track 24 number!"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mark",
          "Nb_Reviews": 13,
          "Date": "2023-12-19T15:43:53.000Z",
          "Titre": "Long Delivery Time",
          "Contenu": "The Hard Drive was ordered on the basis of Crucial offering 24Hr Royal Mail Delivery .. Little did I realise that that the \"24Hr tracked delivery\" was once the Hard Drive had arrived in the UK after a long and arduous journey from Prague I could have bought the same product on Amazon with delivery next day for a comparable cost!"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "C Childs",
          "Nb_Reviews": 4,
          "Date": "2023-12-20T00:20:33.000Z",
          "Titre": "Despite running the Crucial app the…",
          "Contenu": "Despite running the Crucial app the recommended RAM did not work. Took a week to arrive. Returns process seems to be working so far...."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Marius Rotila",
          "Nb_Reviews": 6,
          "Date": "2023-12-18T18:09:53.000Z",
          "Titre": "Shipping took ages  hence long waiting…",
          "Contenu": "Shipping took ages  hence long waiting time to get the item delivered from Checz republic to UK."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "irtiza haider",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T12:26:57.000Z",
          "Titre": "Scammed of £7",
          "Contenu": "This was the first time I ordered from crucial and probably my last, although the products (SSD) were delivered to me, but they were delivered in the time frame of the normal delivery window (14 days) which was free, whereas I paid for a fast delivery (2-4 days) and paid an extra £7 for it. On getting the issue raised with their customer care department their attitude was non serious and he wasn't even apologetic. Basically I was scammed of £7 and for a company this big and an amount so small it raises big red flags, enough for myself to refrain from ordering in future and to warn others."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Paul",
          "Nb_Reviews": 2,
          "Date": "2023-09-04T13:41:16.000Z",
          "Titre": "Very slow delivery - Excellent Products",
          "Contenu": "The products I bought (extra RAM and SSD) are first class, exactly as described and perfect new, unopened condition. The reason for only 2 stars was delivery, ridiculously slow. 2 weeks to arrive. I could have paid extra for fast delivery but these days normal post from anywhere in Europe is 3-4 days at the most. From what I can tell the items were sent from Germany, so normally with standard post would be 3 days (I've had normal post deliveries from Germany previously turn up next-day) so no excuse for 14 days. I'm guessing these were not posted for many days after the order was placed, or they were originally in China (or similar country). If not for this I would have given a FULL 5 STARS."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "TICT Support",
          "Nb_Reviews": 1,
          "Date": "2022-12-22T01:15:03.000Z",
          "Titre": "Usually excellent service.",
          "Contenu": "First let me state; I always use crucial. I think the scanner tool is excellent and the quality always shines through. This time however the delivery has been shocking! You may blame the strikes and the festive delays but the communication has been woeful. I selected standard delivery but 11 days to deliver the item is shocking. This was a business order and my customer has had to wait!"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Customer Samuel Harvey",
          "Nb_Reviews": 4,
          "Date": "2023-08-23T14:49:03.000Z",
          "Titre": "SSD drive problems caused by crucial software",
          "Contenu": "Purchased memory and SSD drive. Memory installed with no problems.  Three calls later I was told by customer services that the SSD wouldn't install because of a problem with the cloning software downloaded from the website. They suggested I use a different cloning software but left to decide which to choose and purchase."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Dave",
          "Nb_Reviews": 4,
          "Date": "2023-09-06T12:48:46.000Z",
          "Titre": "The memory is OK - Delivery is MEH!",
          "Contenu": "The memory is OK - it does what it says on the tin, nothing more or less.Delivery was *just* within the expected time of 5-10 working days, or 14 days in real money. Crucial sees nothing wrong with this time scale for free delivery.Personally, I think their logistics are rubbish. Its possible to get the same memory from Amazon or eBuyer with next day delivery at the same or lower price.With the long delivery time, I wonder what the turn around time would be on faulty products. My guess is unacceptable, but I hope never to find out.I may buy crucial products again, but will never buy direct from them. Its just not worth it."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Chris B",
          "Nb_Reviews": 2,
          "Date": "2023-04-13T11:54:50.000Z",
          "Titre": "Still waiting for delivery nearly 2 weeks after ordering...",
          "Contenu": "Still waiting for delivery nearly 2 weeks after the order was shipped. Very poor/inaccurate delivery status information also. I've ordered from Crucial quite a few times over the last few years and always had good service, but something has gone badly wrong this time. This has definitely put me off ordering from them direct again."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Paul Hoult",
          "Nb_Reviews": 13,
          "Date": "2023-01-23T16:02:24.000Z",
          "Titre": "Shipping too long.performancee average",
          "Contenu": "Bought direct thinking best price. Never again! Just takes ages. Might as well go with Samsung again and get from Amazon, usually next day! Transferring big video files, (30G plus) performance is very erratic. AJA tests with cache off. Used in USB-C enclosures proven with several other M2 brands."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Derek Hedicker",
          "Nb_Reviews": 4,
          "Date": "2023-10-08T18:17:16.000Z",
          "Titre": "The delivery has still not happened…",
          "Contenu": "The delivery has still not happened despite the order being placed 3 weeks ago!Crucial used to be a good company to deal with but this is sadly not the case anymore."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mike",
          "Nb_Reviews": 10,
          "Date": "2023-08-12T14:00:45.000Z",
          "Titre": "Delivery was slow Acronis Dire",
          "Contenu": "Delivery was slow. Why does your top selling product have to be shipped from the Czech Republic through Germany to the UK. Absolutely bonkers. The Acronis software is dire for disk cloning. Took me 3 days of going through the same procedure to get it to work."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Allan Thompson",
          "Nb_Reviews": 9,
          "Date": "2023-07-12T10:54:44.000Z",
          "Titre": "Great cards, shocking delivery!",
          "Contenu": "Ordered the DDR4 cards for a laptop upgrade, Crucial site was great, The cards took a long time to be delivered - thank UPS for this -doesn't matter, Crucial use them, so it was Crucial's fault. A shame this marked down the scores, but I have to be honest."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Scott Tait",
          "Nb_Reviews": 4,
          "Date": "2023-05-26T01:10:13.000Z",
          "Titre": "0423228693_001",
          "Contenu": "Allleged 10 day shipping wich in itself is a disgrace,  this is day 13 from date of order on the 13th of May,  tracking only showing to be delivered on the 26th of May Not impressed , spring is useless and gets poor reviews itself Your not helping your own reputation"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Arjun Prema",
          "Nb_Reviews": 10,
          "Date": "2022-11-28T13:42:19.000Z",
          "Titre": "Slow shipping",
          "Contenu": "Ordered some DDR5 ram for my laptop on 14th November and its now 28th November and I still have no idea when the Ram will arrive. I thought I had seen something like 5-8 or 8-10 days shipping when i made the purchase from the site but I dont seem to have any confirmation of this anywhere so I am just left in the dark when this would come. The tracking number provided doesn't really give me any useful information on when it is going to arrive just says its been through Czech Republic, Germany and Netherlands and cleared customs but the last update was 5 days ago so who knows really?"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "williams",
          "Nb_Reviews": 10,
          "Date": "2023-07-22T00:02:28.000Z",
          "Titre": "Considering I still haven't received my…",
          "Contenu": "Considering I still haven't received my item yet and your pushing for a review your not doing very well my item was initially out of stock fair enough after around 10 days my item is despatched me thinking it's in the UK and on a royal mail 24hr delivery should be with me the next day or so. Not the case it's coming from Prague then on to the Netherlands in customs now eventually in the UK but not with me yet. So as for service not great as for the item can't tell you I haven't got it yet."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Michael Adams",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T23:28:39.000Z",
          "Titre": "Disappointment",
          "Contenu": "I have  used Crucial.com before and was very impressed by their  products. I purchased  one  of their  500GB SSD and Laptop ram and was very happy with the  product and recommended the site to  others.  However, I recently  had to  upgrade a family  member's gaming pc to upgrade their  memory to 32gb  so  I  used  Crucial Memory ordered 4x 8GB ram dims  got  3 that  worked and 1 defective.  The  original  post  was much faster than  now which is  Much SLOWER than  I remember.  Trying to  resolve the defective 8GB chip has  been unnecessarily difficult  AND SLOW.  I will  not  be using  or  recommending Crucial  again. The  PC has  been with  me  almost 5 weeks or  more.  Unacceptable!"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Rob Francis",
          "Nb_Reviews": 4,
          "Date": "2023-01-13T18:27:40.000Z",
          "Titre": "The long wait for memory",
          "Contenu": "I've bought from crucial in the past and found the product to be excellent. I've recently purchased more memory and expect the quality to be just as good when the memory eventually turns up. This is the essence of my poor review, the delivery time is awful and I'm getting very frustrated. I will very likely try another provider when I next need memory."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "kelvin660",
          "Nb_Reviews": 29,
          "Date": "2023-01-09T15:06:16.000Z",
          "Titre": "Ordered a SSD on 23/12/22 arrived 07/01/23",
          "Contenu": "Ordered a SSD on 23/12/22, and realised it wasn't stocked in the UK and had to come from EU. Due to customs, Christmas and royal mail strikes it wouldn't arrive till early January. In the meantime Argos had a sale of Samsung SSD, so I purchased one and installed it using Samsung Data Migration in less than 2 hours!On 07/01/23 the Crucial SSD arrived. Tried to install it on my wife's laptop using the Acronis TrueImage software. Unfortunately, Acronis said it had cloned my HD successfully, but the SSD failed to boot up when swapped. Eventually, I used Macrium Reflect and it worked first time when the SSD was swapped!Also just mention, Samsung Magician is soo much better/faster than Crucial Storage Executive.I would say that Crucial needs to look at Samsung to see how to make their product better and easier to install..."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "COOLEY",
          "Nb_Reviews": 14,
          "Date": "2023-01-13T22:05:42.000Z",
          "Titre": "Fantastic products let down by poor delivery information",
          "Contenu": "Crucial products are extremely good and are at reasonable prices. The problem is that there is little or no update on shipping information. One of my orders was shown as having cleared a customs zone but had no information as to whether Royal Mail had picked it up. I had to make an enquiry to Crucial and was asked to be patient. Royal mail did eventually deliver the item and I was very satisfied with its performance."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "john muir",
          "Nb_Reviews": 13,
          "Date": "2021-01-27T14:44:44.000Z",
          "Titre": "Support is terrible.",
          "Contenu": "Like many hereI I've used crucial memory for decades and trusted it, returns issues were previously sorted out very efficiently.I recently bought laptop ram + mx500 1tb, thankfully I bought it from amazon. But trying to get some support for their faulty SSD software is impossible, the tech support are really clueless now.For 2 weeks, just been given the run around from the same 3 line script, reinstall, try another pc, check firmware. I've given up dealing with them and are worried if any other issues arise.The performance of both hardware ram + ssd are faultless and I've found to use command line tools that work from their website as a work around.Kinda pathetic considering their stature and technical capabilities previously."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Tom F",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T19:51:09.000Z",
          "Titre": "Crucial unwilling to resolve delivery problem",
          "Contenu": "Selecting and purchasing the memory was simple and I am confident that, if I had received it, it would have fitted. The is that I used Paypal to pay, which meant that Crucial took the delivery address from Paypal, and somehow the first line of the address wasn't included. This meant that the courier couldn't deliver the package, although their system said it had been. I spoke to Crucial pointing out the problem and that they need to contact the courier, as that was the only route to resolve the issue. The Crucial staff member ignored that and told me to contact them instead. I don't know why the address line was missing as it was there in the Paypal account record. I've asked Paypal for a refund as I haven't received what I ordered and apparently Crucial aren't willing to help sort out why."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Keith Mansbridge",
          "Nb_Reviews": 20,
          "Date": "2022-11-27T09:38:54.000Z",
          "Titre": "Firstly it was out of stock then you…",
          "Contenu": "Firstly it was out of stock then you say it has been despatched on Wednesday under 24 hour service. Trouble is you are using Royal Mail that is on strike so still has not even left your premises by Sunday. Maybe arriving in the next week but no idea."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Allan Green",
          "Nb_Reviews": 40,
          "Date": "2023-06-05T13:47:10.000Z",
          "Titre": "Crucial used to have a good reputation…",
          "Contenu": "Crucial used to have a good reputation on both product and service, and I have used them on countless times in the past for both business and personal purposes without comparison until now.I am used to service, and without question ordered a SSD from Crucial, expecting the service I have received in the past.It took 11 days for Crucial to deliver one PCIe SSD. In that time I purchased an alternative product from a more reliable supplier, so wont be bothering with Crucial again."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Martin",
          "Nb_Reviews": 4,
          "Date": "2023-04-20T15:44:09.000Z",
          "Titre": "Terribly slow free delivery lesson learnt!",
          "Contenu": "As always the ordering went well but I should not have gone with free delivery. It was ordered on the 6th and did not arrive until the 18th spending days just sitting in a warehouse. Still having trouble cloning onto it but will try again"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Richard Portsmouth",
          "Nb_Reviews": 53,
          "Date": "2020-07-18T10:29:29.000Z",
          "Titre": "Service has deteriorated",
          "Contenu": "Ordered from Crucial UK. 500GB SSD. Product works well - but the process of receiving product was full of angst. Product dispatched from Holland using Netherlands postal service, Spring. Tracking stopped after it left Holland. Arrived 16 days after order placed. Lucky to receive at all as address label left off my: house name, street and county."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mr Miller",
          "Nb_Reviews": 14,
          "Date": "2023-06-07T23:19:37.000Z",
          "Titre": "Just too slow.",
          "Contenu": "Just too slow.The two items I purchased were shipped from Prague to near Bristol in the UK and took a week.I could have bought the two or equivalent items from Amazon with next day delivery for about £10 more, but wanted to support the manufacturer more. Anyway lesson learnt."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mr Robertson",
          "Nb_Reviews": 2,
          "Date": "2020-09-05T13:59:42.000Z",
          "Titre": "Delivered from Netherlands at snails…",
          "Contenu": "Delivered from Netherlands at snails pace. 10 days for an in stock item to arrive. Like many on here I wish I'd checked before ordering from Crucial again. In the past they used to ship from the UK, but now they're shipping from the Netherlands. It took five days for the package to even leave the Netherlands and that's for an item that was in stock.Two stars as the memory worked fine when it eventually arrived, but do yourself a favour, give your custom to a company that actually wants your business. There's no excuse for a delivery system this poor."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Stefan Baron-Kordecki",
          "Nb_Reviews": 20,
          "Date": "2022-12-23T20:19:02.000Z",
          "Titre": "Drive is good, cloning software is garbage",
          "Contenu": "The drive it’s self is pretty good but the cloning software is garbage. I was led to believe it was quite a straightforward process and a novice could do it, Wrong. I had to get an I.T expert to do it in the end"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Plum Martin",
          "Nb_Reviews": 1,
          "Date": "2020-06-08T15:46:11.000Z",
          "Titre": "Service quality in rapid decline.",
          "Contenu": "The products are good but the company has suddenly dropped in quality.They dispatched an order 4 days after I cancelled (within 5 mins of it being placed) it and forcing me to pay postage to Czeck Republic as they have closed their UK distribution centre.The cancellation link on the UK website directs you to the wrong team who cannot cancel, and the correct email address to contact is not shown.1 star for service, they can have an extra star as the product is actually good."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mr Robert Gillard",
          "Nb_Reviews": 2,
          "Date": "2023-05-16T10:53:11.000Z",
          "Titre": "Delivery time was far too long",
          "Contenu": "Delivery time was far too long - prob thanks to Brexit and shipment issues from Czech Republic If it had been mission crucial then it would have been serious"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Fuzzy Disco",
          "Nb_Reviews": 8,
          "Date": "2023-05-29T10:36:56.000Z",
          "Titre": "Crucially flawed",
          "Contenu": "Took much longer to arrive than would be reasonably expected and the ease of cloning from 1TB to 4TB was not as straightforward as you advertised. The reliance you offer on out of date / irrelevant software and FAQ type support was not helpful either. After a couple of days researching and trying to solve the issue myself including purchasing other third party software  (which didnt work), in desparation I upgraded the software you supplied with the full and proper version from Acronis. This fixed the issue almost immediately. It wasn't rocket science. Windows will only recognise and use up to 2TB. Anything above that has to be partioned as another drive. If you can't be bothered to consider a decent use case for cloning from Windows to a larger than 2TB hard drive (Costing £300+) and also, keep your support software and instructions up to date, then I don't think I can be bothered to shop with you again any time soon. Very disappointing."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Henry Towers",
          "Nb_Reviews": 2,
          "Date": "2023-02-08T12:33:19.000Z",
          "Titre": "Two weeks and still in transit",
          "Contenu": "I ordered the ram upgrade on the 26th of January 2023. It is now the 8th of February and the product is still in transit. I realise that the royal mail are having issues after a cyber attack but using an alternative carrier would have mitigated the issue."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Scott",
          "Nb_Reviews": 2,
          "Date": "2020-09-23T10:27:03.000Z",
          "Titre": "The item arrives and the nightmare began...",
          "Contenu": "I ordered the part. It came quickly. I had to return the item because it wasn't compatible, and this is where my nightmare starts. Do not follow any of the advice given to you by the 'Live Chat' or the Helpline. I actually wanted a refund, but the 'Live Help Advisor' told me I could  order what RAM I wanted by clicking the replacement button rather than the refund button. This was not true. It wasn't long before I realised English was not his native language and he simply didn't understand what I was asking him. I tried the phone line but had the same problem. I eventually got the matter sorted, but had I known that their Helpline and Live Help wasn't based in the UK or another native speaking country, I wouldn't have bothered."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "CustomerJS",
          "Nb_Reviews": 13,
          "Date": "2023-05-12T17:38:27.000Z",
          "Titre": "Under the impression that you are…",
          "Contenu": "Under the impression that you are buying from Crucial UK when in fact the order comes from Czech Republic. I would have looked at alternatives to get the Ram sooner."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Ray Ursell",
          "Nb_Reviews": 6,
          "Date": "2023-02-23T22:39:59.000Z",
          "Titre": "Product is excellent.....but getting it is a nightmare",
          "Contenu": "Product is excellentCrucial seem to want to charge £8 for fast delivery.  Too much for a letter!I opted out and was treateed to an 8 day catalogue of movements of my memory from CZ to GY to HL to UK and then the Royal Mail hub.  This is far too long and this is not the Crucial I have purchased from over many years.  I will find another supplier next time."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "BossPlayer",
          "Nb_Reviews": 3,
          "Date": "2023-07-21T19:19:44.000Z",
          "Titre": "Shoddy delivery service. it took nearly 3 weeks.",
          "Contenu": "the ram was meant to be next day delivery, it took nearly 3 weeks to arrive. Also, the sales rep, I spoke to regarding delivery status was not helpful."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Stephen Carpenter",
          "Nb_Reviews": 2,
          "Date": "2022-12-07T00:50:56.000Z",
          "Titre": "Whatever has happened to your delivery…",
          "Contenu": "Whatever has happened to your delivery times, this order took over a week to arrive, far too long in 2022, you need to get a distribution hub in the UK. It's back to Mr Memory for me :-("
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Matt Stilwell",
          "Nb_Reviews": 10,
          "Date": "2023-09-24T11:45:31.000Z",
          "Titre": "Don't pester for reviews.",
          "Contenu": "Product fine, five stars. Pestering for reviews sadly is so annoying, so only two stars in the review."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "MR Breeze",
          "Nb_Reviews": 12,
          "Date": "2023-06-17T13:29:22.000Z",
          "Titre": "Only order if your happy to wait 2 weeks.",
          "Contenu": "The products themselves are first rate. However Crucial no longer have customer services or a fulfillment centre in the UK. This means paying for express delivery just means receiving your order in 13 days instead of 14. Customer services were of little help. Just repeating the same sentences,  and making zero acknowledgement of my request to look at the tracking info they had provided. This tracking showed the items didn't ship for 13 days then suddenly did. Customer services were adamant they had shipped but chose not to address facts in black and white. I could have ordered the same goods from amazon with next day delivery for cheaper, even with the sale price and discount code so it was quite underwhelming. Eventually C.S refunded my carriage fee. Worth noting I had placed 2 orders at the same time. 1 normal free shipping,  1 express. Had the royal mail not mis sorted the normal one, it would have arrived a day before the express rather than the same day. Had Customer services said the goods will take 2 weeks to come from Thailand to Eastern Europe fulfilment Centre, or they are being built at the factory for example , I would not have panicked. They did not give any reassurances, ignored their own tracking information and it took multiple emails over 2 weeks to make zero progress. I love Crucial products.  Had it been clear delivery is a 2 week lead time, I'd have ordered elsewhere and not have a 2 week delay to my upgrades."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Ped S",
          "Nb_Reviews": 6,
          "Date": "2022-11-10T14:00:00.000Z",
          "Titre": "Sadly feels like a company gone bad. Poor from beginning to delivery and packaging..",
          "Contenu": "Sadly feels like a company gone bad. Poor from beginning to delivery and packaging. Can only get worse if memory also fails! Packaging to protect something as fragile as a memory stick was near nonexistent! Large envelope with thin bubble wrap, no box! for memory stick to swim around. The verse: bought some memory on the 8th of May and stated 5 to 10 days delivery Which I was ok with. Now realising they mean business days so in effect one to 2 weeks. Given all other deliveries are broadly back in normal delivery time It still took 12 days.On day 11, I contacted customer support as the tracking link didn't work. After being reassured to wait a few more days, I checked the link, and the memory was coming from the Netherlands! Arrived today, pushed through the letterbox. Callous decision to put fragile memory, with no box, inside a large envelope with slim bubble wrap. I mean, this thing has been swimming across Europe for 12 days! It'll be a small miracle if it still works!"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "COOLEY",
          "Nb_Reviews": 14,
          "Date": "2023-01-17T00:14:09.000Z",
          "Titre": "You sell great products at reasonable…",
          "Contenu": "You sell great products at reasonable prices, plus your PC scanner to find compatible products is amazing.  However the delivery information is not very good plus the actual delivery time is too long."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "stuart dowson",
          "Nb_Reviews": 15,
          "Date": "2023-05-13T17:31:39.000Z",
          "Titre": "You advised that the item would be…",
          "Contenu": "You advised that the item would be posted Royal Mail 24hr tracked,I didn't realize that it had to be shipped from outside the UK first and took actually 14 days to arrive."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Judith Moore",
          "Nb_Reviews": 21,
          "Date": "2023-03-13T20:07:24.000Z",
          "Titre": "Bought a 500gb SSD P3 Plus to replace…",
          "Contenu": "Bought a 500gb SSD P3 Plus to replace SSD in Dell laptop, but it failed after about 2 months contacted support at Amazon who transferred me to Crucial support who were unhelpful, Amazon stepped in and  will replace the SSD in the next day"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Alex Campbell",
          "Nb_Reviews": 11,
          "Date": "2023-02-13T00:16:14.000Z",
          "Titre": "Slow Delivery",
          "Contenu": "Very slow delivery. Crucial was always my go to for clients upgrades. I will no longer be using this service."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Chris King",
          "Nb_Reviews": 12,
          "Date": "2023-05-31T22:26:55.000Z",
          "Titre": "A complaint from a customer in the UK…",
          "Contenu": "A complaint from a customer in the UK who ordered from UK-CRUCIAL.COM, but as yet hasn't receive their goods despite the fact I was advised it was on 24 tracked delivery from RM. I ordered 2 x 32gb SSD for my PC from uk-crucial.com on the 17th May. On the 18th May, I was advised of the RM tracking number on Royal Mail 24. However the info on RM never updated, and by 22nd May, the tracking had not changed and there was no record of the goods being processed via RM.I contact RM who advised they hadn't received it and if they had, that it would be in their system in under 12 hrs. I contacted Crucial twice on Monday 22nd May and on both instances I was misfed information and it was not made clear. The first online support agent, told me that it was near a weekend and the system in RM had not had a chance to update - I needed to allow 10 days. - yeah right, it was not a Bank Holiday weekendThe second support agent again said was part of the Spring shipping (This was never explained to me), it could take 10 days and if i hadnt received it by 2nd June, to contact them again.Today I contacted them again by phone, this time it started to be clearer, the memory I ordered came from Prague, it is shipped by a courier company called SPRING, and travels from Prague to UK on their service and then when it arrives in UK, it is picked up by Royal Mail on a 24 hr delivery. They supplied me with the link to Spring, and I can see my goods were shipped on the 18th, and currently on the 23rd May its in Germany, I was advised it will hit the UK for delivery on 25th or 26th May, with the latest being Monday 29th May!So the information about 24hr Royal Mail is in effect not true, its only 24hr from when Royal Mail receive it, which will be 9/10 days from when it was \"posted\" in Prague. Be warned. NOT a good service and I would suggest using Amazon who will deliver on Prime in 24hrs! It would be helpful is UK Crucial advised their customers of the International part and that goods can take longer and not to rely on the RM Track 24 number!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MR ANDREW MERCER",
          "Nb_Reviews": 2,
          "Date": "2022-11-19T02:15:51.000Z",
          "Titre": "Renegade on order after reasonable…",
          "Contenu": "Renegade on order after reasonable delay and finally cancelling my order without due time to answer final email after a lot of trouble getting through to them."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2023-03-02T00:13:02.000Z",
          "Titre": "Quoted 2 weeks delivery",
          "Contenu": "Quoted 2 weeks delivery. Didn't take that long but still took over 1 week, which is terrible in this day and age."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "W J A Johnston",
          "Nb_Reviews": 47,
          "Date": "2022-12-06T10:58:43.000Z",
          "Titre": "Poor Customer Service",
          "Contenu": "You will find two updates below, following on from exchanges with the company over their chat. The response from Crucial relates only to the first review of 26th November.Original review 26th November.At the time of writing I am not reviewing the product - I can't; it hasn't yet arrived - but Crucial's customer service.I ordered a solid state drive on 18th November (a Friday). What has become apparent is that Crucial simply do not work at weekends. The money was not, according to my credit card, taken until the following Monday, 21st.More to the point, there is no contact email address, and the only means of contact are via Chat or 'phone, with these services only operating during business hours Monday to Friday.Be warned, these items are shipped from the Czech Republic. That shouldn't really be a problem - except that the item then took days to reach Holland (via Germany). It then, according to the tracking record, left Holland on 24th November. It is now 26th, and the item appears to have disappeared into the ether. There is no record of it having reached the UK.Today is a Saturday, so there will be no possibility of chasing up the company until Monday.Maybe it will arrive on Monday. Regardless, having such limited means to contact the company means that I shall certainly hesitate before ever buying anything else from Crucial.I know that Crucial make good products. These difficulties with contacting them, however, make for poor advertising for the company as a whole.Update on 2nd December.I have now reduced my overall opinion of Crucial from two stars to one star.It is now eight days since my order left The Hague en route to the UK, having previously taken three days to reach Holland from The Czech Republic.It is clearly lost, but Crucial still insist - during the course of a long chat (and despite the advice that I could \"escalate\" the matter; see their response below) - that I wait the full ten business days before they will \"help\" me with a refund. Incidentally, ten business days does not count from the day that I submitted the order, but from the day that Crucial submitted the order to the courier. Since it is impossible to contact the company over the weekend I shall have waited well over two weeks for an order which, barring total miracles, will not arrive, and they know it will not arrive. I asked them three times whether there was any additional information they could provide which might lead me to believe otherwise. On each occasion they simply ignored the question.The suggestion in Crucial's previous response that Royal Mail strikes might be contributing to the delay is a complete red herring. The strikes would not have prevented the handover from Spring, the original carrier, to Royal Mail. RM, on their own website are quite clear that they are expecting the package, but have not so far received it.There is also, contrary to the information provided by Crucial in their response, no email contact listed on the link they cite.Final update - 6th DecemberAnother tedious 40 minutes on Crucial's Chat. They did finally agree to make an immediate refund; though no offer of compensation. What they offered me was ten per cent off my next order; as though I would even consider ordering anything else off them after this experience.I have upgraded this review to two stars. At least the refund did indeed come through within minutes."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Aaron Eager",
          "Nb_Reviews": 1,
          "Date": "2022-11-25T09:10:05.000Z",
          "Titre": "Order took too long and you sent the…",
          "Contenu": "Order took too long and you sent the wrong cable to connect the hard drive to my laptop"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "roger guiver",
          "Nb_Reviews": 21,
          "Date": "2023-01-11T23:56:10.000Z",
          "Titre": "It took sooo long to arrive",
          "Contenu": "It took sooo long to arrive, I thoink i'm right in thinking it had to come from poland!"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Peter Thorogood",
          "Nb_Reviews": 3,
          "Date": "2023-04-30T13:53:28.000Z",
          "Titre": "Arrived but tracking terrible and…",
          "Contenu": "Arrived but tracking terrible and trying to get hold and receive reply's terrible"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Steve JC",
          "Nb_Reviews": 6,
          "Date": "2022-10-28T13:49:11.000Z",
          "Titre": "Slow",
          "Contenu": "I first ordered memory for my PC several months ago, which was shown as being in stock. Immediately it went out of stock and never came back. Eventually Crucial cancelled the order. I subsequently ordered slightly different but compatible memory. That took 10 days to arrive. Although it is now installed and working as it should, the whole process was just too slow."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Daniel Young",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T15:29:59.000Z",
          "Titre": "I still don't have my memory upgrade."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Dave Lyon",
          "Nb_Reviews": 1,
          "Date": "2020-04-24T06:47:28.000Z",
          "Titre": "Had to cancel order to get items delivered",
          "Contenu": "Ordered some kit from them using the express delivery (1-3) day option.  Showed all kit was in stock at time of order.  3 days pass, order still showing as in progress, get on live chat to them, get told waiting on a part to come back into stock, give it 24 hours.  Check again 24 hours later, after seeing part is in stock on the website, then goes out of stock the morning after.  Contact support again, get told to wait a week until part comes in.  Ask how they can show the part as in stock on day of order but not allocate the stock to the customer that ordered it, and how stock can come back in and not be allocated for an already placed order (This was an 8GB stick of 2666 RAM, don't think that people were buying hundreds of these).  Get told that my order is a priority order and that I need to wait a week, delivery will be refunded, no response to my question on allocation of stock.  Contact support later in the day to arrange a cancellation as not wanting to wait another week for kit to be delivered, customer service tries to tell me that this is a priority order and that they are working on getting this kit out and that due to CoVID it may take some time, again completely ignoring my request.  Pushed for a cancellation, got a cancellation request number.Got a text on my phone at 6pm yesterday telling me that UPS have a parcel for me, after checking the origination country find out it is Crucial, so had to cancel my order to get them to send me the equipment that was ordered.  If this had been due to CoVID I wouldn't have minded (have some stuff ordered with another supplier that can't get it to me because of the lockdown), this is poor stock management and mis-allocation of purchases.Customer service only try and fob you off with excuses and time lines that mean they don't have to deal with you for a while."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "aleks",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T12:03:21.000Z",
          "Titre": "ram comparability",
          "Contenu": "i ordered a ram online, it arrived in perfect condition but the only problem that occured is that when i installed it, it made my laptop much slower which i have no idea why and tried to revert it though nothing really worked, perhaps next time people can know what ram can work with what brand before only knowing if it’s compatible or not to the pc/laptop"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "ANO User",
          "Nb_Reviews": 1,
          "Date": "2022-12-15T12:07:27.000Z",
          "Titre": "Not here yet",
          "Contenu": "Easy enough to order but too early to ask me to give a review when the item hasn't arrived yet."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Nigel",
          "Nb_Reviews": 13,
          "Date": "2022-10-13T06:56:14.000Z",
          "Titre": "Free delivery …",
          "Contenu": "It should be made clear on the site that the free delivery option is (appallingly) slow.  It turns out it’s an 8 day expected delivery time, mainly because it’s coming from the Czech Republic, which is also not made clear.  Chat support is no help either and the advisor disappeared mid-chat after telling me what I already knew.  Just a bit of upfront clarity and honesty on the Crucial website would avoid all these poor reviews about delivery (not the product)."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Steve Proffitt",
          "Nb_Reviews": 3,
          "Date": "2023-02-04T00:49:18.000Z",
          "Titre": "Awful communication on delivery",
          "Contenu": "Awful communication on delivery. Free delivery is 10 working days so if you're desperate you should pay for delivery."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Keith Clarke",
          "Nb_Reviews": 21,
          "Date": "2022-10-03T14:34:40.000Z",
          "Titre": "Fast disk, slow delivery",
          "Contenu": "As ever, the Crucial hardware was second to none, but the delivery process was painfully hopeless, the tracking worse. Seeing a fast SSD make very slow progress across Europe, apparently by packhorse, is not much help when you have a failing disk. No option of express delivery. Why?"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Phil",
          "Nb_Reviews": 4,
          "Date": "2022-09-21T17:38:04.000Z",
          "Titre": "Inaccurate Shipping Detail",
          "Contenu": "When the order was placed the shipping detail implied 24 hours (one working day).  Well, that was correct once it was in the UK.  Items took one week to get from Czech Republic.  If they had been honest about the delivery time I would not have minded but this generated a delay in work on my side.  I hope the products are good as this delay has prevented installation at this time."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Aaron Reese",
          "Nb_Reviews": 1,
          "Date": "2022-11-21T11:00:32.000Z",
          "Titre": "Items out of stock and on back order…",
          "Contenu": "Items out of stock and on back order for more than 2 weeks"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Ronald Cork",
          "Nb_Reviews": 19,
          "Date": "2022-09-16T16:18:44.000Z",
          "Titre": "Cannot coment on articles at moment as…",
          "Contenu": "Cannot coment on articles at moment as I have not received them yet. When i ordered the items easily enough I then received an e-mall informing me there had been a run on the items and I would possibly have to wait seven days until new stock is available for which I am still waiting delivery."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mr michael oon",
          "Nb_Reviews": 8,
          "Date": "2022-09-06T18:42:16.000Z",
          "Titre": "The delivery was too long and misleading",
          "Contenu": "The product was OK and worked the first time but1. I had no instructions on where to get the 10% discount as promised in the email. I had to contact the helpline.2. On the Crucial confirmation email, it refers to a Royal Mail 24 hr delivery service. In fact, delivery is 5 to 7 working days - ordered on Wednesday and delivered on Friday of the following week. This is not only misleading but it is too long when Amazon does next-day deliveries regularly."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Ian Fury",
          "Nb_Reviews": 1,
          "Date": "2022-08-17T14:22:05.000Z",
          "Titre": "I used the crucial scan programme to…",
          "Contenu": "I used the crucial scan programme to assess upgrade options for my laptop. I chose new memory on that basis. Unfortunately the memory that I received was for a desktop and not compatible. Upon further investigation there isn't anything I can do to increase the memory in my laptop either as It is at maximum. Crucial have agreed to a refund so no complaints in that department."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mr Crawford",
          "Nb_Reviews": 10,
          "Date": "2022-09-06T14:33:02.000Z",
          "Titre": "For a cutting edge tech company I was…",
          "Contenu": "For a cutting edge tech company I was appalled that a simple mistake on my address could not be rectified. The answer given was to cancel and reorder (with a wait for funds to be returned). Shockingly bad!!! The SSD is awesome!"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Andrew Noakes",
          "Nb_Reviews": 8,
          "Date": "2023-02-21T19:33:41.000Z",
          "Titre": "Check lead times",
          "Contenu": "Good product but delivery took far to long."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Carl G",
          "Nb_Reviews": 1,
          "Date": "2022-07-05T21:32:35.000Z",
          "Titre": "Awful service",
          "Contenu": "Ordered “in stock” components on 5-8 day delivery. 18 days later 1 component has apparently shipped from Czechoslovakia, the other 2 are out of stock for another 5 working days (allegedly)… no timescale for actual delivery so suspect being spun a line. Support blame it on a technology update - that’s right a technology company that hasn’t managed a technology change properly. Awful service. 1st and almost certainly last order."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Adam",
          "Nb_Reviews": 164,
          "Date": "2022-10-18T08:25:23.000Z",
          "Titre": "Disappointing.",
          "Contenu": "Got a message saying my drive had been dispatched yesterday by Royal Mail tracked 24 via Spring Global(who?) , but that tracking hasn't updated at all, so my guess reading the comments here, is it hasn't been dispatched by Royal Mail tracked 24 at all, and will be arriving from somewhere abroad at some point. Why isn't this made clear when ordering, as I'd have gone elsewhere to get it quicker? I note that the company say there are quicker delivery options, but there weren't any when I placed my order. Seems quite deceitful to me. Disappointed.Update : Four days on, and the Spring tracking is still showing 'Parcel created', no dispatch at all.Further update :Crucial customer service contacted me to say the item was dispatched on 12th October, so how come the tracking link they provided, shows the parcel as not being accepted by the carrier until late at night on 17th October after their initial response? So still another 8 days or so to go...."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Graham Endeacott",
          "Nb_Reviews": 20,
          "Date": "2022-10-11T15:18:03.000Z",
          "Titre": "In stock but where?",
          "Contenu": "I purchased an item that was supposedly in stock; it was in stock but in another country and took about two weeks to arrive. Not impressed."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Elliot",
          "Nb_Reviews": 7,
          "Date": "2023-01-22T12:14:12.000Z",
          "Titre": "Snail Mail.",
          "Contenu": "Postage took forever. Just short of two weeks to arrive."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Peter",
          "Nb_Reviews": 10,
          "Date": "2022-04-01T12:11:16.000Z",
          "Titre": "Poor delivery.",
          "Contenu": "Ordered SSD on 1st March, told it was out of stock and on order.  Rang a couple of weeks later and although now in stock was told delivery would be 11th May!  After protesting told it was being shipped on 22nd March, Royal Mail 24hr but it was in the Czech Republic.  Arrived at the end of March, over four weeks in total.  Could have got item from Amazon next day delivery!"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Rob McKenzie",
          "Nb_Reviews": 22,
          "Date": "2022-03-30T07:27:36.000Z",
          "Titre": "Poor Delivery Times",
          "Contenu": "I have not yet received my order and that is why this is a poor review. I ordered from Crucial UK but it turned out the item came from Czech Republic. I ordered on 22 March 2022 and as I write on 30 March 2022 it is still in Europe en route.I asked customer service it it seems this is within the delivery terms (8 business days).To me this is not Crucial UK but Crucial Europe. In future if I buy Crucial products I will buy from UK suppliers"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Dennis",
          "Nb_Reviews": 32,
          "Date": "2022-03-29T21:32:28.000Z",
          "Titre": "The RAM was a great boost BUT be warry of the SSD cloning software.",
          "Contenu": "The RAM was a great boost. However, the disk clone software to port the system to the SSD failed to produce a bootable drive.  After several tries I just installed a new Windows 10 on the SSD and restored my data from a backup.  I lost all the installed apps and much of my personal system configuration"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Stuart Bingham",
          "Nb_Reviews": 1,
          "Date": "2022-09-14T12:46:14.000Z",
          "Titre": "Ordering process slick, but terrible shipping.",
          "Contenu": "Ordering process slick, but terrible shipping.It took 2 weeks for the memory to arrive. Customer expectations in this day and age are around 24/48 hours."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Richard Gear",
          "Nb_Reviews": 42,
          "Date": "2022-10-27T21:26:47.000Z",
          "Titre": "Double memory and SSD",
          "Contenu": "Double memory and SSD, your own downloadables shows no improvement.Waste of money I guess."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Dennis Major",
          "Nb_Reviews": 9,
          "Date": "2022-10-16T13:42:31.000Z",
          "Titre": "I should have gone to Amazon",
          "Contenu": "I ordered an upgrade to my computer from Crucial on Thursday the 6th October assuming that it would arrive early the following week as I have the week off and can install the upgrade without affecting my work. I did not realise that free delivery meant appalling delivery as it sat for days in the Czech Republic and has not yet arrived in the UK over 1 week later. There was no indication on their site about how long it would take to be delivered and, having found out that it was coming from Prague, there was no option to cancel the order and order from someone else.This is appalling service from a well-respected company which does nothing to enhance their reputation. I wish now that I had bought it from Amazon as it was available with next day delivery. I will never shop with Crucial again.Having seen Crucial’s reply and other comments similar to mine, it seems that the information on shipping times is not clearly stated when people order from the site. Rather than simply repeating what they said to others, they should take steps to ensure that people are really clear about the shipping times for different delivery options."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mike Mcmahon",
          "Nb_Reviews": 7,
          "Date": "2022-07-07T15:09:20.000Z",
          "Titre": "Great product and service let down by slow delivery",
          "Contenu": "The web service and pc scanner are superb. With every pc components are different and this tool is an asset. However the lack of tracking and really slow delivery is the let down in overall service"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Jools",
          "Nb_Reviews": 5,
          "Date": "2021-05-27T07:40:51.000Z",
          "Titre": "Everythig was fine until UPS turned up…",
          "Contenu": "Everythig was fine until UPS turned up at my door asking for imprt duty and handling charge.  After twice being on the phone to UPS for over 40 minutes on hold it turned up out that the UK importers address for paying the VAT was not linked to the shipping order.  As a result it was over two weeks before I got my SSD instead of the 3 day delivery I paid for."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Jimg2247",
          "Nb_Reviews": 18,
          "Date": "2021-05-13T06:36:19.000Z",
          "Titre": "Great product but abysmal delivery",
          "Contenu": "Crucial produce probably the best memory and SSDs but delivery is incredibly poor. I spoke to their customer service to explain that my hard disk was dying and I urgently needed a replacement SSD and was willing to pay for a quick delivery. It took eight days from ordering to delivery.  I could have bought from a local supplier with next day delivery at no extra cost. No doubt they will blame COVID.  Great product but poor delivery times."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Paul Young",
          "Nb_Reviews": 6,
          "Date": "2021-06-10T09:58:02.000Z",
          "Titre": "I cancelled the order and they sent it…",
          "Contenu": "I cancelled the order and they sent it anyway. They sent a dispatch email around 7 days before they actually shipped it, as shown by the tracking. As a result, it took around 2 weeks to arrive from when the dispatch email was sent. To add to this poor experience, the customer service representative I spoke to to find out why it had been dispatched, despite having cancelled the order, was very abrupt and unhelpful. A real shame as the product was very reasonably priced and works very well."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Stephen Peterson",
          "Nb_Reviews": 9,
          "Date": "2021-05-26T18:55:10.000Z",
          "Titre": "Too Expensive",
          "Contenu": "I was asked by Crucial to write a review so here it is. No problems with the SSD, that gets 5*. However the cost of the unit from Crucial.com, with the wrongly named \"express delivery\" (3 days to arrive from ROI) was £65.92. What I should have done, and I'm kicking myself here, is looked on Amazon. As a Prime Member I could have got exactly the same unit, delivered the next day, for £55.98 and spent the spare £10 on something useful, a bottle of wine perhaps. Crucial you need to pull your socks up!"
        },
        {
          "Note": 2,
          "Lieu": "ES",
          "Pseudo": "Pritpal Singh",
          "Nb_Reviews": 9,
          "Date": "2022-07-01T12:01:23.000Z",
          "Titre": "Customer services in India are poor",
          "Contenu": "Customer services in India are poor, couldn't help or understood the poor. Eventually I fixed the problem myself and all was in working order. Not really qualified to work"
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "SM",
          "Nb_Reviews": 5,
          "Date": "2021-05-27T04:47:12.000Z",
          "Titre": "Excellent product - sloppy delivery",
          "Contenu": "Crucial makes an excellent product, there is no refuting that. Buying off their website takes way too long. It is much quicker to buy from a 3rd party dealer.3 days to create a parcel/package and ship it.6 days to ship. (there is no faster shipping option)."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mr",
          "Nb_Reviews": 3,
          "Date": "2021-05-14T13:02:44.000Z",
          "Titre": "I would never have bought these RAM…",
          "Contenu": "I would never have bought these RAM sticks if i'd known they were going to come all the way from the Czech Republic, and Germany.Waiting all that time for them to be delivered while my new PC parts were'nt able to be installed."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Jonathan Warriner Jono",
          "Nb_Reviews": 2,
          "Date": "2022-08-26T19:01:16.000Z",
          "Titre": "I didn’t receive my parcel.",
          "Contenu": "I didn’t receive my parcel.Due to an auto fill error on my phone it pasted the wrong postcode ## Wessington LaneSouth WingfieldDE24 1ABIt should of been## Wessington LaneSouth WingfieldDE55 7NBNow…The funny part is the address to confirm my banking details was also incorrect with the wrong postcode DE24 1AB and should not of processed. That would of made me realise that the address was incorrect due to an autofill error.Now this is more my error then it is yours with the exception of you processing the payment with the incorrect banking address.What I’m really annoyed about is their is no phone number to phone to discuss the error.I sent an email to support but I haven’t received a reply.Royal Mail tracking number no longer exists and I presume it has either been sent back or delivered to an imaginary address.No follow up phone call to confirm if it has been received either.Please get in touch with me to discuss my options… we are talking about £180+ order.07533649015Kind regards,Jonathan"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "John",
          "Nb_Reviews": 7,
          "Date": "2022-04-06T11:49:38.000Z",
          "Titre": "Silly software.",
          "Contenu": "Sent me memory for a laptop which cannot be expanded. Due to my lack of IT skills I asked the software Crucial provides to identify the correct memory. A waste of time and money."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "neil",
          "Nb_Reviews": 2,
          "Date": "2021-05-12T20:06:01.000Z",
          "Titre": "Great product ..But Uk web site thought…",
          "Contenu": "Great product ..But Uk web site thought it was coming from UK but item sent from somewhere in Europe .. 2 week delivery. Time for parts that are required urgently. Deceitful will not use again."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "John Douglass",
          "Nb_Reviews": 4,
          "Date": "2022-12-12T11:15:39.000Z",
          "Titre": "Still waiting for delivery after two…",
          "Contenu": "Still waiting for delivery after two long weeks."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Andrew",
          "Nb_Reviews": 10,
          "Date": "2022-07-30T18:59:21.000Z",
          "Titre": "Order got cancelled",
          "Contenu": "Order got cancelled! I suppose that's better than disappearing with the money, but rather disappointing/"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Customer",
          "Nb_Reviews": 6,
          "Date": "2022-09-23T14:39:08.000Z",
          "Titre": "Nothing on the website explained that…",
          "Contenu": "Nothing on the website explained that delivery time was 8 days (it actually turned out to be 12) and nothing said the delivery was not coming from the UK.Support seemed to be based in India and was the same terrible standard I have come to expect from Indian based support centres.I think all companies should make it clear when they are not based in the UK. I would never have purchased if I had known.There was a cheaper option from Amazon US which I did not take because I thought Crucial would have been quicker. The G.Skill product looked much better, was cheaper and would have got here much sooner.The order was for a laptop that I bought from Taiwan. That got here is 3 days so 12 days from the EU is disgraceful.I feel that not disclosing the location and delivery time is simply fraud. They hide behind UK contact details when they are not in the UK. This should be illegal.Update following comment from Crucial.All of my comments still stand. I should not have to read a shipping policy to clearly understand that you are not shipping from the UK. If you are merely an EU company you should make that very clear.Your response shows that you don't care and that you are hiding behind a shipping policy document.If I cannot clearly see the shipping details you are failing as a company and my review was to make it clear to any other customers in the UK that they woulld be better off purchasing elsewhere."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Sach",
          "Nb_Reviews": 93,
          "Date": "2022-07-08T16:30:32.000Z",
          "Titre": "Very slow delivery",
          "Contenu": "Helpful customer service but very very slow deliver. Will unlikely be ordering direct from Crucial again."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mr Nicholas Giles",
          "Nb_Reviews": 20,
          "Date": "2021-05-14T11:54:34.000Z",
          "Titre": "The replacement SSD was fine BUT!!! - TRULY DIRE SUPPORT.",
          "Contenu": "The replacement SSD was fine.  Cloning over the old SSD to the new using Acronis wasn't straightforward, as the options on the software didn't allow the cloning to happen correctlyIn the end I resorted to calling the Crucial helpdesk.  The man I spoke with gave the impression that he really didn't know what to do and we just blundered through a series of options, none of which solved the problem.  In the end he just hung up on  me, which was ABSOLUTELY POOR SERVICE.I managed to resolve the problem myself in the end.  I'm not really sure how, but by keeping trying, it eventually worked.I have however found that some software seems to think that the install is on a new machine and I have had to resolve activation code issues with software vendors.I'm not completely ignorant on PC matters and have done a similar upgrade on a laptop in the past without problems.I will think very carefully before going down this route again in future.My advice is always buy a bigger drive than you think you'll need in the first place."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Chetan",
          "Nb_Reviews": 8,
          "Date": "2022-07-15T13:13:35.000Z",
          "Titre": "Unbelievably slow",
          "Contenu": "Unbelievably slow.   Ordered some RAM weeks ago.  Has still not arrived."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Andrew Wood",
          "Nb_Reviews": 1,
          "Date": "2023-03-26T21:43:36.000Z",
          "Titre": "Too slow",
          "Contenu": "Takes forever to ship items to UK"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Ashalen Govender",
          "Nb_Reviews": 21,
          "Date": "2021-05-17T07:05:53.000Z",
          "Titre": "Not the best order /product return experience",
          "Contenu": "I will start off by saying I am a huge fan of crucial products and use crucial RAM and Drives in all my computers, for great quality and performance at a reasonable price point crucial absolutely nail it! I've always bought my crucial components from 3rd party sellers this was the first time I purchased a component directly from crucial and the experience was not great. The first issue I experiences was with the website it looked very insecure (it did not seem very professionally set up, it did was glitchy and did not render well) and took a couple of attempts to put my order through. Immediately after I submitted my order I realised that making a mistake on my order and attempted to cancel it, unfortunately, the 'order cancellation' option did not appear on the page despite me just placing my order (and customer service was not available). Once my item arrived I decide to return it as was my right only to be informed by crucial (via e-mail) that I (the buyer) would have to pay for the return postage (not stated on crucial's website return policy) and I would have to post it to the Czech Republic (I am based in the UK) so that would have been tracked international secured postage. Once I received the 'delivered' notification from the courier I contact crucial customer service to confirm delivery which they confirmed (that was 2.5 weeks ago) and I am still waiting for my refund."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Bhaskar Adhikari",
          "Nb_Reviews": 1,
          "Date": "2022-12-13T14:04:58.000Z",
          "Titre": "I haven't received it yet",
          "Contenu": "Delivery time is too long."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "John Ferguson",
          "Nb_Reviews": 3,
          "Date": "2022-08-02T13:45:38.000Z",
          "Titre": "The delivery is really slow",
          "Contenu": "The delivery is really slow. Beware"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mark Turner",
          "Nb_Reviews": 13,
          "Date": "2022-03-30T12:42:33.000Z",
          "Titre": "Took so long to be delivered I have…",
          "Contenu": "Took so long to be delivered I have returned it"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mark Lamb",
          "Nb_Reviews": 8,
          "Date": "2021-05-13T04:57:05.000Z",
          "Titre": "Order was very late",
          "Contenu": "Order was very late. Customer service was pretty awful."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Nova Electronics",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:31:30.000Z",
          "Titre": "Took 3 weeks to arrive",
          "Contenu": "Took 3 weeks to arrive. It's not clear where the stock is held, it's not mentioned on the web site. If memory is in Czechia say so."
        },
        {
          "Note": 3,
          "Lieu": "CH",
          "Pseudo": "BB",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T21:50:36.000Z",
          "Titre": "Customs fees were not included",
          "Contenu": "Customs fees were not included, or even reported as possible. I often buy in the USA, China or the UE and I have never had customs fees, even for much higher amounts.It seems that it is more common via ups than with other carriers"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Sid Francis",
          "Nb_Reviews": 5,
          "Date": "2023-11-07T19:18:36.000Z",
          "Titre": "1tb ssd",
          "Contenu": "Delivery was a little slower than I expected. The software downloaded from Crucial for cloning did not recognise the new ssd and I had to use one from another site which worked well.Otherwise i am very pleased with the purchase."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Mr S Judge",
          "Nb_Reviews": 7,
          "Date": "2023-12-09T09:59:09.000Z",
          "Titre": "ram worked well the p5 plus was dead on…",
          "Contenu": "ram worked well the p5 plus was dead on arrivalspoken to support still no offer of a refund avoid"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "MindMapper",
          "Nb_Reviews": 17,
          "Date": "2023-10-27T01:10:29.000Z",
          "Titre": "Three days late & happy to review at process end.",
          "Contenu": "I did not like the way that, during my two phone calls, the chief aim from the staff spoken-to seemed to be getting good reviews. A request for a review after the entire event is quite okay with me. The item arrived three days late, due Monday and arrived on Thursday. I would have been mollified during the two phone calls, if the full length of the journey was indicated to me at the beginning. I saw part of that distance via a universal tracking app. The item works well."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Frank Smith",
          "Nb_Reviews": 6,
          "Date": "2023-10-18T17:20:02.000Z",
          "Titre": "Available stock disappeared? Comms unclear.",
          "Contenu": "Good quantity of stock item when I placed my order but next day, informed of NO availability.EIGHT days later, after a few confusing emails and a disappointing chat with customer services; my items arrived.I appreciate the 24hr delivery once stock was in the UK but all other aspects were sub-standard."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Chris Bexon",
          "Nb_Reviews": 13,
          "Date": "2023-07-19T22:18:50.000Z",
          "Titre": "Delivery seemed slow by current…",
          "Contenu": "Delivery seemed slow by current standards with most online orders.. Shipping was by UPS, tracking via web & app was ok but no option to divert to a collection point if not home on delivery day. Delivery failed as I was out, then order was delivered to a local UPS service point, which was  a store only open 10-6, which meant a few more days passed before I could get the order."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "fellows",
          "Nb_Reviews": 3,
          "Date": "2023-08-27T14:38:34.000Z",
          "Titre": "Good product, took too long to deliver",
          "Contenu": "The thing I ordered took nearly two weeks to get to me in the UK. I chose crucial because it looked like they were based in the UK (northern Ireland address) but the memory stick was shipped from Poland and took ages. It is a good product and I decided to buy another but delivery was ridiculous, so I found the same product on Amazon for slightly cheaper and next day delivery."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Terry B",
          "Nb_Reviews": 15,
          "Date": "2022-12-17T12:11:42.000Z",
          "Titre": "Very Slow Delivery of RAM from the Czech Republic",
          "Contenu": "The RAM I ordered came from the Czech Republic and took three weeks to arrive! The delay was not caused by postal strikes or Christmas post delays, rather it took some 18 days to clear customs in the Czech Republic, Germany & the Netherlands. A decent product at a decent price but use another supplier if you want your product in a hurry!"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Terry C",
          "Nb_Reviews": 9,
          "Date": "2023-06-05T23:20:14.000Z",
          "Titre": "Lenovo Flex Laptop not as SSD-compatible as claimed",
          "Contenu": "Purchased the Crucial MX500 1TB SSD to replace my a very slow HDD in Lenovo Flex 2 Pro 15 laptop.  The compatibility checked confirmed the SSD was ok for this laptop.  However, after following instructions and cloning disk to SSD, installing SSD, the laptop reporting disk errors during startup and left it overnight to repair.  This was unsuccessful.  In the end I used Windows Media Creator and changed BIOS settings to use legacy mode to reboot to access SSD.  Partial success!"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Andy McAllister",
          "Nb_Reviews": 3,
          "Date": "2023-05-15T12:09:17.000Z",
          "Titre": "Delivered in a timely manner",
          "Contenu": "Delivered in a timely manner, after Covid delays prevented previous order. Not convinced it is right however. Your 'tool' offered me an option of 4GB or 8GB RAM sticks; I ordered 8GB but then noticed the manufacturer recommends like-for-like, so maybe it should have only offered me 4GB. W10 recognises 12GB now but there is no discernible increase in performance."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "C Bruff",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T13:05:07.000Z",
          "Titre": "the SSD was a good product at a good price",
          "Contenu": "the SSD was a good product at a good price.  However I found the purchase information misleading in that it said it was being dispatched by Royal mail 24 hr but it reality it came from Europe so it too about 6 days to arrive."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "U M",
          "Nb_Reviews": 3,
          "Date": "2023-09-19T09:49:52.000Z",
          "Titre": "Does NOT ship from UK",
          "Contenu": "Ive used crucial before, excellent products (ram & ssd), but i think i had purchased those via amazon.co.ukThis time round, i thought to order directly from uk.crucial.com. I wrongly assumed that the extral ssd I purchased would ship inside the UK, and be delivered within 1week max. Nowhere on the website, when i ordered, did i see it mentioned that in fact the external ssd will shipped from Czech Republic. It took 13 days to arrive! (partly due to uk customs) Had I know this, I would have ordered from amazon or curry's or any other place with local stock."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Georgyboy",
          "Nb_Reviews": 33,
          "Date": "2023-02-14T14:24:00.000Z",
          "Titre": "problem with accuracy of updater scan",
          "Contenu": "I used the updater scan to check for best solution. It suggested using a 16gb (2 x 8gb) kit which would be compatible which i subsequently ordered. When attempting to install I found my laptop had only one ram slot so i could only install one of the memory cards. Very disappointing that their scan tool didn't identify correctly my motherboard capacity. The single ram card has speeded things up though!"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Pete",
          "Nb_Reviews": 42,
          "Date": "2023-06-22T16:51:45.000Z",
          "Titre": "The website is a bit \"clunky\" and…",
          "Contenu": "The website is a bit \"clunky\" and having ordered twice now I seem to have done this as a guest even though I have my own account so my orders are not showing on my account. My order arrived within 5 days so cannot complain on this as the website states 5-10 days. Disappointed that you can only register SSD products as I have just bought memory which was more expensive."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Roy Chicken",
          "Nb_Reviews": 16,
          "Date": "2023-05-22T10:12:10.000Z",
          "Titre": "Free delivery took 12 days to deliver",
          "Contenu": "Free delivery took 12 days to deliver, with very scant tracking information. The same memory is available from Amazon with next day delivery.When fitting the memory in the computer, the computer would not boot. The memory was the correct memory as specified by CrucialReturned the memory for a refund. The refund process was simple, just waiting now to receive the deposit into my account."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Simisker",
          "Nb_Reviews": 4,
          "Date": "2023-04-26T20:49:03.000Z",
          "Titre": "Quality RAM, however delivery is deceptively slow...",
          "Contenu": "The RAM is obviously of good Crucial/Micron quality. However, delivery was deliberately misleading: the store implied a UK order with next-day[ish] delivery.In truth, the product gets sent from Czech Republic, and enjoys a bit of interrailing around northern Europe for a week before it even sees our shores.I'll be ordering elsewhere next time, sorry."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Hannah",
          "Nb_Reviews": 4,
          "Date": "2023-04-20T11:01:01.000Z",
          "Titre": "Helpful website but drive didn't last",
          "Contenu": "The website is really helpful for identifying the hard drive you need for your machine, and installation wasn't too difficult. However, the solid state drive I bought from them failed completely after 3.5 years. I am disappointed as I've never had a drive fail that quickly before."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Derek James",
          "Nb_Reviews": 14,
          "Date": "2023-06-13T13:04:41.000Z",
          "Titre": "Slow delivery",
          "Contenu": "Memory was spot on, machine was specced automatically and a set of compatible options created - all good.However delivery was slow, I saw Royal Mail 24 and assumed it would be next day or so, it took 7 days to get from Prague to the UK, Amazon would have delivered much faster."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Leonard",
          "Nb_Reviews": 21,
          "Date": "2023-06-29T11:27:19.000Z",
          "Titre": "I give it only 3 stars because it took…",
          "Contenu": "I give it only 3 stars because it took too long to come from Germany Surely UK customers deserve their own local stockI will look At delivery time frames before ordering next time"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Tautriadelta",
          "Nb_Reviews": 18,
          "Date": "2023-11-03T20:59:33.000Z",
          "Titre": "Acronis True Image Software Was A Letdown",
          "Contenu": "Acronis True Image cloning software didn't recognize that I had installed a Crucial SSD in my laptop, even after I initialized the SSD. The SSD works satisfactorily, but it takes the edge off the experience when you have the additional hassle of downloading and installing other third party software to get it up and running."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Henry Smith",
          "Nb_Reviews": 2,
          "Date": "2022-12-15T11:42:17.000Z",
          "Titre": "Delivery took too long",
          "Contenu": "It took too long for delivery, it took a week to be shipped and another two weeks for delivery. I do understand the post office workers were on strike for a few days. Overall it was not a good experience especially as I needed the disk for a travel trip."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Rod R",
          "Nb_Reviews": 2,
          "Date": "2022-12-10T07:43:11.000Z",
          "Titre": "Incompatible and Postage took ages.",
          "Contenu": "Postage took ages.RAM seemed incompatible with existing internal despite using the scanner app.And after searching I still don't know how to get support.Finally got it working after leaving the RTC battery disconnected overnight.SSD works grand"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "DM",
          "Nb_Reviews": 3,
          "Date": "2023-02-12T22:43:03.000Z",
          "Titre": "Delayed delivery",
          "Contenu": "The SSD and RAM seem fine, now that they have arrived.  The on line purchased suggested they were coming by Royal Mail Tracked 24hr.  However, this turned out to be after the initial 7 days wending its way around Continental Europe!"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Linda montgomerie",
          "Nb_Reviews": 6,
          "Date": "2023-05-23T22:44:54.000Z",
          "Titre": "Memory working but the delivery !!!!no…",
          "Contenu": "Memory plugged in and working no problem, thanks.  But delivery was listed as royal mail 24. But in the small print it says 5-10 business days. It actually took from the 9th to 23rd . I was led to believe it was shipping from Ireland, but shipped from CZ to DE to NE to England to Glasgow to me........ thank goodness it worked. I feel that it needs to be a lot clearer about delivery timescales. Because I'd have bought elsewhere even if more expensive , rather than wait all this time......"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "MARO",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T00:53:28.000Z",
          "Titre": "product is perfect",
          "Contenu": "product is perfect, its just if they can work on their delivery time in the UK its really bad. I should've got the same SSD from amazon next day with prime it was kinda my fault but still not having a storage in the UK mainland for a company like this. still like your products. Took nearly 2 weeks. stick to amazing if you are buying crucial buy it from amazon instead."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Regan Toomer",
          "Nb_Reviews": 6,
          "Date": "2023-01-22T16:14:08.000Z",
          "Titre": "I've been Brexited",
          "Contenu": "Great RAM thank you, automatically identified and easy to install, works fine. Took over 2 weeks to arrive though thanks to Brexit delays, despite great fast service this end from Royal Mail. Crucial needs to either warn about this or keep stock in the UK."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Craig Miles",
          "Nb_Reviews": 6,
          "Date": "2023-03-06T13:30:39.000Z",
          "Titre": "The product is fine, but delivery",
          "Contenu": "The product is fine, it was the delivery.I was reassured that the seller (digital river) was based in the UK.I did notice on payment that the payment address was in Dublin, Ireland, but that I assumed was for tax purposes.Delivery seemed to consist of a very slow meander across eastern and western Europe.Starting in the Czech Republic, then Poland, Germany, Holland, and eventually to the UK.I've purchased from crucial in the past, and got quick delivery, even on the standard postage.This was not quick, this time.Why are my products coming from the other side of Europe.Apart from delivery, product seems fine."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Dr Kolossov",
          "Nb_Reviews": 18,
          "Date": "2022-12-15T12:01:18.000Z",
          "Titre": "Crucial External Storage",
          "Contenu": "Delivery took near two weeks which is not good at all. Recommended Crucial Storage Executive application would not recognize this external drive, so it is useless... Drive itself is good and quick, easy recognized by Windows system."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Jason",
          "Nb_Reviews": 10,
          "Date": "2023-02-23T20:22:43.000Z",
          "Titre": "Expect a longer delivery time.",
          "Contenu": "I didn't like not knowing when my order would arrive.  The selected shipping stated 24hr but no mention that the package initially ships from Prague which added a week to that 24hr period.  Ordering was as always fairly easy though your detector didn't recognise my HP Pavilion 15 laptop."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Laurence Payne",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T22:27:27.000Z",
          "Titre": "Cloning software doesn't work",
          "Contenu": "I bought the SSD after running Crucial Advisor on the relevant computer.  But the supplied Acronis cloning software didn't work because of incompatible sector sizes.  After considerable research I found a program that WOULD do the clone.  But, as supplied, the product was useless."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "TMaxxUK",
          "Nb_Reviews": 8,
          "Date": "2023-05-17T07:06:06.000Z",
          "Titre": "great product",
          "Contenu": "great product, tracking and delivery were shocking, no regular updates. if ordering again, will go via Amazon, as things arrive next day and not 10+ days later."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T17:52:29.000Z",
          "Titre": "Product sent from EU took too long to come to UK",
          "Contenu": "The product is fine, but sending the item to the UK from Eastern Europe definitely isn't, as it took a good week to arrive, when it was needed urgently.  If you are in a hurry go elsewhere."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "John G",
          "Nb_Reviews": 10,
          "Date": "2023-01-19T19:25:11.000Z",
          "Titre": "Order was good but Delivery was slow !",
          "Contenu": "Easy to find what compatible part I heeded and ordering ok but delivery was disappointing as it came from abroad and arrived on the 19th but ordered on the 5th so well over 5-8 working days stated. In fairness it was easy to track to see progress but still long delivery period from irder"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "rc169",
          "Nb_Reviews": 14,
          "Date": "2023-09-14T09:51:53.000Z",
          "Titre": "You do very well but four days after…",
          "Contenu": "You do very well but four days after you informed me the item had been dispatched royal mail are still expecting it and unable to give me a delivery date"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Walter Hutton",
          "Nb_Reviews": 1,
          "Date": "2023-05-21T09:31:50.000Z",
          "Titre": "I love the product I bought but.....",
          "Contenu": "I love the product I bought, I loved the price, the only thing that disappointed was the delivery time. I've bought memory in the past and it was here next day, the NVMe drive I bought was shipped from Prague and took a long time to arrive which was disappointing as I needed it quicker for a project I was working on. It's here now and I'm very happy with it. My rating is due to delivery time and certainly not the product."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "James",
          "Nb_Reviews": 16,
          "Date": "2023-03-03T23:19:22.000Z",
          "Titre": "Great product but shipping was v slow",
          "Contenu": "Great product but shipping was v slow - sent from other side of Europe and took 1 & 1/2 weeks to arrive when I could have got from Amazon next day! Packaging for transit also too light and lucky ram wasn't damaged"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Michael Maciocia",
          "Nb_Reviews": 20,
          "Date": "2023-01-11T16:35:07.000Z",
          "Titre": "the drive is great",
          "Contenu": "the drive is great, the recommended software to migrate your drive - terrible!took me 2 full days on an i7 computer to move a 75% full 1 tb drive to a 2tb, the acronis software failed miserably, in the end I had to re-jig the PC and use the copy function of MiniTool Partition Wizard which did the whole copy, sizing, in 2 and a half hours!"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Ananda Amatya",
          "Nb_Reviews": 5,
          "Date": "2022-12-29T06:47:21.000Z",
          "Titre": "Everything seems to be fine with the 8…",
          "Contenu": "Everything seems to be fine with the 8 HB memory bought from Crucial.There was a long delay in its arrival due to  Royal Mail strike and the Christmas time volume of mail needing to be delivered.The cost of the memory was pretty high compared to others available in the market. Had I gone to Amazon I could have received an equivalent memory for half the price and lot quicker due to amazon’s own delivery service.The only reason I chose Crucial was I had been a customer with the company in the past. I was very happy in the past. I still trust Crucial but I think it’s pricing needs to be competitive."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Andrew Hyde",
          "Nb_Reviews": 1,
          "Date": "2023-02-07T15:59:29.000Z",
          "Titre": "Crucial SSD 4TB MX500 SSD",
          "Contenu": "Reviewing the Crucial 4TB MX500 SSD and 2 x 8GB DDR3L 1600 memory - purchased to speed up an aging PC. All worked fine and the PC running faster than it ever has. Have no issue with the components and would give 5 stars - I’ve always used Crucial components for system upgrades. The issue is the Acronis software you can download to clone a HDD to the new SSD. Dropped 2 stars for the software. Gave up using Acronis after wasting 3 days and too many hours trying to get it to work, it’s slow, it hangs and gets stuck at different times and could never provide estimated times left with the cloning process. In the end, purchased EaseUS ToDo Backup for £33 and it completed the cloning process in 3hrs for a 3TB HDD to the 4TB SSD with no issues, or hangs, and it provides constant information on the process. I would say, you need to factor in purchasing the disk cloning software if that’s your intention for the new SSD… or purchase from another manufacturer that provides better cloning software for you new SSD."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Anthony Aitken",
          "Nb_Reviews": 2,
          "Date": "2023-07-25T19:27:47.000Z",
          "Titre": "A worthwhile investment",
          "Contenu": "My order was initially late and eventually deemed lost in transit and had to to be investigated. A second delivery attempt arrived a month later from my initial order. Installation and transfer of my operating system was problematic taking multiple attempts. When eventually everything was completed the drive has proved a worthwhile investment and stopped the computer crashes that was plaguing my computer."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "C.",
          "Nb_Reviews": 3,
          "Date": "2023-01-01T14:55:13.000Z",
          "Titre": "Crucial are usually great on delivery…",
          "Contenu": "Crucial are usually great on delivery times and information. I contacted them here from the UK and was told I selected some obscure delivery option at checkout. What a load of bull, I left on the default as it was the only free delivery option and it mentioned nothing about a 10 working day window."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Kevin Blunn",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T18:41:49.000Z",
          "Titre": "The product itself was fine",
          "Contenu": "The product itself was fine, it was a little disappointing that the scanner appears to be no longer useful.While the delivery was within the timescale quoted, the updates on the status of the delivery left quite a lot to be desired."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "DerekB",
          "Nb_Reviews": 29,
          "Date": "2023-03-13T11:25:40.000Z",
          "Titre": "I expected quite fast delivery as the…",
          "Contenu": "I expected quite fast delivery as the Royal Mail 24 service was used. However it was despatched from Prague 3 days after the shipment was advised and took six further days to reach me. Disappointing for a respected Brand."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Malcolm dickman",
          "Nb_Reviews": 6,
          "Date": "2023-05-13T21:04:31.000Z",
          "Titre": "Product from crucial was faultless…",
          "Contenu": "Product from crucial was faultless order was supposed to be 48 hr delivery. Took nearly two weeks to arrive.  Thought buying direct from Crucial would be easier, but disappointed in delivery"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Nick Berthiaume",
          "Nb_Reviews": 13,
          "Date": "2023-05-21T22:33:25.000Z",
          "Titre": "Poor postage option",
          "Contenu": "No issues with the product.The postage and tracking experience was poor though. It took about 12 days to arrive although the tracking is still unaware , 2 days later, that it has been delivered"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "M Bailey",
          "Nb_Reviews": 4,
          "Date": "2023-07-03T19:34:43.000Z",
          "Titre": "Memory works well, just expect a wait for delivery",
          "Contenu": "Good points:The memory I bought works great with the laptop, no problems there.Not so good:Sloooooowwww delivery. In this day and age, I find it remarkable that a big company like crucial can take over a week to deliver items and also surprised that the items came from Europe and not a local warehouse in the UK."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Mr Digwood",
          "Nb_Reviews": 4,
          "Date": "2023-06-06T14:20:13.000Z",
          "Titre": "easy of ordering very good",
          "Contenu": "easy of ordering very good, but delivery times from Czech republic to UK was bad - circa 11 days. Crucial should have a delivery partner setup in the UK with stock."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Steven Lilley",
          "Nb_Reviews": 1,
          "Date": "2023-04-23T16:05:40.000Z",
          "Titre": "Website Broken",
          "Contenu": "The website order pages were quite badly broken (Firefox) and it took a week for the items to arrive - though probably not helped by Brexit as they were coming from Prague to the UK."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Garry",
          "Nb_Reviews": 20,
          "Date": "2023-04-21T17:14:57.000Z",
          "Titre": "Let down by the Couriers",
          "Contenu": "You did fine unfortunately you and I have been let down by your courier the Post Office as my order took weeks to be delivered. Ordered on the 3rd April but only arrived this week?"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Fred Glaser",
          "Nb_Reviews": 20,
          "Date": "2023-01-28T19:25:09.000Z",
          "Titre": "Delivery took an age",
          "Contenu": "Delivery took an age! It wasn't until I witnessed the tracking details that I realised that it was coming from Europe and not the UK. The memory sticks themselves do appear to be of good quality. Maybe I am just too used to Amazon Prime these days!"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Ivor Josephson",
          "Nb_Reviews": 1,
          "Date": "2023-07-09T02:16:07.000Z",
          "Titre": "Delivery and price not good",
          "Contenu": "Delivery was slow and buying from the manufacturer did not get a good price.  After ordering I found I could have paid much less and got it quicker from Amazon."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Steve Nickolls",
          "Nb_Reviews": 13,
          "Date": "2023-03-15T23:15:39.000Z",
          "Titre": "New Memory and Solid State Drive",
          "Contenu": "I recently purchased 16 GB of Crucial DDR3 memory to use in an upgrade project involving an ASUS P7P55DPro motherboard together with a SSD drive to replace an existing 7200rpm HDD. Unfortunately the memory proved not to be 100% compatible and will need returning. The SSD has provided a decent boost to performance albeit limited by the motherboard's SATA 2 architecture."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "satrow",
          "Nb_Reviews": 15,
          "Date": "2023-07-04T23:15:08.000Z",
          "Titre": "Brexit effect bad for deliveries.",
          "Contenu": "Brexit effect bad. What used to be a rapid Royal Mail service is now slowed by ~3-4 days hitchhiking from Brno to a UK-bound ferry."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Nigel Humphrey",
          "Nb_Reviews": 6,
          "Date": "2023-07-26T22:27:19.000Z",
          "Titre": "I believed I was buying from the UK",
          "Contenu": "I believed I was buying from the UK so disappointed to find the SSD was held up in customs. I could have got the identical drive next day and cheaper from Amazon."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "TERRY DAVIS",
          "Nb_Reviews": 1,
          "Date": "2022-12-08T14:56:09.000Z",
          "Titre": "Royal mail strikes meant I had to wait…",
          "Contenu": "Royal mail strikes meant I had to wait a couple of weeks.  Not your fault as such, but you could consider a number of delivery systems rather than rely upon one.Ordered 21/11; Arrived 7/12"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "PAUL CHANDLER",
          "Nb_Reviews": 5,
          "Date": "2023-02-10T12:28:47.000Z",
          "Titre": "PRODUCT: A*.  DELIVERY TIMES:C-.",
          "Contenu": "You REALLY need to sort out your delivery times.  I ordered on Jan 27th, you had it in stock, it arrived on 7th Feb.  I know I accepted the 5-10 working days delivery, but with Amazon able to deliver the same product (albeit at a higher price) the next day, why can't you?  And if you can't then you should really start wondering why that is.  Cos everyone expects next-day delivery and you will end up going out of business.  imo.  To be clear, I am not complaining about the product.  I have been using Crucial for 20+ years and your products are A* every single time.  The memory I bought worked a treat."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Steve. Lewis",
          "Nb_Reviews": 9,
          "Date": "2023-07-24T18:32:14.000Z",
          "Titre": "Your Courier (UPS) is ABSOLUTE PANTS!!!",
          "Contenu": "I am pleased with the deal that I got on the two hard drives that I ordered - thank you.  Unfortunately, the time it took to get them to me left A LOT to be desired and I considered cancelling my order.  UPS have regular access to HMS Raleigh and should know the mail office opening times.  I was given a delivery slot of 0950-1150 and come 1300, I had given up.  I contacted UPS and after some discussion, I was advised that UPS DON'T do delivery slots despite one being sent to me.  They also have a driver who seems to make up his own story regarding the closing time for the Establishment Mail Office which is, and has been for a long time, 1500m on a Friday.  I even offered to meet the driver such was the need for the drives that weekend.  Apparently wasn't achievable. He clearly had no intention of delivering your package on that day.  This resulted in the vital work that I needed to complete over the weekend, with the ordered drives, not being done.  I guess that when someone orders something from Crucial, you trust your Couriers to 'deliver' on your behalf.  This was EXTREMELY poor in this case.     The 3 stars are based upon the great deal that you offered - thank you"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Peter Walker",
          "Nb_Reviews": 8,
          "Date": "2023-02-24T18:57:39.000Z",
          "Titre": "Top marks for diagnostic dowload and quality of product ... can't say the same for the website ordering process",
          "Contenu": "Your scanner/diagnostic tool is really valuable, your 'kit' top quality BUT ordering direct from your website is less than impressive .. ... easier, quicker to order Crucial through Amazon"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "John Atkins",
          "Nb_Reviews": 18,
          "Date": "2023-05-08T15:55:21.000Z",
          "Titre": "I UNDERSTAND THAT THE ITEM HAD TO COME…",
          "Contenu": "I UNDERSTAND THAT THE ITEM HAD TO COME FROM ABROAD BUT IT SEEM TO TAKE TOO LONG AND WENT TO TOO MANY CHECKS BEFORE IT WAS SENT ON TAKING  OVER 2 WEEKS."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "chillfire ltd",
          "Nb_Reviews": 3,
          "Date": "2023-05-23T12:09:18.000Z",
          "Titre": "Long lead times",
          "Contenu": "Hi, the delivery took a lot longer than we were led to believe as it came from europe. If we had known we would have purchased via a local retailer"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "F Lemay",
          "Nb_Reviews": 9,
          "Date": "2023-05-19T11:40:28.000Z",
          "Titre": "Crucial 4TB good but slow delivery",
          "Contenu": "Hello Good product so far, but a very slow delivery, it tools almost 2 weeks to get it deliver at my house. Did not know that the product was shipped from Austria.. via The Netherlands to UK"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Patrick Wadsworth",
          "Nb_Reviews": 49,
          "Date": "2023-02-20T14:00:20.000Z",
          "Titre": "Good price and easy ordering but the…",
          "Contenu": "Good price and easy ordering but the delivery took nearly a fortnight as the memory came from Europe rather from the UK.  In the past I have had delivery of memory overnight or next day and not had to wait weeks."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Ian Brocklebank",
          "Nb_Reviews": 7,
          "Date": "2023-09-28T14:55:20.000Z",
          "Titre": "Good, but slow",
          "Contenu": "Excellent memory product, shame about the very slow delivery from Czech Republic to UK..."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Jon Gathercole",
          "Nb_Reviews": 3,
          "Date": "2023-04-04T18:43:31.000Z",
          "Titre": "Matching pair of DDR5 SODIMMs",
          "Contenu": "Matching pair of DDR5 SODIMMs. They work fine, but they were very expensive. Shipping was from Dublin (to GB) and they took more than a week to arrive. Crucial need to set up a UK shipping hub, if they don't have one already."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Suzi Reid",
          "Nb_Reviews": 6,
          "Date": "2023-07-16T14:16:12.000Z",
          "Titre": "Crucial is one of the very best and a…",
          "Contenu": "Crucial is one of the very best and a well respected brand, which is why I bought the NVMes from them. But ...it does not state that the Items are shipped from Prague CZ on the website anywhere. It states 48hour delivery via Royal Mail. I assumed they would be sent from the UK..and not have to wait so long for them to come from abroad. But the price was extremely good, so worth the wait I suppose. Would have been quicker to order from Scan, but not at that great price. So thankyou for a great deal on them. But please state on your website they are shipped from abroad, and adjust your delivery time. Very misleading."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Mr French",
          "Nb_Reviews": 7,
          "Date": "2023-10-20T15:20:54.000Z",
          "Titre": "Bit slow on delivery",
          "Contenu": "Bit slow on deliveryOtherwise we'll packed and work as designed"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Charles",
          "Nb_Reviews": 5,
          "Date": "2023-05-08T18:53:00.000Z",
          "Titre": "I like Crucial a lot but this time....",
          "Contenu": "I like Crucial a lot and have always had good service.However, this time and SSD ordered on 24th April was not delivered until 4th May, which was a bit slow!"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Lee T",
          "Nb_Reviews": 2,
          "Date": "2023-05-18T08:25:45.000Z",
          "Titre": "Great product and prices...poor delivery",
          "Contenu": "Great product and prices from a reliable company...What more could you ask for ?Maybe better and faster delivery...!When the goods ship, you get a shipping invoice emailed to you, but the goods can still take a few weeks."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "francis ledford",
          "Nb_Reviews": 5,
          "Date": "2022-12-10T23:32:51.000Z",
          "Titre": "delivery took far too long",
          "Contenu": "delivery took far too long. delivery took far too long delivery took far too long delivery took far too long delivery took far too long delivery took far too long"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Julian",
          "Nb_Reviews": 8,
          "Date": "2023-05-08T12:31:43.000Z",
          "Titre": "Memory works fine.",
          "Contenu": "Memory works fine.Took more than a week to deliver though going through various countries apparently!"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "WJK",
          "Nb_Reviews": 1,
          "Date": "2023-05-27T12:00:20.000Z",
          "Titre": "Poor Delivery experience",
          "Contenu": "Long delivery times - unles you pay extra is just a top of the iceberg. The main reason of my dissatifaction is poor delivery experience and ever worst pakcaging; not suitable for electronic goods, espetialy for international travel. Soft envelope and plastic enclosure could leed to phisical damages to internal components not visible to human eyes - due to stess (bents, drops, etc.) and electronic discharge exposure (plastic non isolated enclosure and paper inside enclosure). I expected more sucure packaging and more care for the quality of product when ordering directly from source; especialy paying same price as for Amazon next day service (which is usually better secured for delivery) ."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "m wheatman",
          "Nb_Reviews": 12,
          "Date": "2023-08-25T23:12:26.000Z",
          "Titre": "Great kit, good price, but...",
          "Contenu": "Great kit, good price, well packed, but...Delivery took over a week, no updates, it came through the normal post - just too long :("
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Mr Swann",
          "Nb_Reviews": 12,
          "Date": "2023-06-20T15:14:44.000Z",
          "Titre": "Very good service but website does not…",
          "Contenu": "Very good service but website does not working I have to go talk to someone about my pc very disappointing on the website"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Peter Butler",
          "Nb_Reviews": 7,
          "Date": "2023-01-06T13:25:51.000Z",
          "Titre": "I used the computer scanner",
          "Contenu": "I used the computer scanner, unfortunately it told me I had a ram slot free. Bought ram, opened laptop case, no free slot. Ram returned, waiting for refund."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Suresh",
          "Nb_Reviews": 6,
          "Date": "2023-04-13T16:41:20.000Z",
          "Titre": "Gr8 product, delivery not so",
          "Contenu": "Delivery time not good but that’s because of going through customs. Not companies or product fault."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "gholam hossein moayyeri",
          "Nb_Reviews": 1,
          "Date": "2023-05-20T03:29:56.000Z",
          "Titre": "hi average performance",
          "Contenu": "hifirst it really took its times to reach me i do purchase online a lot most of the time i get the product a lot sooner than the last date mentions on purchase date"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "David",
          "Nb_Reviews": 14,
          "Date": "2023-04-08T22:57:12.000Z",
          "Titre": "Great product, delivered late",
          "Contenu": "The memory was compatible with my PC and works well. The delivery, however, was 2 days later than advised at the time of purchase."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Gordon Taylor",
          "Nb_Reviews": 11,
          "Date": "2019-08-16T13:33:58.000Z",
          "Titre": "Third time unlucky",
          "Contenu": "My first two experiences of dealing with Crucial and purchasing SSD's was fantastic but it was third time unlucky for me.Using the compatibility checker, I purchased a 2TB SSD drive for my iMac but was not informed that I needed a 2.5\" to 3.5\" adapter tray as this is listed for PC's. So I paid for what is essentially a piece of bent metal that is designed for PC's NOT iMac so it's a bodge job to fit it.The installation instructions for the iMac are excellent and easy to follow but they refer to keeping the HDD thermal monitor cable available to connect to the SSD when there is no facility on the SSD that is specific to the iMac to refit this.Major downside as the fan in the iMac now runs as if it is trying to cool a blast furnace down because it is not getting data from a sensor. The fix - spend $44 on a third party cable or add some third party software to control the fan.Not good enough Crucial, if you sell drives that are certified 100% compatible by your own compatibility checker, make sure that this is correct otherwise you are misleading customers. Also make sure the HDD adapter is fit for purpose, make one that fits the iMac without having to bodge it in.You have lost any future business, I will seek alternatives for my other iMac's"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Bill",
          "Nb_Reviews": 4,
          "Date": "2022-12-07T14:11:26.000Z",
          "Titre": "Delivery",
          "Contenu": "I ordered and paid for the RAM on the 23 Nov, but I'm still waiting for it to be delivered, I've had stuff from Crucial before and had no problems"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Shahzad",
          "Nb_Reviews": 10,
          "Date": "2023-07-16T12:44:59.000Z",
          "Titre": "I was not happy with the time it took…",
          "Contenu": "I was not happy with the time it took to receive the item, in the day and age of next day delivery Crucial took ten days to deliver the item. Not happy."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Raymond Dodd",
          "Nb_Reviews": 10,
          "Date": "2023-06-20T20:37:22.000Z",
          "Titre": "Crucial MX500 SSD.",
          "Contenu": "Cheapest to buy in the UK but what they fail to tell you is that it came from the Czech Republic. So while it may have been cheapest on line it took a long time to arrive."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Dave",
          "Nb_Reviews": 12,
          "Date": "2023-08-16T07:40:05.000Z",
          "Titre": "Great item......Poor delivery",
          "Contenu": "The RAM I purchased is excellent but delivery times are dreadful.2 full weeks!"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Smithies",
          "Nb_Reviews": 9,
          "Date": "2023-05-09T21:52:19.000Z",
          "Titre": "Slow delivery",
          "Contenu": "Item took over two weeks to arrive from Czechoslovakia but otherwise satisfied with the product."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Kieran",
          "Nb_Reviews": 3,
          "Date": "2023-11-20T13:21:27.000Z",
          "Titre": "Good product very slow delivery"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Julian Knight",
          "Nb_Reviews": 6,
          "Date": "2023-05-19T19:42:17.000Z",
          "Titre": "Delivery was very slow",
          "Contenu": "Delivery was very slow. Amazon had same product for less and next day delivery, so will purchase that way next time."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Mr jenkins",
          "Nb_Reviews": 21,
          "Date": "2023-02-07T13:18:38.000Z",
          "Titre": "Good product just a shame you have to…",
          "Contenu": "Good product just a shame you have to wait up to three weeks to get your good unless you pay extra on the postage."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Nigel",
          "Nb_Reviews": 2,
          "Date": "2023-08-06T12:59:55.000Z",
          "Titre": "Good hardware let down by poor instructions",
          "Contenu": "I bought a memory module and an SSD to upgrade my computer. I planned to keep the old hard drive for backup storage. Once I had finished, I ended up with everything I wanted and a PC with better performance than when it was brand new. Based on this, you may ask why I only awarded this 3 stars. The answer is in the instruction for upgrading, or mostly the information that is missing from them. Installing the hardware was fairly straight forward. The SSD only took a few seconds. The memory module did require more force than I would like to use to fully insert it but other than that was simple. The problem came when I started up the upgraded PC It instantly recognised the new memory but there was nothing on the new SSD and there was nothing on windows to indicate it was there. Nothing on the instructions about this other than to say to try re-inserting it which I did but nothing changed. It was only when going into the BIOS on the next restart that I could see it had been recognised but when I got back into windows it still showed nothing. At this point I decided to try the next step of downloading and running the software to copy the hard drive to SSD. This ran and did identify that there was a SSD present. The issue here is that it showed internal names for both the source and destination drive not the windows names. I could have just assumed they were correct and gone ahead but that appeared very dangerous so rebooted and back into the BIOS again where I could see the internal drive names before going back into windows again to run the clone software. This all worked fine so all I had to do was reboot and go back into the BIOS to change the boot drive and restart windows which also all worked fine. One final problem. The original hard disk and new SSD looked identical so I could not tell which one was using the C: and new E: drive letters. The drive properties did not show the internal names. The only way I could tell was by looking at the last updated date/time on windows files and seeing which ones had been updated after switching boot drives. I could have avoided all these issues if the instructions only mentioned that Windows would not initially see the new drive, how the drives would be seen by the cloning software and how windows would allocate drive letters."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Malcolm Cottrell",
          "Nb_Reviews": 8,
          "Date": "2023-02-23T20:32:49.000Z",
          "Titre": "DRAM took too long to arrive in the UK",
          "Contenu": "Shipping RAM from Prague via Germany to UK post Brexit took over a week to arrive. I will buy elsewhere next time sorry. Maybe have a UK warehouse for now? The RAM works fine."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Judy Wright",
          "Nb_Reviews": 4,
          "Date": "2022-12-31T00:31:45.000Z",
          "Titre": "Customs let you down",
          "Contenu": "Delivery let you down item was kept in customs too long for me that’s all I can say"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "glospete",
          "Nb_Reviews": 7,
          "Date": "2022-11-05T14:04:48.000Z",
          "Titre": "memory chips excellent; delivery system not so .....",
          "Contenu": "The product is excellent and on its own it would get 5 stars. The only reason I gave them 3 stars is the shipping method. Using Royal Mail in the UK is a joke as they have no idea about tracking parcels. So Crucial I would investigate using a company like DPD who can offer an end-to-end delivery solution. But back to the memory modules - my iMac now os so much faster with 64GB memory. In Lightroom there is no lag in scrolling images. Excellent product."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Howard Jones",
          "Nb_Reviews": 3,
          "Date": "2023-08-02T13:46:01.000Z",
          "Titre": "slow delivery",
          "Contenu": "free delivery, but very, very slow.Crucial use to be much better at this."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "david wilde",
          "Nb_Reviews": 17,
          "Date": "2023-02-20T12:19:40.000Z",
          "Titre": "good price but awful delivery time",
          "Contenu": "Memory was cheap however the delivery which was supposed to take 3-5 days took 12 days"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Dave Hodges",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T16:45:44.000Z",
          "Titre": "The memory modules worked fine but it…",
          "Contenu": "The memory modules worked fine but it took two weeks for you to deliver them"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Roger",
          "Nb_Reviews": 20,
          "Date": "2022-11-08T18:24:55.000Z",
          "Titre": "Product fine & running well, delivery info very poor.",
          "Contenu": "Product fine & running well, but not happy that I was not informed that it would become from the EU, so from order on the19-10-22 to delivery on the 31-10-22 I had no idea where it was going next & when it would arrive, if ever."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Emanuele Sara Ingrassia",
          "Nb_Reviews": 4,
          "Date": "2023-02-28T17:28:03.000Z",
          "Titre": "the product is very good as always",
          "Contenu": "the product is very good as always, this time I only wanted a little bit too long to get it delivered."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Andrew Lord",
          "Nb_Reviews": 7,
          "Date": "2023-07-19T10:00:47.000Z",
          "Titre": "The tracking was not accurate and…",
          "Contenu": "The tracking was not accurate and delivery took many days longer than expected."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Paul baker",
          "Nb_Reviews": 11,
          "Date": "2022-11-10T11:18:51.000Z",
          "Titre": "Slow delivery",
          "Contenu": "Purchased from Crucial UK website but the items come from overseas so took almost 2 working weeks to arrive, wish I had purchased more locally as my laptop could have been back in use far quicker."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Graham Lane",
          "Nb_Reviews": 20,
          "Date": "2023-09-26T15:37:35.000Z",
          "Titre": "sdsd good storage executive a nightmare",
          "Contenu": "the ssd was fine and the cloning software was fine but trying to sort storage executive out was a nightmare to get working because it doesnt support raid, and in the tutorial what i read about installing ssd  then installing storage executive you made it sound so simple but it doesnt mention in the tutorial that it doesnt support raid and for a big company you should sort the raid thing out right away because customer support was useless"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Denis Underwood",
          "Nb_Reviews": 17,
          "Date": "2023-08-07T22:44:11.000Z",
          "Titre": "Long Deliver Time",
          "Contenu": "My only complaint is the very long time it took to receive the order."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "James",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T21:05:50.000Z",
          "Titre": "Good product, slow delivery.",
          "Contenu": "I mean.. the product I can’t complain about. It was a SSD, it does what it says on the tin. 2TB of storage and it seems to be working fine at the moment. The 2 week wait for it however I can complain about.. surely there is a better process to be sending items to the UK. I would have thought such a large company would have a distribution hub in the UK."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Keith  Wallis",
          "Nb_Reviews": 6,
          "Date": "2023-12-11T17:19:10.000Z",
          "Titre": "Crucial x8 SSD",
          "Contenu": "It's a Christmas present so this is about the purchase not the product. Good clear description of the product on the website. Straightforward to order online with no problems. Clear and timely communication on delivery including status updates, and it arrived on time. A good and stress free experience."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Peter Flynn",
          "Nb_Reviews": 8,
          "Date": "2023-12-19T18:19:38.000Z",
          "Titre": "Mac Mini Fix",
          "Contenu": "Easy to navigate website, reasonably priced products and a quick response."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Martin from Manchester UK",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T20:52:04.000Z",
          "Titre": "Third time lucky with cloning drive.",
          "Contenu": "I have now got the new SSD working well. I did have problems initially as the new SSD would not boot. After third time cloning drive it now seems ok. Don't know quite how it got fixed and what went wrong probably mis-match with Windows files but the new drive itself is working well, much better than old electro-mechanical hard drive. Online assistance from Crucial was used and was much appreciated, Thanks."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "ChrisD",
          "Nb_Reviews": 11,
          "Date": "2023-11-29T19:54:53.000Z",
          "Titre": "Thanks for the memory.",
          "Contenu": "The product was perfect at a good price. Delivery took over a week which seemed a long time in these days of same or next day delivery. A thin bubble wrap envelope seemed a bit flimsy given the fragility of the module."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mr Paul Seager",
          "Nb_Reviews": 11,
          "Date": "2023-11-21T14:04:10.000Z",
          "Titre": "It's like having a new PC",
          "Contenu": "I installed a Crucial MX500 1TB SSD in my 10 year old HP Pavilion PC. The increase in speed is amazing. It never started up this quick when it was new. All programs are faster even using the internet is quicker.  Crucial provide lots of guidance to help with the installation, however the recommended Acronis software just wouldn't work. Transferring data from a 2TB HDD to 1TB SSD) After struggling with it for two days I had to purchase some cloning software (EaseUS) which worked fine. I also installed 16GB of Crucial RAM and I'm delighted with the outcome. The SSD arrived quicker than expected. I highly recommend Crucial to others and it would have been 5 stars apart from the cloning issue."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Hamzah",
          "Nb_Reviews": 4,
          "Date": "2023-11-19T20:50:47.000Z",
          "Titre": "Good product",
          "Contenu": "Good product, the website tells you if the part is compatible with your laptop.I bought it but didn't realise it was sent from Europe so delivery took over a week but it was free so not too bad."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "MR NIGHTINGALE",
          "Nb_Reviews": 27,
          "Date": "2023-11-15T21:25:48.000Z",
          "Titre": "Memory sticks and SSD's",
          "Contenu": "I know somethings about Crucial, they make most  memory sticks for PC companies.  Recently i see they make SSD as well, i'm about to find out how good SSD really are, it's anything like their memory sticks then they will be good."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Steve",
          "Nb_Reviews": 3,
          "Date": "2023-11-18T15:19:32.000Z",
          "Titre": "Really helpful website that enabled me…",
          "Contenu": "Really helpful website that enabled me to simply find the right memory to upgrade a friend's PC.  Competitive prices and shipping within a week.  Nothing to fault."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "DAVID L",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T11:10:25.000Z",
          "Titre": "Product was great, needs a USB A to C cable",
          "Contenu": "Product was great, I'd give 4.5 stars as the delivery took a little while (5 days) to get here (it wasn't clear that it as coming from the Rep of Ireland).Price and quality was outstanding, but it only comes with a short USB C to C cable, so be prepared to buy a USB A to C cable."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "George",
          "Nb_Reviews": 32,
          "Date": "2023-10-09T12:21:25.000Z",
          "Titre": "Great Drive",
          "Contenu": "The item arrived in accordance with the information given. It was in good condition and well packaged. It worked when tested - it is not yet installed in a system. My only concern was that it did take quite a long time to reach my home. I realise this may be due to bureaucracy relating to import/export to the UK, but if I had needed this drive in an \"emergency\", I would probably have gone elsewhere."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Alex",
          "Nb_Reviews": 8,
          "Date": "2023-09-27T13:52:31.000Z",
          "Titre": "Quality product",
          "Contenu": "Delivery time was longer than the 3-5 days as expected. However, product is great, this is my second purchase of this SSD, albeit with a smaller capacity.  Primary intended use is for multitrack recording straight from live digital mixing consoles, some drives struggle with this due to the speed and format.  It works!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "David Stevenson",
          "Nb_Reviews": 8,
          "Date": "2023-10-06T20:56:40.000Z",
          "Titre": "Knowlegeable and honest supprt provided - thanks!",
          "Contenu": "Your Staff were knowledgeable and helped me to understand exactly what was involved in upgrading a HDD to SSD.  They gave me the impression that they weren't just there to sell your products - they checked to ensure that I would get what I needed to improve the performance of a couple of old laptops I have.  Good customer service, which will probably help sell your products better as a result."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mike",
          "Nb_Reviews": 7,
          "Date": "2023-11-25T23:51:08.000Z",
          "Titre": "the new ssd has made a big improvement…",
          "Contenu": "the new ssd has made a big improvement from the cheap slow one dell used. the lappy is much faster and smoother running now.the downside was the very slow deivery from Prague to uk.... 11 days"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Kamyar Kaviani",
          "Nb_Reviews": 2,
          "Date": "2023-11-23T10:55:36.000Z",
          "Titre": "the scan",
          "Contenu": "When ran the scan, 2 of my computers could not be found. This is probably because they were older. It will be nice to mention why a scan didn't show a result."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Simon Williams",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T14:37:49.000Z",
          "Titre": "good online slection process",
          "Contenu": "Best thing is that using the online tools you can check you are fitting a compatible part. Makes life easier when you aren't really on top of what is in your computer anymore. Ordering process is good, deliveries slower than they used to be, however.Parts have always been good quality"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Ann Barclay",
          "Nb_Reviews": 8,
          "Date": "2023-09-28T23:41:55.000Z",
          "Titre": "Day or two late",
          "Contenu": "Didn’t arrive within 5 business days, day or two late but as it came from Chicago bit of leeway granted. Excellent tracking, I now know what crossdocking is!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mr Gavin Wilson",
          "Nb_Reviews": 25,
          "Date": "2023-09-05T09:17:48.000Z",
          "Titre": "Disappointed that the system scanner no…",
          "Contenu": "Disappointed that the system scanner no longer appears to work as that gave me 100% confidence in my previous purchases. I did an online chat but didn’t get the advice I was looking for. The delivery process was also slow as there seemed to be customs delays. Happy with the product and the price though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve Redway",
          "Nb_Reviews": 35,
          "Date": "2023-11-11T12:05:41.000Z",
          "Titre": "Very helpful",
          "Contenu": "Your representative was very helpful in trying to link my new SSD to my phone. Unfortunately my Samsung does not support OTG."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Tony Yates",
          "Nb_Reviews": 15,
          "Date": "2023-08-07T17:05:38.000Z",
          "Titre": "Everything looked good from the ease of…",
          "Contenu": "Everything looked good from the ease of selecting the correct portable SSD drive, the pricing and the ordering process. Everything was confirmed by e-mail with an invoice attached to the e-mail sent after the despatch notice. It all then went rather quiet... Tracking date showed that the parcel had been created 20 July, accepted at the start of its Journey, in Prague, 24 July, reaching Pulheim, 25 July. After a bit of faffing around between Pulheim, The Hague, Southall, then Royal Mail Greenford MC, it reach the Bristol MC, 30 July! Finally delivered without ceremony, 31 July (tracking didn't catch up)! What a journey! Hats off to Royal Mail Tracked 24, who did indeed deliver next working day, once in their hands! Would have been 5 stars if I had been aware of the foregoing!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Graham Smith",
          "Nb_Reviews": 31,
          "Date": "2023-09-03T17:55:29.000Z",
          "Titre": "Took a long time to arrive",
          "Contenu": "When it turned up it was securely packaged and worked when I plugged it in. In that respect, all good.What I did struggle with was the time it took to arrive. 13 days from order seems ridiculously out of line with any other ecommerce/mail order placed for such a small and easily handled package.I ordered direct from Crucial and maybe I made a mistake and should have searched for a local supplier in the UK. It appears my item was shipped from China, routed via Germany, into the UK and eventually to me."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Trevsie",
          "Nb_Reviews": 3,
          "Date": "2023-09-02T22:12:38.000Z",
          "Titre": "Search for matching SSD…",
          "Contenu": "The search for a matching product by motherboard was excellent, removing any doubt as to suitability. The pricing is excellent for a quality product. The website didn't make it clear that the delivery to the UK is from Europe which meant it took 10 days to arrive. I have used Crucial parts several times in the past and overall I am very happy."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Ms T Seviour",
          "Nb_Reviews": 18,
          "Date": "2022-12-28T14:00:06.000Z",
          "Titre": "our warehouse in Czech Republic OMG…",
          "Contenu": "our warehouse in Czech Republic OMG ordered from an email sales for christmas oder shipped 14Dec2022 it is now day fifteen no delivery yet oh the customer service replies each time I write Never purchase from this company unless it is the amazon outlet I would have got it overnight granted it would be £4 pounds more but I could handle that bizzare way to give christmas cheer"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mr G Crosbie",
          "Nb_Reviews": 9,
          "Date": "2022-12-09T09:28:00.000Z",
          "Titre": "Happy with purchase.",
          "Contenu": "Very happy with the SSD drive I purchased.I’m disappointed with the delivery time. I thought I was ordering from the UK, however the item was despatched from Prague. After the initial tracking info that item had been despatched there was no further updates to the tracking information at all. Item took 17 days to arrive instead of six as mentioned when ordering."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Paul Field",
          "Nb_Reviews": 12,
          "Date": "2022-12-29T23:34:49.000Z",
          "Titre": "Product easy to fit and set up. Worked out of box Noticeable improvement in PC start up & response",
          "Contenu": "Ordering process easy. Travelled across europe to channel port in a day and then stopped there for weeks. Casualty of Royal mail stoppages I assume.SSD itself prove very easy to set up & fit -full Utube videos are available via Crucial.com. Product worked perfectly on laptop power up with noticeable improvement in computer start up & general response times."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Real Customer Service",
          "Nb_Reviews": 23,
          "Date": "2022-12-17T10:35:19.000Z",
          "Titre": "Poor cloning experience but result greatTook ages for package to arrive from…",
          "Contenu": "Took ages for package to arrive from Europe via customs. Install instructions assume perfect conditions and after waiting 22 hours for Acronis to complete disk cloning itdid not work. Support told me to run check disk and reimage old disk. Completed 8 hrs later and 6 hrs to reclone disk the new disk is working much faster."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "MICHAEL J.",
          "Nb_Reviews": 2,
          "Date": "2023-01-20T21:08:24.000Z",
          "Titre": "1000GB SSD MX",
          "Contenu": "1000GB SSD, excellent product, good price, five year warranty. But delivery - ten days from Brno, Czech Republic, to West Midlands, UK? Three working days stuck in customs at The Hague? (I am able to be this precise because of the very thorough tracking system up to the point of hand off to Royal Mail.)"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "KN",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T23:18:26.000Z",
          "Titre": "Top quality products - RAM and SSD",
          "Contenu": "I used the crucial scanner and it recommended the SSD and RAM it required for an upgrade. I even compared the prices with other sites, and still it came to a lower price point.Just note that the free delivery actually takes a minimum of 10 working days."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mr Ian Baldwin",
          "Nb_Reviews": 9,
          "Date": "2023-04-17T18:55:36.000Z",
          "Titre": "Good instructions available via website…",
          "Contenu": "Good instructions available via website. You also help considerably in choosing the correct memory product. Fitting was easy and worked first time. The downside was the time it took between payment and delivery (14 days) and the difficulty I had obtaining a non-magnetic screwdriver.  You should sell them, or even an PC maintenance kit."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Charles Triggs",
          "Nb_Reviews": 8,
          "Date": "2022-12-20T16:00:06.000Z",
          "Titre": "Slow delivery",
          "Contenu": "The product itself was great but delivery was very slow. Admittedly I assumed that the item would be coming from UK stock but there was nothing in the order process to suggest otherwise so I was surprised to find that it came from Czechia. Bare that in mind if your need is urgent!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Martin Town",
          "Nb_Reviews": 2,
          "Date": "2023-03-18T11:48:43.000Z",
          "Titre": "Great except delivery",
          "Contenu": "Great product easy check out but delivery system misleading. You will get a royal mail tracking number but at that point the product is still overseas. Don't give tracking number until it hits the carrier or at least point that out. Otherwise first class."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mr Haase",
          "Nb_Reviews": 7,
          "Date": "2023-04-21T22:59:21.000Z",
          "Titre": "Solid shop.",
          "Contenu": "Solid experience but if you are in rush find a different source.Crucial is a quality brand and i like their products a lot, the process of buying was good and I was kept informed of all the stages, just transit time to the UK (shipping from Europe) is not as friendly.I admit, Brexit is not Crucial's fault but UK buyers in rush might try different shops instead."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Andrew",
          "Nb_Reviews": 21,
          "Date": "2023-07-10T19:28:17.000Z",
          "Titre": "Good value",
          "Contenu": "Website was extremely helpful. Showing exactly how to install the memory for my Ps5. There were video and text and picture guides provided.The price was excellent. I went for the 2TB option. It works perfectly. Also very easy to Install, especially with the online guides.The only downside was the actual delivery. Memory took 8 days to get to me from ordering. An express delivery option is offered, however when already spending £120 an extra £9 for a couple of days earlier seems too much.All in all though very pleased with my purchase."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mr Taylor",
          "Nb_Reviews": 9,
          "Date": "2023-05-24T15:06:20.000Z",
          "Titre": "Good quality product let down by delivery system",
          "Contenu": "Product good quality and works with my MacBook straight from the box. For the cost, I would have preferred for it to have some form of LED indicator to confirm power/data transfer when connected to my computer. It took quite a while for the package to show up on the Royal Mail tracking system (11/05/23) - over a week from despatch date (02/05/23) plus tracking stopped at Bristol. I am in receipt of my package but according to the Royal Mail Tracker it is still held at Bristol and has been since the 12th May!!! How is anyone supposed to know when to expect delivery when the tracking system is so badly managed? This has spoilt the experience for me I'm afraid."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Neale Fionda",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T20:31:57.000Z",
          "Titre": "Still awaiting a refund for the wrongly…",
          "Contenu": "Still awaiting a refund for the wrongly ordered U Dimm.Could be quicker for 5 Stars."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Tom Rank",
          "Nb_Reviews": 12,
          "Date": "2023-06-19T18:41:25.000Z",
          "Titre": "Excellent SSD NVMe drive",
          "Contenu": "Excellent SSD NVMe drive, keen price, well packed, good website tools to check compatibility and more. My only reason for 4 stars is the rather slow delivery - this item came from Prague, I learnt as it traversed Europe."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "William Bate",
          "Nb_Reviews": 38,
          "Date": "2023-09-06T08:11:17.000Z",
          "Titre": "Mixed feelings . . .",
          "Contenu": "The memory check and order were very easy and straight forward. However, having paid immediately and you stating the item was in stock it took nearly 10 working days to arrive."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Robert Seymour",
          "Nb_Reviews": 5,
          "Date": "2023-05-22T00:20:31.000Z",
          "Titre": "Crucial's M2 2TB SSD is excellent.",
          "Contenu": "Crucial's M2 2TB SSD arrived in Wales as quickly as it could have from Prague, and it has performed extremely well. The price was very good and shipping was free.It would have been helpful if I had been advised that would have to buy additionally a USB drive enclosure to initialise the SSD (my XPS13 only has one SSD slot and the drive would not initialise from that)."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "customer Klam",
          "Nb_Reviews": 6,
          "Date": "2023-07-25T16:34:06.000Z",
          "Titre": "Excellent product - slow delivery",
          "Contenu": "I purchased additional memory and a larger SSD for my laptop. The website was easy to use and guided me to the best options. Ordering and paying was easy. Nothing on the website suggested where the products would ship from or how long delivery would take. It took 10 days to arrive.The products were easy to instal and work perfectly"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Vics",
          "Nb_Reviews": 36,
          "Date": "2023-05-27T10:27:19.000Z",
          "Titre": "Not the fastest delivery",
          "Contenu": "Good stuff at good prices (a plus), but be warned,  they ship from central Europe. Their shipping company (Spring) give updates on progress, but it seems so slow. My package seemed to rest for a few days in West London, so I gave them a call (answered straight away - another plus) and was politely informed that their was still a few days to go until their estimated eta expired and not to panic yet.Shortly after the call, Spring's website and Royal Mail's website were updated and the package arrived safely the following day. Coincidence?Would still buy from their website again if I wasn't in a rush, as I still have confidence in their products and customer service, but would use Amazon Prime if I wanted a Crucial product delivered within two days rather than two weeks!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Robert Johnston",
          "Nb_Reviews": 11,
          "Date": "2023-10-09T12:55:54.000Z",
          "Titre": "You can easily find the correct part…",
          "Contenu": "You can easily find the correct part for your PC on their website and ordering is simple. The only downside is that delivery can take a while."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "JKB",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T16:20:21.000Z",
          "Titre": "Shipping time said Royal Mail 48…",
          "Contenu": "Shipping time said Royal Mail 48 Tracked but perhaps that was from when it arrived in the UK, as it was shipped from the Czech Republic, so ended up taking 2 weeks. Drive took a couple of times to accept the Cloning process but works fine and the read / write time is 100 times better than the HDD it replaced, so all good in the end."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Shelley Clipson",
          "Nb_Reviews": 5,
          "Date": "2023-03-15T03:21:05.000Z",
          "Titre": "Loved the ease of finding what I needed…",
          "Contenu": "Loved the ease of finding what I needed on the website, however I thought when visiting a UK site the items would be shipped from UK.Products are fine and arrived OK, but the delivery time was 10 days from ordering to arriving which isn't ideal. Fortunately I wasn't in a rush or my score would be lower because of this"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mr. G",
          "Nb_Reviews": 9,
          "Date": "2023-10-14T12:52:21.000Z",
          "Titre": "I have given 4 stars as order placed on…",
          "Contenu": "I have given 4 stars as order placed on 20/09/23 and received on 12/10/23 - no fault with Crucial but down to the postage trail and customs clearance."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Paul Salmons",
          "Nb_Reviews": 8,
          "Date": "2023-05-07T18:58:52.000Z",
          "Titre": "It would have been 5 stars",
          "Contenu": "It would have been 5 stars, but I didn't expect my M2 drive to have to travel from the Czech Republic to Germany, and then The Netherlands before it even got to the Royal Mail delivery service in the UK.  For a couple of quid more, I could have got next-day delivery elsewhere instead of waiting 10 days for it to arrive.  Other than that, it's a great product, otherwise, I wouldn't have ordered it."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Philip Davies",
          "Nb_Reviews": 9,
          "Date": "2023-10-12T12:04:40.000Z",
          "Titre": "Good product but a bit slow delivering",
          "Contenu": "Good product but scanner still does not work properly and it took nearly 2 weeks to ship through customs etc Would I use them again? Yes if I need after market memory or SSD and don’t care about speed of arrival"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "S Naresh",
          "Nb_Reviews": 10,
          "Date": "2023-01-09T14:25:52.000Z",
          "Titre": "iMac RAM",
          "Contenu": "Excellent item. Good details. Quality is sound. Very happy with the outcome of my iMac after the RAM upgrade. However the delivery took too long. Updates about intended delivery could have been useful. Apart from this, it’s been a a great experience."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "William",
          "Nb_Reviews": 11,
          "Date": "2023-01-22T13:20:37.000Z",
          "Titre": "Installation of the new ssd and memory…",
          "Contenu": "Installation of the new ssd and memory straightforward, the cloning software worked great and transferred all files within an hour, pc boot time reduced from 2 1/2 minutes to 30 seconds.Delivery however was not as fast as I expected, stock came from the Czech republic and this was not made clear while ordering. The Royal mail 24 was actually 10 days caused by cross European transport and customs clearance in Rotterdam."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "John",
          "Nb_Reviews": 3,
          "Date": "2023-03-18T09:43:45.000Z",
          "Titre": "Pretty fast delivery",
          "Contenu": "Pretty fast delivery for being international. Products seem good quality but only time will tell. Very good price. Only issue is the acronis cloning software, its absolutely useless. Use macrium 30 day free trial instead."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Jason Mead",
          "Nb_Reviews": 5,
          "Date": "2023-01-24T09:44:08.000Z",
          "Titre": "Memory works as expected so I’m happy",
          "Contenu": "Memory works as expected so I’m happy. The only thing that let Crucial down on this occasion was delivery time. I found myself wishing I’d ordered the exact same chips from Amazon where I would have received the order the very next day."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Stephen",
          "Nb_Reviews": 25,
          "Date": "2023-02-12T13:25:49.000Z",
          "Titre": "Good price and it works",
          "Contenu": "The memory 2x8GB RAM Kit has certainly improved the working speed of my 2019 5K Retina iMac, and I am very pleased about this. Delivery was a little slow as the package was sent from the Czech Republic, which surprised me, however the price was good."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Michael Tranded",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T19:21:19.000Z",
          "Titre": "I like dealig with Crucial",
          "Contenu": "I like dealig with Crucial, I like the products I have always found them reliable and am happy to recognize them as an established leading brand."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Sonny  Tran",
          "Nb_Reviews": 10,
          "Date": "2022-12-31T23:07:05.000Z",
          "Titre": "Ordered a SSD to replace my HDD to make…",
          "Contenu": "Ordered a SSD to replace my HDD to make it faster. Arrived in a few days over Christmas as expected but what made it all good was the instructions for cloning and installing the SSD was available from the Crucial website and it made the whole process of swapping out the hard disk so much easier without any problems."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "IAN REES",
          "Nb_Reviews": 8,
          "Date": "2023-01-25T21:43:21.000Z",
          "Titre": "Great products but.....…",
          "Contenu": "I have used Crucial memory products for many years and have been totally satisfied with their performance. The items on this order were no exception and I'm happy to have bought them>The only negative is the comparatively long delivery time which was disappointing."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Grahstro",
          "Nb_Reviews": 6,
          "Date": "2023-05-12T15:51:41.000Z",
          "Titre": "Crucial SSDD & Memory Order",
          "Contenu": "I have found Crucial to be a great company to deal with, over many years.  I gave only 4 stars this time as I felt that the delivery time, about 8 days, was a little longer than I have previously experienced from Crucial."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Robert",
          "Nb_Reviews": 15,
          "Date": "2023-03-14T20:50:38.000Z",
          "Titre": "Your agents are helpful",
          "Contenu": "Your agents are helpful, but I was disappointed that your PC upgrade scanner didn't differentiate the 2 types of existing drive my HP laptop had and recommended a SATA drive to replace my smaller M2. Windows SSD so I ordered the wrong part. However your returns procedure is hassle free."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "william richardson",
          "Nb_Reviews": 3,
          "Date": "2023-02-15T22:48:29.000Z",
          "Titre": "products always work as advertised",
          "Contenu": "expected delivery withing 5 days but took 7 days. this doesnt concern me as I always know products work as described. with it being international shipping, this I wasn't expecting  so maybe this was the delay in delivery. hence 4 star rating."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Julian Nicklin",
          "Nb_Reviews": 8,
          "Date": "2023-03-05T12:42:49.000Z",
          "Titre": "Crucial computer supplies",
          "Contenu": "I am very happy with the product and price.It would be helpful to make it clear that the part I ordered is inside or outside the UK as the delays in customs clearance can be very frustrating if you have a machine off-line waiting for parts"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Gavin",
          "Nb_Reviews": 2,
          "Date": "2023-07-30T08:35:14.000Z",
          "Titre": "Good purchase experience",
          "Contenu": "The only downside was the delivery time. I was unaware that the product was not supplied from the UK. The online instructions for installation were very good and I did not have any problems."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Brian",
          "Nb_Reviews": 13,
          "Date": "2022-12-28T16:04:26.000Z",
          "Titre": "Good Value memory purchase!!",
          "Contenu": "To start with the memory I purchased was good value, which was about 14% off the usual price. Delivery was not as fast as previous purchases, however it was in time for Christmas and was good result has it was present. The memory has now been fitted with no problems and working well"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Rob",
          "Nb_Reviews": 7,
          "Date": "2023-04-01T15:48:42.000Z",
          "Titre": "Good response from customer support and…",
          "Contenu": "Good response from customer support and return/refund on item ordered in error was no problem. Third time I've dealt with the company and same good response level each time."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "knockoff",
          "Nb_Reviews": 2,
          "Date": "2023-05-14T12:10:43.000Z",
          "Titre": "Scanner guided me to the correct type…",
          "Contenu": "Scanner guided me to the correct type of RAM needed for the laptop which once fitted worked perfectly.Only downside was that delivery could have been a bit quicker."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Neil Irwin",
          "Nb_Reviews": 4,
          "Date": "2023-01-10T19:41:28.000Z",
          "Titre": "Crucial good. Brexit bad.",
          "Contenu": "The Crucial website made it easy to choose an SSD upgrade, and the device works very well.I didn’t realise, at the time of the order that it would take such a long time to clear customs into the UK. I suppose that’s the fault of Brexit rather than Crucial, so still four stars."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "David Fowler",
          "Nb_Reviews": 8,
          "Date": "2023-03-19T12:03:09.000Z",
          "Titre": "Putting In a SSD is not difficult",
          "Contenu": "The installation guide for the SSD was very good and the software the clone the drive pretty good.  Delivery of the components to a lot longer than I expected but then it appeared to come from half way around the world."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Paul Selby",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T13:09:45.000Z",
          "Titre": "Good product but delivery could be…",
          "Contenu": "Good product but delivery could be quicker if stocks were held locally"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "CJ",
          "Nb_Reviews": 2,
          "Date": "2023-05-12T17:41:13.000Z",
          "Titre": "Mac Memory Upgrade",
          "Contenu": "Choosing the correct memory chip for my iMac was made easier by the online tool provide by Crucial.Ordering & delivery were as described, no issues.Once installed the improvement to the iMac was immediately noticeable & wouldn't hesitate to upgrade again when necessary."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Carl Freeman",
          "Nb_Reviews": 3,
          "Date": "2023-05-31T18:44:01.000Z",
          "Titre": "Great ram, thanks.",
          "Contenu": "I like the way I can enter my pc details and the site only lists compatible hardware, the price was pretty good too, but it took a long time to arrive."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mick West",
          "Nb_Reviews": 9,
          "Date": "2022-12-18T12:44:27.000Z",
          "Titre": "I always get great service and products…",
          "Contenu": "I always get great service and products from Crucial. Not five stars due to quite a wait for products to arrive...maybe strikes, I don't know. Will always use Crucial in future."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Alex (Tunbridge Wells)",
          "Nb_Reviews": 6,
          "Date": "2023-11-05T12:24:56.000Z",
          "Titre": "Crucial gets all the key ingredients…",
          "Contenu": "Crucial gets all the key ingredients bang on - the diagnosis tool and the quality of components is excellent, and the prices very reasonable."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Guest",
          "Nb_Reviews": 6,
          "Date": "2023-02-12T14:25:12.000Z",
          "Titre": "The delivery times let you down",
          "Contenu": "The products are really good but the delivery times are not great. The shipment often arrives later than expected even if you pay extra."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Nazim",
          "Nb_Reviews": 17,
          "Date": "2023-05-16T15:48:04.000Z",
          "Titre": "Laptop still slow",
          "Contenu": "Having fitted the SSD, I expected the laptop to be much faster. However, the apples has hardly increased which is very disappointing"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Abysmal Postal Service",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T11:30:42.000Z",
          "Titre": "Abysmal Delivery Service",
          "Contenu": "The product itself works great and delivered within the time scale stated but 10 working days, (2 weeks) to get here!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Juan Iparraguirre",
          "Nb_Reviews": 14,
          "Date": "2023-09-19T01:42:53.000Z",
          "Titre": "Worked like a charm, longer delivery than expected",
          "Contenu": "The memories worked perfectly but I had to wait about 10 days to receive them although the delivery option said something like \"two working days\" or something similar."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Ian A",
          "Nb_Reviews": 2,
          "Date": "2023-02-28T14:06:54.000Z",
          "Titre": "Great items, Slow delivery.",
          "Contenu": "I’ve used crucial a few times before. The experience and value for money is always good. This time I was a little disappointed that delivery took eight days. The items came from Prague and took their time. Apart from that all was as good as ever."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Chris Allen",
          "Nb_Reviews": 27,
          "Date": "2023-09-29T19:20:10.000Z",
          "Titre": "Good quality memory but slow delivery",
          "Contenu": "The memory arrived in good condition, well (over?) packaged but delivery was slow."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "JOHN WILLIAM GARDNER",
          "Nb_Reviews": 24,
          "Date": "2023-06-28T15:49:28.000Z",
          "Titre": "Great product",
          "Contenu": "Great product. Slower deliver time than I had hoped. Not frustratingly slow- sub 2 weeks but not just on the edge of questioning if it was coming."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mahendra Patel",
          "Nb_Reviews": 14,
          "Date": "2023-10-07T08:32:53.000Z",
          "Titre": "Online chat agent located the correct RAM",
          "Contenu": "I couldn’t find the correct RAM for my laptop using the online download tool, so contacting the live chat made a huge difference- the representative was able to find an alternative for me which helped a lot."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Tony Wilton",
          "Nb_Reviews": 20,
          "Date": "2023-11-06T10:20:17.000Z",
          "Titre": "Product was good and well packed",
          "Contenu": "Product was good and well packed, but delivery took seven days."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephen",
          "Nb_Reviews": 21,
          "Date": "2023-03-08T12:51:56.000Z",
          "Titre": "The external drive works well",
          "Contenu": "The external drive works well - small and fast. I have always been very happy with Crucial products and have never had any issues.Delivery from Prague to the UK took 6 days."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Qiange Yan",
          "Nb_Reviews": 1,
          "Date": "2023-01-16T03:34:53.000Z",
          "Titre": "Website can be a bit more informative",
          "Contenu": "Website can be a bit more informative. The product is good. Shipping took a bit long but the tracking is detailed and informative which is very good."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Neil Carling",
          "Nb_Reviews": 34,
          "Date": "2023-03-15T23:49:30.000Z",
          "Titre": "Long wait for postage from the…",
          "Contenu": "Long wait for postage from the Netherlands. Used to be shipped directly from the UK. Arrived packed, and securily. Haven't Installed it yet."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Malcolm",
          "Nb_Reviews": 23,
          "Date": "2023-01-16T00:48:34.000Z",
          "Titre": "replacement SSD swapped in and working…",
          "Contenu": "replacement SSD swapped in and working fine, used a different cable on the caddy from elsewhere and all good on the second attempt"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Alan Gater",
          "Nb_Reviews": 19,
          "Date": "2023-07-27T17:14:37.000Z",
          "Titre": "Good board, but slow delivery",
          "Contenu": "Good ssd, ok price, but it took forever to arrive.  Tiny envelope - why over 10 days to get here - I paid for the delivery after all."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "David Linton",
          "Nb_Reviews": 4,
          "Date": "2022-12-06T16:43:00.000Z",
          "Titre": "Very good product.",
          "Contenu": "It was great price and the RAM has vastly improved my PCs performance. The only minor criticism is that the packaging was a plastic bag rather than a box."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Javid",
          "Nb_Reviews": 5,
          "Date": "2023-02-06T17:57:30.000Z",
          "Titre": "I will be back - Good Size and Speed.",
          "Contenu": "Ok price and it works as advertised.It did not work in an M.2 SATA socket ... that was my hope, but it is as expected.  Works fine in an external caddy (USB 3.2).I will keep an eye out for a larger (I have a 4TB NVMe PCIe 4.0) M.2 SATA drive.  (maybe a could of years?) :-D.I trust Crucial and I will be back.PS:  Took much longer than I had anticipated for delivery ... my issue I am used to things coming within 48 hours not just over a week.  Could just be a one off."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "John",
          "Nb_Reviews": 8,
          "Date": "2023-01-19T12:02:16.000Z",
          "Titre": "it came aprox on the day stated.",
          "Contenu": "it came aprox on the day stated.It was a little difficult to find my way back into the information needed regarding delivery"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "simon",
          "Nb_Reviews": 29,
          "Date": "2023-01-19T16:30:23.000Z",
          "Titre": "Non delivery of the memory",
          "Contenu": "Very long delivery time which would have been fine if I’d been kept informed.  I hadn’t realised it had to come in through customs (Brexit strikes again)"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Chris Brown",
          "Nb_Reviews": 11,
          "Date": "2023-02-07T18:20:27.000Z",
          "Titre": "Helpfull but a long delay of severil days",
          "Contenu": "Helpfull but a long delay of severil days after the first chat untill I chased it up then quick RMA agreement"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Timd",
          "Nb_Reviews": 20,
          "Date": "2023-04-12T18:35:25.000Z",
          "Titre": "Very helpful help desk",
          "Contenu": "Returned a product to Crucial for a refund, waited the 10 days for it to show in my account but it did not, so ring a very helpful lady at Crucial help desk who sorted the problem out and the refund was in my bank the next day."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Harold Hansen",
          "Nb_Reviews": 18,
          "Date": "2023-03-15T13:50:56.000Z",
          "Titre": "Memories",
          "Contenu": "Although a little late because of brexit it was as ordered and I have always found Crucial products reliable and the company helpful ."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Ali-Hasan Zaidi",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T20:59:12.000Z",
          "Titre": "All was fine.",
          "Contenu": "It took its time to arrive but that was expected, I’m glad that there was at least arrival and departure tracking given on the shipping website even when I hadn’t paid for express shipping and tracking."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Kevin Marchant",
          "Nb_Reviews": 23,
          "Date": "2023-02-09T16:31:18.000Z",
          "Titre": "Online buying experience Let Down Only by Unexpectedly Longed Shipping Time",
          "Contenu": "5 out of 5 for online buying experience (selecting compatible products, checking out etc.)5 out of 5 for quality of products.  Worked well and easy to unpack fit1 out of 5 for shipping time transparency.  Took 9 days to arrive so not for anyone in a hurry.  Main problem is that I just didn't realise what was going on.  Products are now shipped from Czech Republic rather than Glasgow - have bought loads from Crucial but nothing since Brexit.  Shortly after placing the order tracking info showing Royal Mail Tracked 24 appears with status waiting for supplier to hand over the goods so I though it was going to be quick.  A couple of days later I noticed that there was a more elaborate tracking link that showed Prague as the origin.  It only took a couple of days after that to reach Heathrow, but then it sat there for 5 more days (not clear if stuck in customs or simply awaiting Royal Mail to collect it from there - my guess the latter).  After RM collected it, it was delivered the next day, a total of 9 working days after the order.  The website does state \"clearly\" if you bother digging into the small print that free delivery is 9-10 working days so they met their SLA.  It's more that I didn't notice it wasn't coming from East Kilbride anymore as it used to.  My bad ?Anyway, it arrived, it works.  It was 25% cheaper than Amazon for what I bought,  so overall I'm happy and would use again for things I'm not in hurry for and which are dramatically cheaper than elsewhere.If Crucial had stressed that products are supplied from the EU and that 5-10 Business days for free delivery means 5-10 Business days for delivery I would have given 5*."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Graham Fox",
          "Nb_Reviews": 16,
          "Date": "2023-05-14T20:18:46.000Z",
          "Titre": "The web site gave the impression that…",
          "Contenu": "The web site gave the impression that the Nmve was in the UK.It took 15 days to arrive and came from Prague, no tracking details.The good with out doubt the P5 1TB is the fastest drive i have ever used"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-05-31T18:35:56.000Z",
          "Titre": "good product and service,just a bit…",
          "Contenu": "good product and service,just a bit long on postage as i wasnt aware it had to come from budapest."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Keith",
          "Nb_Reviews": 4,
          "Date": "2023-06-06T11:54:57.000Z",
          "Titre": "The purchase and refund work well",
          "Contenu": "The purchase and refund work well.  Unfortunately just trying to upgrade the memory caused a terminal loss."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Peter Kelly",
          "Nb_Reviews": 1,
          "Date": "2023-02-17T13:36:24.000Z",
          "Titre": "Laptop Memory Upgrade",
          "Contenu": "Identified the correct upgrade, kept me advised of progress.Purchased 01/02/2023Received goods 08/02/2023 (from the Czech Republic !)"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "ben",
          "Nb_Reviews": 6,
          "Date": "2022-11-23T23:26:26.000Z",
          "Titre": "Great product",
          "Contenu": "Great product.  Good delivery tracking.  Cloning software did not work, but that may have been fault of very damaged old hard drive"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Shirley Turner",
          "Nb_Reviews": 32,
          "Date": "2023-03-21T14:57:29.000Z",
          "Titre": "Good ordering experience and great…",
          "Contenu": "Good ordering experience and great product. Only down side was having to wait so long for the product."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "teodor leonte",
          "Nb_Reviews": 3,
          "Date": "2022-11-14T22:09:55.000Z",
          "Titre": "Their website provided a free scan",
          "Contenu": "Their website provided a free scan of my laptop followed by a number of recommendation and options that i could’ve chose as an upgrade. However it took a while until the delivery arrived. But overall im happy with the choice i have made."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Brian Pepper",
          "Nb_Reviews": 21,
          "Date": "2023-04-07T20:05:08.000Z",
          "Titre": "Easy order process and a good price for…",
          "Contenu": "Easy order process and a good price for 16Gb memory stick. Gave 4 stars because of the delivery lead time"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "rachel",
          "Nb_Reviews": 18,
          "Date": "2023-12-21T22:03:53.000Z",
          "Titre": "bought 2tb ssd",
          "Contenu": "bought 2tb ssd, works fine cheapest on the market at the time, fast post from europe well pleased, recommended company"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Guest",
          "Nb_Reviews": 11,
          "Date": "2023-12-16T12:21:50.000Z",
          "Titre": "Worth Waiting For!",
          "Contenu": "The product and price are great, but they are coming from Eastern Europe, and must pass through various points, including customs, before arriving. This is not a problem, if you are aware of the wait."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "John Stewart",
          "Nb_Reviews": 33,
          "Date": "2023-12-16T13:57:00.000Z",
          "Titre": "Black Friday Bargain",
          "Contenu": "1Tb SSD for my HP AIO, £10 off usual price. Arrived in a reasonable time frame and cloned easily using free Acronis software from Crucial."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Marita",
          "Nb_Reviews": 9,
          "Date": "2023-12-17T18:48:17.000Z",
          "Titre": "Good, cheap and easy",
          "Contenu": "Easy to install with helpful video. However you receive less storage than advertised (in my case it said 2 TB, however it was actually 1.8 TB)"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Patrick Gannonuu",
          "Nb_Reviews": 6,
          "Date": "2023-12-19T18:35:59.000Z",
          "Titre": "Very easy to order products required",
          "Contenu": "Very easy to order products required, website design made the whole experience easy for someone not completely OK with online shopping also the follow up with info on delivery was excellent."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jeff",
          "Nb_Reviews": 19,
          "Date": "2023-12-18T09:48:30.000Z",
          "Titre": "Positive Experience",
          "Contenu": "Easy to find, compare and purchase. I have used Crucial previously and will do again, when required."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Simon Harvey",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T10:58:30.000Z",
          "Titre": "Easy process",
          "Contenu": "Easy to navigate site and use the tool to specify correct RAM upgrade. Only slight issue was it kept directing me to US website to complete purchase?? Just copied and pasted RAM detail into UK website version and all worked fine. Speedy delivery."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Crusoe",
          "Nb_Reviews": 5,
          "Date": "2023-11-26T22:21:04.000Z",
          "Titre": "SSD upgrade on my old GA Z170XL-SLI Mainboard",
          "Contenu": "I needed an SSD 'system disk' upgrade. I tried an alternative mfr but my not so modern Mainboard wouldn't even boot with it (even though all the specs looked OK). Crucial on the other hand not only guided me to the appropriate SSD but also guaranteed compatibility.I took a full image of the old SSD, upon installation of the Crucial SSD the PC booted and I returned the image to the new 'disk' which, following recovery, booted as before (but at little faster and with twice the capacity of the former.What more can I expect!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "R A Ross",
          "Nb_Reviews": 7,
          "Date": "2023-11-20T10:27:05.000Z",
          "Titre": "Reliable, established company",
          "Contenu": "Regarding Crucial, I'm a 'returning customer' which should give you a clue. Good quality products and service at a sensible price. My latest purchase was Crucial's X9 SSD which they managed to deliver to me from the Czech Republic in less time than the Royal Mail takes to deliver my bank statements!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Wayne Clemit",
          "Nb_Reviews": 4,
          "Date": "2023-12-14T21:35:40.000Z",
          "Titre": "Apart from the delivery time and the…",
          "Contenu": "Apart from the delivery time and the item description on the invoice. Perfect"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Scott",
          "Nb_Reviews": 5,
          "Date": "2023-12-05T09:51:21.000Z",
          "Titre": "Great for the ps4",
          "Contenu": "I've brought many products of this company as I believe for the price point thay are the best always excellent service"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jeremy Rowlatt",
          "Nb_Reviews": 6,
          "Date": "2023-12-01T23:30:34.000Z",
          "Titre": "I got my purchase as ordered and i am…",
          "Contenu": "I got my purchase as ordered and i am very happy with it. The only slight gripe was that the item came from Prague via Germany and Holland and finally into UK.I may have ordered a different item had i known this as the RAM came within 24 hours"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "M W Alton",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T18:44:01.000Z",
          "Titre": "Upgrade HDD to SSD",
          "Contenu": "Took 3 attempts using Acronis software to clone HDD to Crucial SSD MX500. But now its done my Laptop is flying, its like a new machine."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T01:27:46.000Z",
          "Titre": "I love the Crucial X8 drives",
          "Contenu": "I love the Crucial X8 drives.  Very fast and tough enclosures.  I have three now being used to run virtual machines and store videos."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Inderjit Chhokar",
          "Nb_Reviews": 3,
          "Date": "2023-12-05T11:00:20.000Z",
          "Titre": "I been using crucial since 2013",
          "Contenu": "I been using crucial since 2013First ssd bought then.I always use crucial for ssd nvme p5 plus.All my pc and laptop.There products are outstanding.My first ssd still running till this date."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Michael Stephenson",
          "Nb_Reviews": 7,
          "Date": "2023-11-11T14:02:57.000Z",
          "Titre": "Great and clear instructions",
          "Contenu": "Great and clear instructions for installation. A eally good product with big 2tb capacity and with heat sink keeping it cool, making my Sony PS5 capacity doubled. Would highly recommend this product for PS5 user's."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Alan Gellion",
          "Nb_Reviews": 28,
          "Date": "2023-11-15T16:57:57.000Z",
          "Titre": "Great option to find technical components",
          "Contenu": "I was able to chat with an advisor to confirm the two components I needed were compatible with my machine.The components were competitively priced and the web site was good.Delivery took a few days but the items were sourced in Europe, so not unreasonable."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Richard Bashford",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T12:24:25.000Z",
          "Titre": "Amazing price, amazing product",
          "Contenu": "An amazing SSD for an amazing price. Works great in my PS5"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Howard",
          "Nb_Reviews": 8,
          "Date": "2023-10-27T10:06:05.000Z",
          "Titre": "Linux SSD",
          "Contenu": "Sensible technical advice about use of SSD with Linux ( not actually supported, but should not be a problem). It worked and at a very good price.Also good support when the shipping company messed up and misplaced the shipment in their system.Have used them before and found their products to do exactly what you expect at a sensible price."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mike",
          "Nb_Reviews": 6,
          "Date": "2023-12-05T20:47:09.000Z",
          "Titre": "Always excellent & highly reliable",
          "Contenu": "Crucial's RAM modules are always extremely reliable, and are excellent at breathing new life into PCs that have begun to slow down."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Plod Dog",
          "Nb_Reviews": 28,
          "Date": "2023-11-26T18:21:39.000Z",
          "Titre": "Fast & Professional",
          "Contenu": "Very easy to use website, with easy to use shopping cart and checkout tracking was simple and clear and the goods arrived quick enough to think it was local postage not from Europe perfect goods at perfect price with no messing."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Neil Burton",
          "Nb_Reviews": 3,
          "Date": "2023-11-25T01:58:42.000Z",
          "Titre": "Brilliant",
          "Contenu": "Brilliant.   Online guide on crucial website helped me find the memory I needed for my laptop,  I ordered and within 2 days it arrived.  Fitted and working."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr Derek Stephenson",
          "Nb_Reviews": 6,
          "Date": "2023-10-15T01:14:25.000Z",
          "Titre": "Excellent item and price. Shame about the time it took to arrive",
          "Contenu": "The item arrived, I appreciate that due to customs etc. it took rather longer than I expected.I followed the tracking and it seemed to stop at one of its waypoints for an age.Forewarning us of the timing would have been helpful. May I also suggest that you or your agent could update the seller  of any change to the package's location. But 14 days enroute seems excessive."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "james",
          "Nb_Reviews": 3,
          "Date": "2023-11-10T14:58:32.000Z",
          "Titre": "Very good service.",
          "Contenu": "Very good service.SSD arrived well packaged.Plugged into USB port on TV to record programs.Worked first time, no reformatting reqd."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Sam Campbell",
          "Nb_Reviews": 36,
          "Date": "2023-10-10T10:39:27.000Z",
          "Titre": "Easy, Cheap And Good Quality",
          "Contenu": "A good experience with Crucial. Their system checker made choosing the correct memory and SSD an easy, worry-free, process. Prices were very competitive, with a good selection of sizes and speeds of memory and drive available. Delivery wasn't next day (I did not pay for next day), but it was reasonable (around a working week)."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "David",
          "Nb_Reviews": 18,
          "Date": "2023-11-17T15:31:27.000Z",
          "Titre": "Excellent service.",
          "Contenu": "The item arrived quickly and in perfect condition and does the job it is supposed to, a great service in suppling the correct part. highly recomended. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "DavidSmith",
          "Nb_Reviews": 2,
          "Date": "2023-10-27T15:55:22.000Z",
          "Titre": "Everything worked seamlessly",
          "Contenu": "Everything worked. The scanning process worked, upgrade spec was correct and the memory and SSD installed without problems using the online software provided. I wouldn't bother with any other upgrade supplier because Crucial have bossed the entire process."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "J Baird",
          "Nb_Reviews": 21,
          "Date": "2023-10-13T12:24:06.000Z",
          "Titre": "My SSD duly arrived",
          "Contenu": "My SSD duly arrived, and I must admit I was a bit wary of installing it, but after reading the instructions several times, I got down to it.  I found it surprisingly straight forward  to do and at 71 if I can do it, well enough said. So thankyou Crucial for the very informative instructions. Laptop now much quicker."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Craig Hutchison",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T16:56:57.000Z",
          "Titre": "The price was excellent",
          "Contenu": "The price was excellent. The device itself is great. But the delivery service was poor with the package sitting at Stanstedt for 6 days and only moving when /i queried it"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Victor B.W.",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T01:19:30.000Z",
          "Titre": "No complaints",
          "Contenu": "Price was cheap, item arrived within the promised 5-10 days, I received no additional fees that I am aware of.Very happy customer with Crucial products, currently have two MX500 SATA solid state drives in active service and they work like a charm. I have no fears of data loss buying from Crucial. Would buy again."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Michael Shergold",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T15:34:45.000Z",
          "Titre": "Arrived and started Clone",
          "Contenu": "Arrived and started Clone. Surprised it forecast 10 hours but it must have completed in somewhere between 4 and about  6 when I found it had finished. Installed drive and system is running like it was when new!!! In fact perhaps better. No real problems."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "John O'Malley",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T13:15:09.000Z",
          "Titre": "Over the years Crucial has been my…",
          "Contenu": "Over the years Crucial has been my preferred supplier of RAM having used them many times. This time I bought a SATA SSD drive and a M.2 SSD which arrived very well packaged and which are now installed and working perfectly. My only small niggle was that it took 12 days for the goods to arrive. They seemed to have been shipped from outside of the UK (I couldn't find any information about this on their web site) but I was in no particular hurry and so it's a minor point."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "DR IAN WEEKS",
          "Nb_Reviews": 9,
          "Date": "2023-11-17T18:48:20.000Z",
          "Titre": "simple straight forward",
          "Contenu": "Having used crucial ssd for upgrades before I felt confident in using there product and associated cloning software.I was not dissappointed, straight forward clone and swap in new ssd"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Quentin Whitfield",
          "Nb_Reviews": 11,
          "Date": "2023-10-18T17:36:19.000Z",
          "Titre": "Super Simple To Find The Correct Memory",
          "Contenu": "This is the first time I have used Crucial and their website made it super simple to find the correct memory for my laptop even though it is seven years old. Quick tutorial on YouTube and up and running with double the RAM!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jordan",
          "Nb_Reviews": 3,
          "Date": "2023-08-09T02:08:26.000Z",
          "Titre": "Delivery inconsistent but perfect otherwise.",
          "Contenu": "Delivery a day late despite the ~£9 faster delivery, took around 6 days to arrive but other than that, absolutely perfect. Installed my 2x16GB 3200MHz RAM sticks in my laptop within a few minutes and not had a single issue. Couldn’t recommend enough. Quality product and beyond reasonable prices."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "John Rogerson",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T20:33:44.000Z",
          "Titre": "Simple upgrade to breathe new life into a second hand ThinkCentre M720Q",
          "Contenu": "I bought a Crucial P5 Plus 1TB M.2 NVMe SSD and two 16GB DDR4 memory sticks for a second hand (renewed) ThinkCentre M720Q.  I am a repeat (and happy) customer as I have bought Crucial memory and SATA SSDs in the past for Thinkpads.  Always very easy to fit - and the old 250GB drive was easily cloned to the new, larger, Crucial drive.  It took a little while for the delivery to arrive as it came from the Czech Republic via Germany and the Netherlands before arriving in the UK - 11 days from placing the order until it arrived, and I could monitor shipment progress via the supplied link."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Robert W Smith",
          "Nb_Reviews": 9,
          "Date": "2023-08-15T20:57:47.000Z",
          "Titre": "Astounding performance",
          "Contenu": "My wife complained that her aging laptop was running to slow and was looking at spending a lot o a new laptop. I ran the Crucial scan, which was simple, and the result recommended more memory and a SSD, I decided to risk the £80 cost and give it ago. We are astounded at the difference it has made, the laptop now runs faster than her modern work laptop. I not plan to upgrade my aging desktop and hopefully it too will run better."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jim",
          "Nb_Reviews": 14,
          "Date": "2023-12-13T20:26:28.000Z",
          "Titre": "Easy to order and prompt delivery."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jeff",
          "Nb_Reviews": 19,
          "Date": "2023-12-14T18:27:27.000Z",
          "Titre": "Easy to find, compare and purchase.",
          "Contenu": "Easy to find, compare, select and pay for."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jason Clare",
          "Nb_Reviews": 3,
          "Date": "2023-09-16T15:27:31.000Z",
          "Titre": "My buying experience with Crucial UK…",
          "Contenu": "My buying experience with Crucial UK was a good one from making my easy online purchase right through to the delivery into my letter box.You may have to wait a bit longer for some Crucial products as they are sent from mainland Europe to the UK which was not a problem for me."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Natalie",
          "Nb_Reviews": 3,
          "Date": "2023-08-29T12:02:03.000Z",
          "Titre": "Great and good price.",
          "Contenu": "Excellent product at good price -- laptop ram much cheaper than offered by laptop's manufacturer. Shipping took a little time, but arrived within the stated window of delivery. Will use again. Thanks."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Stephen Bransgrove",
          "Nb_Reviews": 4,
          "Date": "2023-10-18T18:39:12.000Z",
          "Titre": "Very good but improve delivery time!",
          "Contenu": "Very satisfied with my new hard drive and the improvement in performance. The copying( cloning) process was easy to to perform. The only point that could be improved would be the delivery time."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "CHRIS LEVERTON",
          "Nb_Reviews": 35,
          "Date": "2023-08-05T09:05:10.000Z",
          "Titre": "Excellent product, new SSD, and support.",
          "Contenu": "I’ve used Crucial before and had no hesitation in returning. Easy to identify a replacement SSD for my ageing Acer laptop. The instructions were comprehensive, and when I hit problems customer service was first class. Bonus was the Acronis software that enabled me to clone my existing drive and was ready to go on startup. Programmes now load very quickly and no need to sit around waiting for them to load. Excellent hardware and support."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Traci Salter",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T10:04:37.000Z",
          "Titre": "Helpful guide to help me choose the…",
          "Contenu": "Helpful guide to help me choose the right cards for my iMac as I'm useless at anything tech. The cards arrived quickly and after watching a quick YouTube video I was able to insert them myself with minimal cursing! My computer is now SO much better, I can't believe I put up with it for so long. The memory has made it so much faster and I'm able to  get my work done a lot quicker and with less stress and freezing."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Junid",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T10:41:04.000Z",
          "Titre": "Very fast delivery and Great Customer Service",
          "Contenu": "Very fast delivery. Had some issue with the cloning using the software. This is the first time I am doing a cloning from my internal Hard drive to the SSD. Called their customer service. He was very good in guiding the whole process. Lastly, I managed to complete the cloning process. Also purchased the RAM to upgrade my memory. The DIY video tutorial is also very good guide. The laptop is running better and faster now. Thanks to Crucial. Keep up the good work."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-12-03T23:23:26.000Z",
          "Titre": "Good sevice for a very good quality…",
          "Contenu": "Good sevice for a very good quality device  RAM. Fit very easy for my ASUS and compatible at the first second.     Good job.     Thanks."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Russell Smithers",
          "Nb_Reviews": 2,
          "Date": "2023-09-11T11:16:16.000Z",
          "Titre": "Scan, select, order, install, job done :-)",
          "Contenu": "The hardware scan is the real gem. Then select what you want in the confidence you will get the right part. The rest is just basic delivery and installation.Have used crucial a few times and always had a good experience."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Arjun",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T00:50:10.000Z",
          "Titre": "Got a 16GB RAM to upgrade my laptop",
          "Contenu": "Got a 16GB RAM to upgrade my laptop and it's great. Using for couple of weeks now with no problems! Delivery came as they said it would, well packaged. Would recommend"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T16:21:28.000Z",
          "Titre": "Quality product at the right price",
          "Contenu": "The whole process was seemless. Customer friendly and arrived on time. The tracking was also good to have."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "John Curtis",
          "Nb_Reviews": 10,
          "Date": "2023-10-22T10:09:04.000Z",
          "Titre": "Good value RAM & delivered on time",
          "Contenu": "Ordered 2 16GB rams for my grandson's Asus laptop. Delivered on time to his address as requested and now installed - he's very happy."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Dave",
          "Nb_Reviews": 12,
          "Date": "2023-10-13T18:50:04.000Z",
          "Titre": "Great Service",
          "Contenu": "Well packaged, took a little longer to arrive than originally stated, but I was kept informed and it only ended up being a few days later."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "David S",
          "Nb_Reviews": 5,
          "Date": "2023-10-18T17:13:22.000Z",
          "Titre": "Helped me identify the correct…",
          "Contenu": "Helped me identify the correct specification type of RAM my laptop uses and got a great deal on the kit i chose and bought direct from Crucial A+++++"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "david elkington-cole",
          "Nb_Reviews": 3,
          "Date": "2023-08-06T12:33:47.000Z",
          "Titre": "Quickly obtained product ref over the…",
          "Contenu": "Quickly obtained product ref over the phone . Quick, polite and speedy. Placed order expecting a quick delivery but it took a bit longer...but it did arrive many days later. Easy to insert into the iMac.  AND YES computer response was like lightening."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Caz Cook",
          "Nb_Reviews": 17,
          "Date": "2023-08-18T00:20:54.000Z",
          "Titre": "Great communication about the product I…",
          "Contenu": "Great communication about the product I purchased, quick shipping, well packaged. The product was easy to install and I was up and running it a matter of 15 minutes, I am so pleased my laptop is much faster now with the upgrade. I hight reccomend Crucial for products  price, quality and Customer Service"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jessica Butterworth",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T22:18:49.000Z",
          "Titre": "great experience",
          "Contenu": "shipped fast and let me know about every step of the process. good quality product and packaging; a bit unnecessary how big the package was compared to the RAM but it kept it safe and it works great, easy to install. 5/5!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Habib Ansari",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T17:39:15.000Z",
          "Titre": "I've  Used  Crucial Before  Few  Times …",
          "Contenu": "I've  Used  Crucial Before  Few  Times  I've  Found Them  Reliable  I'll  Be  Useing  Crucial  Again."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Stephen Walker",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T22:21:44.000Z",
          "Titre": "The item ordered arrived within the…",
          "Contenu": "The item ordered arrived within the specified time. Safely packed."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Peter Knight",
          "Nb_Reviews": 4,
          "Date": "2023-09-14T19:06:04.000Z",
          "Titre": "The new SSD drive has transformed a…",
          "Contenu": "The new SSD drive has transformed a sluggish laptop that no one wanted to use into a fast responsive one.The SSD was priced reasonably and installation instructions were easy to follow."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "BBDom",
          "Nb_Reviews": 5,
          "Date": "2023-10-08T10:22:18.000Z",
          "Titre": "Crucially, I'm a Mac-man (See",
          "Contenu": "I'm a Mac-man (See. Scatman John) for over 30 years. I can buy generic but certain things you go to the source such as THAT tomato sauce for burgers, or 'that' ice-cream - 'cos it's the best. There has/is and will only be ONE card maker for me - Crucial. If I ever needed assurance then it comes in the form that Apple build with Micron. No more need be said! Ooh except Thank You, my baby purrrrrrrs :)"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jason Pickford",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T20:55:52.000Z",
          "Titre": "Speedy delivery and great price…"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 11,
          "Date": "2023-09-08T16:35:54.000Z",
          "Titre": "A great price",
          "Contenu": "A great price and a great product in an over saturated market, it's plugged into the PS5 so time will tell if its reliable or not, it's a brand I trust rather than from Amazon I've not heard of."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Paul W",
          "Nb_Reviews": 12,
          "Date": "2023-08-28T21:03:19.000Z",
          "Titre": "Very easy to find the memory I needed…",
          "Contenu": "Very easy to find the memory I needed for the Laptop. Visited their website, allowed them to scan the laptop and selected the memory they recommended. Only downside was that it took 10 days to arrive, but when fitted worked perfectly."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Waclaw Horbaczewski",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T13:03:09.000Z",
          "Titre": "Great support on chat",
          "Contenu": "I got excellent support regarding the Acronis cloning software when I set up a chat.  I was advised I needed to run a patch before running the software itself."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "pat",
          "Nb_Reviews": 23,
          "Date": "2023-11-07T01:26:53.000Z",
          "Titre": "Crucial products I can rely on",
          "Contenu": "I have always found Crucial products to be very reliable and there website and tools  most helpful."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "MAP",
          "Nb_Reviews": 4,
          "Date": "2023-09-25T09:35:44.000Z",
          "Titre": "Excellent product",
          "Contenu": "Excellent product. Worked well and it was easy to install. The screening tool you provide is great, we never know what's the right upgrade and such a support makes a huge difference."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Tony Bardell",
          "Nb_Reviews": 13,
          "Date": "2023-12-10T14:50:52.000Z",
          "Titre": "Straight forward ordering process",
          "Contenu": "Convenient and efficient ordering process. Free delivery came within the stated 5-7 working days."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jamie Bulloch",
          "Nb_Reviews": 7,
          "Date": "2023-11-02T02:15:50.000Z",
          "Titre": "a no nonsence product",
          "Contenu": "a no nonsence product, reliable, quick and superb value for money, quicker delivery would be the only thing to improve.."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Graham Bloodworth",
          "Nb_Reviews": 14,
          "Date": "2023-10-22T14:35:58.000Z",
          "Titre": "A hiccup with UPS tracking",
          "Contenu": "A hiccup with UPS tracking, which was not Crucials fault. The customer support was excellent and my order arrived within the timescale they run to."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Kerry S",
          "Nb_Reviews": 8,
          "Date": "2023-11-17T13:31:26.000Z",
          "Titre": "Happy customer",
          "Contenu": "Great communication, fast delivery and competitive prices I brought the product for my brother and he is very happy thank you"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Steve Karmeinsky",
          "Nb_Reviews": 83,
          "Date": "2023-10-02T18:06:59.000Z",
          "Titre": "Crucial always good for memory",
          "Contenu": "Crucial always good for memory, SSDs etc.The ordering process went without a hitch, delivery was a bit slow, but fine for the job."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Old Man",
          "Nb_Reviews": 8,
          "Date": "2023-07-31T23:56:19.000Z",
          "Titre": "The standout feature",
          "Contenu": "The standout feature with the Crucial website is how you search for your device to find compatible upgrades. It worked brilliantly for my laptop down to the exact variant."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "mr michael dickinson",
          "Nb_Reviews": 10,
          "Date": "2023-11-01T15:18:21.000Z",
          "Titre": "Quality memory",
          "Contenu": "Quality memory. I did not realise that it was coming from abroad hence took a few days but service from crucial was very good."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Martin Bradford",
          "Nb_Reviews": 18,
          "Date": "2023-07-31T20:12:41.000Z",
          "Titre": "Excellent service...",
          "Contenu": "The memory sticks were delivered promptly and were the correct specification for my PC. The price was good and pre sales service excellent - hard to see how you could have done better."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr Alan Mansfield",
          "Nb_Reviews": 10,
          "Date": "2023-08-09T14:20:12.000Z",
          "Titre": "Superb quality upgrade.",
          "Contenu": "The RAM upgrade arrived promptly as advised by Crucial and was fitted with ease. The upgrade to full RAM has improved the computer dramatically. It 'flies' now."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Tony Phipps",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T16:56:05.000Z",
          "Titre": "SSD would not clone due to RAID 1",
          "Contenu": "SSD would not clone due to RAID 1 - got through to Crucial support quickly and the person handled the call calmly, professionally and patiently and talked me through the solution"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ron Flower",
          "Nb_Reviews": 11,
          "Date": "2023-08-22T15:06:59.000Z",
          "Titre": "Laptop memory upgrade",
          "Contenu": "Upgraded the memory on my lap, worth doing as it's a big improvement also used their online tool to see which memory was suitable.  Very useful."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "STEVEN SYMONDS",
          "Nb_Reviews": 4,
          "Date": "2023-08-20T17:26:35.000Z",
          "Titre": "Very swift service.",
          "Contenu": "This is the 2nd time I've purchased from Crucial. Everything went so well with upgrading my desktop im now preparing to upgrade my laptop."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Simon Gogerly",
          "Nb_Reviews": 2,
          "Date": "2023-11-06T16:00:34.000Z",
          "Titre": "Great product at a good price",
          "Contenu": "Great product at a good price. Delivery arrived faster than expected."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Brian",
          "Nb_Reviews": 8,
          "Date": "2023-08-14T12:45:45.000Z",
          "Titre": "In this day and age of 2 to 3 days…",
          "Contenu": "In this day and age of 2 to 3 days delivery time and tracking from time of order, delivery date and length could be improved, my only small moan."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Andrew Rodwell",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T15:27:16.000Z",
          "Titre": "Crucial ssd drive",
          "Contenu": "The phone staff were extremely helpful and the item arrived very quickly with the ability to track order"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wayne Lake",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T21:06:40.000Z",
          "Titre": "I want to correct my earlier review…",
          "Contenu": "I want to correct my earlier review after having dealt with customer service.  I found them extremely helpful and they solved my problem. I trust them."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "pat",
          "Nb_Reviews": 23,
          "Date": "2023-11-09T17:59:57.000Z",
          "Titre": "Now we have the sound of  silence",
          "Contenu": "Now we have the sound of  silence 2 SSD's to replace 2 HDD not a sound. Loudest noise is the  mouse click, and, that's quite  thanks Crucial."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Carl Moreton",
          "Nb_Reviews": 15,
          "Date": "2023-10-22T18:17:25.000Z",
          "Titre": "Website very informative GREAT price",
          "Contenu": "Website was very informative and the sale price was superb.  Arrived within a couple of days."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Reuben",
          "Nb_Reviews": 14,
          "Date": "2023-08-14T22:16:21.000Z",
          "Titre": "Very intuitive website to help identify…",
          "Contenu": "Very intuitive website to help identify the right upgrades. Once received, the process of upgrading in very well explained online again and easy to follow steps."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "S Walker",
          "Nb_Reviews": 2,
          "Date": "2023-08-13T00:35:29.000Z",
          "Titre": "Good Product, Excellent Delivery",
          "Contenu": "Came quickly, in suitable packaging and using a courier service that allowed full traceability of where the parcel was and what stage it was at.Would recommend"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Paul McKillop",
          "Nb_Reviews": 13,
          "Date": "2023-12-10T09:29:50.000Z",
          "Titre": "Complete trust",
          "Contenu": "Great bargain on a disk that I know I can trust"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Alexander Daniels",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T12:45:09.000Z",
          "Titre": "Excellent service so easy to find the…",
          "Contenu": "Excellent service so easy to find the upgrade for my old laptop and delivered on time .Want to upgrade your laptop recommend crucial 5 stars"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ahmed Bilal Khalique",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T23:03:00.000Z",
          "Titre": "Excellent compatibility no issues as…",
          "Contenu": "Excellent compatibility no issues as yet as best peace of mind that in case of non compatibility full refund. I am very happy."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Paul Stanbrook",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T15:36:41.000Z",
          "Titre": "Great service",
          "Contenu": "I had no problem ordering my DDR memory and the scan features are very helpful."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mark Smith",
          "Nb_Reviews": 2,
          "Date": "2023-08-08T23:21:07.000Z",
          "Titre": "Now super speedy.",
          "Contenu": "The drive turned up within a reasonable amount of time and I was able to track it across Europe. The best bit was when I first turned on my old 2011 Mac Book Pro with the new drive, it only takes about 15 seconds to open up. The old drive took about 2 and half minutes. Such an improvement for very little outlay."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mark Oakley",
          "Nb_Reviews": 4,
          "Date": "2023-09-26T13:49:25.000Z",
          "Titre": "Stress free and painless way to upgrade laptop",
          "Contenu": "Very easy to navigate the website to upgrade your laptop quick delivery although did take a few days due to coming from china, overall very good service this is the second time I have upgraded my laptops and each time has been completely painless."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Rob Walker",
          "Nb_Reviews": 7,
          "Date": "2023-08-21T18:58:03.000Z",
          "Titre": "RAM for a laptop",
          "Contenu": "I ordered RAM for a laptop, the RAM came within the delivery time given, and when fitted did what it said on the box."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "David TW",
          "Nb_Reviews": 4,
          "Date": "2023-09-29T14:42:46.000Z",
          "Titre": "Excellent",
          "Contenu": "Excellent products. Excellent service. Great delivery. What more can you ask for.Cheers"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Shirley Turner",
          "Nb_Reviews": 32,
          "Date": "2023-10-08T18:45:06.000Z",
          "Titre": "Love the program for working out the…",
          "Contenu": "Love the program for working out the type and size of memory for each machine. Fairly swift delivery."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "George",
          "Nb_Reviews": 6,
          "Date": "2023-11-28T12:04:00.000Z",
          "Titre": "My experience with your company has…",
          "Contenu": "My experience with your company has always been excellent.Communication has been 1st class"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Peter Crosse",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T13:04:56.000Z",
          "Titre": "500GB external SSD",
          "Contenu": "New 500GB external SSD is so tiny and works so fast it has completely turned me off hard drives."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "karl clutton",
          "Nb_Reviews": 4,
          "Date": "2023-09-22T12:16:43.000Z",
          "Titre": "Delivery details vague but prompt…",
          "Contenu": "Delivery details vague but prompt postage, haven't tried unit yet as on holiday"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Andrew Sawyer",
          "Nb_Reviews": 2,
          "Date": "2023-08-17T21:25:57.000Z",
          "Titre": "Great customer service",
          "Contenu": "Had an issue with the first delivery not arriving, replacement arrived safe and sound, fitted and working great.Very good customer service, sorted my issue quickly"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Robert Penfold",
          "Nb_Reviews": 8,
          "Date": "2023-09-13T17:39:58.000Z",
          "Titre": "Delivery was a little slow but i was…",
          "Contenu": "Delivery was a little slow but i was able to track it and the issue probably lay with Royal Mail!!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Rob Newis",
          "Nb_Reviews": 2,
          "Date": "2023-11-24T17:12:39.000Z",
          "Titre": "Fast delivery and product as described"
        }
      ]
    }
  ]
}