{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "vaulteksafe.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ben",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T10:25:13.000Z",
          "Titre": "Wholly disappointing",
          "Contenu": "Bad app quality. Safe won’t connect to WiFi. Overall good build but low polish level and attention to detail."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christopher Foley",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T05:59:46.000Z",
          "Titre": "I bought the power pack solely because…",
          "Contenu": "I bought the power pack solely because they advertised that it would add 4 to six months of battery time. Once the main battery was expended it lasted less than a week."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jody McIntyre",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T16:08:48.000Z",
          "Titre": "Purchased a Smart  Station bedside…",
          "Contenu": "Purchased a Smart  Station bedside safe. Within 2 weeks after setting it up, it failed me! Safe froze up. Contacted customer support and got the run around  for the past week!  Ended up returning product for lack of confidence in the safe to work when needed!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scott Tanner",
          "Nb_Reviews": 4,
          "Date": "2023-10-23T16:24:39.000Z",
          "Titre": "I paid for but never received my bio…",
          "Contenu": "I paid for but never received my bio modules. I sent email and no-one responded. Let me just say i am contacting my credit card company regarding this. Very disappointing!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jared Zabaldo",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T03:43:11.000Z",
          "Titre": "The absolute worst batteries",
          "Contenu": "The absolute worst batteries.  Terrible.  I have purchased two batteries to replace the original the safe came with.  And I bought the external battery pack.  They all suck.  Horrible.  Basically, I have to charge it every single week because if I don't, the entire safe is dead and cannot be accessed.  Just an atrocious battery OR the damn safe drains it despite it never being opened.  Whatever the reason, totally useless unless I just leave it plugged in.  Pathetic."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "TM",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T17:20:04.000Z",
          "Titre": "Product damaged",
          "Contenu": "Wish there was a separate customer service rating because that was outstanding but the humidor cedar tray delivered was cracked. It was just packed in a soft package with no protection so cracked during shipping. I just wood glued it together rather than making an issue."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jerkface Dumdum",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T19:28:23.000Z",
          "Titre": "Bluetooth feature disables itself.",
          "Contenu": "Bluetooth feature disables itself every couple days so you have to manually enter unlock code to re-enable it again. Vaultek has done nothing to remedy this and admits others have called about same issue. Save your money and don’t bother getting the “convenient” Bluetooth option.Nice auto reply Vaultek. I’ve already contacted you months ago and nothing has been done."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 2,
          "Date": "2023-05-17T14:26:21.000Z",
          "Titre": "What product?",
          "Contenu": "Stop asking for reviews on product I still haven’t received. I selected a specific color based on “in stock” status. I get an email 4 days later saying it’s actually backordered for over a month and with no option to select a different color that will be in stock sooner. Color isn’t important to me. Mistakes happen, I get it, but I can’t leave a positive review based on this experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Billy",
          "Nb_Reviews": 1,
          "Date": "2023-05-13T16:56:54.000Z",
          "Titre": "Deceitful",
          "Contenu": "Your website stated items were in stock, I purchased 2. A week later I get an email “Sorry there was a glitch in our website, certain models won’t ship for over a month” you advertised an item that was in stock that was not I am already disappointed in your brand."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T16:23:46.000Z",
          "Titre": "Wifi does not work. Returning.",
          "Contenu": "I bought this safe specifically for the wifi connectivity and alerts. It does not connect to wifi, the app is useless, and customer service does not answer the phone. For the money this needs to work. I will be returning it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Geoffrey Preston",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T19:07:09.000Z",
          "Titre": "Been waiting for the DS2i Smart Station…",
          "Contenu": "Been waiting for the DS2i Smart Station to come back in stock for 2 months.  Get an email that it will be available at 9am ET the following day (2/15).  Try to order and receive error after error on the web site.  Product is now out of stock again.  Not sure who could actually order it with such a terrible e-commerce platform.  If you can't build a website that can handle modest order volumes, don't run a promotion that concentrates volume to a specific time.  Tragic experience in today's IT world."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ed",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T06:13:00.000Z",
          "Titre": "Too small for a full-size handgun and…",
          "Contenu": "Too small for a full-size handgun and anything else. Side locks prohibit quick access"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rich",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T00:01:36.000Z",
          "Titre": "Purchased safe end of last month",
          "Contenu": "Purchased safe end of last month, and received a message they do not have my item in stock. Instead of maybe a discount or some sort of accommodation on future purchases, they essentially told me to change my order or they could refund me. It will be over a month until I get my product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andrew Medvedev",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T19:59:54.000Z",
          "Titre": "BIGGEST WASTE OF MONEY",
          "Contenu": "No discount … FAIL, overpriced piece of plastic, should have been metal… only special discounts for specially qualified individuals…. BULL $H!T…. I want my money back , ID10T’s"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chelsea",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T19:57:44.000Z",
          "Titre": "False in-stock/shipping information",
          "Contenu": "Said it was in stock so I ordered it for Mother’s Day as a gift (2.5 weeks prior to Mother’s Day) and then didn’t get an email about shipping so I emailed them a week and a half after I ordered only to find out it won’t be in stock until 25 May! They said I should’ve been notified but I never was until it was too late to order her something else. I won’t be buying from the website. Upset about the lack of customer support and service!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MNGUNSMITH",
          "Nb_Reviews": 2,
          "Date": "2023-03-21T03:18:32.000Z",
          "Titre": "Never received my items.No show",
          "Contenu": "Never received my items. Even though I never received my Items and paid for them, I still can't seem to get anything out of them for products! Just looking for something to secure my firearms in a smaller package other then a massive vault.  🤔 When will they give me either what I paid for or credit for something else in there store?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Drew",
          "Nb_Reviews": 1,
          "Date": "2023-05-21T20:57:27.000Z",
          "Titre": "“processing” for 20 days???",
          "Contenu": "My order has been “processing” for 20 days with no update or response.  If the website shows inventory and allows me to order a product there should be some communication from the seller if there is an issue??"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jonathan",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T02:32:09.000Z",
          "Titre": "I never got the safe"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Omans",
          "Nb_Reviews": 2,
          "Date": "2023-09-21T15:31:10.000Z",
          "Titre": "I purchased a replacement battery…",
          "Contenu": "I purchased a replacement battery (VP2200) for my MXi safe. The battery only lasts for around 6 days before being drained so low that the safe is inoperable unless I plug it into an outlet. If I had known the battery was that undersized for this safes application then I would have never wasted the money buying this battery. The site should say this battery will only hold charge for a week. Vaultek’s customer service replied that this is normal for this model battery. Plus, the Vaultek website shows that my purchase should have been a VP3000 battery. They suggested I spend even more money to purchase a VP6000. No thanks. As the saying goes “Fool me once…”Customer Service Rep said the website hasn’t been updated to reflect that the VP3000 is no longer available.I have two Vaultek safes but I’m seriously considering changing my gun storage devices.FOLLOW-UP TO REVIEWSept 20, 2023As expected, Vaultek Customer Service has not followed up with their e-mail promise to reach out to me for resolution of my poor experience with their battery’s performance. The takeaway is that they sure don’t mind taking your money, but when it comes to standing behind their products, they give public lip service then quickly disappear. Vaultek, please don’t send out another hollow response to make prospective buyers believe you have real customer service. Just be real and stop posing as a supportive company and show what you’ve become…a one time sale company with no customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MNGUNSMITH",
          "Nb_Reviews": 2,
          "Date": "2023-03-21T03:33:10.000Z",
          "Titre": "Never received my items. No show",
          "Contenu": "Never received my items. I called a few times about my missing order and never received anything back. I really want to get my full order sent to me or at the least send me a way that I can spend what I spent on your site back on your site!! I still want to try out your products. If VaultTek ever reads this, please contact me so I can receive my order or other products."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Greg Husbands",
          "Nb_Reviews": 1,
          "Date": "2023-06-10T02:56:47.000Z",
          "Titre": "LATE DELIVERY... STILL NOT DELIVERED",
          "Contenu": "Delivery was delayed twice. Being that the safe is heavy and it has to be signed for I took the day off of work to make sure I was there to receive. Not only was my safe delayed, my friend's safe was delayed also (we both ordered the same day). Seems like this is a common issue for your company. Very unprofessional. Not the type of service I expect when I spend over 2k on a product… Was going to order the biometric lifepod 2.0 but I now I highly doubt it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "B.Robert - With no safe",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T12:36:31.000Z",
          "Titre": "Website crashed- Weeks later no safe- no communication either",
          "Contenu": "Website crashed over and over. It’s been weeks since I was charged twice and still have no safe. I was refunded one of the $500 transactions and then found out the safe I wanted wasn’t in but I could pick another one and get it on the 21st. That hasn’t happened as of the 23rd and no response from customer support after reaching out twice. I was asked to fill out 9 surveys though so here ya go. Two thumbs down so far."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-05-20T05:38:44.000Z",
          "Titre": "How am I supposed to review a product…",
          "Contenu": "How am I supposed to review a product that wound up being on back order after I purchased it and I haven’t gotten it yet after paying full price for a lie that said it was in stock?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lonnie",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T22:16:46.000Z",
          "Titre": "cannot get the code to set or hook to…",
          "Contenu": "cannot get the code to set or hook to wifi without error codes"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2023-05-14T00:11:06.000Z",
          "Titre": "Haven't received the product",
          "Contenu": "Ordered a safe that said the item was in stock and ready to ship. I recieved an email stating they confirmed my order and it would ship in a few days and I would recieve and email with tracking numbers. After a week, I emailed them because i haven't received an email with tracking numbers. They responded they did not have the product in stock and it is supposed to be in at the end of May. I haven't received this product, but they have my money. I guess I'll wait and see what happens."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "DAVID",
          "Nb_Reviews": 1,
          "Date": "2023-05-20T09:40:05.000Z",
          "Titre": "I ordered a safe from you and was told…",
          "Contenu": "I ordered a safe from you and was told a delivery date then was emailed days later telling me there was an error and my unit wouldn't be shipped out for a month. I belive that was unacceptable. I had to email to get a refund. Do not sell products you can't ship. I waited for 6 months for that safe just to be told after I paid that you didn't even have it its a shame. I wanted that safe and now probably won't do business with you at all."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Ken",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T21:36:56.000Z",
          "Titre": "Website failure",
          "Contenu": "I still dont think website excuse is fair to the buyer. I had a safe secured and was kicked out. You should have some set aside and honour people whom waited and secured an order and fullfill it vs telling them to wait until next month when the new onesCome in again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rafael Matos",
          "Nb_Reviews": 3,
          "Date": "2023-03-22T22:31:13.000Z",
          "Titre": "Had to cancel order due to your mistake…",
          "Contenu": "Had to cancel my order due to a mistake in your processing. VERY disappointing to have a company with such a great reputation to fail on a simple order.\"Complications caused during checkout, from the extreme demand and unprecedented heavy website traffic, have resulted in us overselling this product causing a delay in your order arrival date.\""
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mason",
          "Nb_Reviews": 2,
          "Date": "2023-05-21T23:40:15.000Z",
          "Titre": "I was wanting to exchange my order",
          "Contenu": "I was wanting to exchange my order. I have done the return request twice and I haven’t heard back. So I am not satisfied nor do I plan to order anything from you in the future. Do better!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Erik",
          "Nb_Reviews": 1,
          "Date": "2023-03-17T19:14:00.000Z",
          "Titre": "Website/oversold now won’t email back to cancel",
          "Contenu": "Website crashes, then they email me several days later saying they over sold the safe and can’t ship me one.  I’m trying to cancel my order and they won’t email me back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T19:32:47.000Z",
          "Titre": "My battery died and I got fully locked…",
          "Contenu": "My battery died and I got fully locked out, no way to plug in and get in.  Then was using my key and it suddenly failed.  I’m totally locked out and having to try and rip the stupid thing open to get to my guns…thx"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Maury",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T02:22:58.000Z",
          "Titre": "Inform buyers",
          "Contenu": "Was not informed before purchasing that it would take 3 weeks before it ships. It said in stock so I bought it, wish I would have known I would be waiting for so long."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2023-05-13T23:34:20.000Z",
          "Titre": "Perhaps my rating will be higher when I…",
          "Contenu": "Perhaps my rating will be higher when I eventually receive the safe. Original shipping date was delayed for a month."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rolando",
          "Nb_Reviews": 1,
          "Date": "2023-01-28T19:15:39.000Z",
          "Titre": "I sent an email about problem operating…",
          "Contenu": "I sent an email about problem operating my lock box but I never recieve any answer, I spent over $600 and no tech support."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T17:32:14.000Z",
          "Titre": "Still haven’t received the item…",
          "Contenu": "Still haven’t received the item purchased. When I asked for a refund of the  shipping charges due to the delay, nobody from Vaultec contacted me"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Udoka",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T01:26:57.000Z",
          "Titre": "Horrible customer service not for the people",
          "Contenu": "To start their products are great, but the customer service is subpar to say the least. Being a company that make firearm safes and claim to support 2A, you would think that the company is for the people. This couldn't be furthest from the truth. On April 26, 2023 i ordered the \"smart station\" (which on the website showed to be in stock) intended to be a mothers day gift for my wife as she recently joined the 2A family a purchased her first hand gun. Going out of my way to ensure that the product would arrive before Mother's Day, I researched form the company's website that their listed shipping time was estimated to be 5 business days, in turn giving just about 3 weeks for product to reach me. On May 2, 2023 I received an email from vaultek stating...\"We wanted to make you aware of a shipping delay. Due to an internal error, we did not adequately display the correct shipping date. The display should have notified you at the time of checkout that all Titanium Gray and Alpine White Smart Stations will ship on, or around, 5/25.\"Immediately I got in contact with customer service and advised them of the extreme inconvenience this oversight on their part has caused me. The lack of empathy and compassion in which the company displayed towards my hardship was Sicking. I was basically told to go \"F\" off and wait, and when I requested to speak to a supervisor I was denied. This is a money hungry company who cares nothing about the American people or our right to bear arms. They only care about money, we are nothing but a number to them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mosquito",
          "Nb_Reviews": 4,
          "Date": "2023-05-05T14:38:07.000Z",
          "Titre": "For 650.00 I could buy a real safe!!!",
          "Contenu": "For 650.00 I could buy a real safe, get someone to answer the phone and at least help me with my issue. I bought a life pod XT2 and the thing just won’t work. No response from vaultech for 3 weeks. They suck and don’t waste your money. I got a huge paper weight to bring to the range next week for target Practice. 5 Star Support? Our you kidding me?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bw",
          "Nb_Reviews": 3,
          "Date": "2023-05-17T01:36:53.000Z",
          "Titre": "Ordered 5/2/23 per website item was in…",
          "Contenu": "Ordered 5/2/23 per website item was in stock. It is 5/16/23 and still hasn't shipped. No info sent to me about a delay. I finally reached out and was told shipping is delayed till 5/23. Very disappointed ......."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T18:55:45.000Z",
          "Titre": "Poor instructions",
          "Contenu": "Poor instructions, and very delayed support. They do not have a phone number even call in."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Yuri",
          "Nb_Reviews": 1,
          "Date": "2023-02-12T17:31:01.000Z",
          "Titre": "Label created and no shipment for week and a half",
          "Contenu": "the FedEx label was created week and a half ago and the order still has not been shipped… no follow up correspondence at all."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anonymous Customer",
          "Nb_Reviews": 2,
          "Date": "2023-10-19T07:19:36.000Z",
          "Titre": "Cool Idea That Looks Good On Paper.",
          "Contenu": "Cool Idea That Looks Good On Paper.Pro's:- Cool Idea and great looks- Supposedly no 'backdoor' access- Customer Service (so far and for myself anyway)Con's- Fingerprint reader (high False Rejection Rate)- Accessory fitments (not optimal and lacking, to say the least)- It's not a safe, more like a glorified storage cabinet like 'Secure-it'---Details Below---I thought I would go all out on an RS safe. It turns out I should have gone bare-bones basic (which is still fairly pricey for what an RS 'safe' is). Shipping was fine and I was excited to install my third attempt at a so-called \"safe.\" Will it keep kids out of it? Probably. Will it keep burglars out of it? Depends. A smart one will get into this thing in no time at all with minimal effort just by going in your garage and grabbing basic tools I'm sure any gun owner would have lying around. So time and noise are always somewhat of a deterrent, of course.When I first received the RS Series - RS800i PLUS Edition, there was a manufacturer defect with the electronics and LEDs. Vaultek CS was on point with return shipping and replacement. Thank you for that. Installing the new unit, I used 4 times longer fasteners and extra wide fender washers, to go into drywall/wood/then concrete, than what was provided. This thing won't be going anywhere now unless it's simply cut open and contents easily removed. Strongly recommend not using included hardware because I don't believe it to be long enough.The main selling point of this safe is probably the fingerprint reader, which is probably the worst and most frustrating thing. 20 different fingerprints are able to be read/programmed with the first two being master prints just case you run a risk of chopping off a finger; or to grant a loved one master access as well. The first testing result yielded horrible odds of a successful read (False Rejection Rate). The instructions do recommend for difficulty with fingerprint reading to program 4 or 5 of the same print to assist in the reader recognizing one print. This solution then leaves 15 to 16 different prints left to program and it still does not yield great results. I was unable to find two fingers I'd prefer to open this 'safe' with 100% accuracy. Not a comforting feeling. After using all 20 programs, I'm still trying to figure out how to let my wife program at least one of hers. We've tried having her program all 20 programs with her fingerprints and yielded similar results. The odds of it accepting the prints are still bad. It may be acceptable if your finger was wet, oily or dirty to get such inaccurate results, but a perfectly dry print yielding around 80% is completely unacceptable for immediate access if need be.Then came the fun part of filling in the 'safe' RS (storage cabinet). The advertisement photos are really misleading (false advertisement) in that they lead you to believe you can fit all the things they show in such a small space. The first issue was fitting the Full Width or 2/3rd Shelf and Pistol Racks inside the upper portion of the safe and fitting the AR Accessory Bundle on the door. When trying this configuration, the shelf sticks out enough to block the area where I would like the Spring Loaded Mount to go. In other words, it will not let you close the door if installed near the same level on the door as the Full Width or 2/3rd Shelf inside the cabinet.IMO there are other misleading photos regarding rifles being installed on the door. There always will be an extra step to getting a firearm ready for use as opposed to 'ready for use.' I'd prefer to have enough room on the door to have a rifle with optic/sights installed and erect and a magazine inserted. Sadly, there is not enough room for both. This will only work with flip up sights being down with a magazine installed and the rifle positioned all the way left on the door. Alternatively, the rifle can have sights/optic installed and erect with no magazine, but the rifle would have to be installed further right on the door panel which may lead to interference with the grip and the door closing. Utilizing the 'ROMEO 5' type optic, the grip touches/interferes with the door. The hope is that when I try to open the door in an emergency, there will be no interference with the grip (which there currently already is).All in all, I'm mostly happy with the product. I hope this constructive criticism is taken to heart. I also feel if all these issues weren't here, only then it might be worth the two thousand dollar price tag."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stacey",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T12:19:46.000Z",
          "Titre": "Very Disappointed",
          "Contenu": "I waited months for you to restock your product. I finally placed my order on May 2, 2023. Today is May 19th and I have not received my purchase. I will reach out to my bank to request a refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joshua",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T04:55:08.000Z",
          "Titre": "Think twice",
          "Contenu": "the product quality is mediocre for the price and the craftsmanship is lacking. The delivery service is horrible, the worst I’ve ever had and the customer service is absent and unresponsive"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Charles W",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T23:55:11.000Z",
          "Titre": "I’ve been trying to get an MX series…",
          "Contenu": "I’ve been trying to get an MX series safe for over a month now and they’re always out of stock. I even looked on their Amazon page and there’s at least a month long wait for the safe. Because of my job I can’t wait a month. Bad service. I’ll try someone else."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Peter",
          "Nb_Reviews": 1,
          "Date": "2022-12-23T15:38:38.000Z",
          "Titre": "Smart Station- great concept, but not ready to launch.",
          "Contenu": "Like a lot of people (based on the website crashes to order the second round), I was thrilled to get ahold of a smart station for myself and a friend. My first one was a problem almost out of the box- would basically lock me out just looking at it despite saving 15 different versions of the same finger to unlock it. The keypad was unreliable, and the wireless charger was spotty. I sent it back and got a new unit. Now, the locking mechanism works but the safe has a habit of loudly beeping at us at 3 am every night Until we wake up. My friend reported that his unit barely opens on the initial release. He has to close and then re open for it to fully launch. The smart station is a great concept, but way too many bugs for me. This is supposed to be able to help quickly respond to a possible home emergency, and frankly seems to be fully capable of putting my family in danger more than helping. Vaultek support has been great, and I have appreciated their help but this product just is not ready for market."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Doug",
          "Nb_Reviews": 1,
          "Date": "2023-05-21T03:22:08.000Z",
          "Titre": "I have not received my vaultsafe but…",
          "Contenu": "I have not received my vaultsafe but they took the money out of my account the next day.   I had to call to get someone to tell me what was happening.  I still don’t have the product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T22:33:44.000Z",
          "Titre": "The fingerprint reader just won't work",
          "Contenu": "The fingerprint reader just won't work. No matter how many times I re-register, it won't work. Not impressed with this device at all. Never again...and this is my second Vaultek. Can't get the BlueTooth to work on that one....should have known."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ed",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T23:46:49.000Z",
          "Titre": "Tried to return the item and get a…",
          "Contenu": "Tried to return the item and get a different one and no one reached out to give me an RMA. Bad experience"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Londergon",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T19:05:52.000Z",
          "Titre": "Complete garbage. will keep everyone…",
          "Contenu": "Complete garbage.will keep everyone out, including you! If you want a safe that works only with a key this is for you"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bruce Smith",
          "Nb_Reviews": 3,
          "Date": "2022-11-26T04:51:25.000Z",
          "Titre": "I can’t get the safe to program my…",
          "Contenu": "I can’t get the safe to program my combination. It will not go into program mode.  Very unhappy."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anonymous Customer",
          "Nb_Reviews": 2,
          "Date": "2022-11-26T20:44:04.000Z",
          "Titre": "RS800i or any RS model glorified storage cabinet",
          "Contenu": "RS800i or any RS model; This is nothing more than a glorified quick access storage cabinet. It's not a safe. And for it to be close to $2,000 China made, it's a complete rip off. The front is hardly \"safe\" quality and is very similar to the SecureIt storage cabinets. The unit is also only thin metal and nothing more than the same thin metal as the cabinets in my garage. Anyone with lack of brains and a small crowbar or angle grinder would get into this so called \"safe\" very quickly without the code or fingerprint (biometric) scanner. This industry really need standardization in what companies are allowed to call a safe, and this is not it. My experience with this \"safe\" is I thought maybe because of a Black Friday deal I'd bite the expensive bullet and give a quick access \"safe\" a try. After opening the box, I'm sadly disappointed in realizing how poor quality this glorified storage cabinet is. Reading the instructions and programming the unit, I noticed more than half of the LEDs do not work. Once again, I was duped off of a Chinese made P.O.S... Now I am returning the unit and I don't even want a replacement, the lack of security and quality are really not worth the hefty price tag."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T21:12:20.000Z",
          "Titre": "Tried to order and website was slow and…",
          "Contenu": "Tried to order and website was slow and freezing…still don’t know if my order wemt thru."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bret",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T22:26:52.000Z",
          "Titre": "The site crashed and I was unable to…",
          "Contenu": "The site crashed and I was unable to purchase the smart station I tried right at 11am and I was unable to make a purchase by 11:45 you were out of stock"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 2,
          "Date": "2023-05-08T18:41:39.000Z",
          "Titre": "Safe showed up and function for a week",
          "Contenu": "Safe showed up and function for a week. I can only access using key. Been calling all day to get this returned. I was told that I would receive a call in a couple of hours. No call."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Reppo",
          "Nb_Reviews": 3,
          "Date": "2022-12-10T03:00:02.000Z",
          "Titre": "Will not connect to the internet",
          "Contenu": "Will not connect to the internet. Everything in my whole house is connected. It’s 2022, this should be the easiest thing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kenneth",
          "Nb_Reviews": 1,
          "Date": "2022-12-23T16:23:38.000Z",
          "Titre": "The site crashed and had to spend over…",
          "Contenu": "The site crashed and had to spend over an hour to buy my safe. It’s been 2 weeks and I still have not received it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Victor",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T16:25:55.000Z",
          "Titre": "Bad shipping",
          "Contenu": "Bought the product at the beginning of the month and it’s the 19th and no word on shipping."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chad",
          "Nb_Reviews": 1,
          "Date": "2023-04-14T21:02:30.000Z",
          "Titre": "I tried to return multiple items but…",
          "Contenu": "I tried to return multiple items but never had a response from customer service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gene",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T22:26:45.000Z",
          "Titre": "Didn’t send me my full order",
          "Contenu": "Didn’t send me my full order. Still waiting for “support” to send me my Velcro strap mount."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kevin Hudson",
          "Nb_Reviews": 2,
          "Date": "2023-05-19T07:22:35.000Z",
          "Titre": "You send me a review before I’ve…",
          "Contenu": "You send me a review before I’ve received my vault. This thing on back order?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T13:25:59.000Z",
          "Titre": "MADE IN CHINA",
          "Contenu": "MADE IN CHINA. This should be in the description and specifications."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nick",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T13:48:28.000Z",
          "Titre": "Box says made in China",
          "Contenu": "Box says made in China. Foam pieces are very loose. It is nice to keep in my car but the made in China really bothers me. I am buying a stop box for my other vehicles."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Celestin",
          "Nb_Reviews": 2,
          "Date": "2023-04-24T19:28:31.000Z",
          "Titre": "The biometric fingerprint doesn’t work…",
          "Contenu": "The biometric fingerprint doesn’t work about 95% of the time"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jonathan",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T22:58:25.000Z",
          "Titre": "The alarm sounds is very low and I can…",
          "Contenu": "The alarm sounds is very low and I can barley hear it!  I thought it would be loud enough to let me know when/if my son tried to get in safe"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rayrocthegod",
          "Nb_Reviews": 2,
          "Date": "2023-08-06T05:47:14.000Z",
          "Titre": "Blinking and beeping paper weight",
          "Contenu": "I purchased a slider series safe for my suv but before I could even get it into my jeep it started to act weird by not allowing me to use the keypad and the slightest touch would cause it to blink and beep which gets annoying fast but to make things worse after talking to customer service I’m no longer able to use the finger print scanner to open the safe. After sending a video of the safe doing this blinking and beeping thing I was informed by customer service that it was in access detection mode (or something like that) and was given instructions on how to take it out of that mode but it didn’t work which they replied with they would give me a call, well several weeks later and still waiting for the call. There should be a way to factory reset the safe but I have yet to find it which is disappointing because I paid a lot of money for this safe that I guess I can still use the physical key to access but even then it will beep and blink when touched"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 2,
          "Date": "2023-02-25T18:44:33.000Z",
          "Titre": "My order was automatically cancelled…",
          "Contenu": "My order was automatically cancelled and I don’t know why"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Trevor",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T01:58:57.000Z",
          "Titre": "Still haven’t received any shipping…",
          "Contenu": "Still haven’t received any shipping information or status."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sarah",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T23:16:50.000Z",
          "Titre": "Not working",
          "Contenu": "Not working, the temp, the finger lock, the digital # lock"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Saul",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T03:42:25.000Z",
          "Titre": "The biometric fingerprint does not work…",
          "Contenu": "The biometric fingerprint does not work on my safe rendering it useless"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Roy",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T00:54:12.000Z",
          "Titre": "Slow delivery",
          "Contenu": "I have yet to receive my safe. Can't review yet. You have received my payment."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William Jacobyansky",
          "Nb_Reviews": 10,
          "Date": "2023-02-27T13:18:51.000Z",
          "Titre": "Almost two months and I still haven't…",
          "Contenu": "Almost two months and I still haven't received the order"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marcus Barker",
          "Nb_Reviews": 1,
          "Date": "2023-03-04T00:11:15.000Z",
          "Titre": "Everything was going well and then I…",
          "Contenu": "Everything was going well and then I clicked purchase with all of my information and the smart station with credit card information and than it arreared out and I tried it again and then said sold out so not that happy because I have waiting over a month and it’s for a birthday this month and yes I was at the website at 10 central  time and still nothing so no present"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 1,
          "Date": "2023-05-20T14:51:38.000Z",
          "Titre": "Have not received it",
          "Contenu": "Have not received it. No shipping notice."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 1,
          "Date": "2023-05-13T15:11:03.000Z",
          "Titre": "You didn't have the product you were…",
          "Contenu": "You didn't have the product you were advertising."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2022-09-19T22:50:31.000Z",
          "Titre": "this \"safe\"it's plastic i would not…",
          "Contenu": "this \"safe\"it's plastic i would not call this a safe at all it's just a plastic lock box. so much money for a plasticbox I'm very disappoint on the material of this box(with a hammer you can break this box in one single swing) there it's not different between this box and the plastic box that came with any handgun."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard Cooper",
          "Nb_Reviews": 8,
          "Date": "2022-10-08T16:27:43.000Z",
          "Titre": "Ordered product 9/27",
          "Contenu": "Ordered product 9/27.  Quickly received a shipping tracking number.  Today is 10/8, tracking information indicates product hasn't been picked up by shipper.At lease Vaultek could inform me my order would be delayed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jack N Zuri",
          "Nb_Reviews": 2,
          "Date": "2022-12-28T07:50:48.000Z",
          "Titre": "You guys unfollowed us on Instagram",
          "Contenu": "You guys unfollowed us on Instagram, and ignored all our DMs. Mad disrespectful"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeffrey",
          "Nb_Reviews": 1,
          "Date": "2022-12-05T20:21:14.000Z",
          "Titre": "Haven’t received product yet",
          "Contenu": "Haven’t received product yet. Waiting on fedex to call me back since Thursday."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "TERRY",
          "Nb_Reviews": 2,
          "Date": "2023-03-21T19:38:05.000Z",
          "Titre": "Customer service",
          "Contenu": "Sent an email explaining what happened and have not heard back. Sent wrong product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cameron",
          "Nb_Reviews": 1,
          "Date": "2022-09-12T22:07:19.000Z",
          "Titre": "Vaultek cancels order",
          "Contenu": "After buying the rs800i, I sat there excited that I’m getting this awesome safe soon. 2 weeks later I found out that vaultek cancelled my order because of a “high risk” when I put my bank information in. Then got notified that PayPal was more secure than a bank."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brand M.",
          "Nb_Reviews": 1,
          "Date": "2022-11-02T05:56:53.000Z",
          "Titre": "I ordered a RS500i",
          "Contenu": "I ordered a RS500i. Ordered it from NW Safes and it came it in two days. Fantastic, but… when I tried to program my new code, that’s when the problems began. I was able to open the safe with the key no problems there. However when I put in the master code it I get a message “unlock granted” but then it reads “status: locked.” (This was after I put the battery in and plugged the unit in). Unplug the safe and removed battery same problem. Called NW Safes and their “tech” said to watch YouTube videos of how to program the safe. Okay…. So to summarize I paid 1500 plus for a safe that I can only open up with a key (which I am now dubious if it will work correctly in the future given the problems with the electronics). Again to iterate, I opened the safe with the key, put the battery in, with the door open used the master code to change the passcode. It recognizes the  master passcode but the status still says locked and when I try to reset the passcode via vaulteks’ prescribed method I get a Tamper Warning message. Oh and there is no way for me to contact somebody from Vaultek to resolve the issue. Save your money, time, and firearms and look to a more reputable safe maker."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Forrest",
          "Nb_Reviews": 1,
          "Date": "2023-05-14T20:19:33.000Z",
          "Titre": "Haven’t received my order"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Darrick",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T17:42:09.000Z",
          "Titre": "I still have not received my order."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "NEPTHALI",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T15:41:49.000Z",
          "Titre": "I’m still waiting for the answer"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "TERRY",
          "Nb_Reviews": 2,
          "Date": "2023-03-23T14:31:59.000Z",
          "Titre": "No one responded to my email."
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "Jesus Benavides",
          "Nb_Reviews": 1,
          "Date": "2022-10-04T07:25:43.000Z",
          "Titre": "They made a mistake in the shipping…",
          "Contenu": "They made a mistake in the shipping address and I'm still waiting for news about what will happen to my order.  I'm in limbo waiting"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ed",
          "Nb_Reviews": 1,
          "Date": "2023-02-18T23:54:00.000Z",
          "Titre": "I didn't realize the latches had to be…",
          "Contenu": "I didn't realize the latches had to be so loud. I don't like it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2023-01-20T17:52:25.000Z",
          "Titre": "I still haven’t received my order that…",
          "Contenu": "I still haven’t received my order that I placed on January 3rd"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Harry",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T16:04:50.000Z",
          "Titre": "Issue remains unresolved",
          "Contenu": "Issue remains unresolved; no follow actions were taken"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Will O'Brian",
          "Nb_Reviews": 1,
          "Date": "2022-04-02T21:42:46.000Z",
          "Titre": "3 Strikes and your out.",
          "Contenu": "I have had 3 different Pew Pee Life Pods. All three have had different issues from parts missing to the pod itself not working. This company has Zero customer support. Seriously for the price have someone answer the phone. Save your money and buy anything else."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T17:31:53.000Z",
          "Titre": "I never received the package."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "anthony boyer",
          "Nb_Reviews": 1,
          "Date": "2021-07-29T21:10:13.000Z",
          "Titre": "Disappointed",
          "Contenu": "Disappointed. Can't use tray with sub compacts like show in pictures. Safe will not close with sub compact below or on top of tray. Don't like to use lid organizer because it smashes everything against my hand gun. Overall the safe is designed to look cool and get your attention but the function of the safe is disappointing to say the least."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T17:36:26.000Z",
          "Titre": "The phone charger rarely works",
          "Contenu": "The phone charger rarely works. And it has no alarm clock."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "frankie wasp",
          "Nb_Reviews": 1,
          "Date": "2020-10-02T15:55:44.000Z",
          "Titre": "I am in the market for a good quality…",
          "Contenu": "I am in the market for a good quality hand gun safe and thought Vaultek might fit my needs. After reading some recent reviews about the security of the safe I decided to call and speak to their customer service but could only send an email. I sent them an email and received a call back but the call dropped twice and now no call back. If this is how this company operates before you buy one of their products all I can say is I will look elsewhere."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marshall",
          "Nb_Reviews": 1,
          "Date": "2022-11-21T22:55:26.000Z",
          "Titre": "Terrible directions...."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jose Ortiz",
          "Nb_Reviews": 3,
          "Date": "2020-02-08T03:58:20.000Z",
          "Titre": "I ordered a safe from safe vault which…",
          "Contenu": "I ordered a safe from safe vault which gets it from you guys paid top dollar for the wifi unit only to receive the low end unit. I contact them and ask to overnight with no response first time buying and very unhappy the customer support is horrible I dont even know if I even still want this safe should have to deal with this especially paying the price we paying."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "bob",
          "Nb_Reviews": 1,
          "Date": "2019-10-21T23:52:18.000Z",
          "Titre": "the 20i safe has never saved…",
          "Contenu": "the 20i safe has never saved fingerprints. after it sits for week, i go back and have to re`program again. disgusting. now the safe does nothing. no lights on keypad, checked battery and its fine. put on charge for 2 days now and never reaches full charge. only way to use safe now is with key. dont waste money on this safe. tried contacting on website and you cant enter nowhere."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Ingle",
          "Nb_Reviews": 1,
          "Date": "2019-04-11T01:03:32.000Z",
          "Titre": "Finger print scanner dosnt work",
          "Contenu": "Finger print scanner dosnt work. Have used every finger and thumb. Seems to accept my print as the two administrative prints (goes through the five programming sequences) but then the scanner won’t work to open the safe or allow me to program any additional prints since it won’t accept my programed fingers. Seems well built and holds my HK 40 cal nicely but pretty disappointed in the scanner."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christopher McDonell",
          "Nb_Reviews": 3,
          "Date": "2019-06-11T03:46:39.000Z",
          "Titre": "Flaky fingerprint sensor!",
          "Contenu": "When I saw the add by Colion Nior in my Facebook feed I made a snap decision to buy it. shipping was superfast and it did all the neat stuff as advertised.  The fingerprint reader seemed a bit slow to open the safe and then a few weeks later, stopped working completely. Doesn't light up at all, red or green. Keypad, key, and phone app all still work but I am bummed out. I haven't called tec support yet as I not yet up for that wonderful experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 2,
          "Date": "2018-08-23T23:42:44.000Z",
          "Titre": "battery life is very short",
          "Contenu": "I just bought this upgraded battery. I charged it for 36 hrs to make sure that it was completely charged. In less than 3 weeks it is nearly dead. I love the vaultek safe. But the batteries are no good. This is the second time I’ve replaced the battery. Vaultek was very good about sending me a quick replacement for the original free of charge. But it was the same result. It just doesn’t hold up."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Marcel",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T23:10:08.000Z",
          "Titre": "The unit is solid",
          "Contenu": "The unit is solid, BUT the finger printing software is less than desirable.  I had to resort to using / leaving the mechanical key to confidently open the unit."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Msetiawan",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T17:00:38.000Z",
          "Titre": "Questionable Reliability",
          "Contenu": "The product has great design and feature, however, not sure about reliability. My Smart Station died after only about 6 months. Bought it in May of this year and it won't turn on at all in at the end of November. Not sure what happened but had complete power failure."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T20:55:02.000Z",
          "Titre": "I have 3 RS800i in 3 differnt homes…",
          "Contenu": "I have 3 RS800i in 3 differnt homes along with a multitude of other Vaultek safes....so I love the product but I cant get the latest RS800 to connect to the internet in the new home even though other Vaultek safes in that same home and location will and I havent had time to call vaultek :("
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Damien",
          "Nb_Reviews": 1,
          "Date": "2022-12-24T16:54:06.000Z",
          "Titre": "Delayed delivery Again",
          "Contenu": "Again, fed ex delivery was delayed. My package was on a truck for days with no delivery attempts. Vaultek should offer more delivery options with other carriers such as UPS. Giving us only one method of delivery makes vaultek responsible for delays as customers have no choice but only trusts delivery will be on time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jorge",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T18:03:16.000Z",
          "Titre": "I woke up early in the morning to…",
          "Contenu": "I woke up early in the morning to secure a spot and I did. Received it rather quick very nice looking unit unfortunately the most important part of the safe does not work which is the sliding tray it does not fully eject and that means i cant get my weapon out properly i have to angle it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T21:21:38.000Z",
          "Titre": "Still waiting to receive my purchase…",
          "Contenu": "Your website listed a product “in-stock” and therefore I purchased it. Several days later, I received an email stating the safe would ship much later than anticipated due to a “shipping date error.” Had I known the actual shipping/stock status I would have waited to purchase, as I could have used the money for other expenses. And, I then receive an email to review my purchase when it hasn’t even shipped.  I’m sure the safe is a good product, but very disappointing purchasing experience."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "DB",
          "Nb_Reviews": 1,
          "Date": "2023-01-13T17:36:14.000Z",
          "Titre": "Disappointed",
          "Contenu": "The case is not deep enough to use the tray with a compact gun. The biometrics did not work on my safe when setting up the case. I guess I will just use the keyboard to access the case. Too much of a hassle to send back. The other products I purchased in the past worked fine."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "TL",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T17:43:11.000Z",
          "Titre": "I never heard about a delay in…",
          "Contenu": "I never heard about a delay in processing - had to email to find out it still won't ship for another 2 weeks and will miss the birthday gift timeline we had planned. That should be stated somewhere when purchasing. UPDATE: Talked with tech support and they are resolving the issue quickly - much appreciated."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jesse",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T17:28:21.000Z",
          "Titre": "Very Disappointed",
          "Contenu": "For the price of the unit I am very disappointed. The keypad functionality is poor, multiple attempts to enter the biometrics and the unit fails to recognize my fingerprint the majority of the time. The optional Bluetooth release button does not function more than half the time and is within 3ft of the unit. If I could I would get my money back. The wireless charging, light in the safe compartment, and the charging ports all function as they should. These are the only reason I did not leave a 1 star review."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T17:20:07.000Z",
          "Titre": "Add-on handle?  Really?",
          "Contenu": "A simple piece of small plastic handle had to not only be bought separately but shipped additionally?  Really?Makes for an awkward gift wrap when I’m giving this as a gift to a client.Invest in repackaging, and for the already expensive price, include it!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dissatisfied Consumer",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T18:40:56.000Z",
          "Titre": "Cable can easily be cut with bolt…",
          "Contenu": "Cable can easily be cut with bolt cutters.  To many steps to open non biometric models.  Not enough color options for biometric version.  Overall, it's a below average product that's disappointing. I purchased six of these vaults this month - 3 via the company's website, 1 from Amazon and 2 via Costco Next... avoid Amazon at all costs because it arrived and was clearly used. Avoid Costco because they only sell limited versions and colors and none of the biometric models.  Ultimately, I will keep 4 of them -- returned the one that arrived used and one from Costco --  but hope for improvements for future versions and that the company will address these issues to make it a great product.  Good concept though."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Phillip Jordan",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T02:08:46.000Z",
          "Titre": "Charger Won't Stay Connected",
          "Contenu": "I've had this safe for about 3 years and overall it is a good, solid, gun safe. However, for the last 3 months I've been having issues with the power and being able to open with biometrics or keypad. I discovered the charging cable won't stay connected to the charging port unless you manipulate it by hand. Even then, it is very touchy. It's like the charging port is damaged somehow. I tried 3 different cables just to make sure that isn't the issue. I now have a safe that I can only open using the physical key. It's out of warranty, so I have a $270 brick."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "LR",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T13:17:27.000Z",
          "Titre": "The biometric system is very poor",
          "Contenu": "The biometric system is very poor. The companies solution is to have you enter the same fingerprint under multiple users to allow for the slightest variances to pick up your print. I have the same fingerprint under five users and still can’t get into my safe without the code. Both models that I own have the same problem. If you need quick access/entry this is not the safe for you."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T18:17:28.000Z",
          "Titre": "Website malfunction",
          "Contenu": "I purchased a safe via Vaultek’s website on Feb 15. After hours of trying, the website continued to crash or freeze up, I was able to purchase and received a confirmation. A week later I called to find out the status of my order and after 15 minutes was told there was a glitch on that day and they didn’t have enough quantity to fulfill the orders and I wouldn’t be receiving my safe till the next shipment arrived, nearly a month later. Supposedly a email was sent explaining what happened but I never received it. Finally got a email 10 days later explaining the situation and offering 5% discount for my wait. Terrible experience and poor customer service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T16:03:38.000Z",
          "Titre": "Your ordering system",
          "Contenu": "Your ordering system. Received emails twice on inventory coming available at specific time/date only to try the first time and never got through. The second time inventory became available at specific/time-date I was kicked out multiple times. Finally got into website and it said I could order 2 safes which I did. Put in CC INFO PLUS ALL SHIPPING INFO…. only to find out days later that I didn’t get the product because you didn’t have the inventory you were selling. I have since received emails that best case I will potentially receive product in May 2023 “but still don’t know) I have tried to order this product since last Fall for gifts, been put on email notifications mutiple times. I am a return customer, but pretty frustrated with the experiences of trying to get these 2 safes."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Daniela",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T20:53:59.000Z",
          "Titre": "Customer service doesn't reply",
          "Contenu": "I spent $900 on 3 products and I have tried to email customer service 2 times and no one ever replies. I'm tired of sending emails, it shouldn't be this difficult to get a hold of someone...."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ANNURAG",
          "Nb_Reviews": 2,
          "Date": "2023-04-09T18:54:38.000Z",
          "Titre": "1> POOR",
          "Contenu": "1> POOR. The instructions on the overall assembly are very poor.2> Even though I'm a professional network engineer, I am unable to set up wireless connectivity. It is very frustrating.3> There is NO listing of the customer support contact number.4> Considering the cost of the product and the additional shipping cost of $100, we as a consumer expect better quality of the product & after sale service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mario",
          "Nb_Reviews": 1,
          "Date": "2023-03-18T09:56:02.000Z",
          "Titre": "After being the victim of the first…",
          "Contenu": "After being the victim of the first website crash, I contacted support to ask if steps were being taken to prevent a similar occurrence. I was given assurances that steps were being taken and new processes and equipment put in place to handle the increased traffic to the website during the special period for those of us who requested to be notified when the product became available again. At least this time I was able to complete the purchase process. Or so I thought, received an email that they somehow sold more units than they had. Not sure how that’s possible. I was then given and option of waiting, taking the product but in a different color than I had purchased or cancelling my order. I chose the different color unit but received no confirmation from Vaultek that they received my email. Had to call to confirm they received it. No idea when I will see my order but I’m praying it’s as good as I’ve heard given the amount of problems getti NB it has been."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael Vergara",
          "Nb_Reviews": 1,
          "Date": "2023-03-18T18:15:13.000Z",
          "Titre": "Vaultek 10 series not reliable",
          "Contenu": "I bought the Vaultek 10 series Aug 2022 and had issues with  opening the safe using my PIN. I had to reset my pin a few times in order to fixed the issue. Not a reliable safe if you are in emergency situation and need to retrieve your gun. I would not recommend."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeffrey",
          "Nb_Reviews": 1,
          "Date": "2023-05-14T19:37:08.000Z",
          "Titre": "Shipping delay a disappointment",
          "Contenu": "After placing my order and having my account charged I was informed that due to an internal error there would be a shipping delay of 3 1/3 weeks before the item would be available. Knowing this at the time of purchase would have been fine, finding it out afterwards was a disappointment."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jonathan",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T19:48:31.000Z",
          "Titre": "My pistol safe opened in the middle of…",
          "Contenu": "My pistol safe opened in the middle of night while i was sleeping and it said it was from a key entry. There was no else in the house and I'm the only with the key. Also the clock/ display dims for some reason"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Oscar",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T07:07:03.000Z",
          "Titre": "Nothing Is wrong with the item but the…",
          "Contenu": "Nothing Is wrong with the item but the hype and build up of this product was a let down! Packaging was nice. Color was nice but space inside very tight. I can't even fit the tray because my weapon has a magwell and the tray doesn't even work."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Justin",
          "Nb_Reviews": 1,
          "Date": "2023-04-22T16:32:30.000Z",
          "Titre": "Barikade arrived damaged",
          "Contenu": "Barikade arrived (3/27) in an unusable state. Customer service (3/28) was kind and helpful, and offered a replacement. However it has been about a week and a half maybe two and it has not arrived, nor have I received tracking info.  Will call back soon to confirm. Not the end of the world, but I’m disappointed I have to go through all of this, just to get a product that works.Update:(4/8 I think) customer service was again very kind and helpful, and when notified the shipment hadn’t gone out, it was shipped the next day. However, they mailed out an entirely different product. Upon contacting customer service again (4/13), I learned this was an intentional effort to send me an upgrade. The problem is that the upgrade is a larger safe, which doesn’t suit my needs. Customer service was once again kind and helpful, offering for me to keep the product, and sell me a new Barikade for 30% off. I thought that was a good deal, and I’ve taken it. Hopefully, the new Barikade arrives with no further issue."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alexander",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T21:53:17.000Z",
          "Titre": "Let’s start at the beginning",
          "Contenu": "Let’s start at the beginning. Well safe I really wanted was listed on we sight however none in stock. That’s cool no big deal. So ordered a different life pod 2.0. Wait a week and get the wrong safe. Had to work hard to find customer service. After finally finding it waited another week to get safe. However my fault I didn’t look inside the box to make sure I had all the pieces. I sent the other safe back un opened and then realized the safe I got did not come with the organizer like described. The safe works like advertised but the company does not seem to be running that well. I guess my second VAULTEK safe with be my last."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 2,
          "Date": "2023-08-11T21:44:52.000Z",
          "Titre": "Just purchased the 7th unit,LifePod X",
          "Contenu": "Just purchased the 7th unit,LifePod X, Sent 2 Emails to you Folks about the problem.. NO ANSWER FROM THEM and could not find a Telephone number to call you Folks.. All the rest of the units work GREAT.. So if you get this message, please call me :  302-539-3233..Thank You"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 3,
          "Date": "2023-03-18T07:24:01.000Z",
          "Titre": "RS800i woes",
          "Contenu": "This rating is for our RS800i. We’ve had it exactly one week as of 3/16/23. Took a week to arrive from order date. Safe arrived a day after the Plus addition accessories even though they shipped together, got separated in transit, no big deal there. Aesthetically appealing, great storage, great accessories, Biometrics are fine and the safe is secure enough for the PewPews. The Wi-FI…the damn Wi-Fi. Connected just fine, no issues. Good for about a day. I bought a new router thinking that may be the problem, no luck. Ordered a new modem from Xfinity that arrived today, still no luck. I can connect to the safe just fine. The second the screen goes dark, Wi-Fi disconnects. I’ve moved the router and modem closer. I’ve moved the safe 3 times to avoid walls interfering with the signal with no joy. A little frustrating to say the least. For a $2,300+ safe, I expect the technology to work. If I could’ve bought this safe locally I’d probably return it (would’ve saved a pretty penny on shipping too). I’ll deal, but it’s disappointing. I also ordered 2 LifePod 2.0 w/ Biometric safes at the same time, and they’re fantastic. The RS series may need a few tweaks."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James Flint",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T22:51:04.000Z",
          "Titre": "Like all products in the LifePod series…it's unusable",
          "Contenu": "Like all products in the LifePod series, the LifePod 2.0 is just a fraction small in all dimensions. I bought two of the Colion Noir version with the leather organizer. The EDC tray is worthless if your gun is more than 1\" wide. My P365 fits fine by itself. Put a light on it, and it's too wide. I must bend the EDC tray over the light to shut it. My P320? Not with the EDC tray. Don't put small items in the mesh pocket, unless you enjoy putting them back in after toting it around for 30 seconds. This design failure should be fixed by putting a zipper on it and making the EDC tray about 1/4\" less deep. Then you probably have a usable product that fetches 4 or 5 stars."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mitch",
          "Nb_Reviews": 4,
          "Date": "2023-06-22T21:57:15.000Z",
          "Titre": "Great Experience, So So Product",
          "Contenu": "Updated 6/22/23: Apparently the quick reply that someone from their \"5 Star Review Team\" would be reaching out soon works about as well as the product does... It's been a week since they replied and crickets!!   Updated 6/13/23:  Now that I've used this safe for around a month, I wanted to update.  I'm very disappointed!!  The fingerprint sensor SUCKS!  I would hate to think I had an intruder and need to rely on this.  I've set my finger print multiple multiple times (not a typo) and the best results I've had was being able to open it after 4 attempts! (and it's usually 8-10).  I use my fingerprint on an iPad and it works perfectly.  Now on to the wireless charging... I have an iPhone 13 Pro Max and it has to be just perfect in order to charge.  For a $500 safe... it should work much better!!The website, ease of purchase, and shipping updates were fantastic. For a suggestion... I would make the clock have an alarm clock feature and it's already Bluetooth, why not have a Bluetooth speaker built in!  Not only would it add functionality, but it would also disguise the unit better."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "VA",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T20:44:56.000Z",
          "Titre": "The biometric scanner on the safe does…",
          "Contenu": "The biometric scanner on the safe does not work well.  Also your phone has to be place just right to charge you phone so I done use it.  I have multiple VAULTEK products and I am very disappointed with this one."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 2,
          "Date": "2022-12-27T16:57:00.000Z",
          "Titre": "SR20i that I received is thin sheet…",
          "Contenu": "The SR20i that I received is thin sheet metal box. Don't trust it, other than to keep the kids out of it.  I don't think it qualifies as a gun storage box."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dash",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T14:09:11.000Z",
          "Titre": "The finger print access was working…",
          "Contenu": "The finger print access was working great the first day but the very next day didn’t work, tried placing finger in different positions about 40 times still nothing"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Emanuel",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T19:39:22.000Z",
          "Titre": "Very poor fingerprint reader"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "SEAN",
          "Nb_Reviews": 1,
          "Date": "2022-11-12T03:41:25.000Z",
          "Titre": "The fingerprint reader is a pile of $ h…",
          "Contenu": "The fingerprint reader is a pile of $ h 1 t Works okay for me after scanning the same finger twice which equals 10 scans.  Junk.  My wife. We tried 4 slots or 20 total scans and it only opened once the. Never again.  Guess she’ll need to remember a number or find a key."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2023-04-18T14:56:06.000Z",
          "Titre": "The safe itself is awesome but using…",
          "Contenu": "The safe itself is awesome but using the Wi-Fi option does not work with a darn"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ALdo  Arpaia",
          "Nb_Reviews": 2,
          "Date": "2023-09-02T19:06:33.000Z",
          "Titre": "Batteries simply don’t last",
          "Contenu": "Batteries simply don’t last They should have a mid size vault that can handle 12 to more hand guns…but that’s me."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dusty",
          "Nb_Reviews": 1,
          "Date": "2023-02-02T20:37:49.000Z",
          "Titre": "Safes key pad and biometric worked for…",
          "Contenu": "Safes key pad and biometric worked for a few house now will not light up at all. Must use key to open.  I’m planning on a return as soon as I get back in town."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Will",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T16:08:36.000Z",
          "Titre": "Disappointed",
          "Contenu": "What is the point of having a clock next to your bed without an alarm.  Don’t go and say you can use your phone so people don’t like to do that. It would’ve been very simple to add that feature."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gerard Marra",
          "Nb_Reviews": 2,
          "Date": "2022-10-08T16:47:14.000Z",
          "Titre": "Boxes smashed in transit. Refurbished/used",
          "Contenu": "The package came in original boxes packed in a soft envelope, the boxes were crushed and not reusable. Care should have been taken during delivery. I was going to give them as gifts but can't as they look like second hand items not reconditioned."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lynn Reynolds",
          "Nb_Reviews": 3,
          "Date": "2023-05-29T05:14:37.000Z",
          "Titre": "I don't like the design and couldn't…",
          "Contenu": "I don't like the design and couldn't get the finger print to work"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nate",
          "Nb_Reviews": 1,
          "Date": "2022-12-10T04:51:02.000Z",
          "Titre": "Print reader is inconsistent at best",
          "Contenu": "Print reader is inconsistent at best.  I would never rely on it for access."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Matthew McLelland",
          "Nb_Reviews": 7,
          "Date": "2022-11-16T04:28:35.000Z",
          "Titre": "Better than most, lots of room for improvement.  Expensive.  Customer service not 45 star",
          "Contenu": "First of all, I have spent a ton of money with Vaultek over the last 30 days - an RS800, RS200, MX, and a Slider Series - including a few hundred dollars in extra accessories - a total of over $4500.  So I think I'm pretty qualified to have an opinion.  My Amazon experience was terrible - 2 of the 3 products showed up / 1 was a misshipment and took Amazon 40 days to resolve / refund.  When I ordered the RS800 there were FedEx issues (not Vaultek's issue) and their support wasn't extremely helpful in tracking it down.  Eventually it showed up.Bottom line - I think this is a good product and in some ways better than competing products.  But I have a list of constructive criticism / feedback that is impossible to share with Vaultek as they don't provide email contact addresses or ways to solicit feedback - other than this review.  I did not want to leave a 2 star review as I would have rather provided detailed feedback / suggestions in a more anonymous way.  Bottom line, their mobile app \"strategy\" is ridiculous as I have to have 3 different apps to manage / monitor 4 different safes.  The fingerprint readers are low quality / don't work very well, and many of the accessories don't work as well as designed.  The upside is I still think this is a better product than alot of what I've seen.  It seems very overpriced for a non-fireproof safe.  The tech is basic and seems non-upgradable.  I've got more comments but hopefully this gets someone's attention.  I would probably buy another RS800 but I just don't think it's worth what they are charging."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 2,
          "Date": "2023-01-17T18:01:59.000Z",
          "Titre": "I recieved 2 safes when I thought I…",
          "Contenu": "I recieved 2 safes when I thought I ordered 1. Can I send one back?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 2,
          "Date": "2022-03-31T20:43:47.000Z",
          "Titre": "Shipping is free at other distributors",
          "Contenu": "Just finally bought the RS800i plus and still waiting on it . Waited a long time to order since wasn’t available. I feel ripped off since I can get it for the same price at say Armadillo safes and get free shipping instead of over 225 dollars to ship. Wish I had seen it before I ordered from here they just got it back in stock as well. Other spots are veteran owned my fault I should have looked harder"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Consumer",
          "Nb_Reviews": 1,
          "Date": "2019-12-19T22:52:10.000Z",
          "Titre": "key needs upgraded",
          "Contenu": "I love almost everything about this safe. It is built very rugged and handles lots of abuse. It is not open to being attacked by drops or easy pry attacks. The software is robust and well protected. My only complaint is the keyway. Most of the safes have the same key which is very easy to pick with a low level of skill. I wish it had a more robust key such as an abloy. I cannot upgrade the lock mechanism due to it being in a welded area."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "WILLIAM",
          "Nb_Reviews": 4,
          "Date": "2021-06-15T13:47:57.000Z",
          "Titre": "Don’t Buy",
          "Contenu": "I secured it behind my front passenger seat. Now I can let my seat won’t go all the way back.  I’m going to have to figure something else. Also the safe operates smoothly but with that it rattles a lot when driving.I had to totally remove it from my car and just use it as a house safe at this point. Having trouble getting it to connect to the app. Very disappointed with this safe."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Baron Ross Hartell",
          "Nb_Reviews": 1,
          "Date": "2019-04-27T03:46:28.000Z",
          "Titre": "biometrics aren’t consistent enough",
          "Contenu": "Purchased this 4 months ago and am not particularly impressed. Biometrics might work 30% of the time, at best, which is very discouraging to think about a break-in scenario. Alarm is too sensitive to external bumps or vibrations. My phone playing music, while sitting on top, will set off the alarm. Lastly, for the money, this safe fills up very quickly. $550 did not go far in terms of space."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alan",
          "Nb_Reviews": 2,
          "Date": "2018-05-24T22:13:51.000Z",
          "Titre": "big disappointment",
          "Contenu": "I bought their premium model with fingerprint scanner, phone unlock, keyfob etc. The positive is that the safe is made solid and heavy for a handgun safe. The negative is that their fingerprint technology sucks. Doesnt work 99 percent of the time. Need to use keypad most times to access it. I would recommend them, just go with a cheaper model that is strictly keypad. The fingerprint is a waste and the keyfob is an unnecessary gizmo."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Too small",
          "Nb_Reviews": 1,
          "Date": "2022-09-27T15:11:10.000Z",
          "Titre": "I was not pleased with the dimensions…",
          "Contenu": "I was not pleased with the dimensions they did not line up with the guns the website said the safe could hold."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Eddie Mendoza",
          "Nb_Reviews": 1,
          "Date": "2020-04-30T00:15:47.000Z",
          "Titre": "Ive only had the bag for maybe 2 months…",
          "Contenu": "Ive only had the bag for maybe 2 months and the handle ontop ripped. I don't hold it by the handle very often either,  so i was surprised when it ripped. The bag over all is nice, but i wish i could get it replaced. For how much the bag was it should be stitched better."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2018-05-24T22:15:59.000Z",
          "Titre": "Had higher expectations for the price",
          "Contenu": "Had higher expectations for the price. The light does not stay on long enough.  The finger print reader is horribly unreliable.  If you’re betting your life on it working you will lose that bet.  I expected a much stronger wall thickness and locking mechanism. I was disappointed on both fronts.  An amateur thief could pop this safe open with common burgurlary tools. It will do for a night stand box to lock up while you’re home but will not use for primary security.  For the price I expected a much more robust safe."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rob Lieske",
          "Nb_Reviews": 1,
          "Date": "2018-12-11T14:03:35.000Z",
          "Titre": "I had high hopes for this safe",
          "Contenu": "I had high hopes for this safe. It was replacing a Gunvault I have had for years. The overall concept is great except for one thing...it is too SMALL! Standard sized guns do not fit. They were short by about a 1/4\". Come on vaultek only a 1/4\" and my 1911 would have fit in it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Russell",
          "Nb_Reviews": 1,
          "Date": "2018-05-24T22:14:31.000Z",
          "Titre": "Just doesn't work....",
          "Contenu": "I loved this safe at first but I've had it for about a year and the finger print reader has gotten worse at unlocking in a timely manner. It takes 2 to 3 try before it opens and in a emergency I would not be able to rely on it...Sad it had so much going for it for a while."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Deb",
          "Nb_Reviews": 1,
          "Date": "2019-01-02T18:28:13.000Z",
          "Titre": "Ordered safe for Christmas present (14…",
          "Contenu": "Ordered safe for Christmas present (14 days prior to Christmas) and because Vaultek sent as parcel package via USPS it did not arrive until December 26. I would think they could send via a more reliable service especially since they were promoting purchase for Christmas."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Cody",
          "Nb_Reviews": 1,
          "Date": "2018-12-29T04:23:35.000Z",
          "Titre": "Battery sucks.. customer service no help",
          "Contenu": "It is a great safe but the battery sucks. I purchased the VTI PRO in camo, set it up with a full charge, it died in 11 days. Fully charged again with provided equipment again and the charge only lasted 15 days. For an almost $400 safe I would expect the battery to last what they claim at about 3 months. Very dissatisfied, already contacted customer service and the conclusion was to not use the smart key because it drains the battery?!!!! What!!?? Don’t use the equipment that comes with the almost $400 safe because it drains the battery?!?!?! You are out of your mind!! Make the battery last longer, give a better battery, or provide the info that it will drain the battery if you use the provided equipment."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Marc",
          "Nb_Reviews": 2,
          "Date": "2019-01-09T00:20:03.000Z",
          "Titre": "Stick to the non-bio version",
          "Contenu": "The biometric scanner only works if your finger goes in exactly how you did when programming. Just a tad off, and you are playing till the finger. Don’t buy the Bio. Keypad is fine."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joshua S",
          "Nb_Reviews": 3,
          "Date": "2022-12-04T19:04:06.000Z",
          "Titre": "Honestly not really worth the money.",
          "Contenu": "The smart safe is cool but the mag charger doesn’t work, case , no case , flipped directions doesn’t matter it will be sitting there for like 2 minutes then start beeping and not charging. It’s also a bedside clock with no alarm clock? Doesn’t make much sense to me but whatever.Other than that, holds stuff and the slide works great and tells the time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2022-12-04T02:30:49.000Z",
          "Titre": "RS800i",
          "Contenu": "The production descriptions are pictures are deceptive, to be more specific, when you utlize the shelves it makes it impossible to run an AR mount on the door. The door will not close and the shelving options are lacking. Non-existing 1/2 shelves for the \"top of the line RS800i\" makes for awkward pistol configurations. It would be nice to have a 1/2 shelf (or smaller) to run single pistol racks from top to bottom along one side and allow AR mounts. I do own multiple Vaultek safes but this will be my last if i keep it all."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gary Csaniz",
          "Nb_Reviews": 1,
          "Date": "2019-04-11T12:11:43.000Z",
          "Titre": "Poor display for price...",
          "Contenu": "The battery displays different percentages since day 1. Charged it fully followed instructions but will show 40% then 90% seconds after each other. Not happy for the price I paid."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jon L Roberts",
          "Nb_Reviews": 1,
          "Date": "2021-11-30T19:37:54.000Z",
          "Titre": "Had mine for about a year",
          "Contenu": "Had mine for about a year. Keypad broke and fingerprint reader works  about 1 in 10 times. So I have to leave it open with loaded gun in the closet"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ravi",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T17:40:30.000Z",
          "Titre": "Not as expected",
          "Contenu": "Not as expected. Looks like a simple vault."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jadd Zahrieh",
          "Nb_Reviews": 1,
          "Date": "2018-05-24T22:12:27.000Z",
          "Titre": "Battery dies every 2 days .",
          "Contenu": "Battery dies every 2 days .. on the screen battery life is always 100% , very unsatisfied. I paid 525$ for a product that doesn’t work"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Billy O'Dell",
          "Nb_Reviews": 2,
          "Date": "2021-01-28T22:16:05.000Z",
          "Titre": "Disappointed Profoundly.  Can't trust the biometric scanner.",
          "Contenu": "So, it doesn't fit in my Mitsubishi Endeavor with the optional extra mounting kit.  Okay, these things happen, the safe still seems secure enough to discourage casual thieves, and it's still easy access with the somewhat ridiculous mounting rig I had to set up - however, I asked a friend to try to get in - I didn't say to use a print or type a code... They touched the print scanner *accidentally* while touching buttons for the code and the safe slid open.  The reason I chose this model was that I (erroneously, naively perhaps) thought the print scanner was secure and I could get to the gun if I needed to while sitting in the car - I have a few other vaultek safes, and I turned on dual authentication immediately after seeing the safe just open for this random print.  Since it doesn't keep the gun secure to my satisfaction with only the print used to open it (because if you ever need to get it quickly you may not have the opportunity to blindly type a 6-8 digit code using only 5 different possible numbers)... I'm disappointed.  No more Vaultek products for me."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T17:43:45.000Z",
          "Titre": "I bought the RS800i from Scheels in…",
          "Contenu": "Update 2023. I will leave my stars because of the inordinate amount of time I spent to fix this issue.  My new safe works correctly and is what I hoped it would be. But customer service made this an exceptionally painful process to get what I ordered….a functioning safe. Update March 30th.  The safe is failing again and I am marking down my review from 5 stars to 1.  Customer service is responsive but they are not wanting to provide a permanent fix to my safe...only the cheapest way they can and kick the can down the road. They are sending another battery and charge cord.  Something is frying those but they really don't want to fix the safe properly.  At $1800 I cannot recommend the safe with all these problems. The safe has had an alarm go off in the middle of the night twice this week and several times since I bought it back in December.  I will update again once we see if the battery was the culprit all along or if they manage to time out my warranty with these ridiculous fixes.I bought the RS800i from Scheels in Colorado Springs.  It is perfect for what I need and I love the text updates when the safe is opened or moved as well as the biometrics.  I had an issue with low power mode toggling and sending multiple texts and setting off the alarm.  I contacted customer support and they always answered right away.  They diagnosed the power cable as the culprit (I leave it plugged in all the time) and they sent me a new one right away.  Put the new power cable on and it works perfect.  In this day and age, customer support is lacking with many companies.  Vaultek is on the ball and I highly recommend their products.  I also own a pistol box and love it as well."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Keyamonte Pickings",
          "Nb_Reviews": 1,
          "Date": "2019-08-10T01:34:26.000Z",
          "Titre": "So I got the RS500i and it is a great…",
          "Contenu": "So I got the RS500i and it is a great safe. It looks great, easily customizable, and seems secure. I'm giving it two stars only because the technology is lacking for the price paid. What exactly is the point of Wifi? My other Vaultek safes using bluetooth allowed me to open the safe using the app. I cannot do this with the RS500i. Also why can I not set the light to stay on until either I close the safe or for more than like 20 seconds? And the notifications are crazy! I don't need a notification when \"I\" open or close the safe. How about a notification when a user other than the admin opens the safe? I know I opened the safe cause I just did it! Why can't we customize our alerts/notifications?  The app is preset taking away our choices.  And why doesn't the keypad and/or display light up when I come near it? I have to push a number button to get activity, then I get a tamper warning. These are all things you debated about in development meetings but chose to disregard. Amazingly, my complaints are along the same lines as others.  Anyway, this is a $1200 dollar safe but is not worth that price. Adding WiFi gives you the ability to charge more, but there was way more functionality using just bluetooth. Great, I can check my safe's status from afar but that's it.  Yeah, WiFi...woo hoo!!! And your video shows this awesome app on a desktop computer. Where is that? I can't find it in the app store? And i'm just guessing here, but I imagine there is no update ability on the safe even though there is WiFi? Just tossing that out there as a hmm???"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "C Frazier",
          "Nb_Reviews": 1,
          "Date": "2018-11-26T19:37:05.000Z",
          "Titre": "Units are OK but would not buy again…",
          "Contenu": "Units are OK but would not buy again without some changes.I really like the size and functionality of both the Slider series and the MX series safe and the safes were easy to program/setup. However, several issues make me regret buying them and will prevent me from buying any more or recommending the devices until upgrades are made and problems addressed.First, while the key fob and the push button devices work well, in our experience with both of these safes, the biometric sensors fail to recognize user fingerprints more than 75% of the time on the first attempt, despite calibrating and reprogramming the fingerprints numerous times. This is particularly problematic for the slider gun safe which is supposed to provide immediate access to the gun in a time of need. Second, despite configuring the devices multiple ways, the battery life for these units are horrible, even when we purchased the backup power packs and charged/used them according to the instructions. We have had the units just under a month and the power packs approximately 2 weeks and both units and battery packs have had to be charged twice because they went dead. All in all, I love the idea behind both of these devices, which is why we spent nearly $1000 on them in the last month; however, I would not recommend them to anyone, particularly at this price point, without the manufacturer addressing these issues because they defeat the purpose of having units you can quickly access if you can't get to the contents because the units are dead or they biometric sensors are not functioning properly."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Frank Yu",
          "Nb_Reviews": 1,
          "Date": "2018-11-14T06:54:52.000Z",
          "Titre": "Sent me a defective unit",
          "Contenu": "Sent me a defective unit.  Would not program a new code."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rafael",
          "Nb_Reviews": 1,
          "Date": "2023-04-08T02:49:24.000Z",
          "Titre": "wrong item sent."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stephen Merten",
          "Nb_Reviews": 1,
          "Date": "2020-09-14T21:02:07.000Z",
          "Titre": "Too many issues all around",
          "Contenu": "Too many issues all around. I ordered the MX series safe with Wifi and overall am generally satisfied with the safe. My only issue comes from the alarm feature. It is too quiet to be an effective alarm. It can only be heard if you are in the same room withing a few feet and at that point you already know what it happening with the safe. Defeats the purpose. Similarly, other security features like the manual unlock alarm only alarms for about 20 seconds before being quiet again. Excellent. If I catch the event 20 seconds after it happened we're good. My main issues comes from the accessories. I bought the Bio-metric Smart Lock and the Battery Pack. Bio-metric Smart Lock:I'm not really sure what the deal is with this thing. I had no issues setting it up and it reads fingerprints decently well. Sometimes take an attempt or two that I accredit to poor programming on my part. However, I have it mounted so that I can always keep it plugged in. But when the battery is fully charged and plugged in, the scanner does not work. It will show a green success light that my fingerprint is approved but won't open the safe. Maybe one in every 20 scans will open the safe. As soon as I unplug it, it works 100% of the time. I guess you can't keep it plugged in like the manual suggests. The Battery Pack:Actual trash. Claims it will add 3-4 Months of battery to your safe depending on the safe. How about 2 weeks.I charged the unit 100% and charge my safe 100%. Plugged the battery into the safe and 2 weeks later get a notification that my safe has entered low battery mode (when it get's unplugged). Sure enough the battery pack is dead. Recharged and plugged back in, got about 8 days this time.Summary: As long as you don't buy the life-pod, the safes seems to be of great quality and function. The accessories are mere gimmicks at this point. Unless I got \"lucky\" and got 2 dud accessories at the same time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Darran",
          "Nb_Reviews": 1,
          "Date": "2018-11-26T23:46:17.000Z",
          "Titre": "It's an OK safe",
          "Contenu": "It's an OK safe, over priced"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kevin Tinsley",
          "Nb_Reviews": 2,
          "Date": "2021-12-19T15:26:08.000Z",
          "Titre": "Went from 4 stars to 2 after owning for a while",
          "Contenu": "When I first got my RS 500 I would have given it 41/2 stars but now only 2. What bothers me may not matter to others. I ordered my vault from a local shop where I could pick it up and save shipping and then ordered some accessories from Vaultek. One of the accessories was a 2-pistol rack and shelf bundle. Comes with two of the 2-pistol modules that you can also put AR mags in. When I got my vault and put in the modules that came with it along with my extra ones I thought it was good except for one thing. My pistols did not fit down in the module way I thought and were a little wobbly. I was a bit bothered by this but figured they would not fall out so ok. One day I was moving things around a bit and somehow accidentally discovered that there is a little plastic “shelf” in the bottom of the module and if you lift out the foam and remove that shelf the pistols slide down in that foam perfectly! Would have been nice to know. But leave that shelf in for the ar mags. If that was anywhere in the manual I missed it. Well fast forward and I needed more pistol storage so I went to the Vaultek site and now they have 3-pistol modules! Great. Got a couple. Now here is where Vaultek loses their stars. Got the new modules and was moving things around when I realized, for the first time, that the pegboard that you attach the modules to (the big selling point and whole purpose of this vault) does not go all the way to the bottom. Which would be no big deal except it’s about 18” short and plenty of space to put another module or two. This space then is basically worthless except where you have your rifles. If you only had rifles and a couple pistols above them you would never know. Well for me this was a huge bummer because I had a module I would have like to put there but no place for it. Well I figured there was an easy solution and that is the fact that the 2-pistol and 3-pistol (and new 4-ar mag module) are identical except for the foam insert. So I would contact Vaultek to get a couple 3-pistol foam inserts to replace a couple of my 2-pistol ones and I could get enough to mitigate the loss of that bottom 18”. Customer service answered quickly to my inquiry about buying a couple foam inserts (don’t need more modules!) and, of course, don’t have them available. I know how manufacturers and suppliers work and Vaultek probably gets all this pre assembled from their supplier but they could easily order some separate foam inserts. But would rather sell you a $40 module than a $10 insert. And I didn’t ask but I’m pretty sure I could not get a longer pegboard which should already be in there."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael W.",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T22:23:02.000Z",
          "Titre": "I bought 2",
          "Contenu": "I bought 2, 1 with Biometrics, 1 without.  Securing your firearms is a responsibility all owners should practice.About the safes:  They are good-looking, but while the shell is hard, it's not metal.  I've also seen videos where the electronics and the physical aspects were defeated pretty quickly.  BUT in a home situation, these are adequate, and able to prevent young hands from reaching those firearms.  I don't regret the purchases!"
        },
        {
          "Note": 3,
          "Lieu": "CH",
          "Pseudo": "MrKuhle",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T02:12:38.000Z",
          "Titre": "SliderSeries",
          "Contenu": "Bought the SliderSeries. Pretty good Safe. Altought it doesn‘t quite fit the Walther PDP FS 4.5“. Also the Biometric Fingerprint System could be better. You don‘t have multiple positions for Fingerprint-Registration, so if you want to open the Safe you have to put your Finger in the exact Position you‘ve registrated it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rod",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T20:47:25.000Z",
          "Titre": "Smart Station Problems",
          "Contenu": "I am not happy with the way the safe is working ... it stops charging the phone after a set time vs until the phone is completely charged.  Also, most times when the safe is opened...the time on the clock goes away and I have to go back into settings to add it back.  I need to coordinate problems with Vaultek to get these things corrected or replace device."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Terry Cole",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T12:31:33.000Z",
          "Titre": "The sfe is well made",
          "Contenu": "The safe is well made, but the tray doesn't work well with the foam in it. There is either to much foam with the tray making it hard to close or not enough foam without the tray letting my  gun slide around."
        },
        {
          "Note": 3,
          "Lieu": "KW",
          "Pseudo": "Abdul A.",
          "Nb_Reviews": 2,
          "Date": "2023-12-03T11:14:13.000Z",
          "Titre": "wish the app can do more!",
          "Contenu": "i was hopping that the app would give me more control of the safe. it is limited to monitor and not manage settings."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "RReberJr",
          "Nb_Reviews": 5,
          "Date": "2023-11-18T07:53:47.000Z",
          "Titre": "This 20 Series Not As Good As My First",
          "Contenu": "Early this year I purchased a 20 Series (VE20) and a Lifepod (LVP10).  Quality of both was great.  Today I received another 20 Series (VS20i - Alpine White).  This safe is not so good.  The left side of the lid has an obvious area where the paint is chipped off (1/4” x 3/4”), and when unlocked the lid would not open by itself.  The one latch was bent and I needed to put a shim under the one side of the latch so it would clear the locking mechanism when opened.  A safe like this should never have left the plant.  I needed to use it otherwise I would have returned it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 2,
          "Date": "2023-11-26T21:55:56.000Z",
          "Titre": "Safe is just OK",
          "Contenu": "Safe is good but the fingerprint feature is simply not reliable enough. Often takes 2 or 3 attempts to open."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T23:44:19.000Z",
          "Titre": "Product arrived in good shape and…",
          "Contenu": "Product arrived in good shape and ontime...no issues there. The clock feature randomly turns off so you have to open the app to adjust setting to turn it back on. Also, you get this random beeping or alarm when the phone is charging. Not sure if it's a sensor or what but would love to know what the heck is causing it. Otherwise the drawer opens and secures your pistol and any other valuables as advertised."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Al",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T18:19:54.000Z",
          "Titre": "Sturdy and responsive box, but questionable cable",
          "Contenu": "The box itself feels very sturdy. The keypad is responsive to touch. My fully charged rechargeable AA battery doesn’t appear to last long before it needs to be replaced, which makes me wonder if the lockbox requires more energy to use than anticipated. The security cable seems too small and fine for properly tether the box in my truck - my fear is that it can easily be cut."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2023-01-02T18:45:04.000Z",
          "Titre": "The safe is great but",
          "Contenu": "The safe is great. The purchase was not so good. Purchased from Amazon thought I was getting RS800i safe. Recieved RS500i Vaultek safe when I spoke to Amazon the said I ordered RS800i safe. But the company that sent the safe said it was RS500i safe I ordered. Thought the whole thing was bull and kept the RS500i safe. The safe itself is very good no problems even ordered some accessories."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brett",
          "Nb_Reviews": 1,
          "Date": "2022-12-10T15:59:53.000Z",
          "Titre": "Good but not excellent considering the price.",
          "Contenu": "I could be missing something, but the door on my safe only open to 90 degrees.  With accessories and equipment hanging on the door it makes access to the items inside difficult.  They should make the door open 180 degrees or more.  I've also had issues getting my fingerprint (biometric) to work properly.  Vaultek customer service has been very active in helping me try to solve this problem."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Greg Powell",
          "Nb_Reviews": 5,
          "Date": "2023-01-06T22:55:09.000Z",
          "Titre": "You need two hands to open the air…",
          "Contenu": "You need two hands to open the air tight latches and even then they are finicky without a bunch of practice. Seems like overkill for such a small and \"travel friendly\" container. This product may have spread itself thin imo. Love my Slider but this model is not a good travel version of what the Slider provides in terms of quick stowing or access."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Billy PayCheck",
          "Nb_Reviews": 2,
          "Date": "2023-01-08T17:17:05.000Z",
          "Titre": "Good safe",
          "Contenu": "Good safe, lots of room, well thought out accessories for customizing the interior. Display is clear and remote communication between safe and cell phone is a cool novelty. Especially letting you know if someone is trying to access the safe. The only real drawback is the fingerprint reader is garbage. Never reads my finger correctly so I alwayss have to use the code to get in. As this was one of the main reasons for purchasing this is a big dissappointment."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2022-12-27T23:11:11.000Z",
          "Titre": "Too many apps",
          "Contenu": "The instructions for starting the set-up process were confusing as well as attaining the App for the iPhone.  There are way too many apps on the App Store for Vaultek and when I finally said heck with it and downloaded what I thought was the correct App I was able to walk through the setup process without instructions."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gabriel",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T21:01:30.000Z",
          "Titre": "Shipping was fast as always, but some issues",
          "Contenu": "Shipping was fast as always, quality of the products is great. Unfortunately some of the products I bought have an unreliable fingerprint reader (I own multiple products from them, and not all have the same issue). Also one of the boxes arrived damaged, but the product was intact inside. One other thing is that the external fingerprint reader that I bought not long ago it is not compatible with their last released product."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T02:52:52.000Z",
          "Titre": "FedEx delivered the safe a day late let…",
          "Contenu": "FedEx delivered the safe a day late let than they said. Safe seems nice and secure and  the lock picking lawyer says it’s better than most. Wish it wasn’t made in China though."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Will Dugan",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T22:53:57.000Z",
          "Titre": "Slider is Good not Great for the money",
          "Contenu": "Overall the Slider is a well designed product, but they stop at good versus being great! Design not completely thought through for home use, as all safes of this size should have a cable lock system. Most people do not want to screw into their nice furniture and it does not have ability to install on the posterior side of safe.They offer a Universal Mount(has a cable lock) that I bought for car but do not feel I should buy additional one for home. Engineers need to fully understand homeowners needs if they want to have the best safe available."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "gino",
          "Nb_Reviews": 1,
          "Date": "2022-12-23T15:46:37.000Z",
          "Titre": "Wireless charging isn’t the best.",
          "Contenu": "Overall I really like the smart station. The only disappointment with it is the wireless charger- which was a big selling point. I have three other wireless charges I use regularly. This is the only one that does not work with my phone’s case and is extremely finicky as to where I place the phone."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kyle",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T17:58:33.000Z",
          "Titre": "Pricey with Some Issues",
          "Contenu": "I don’t plan to return it, but it is lacking in a few areas. Mainly the fingerprint scanner. It’s not very reliable. In addition to the fingerprint scanner, the locking cable in the rear can sometimes prevent the drawer from closing all the way, the temp/humidity is wildly inaccurate, and the wireless phone charging can get a little finicky at times. If this was a couple hundred cheaper then this would be a great value based on what I received. But at this price point, I think it’s middle of the road at best and needs some work."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bogdan Tsios",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T19:01:37.000Z",
          "Titre": "Full size grip  guns with or without…",
          "Contenu": "Full size grip  guns with or without magwells can’t be used as advertised. Gun racks are useless Limited vertical clearance, 2 additional inches of height are needed. Who designed this product (Vaultek MX safe)?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rich K.",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T20:00:18.000Z",
          "Titre": "Nightmare programming but good device.",
          "Contenu": "The device itself is built well. The programming process is an absolute nightmare that needs to be corrected. Initial prints are a nightmare and follow ups are all confusing with the device and light sequences very confusing. I am a pilot that fly complex systems and I had trouble from.the start trying to program it. There needs to be a more intuitive system for setup. Doesn't have to be that confusing. The device is hit or miss on programming as well. It just doesn't play nice. Sorry guys I like the device but the programming needs to be redesigned."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paris",
          "Nb_Reviews": 1,
          "Date": "2022-12-11T15:00:35.000Z",
          "Titre": "Nice Compact Safe But…..",
          "Contenu": "The product and safe itself is very nice and constructed well. The only issue I found was the terrible shipping package. No padding, or protection at all. Just a plastic bag poorly wrapped around the product box. I reached out to Vaultek and expressed my concerns, and in a their response they stated the reason was due to cost alone. I understand that and all, but still find that unacceptable. I’d gladly pay a bit more to insure my purchase arrives damage free. But again: Very nice safe, and I’d recommend Vaultek to my family and friends."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T13:40:19.000Z",
          "Titre": "Wifi functionality does not work.",
          "Contenu": "Wifi functionality does not work.I tried calling support and was disconnecting during the process - no call back. During the process, they were trying to get me to reduce the security protocols on my router to get the safe to connect, which seems like a massive red flag."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Todd",
          "Nb_Reviews": 1,
          "Date": "2023-02-19T14:38:29.000Z",
          "Titre": "I purchased the Vaultek 2.0",
          "Contenu": "I purchased the Vaultek 2.0.  It's well made and will hopefully fit my needs.  However, after purchasing I learned how easy it was to defeat the locking mechanism and box.  After setting up the biometrics with my fingerprint I had issues opening the lock.  This was during a cold period in Colorado.  Not sure if the cold had something to do with the lock not recognizing my fingerprint."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2023-04-21T04:40:22.000Z",
          "Titre": "I originally tried ordering this safe…",
          "Contenu": "I originally tried ordering this safe on the website but the site kept locking up and I couldn’t complete my order. The item was out of stock immediately upon getting back in stock. Then I finally ordered the safe months later and the fingerprint pad doesn’t work more than a day. I’ve reset my print 5 times and none of them last. I hope I never need to get to my gun in an emergency."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 3,
          "Date": "2023-04-15T05:22:44.000Z",
          "Titre": "Nice design, hard to get the biometrics right",
          "Contenu": "I love the design of the safe, I like the wifi app, I like the idea of the biometric entry. The reason I say the idea of the biometric entry is that so far the biometric entry has been very finicky. I've reset the master fingerprints 3 times already and within a few days the biometric sensor won't give me access. My Mac with fingerprint sensing works every time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 6,
          "Date": "2023-11-10T19:36:41.000Z",
          "Titre": "I ordered this organizer but wasn’t…",
          "Contenu": "I ordered this organizer but wasn’t happy with it. It’s a good organizer, but I found the pockets very small for my needs. I won’t be using it in my safe. Maybe at my workbench."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 2,
          "Date": "2023-03-07T06:31:20.000Z",
          "Titre": "The fingerprint scanner is too…",
          "Contenu": "The fingerprint scanner is too temperamental. I think the user should have the option for the keypad to stay lit in the dark so it’s easy to find. The USB charging ports should be positioned and faced so the cords are not coming out vertically. The LED screen is not very aesthetically pleasing at this price point. It looks like a 1980s radio clock. Allow some color customizations. At this price point you can buy two iPads with touch screens. Please rethink your screen. The Bluetooth nano button should be rechargeable or offer a plug in. It eats batteries like crazy. Overall I’ll keep it but there’s many ways to make this better."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2022-12-22T20:14:25.000Z",
          "Titre": "The lifepod 2.0 isn't deep enough to…",
          "Contenu": "The lifepod 2.0 isn't deep enough to have both a handgun and the organizer tray installed. I bought it with the intention of using it to store a Glock 19 Gen 5. But, sadly, the tray will not fit with the handgun in the Lifepod 2.0."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Leonard Greski",
          "Nb_Reviews": 4,
          "Date": "2023-04-26T23:01:07.000Z",
          "Titre": "A positive experience with comments.",
          "Contenu": "1st the shipping box was torn up and pretty beat. I thought I was looking at the safe body, an inner box protected it very well. My biggest issues are I order the the wifi not knowing it won't work on a 5G network. Ya know must system in the modern world are 5G you must catch up. This was unknown to me and paid extra for something I can't use now. Construction is solid  the electronics are sluggish. Delayed. Bio metrics are slow as well. The actual opening when used is not the best however never used one before with Bio metrics."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dylan",
          "Nb_Reviews": 1,
          "Date": "2023-05-13T16:58:09.000Z",
          "Titre": "Haven’t received my product yet",
          "Contenu": "Haven’t received my product yet. Placed an order and it said in stock just to get an email saying that my order would ship in about a month.I’m hoping we’ll love the product when we get it but overall experience was subpar given the back order mistake on the website."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T02:24:56.000Z",
          "Titre": "The wrong safe was sent",
          "Contenu": "The wrong safe was sent, I contacted them and they sent a replacement.  They said a shipping label and a shipping bag would be with the replacement but there was no shipping bag so I waited a week until I got a delivery from Amazon before sending it back."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marcus",
          "Nb_Reviews": 2,
          "Date": "2023-04-17T01:03:09.000Z",
          "Titre": "If you’re gonna put that much into a…",
          "Contenu": "If you’re gonna put that much into a safe that potentially sits on your nightstand, an alarm clock addition to that would be suited.  I ordered this safe and it is nice and does have a lot of features, but I assumed that it came as an alarm clock as well."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "GM",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T02:32:23.000Z",
          "Titre": "Travel wells but lacks quick access.",
          "Contenu": "Delivery, customer service/satisfaction Vaultek Safe is great.  The product is good, but I found the Lifepod 2.0 good not great/expected.   The Lifepod 2.0 is great as far as a small (almost too small still) pelican like case.  It's like having a sleeve for your pc not a bag.  A major negative for me was the latches have to be clamped and the the lid has no spring in/to it.  Definitely, not a quick access storage option.  But absolutely a good travel option.  And I was also disappointed with the service discount at 5%."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kenny Rentas",
          "Nb_Reviews": 4,
          "Date": "2023-05-02T07:12:28.000Z",
          "Titre": "Great safe with room for improvement",
          "Contenu": "The safe is great! The fingerprint reading is superb. The design is neat and compact. The newer or bigger/heavier models were not available for weeks/months and I had to settle for the RS500i.However (RS500i):1. Incredibly dangerous to have it unsecured if you have inquisitive kids as it's very unstable and can topple over very easily. You are almost forced to have to buy a separate base to prevent it from falling over.If you have baseboard molding, securing it to the wall it's tricky. Not to mention that the only way to secure it onto the wall requires unscrewing several sets of tiny fragile screws that strip very very easily. You can screw it into the floor but not ideal for many homeowners.2. Could use more lightning and have options for the lighting to remain on for much longer. The light stays on for an insanely short amount of time. I would still buy it again because it's just an excellent option for confined spaces and the technology is great and reliable."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Christopher  Rodriguez",
          "Nb_Reviews": 2,
          "Date": "2023-09-27T23:23:12.000Z",
          "Titre": "Ok but still waiting",
          "Contenu": "Customer service was good dealing with my issue but haven't returned my full refund and been 2 weeks since I reached out to them . . ."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sherrie McCarty",
          "Nb_Reviews": 4,
          "Date": "2022-12-26T15:19:48.000Z",
          "Titre": "#1complaint-Made in China",
          "Contenu": "#1complaint-Made in ChinaThe safe is decent, as is the carry bag. #2 complaint is you can only store a micro under the accessories tray. If you have a larger hand gun it has to sit on top the accessory tray."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Raymond",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T14:33:18.000Z",
          "Titre": "Some concers",
          "Contenu": "If it misses your finger print read once it puts it self in tamper mode an then have to use the code so thats concerning"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Travis",
          "Nb_Reviews": 1,
          "Date": "2023-04-16T19:03:54.000Z",
          "Titre": "Nice safe but irritating wireless charging",
          "Contenu": "It's a nice safe with a lot of features, but I have two things I dislike. One is minor and one is irritating. The minor issues is you have to connect to your phone yo set the clock. I personally don't want my phone connected it should just be an option and not a must. I just disconnect it after so no bug deal. The irritating issue I have is the wireless charging. It's difficult finding the right spot to put your phone. You think you have it in the right place and everything says it's charging just to wake up and find your phone didn't charge. The wireless charging is such a hassle it makes it so I can't really recommend it to friends."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "BJJPinz",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T17:31:49.000Z",
          "Titre": "I love the idea of this safe.",
          "Contenu": "This may sound like a rant, but is a straight forward review. The wireless charger is an automatic star drop. It does not hold the phone in place and charges slow, It won’t charge AirPods with or without a case. Trying to put your phone on the wireless pad in the dark is tough. The second star knocked off is due to the fingerprint scanner. Programming is not the easiest which I’d let slide if it opened every time but it does not. Overall its a good safe but no longer my nightstand choice. Ill likely move it to the living room and look for something I feel more comfortable will open when I need it to.I will stick with Vaultek as they offer first responder and veteran discounts.The safe is built sturdy, the screen is meh. Might take a look at the 10 series."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Martin",
          "Nb_Reviews": 2,
          "Date": "2023-11-14T20:29:57.000Z",
          "Titre": "The biometric feature is unreliable",
          "Contenu": "The biometric feature is unreliable.  Other than that I am happy with it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Benjamin",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T18:00:45.000Z",
          "Titre": "Can’t use the tray and gun at the same time",
          "Contenu": "Overall the product looks good. I paid extra to get the card holder and tray as I want to use this for traveling. I’m disappointed that I can’t have the tray and Glock 19 in at the same time. Only one or the other. Lid will not close with both inside.  Kinda defeats the purpose of buying all the accessories."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "William Shoup",
          "Nb_Reviews": 2,
          "Date": "2022-12-23T18:33:50.000Z",
          "Titre": "The vaultech DS2i smart station is a…",
          "Contenu": "The vaultech DS2i smart station is a nice product other than a few issues I’ve had with it. Firstly the finger scanner is not great you have to usually scan a couple times for it to work, it’s quicker to type in code. Secondly the door doesn’t slide all the way out when ejected and tracks on the sides  are pretty loose side to side lots of play when fully open, could be an issue longer down the line. Lastly the wireless charger on top is temperamental. It works fine some days, then other days its intermittent charging station keeps going on and off. In conclusion I like the station and the look, but price point at 500$ and all these issues with it, to me is not worth the money. If I had to do it again I probably would have went in a different direction."
        },
        {
          "Note": 3,
          "Lieu": "SV",
          "Pseudo": "Ed Martinez",
          "Nb_Reviews": 3,
          "Date": "2023-04-25T20:01:31.000Z",
          "Titre": "Bought the wifi version and it doesn’t…",
          "Contenu": "Bought the wifi version and it doesn’t work using an eero 6 router. Fingerprint scanner is borderline unusable. I do like the safe in general though."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shaun",
          "Nb_Reviews": 1,
          "Date": "2023-08-06T08:49:12.000Z",
          "Titre": "Wifi options are great but there is a high cost that cones with compromises",
          "Contenu": "The RS800i has some of the most advanced features on the market. However, the features do not match the high cost. I would expect stronger mounting options, thicker steel for the shell(the great door feels like its on a lunchbox), and Internal USB power for things like keeping tac lights fully charged for my Olight. (magnetic charger would be PERFECT... if I had USB power in there. I just dont want to hack my internals)The lack of competition in the WiFi-connected space is what pushed my purchase, coupled with good biometrics. The configurable internal nature is pretty nice, but again, not enough for the price. I am disappointed that the low-power mode when on battery basically stops communicating after the battery alert. (Mine was on battery for a week and the data hadnt changed) Hopefully the safe will at least alert to tamper/opening on battery.Im also disappointed that I have to pay an extra few hundred to get better storage like the extra shelf, etc. - why am I getting the biggest safe to have one shelf?Having an app to see temp/humidity/tamper and opening details is great, and honestly the industry needs to catch up. Somehow Vaultek hasnt made this standard for all its devices including the insanely expensive Smart clock model - its as though they dont understand what sets them apart.If you need to know the status of your vault at all times and want pings on your phone, the Vaultek RS series for your rifle/shotgun is your only real option, but be prepared to spend."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "PAUL",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T18:49:20.000Z",
          "Titre": "DS2i Vaultek Safe Is Too Small ... Here's Why",
          "Contenu": "Overall, I like the DS2i safe as it meets its primary design purpose in my eyes, which is to have a hidden (AKA disguised) safe which is also easily accessible and out in the open.  However, I am limited to what I can store in the safe, specifically the following common handguns do not allow the drawer to close: (a) 1911 with ambidextrous safety levers, (b) SIG P320 with a slightly flared (after-market) mag well (c), a .44 magnum revolver and (d) an 8-shot .357 magnum revolver.  If the safe was just 1/4\" greater in thickness, I feel all my handguns would be accommodated.  Additionally, almost any of my handguns, except for the likes of a SIG P365, will greatly slow the opening of the drawer such that it does not fully open.  Even with my SIG P365, the drawer just does not open fully or robustly.  My sincere message to Vaultek is for this safe to be redesigned like this: (1) increase the depth by at least 1/4\" and (2) use a more powerful drawer opening mechanism.  I recognize that new design/issued products often go through an evolution process based on real-world consumer feedback; I wish I had waited a few years to buy this safe."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T22:40:18.000Z",
          "Titre": "The Ds2i is a nice safe overall",
          "Contenu": "The Ds2i is a nice safe overall. I like the screen is easy to read but does not light up my room when the lights are all out. It is a long safe and did have trouble making room on my night stand while also being able to read it, but I can't fault Vaultek as it does fit a 92FS and a mag with plenty of room. My biggest issue is the charging pad. It is a nice thought but there have been many times I have to re-center the phone because it will not charge or wake up to an almost dead phone. For almost $500 I would expect a better effort or to remove it completely. The nano was easy to set up and the biometrics and pin work fine."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Denver",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T21:03:39.000Z",
          "Titre": "Doesnt hardly fit full size pistols…",
          "Contenu": "Doesnt hardly fit full size pistols like it says it does. The foam inserts peel out of the pistol rack way too easily, the zippers are cheap. Don’t get me wrong, I love the case. It’s just not in any way worth $600. This case should be half that price. It’s unfortunate that it’s the only thing on the market that has the features it has. No other brand offers the same modularity, tether, and biometric features. It’s sad that I had to buy this. They don’t even include the battery. I would really love to give this case 1 star since they’ve emailed me 5 times in the last week to “remind me” to write a review. So here ya go.All in all, best case I own. Ridiculously overpriced. $329.99 would be a reasonable price for this case. And I’ll bet they can do that too and still make money."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jorge Alma",
          "Nb_Reviews": 2,
          "Date": "2023-04-13T19:33:41.000Z",
          "Titre": "Nice Safe by Vaultek DS2i",
          "Contenu": "Nice Safe. I got lucky and found one on the site. The DS2i arrived quickly and in good packaging.Pros: The safe looks great and is covert. The app lets you customize functionality i.e. fingerprints, volume and interior light. Has a charging pad for your phone, the door is spring-loaded and slides smoothly and the quality is good. The number pad only had four numbers on it and I believe that is good enough for quick access.Cons: The fingerprint sensor is like most sensors where you might need to try a couple of times for it to register your latent. Saving a few latent prints from each hand in case of emergency. The charger does not work well as it is difficult to get the phone centered on the charger.Overall: The safe is nice but not at $500 especially since the wireless phone charging pad doesn't work well. For quick access this safe is nice but I also bought it specifically because of the wireless phone charging feature built into the nightstand safe. I am thinking about returning it if Vaultek can't guarantee that they can fix the issue with my safe."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alejandro",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T23:07:05.000Z",
          "Titre": "I love the safe aspect of it but kinda…",
          "Contenu": "I love the safe aspect of it but kinda of upsetting it doesn’t have a actual alarm clock also the wireless charging is iffy and sometimes makes random beeps"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Troy",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T06:26:48.000Z",
          "Titre": "Close but not quite there",
          "Contenu": "I really like the customization. But my safe messed up a few times already and wouldn’t close correctly. It said “locked” but it was not locked. And my remote button does not open my safe when I want to. It’ll do it when I first hook it up then the next day it won’t work or it says it needs to be activated again. That was one of the main reasons for my purchase.."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sparky",
          "Nb_Reviews": 2,
          "Date": "2023-06-24T01:14:34.000Z",
          "Titre": "I'm having issues with opening the…",
          "Contenu": "I'm having issues with opening the door. It does not release most of time and I have to punch the top of the door with the heal of my hand as it tries to open to let it release. NOT GOOD! To have it not open immediately in an emergency and have to do the code repeatedly to open is scary."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T22:55:46.000Z",
          "Titre": "Overall Smart Safe 2.0 is decent, but should have more functionality and better components for the price.",
          "Contenu": "I’m amending my rating of the Smart Safe. I was struggling to figure out how to use the app (the app itself doesn’t explain how to set pin), but eventually figured it out. Still need to ding the safe for two reasons:1. You shouldn’t need to use their app to simply set the time. That’s a mistake. Also, the app is not straight forward and they need to make it clearer.2. The thermometer on my unit is off by 5 degrees.It’s a cool piece of tech but very expensive and should have fully onboard methods of setting time. Would be nice to include an alarm clock as well."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patrick",
          "Nb_Reviews": 2,
          "Date": "2023-04-27T17:15:44.000Z",
          "Titre": "The induction charger for the phone is squirrely",
          "Contenu": "The induction charger for the phone is touchy.  If not placed PERFECTLY, it will start beeping.  Sometimes it starts beeping much later (read as, while asleep)."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Richard  Avalos",
          "Nb_Reviews": 4,
          "Date": "2023-05-19T17:16:55.000Z",
          "Titre": "Think twice",
          "Contenu": "Overall, I like the safe. My one disappointment is the fact that I can't use it for the reason I purchased it. I have a Sig P320, and when I placed it in the safe, the case that comes with it wouldn't fit. I bought this version for that feature and I can't even use it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Peyton",
          "Nb_Reviews": 1,
          "Date": "2023-05-21T17:53:31.000Z",
          "Titre": "I still don’t have my safe and my…",
          "Contenu": "I still don’t have my safe and my humidor was delivered but without a bovida packet to season it. I’m sure the product is great. Customer service is neutral at best"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 3,
          "Date": "2023-04-12T14:39:57.000Z",
          "Titre": "The wireless phone charger on the top…",
          "Contenu": "The wireless phone charger on the top of the unit is draining my phone completely overnight. It is not functioning properly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bryon",
          "Nb_Reviews": 1,
          "Date": "2023-07-22T13:45:55.000Z",
          "Titre": "It is a nice safe",
          "Contenu": "It is a nice safe.  But the low battery alarm does not come on even when selected and a thump print stops working right away. And you cannot open it from the app."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marcelo",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T17:35:36.000Z",
          "Titre": "Well I’m not too picky but it was a…",
          "Contenu": "Well I’m not too picky but it was a bummer that the was a mix up in the ordering process cause there’s been a delay. But other than that it’s fine"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sparky",
          "Nb_Reviews": 2,
          "Date": "2023-07-01T02:26:08.000Z",
          "Titre": "The safe is giving me troubles opening",
          "Contenu": "The safe is giving me troubles opening. I put my code on and it makes the noise like it's going to open... and it dosent. I have to do it over and over many times and some times have to hit the door to make it open. NOT HAPPY! Don't get me wrong, it's a really nice safe but now has an annoining problem."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Fitch",
          "Nb_Reviews": 2,
          "Date": "2023-02-09T23:54:09.000Z",
          "Titre": "I was under the impression that my…",
          "Contenu": "I was under the impression that my Glock 20 10mm would fit with a smaller Sig Sauer 365. Problem is the tray does not work with the Glock. And the tray I was counting on for extra items and mags. Seems like a great product though."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "AJ",
          "Nb_Reviews": 1,
          "Date": "2023-09-17T22:52:33.000Z",
          "Titre": "Smaller than expected",
          "Contenu": "For the larger safe, I was disappointed that a full size pistol cannot fit with the additional plastic piece for accessories."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dusty B",
          "Nb_Reviews": 2,
          "Date": "2023-07-31T02:28:10.000Z",
          "Titre": "Amazing Safe will not fit Sig P226 x5",
          "Contenu": "Amazing Safe Unfortunately it doesn’t fit my gun,SIG P226 X5. Safety hits. Will not spring open with a heavy gun loaded with clips.I had to cut padding to get safe to close."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T15:44:11.000Z",
          "Titre": "I do not like the custom inserts for inside and top shelf, but overall worked out how I wanted it",
          "Contenu": "I do not like the custom inserts for inside. Seems like mag inserts should be on the left and gun inserts on the right for better draw. Had to remove top pull out shelf because there was not enough room for two handguns to fit in bottom inserts correctly without bumping into top shelf, 2 inches more clearance on safe would fix issue. Also when I still had the top shelf pull out drawer in, mags and guns slid around easily when opening and closing, should be padded to help prevent issue. Overall I got two handguns inside with 3 extra mags each, and a spot for two 10 round mags for mag fed shotgun, so it accomplished what I was hoping for"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "iiLONDONii",
          "Nb_Reviews": 1,
          "Date": "2023-03-12T20:03:30.000Z",
          "Titre": "The fingerprint scan does not…",
          "Contenu": "The fingerprint scan does not consistently work. Also, arrived slightly scuffed on the front of the door."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T18:30:05.000Z",
          "Titre": "Just OK",
          "Contenu": "Decent product, bag is very small, looks way smalley in person that in photos."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ben E",
          "Nb_Reviews": 2,
          "Date": "2023-04-06T16:09:40.000Z",
          "Titre": "Connection to Wi-Fi has not been…",
          "Contenu": "Connection to Wi-Fi has not been successful yet, still troubleshooting, otherwise a great product"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marc Mosby",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T02:31:20.000Z",
          "Titre": "It state that's its in stock",
          "Contenu": "It state that's its in stock. Why do it take so long to ship? Other companies ships right away. Processing should be as fast as they take your money."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Logan horne",
          "Nb_Reviews": 1,
          "Date": "2023-01-17T06:26:14.000Z",
          "Titre": "Nano key will not pair with nsl20i",
          "Contenu": "Nano key will not pair with nsl20i safe! The website should make it more clear which safes are nano key compatible."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bill Ryan",
          "Nb_Reviews": 2,
          "Date": "2023-03-17T23:59:31.000Z",
          "Titre": "Cannot get fingerprint to work",
          "Contenu": "Cannot get fingerprint to work, have cleared and tried multiple times"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "CHRISTOPHE HA",
          "Nb_Reviews": 2,
          "Date": "2022-10-18T21:28:31.000Z",
          "Titre": "The safe was shipped in a plastic bag",
          "Contenu": "The safe was shipped in a plastic bag! lots of damages to the product box! Product works fine so far and no apparent damage but it's most likely not good for the electronics... I was about to order the Lifepod XT Colion Noir edition but now I'm afraid it will be shipped in the same condition..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "EDMOND",
          "Nb_Reviews": 1,
          "Date": "2022-09-13T21:24:41.000Z",
          "Titre": "Good item, bad logistics",
          "Contenu": "Good item, bought it as a gift for my girlfriend. She liked it. However, the logistics took too long to get here. Fist they said the 7th, then the date changed to the 4th. For whatever reason, my package sat in limbo for 3-4 days in one location (which was relatively close to me, so that was frustrating). Overall, I want to order another but skeptical on it either taking all millennia to receive it or it being lost in shipment altogether."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Roy W.",
          "Nb_Reviews": 2,
          "Date": "2023-01-05T20:52:51.000Z",
          "Titre": "New Lifepod 2.0",
          "Contenu": "Got my new Lifepod 2.0. My comments are as follows. I like the size and the various options to customize the inside to fit your needs. The safe is large enough to hold two pistols if desired or one pistol with extra clips and a box of ammo. Now the not so good. I paid extra for the biometric feature. I’ve programmed it several times now. It recognizes my fingerprints immediately after it is programmed. However, if I wait a few hours or even the next day the unit will not recognize my fingerprint and I have to use the four digit code. I’m on my fifth try but my guess is that as your hand expands and contracts with how warm your hand is, so does your fingerprint slightly enough to cause the unit not to function as it should. Secondly, if you have to get into the safe quickly that isn’t possible either. If you depend on the biometrics in the middle of the night then have to switch to the four digit code that takes longer then you also have to use both hands to unlatch the security latches on either side which creates noise with the latches. Then you have to manually open the lid. It does not pop up on its own. Overall I think the safe is built well but just not as quick access as I would like as I wanted it to keep by my bedside in case of emergency with an intruder. Personally I would not purchase this item again or recommend it. The advertisement is deceiving on how easily the biometrics work and how easy access is."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Andrii",
          "Nb_Reviews": 1,
          "Date": "2022-08-24T15:26:22.000Z",
          "Titre": "Pretty basic",
          "Contenu": "Pretty basic. I bought a refurbished one. I’m glad the Barricade model I got has a keypad along with biometric finger scanner. The biometric works about every third attempt. Wouldn’t bet my life on it. Works great to keep kids out. The inside light works good. Sometimes use the steel cable if I go somewhere. Keeps honest people honest. Fits a compact and subcompact at the same time nicely."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "VIP Blue",
          "Nb_Reviews": 1,
          "Date": "2022-09-11T18:34:29.000Z",
          "Titre": "You better have a skinny firearm",
          "Contenu": "I really wanted to love this safe, but it falls short for one reason - it’s too shallow. I got the safe/bag combo, with the tray. However, the tray is absolutely useless if you have a mid-size or full-size firearm because the try will not fit or close when you put your firearm in the safe. Unless you have a thin and/or 1911 style firearm, don’t bother getting the tray. The rest of the safe is of good quality, as well as the bag. Although when you put the safe in it, you’re not gonna fit much of anything else in there. I’m just very disappointed with the tray issue."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Josh",
          "Nb_Reviews": 1,
          "Date": "2022-09-08T22:21:05.000Z",
          "Titre": "Not all 10 series are made the same, be careful",
          "Contenu": "I almost purchased the base 10 series model thinking that it had dual latches. All of the marketing, to include the product description on their buy page talks about the dual latch system. I didn't need the tech updates but wanted the dual latch. I found out on other sites that this is not the case, and reached out to support for clarification. They did end up providing me with a discount on the upgraded model and indicated they were working on updating the website to reduce confusion. It still does not appear to have been updated after two weeks though."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Austin",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T15:30:49.000Z",
          "Titre": "Hard to review a product you have not…",
          "Contenu": "Hard to review a product you have not received yet."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kenneth",
          "Nb_Reviews": 4,
          "Date": "2022-09-16T03:07:03.000Z",
          "Titre": "A little disappointed!:(",
          "Contenu": "A little disappointed.  The overall construction of the LifePod 2.0 is fantastic.  The major flaw is that you are not able to use the tray insert when you have a pistol stored in the pod.  Just add about 3/4\" to an inch and all will be good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 2,
          "Date": "2022-09-02T16:14:39.000Z",
          "Titre": "Pistol hangs up when pulling from safe",
          "Contenu": "Pistol hangs up when pulling from safe. safe needs to be a half inch longer to better access standard 911 pistols or Springfield XD. Safe quality and entry options very good. Just disappointed on how you have to turn and pull pistol out. Makes noise which I don't like, squeals."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ronald",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T02:20:12.000Z",
          "Titre": "Great safe but too darn expensive"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Massimo",
          "Nb_Reviews": 1,
          "Date": "2022-07-27T00:12:18.000Z",
          "Titre": "RS500i - Not as expected",
          "Contenu": "I purchased a RS500i from a third party not being available from Vaultek. Safe seems good but some of the features seems too much.  The WiFi at times disconnects and it is also tricky because you need to buy all these accessories. All the parts were not in the safe I only received 2 Barrel adapter and no velcro barrel mount. I purchased some accessories from them and their return policy is very unfriendly. Overall I wont recommend."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Greg",
          "Nb_Reviews": 2,
          "Date": "2022-10-05T17:43:04.000Z",
          "Titre": "Doesn’t include everything you need",
          "Contenu": "The safe should have had the foam inserts sold with it. It’s silly that a small gun safe at this price point wouldn’t include the proper equipment to keep your firearm secure."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 2,
          "Date": "2022-08-14T22:37:43.000Z",
          "Titre": "I picked this up because of the new…",
          "Contenu": "I picked this up because of the new ability of excepting pistols with red dots. I tried it for my P220 or my G17 both of which have red dots. Didn’t work using it in the forward position had to use it backwards with the slide of the pistol facing the front of the safe."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jake",
          "Nb_Reviews": 1,
          "Date": "2022-07-25T06:24:03.000Z",
          "Titre": "Not Made in America",
          "Contenu": "Not made in America! LifePod 2.0 SE is a well-built safe, and I would buy from this company again only if they brought their factory production back to the United States. To me, it just does not seem right to be storing my American-made pistol... in a Chinese-built gun safe."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Spiezia",
          "Nb_Reviews": 3,
          "Date": "2022-07-26T15:17:53.000Z",
          "Titre": "I'm a little disappointed",
          "Contenu": "I'm a little disappointed. Monday 7/24/22 at 5am EST I could not connect to my safe via the iOS app. I was able to open the door via bio-metrics and combination. I went to work at 7am. at around 7:15am, i received a tamper alert and the iOS app would not show the door was locked, just showed tamper. I had to leave work and go back home to find the door was indeed locked.I opened the safe, checked it and closed the door. Everything went back to normal. The iOS app showed the door was locked. This was a huge inconvenience. Can we possibly diagnose the issue?Regards,John"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MyBigWheel",
          "Nb_Reviews": 1,
          "Date": "2022-05-10T16:39:33.000Z",
          "Titre": "Solid unit…Setup can be frustrating.",
          "Contenu": "Solid, Nice size.  “Beep” feature is barely audible.  Printed instructions in manual not accurate.  Can be frustrating to set up.  Follow below tips to ease set-up frustrations.  Use online video to setup.  More accurate. And makes setting biometric and codes much easier to update.Also please be sure to position finger(s) correctly on fingerprint reader to capture your actual fingerprint."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stephen Smith",
          "Nb_Reviews": 2,
          "Date": "2023-03-06T15:09:10.000Z",
          "Titre": "Safe is fine",
          "Contenu": "Safe is fine. Interface with app does not work."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "M",
          "Nb_Reviews": 1,
          "Date": "2022-04-28T00:49:13.705Z",
          "Titre": "Don't trust your life to it.",
          "Contenu": "Design and function are fantastic, but the battery life is terrible. Even when not opened much at all, the battery seems to die quickly. If you have a need for rapid acquisition of your firearm and the safe battery is dead, so are you. Leaving it plugged in may not be a possibility depending on location. I have replaced battery with enhanced battery from Vaultek only to experience the same issue. If I can't depend on it, it serves no purpose."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2022-07-03T16:07:56.000Z",
          "Titre": "I wish all of the life pod cases can…",
          "Contenu": "I wish all of the life pod cases can with the lid organizer and pluck foam. Biometric option should be on all lifepods. The case itself is a good quality product and I’ll be using it and recommending it to friends and family."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Freddy Sabat",
          "Nb_Reviews": 2,
          "Date": "2022-08-24T08:59:49.000Z",
          "Titre": "The biometric does not work on command…",
          "Contenu": "The biometric does not work on command all the time everything else works well wasn’t for the Wi-Fi and notifications it would of been a complete waste of money what can u do"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Spencer",
          "Nb_Reviews": 1,
          "Date": "2022-10-14T19:53:18.000Z",
          "Titre": "Pleased with Purchase",
          "Contenu": "I was a little concerned on shipping.  Everything arrived as it should have.  Very Pleased with purchase."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kyle",
          "Nb_Reviews": 1,
          "Date": "2022-08-19T05:30:58.000Z",
          "Titre": "The safe is just alright",
          "Contenu": "The safe is just alright, can't decide if I will return it or not. Large and bulky, would prefer something smaller than the 2.0. Customer service is great."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bryce Rattiner",
          "Nb_Reviews": 1,
          "Date": "2021-03-14T06:17:00.000Z",
          "Titre": "LifePod 2.0 safe",
          "Contenu": "Over all I really like this product. It’s light, small and compact. The only problem that I have is when my CZ 75 SP-01 is inside the safe the tray can not be in there, if it is in there I am unable to close and latch the safe. If I would have known this I most likely wouldn’t have gotten the 2.0 version and just saved the extra money and got the 1st version."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John May",
          "Nb_Reviews": 2,
          "Date": "2020-05-21T02:25:17.000Z",
          "Titre": "Good lockbox, but the technology features need improvement",
          "Contenu": "The Slider is a solid lock-box with many concealment options, however the WiFi and (most importantly), the biometric functionality is not reliable at ~%15 false-negative identification rate. Until the WiFi and biometrics have been improved, I would only recommend the basic Slider model. For this reason, I will give the Slider 3 stars (even through the basic model would probably earn a solid 5)."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Danny Bihl",
          "Nb_Reviews": 2,
          "Date": "2020-05-23T00:35:32.000Z",
          "Titre": "Safe does not work!",
          "Contenu": "Update from 1star:Did not receive any help from support until I posted 1 star review.  Never received follow up support with Wi-Fi issues.  Was able to exchange for Bluetooth model which works great.  I am much happier with Bluetooth model.  Safe does not work and I didn't receive the extra pistol holders I ordered.  I have left some messages with their online support but have not heard anything from them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2020-04-15T22:18:29.000Z",
          "Titre": "Received the Lifepod today and was…",
          "Contenu": "Received the Lifepod today and was excited to try it out.  Programming was easy and very portable.  My only hangup is that it won't fit my Glock 19 with TLR 1S attached so I have detach the light before I store it.  That's a bit pain in the bum.  I might have to find another option and repurpose the Lifepod for document/passport travel instead.  A bit disappointing, but certainly not Vaultek's fault."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DB WALLACE",
          "Nb_Reviews": 2,
          "Date": "2019-09-14T21:59:12.000Z",
          "Titre": "The NMXi: problems with bio",
          "Contenu": "The new Vaultek NMXi has decent capacity (no way I could put 8 handguns in there though), but the biometrics are a problem. I already had a Vaultek VT Series biometric, which works flawlessly. The new one, though presumably with better technology and certainly much more expensive, has been a bit disappointing. Is there a software update that can fix these problems?:"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eduardo Rivera",
          "Nb_Reviews": 1,
          "Date": "2019-06-19T20:36:21.000Z",
          "Titre": "Great product mediocre Bluetooth",
          "Contenu": "Great product and in all fairness the Vt 10 travel safe that I have is a favorite of mine but the dissatisfaction came with the Bluetooth. One of the main features that lured me was the ability to know if any little hands had been messing with my travel safe. Unbeknownst to me the Bluetooth has at best a 10 ft connection reach. Otherwise it’s a great product and I would recommend this product for anyone who is interested in a travel safe."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kevin w",
          "Nb_Reviews": 1,
          "Date": "2020-12-27T02:48:20.000Z",
          "Titre": "Lifepod 2.0",
          "Contenu": "I just purchased the Lifepod 2.0, and although I really want to like it i find myself being drawn to its shortfalls. For one, with my glock 19 I cannot use the storage rack. Which I find odd because this is made for compact handguns. Second would be since I cannot use the rack, my glock 19 will not stay in the pluck foam because there is too much room above it. Third is that I cannot keep any mags in the storage organizer attached to the lid if I have a firearm in the safe. Wouldnt recommend if you are using this for any handguns that are thick."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2018-05-25T02:54:19.000Z",
          "Titre": "The safe is top notch, but issues with fingerprint reader",
          "Contenu": "The safe itself is top notch.  My only complaint is that the fingerprint reader doesn't always work on the 1st or even 2nd try.  It is quicker to just type in the 6 digit code.  I even have multiple fingerprint registered.  The fingerprint reader needs to work the 1st time every time otherwise it is a waste of a feature in my opinion since in most cases you would need to get to your weapon as quick as possible."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T18:13:38.000Z",
          "Titre": "The perfect truck safe",
          "Contenu": "The ordering was extremely easy. It felt like it took forever for them to get my safe to the shipping agency, but after that delivery was fairly speedy. The safe was easy to assemble and install. The fingerprint reader is extremely sensitive, which is awesome! Overall I highly recommend Vaultek Slider series safes!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ray",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T07:20:48.000Z",
          "Titre": "Working on it",
          "Contenu": "Style and design are well made and , I like the ease of it to make it your own personal case with the pluggable.  The bio finger lock does not always unlock when I place my finger on it i’m hoping it will get better"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert O.",
          "Nb_Reviews": 3,
          "Date": "2023-12-17T00:31:27.000Z",
          "Titre": "Great Little Safe",
          "Contenu": "The Barikade seems to be a great little safe. It does what it promises. Unfortunately for me, the unit arrived with the top half smashed into the bottom half, which took quite a bit of force to separate. Fortunately for me it doesn't appear to have taken any damage. So for now, no harm, no foul... except for minus 1 star of course."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T06:25:05.000Z",
          "Titre": "I have three Vaultek Safe's - just one minor quibble.",
          "Contenu": "I have three Vaultek Safe's, two are RS800i's - their largest units. Well designed, well built, and attractive considering they are gun safe's. My only quibble is that the internal lights, while very bright, do not stay on long enough and always turn off before I am done moving things in or out."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T17:18:50.000Z",
          "Titre": "Safe is beautiful and well built and…",
          "Contenu": "Safe is beautiful and well built and customer service is very responsive and helpful as well.  The only reason I did not give it 5 stars is that it will not fit a weapon with a flared mag well.  But that is just caution great product and company"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ennis Braxton",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T14:24:43.000Z",
          "Titre": "Setting up the finger id",
          "Contenu": "Having difficulty setting up bio security for finger id...I'll continue to work on it...makes feel like I'm slow...lol"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 4,
          "Date": "2023-11-30T16:47:11.000Z",
          "Titre": "This is my second safe of this type",
          "Contenu": "This is my second safe of this type, but the first from Vaultek.  So far it is a much better design than my previous safe.  I like the lit keypad and the internal light.   I also like the fact that the internal battery is chargeable.   I was constantly changing out 9V batteries on my old safe.   The only \"problem\" I have encountered so far is that the finger print ID sensor seems to need a second scan to get the safe to open after the safe has been sitting.  It's not a huge issue for me as I do not keep my weapon stored in the safe unless I am leaving it at home.   Once home, the safe is opened again, so having that immediate opening is not a big issue.   But it could be for someone else.  Over all a good design."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "B....",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T19:10:04.000Z",
          "Titre": "Nice products",
          "Contenu": "Nice products. Just wish there was more options for colors and biometric locks."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "WILLIAM",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T14:44:58.000Z",
          "Titre": "The product is solid",
          "Contenu": "The product is solid. Morgan, the customer service rep I worked with, made things right. At first I received a bent and broken safe. The lid was misaligned and wouldn’t open. Morgan got a new unit sent. Unfortunately, the new unit didn’t have biometrics, which is what I had initially ordered. I let Morgan know again and he had a new unit with the corrects specs rushed out. New unit works great, looks good, and most importantly, keeps my firearm safely stashed, but accessible in the event of an emergency."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "jaef",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T05:48:58.000Z",
          "Titre": "Convenient, Not noticeable",
          "Contenu": "Bluetooth connection is slow. I wouldn’t say opening it fast w your phone is a viable option. Depending on your connectivity. I don’t have the nano, so I can’t say how it’s response with connectivity is.I like it a lot. It disappears in the room. Kinda large for a clock. Small compartment. Fits compact and midsize together well. I wouldn’t put anything else in. Hinder access to either. Or one with separate light and extra magazine would work well.Seems durable and sound. Planning on getting a second one."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "NavyVet",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T20:23:50.000Z",
          "Titre": "Decent but…",
          "Contenu": "A little disappointed after buying the LifePod 2.0. I was pretty much required me to buy their pluck foam to keep my gun from sliding around in the safe. I’ve bought cheaper travel safes that secure my pistol with no added foam. Additionally, Vaultek’s solution to “anti-lockpicking” is to disable the ability to use your backup key. I do like the finger print option."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T19:55:42.000Z",
          "Titre": "Decent Purchase",
          "Contenu": "Decent Purchase, however, be very clear what your point and purpose of this is for ... it hold a firearm but to utilize the upper try it almost must be a micro. Otherwise...great purchase."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jennifer",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T14:55:50.000Z",
          "Titre": "It's a nice safe",
          "Contenu": "It's a nice safe, easy to hook up & link with biometric nano key.  Randomly the screen goes completely blank or shall i say all the \"bells & whistles\" disappear from the screen, then have to touch numerous places on the screen to get everything back on...."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gary Furlong",
          "Nb_Reviews": 3,
          "Date": "2023-12-06T16:46:09.000Z",
          "Titre": "The instructions to setup the safe were…",
          "Contenu": "The instructions to setup the safe were not as straight forward as I would have hoped for."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "BJW",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T03:54:21.000Z",
          "Titre": "This is a great safe",
          "Contenu": "This is a great safe, easy to setup and use. Easy access, quiet and smooth action when needed. Perfect for your nightstand. Five stars if it had WIFI capabilities."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sean Mack",
          "Nb_Reviews": 4,
          "Date": "2023-11-04T00:43:07.000Z",
          "Titre": "Product is not bad, not great for a car.",
          "Contenu": "Product is not bad. It's not really made for a vehicle. The bracket seems like an afterthought and doesn't fit most modern vehicles (unless you leave the seat all the way forward). It also has a lot of rattle noise, which it won't have if mounted in a house/or office, but does when it's in a car. Vaultek doesn't include a security cable with the car mount bracket which is a huge miss. It can be removed from the car with a Philips screw driver so not real secure without a cable. Asked Vaultek about this but they were unwilling to provide the cable from the universal strap kit (which is another $35). The cable is probably $2. As usual with these setups, the fingerprint reader is hit or miss. Not sure I'd trust it in an emergency. Unfortunate that Vaultek can't sync the apps, so you have some of you wifi products in one app and any Bluetooth (like this one) on a separate app. Can't see them all in one."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kevin S.",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T17:27:09.000Z",
          "Titre": "Almost perfect",
          "Contenu": "Lockbox is great but I didn’t realize the side latches must be latched before locking and only unlatched after unlocking the box, which isn’t ideal since I wanted this to be a quick-access nightstand safe.  It’s briefly shown in the video on the website but it mentions in the directions in the package that not following those directions will cause malfunctions and implies that it won’t be covered by the warranty.  Still a great product and I will use it for other purposes."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kodi Krouse",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T00:32:42.000Z",
          "Titre": "Awesome!!!",
          "Contenu": "The product I bought is awesome, I received it fast and it works great! I do wish it had a little more room, and there was possibly a fire rating."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wes",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T18:35:38.000Z",
          "Titre": "Safe arrived with the door hinge…",
          "Contenu": "Safe arrived with the door hinge misaligned, one hit with a hammer fixed it however. Great safe, biometrics work 90% of the time but the other means of access work well"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tim K",
          "Nb_Reviews": 3,
          "Date": "2023-11-08T15:06:25.000Z",
          "Titre": "Great safe",
          "Contenu": "Great safe, feels solid, great for transportation. The one negative is the fingerprint reader is very sensitive. After scanning two fingers, only one works reliably."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Randy",
          "Nb_Reviews": 1,
          "Date": "2023-01-13T04:15:23.000Z",
          "Titre": "I gave this product 4 stars due to…",
          "Contenu": "I gave this product 4 stars due to shipping/packaging. It was not in packaged in a way where it would remain protected when in transit. My box was kind of roughed up, like it was dropped on its edge. Thankfully, the safe was not damaged. Now the VAULTEK safe I purchased, is A1. Works as advertised and instruction were straight forward. Heavy duty too. I would have given 5 stars if it weren’t for the lacking packaging protection."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Edward",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T13:26:08.000Z",
          "Titre": "I like everything about the slider safe, but",
          "Contenu": "I like everything about the slider safe with wifi. So far it responds well. I train daily with the number keypad, biometric and nano biometric so that I learn muscle memory. Wifi alerts are perfect if you have little ones at home. It's a reliable quick access safe for home defense. It is the onoy quick access safe on the market that is reliable and have wifi features that work very well. There is only one complaint,  I wish there was a heavier duty version. I feel like I can open it with basic tools like a screwdriver. The safe attaches to base with 4 small hooks, I can probably use large screwdriver to pry safe from base. Reason for 4 stars, otherwise exceptional safe. Vaultek can keep the current version but have an option to purchase a more robust safe. I'd be willing to pay twice for a more solid safe, just to prevent theft of my firearm when I'm not home. For now when I'm out of town I take out firearm from slider and place it in my large safe."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 6,
          "Date": "2022-12-29T22:26:42.000Z",
          "Titre": "Well constructed vault",
          "Contenu": "My first vault arrived damaged but anew one was quickly dispatched to me with a return label for the damaged item.The vault is well made.  The biometric panel is a bit iffy, not always working on the first try.  The keypad is fine.  I wish there were a few more numbers available but okay otherwise.  Programming could be easier.All in all a good item at a fair price."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rick Kearney",
          "Nb_Reviews": 2,
          "Date": "2022-12-12T05:46:50.000Z",
          "Titre": "Great safe with a lot of features",
          "Contenu": "Great safe with a lot of features.  So many ways to configure the inside makes it very flexible.  Two things I would like to see improved are the finger print scanner seems to be a little finicky and I would not rely on in an emergency access situation.  The other would be a heavier gauge metal version, maybe 10 gauge as an option.  Otherwise very satisfied with my purchase of the 800i"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas F",
          "Nb_Reviews": 2,
          "Date": "2022-12-12T18:46:55.000Z",
          "Titre": "Great Lifepod 2.0, better 2.1?",
          "Contenu": "My first Lifepod and Vaultek product. This is a great portable option to secure and transport my firearm. Love the tactical bag too. Happy to see upgrade security to disable program button identified on the original. My only negative I would like addressed is the USB power backup is micro, it's 2022 everything is going Type C. Just minor inconvenience to carry another power cord."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeremy",
          "Nb_Reviews": 2,
          "Date": "2023-01-05T06:10:06.000Z",
          "Titre": "I actually really like this safe, but……",
          "Contenu": "I actually really like this safe. It looks great and I really like the attachments. There’s one absolutely ridiculous thing though, the little tabs that cover the wall mount holes on back of safe that are accessed from the inside have lock tight on the screws. These screws are tiny and strip out easily. I stripped 2 different ones. It pretty ridiculous the these need lock tight. Basically I need to drill out these screws now to mount to wall."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Keary",
          "Nb_Reviews": 1,
          "Date": "2023-01-19T19:01:33.000Z",
          "Titre": "Purchased handle for my Lifepod 2.0",
          "Contenu": "I was able to get a handle for my life pod.  I almost gave a five star rating.  I wish there was a way to leave the handle on the container and still secure the lifepod with the cable.  The other issue is that the part was $9.99 which I feel is a reasonable price, however, the shipping and handling for the part is almost the same amount."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Raymond Neal",
          "Nb_Reviews": 2,
          "Date": "2022-11-30T04:28:03.000Z",
          "Titre": "The new DS2i Smart Safe",
          "Contenu": "The new DS2i Smart Safe is nearly perfect for what I need. Pros: - Perfect size for my bedside table and my home-defense sidearm (P320 M17). - Dimmable clock, temp, and humidity display. - Tamper alarm so I know when someone's been trying to open it while I'm not home.- 4-Digit numeric combination, fingerprint scanner with more than 20 programmable prints, reliable app, and backup keys.Cons:- Storing the Sig Sauer P320 M17 with two 21 round magazines adds quite a bit of weight to the tray. Therefore, when the safe is unlocked and the tray slides out, it's significantly slower than when it is empty."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mr Reid",
          "Nb_Reviews": 1,
          "Date": "2022-12-30T20:20:00.000Z",
          "Titre": "Great safe",
          "Contenu": "Great safe. For my setup the provided micro usb cable used to charge the safe was too short and had to get a replacement which ended up being a 90 degrees and reversible micro usb cable. I purchased the non absorbent foam as an upgrade to replace the original only to realize they are the same thing and not an upgrade which I believe should be stated under the description. The setup was pretty straight forward and I like the fact that I get an instant notification when the safe is in use or being tampered with."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anthony DuFresne",
          "Nb_Reviews": 2,
          "Date": "2022-12-25T20:56:08.000Z",
          "Titre": "I have purchased five Vaultek products…",
          "Contenu": "I have purchased five Vaultek products over time, and keep coming back for the utility and quality of their lineup.  My last acquisition was a extra shelf for one of my MXE Series safes.  Only time things weren't perfect,  when a rail refused to seat in its retaining clip. Brute force was a failure. Finally resorted to removing the rail receptor, placing it on the clip and then reattaching it to the rail.  That worked! Only would have deducted a half star for this, but that was not an option.  Overall, this is a five star company!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Justin",
          "Nb_Reviews": 1,
          "Date": "2022-12-23T18:52:58.000Z",
          "Titre": "Overall good build quality but needs…",
          "Contenu": "Overall good build quality but needs the ability to leave the backlight for the keypad and numbers on all the time. In the middle of the night you cannot see anything and any mispressed button faults out. Not sure if this can be added in via some update or not. Otherwise works nicely."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Roberto",
          "Nb_Reviews": 1,
          "Date": "2023-01-01T09:14:35.000Z",
          "Titre": "I love the safe interior and exterior…",
          "Contenu": "I love the safe interior and exterior really out if words for this safe .... the only thing I wish was that it was more room can't close the door with a rifle on the door if the shelves are in because my rifle hit the selves.... if it was wider and deep I'll be give it 1000 stars lol"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Luis T",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T22:27:58.000Z",
          "Titre": "malfunction and quick replacement",
          "Contenu": "I’ve had the barikade for about two years now and I really like and trust it but it malfunctioned recently after a few emails back-and-forth and a confirmation of my receipt they are sending me a replacement. I also own a life pod 2.0 and I also really like and trust that safe. Customer service experience was very pleasant."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Darren",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T18:27:43.000Z",
          "Titre": "There’s a lot to like about this safe",
          "Contenu": "There’s a lot to like about this safe. Sleek, useful digital display, QI charger for smartphones, numerical and fingerprint lock, decent size for a pistol and magazines. I would love to see VAULTEK improve by adding to the number keys with a full 0-9 keypad. Also, for this price point the fingerprint reader is not up to par. Research how the smartphones do it and incorporate that. It’s too slow, too error prone.I’m overall happy with it for my needs though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Martin",
          "Nb_Reviews": 2,
          "Date": "2023-04-29T14:52:28.000Z",
          "Titre": "Great Product.  Terrible Account Management",
          "Contenu": "So far, I’m pleased with my new DS2i Smart Station.  Programming the Administrator fingerprints was confounding.  The written instructions in the packaging and online were less than clear.  The instructional video was much better. I still have not been able to register my product.  I already have a Vaultek account but it doesn’t recognize my password,  So.  I tried the forgotten password link and get the message that the password reset code is invalid or was previously used.  Try it again and the system requires me to wait an hour due to too many attempts.  As best I can tell, you get 2 tries and the system locks down.  I’ll try calling during business hours.  Fingers crossed!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "C",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T15:30:31.000Z",
          "Titre": "Great safe; more space please.",
          "Contenu": "Replaced a Lifepod 2.0 with a DS2i Smart Station and while mostly happy with it, after waiting a few months for it to become available, disappointed the available space therein wasn't such that I could fit the same amount of contents: also didn't like the lack of clearance at the back of the drawer.  For the money, I expected more."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ben",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T16:32:00.000Z",
          "Titre": "Overall purchase process was easy but",
          "Contenu": "Overall purchase process was easy. Item arrived in time. The finger print sensor on the product is not very reliable from what I have experienced in the past few weeks. Takes multiple attempts with a single finger which could be precious time lost in an emergency."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ron",
          "Nb_Reviews": 1,
          "Date": "2023-03-19T21:01:56.000Z",
          "Titre": "Solid product",
          "Contenu": "I ordered a Lifepod 2.0 and it arrived well packaged and undamaged.  The product looks great and seems to be high quality in terms of manufacture, fit, and function.  So far I'm happy with my purchase.Two things keep me from rating it 5 stars.  One is the pre-perforated pluck foam makes it difficult to get a fit fine-tuned beyond the perforations (a good, functional fit can still be made).  Secondly, the depth does not allow for use of the tray along many common sized carry pistols; it would take a very thin pistol in order to use both together.  For my taste a small design change to allow full use of all features simultaneously would be a great improvement."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "sean",
          "Nb_Reviews": 1,
          "Date": "2023-03-11T18:00:19.000Z",
          "Titre": "A little thinner than expected",
          "Contenu": "A little thinner than expected. It’s hard to fit a handgun with the tray inside the safe, they don’t quite fit together, but safe works great backpack fits a lot more than expected inside of it and backpack looks great. Wish I would’ve ordered the one with biometrics/fingerprint reader. Overall great product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matthew",
          "Nb_Reviews": 2,
          "Date": "2023-04-16T13:07:03.000Z",
          "Titre": "I recently purchased Lifepod 2.0 and I…",
          "Contenu": "I recently purchased Lifepod 2.0 and I am so happy with my decision. The quality is outstanding, and it has exceeded my expectations. I would highly recommend this product to anyone in the market for a portable safe. However, when using the available top tray, it doesn't sit flush due to the width of my Walther CCP grip."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "T.  Tonio",
          "Nb_Reviews": 3,
          "Date": "2023-07-25T16:13:23.000Z",
          "Titre": "Nice safe that can be visible",
          "Contenu": "Nice safe that can be visible, yet discrete. The drawer opens smooth, interior light is nice. Easy to set up. The only reason I didn’t give 5 stars, is because the fingerprint reader doesn’t always work."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T10:42:40.000Z",
          "Titre": "Vaultek Slider",
          "Contenu": "I purchased a Vaultek Slider for my home.  The concept is great but it really needs to be a little deeper front to back considering it's advertised to fit a full-sized handgun with an optic (Red dot).  I use it for a full size Sig Sauer P320 but I had to change the grip module from a full size to a compact in order to clear the optic (sig sauer romeo 1 pro). Even with the compact grip mode it just barely clears when removing the gun.  Fortunately the Sig P320 series are modular but most customers won't have that option unless they have a Sig Sauer.  The cost is a bit high considering the overall size and gauge of steel they use as well.  I'd really like to buy their Smart Station but the cost for that is REALLY extreme for what it is and I have seen any discounts/sales etc even though I've already bought one of their products."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anthony",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T20:13:45.000Z",
          "Titre": "Refurbished safe!!!!",
          "Contenu": "Bought a refurbished Lifepod 2.0 and couldn't be happier! The box it came in was the only thing that looked used otherwise it could have passed for brand new. Came with all the OG parts. Would recommend it to anyone."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "HENRY",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T14:35:29.000Z",
          "Titre": "The size limitations for this type of safe.",
          "Contenu": "My Vaultek safe filled my specific storage need perfectly.  The only critique would be to increase the hight of the RS800i by four inches to better accommodate two shelves."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Parth P.",
          "Nb_Reviews": 3,
          "Date": "2023-07-03T23:13:46.000Z",
          "Titre": "Great safe, 1 con is the Fingerprint feature is not accurate",
          "Contenu": "This a great safe (series 20). Secured to 1 location,quick access and safe from unwated prying. But the only downside is the fingerprint option is not accurate. It defeats the purpose of a fingerprint feature if will not work everytime."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Luis Velazquez",
          "Nb_Reviews": 1,
          "Date": "2023-04-15T20:49:04.000Z",
          "Titre": "Very good product, lived up to expectations",
          "Contenu": "So far the product has met my expectations. In my case the fact that all actions like opening or tampering attempts trigger an instant push notification or email is the most valuable feature. Contruction is good  and materials are high quality. Customer service seems to be good as they followed up with me all the way after shipping to see if everything was Ok. The reason for 4 stars has to do with the Wi-Fi setup. In my case I had to go with an alternate setup method that surprisingly wasn't described in the instructions despite the many manuals came with it. However, I hope that these little details get improved in subsequent updates and versions of the software. Other than that I am very happy with the product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T23:42:08.000Z",
          "Titre": "Vaultek makes a great product",
          "Contenu": "Vaultek makes a great product. I own 3 different Vaultek safes.  The shipping boxes that are used do not protect the product very well from damage.  The lifepod 2.0 is packaged with plastic corners that the safe box packaging sits in inside the exterior box.  I received the box with the lifepod 2.0 not sitting in these plastic corners so it was loose inside the box.  The exterior box was damaged with a good size hole which in turn damaged the interior boxes clear see through plastic for viewing that the lifepod 2.0 comes in which in turn put a small scratch in the top of the lifepod 2.0 itself."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alexander",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T20:49:09.000Z",
          "Titre": "please list what kind of locks and keys they have",
          "Contenu": "There's one thing I wanted to know before purchasing: what kind of lock core does the Barrikade have? And I did some assuming and thought it was disc detainer. Had I known it wasn't disc detainer I would have upgraded. As it is I can fill in the keyway if I think it's a major liability since it can be powered externally.Other than that: great little box! Fits what I don't want grabbed ezpz."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DC",
          "Nb_Reviews": 1,
          "Date": "2023-02-22T02:04:06.000Z",
          "Titre": "Top notch Service",
          "Contenu": "I had to return my humidor twice. Once because it was too big and the second time because of discoloration. Both times the refund has been prompt and follow up service has been exceptional! Right now my unit is seasoning and I can't wait to make my Dad jealous when I go yo his new house this Saturday for a stick!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ordinary Biker Oz",
          "Nb_Reviews": 3,
          "Date": "2023-03-02T16:44:29.000Z",
          "Titre": "Great vault for personal use.",
          "Contenu": "The quality of the materials and workmanship is high.  The look and feel gives credence to the reputation that Vaultek Safe is a top notch product.  The handgun and important documents fit nicely and are so secure.  The product arrived promptly after ordering and was well packaged.  Great product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrew",
          "Nb_Reviews": 2,
          "Date": "2023-04-12T15:12:42.000Z",
          "Titre": "I've been using the she for about 2…",
          "Contenu": "I've been using the she for about 2 weeks now. Carry it everyday to and from work. My primary goal is to keep my kiddos from gaining access to the firearm and for that the lifepod 2.0 send wonderful.  Some annoying aspects of the lifepod are things like the latches are not smooth at all and I often find myself fighting with them for a few moments. The removable tray I find problematic as well, it does not fit with my pistol (glock 19). My last gripe is the battery. 9v are not a common battery around my house so it's annoying, I'd much prefer a rechargeable battery since it already has a charging port built in. Overall, I like the lifepod 2.0, it has some minor inconveniences for my personal use. I'd recommend it to anyone in the market for something travel friendly and wanting to keep kids away from the firearm."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AmyW",
          "Nb_Reviews": 2,
          "Date": "2023-06-04T20:58:45.000Z",
          "Titre": "Amazing product; slow shipping",
          "Contenu": "I was originally frustrated that it took so long to ship (about a month).  However, once this arrived, my husband absolutely LOVES it.  So 5 stars for the product and deducting 1 star for charging my credit card then shipping 3+ weeks later."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lee",
          "Nb_Reviews": 1,
          "Date": "2023-03-17T07:42:31.000Z",
          "Titre": "Seems to be a good safe",
          "Contenu": "It was well packaged from the factory. They provide easy to understand instructions and manual. It was relatively easy to set up(I.e. fingerprints, PIN etc.) but I couldn’t get the Wi-Fi function to work but that may have been a good thing—one less device connected via Wi-Fi, can’t get hacked while online.It doesn’t have the most storage space but then again it’s designed for smaller spaces which works for me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Josh",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T17:17:05.000Z",
          "Titre": "For sure the best in its class…",
          "Contenu": "For sure the best in its class currently on the market. Like everything there is always room for improvement.  A bigger spring on the drawer may be needed at some point in the future with two full-size guns, the drawer is slow to open."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MARK",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T12:01:51.000Z",
          "Titre": "Biometric difficulties",
          "Contenu": "The security of the product is good. I couldn’t give it a 5 star because the biometric programming is difficult to set. After numerous attempts, I just gave up. Will try again at another time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DYLAN T HOLT",
          "Nb_Reviews": 2,
          "Date": "2023-06-03T14:38:09.000Z",
          "Titre": "The safe is great",
          "Contenu": "The safe itself is great, easy to setup with the guide included. Just note the wireless charger can be finicky especially if you use a more durable phone case but it still works just have to get the right spot."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Darren",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T20:48:25.000Z",
          "Titre": "Nice piece of gear, but carry handle seems not well thought out",
          "Contenu": "Nice piece of gear, but if I had known that the security cable and the carry handle cannot be used at the same time I would not have ordered the carry handle. Maybe make that part more clear or set expectations better there. Thank you for considering."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jase",
          "Nb_Reviews": 1,
          "Date": "2023-04-18T18:43:34.000Z",
          "Titre": "The product is as advertised",
          "Contenu": "The product is as advertised!  Smaller than I expected which is good.  That said, I would like to be able to fit a pistol and the tray in at the same time.  I’ll need to purchase the lid organizer.  I communicates with the Vaultek team that the packaging was very bad. It was a simple plastic bag that was ripped open in the FedEx truck and had liquid soap all over it. They responded kindly and apologetically.  If it weren’t for the shipping, they would get 5 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Peter",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T16:54:39.000Z",
          "Titre": "Great product to start",
          "Contenu": "Great product to start. Sturdy and functional. Delivery and set up was easy. The fingerprint screen does not always function correctly. Only downfall."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nir",
          "Nb_Reviews": 2,
          "Date": "2023-07-06T02:44:04.000Z",
          "Titre": "Great product for the techie gun owner",
          "Contenu": "I purchased the WiFi connected VTi model. It feels like a high quality product, and setup was quite smooth. There are several issues which could make this product better. First and foremost, the charging port: vaultek didn't get the memo that micro USB is dead. It's time to move to USB C. Second, the internal light turns off pretty quickly after opening, even if the device is connected to power. It would be great if there was an option in the app to change the timeout, or keep the light on for as long as the box is open. Third, fingerprint management in the app could be better if you were allowed to delete individual prints and to reprogram them. If I have two people with access and then I want to remove one of them, it seems that I have to delete ALL of the prints and start over. Fourth, it would be nice if you could adjust how far the door opens, and if it would go further to allow comfortable access with vertical mounting on a wall. I'm looking forward to the next generation of this product, as well as others."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "GZ",
          "Nb_Reviews": 1,
          "Date": "2023-01-26T22:53:38.000Z",
          "Titre": "Need option for 1 and 2-day shipping",
          "Contenu": "Ordering and receipt of products was fine, but there is no option to select shipping other than ground for more immediate delivery. Obviously this is only for items small or light-enough to travel by air."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "One Armory LLC",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T23:31:59.000Z",
          "Titre": "The safe was exactly what I was looking…",
          "Contenu": "The safe was exactly what I was looking for but the checkout process was a bit of a headache. I tried with 2 different credit cards and it kept giving me a message saying it was fraud. I finally had to use my debit card for the purchase to go through."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cesar",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T19:14:05.000Z",
          "Titre": "VAULTEK Smart Safe",
          "Contenu": "Love the look and ease of use (mostly). Vaultek does a great job of sending out info with the safe to ensure ease of setup from the get go. I think it was definitely a purchase of convenience at the price point rather than a value, but overall I’m satisfied with my purchase thus far."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Peter Franzke",
          "Nb_Reviews": 7,
          "Date": "2023-06-25T23:33:06.000Z",
          "Titre": "This is a great product for traveling…",
          "Contenu": "This is a great product for traveling when you wish to secure items other then a firearm.  My only issue is that almost every time you pick it up you touch the lock key and it \"turns on\" for the code input."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Louis",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T21:18:51.000Z",
          "Titre": "AS a Deputy Marshal",
          "Contenu": "AS a Deputy Marshal, State and Federal Firearms Instructor, and Business Owner I found the Products well made. I Try to push new owners to secure any firearms that aren't on their bodies from the access of children, including 40 year old children. The order was incorrect in regard to colors ordered and such, but otherwise packed securely, and arrived intact."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "dc",
          "Nb_Reviews": 1,
          "Date": "2023-04-24T13:59:46.000Z",
          "Titre": "Good but flawed?",
          "Contenu": "It's a good safe with one pretty big flaw. There should be an option to have a dim, always-on light around the finger pad so you can find it in the dark. This seems so obvious perhaps I'm missing how to activate it?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Yakplanet_tv",
          "Nb_Reviews": 2,
          "Date": "2023-05-15T00:50:06.000Z",
          "Titre": "This is a wonderful product",
          "Contenu": "This is a wonderful product. Very well secure and durable design. I do wish it had a duel lock mechanism instead of one In the center. Makes me feel more secured that the device is harder to break into or pry apart. Other then that I do love this safe. It makes me more comfortable around my home woth family."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JG",
          "Nb_Reviews": 4,
          "Date": "2022-12-21T04:25:17.000Z",
          "Titre": "Convenient, easy to install",
          "Contenu": "Bought the biometric slider for a desk mount.  Great packaging.  Instructions were easy to follow.  Installation was simple.  Programming steps were pretty easy to follow.  Fingerprint reader most times takes two tries.  Although it looks like it will fit a SIG P320C with an optic, the depth doesn't allow you to draw the weapon cleanly out; you have to twist it to clear the optic from the case.  Another inch opening extension would solve this.  Stores the magazine without issue.  The slider mechanism is far from silent.  An audible lock release \"click\" is very noticeable and the drawer extension, although smooth, is noisy.  Overall, I'm pleased with the safe in terms of convenience and security, but the design could use some improvement."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jonathan",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T20:44:36.000Z",
          "Titre": "The safe is really good",
          "Contenu": "The safe is really good and easy to use. My order got fulfilled quickly and to me just as fast. My only nitpick is that the hardware supplied is to mount to walls and much to big to mount to most of my furniture without busting through the otherside."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2023-04-03T15:57:55.000Z",
          "Titre": "Great safe worth the security.",
          "Contenu": "Great safe, second safe but different model from Vaultek. Packaging for shipment should be better. The safe arrived damaged and needed to be replaced. Replacement was smooth."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jevaras",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T09:10:14.000Z",
          "Titre": "Satisfied",
          "Contenu": "Fully satisfied with all three of my products."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patrick",
          "Nb_Reviews": 1,
          "Date": "2022-12-05T21:52:45.000Z",
          "Titre": "Functional design",
          "Contenu": "Functional design. Build quality is awesome, only issue is phone charger on top is hard to find in the dark. And seems to beep at random times of the night. Would definitely buy it again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matthew",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T20:19:10.000Z",
          "Titre": "Quality product",
          "Contenu": "Quality product. Easy setup. Still figuring out a few things. Would’ve given 5 stars but Bluetooth connection has been not great even when standing right next to it.. and trying to figure out why it beeps every 10 minutes when my phone is charging on it🤷🏼‍♂️"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rolfe",
          "Nb_Reviews": 1,
          "Date": "2023-03-17T20:00:38.000Z",
          "Titre": "The Vaultek Smartstation DS2i was worth the wait",
          "Contenu": "The Vaultek Smartstation DS2i is an excellent product but the only problem was that it was tough to order the safe on their website. Once the product was released the website started to crash. This was the 2nd time I tried to buy their safe when they released the email stating that it was back in stock. This was the only reason I gave 4/5 stars. I intend to buy more Vaultek products."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 2,
          "Date": "2023-04-23T14:32:08.000Z",
          "Titre": "The only reason I gave it a 4 star is…",
          "Contenu": "The only reason I gave it a 4 star is because they make the shipping label and then not ship it for a few days. Also spending almost 300 bucks on 2 safes I still had to pay for the shipping. Other than that, they are fantastic."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-03-18T02:39:43.000Z",
          "Titre": "Accurate in-stock notifications",
          "Contenu": "Accurate in-stock notifications, received item in around 6 days from date of purchase.Only had it for one week, so far works as advertised."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Bernath",
          "Nb_Reviews": 4,
          "Date": "2023-05-26T19:36:27.000Z",
          "Titre": "Slight confusion but we got there",
          "Contenu": "I intended to purchase a VT10 safe and after reading the description, it appeared I would need to also purchase a mounting device and an upgraded foam insert. The site wasn’t working properly (showed no inventory) so I called in. A very nice rep confirmed they had the items in stock and placed my order for me. When the safe arrived, it already had the foam insert. That wasn’t how it was listed on the site (I had to purchase to upgrade) but I was happy with it. So, I went through the return process (nice reps) which is easy enough; however the cost to ship the extra item back is more than 1/2 the price itself. Regardless I sent it back. Oh well. The site seems to be the issue (lack of detail on what’s included resulting an an unnecessary purchase) and incorrectly listing out of stock items when inventory was existing. All system stuff that can be cleaned up. In the end, it’s a great product and they have great reps working for them. I’d recommend this VT10 to anyone."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Isaias",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T04:26:46.000Z",
          "Titre": "Perfect But!!!!",
          "Contenu": "Excellent lifepod 2.0 product the only thing I don't like is the depth it should be more depth to it for big guns like for a full size hand gun. When I put my G34 an put the tray on top it won't fully close. Leaving a 3 centimeter gap open."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Barry W.",
          "Nb_Reviews": 2,
          "Date": "2023-04-13T20:22:44.000Z",
          "Titre": "So far so good",
          "Contenu": "I have not had the safe for more than 3 weeks so I feel I cannot give it an honest review. The design is good, slide is quiet but not super silent. It definitely gives our family a piece of mind and easy access to the weapon in case it is needed"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-03-17T18:53:56.000Z",
          "Titre": "Clock alarm maybe?",
          "Contenu": "Would be nice if it had a clock alarm built in so you can use it to wake up since it’s most likely going to be at a bedside. It has Bluetooth so maybe connect it to the phone charging on top somehow?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pickett, Mark",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T17:08:00.000Z",
          "Titre": "The quality of the product is great",
          "Contenu": "The quality of the product is great.  Only having some issue with the biometric reader keeping the fingerprints in memory after they are programmed in."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michelscorey",
          "Nb_Reviews": 1,
          "Date": "2023-02-07T06:07:09.000Z",
          "Titre": "Lifepod with no carry handle",
          "Contenu": "So I bought the Vaultek Lifepod biometric safe. $260It's annoying I had to buy separately the carry handle.That being said it's a good safe. But I would love to see how securing the cable holds up. The case is plastic and the cable connects into a small piece of plastic. I don't think it's reinforced but I could be wrong. But I feel like with a good hard yank the cable could cut easily be ripped out of the plastic. I will not try it because it's so expensive and I don't want to break it but I'm curious if people have done it on YouTube."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Firebranch",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T23:54:47.000Z",
          "Titre": "The light!!!!",
          "Contenu": "Would recommend to anyone, but tell them to get it while on sale. This is my first handgun safe.         I got the vt series, wifi.+     feels strong, heavy, secure, great features, looks great,  App is....ok,  requiring administrative fingerprints to save more fingerprints, tamper & drop sounds alert, fits an m18 with a red dot from sig with a 17rd mag inserted plus 23rd mags, directions for setup were spot on easy-     expensive, charge light is bright especially at night while sleeping, app is in need of an upgrade, sluggish app, need the option to disable charge light, package was shipped and wish it was more discreet, I don't get push notification but rather emails(perhaps i need to look into it more). More charging locations would be ideal instead of the one on the ONE side or have the charge port on the bottom and make it so the cord can go all directions, doesn't fit iwb or owb holsters unless you take out the foam   Yes, the charge light DRIVES ME CRAZY, although i did find a solution!!!! I used permanent marker to diffuse the NIGHT LIGHT.     So the makers don't realize this is going on the night stand by the bed?!?! 4.885 / 5 stars because of the charging indicator light and the price. I paid $450 and would have felt better at $300 or less. LOL great product though 👌"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "clint f.",
          "Nb_Reviews": 2,
          "Date": "2023-05-21T05:15:25.000Z",
          "Titre": "Not as much room as I'd hoped...",
          "Contenu": "I'm not a big fan of off-body carry because if someone grabs the bag or pack where your weapon is, you are now unarmed and the bad guys get a gun. So I bought this so that in those rare cases I don't want the gun on me, I can be confident that it is secure if it gets taken. On the plus side, it was easy enough to set up, although it doesn't come with a 9v battery, and lets face it--who uses those anymore? So you probably won't have one lying around. It is well constructed and the locking mechanism works well. The big downside that I have with it is the room. Yes, it will hold a full sized firearm, which is great. However, if you have a gun in this thing, you can forget about using the tray, it simply isn't deep enough. So yeah, that is a big downer for me, because it limits the amount of things you can carry. So it may not be a five star for me, but you may not care a bit. I did buy the lid ordanizer--extra cost, so that helps a little bit."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Elie",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T02:23:13.000Z",
          "Titre": "Great product",
          "Contenu": "Great product. Just wished they all worked on the same app."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Angela",
          "Nb_Reviews": 2,
          "Date": "2023-04-11T17:20:43.000Z",
          "Titre": "Looks great",
          "Contenu": "Looks great, easy to operate - just one issue, random times when you place your phone on top to charge the time showing on front display just disappears and you have to go into your phone app to fix it ??"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "B.G",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T18:27:00.000Z",
          "Titre": "Good quality safe",
          "Contenu": "Good quality safe, very quiet, fast release. Very easy to setup. Cons: the clock will disappear occasionally and I have to tap the screen to get it to appear again, the phone has to be exactly on the charging circle in order to charge. You can’t just place your phone on the top and expect it to charge. The charge is also very slow, it is an over night charge defiantly not a lightning charge. Last and most importantly make sure to pay close attention to the clearance. I have a magwell on the base of my gun and when I put that gun in the safe it rubbed against the top of the safe and the safe would not open at all, so I had to keep a different gun in the safe. The height of my magwell is 1 3/4 inches."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "FEDERICO FRANCISCO",
          "Nb_Reviews": 1,
          "Date": "2023-06-03T06:43:03.000Z",
          "Titre": "Life pod xt SPECIAL ED. I THOUGHT IT WOULDT SCRATCH",
          "Contenu": "Well I just bought the special edition. And I took it trough security at Atlanta airport and I thought this case would held up rough handling, but I was surprised to se see a scratch on the top as it came out from the security filters. So I don’t know if I would throw it like they do on the advertisement video. I don’t want to ruin my 700 box, so in that aspect I would give a bad score. For all other aspects I love my case. Is so fancy. Everyone at my gun range just went dropping jaws all the way. I bought extra accessories and I really love that I can arrange things how ever I need to. For example if going to the range or just to keep my guns safe at home. So I don’t know if it will resist a fall and I defenetly won’t try to see if it handles ok and won’t brake.  Also I think the pressure latches fills a little weak (cheap material). Maybe I am wrong but time will tell. It’s my first vaultek product and so far I am very happy with my life pod xt. I hope this will help other customers to decide because it is defenetly NOT CHEAP."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TRO",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T00:00:13.000Z",
          "Titre": "Safe is really nice",
          "Contenu": "Safe is really nice, and exactly as advertised. However, the size and space inside the safe are deceiving and fill up quick. Had I known what I know now, I would have went up a size. Other than that, great product!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Colt",
          "Nb_Reviews": 1,
          "Date": "2023-03-17T21:42:22.000Z",
          "Titre": "Tough, Durable & Sexy",
          "Contenu": "Amazing product. Easy to use. I love the biometric, keypad and key options! Looks tough and sleek. Seems durable. Had no issues traveling and flying with it. I just wish it was a tad deeper to fit my G19 and use the tray 🙁 without almost having to sit on it to close it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jose",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T01:30:03.000Z",
          "Titre": "Returning the item was a hassle but…",
          "Contenu": "Returning the item was a hassle but customer service was great!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steven Louder",
          "Nb_Reviews": 3,
          "Date": "2023-03-23T19:45:29.000Z",
          "Titre": "A long wait for the product",
          "Contenu": "A long wait for the product. Once back in stock there was a rapid turnaround from order to delivery. Very satisfied with the products construction and ease of set-up"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Zach",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T20:42:56.000Z",
          "Titre": "RS Series - Spring Loaded AR Mount",
          "Contenu": "The mount works well, it's just very finicky about placement to get everything to fit. It would probably work better with a shorter barrel AR."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rocksalty",
          "Nb_Reviews": 2,
          "Date": "2023-05-24T22:10:11.000Z",
          "Titre": "Does not fit pistols with red dots…",
          "Contenu": "Does not fit pistols with red dots unless you remove the tray. Finger print scanner is not consistent unfortunately."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T19:04:27.000Z",
          "Titre": "It’s nice overall",
          "Contenu": "It’s nice overall. But I expected a tad more for the money. Like the wireless charger doesn’t work all the time. It just beeps constantly unless I get lucky to get it in the exact correct spot. I have an iPhone 13. So it should work. I do have a thinner MagSafe case so it shouldn’t impede it. Also the drawer opens 3/4 or the way. I have to pull it all the way open. I can still access my G17 though. Minor issues. But I wish it was just a little better"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shelley Morrison",
          "Nb_Reviews": 2,
          "Date": "2023-03-17T22:51:09.000Z",
          "Titre": "Love my new Smart Vault",
          "Contenu": "Love the Smart Vault. It took a long time to get one because they were out of stock. I still was not able to order the mounting self because it was out of stock. Also I had to try several times to get checked out when I did get this one, I think their system was overloaded."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kyle",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T17:18:12.000Z",
          "Titre": "Great product",
          "Contenu": "Great product. Absolutely love it.  Only complaint is the foam that came with it was not up to par. Firearm would bounce around in the case and had to purchase the foam, handle package after the fact.  Also.  It would be awesome if the bag was slightly bigger to allow room for laptop etc."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel Sutton",
          "Nb_Reviews": 2,
          "Date": "2023-05-16T19:15:57.000Z",
          "Titre": "I like the device works very well",
          "Contenu": "I like the device works very well. The only issue I have is that you guys are out of stock for the mounting plate to mount it to a flat surface. The cables great but you can cut the cable, so I’m hoping that you guys are gonna get the flat mount plate in one of these days."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Suzanne",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T19:37:15.000Z",
          "Titre": "I order this item under the impression…",
          "Contenu": "Even though there were problems with delayed shipping due to technical issues, but the customer service team followed up with me and the product is very amazing!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Greg",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T16:51:06.000Z",
          "Titre": "Company itself is great it is more…",
          "Contenu": "Company itself is great it is more about the product. The fingerprint scanner is not the best it works maybe 1 out of 3 times and only works on your thumb."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Geoff Jenkins",
          "Nb_Reviews": 7,
          "Date": "2023-12-20T16:07:59.000Z",
          "Titre": "Convenient, secure, fast access safe",
          "Contenu": "The LifePod 2.0 is a very well-made pistol safe - good for one full-size or two sub-compact firearms. It’s not as indestructible as a built in gun-safe, but realistically, you couldn’t lift anything that was as tough as a bank vault. This will keep kids, those with prying eyes, and random thrives away from what you’re carrying, but give you instant access."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryan A",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T22:44:13.000Z",
          "Titre": "Vaultek CS is Tops!",
          "Contenu": "I’ve had my RS800i safe for just over a year now and it’s been rock solid. Recently, it developed an issue (WiFi drops and screen blinking), and I reached out to their support team and got a prompt response. It was determined that I needed a new internal backup battery, which they promptly mailed to me for free. The new battery fixed my issues, and I’m back to having a solid, reliable gun safe. It’s good to know that companies like Vaultek still know the art of customer service. Thanks Vaultek!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JEFFREY SACKS",
          "Nb_Reviews": 5,
          "Date": "2023-12-17T16:16:27.000Z",
          "Titre": "We own two Lifepod’s now",
          "Contenu": "I bought this second Vaultek Lifepod for travel after trying my wife’s “Rose Sig Sauer P365” edition Vaultek Lifepod.  Simple, relatively light (about 2 pounds), and pretty easy to program and operate.  There is a key backup.  United Airlines gave me a hard time when I last traveled with a padlocked plastic case which the gate agent pried open and poked his little finger in telling me I needed to find a better locked box - the Lifepod can’t be easily pried open and is TSA compliant.  It fits my Glock 43X MOS pistol with Holosun sight mounted and an extra magazine.  I would recommend this safe to any of my friends that carry compact firearms concealed and are looking for a travel safe for their luggage or car and also as a safe that easily fits in a nightstand drawer.  I chose orange because it definitely stands out in a suitcase full of stuff."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kyle McCaughey",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T23:35:15.000Z",
          "Titre": "I have a life pod 2.0 humidor",
          "Contenu": "I have a life pod 2.0 humidor. The biometric scanner stoped working on me. This high quality product also comes with high quality warranty and customer service that is as easy as a email. They gave me some suggestions to fix the problem. When those didn’t work they were quick to respond and help me get a replacement. Really good product!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill Lindsay",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:49:10.000Z",
          "Titre": "Each Vaultek can have a specific use!",
          "Contenu": "I own quite a few Vaultek Safes and they sure do NOT disappoint! AMAZING safes, fastest bio-to-open I've seen or used. The RS 500i is perfect near my bed to access (God forbid) in the middle of the night; I use the LifePod 2.0 for travel on airplanes; I have a 20 series attached to the front seat in my car; I also own a VT, 10 Series, LifePod, LifePodXT, and I just ordered a Smart Station!!! (I almost have their whole lineup!) I still have a MX on my wish list for my office! (<--Some day!) These safes are literally the best of the BEST, and as I described above, each safe can have specific uses! I will say, having the LifePod 2.0 for use to travel with my firearm is really one of the best ways to do that; so light weight, and I attach it to the inside of my suitcase (wrapped the cable around the poles in the back of the suitcase). Such a GREAT company..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nick",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T16:16:52.000Z",
          "Titre": "Lifepod 2 - bedside gun safe",
          "Contenu": "First vaultek safe and totally worth every penny. I use the lifepod 2.0 for my bedside with the fingerprint scanner. Absolutely quick and easy access and setup. Will be getting the larger safes soon!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ben Poersch",
          "Nb_Reviews": 8,
          "Date": "2023-12-19T22:15:54.000Z",
          "Titre": "Vaultek leads the industry",
          "Contenu": "Whatever your needs are, they have a safe that works.  Paired with biometrics and wifi/bluetooth, they are the one stop complete solution.  I own several and will buy more.  Hopefully the next one will be an upright rifle safe.  Great job guys!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T07:02:44.000Z",
          "Titre": "Great product!",
          "Contenu": "Fast shipping, sleek looking product (Barrikade series 2), biometrics works great. Would buy from again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris V",
          "Nb_Reviews": 4,
          "Date": "2023-12-11T02:43:01.000Z",
          "Titre": "Great selection of choices for all of…",
          "Contenu": "Great selection of choices for all of my firearm needs. Very well made and thoughtful design. This is my second purchase and would highly recommend their products. Very solid build, lighted interior and textured outer shell. no reservations at all."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BJ",
          "Nb_Reviews": 3,
          "Date": "2023-12-07T19:09:15.000Z",
          "Titre": "Excellent Choice.",
          "Contenu": "While the unit is rather expensive, its nicely crafted, flexible and useful.Used on a night stand, its three-way function as a pistol safe, clock and iPhone charger is convenient. Added are the multiple forms of entry either biometric or numeric keypad.Add the available phone App and it makes this safe a useful purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debbie",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T23:22:29.000Z",
          "Titre": "Great product and great customer service!",
          "Contenu": "What a nice functional product! Our unit stopped working a short time after purchasing it. I can't believe how quickly Grace and the Vaultek team responded and addressed the problem! In this day of experiencing some poor or no customer service, it is refreshing to know that this company stands behind its products and provides great customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mixmastertee",
          "Nb_Reviews": 4,
          "Date": "2023-12-15T17:01:15.000Z",
          "Titre": "Great product",
          "Contenu": "My VAULTEK smart safe works exactly as advertised. It was Just what I was looking for. Will be purchasing another one very soon"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MJ",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T23:00:51.000Z",
          "Titre": "Airline Travels",
          "Contenu": "Hello,I was very pleased on how Vaultek expedited my order. From order to delivery it took only two days to receive my gun case. The delivery was flawless, and the content was perfect.During my travels, the Airlines were very impressed on the Quality, Materials, and Security features used on this gun case.Thank You,Miguel Jordan"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Geoff Jenkins",
          "Nb_Reviews": 7,
          "Date": "2023-12-10T03:39:02.000Z",
          "Titre": "Excellent safes, easy to use, good value, fast shipping",
          "Contenu": "Excellent products (I've now bought 2 safes, and several accessories), well made, good value, and delivered swiftly in excellent packaging. Easy to set up, and very effective."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brent",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T08:31:30.000Z",
          "Titre": "Awesome customer service",
          "Contenu": "Awesome customer service, when a package arrived with a missing piece, they sent it out right away. The total time on the phone with them was less than two minutes, no runaround. Thank you so much!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donald",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T17:47:41.000Z",
          "Titre": "Black Friday discount",
          "Contenu": "Black Friday discount.  Good pricing. Good product. Fast shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RReberJr",
          "Nb_Reviews": 5,
          "Date": "2023-12-12T04:24:46.000Z",
          "Titre": "Great Products - Excellent Customer Service",
          "Contenu": "I purchased three Vaultek products this year.  First two were everything I expected.  The third had a problem.  I sent Vaultek an email late Friday night and heard back Sunday.  They took care of the problem immediately and shipped a new safe to me.  After setup, I returned the problem safe.  Vaultek did everything I could ask."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kyle",
          "Nb_Reviews": 6,
          "Date": "2023-12-08T16:54:39.000Z",
          "Titre": "Awesome accessories like always",
          "Contenu": "Awesome accessories like always.  My safes are super almost as impressive as the contents of them.  Love vaultek and everyone always thinks they are awesome when I show them off."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick Woods",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T03:00:22.000Z",
          "Titre": "Support was excellent",
          "Contenu": "I contacted customer support to get a replacement part. I found out the item was not originally included with the item I purchased. Customer service responded quickly to my request and offered to send me the item at no charge.  I was very surprised and will definitely continue to buy the safes from this company. Couldn't be happier with the service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gabriel",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T19:31:25.000Z",
          "Titre": "All star gun case",
          "Contenu": "All star gun case, many compliments on the design and integrity."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Niko",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T22:08:48.000Z",
          "Titre": "Awesome safe",
          "Contenu": "Awesome safe! Battery life is great and the case itself is pretty strong. My only complaint is even with the app theres no way to see if the safe has been tampered with unless on the same wifi, which kind of defeats the purpose. However, solid product!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 6,
          "Date": "2023-12-08T18:16:06.000Z",
          "Titre": "No regrets",
          "Contenu": "The safe arrived sooner than expected. It was easy to install and set up. It is very customizable with the purchase of handgun/rifle storage options. The biometric operation is flawless as is the numeric keypad."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dylan",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T01:26:23.000Z",
          "Titre": "Quick shipping and quality safes",
          "Contenu": "Quick shipping and quality safes, all around good experience"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott R.",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T00:14:39.000Z",
          "Titre": "My first impressions of the Vaultek DS2i",
          "Contenu": "At first I was cautious at pulling the trigger on this safe because of the price as it was my first hand gun safe so I only had online pictures and reviews to go by. I am so glad I went for it! When it arrived I immediately felt reassured of the quality just by the weight of the box. The packaging was well done protecting the contents from any shipping damage that could have been done. The safe is truly a work of art and craftmanship. From the elegant, useful front display, to the top mounted fingerprint reader and 4 digit code input pad and wireless charging pad (for phones and smart watches), to the USB charging port on the rear, a lot of thought was put into this safe other than just storing your firearm safely and other important items. The steel construction is solid and sturdy. The user manuals are informative and very thorough. Upon unlocking the safe the drawer slides out quickly and smoothly. The padded interior provides protection for your gun and any valuables. The interior light is just bright enough to do the job. Pushing the drawer back in gives a nice satisfying locking click telling you that everything is secure. Mine is holding a fully loaded 1911 with a loaded spare mag and my EDC knife - a decent amount of weight - yet the drawer still operates like butter. The finger print reader works 99% of the time for me first time. I've gotten to know the exact angle to come down on the reader where it works best. My 4 digit code always works no matter how fast I press it. I also purchased the desktop locking surface mount which I will be installing along with the cable lock as well. I will defiantly be buying a second one to house my S&W .40 plus mags. The clock and phone charger will be a nice addition to my night stand!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Culver",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T04:30:37.000Z",
          "Titre": "Vaultek VTi storage for two guns…",
          "Contenu": "I purchased the Vaultek VTi because the interior dimensions allow storage for two handguns. My Glock model 45 and Walther PDP easily store inside with their magazines. Full size models fit too, as the Glock 17 and Beretta have extra room. The VTi has both number code and biometric entry, which open instantly. It's perfect for home storage. Although at 16 pounds I probably won't use it in the car for gun transport to the range. I ordered the safe online from Vaultek and delivery was 4 days later. I feel I purchased the best product available for safe gun storage."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AA",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T05:30:20.000Z",
          "Titre": "Not only is the product excellent…",
          "Contenu": "Not only is the product excellent, but I had the unfortunate luck of having the delivered safe stolen from the front of my building in NYC.  After calling and explaining the situation. The Vaultek team totally stepped up and worked with the parcel service and myself to resolve the matter and sent me another safe.  Great product and even greater customer service. Already bought a second safe for the lake house! You guys rock! I’m a customer for life! Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eugene Gonsalves",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T02:03:22.000Z",
          "Titre": "Great buy!!!!",
          "Contenu": "The price was great,shipping was fast and amazing.overall a great product"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T21:19:38.000Z",
          "Titre": "A Valuable Asset",
          "Contenu": "The simplicity of setting up the security code and security the safe provides."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andres Hernandez",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T05:35:22.000Z",
          "Titre": "Great product",
          "Contenu": "Great product, even refurbished product was like buy new, should of boughten one long time ago…"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brandon",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T01:56:55.000Z",
          "Titre": "Great Unit",
          "Contenu": "Great Unit!  Serves the exact purpose I need it for without the concern for little ones or unwanted guests getting their hands on the contents."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jae Rob",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T21:57:38.000Z",
          "Titre": "Vaultek Rules!!!",
          "Contenu": "You now have a loyal customer for life! I shipped you my 7-year old safe that would no longer hold a charge for repairs. And you guys were so generous and sent me a refurbished one that looks absolutely brand new! Thank you so very much and God bless! 😃"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T23:04:01.000Z",
          "Titre": "I saw videos on YouTube about how this…",
          "Contenu": "I saw videos on YouTube about how this brand of safes compared to others and decided to buy right after.The customer service is excellent and quick to respond. I'll recommend this brand to anyone looking for a great weapons safe company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Max",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T02:11:27.000Z",
          "Titre": "I believe in buying nothing but the best, cry once buy one",
          "Contenu": "I believe in buying nothing but the best!!! I own 4 Vaultex products. I plan on buying a few more. My philosophy is \" cry once, buy once!!! If you can't afford what you want from Vaultex.  Save up or sell something!!! LOL"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T23:10:42.000Z",
          "Titre": "Quality Product",
          "Contenu": "Very well designed and built. Functions exactly as advertised. The WIFI and features make this the best safe out there!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ronnel Diaz",
          "Nb_Reviews": 2,
          "Date": "2023-11-16T23:37:38.000Z",
          "Titre": "I have purchased 2 safes from Vaultek…",
          "Contenu": "I have purchased 2 safes from Vaultek and have been extremely pleased with the function and quality of the product. When I did run into a minor issue with the product, their customer service team responded quickly and I feel went above and beyond to help me out. Will purchase from them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rodney Bailey",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T20:53:36.000Z",
          "Titre": "I recently had an issue with a safe…",
          "Contenu": "I recently had an issue with a safe that my wife had gifted me, as its electronics had failed. But when I contacted Vaultek, the company that manufactured the safe, they promptly replaced it with a new one within a week. I really appreciate the quick and efficient service provided by Vaultek and will definitely continue to buy their safes in the future. Thank you very much, Vaultek!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T20:59:34.000Z",
          "Titre": "The lifepod 1.0 is just what I wanted…",
          "Contenu": "The lifepod 1.0 is just what I wanted plus the added pluck foam is a perfect fit for my Beretta PX4 full. With one magazine in the well and one to keep it company. Snug as a bug. If I really wanted to set up the pluck foam another way one could get a 3rd magazine to squeeze in. Overall very please with this purchase from Vaultek and shipping was delivered sooner than expected. 👍"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T17:41:51.000Z",
          "Titre": "Second Vaultek safe (first one is…",
          "Contenu": "Second Vaultek safe (first one is amazing) came a bit less than perfect. Customer service was EXCELLENT! Sent me a replacement next day , responded right away. Highly recommend . Great products and great service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ed",
          "Nb_Reviews": 2,
          "Date": "2023-11-18T15:15:11.000Z",
          "Titre": "Vaultek Lifepod XR Range Edition Safe - Outstanding!",
          "Contenu": "Before my purchase, although the website was very detailed, I had several questions about the product (mainly accessories that would match the safe I wanted to purchase). Support provided the info I requested promptly. The order process was straightforward and easy. Shipment came when promised. When my Lifepod XR Range Edition arrived, I couldn't have been happier with my purchase. The safe was easy to setup and program. The XR has a very functional design and perfect for my needs (ordered extra XT/XR pistol rack to swap out the provided mag rack to carry an extra pistol when needed). Along with the safe, I bought a spare security cable for my car and use this to secure the Lifepod XR every time I travel to the range. The provided security cable is used within the house. Overall, a great ordering experience and outstanding product. This is my second Lifepod (Lifepod 2.0) and my wife has a Lifepod 1.0 on the way. I would recommend these products highly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TL",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T08:01:07.000Z",
          "Titre": "Enjoy…the quality",
          "Contenu": "This is my 2nd Vaultek within a few yrs. Appreciate the quality & craftsmanship of the products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Staab",
          "Nb_Reviews": 2,
          "Date": "2023-11-16T21:15:15.000Z",
          "Titre": "Shocked By How Good Vaultek's Customer Service Is!!",
          "Contenu": "Absolutely blown away by the excellent customer service at Vaultek! I recently purchased one of the Vaultek Smart Stations and was having an issue with the charger. Customer service got back to me IMMEDIATELY to troubleshoot the issue, and offered a replacement to solve the problem. So good to see that customers still matter to good companies like Vaultek!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 6,
          "Date": "2023-11-22T21:26:42.000Z",
          "Titre": "Vaultek is great",
          "Contenu": "Vaultek is great! I took a misstep with the organizer, good product just not for me. The safes and the organization modules for my guns and magazines are awesome! Easy website. Would recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Pagano",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T16:22:34.000Z",
          "Titre": "Vaultek Slider safe",
          "Contenu": "I ordered the Slider safe for under my desk at my office and the product is excellent.  It opens fast and presents the weapon perfectly for an emergency situation.  After about 5 years of use I had a battery issue.  The customer service is even better than the product (which is hard to believe).  Grace promptly answered my emails and after some trouble shooting resolved my issue.  Amazing product and even better customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 2,
          "Date": "2023-11-04T02:56:39.000Z",
          "Titre": "This is an outstanding modern product",
          "Contenu": "This is an outstanding modern product. My main concern was safety and children. I don’t care about a fire or theft and wasn’t interested in a 300 pound huge box. This met all those requirements. Mine is bolted to studs in 3 places and connected to electricity constantly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edward",
          "Nb_Reviews": 4,
          "Date": "2023-12-13T17:21:04.000Z",
          "Titre": "Very nice product",
          "Contenu": "Very nice product, easy ordering and prompt delivery."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T12:58:56.000Z",
          "Titre": "5 stars",
          "Contenu": "Easy to order, quick delivery, great product!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T04:47:37.000Z",
          "Titre": "Great products and service",
          "Contenu": "I'm on my 3rd Vaultek safe and they make a great product.  I've had to contact support twice for questions, and each time they responded quickly with helpful answers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-10-26T15:22:08.000Z",
          "Titre": "Some of the best customer service I’ve…",
          "Contenu": "Some of the best customer service I’ve experienced in a while. I own three of their safes. One of the safes, the charge port stopped working and wouldn’t take charge after being installed for over a year. I called, left a message, received a phone call back within 5 minutes, had me email her the safe information, and later that day I was notified that they would be sending me a brand new updated version. Couldn’t be happier. Thank you to Grace at Vaultek."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edmund E",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T20:29:43.000Z",
          "Titre": "Great products and Customer Service",
          "Contenu": "Vaultek offers great products at a reasonable price and have amazing customer service.  They made everything easy and took good care of me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "O",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T14:29:12.000Z",
          "Titre": "The product was as good as expected…",
          "Contenu": "The product was as good as expected because I had purchased from them before. But what I didn’t know was how outstanding their customer service was. FedEx lost my package. I reached out to them. They were very understanding and together we resolve the issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Orrico",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T20:04:59.000Z",
          "Titre": "Everything was as promised and speedy",
          "Contenu": "Everything was as promised and speedy.  Very happy with the safe."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T02:59:33.000Z",
          "Titre": "A great safe at a very reasonable…",
          "Contenu": "A great safe at a very reasonable price. Shipping was ridiculously fast. This was my second vaultek safe, and I will definitely buy more in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Taylor",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T02:00:48.000Z",
          "Titre": "The customer service for Vaultek is…",
          "Contenu": "The customer service for Vaultek is very impressive. I had to play phone tag for a day due to the time difference on the west coast, but they were able to verify a problem with the lock on my Lifepod humidor and ship me a new one. I appreciate the quick response and quick resolution."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brenden",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T19:06:14.000Z",
          "Titre": "Morgan is an asset to the customer…",
          "Contenu": "Morgan is an asset to the customer service team.  Very courteous and professional.  It would be great if there was a hole on the side of the safe in which you could install a multi plug system for the inside in which you could plug-in cell phone charger or a dehumidifier"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joshua",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T16:51:52.000Z",
          "Titre": "Excellent product",
          "Contenu": "Excellent product. This is my 4th VAULTEK purchase. Products are great and helps provide the piece of mind that my firearms are easily accessible, but securely and safely stored."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donald",
          "Nb_Reviews": 3,
          "Date": "2023-11-01T04:08:38.000Z",
          "Titre": "Awesome Gun Safe",
          "Contenu": "I needed a way to safely have quick access to my pistol at home. We have kids so a safe was the best solution. The Vaultek Slider is the perfect way to keep your gun locked up yet have instantaneous access to it. The finger print scanner works every time and there’s the keypad as a backup. The WiFi connected safe lets you know if someone is trying to access your safe no matter where you’re at. I highly recommend Vaultek."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay",
          "Nb_Reviews": 2,
          "Date": "2023-12-03T18:13:44.000Z",
          "Titre": "Well made product",
          "Contenu": "Well made product, delivered on time, products worked exactly as expected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Milan",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T19:09:53.000Z",
          "Titre": "Great product",
          "Contenu": "Great product. Setup wasn’t that bad. It took me some time to realize the app set the clock time. Love the ease of accessibility both biometric and combination. Great piece for the night stand as I put the phone down on it at night and have wireless charging."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathon Nisenboum",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T17:17:37.000Z",
          "Titre": "5 Star Product",
          "Contenu": "Just an incredible product with amazing customer support to go on top of it!  These are the only Safes I will buy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "P Leal",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T18:28:48.000Z",
          "Titre": "I needed help to reset the Master Code…",
          "Contenu": "I needed help to reset the Master Code to pair a couple of slider safes to the phone app as I could not remember it. The support staff was very helpful but most of all extremely patient with me. Best customer service experience I have had in years. Great job Vaultek staff!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Darius Ellis",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T01:59:35.000Z",
          "Titre": "great buy",
          "Contenu": "This my second safe I really like this one  as well , I like all the features and the nano 2.0"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eddie",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T00:58:32.000Z",
          "Titre": "Great quality",
          "Contenu": "Great quality. Gifted it to a loved one"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John M.",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T17:57:52.000Z",
          "Titre": "Very easy to carry weapons while traveling .",
          "Contenu": "The ease of purchase, the communications with the support staff( answering all Emails within 2 hours or less. ) next time I’ll be dealing directly within their website (and not relying on Amazon. ) I purchased this mainly for travel, to keep guns safe and nearby. Not worrying about leaving them in truck overnight .Wish Amazon had all the models available , I had to purchase accessories to level up . Looking forward to next travel season to put to the test . It’s just the right size for carrying in and out of hotels etc. it was easy to set up, program etc. Instructions was easy to understand. Very well packaged for delivery. For a longer review I made see Amazon review section . John M."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Mcgarry",
          "Nb_Reviews": 5,
          "Date": "2023-11-24T22:31:48.000Z",
          "Titre": "Great hardware & great service",
          "Contenu": "Great hardware and great customer service. I have one for each of my cars, in case I travel somewhere that disallows my CCW."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T00:31:49.000Z",
          "Titre": "I had a latch break on my life pod…",
          "Contenu": "I had a latch break on my life pod safe. I ordered two and received two but they were for the 2.0 version so they were too wide. I emailed Vaultek. I got a response back within an hour half to 2 hours days they would send the original Lifepod latches to me as quickly as they can. To me, this is top-notch customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T16:49:06.000Z",
          "Titre": "Great design",
          "Contenu": "Great design. Fantastic way to store my firearm safely and still allow quick access to it.  I highly recommend their products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Manuel",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T19:26:18.000Z",
          "Titre": "Compact and convenient",
          "Contenu": "It works just fine and is compact so that you can move it around easily or place in a back pack or shoulder bag with no problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul M",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T20:19:32.000Z",
          "Titre": "Extraordinary Support Team at Vaultek",
          "Contenu": "I encountered an issue when attempting to change the pin on my Vaultek Life Pod. Despite following the instructional video and trying various troubleshooting steps, the reprogram button seemed unresponsive. I decided to reach out to Vaultek for assistance, and I was pleasantly surprised by their quick response, which came within a few hours, if not sooner.Todd and the support team at Vaultek went above and beyond to help me resolve my problem, even though my device was no longer under warranty. I'm genuinely grateful for the outstanding customer support provided by Vaultek, which led to a resolution in less than a week – to be precise, it took just three days to find a solution that left me extremely satisfied. I can't emphasize enough the exceptional level of service and support I received from the Vaultek team; they truly stand behind their products!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hector",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T11:50:17.000Z",
          "Titre": "Well made with quality materials and a…",
          "Contenu": "Well made with quality materials and a very nice design. It serves its purpose, holds my EDC firearm safe and secured right by my bedside. Good purchase"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frances Ordez",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T18:04:16.000Z",
          "Titre": "Exceptional customer service …",
          "Contenu": "I thought I lost the keys to my life pod safe. I found them but still couldn’t reset my pass code. thought I was doing everything I could. I reached out to Support three different times via email. They responded quickly to each one and asked me to send a video of what I was doing. When they realized that I was being an idiot, lol thatI wasn’t doing it right; they gave me step-by-step instructions on how to reset my pass code and it was so simple and it worked. I will definitely be purchasing more items I already own two safes from them. Thank you for being so kind, nonjudgmental thanks for helping me get through this stressful situation, happy shooting, pew, pew."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Travis",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T18:37:19.000Z",
          "Titre": "Great product",
          "Contenu": "Great product, shipped quickly, and good tracking information was provided promptly."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T14:55:40.000Z",
          "Titre": "The Vaultek lifepod2 humidor is…",
          "Contenu": "The Vaultek lifepod2 humidor is exceptionally well built, the packaging that it comes in is top notch. It really is a beautiful humidor. Very impressed and will buy from Vaultek again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Geoff",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T23:24:14.000Z",
          "Titre": "I’m very satisfied with my Vaultek…",
          "Contenu": "I’m very satisfied with my Vaultek safe. Would definitely order from them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JAKramer",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T19:31:43.000Z",
          "Titre": "Great product and great service!",
          "Contenu": "I purchased my RS500i safe and accessories online.  The online shopping experience is easy to navigate and understand.  Customer service is very prompt and helpful and clarified the one question I did have.  When I had a single accessory to return, the return process was equally easy and convenient.  All this plus a fantastic product will make me a repeat customer!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cary",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T14:55:56.000Z",
          "Titre": "I did a lot of research before buying",
          "Contenu": "I did a lot of research before buying.  Needed something simple and reliable that was not biometric for my wife.  This Vaultek Slider is exactly as advertised.  I am very satisfied with my purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T23:55:50.000Z",
          "Titre": "Gold standard",
          "Contenu": "What made my experience great was the customer service and the quality of the product. I purchased the Lifepod 2, sling bag, and the handle. My package arrived and it was all there except the handle. I called Vaultek and it was no problem at all. I had the handle in 2 days. Thanks for the awesome safe as well as the customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T11:42:59.000Z",
          "Titre": "Merch is top notch",
          "Contenu": "Merch is top notch. Solid construction. Nice design.  Le service client est bon."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T17:22:30.000Z",
          "Titre": "Barikade Series 2",
          "Contenu": "Barikade Series 2.  Absolutely a great product for the price point."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T16:18:27.000Z",
          "Titre": "VS10 essential",
          "Contenu": "Item arrived in perfect condition and works perfectly.  Good price for refurbished item. Very happy with the safe"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Schaper",
          "Nb_Reviews": 2,
          "Date": "2023-11-12T18:26:21.000Z",
          "Titre": "Vaultek Lifepod 2",
          "Contenu": "Awesome safe. I own a couple. Great for traveling. Fits under the seat of most cars and trucks. Many compliments from TSA when checking in at airport."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SQ",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T16:03:10.000Z",
          "Titre": "Awesome shopping experience",
          "Contenu": "Awesome shopping experience. Great instructions and I am pleased so far with the product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Derek T.",
          "Nb_Reviews": 7,
          "Date": "2023-12-07T22:55:51.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service - Easy to follow instructions and the products work as advertised"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gavin",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T21:42:00.000Z",
          "Titre": "Top notch products",
          "Contenu": "Top notch products, I own 4 Vaultek safes. They responded to my emails very quickly. I recommend them to anyone who will listen."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Sonny",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T15:12:39.000Z",
          "Titre": "A Stellar Experience with Vaultek",
          "Contenu": "I recently had the pleasure of interacting with the Vaultek Support Team, and I must say, the experience exceeded my expectations.From their prompt responses to their dedicated assistance, the team made the process of getting a replacement for my Vaultek Lifepod effortless. The replacement arrived quickly and seamlessly. What impressed me most was their understanding and accommodating approach.I highly recommend Vaultek for their exceptional support and top-quality products. If you're looking for peace of mind and excellent service, Vaultek is the way to go.Thank you Vaultek Support Team, for making safety and security accessible and hassle-free."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 3,
          "Date": "2023-11-18T17:59:13.000Z",
          "Titre": "Needed service on five year old safe",
          "Contenu": "Needed service on five year old safe. Repaired and returned in about a week. Now like new. Excellent service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lou Scotto",
          "Nb_Reviews": 2,
          "Date": "2023-12-03T23:07:23.000Z",
          "Titre": "Amazing Safe",
          "Contenu": "Amazing safe! Extremely well made and love how easy it is to use. Holds everything perfectly and looks great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Liz",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T13:11:45.000Z",
          "Titre": "Exactly what I needed",
          "Contenu": "Delivery was quick and product quality is top-notch. The LifePod is exactly what I needed to secure my weapon during travel without taking up too much space."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "nicholas",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T04:37:43.000Z",
          "Titre": "I purchased the safe from M2 tactical…",
          "Contenu": "I purchased the safe from M2 tactical in Norwalk Connecticut. The guys are great to Xpress and show the benefits of the safe. Brought it home. Set it up quickly with no problem. And just love its features."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Notey",
          "Nb_Reviews": 3,
          "Date": "2023-11-12T14:45:19.000Z",
          "Titre": "The products are innovative and amazing and the customer service is above and beyond!!!",
          "Contenu": "The products are innovative and amazing and the customer service is above and beyond!!! I highly recommend Vaultek products and I now own 6 not including accessories."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Peter",
          "Nb_Reviews": 2,
          "Date": "2023-10-28T00:23:44.000Z",
          "Titre": "Product shipped early one of the best…",
          "Contenu": "Product shipped early one of the best faith I've ever bought looking at buying another one and some more of their products they're made of a good quality I like how portable it is to be able to take you to a hotel or bolt it to the wall at the house great product"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cindy Groom",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T15:22:21.000Z",
          "Titre": "I was very pleased with thr quick and…",
          "Contenu": "I was very pleased with thr quick and thorough service the Vaultek team gave me. Love my safe and happy with the biometric fingerprint use in particular. It works well!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JT Fuller",
          "Nb_Reviews": 2,
          "Date": "2023-10-23T17:03:58.000Z",
          "Titre": "Great Safes, point BLANK!",
          "Contenu": "Fast shipping and item like always was packaged w/ great detail. Easy to follow setup instructions. Quality safes!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T19:33:33.000Z",
          "Titre": "Repeat buyer",
          "Contenu": "Purchased a lifepod a couple years ago and they are so fun and easy to use. Have 2 now. Looking forward to owning more."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gilbert Davis",
          "Nb_Reviews": 2,
          "Date": "2023-10-09T15:59:13.000Z",
          "Titre": "Easy to navigate the website",
          "Contenu": "Easy to navigate the website, and ample stock on items that I was looking for. Easy to purchase, great communication, fast shipping. Product arrived in excellent condition, functions as designed, meets or exceeds my expectations. Will continue to purchase from Vaultek!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deborah",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T01:48:11.000Z",
          "Titre": "I love the convenience of having the…",
          "Contenu": "I love the convenience of having the clock, phone charger and safe compact and aesthetically pleasing. It opens quietly and was very easy to set up."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T21:17:10.000Z",
          "Titre": "I stock quick deliver"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "THomas Noon",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T01:59:52.000Z",
          "Titre": "Works as expected.",
          "Contenu": "Delivered on time.  In good condition.  Works as expected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T23:27:15.000Z",
          "Titre": "Shipping was fast and the product is well made.",
          "Contenu": "Shipping was fast and the product is very well made. I love the color. I was looking for a gun safe with a biometric lock and key for backup. But most of all I love that you can use a cord to give the lock enough juice to use if the battery dies."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shaun Booker",
          "Nb_Reviews": 3,
          "Date": "2023-11-23T12:43:11.000Z",
          "Titre": "My 3rd Vaultek",
          "Contenu": "This was my 3rd Vaultek product and it surely won’t be my last!  As usual really amazing products that are truly worth every penny!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Avraham",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T06:06:41.000Z",
          "Titre": "Great products",
          "Contenu": "Great products - as described. Wasn’t disappointed."
        }
      ]
    }
  ]
}