{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "webador.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Jakob Mikkelsen",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T14:15:18.000Z",
          "Titre": "Just stay away!",
          "Contenu": "I’m not even called a customer service or support because you ask in One Direction and they replied to you in another direction and don’t answer your question or help with your troublesI have two got a domain delete it from the account because they not want to make a bottom for that but that’s too difficult to make for them, so they want extra moneyI think the easiest way for me is to go to my bank and get a chargeback because this company is one big scam and I will not recommend anyone to deal with this company when the support is so slowly and so terrible."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Megan Reed",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T07:51:48.000Z",
          "Titre": "\"WHAT WENT WRONG THIS TIME\"?!",
          "Contenu": "\"WHAT WENT WRONG THIS TIME\"?!? That's a scary question! So, webador has things going wrong all the time, like it's the norm with webador?! My experience, so far, is horrible!!!! I have 2 websites with them and BOTH are websites are not working NOT PUBLISHED, I've been lied to about what has been done to rectify my problem, when it hasn't. I started in September with my websites so they'd be up and running for the holiday season and I'm still experiencing trouble and problems! I do not recommend webador to anyone. I'm thinking that's why \"no telephone numbers\" because of the losy service! They don't want hear anything from the public! If you don't want a headache STAY AWAY!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Norbert Bercsényi",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T13:18:13.000Z",
          "Titre": "DO NOT USE THEIR SERVICES!",
          "Contenu": "DO NOT USE THEIR SERVICES!A. IT'S THE WORST WEBSITE BUILDER I EVER SEEN. B. SUPPORT NON-EXISTENT.WHEN I SLAPED THEM WITH A CEASE AND DESIST THEY CARRY ON REGARDLESS TRY TO CHARGE ME FOR 2$ MONTHLY ALTHOUGH I CANCELLED SERVICES AGES AGO. THE WHOLE COMPANY IS A SCAM!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mr P S Bush",
          "Nb_Reviews": 17,
          "Date": "2023-11-28T15:43:48.000Z",
          "Titre": "Proceed with caution",
          "Contenu": "The Web builder is OK but that s where it ends..  customer service non exsitant proceed with caution.  The Web builder had an issue (would not show my domain name purchased else where) and despite 5 separate (email and whatsapp) contacts did not have professionalism to reply, and forget trying to call them....I suspect it's because they want to add cost to me when they fixed it and no doubt blame me !!  I had to settle for a similar but not suitable option as they say \"60 days to register if purchased else where\" if I knew that up front I would not have bothered at all..."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Kimi K",
          "Nb_Reviews": 6,
          "Date": "2023-11-30T09:08:42.000Z",
          "Titre": "No consumer protection. Will steal your money unfortunately",
          "Contenu": "DO NOT GET INVOLVED. signed up for a trial and then had no notice of £30 being taken ongoing, when notifying them they will make it very clear they have no protection for customers and therefore do not offer Refunds. Do not get tricked...Update: no I did not agree to any further subscriptions, and I was charged £24.95. Don't use this space to make the person you have stolen from also then seem the one at fault. How dare you. Your company has very bad ethics."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "james peck",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T17:39:35.000Z",
          "Titre": "I have had a website \"jpeck.info\" with…",
          "Contenu": "I have had a website \"jpeck.info\" with Webador for about four months now and it has never been searchable and is invisable to the public."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Rebekah Joanne",
          "Nb_Reviews": 13,
          "Date": "2023-11-02T15:44:01.000Z",
          "Titre": "The issues I have was with billing and…",
          "Contenu": "The issues I have was with billing and trying to cancel is almost impossible. To find anyone to contact is really hard, the only way is to email and wait a week for a response. This review has been removed twice now, this is my honest experience, and am sick of being silenced. If you want to cancel your plan on 1st of April, your billed for 1st of May too & the plan doesn’t cancel until 21st of May. It just feels immoral and your not valued, its more about the money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Peter Allen",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T12:10:21.000Z",
          "Titre": "Sorry but I can't recommend this site",
          "Contenu": "Sorry but I can't recommend this site. The design part is easy. My issue was the quality of the images I uploaded and billing. My images looked great on the builder and on other sites I was using, but were grainy when I launched the website with Webador. Billing is a scam. I cancel my subscription which I understand they stated a one-month notice. What I didn't know was they were charging me for a full billing cycle and 28 days because I had just paid. In total my cancellation is nearly 2 months. Never dealt with that before. I will just email my bank and they will take care of it for me.Update after Webador's response: I have emails that went both ways talking about the quality of images. No sure they stated they didn't have communication on this subject. They still are charging me for nearly 60 days. Hiding behind fine print doesn't make it right. I didn't want to leave this review, but I also don't like when companies' penny pinch customers. Other web builder companies I've used cancel and refund me the day I cancelled."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T11:16:11.000Z",
          "Titre": "Everything has gone terrible",
          "Contenu": "Everything has gone well, I’ve not got many blog views though but I don’t think you can do anything with that, nothing comes to mind when I think if it needs anything more,Edit:My website has stopped working, if I want to view it as a user, it says ‘this website is unavailable’ but I haven’t done anything to cause this, so my star rating, im sorry but has to go down, because this has quite ruined my website and I am unable to find a good replacement and cannot fix this."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "HappySmile",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T12:09:39.000Z",
          "Titre": "Bad links that ruin the experience. Do Not try.",
          "Contenu": "Before 2023, free websites had customizable links, like « smile.webador.com » and that made Webador so good. Today, they decided to remove that, and that’s ruining the experience of every user. Here´s an example : free123987.webador.com. I do NOT like Webador now, and i don’t advise you of using this."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Simon White",
          "Nb_Reviews": 8,
          "Date": "2023-09-19T07:20:56.000Z",
          "Titre": "being asked for lots of personal data and site issues",
          "Contenu": "I was sent an email given the name of a company Nominet and told I could contact them direct to sort out problem. It seems that Webador had uploaded my data incorrectly EG my address.Nominet were very good and helpful over the phone. Sorted problem just waiting for Webador to sort their end now.Having all sorts of issues with my recently acquired conservation website. Being asked for a lot of personal data and told to reset parameters that I don't understand. The webador site says 1 Choose a domain & register #2 Select a design #3 Create your homepage #4 Publish! Your own website? Piece of cake. Choose Webador's affordable, no-nonsense website builder.Its not a piece of cake in my experience. I have a business account so I can load vids at a cost of £200. That for me is expensive and my site doesn't work some of the time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sydney Fashion Boutique",
          "Nb_Reviews": 5,
          "Date": "2023-11-08T02:55:22.000Z",
          "Titre": "Major email problems.",
          "Contenu": "I am updating my positive review for a negative. I have lost so much business because emails simply don't come through and my customers purchase through me on a site that takes 20% commission. I have contacted webador a few times now with numerous issues but the main one is the emails. You cannot run an on line business without emails. I am so annoyed after spending a lot of time putting the site together. It was the last straw today when I sent emails from my personal email to the business email and those didn't come through either. I did this after yet another customer sent me a message on another platform and complained that I wasn't replying to her order or emails. VERY ANNOYED."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mike Ismail",
          "Nb_Reviews": 1,
          "Date": "2023-01-24T16:24:29.000Z",
          "Titre": "Avoid Avoid Avoid very bad service and…",
          "Contenu": "Avoid Avoid Avoid very bad service and when you cancel they still taking money out of my account, untrust worthy company.I have opted to their offer of the 1st three month for £0.99 each month and promise they have a good customer support, however, they started to charge me £1.20 each month and when I asked for support and I did not get to communicate with a real person but with Bot and can't understand my issue. after feed up with service, I cancelled my account and 3 weeks later they charged me again. that way I believe that they not a good company all they want is your money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Journey",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T17:18:34.000Z",
          "Titre": "This company is horrible",
          "Contenu": "This company is horrible.  They are not knowledgeable enough to help me solve my hosting problem, so I have asked for a refund (within a 30 days) and they will not refund my money.  They have close my service, but not issued a refund.  Do not use this company! Stay away! Customer service is slow and don't know what they are doing.The people writing 4 and 5 star reviews must be the employees."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mel",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T15:18:05.000Z",
          "Titre": "Very disappointed ordered and then…",
          "Contenu": "Very disappointed ordered and then canceled within ten mins because I found it cheaper by 30 dollars and now they won’t refund. Won’t use them again and will let others know. Not happy at all."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Almansor Almansor",
          "Nb_Reviews": 2,
          "Date": "2023-09-18T23:35:11.000Z",
          "Titre": "Beware customers",
          "Contenu": "I recently had an unfortunate experience with Webador customer service . Despite sending them a cancellation notice a month ago, they still charged me for another month. To make matters worse, they refused to provide a refund when I requested one. It was only after I contacted my bank that the issue was resolved. This lack of customer service and unwillingness to rectify their mistake was highly disappointing. “Beware customers”"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kimberly Childress",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T01:06:42.000Z",
          "Titre": "Worst website issues! I have found a great website and it is…",
          "Contenu": "I have found a great website and it is $32 for the year, This site is not useful to me but the reason behind a 1 star is them claiming trial and this is not true. They stick you to 90 days from the first day. They hassle about cancelation and charge your card before due but also without permission. They do not include accurate details in their video section was the reason for me leaving but again how they handled it made it clear they are not doing so well financially. So when you view about sexual content, it shows what they do not allow which you will see reading it yourself til they get smart and put no sexual content. It states many things but not that.I was going to keep one of my paid websites but canceled both since they are unprofessional and dishonest. My bank stopped them 3 times so far and they still send me invoices that I can show even after this review like last week."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T15:08:07.000Z",
          "Titre": "Lacking in basic functionality.",
          "Contenu": "I could not link to Twitch and my main social sites using any kind of icons. Make sure your primary social platforms are included, as you cannot add custom links to any social bars."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ashley Hudson",
          "Nb_Reviews": 1,
          "Date": "2023-04-14T20:26:57.000Z",
          "Titre": "Be Careful... Read closely before signing up... Very poor customer services...",
          "Contenu": "Be careful.  Webador's wording for there packages are deceptive.  If they are smart they may have changed the wording by now.  I received a refund only after they denied me and I filed a claim with Paypal with a screenshot and Paypal agreed with me.  If you have an issue with anything with Webador, it will take an act of Congress to get any help.  By the way, I received a quicker response from posting this review than when I was dealing with my issue."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alisha K",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T17:06:04.000Z",
          "Titre": "Buyer Beware; No Refunds",
          "Contenu": "Buyer beware before you give them your money; BAD BUSINESS; I purchased the lite plan after trying the web builder they let you try before you buy. I liked the builder (it is slick) so I thought I'd try it but didn't realize that the lite plan didn't include even the most basic features of the builder I had been playing with.  Only after I purchased, the HUGE webador banner was placed in the body on every page and I saw that what I would consider basic elements couldn't be added to pages. I wanted to cancel right away and they would NOT refund my annual plan purchase even though it had been less than 24 hours and I was very clear about why I was unhappy with the product.  The 'support' is only by email and they told me to upgrade for a basic thing like putting links in my pages...Basically double the price for HTML links - really? We emailed back and forth a few times and they wouldn't budge.  I now walked away feeling like I was taken and told them I was going to leave a negative review to warn others.  There are better, cheaper options out there so don't do business with a company that takes your money and runs."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Barb Miklo Hunt",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T16:41:09.000Z",
          "Titre": "I feel they are fraud",
          "Contenu": "I signed up to this service and had to pay to get what I needed.  As soon as this happened I realized I had to use their credit card processing.  I cancel right away and was told no refund.  I would like my 162.oo refunded as I can not use this service.  They are hard tp deal with and no phone.  No great support, buyer beware.  After reading more reviews, I realize I am not the only one that got scammed.  Do not touch this site.  No support and see that now."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Almansor Almansor",
          "Nb_Reviews": 2,
          "Date": "2023-08-14T16:55:29.000Z",
          "Titre": "cancellation policy",
          "Contenu": "I had a disappointing experience with Webdar. They refused to refund me because I didn't give them a one-month notice. Their lack of flexibility and understanding left me dissatisfied. I would caution others to review their refund policies before using their services."
        },
        {
          "Note": 1,
          "Lieu": "GR",
          "Pseudo": "Stelio SS",
          "Nb_Reviews": 4,
          "Date": "2023-01-18T16:45:58.000Z",
          "Titre": "The most worst experience",
          "Contenu": "The most worst experience, unproffesional customer support. After i contacted them to cancel my subscription plan they are still charging the money every month! Be aware."
        },
        {
          "Note": 1,
          "Lieu": "UG",
          "Pseudo": "owner of Kt Onlinestores",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T09:15:01.000Z",
          "Titre": "First and foremost there's no option…",
          "Contenu": "First and foremost there's no option for Ugandan Currency , 2ndly you cannot add themes of your choice and other things"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Elysium Motors",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T08:22:51.000Z",
          "Titre": "My Webador Webshop service has been…terrible!",
          "Contenu": "My Webador Webshop service has been having issues for the last 5 days. My costumers cant complete a checkout because it has a internal error with address verification. I sent numerous emails to the support team, even email multiple screenshots  complaints I received from costumers trying to place orders and the website is not letting them....  Costumer Support told me they were going to work on it, its been 3 days now with no response. I must have sent them over 10 messages trying to get someone to help me.... this company has no real live costumer support and it makes it very frustrating to handle issues like I am having by going back and forth with emails and NOT getting the issue fixed!the website is very easy to set up and simple to use... BUT if you running a real business and ever come into any issues with the site or your Webshop its going to be very hard and frustrating getting the problem fixed and getting a hold of someone.its 2023 .. every business should have a costumer service phone number and be able to fix paying costumers issues on the fly...  everyday they take their sweet time to resolve this issue.. is COSTING MY BUSSINESS THOUSANDS OF DOLLARS and they don't care about it very frustrating... i would recommend using a website host that actually got a phone you can call when you have issues... TRUST ME AT SOME POINT YOU WILL NEED SUPPORT AND THEY WILL FAIL YOU.... JUST LIKE THEY DOING TO ME NOW. I'm not a person who writes negative reviews on anyone's business BUT THIS IS MY HONEST OPINION ON HOW I FEEL RIGHT NOW!"
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "IntroGamer",
          "Nb_Reviews": 1,
          "Date": "2023-09-17T15:42:59.000Z",
          "Titre": "I DOESN'T WORK ON ANDROID",
          "Contenu": "Why don't it Work on android NOTHING WORKS ON ANDROID TABLET I DO NOT RECOMMEND THIS"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Laura Smith",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T16:22:49.000Z",
          "Titre": "Webador Steals Money for Hosting Other Peoples Sites and wont let you cancel",
          "Contenu": "I was hosting sites through Webador, trying to build up a business. But, when other users failed to pay their bills, WEBADOR shut off my service access despite my bills, even for a WEBSITE DOMAIN THEY DON'T OWN, I OWN IT ON ANOTHER PLATFORM! They are strong-arming me by refusing to let me move my domain name off of there, and they have no way to cancel the website on the platform and no customer service you can talk to they hide behind the computer and steal your money!EDIT: Despite numerous emails to Webador, they refuse to let me transfer the domain I own, and I have paid for, and am current on, because they are trying to charge me for other websites,  There is no option to cancel the webpages on the site, and despite having sent them a request asking them to remove the websites from my account, they continued to bill me and they are refusing to allow me to transfer the hosting until I pay for sites that went unused, even after I told them I no longer wanted the sites.  Again, they are also still billing me for a site they don't own and do not host, 4trust4equity.com. This lady wants me to pay for unused sites that she has refused to cancel despite requests to do so, the site is still on there and she is still charging me for all of them, even cancelled ones."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "A Great Agency",
          "Nb_Reviews": 2,
          "Date": "2023-06-16T02:47:34.000Z",
          "Titre": "I want to like Webador but simply cannot…",
          "Contenu": "I want to like Webador but simply cannot. Anything I need their answer to me is generally “no”. That cannot be done, or they make me email people with in their own company to fix my concerns. The worst part is if I leave they own my domain names. I have one I cancelled 6 months ago, and it still has not been released to buy it on another platform. I have to keep old employee emails, or I won’t be able to get my companies emails, if mail gets sent to an old team member. It’s a miracle to me that Webador has so many great reviews. I just feel like I’m stuck, and never should have started with them to begin with. Worst bureau, worst services, worst platform.June 15, 2023 ( response to their reply) I am not able to reply to what Webador replied to me however I can add to my comment. I am a Pastor. I have no reason to lie. I stand by what I said as the truth. I have proof of them asking me to contact other departments with in there company. Who has time to sit here and make up lies, and to post fake reviews. I did this because I know what has happened, I will testify on a stack of bibles, and my answers will not change.I hope our relationship improves with time. I will respond to their email sent to me however it took me posting a review to get some kind of thought felt, I care interaction. Thank you."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T06:33:23.000Z",
          "Titre": "I sent this site to my uncle and he…",
          "Contenu": "I sent this site to my uncle and he said your websites aren't secured."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Juanita Ramos",
          "Nb_Reviews": 2,
          "Date": "2023-02-18T22:54:13.000Z",
          "Titre": "lock of service",
          "Contenu": "The company is fast to charge payments but locks integrity when helping clients."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-07-30T17:01:12.000Z",
          "Titre": "Inexcusable Conduct",
          "Contenu": "I purchased a domain through this company because they seemed to offer a good deal. However, upon getting access to my domain I realized I have very limited access to the DNS. The website builder is a joke and does little to offer any sort of actual customization. I was forced to purchase another domain in order to conduct my business and use the Webador domain as a redirect. Because their DNS is laughable and restrictive, I had to find alternate routes in order to do a basic redirect. For this reason, I anticipated when the time my domain became available for transfer (60 days after registration) and I was aware they had a 30-day cancellation period. After submitting my cancellation request, someone from their company comes back via email (yes, only way to contact them), and tells me that I must wait 90 days to transfer my domain, and that it has been sent to some other host and is no longer in their possession. I also received an automated email confirming that apparently, despite the domain being registered to me and inaccessible to me, it is fully accessible to anyone else who would like to obtain it. Then, a completely different representative from the company sends me a follow-up email and explains that her colleague was incorrect about some of the things conveyed, and correct about others. What initially was supposed to be a simple purchase has now turned into a 3-month headache that has the potential to cause damages to me and my business as stated by them my property has the potential to become possessed by a 3rd party entity.Now, if any of this has you confused, you're not alone. Clearly the business called Webador has no idea what they're doing either. They conduct business in a manner that is incongruent with their competitors, provide services that are laughable at best, and then force inconsistent and inexcusable policies on their customers.In short, I highly recommend you conduct business elsewhere, with a reputable and trustworthy company as this one in particular will bring nothing but headaches and difficulties."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Patty Davi",
          "Nb_Reviews": 4,
          "Date": "2022-10-18T19:30:25.000Z",
          "Titre": "For two weeks I was waiting to see find…",
          "Contenu": "For two weeks I was waiting to see find and see my website but although I search many time I never found it therefore I believe you are scammers and criminals.  You do not have phone number or a easy way to communicate with your clients or subscribers so this smells \"FRAUD\" to me"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Amaka Ananti",
          "Nb_Reviews": 4,
          "Date": "2022-11-01T15:38:03.000Z",
          "Titre": "USE WIX OR ANYTHING ELSE - When you’re fed up with the lack of support and complain they tell you they don’t need your business",
          "Contenu": "This is an update of my last review. As you can imagine, waiting four months I felt completely deflated by lack or responses and a lack of solution. I felt that the person that I had been dealing with was incompetent, so I complained (not that they have any complaints procedure in place). I then got an email from the CEO saying he had read the emails (clearly not), said he’s staff we’re polite (I never complained that they were rude- just incapable of problem solving) and he asked me to take my business elsewhere and that if I chose to stay using their services I won’t receive any support from them. Not sure if it was my complaint or my trustpilot review that did it. A lovely way to help your customers and allow them to feel seen when things are clearly not going right. Would definitely NOT RECOMMEND"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "marion",
          "Nb_Reviews": 1,
          "Date": "2022-10-12T11:07:44.000Z",
          "Titre": "Thought I was paying for a website for…",
          "Contenu": "Thought I was paying for a website for clientele to browse, purchase products list as many products as I like message & be able to contact me. What I got was a web page! That was it if I wanted anything else I had to “UPGRADE” everything these days is always “EXTRA MONEY” if you want this ooh extra money ooh or this extra money bit of a joke! Easy enough to use & set up but the extra money when your starting out a business is expensive especially when your already in minus payment from stock buying and your creative time spent which you are not getting paid for."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "owner of International Educati",
          "Nb_Reviews": 1,
          "Date": "2022-11-21T22:07:19.000Z",
          "Titre": "Very bad experience I just want my…",
          "Contenu": "Very bad experience I just want my money back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "zach Tomblin",
          "Nb_Reviews": 1,
          "Date": "2022-07-30T07:53:55.000Z",
          "Titre": "Don't use this service",
          "Contenu": "Don't use this service. They do you wrong every chance they get. They will lock your account and continue to take your monthly payments but won't let you access your website or publish it on the internet and then refuse to refund you your money. They are thieves and have a terrible customer service that you can only email. No other way to contact them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jean Bird",
          "Nb_Reviews": 1,
          "Date": "2022-07-29T11:38:11.000Z",
          "Titre": "Good luck ending your account with them.",
          "Contenu": "Good luck ending your account with them. They have no problem closing an account. What is not explained is that upon closing your account you will be required to pay the final bill through PayPal. What I am trying to get them to explain is how to do this. I don’t have a PayPal account of my own, how do I pay them? I want to pay them and have offered different ways to pay them. Each method has been rejected. They want me to use PayPal."
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "Julio Aragonez Guerrero",
          "Nb_Reviews": 3,
          "Date": "2023-03-16T01:09:56.000Z",
          "Titre": "Is not working and training charges for"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Darryl",
          "Nb_Reviews": 1,
          "Date": "2022-04-11T00:52:10.000Z",
          "Titre": "Horrible I will never ever refer refer…",
          "Contenu": "Horrible I will never ever refer refer anyone to you you do such bad business. I was truly unsatisfied totally disappointed I'm professionalism going by the feelings and not business. So please do not write me again send me a text do not send me a email Instagram nothing nothing I won't nothing to do with you."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "lucious",
          "Nb_Reviews": 1,
          "Date": "2021-12-09T23:28:02.000Z",
          "Titre": "I can’t receive or send email from my…",
          "Contenu": "I can’t receive or send email from my business account, I would need to go to webador email to send email and to check if I received any email, I want to be able to click on to my business account email to send or check email  and not go through a long process by going through the webador email.I had hoped to have this issue resolved but I don’t., I don’t receive notification from the webador email that I have mail, I have to constantly keep checking."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jay Spann Sr.",
          "Nb_Reviews": 1,
          "Date": "2021-11-13T02:25:26.000Z",
          "Titre": "I have told these people OVER AND OVER…",
          "Contenu": "I have told these people OVER AND OVER to quit slamming my account.  THEY HAVE BEEN TAKING 32.50 PLUS 0.98 INTENATIONAL CHARGES FOR A YEAR NOW AND CONTINUE TO DO THIS CONS!!!!  RIP=OFFS!!!!  DO NOT GIVE THEM YOUR BANK ACCOUNT ACCESS!!!!  UPDATE:  After emailing over and over, THEY STILL ARE DOING IT."
        },
        {
          "Note": 1,
          "Lieu": "CY",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2021-02-10T12:25:49.000Z",
          "Titre": "Disapointing",
          "Contenu": "I am sorry but I am so disapointed with webador. The platform works fine for a online shoping website, not many features but for a beginner it is enough. But the customer service is terrible. They don’t have a call center, they provide assistance only trough mail and they respond very late and the responses are not helpfull at all... problablly, if my webshop will grow, I will move to a better platform..."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Georgia",
          "Nb_Reviews": 2,
          "Date": "2021-03-21T08:10:09.000Z",
          "Titre": "Unfortunately came out to be the worst…",
          "Contenu": "Unfortunately came out to be the worst expiring ever. These people asking you to pay for a renewal subscription even if you don’t want it anymore. I wanted to use this website for one year and now only fees days before the last day they are referring to one month cancelation notice!! While sending me the invoice of 107,10€ . The funny thing is I no longer have the website active, means I lost all my blog. This is not an ethical way to earn money."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "user",
          "Nb_Reviews": 3,
          "Date": "2021-03-29T01:07:25.000Z",
          "Titre": "My reason for such a low mark is…",
          "Contenu": "My reason for such a low mark is because your site could not give me the information that I required for my website. I listened to your advice and did what you said but nothing there that was near enough for what I wanted. Please do not send further emails as I am no longer interested in setting up a site with yourselves"
        },
        {
          "Note": 1,
          "Lieu": "GR",
          "Pseudo": "George Kladakis",
          "Nb_Reviews": 1,
          "Date": "2020-07-24T16:17:07.000Z",
          "Titre": "VERY TERRIBLE SUPPORT - SCAMMERS",
          "Contenu": "Very terrible support, i have a paypal and they dont tell me how i can pay with paypal, yet in the website i cannot find any way to pay with paypal, they keep sending me invoices that i need to pay and they keep raising the payment by 10$ like almost every day! They are scammers, they are trying to scam people, and their membership is a trap! Do not buy from them! TERRIBLE PEOPLE!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "user",
          "Nb_Reviews": 5,
          "Date": "2020-08-09T18:49:30.000Z",
          "Titre": "Greedy!",
          "Contenu": "Greedy!I stopped using webador and made my website on wix. When I connected to SEO and searched my website on google the first result is my webaor website. So then I deleted all my websites on webador and deleted my account. Then I searched my website up again and saw that the webador one is still there. I clicked on it and it was full with webador ads! Greedy! Even I thought webador was the right platform to grow my buisness!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Theresa  Forrest",
          "Nb_Reviews": 6,
          "Date": "2020-07-14T06:27:56.000Z",
          "Titre": "second review",
          "Contenu": "I recently shared a review as I couldn't get to my nearly finished website because of a red warning, unsafe page but I took down the review after this was fixed. Not sure why I can see the main webador website sometimes or I have to actually go through the link on this page with trustpilot.  I have contacted regarding my site being published and haven't heard anything. What is going on? I am still unsure"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Don Witton",
          "Nb_Reviews": 1,
          "Date": "2021-02-02T22:10:24.000Z",
          "Titre": "After some initial difficulties",
          "Contenu": "After some initial difficulties, I have found creating text and images OK but my finished web site design will not upload on to the web. I pressed the green publish button and nothing has happened. When I tried again my only option is to upgrade which will cost money. My web site is a not for profit hobby web site only and I don't want to start paying fees. I sent an email asking for help but have heard nothing. Webador offer a basic free web site but in my experience they are only interested in the fee paying professional and business customers."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marisa",
          "Nb_Reviews": 1,
          "Date": "2021-11-23T03:03:19.000Z",
          "Titre": "My website isn't available",
          "Contenu": "My website isn't available, hasn't been available for a month. There's no valid reason why. The transfer of domain process is horrible and the fact you cant reach anyone by phone is not acceptable for good business practice."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Kostakis Constantinou",
          "Nb_Reviews": 1,
          "Date": "2021-01-29T13:09:02.000Z",
          "Titre": "By a blog virgin",
          "Contenu": "Easy to use with an extensive set of stock photo images. I haven't even started to fully exploit the power of this but I already know it's going to be productive. Specifically, the inclusion of text, images, video in the body of a page are intuitive and grasped quickly - edit is equally rapid and the updates are going on in real time so there's no hesitation in correcting typos and such. All of this in a seamless environment which is very appealing graphically. And then I was just locked out and the system doesn't recognise my email address - a disaster"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cushena",
          "Nb_Reviews": 1,
          "Date": "2021-12-05T21:03:09.000Z",
          "Titre": "Customer Service stinks",
          "Contenu": "I paid for service that in cannot review. I made a website and wasn't able to finish at the time but when I came back it was gone. Tried to contact support and I still have yet to speak to someone and it's been a month."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Salvatore",
          "Nb_Reviews": 6,
          "Date": "2021-02-09T16:29:41.000Z",
          "Titre": "Such a lack of tools on this website",
          "Contenu": "Such a lack of tools on this website, if u looking for catering business I would suggest to avoid webador...Also I’m having an issue to receive online orders, and seems no body cares. How I supposed to work like that..Very very disappointed, disgraceful service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "owner of T V WATER SUPPLY CORP",
          "Nb_Reviews": 1,
          "Date": "2022-11-18T23:53:32.000Z",
          "Titre": "Just found something betterPlease stop my",
          "Contenu": "Please stop mySubscription"
        },
        {
          "Note": 1,
          "Lieu": "PL",
          "Pseudo": "Kaisar",
          "Nb_Reviews": 1,
          "Date": "2021-08-24T14:02:02.000Z",
          "Titre": "This company tries to dictate…",
          "Contenu": "This company tries to dictate everything about your website. They just expect you to be stuck in their system forever. I asked for my domain transfer key and they are denying to provide me my key for a due payment for another service. They are forcing me to host my domain in their system. I don't understand why I can't just transfer my domain which I bought 7 months ago? Trying to sort of holding me hostage by not giving me transfer keys although all I want is to host my domain in another place.If I could do it after buying the service on very first month I should be able to do it now.Guess they don't have any explanation. Also the features are limited. Can't wait to get out of this company now!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "tom colton",
          "Nb_Reviews": 2,
          "Date": "2020-08-04T13:24:53.000Z",
          "Titre": "Spent forever trying to cancel trial",
          "Contenu": "Spent forever trying to cancel trial, changed terms half way through, now have to pay for another month before trial is finished. A terrible headache, do not recommend at all. Typical Europeans, do not understand UK law."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "yogaraj",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T17:54:28.000Z",
          "Titre": "worst not response  customer support"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "owner of shawn construction",
          "Nb_Reviews": 1,
          "Date": "2023-03-25T19:58:03.000Z",
          "Titre": "Haven’t got one lead or job yet just…",
          "Contenu": "Haven’t got one lead or job yet just scams"
        },
        {
          "Note": 1,
          "Lieu": "CO",
          "Pseudo": "Gop",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T10:42:54.000Z",
          "Titre": "Bad and expensive"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Lisa Stewart",
          "Nb_Reviews": 6,
          "Date": "2022-06-21T08:57:18.000Z",
          "Titre": "Signed up in feb 2022",
          "Contenu": "Signed up in feb 2022, used for 2 days and not logged in, looked at nothing. Was charged £21.60 then another contacted them and was told i can cancel my account there and then so the lady did. Ask for a refund as i ve not even logged in but was told nope nothing they can do. Fast forward one month, money in my bank to take my daughter for breakfast for her birthday and yes they took another £21.60. Emailed again and had to give one months notice so they charged me. she says my subscription will expire on July 16th, i cancelled this back on the 18th May why 2 more months being open. Stay away from this company. Awful customer services, i dont receive any receipts, invoices or notice money is going to be taken out of my account. AWFUL AVOID APPAULING SERVICE/COMPANY.Thanks for the reply, as i said i dont use your site so why would i log in to look for the invoice. You first sent me my first invoice, by email so i assume if i had an bill you would send me the invoice to my email address as before. Like i said before, just a very poor run site."
        },
        {
          "Note": 1,
          "Lieu": "ZA",
          "Pseudo": "Patricia",
          "Nb_Reviews": 1,
          "Date": "2021-04-18T11:43:21.000Z",
          "Titre": "I have had no help from u guys…",
          "Contenu": "I have had no help from u guys regarding my website. Kindly refund my R 1.120.00 that I paid. As I had to get some one else to do my website. Kind regardsP Le Roux"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alba figueroa",
          "Nb_Reviews": 4,
          "Date": "2023-03-22T23:28:37.000Z",
          "Titre": "The best company I recommend",
          "Contenu": "The best company"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jamie",
          "Nb_Reviews": 2,
          "Date": "2020-07-15T01:15:48.000Z",
          "Titre": "So far it's useless",
          "Contenu": "So far no business has come off the website if this improves I will change my rating if not I'll close my account I can't even find my website via google"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2020-11-11T11:18:46.000Z",
          "Titre": "Very easy to use but nobody can find the site",
          "Contenu": "Very easy to use - I was easily able to create a really great website - it is a shame that the site never showed up in any web searches no matter what I did"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mrs Worthington",
          "Nb_Reviews": 5,
          "Date": "2021-12-01T21:12:19.000Z",
          "Titre": "Website that I can't publish.",
          "Contenu": "Website that I can't publish.I've had my first months invoice for a Website that I still can't publish I own the domain name"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Kay",
          "Nb_Reviews": 12,
          "Date": "2020-07-03T11:21:41.000Z",
          "Titre": "Stay away from this company!!",
          "Contenu": "Stay away from this company!!! There happy to help you before they take your money, but as soon as they get what they want, it takes days for anyone to get back to you. This is the reason why I’m leaving this company, amongst other reasons. And also because I’ve transferred my domain to someone else they don’t want to help me. I have no clue on how this is done, I sent loads of emails trying to get help with their bloody system, yet no one is getting back to me/helping me. Just goes to show what type of company this is.....Customer service is awful, and I suggest they look at the way they deal with customers, whether they still with them or not!! I have other projects I need websites for soon, but I would never look at these people again....I have just spoken to my new hosting company, they have given instructions that webador need to do from their end. Let’s see how long it takes them to action my request."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Amaka Ananti",
          "Nb_Reviews": 4,
          "Date": "2022-10-29T00:14:27.000Z",
          "Titre": "WORST CUSTOMER SUPPORT EVER",
          "Contenu": "I built a website and wanted to build a new one as my first year with Webador was coming to an end. They asked me to pay for the second year’s invoice and I explained that I would like to take my first website down and build a new one so I was happy to cancel my first one and take out a new subscription. They told me that was not possible and threatened me if I did not pay for my second year. They told me that I could register a new domain and make a new website once I paid for the second year. Fast forward to me wanting to publish the second website, I was then told I’d have to pay for a second subscription and that the domain I had registered on my first subscription could not be transferred. This went on for FOUR months and they refused to help or come up with any useful solution.  After four months they informed me that I could in fact duplicate pages from my second website (I had already built it and didn’t want to have to dismantle my first website and rebuild it), and paste the duplications onto my first website. Why did it take them FOUR months of back and forth and so many emails to tell me this?! They then told me that they would do it for me with my consent, I consented, they confirmed they had done it and nothing. They did nothing. LMAO at this point what was I expecting. Their support had already proven incompetent and unable to think outside of the box. I ended up doing it myself and finally my website was live after FOUR months of being told I’d have to pay for a new subscription. I asked to be compensated by extending my subscription for four months and they were rude, lied to my face saying they had resolved my issue when I resolved it myself and told me they would no longer respond to my emails. Honestly, the amount of time I’ve wasted, frustration I’ve incurred and the impact on my business… this whole experience has been awful and would have been avoided with knowledgable and helpful support rather than incompetent robots. Would only recommend if you will NEVER require support from them."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Behram Dastur",
          "Nb_Reviews": 18,
          "Date": "2022-06-29T13:25:38.000Z",
          "Titre": "It is not my usual way to write a bad…",
          "Contenu": "It is not my usual way to write a bad review for anyone but I thought it best to inform others so that they are aware of how this company (Webador) operates. Please do not place any order with them unless you are 100% sure that you understand as to what is good or bad for you with this service. Although they advertise that there is a 30 day money back guarantee but that is not the case. This as you will see is clearly put on Trustpilot quoting by them that they offer 3 months full refund guarantee. Well having purchased their hosting service and having had a look in 2 days I requested refund which they have refused giving all sorts of feeble excuses. Now I have lost full 1 year subscription which they have pocketed under false mis-description.  Furthermore their service/website is difficult to operate if you are not very technical minded. There is no telephone support - each time you need help you have to log a ticket/send a message and wait for them to come back. I have copy documents proving my case and in spite of me showing reasonableness and communicating with them in the nicest possible way the refund is refused. SO PLEASE BE CAREFUL AND IF YOU WISH TO DO BUSINESS WITH THEM THEN TAKE EVERYTHING IN WRITING.I WISH I HAD FOLLOWED MY OWN ADVICE."
        },
        {
          "Note": 1,
          "Lieu": "LV",
          "Pseudo": "Oskars",
          "Nb_Reviews": 1,
          "Date": "2022-06-13T12:51:50.000Z",
          "Titre": "Worst website provider I’ve seen in a long time",
          "Contenu": "Hello, So I used their service for 3 months and the subscription was only 1£ for the first 3 months, but then they started to charge me the full price, once I got the invoice I immediately cancelled the subscription hoping to get back the money, but they answered that the cancellation was done to late, so okey I didn’t get my money back, next month they charged me AGAIN the full price, now I was really upset so I once again contacted them, and this time they responded by saying that I cancelled my subscription ONE DAY to late, literally I cancelled it right after they charged me the full price first time (ONE MONTH BEFOREHAND). Now I’ve deleted my account and they just charged me this next month for nothing, haven’t been using any of their services for past 2 months. So I just recommend not using their services, the first 3 month discount is pretty much a trap, so people would get charged the next 2 months for just not being able to cancel subscription. For example you forgot about your subscription, and they charged you the full price, and now that you know you forgot to cancel it, when you cancel you still need to pay for the next month. AMAZING!Imagine you have a bad memory or God forbid alzheimers ,they would just invoice you anyways, because you agreed to terms and conditions."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Patrick Cain",
          "Nb_Reviews": 7,
          "Date": "2021-01-20T13:08:20.000Z",
          "Titre": "Would not recommend",
          "Contenu": "Very limited features, terrible customer service, customers has issues accessing the website as Google flags it as unsafe."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2021-11-12T20:34:05.000Z",
          "Titre": "It's great.....I like it",
          "Contenu": "It's great.....I like it I wish you had a customer support team though that was quicker to contact"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Simon",
          "Nb_Reviews": 2,
          "Date": "2020-05-25T22:32:30.000Z",
          "Titre": "No help at all",
          "Contenu": "No help at all. Can't get in contact with your only payment provider (Mollie) sound like you don't care."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Moonie",
          "Nb_Reviews": 1,
          "Date": "2020-11-28T15:23:59.000Z",
          "Titre": "My website got disabled in a few days ago for no reason.",
          "Contenu": "My website got disabled in a few days. What the heck?! THIS SUCKS! IM FINDING A NEW WEBSITE THAT IS RELYABLE"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Martin",
          "Nb_Reviews": 4,
          "Date": "2022-01-18T16:22:43.000Z",
          "Titre": "Rubbish Customer Service their offers are all lies and they will not help with any issues that need a real live person to adjust!",
          "Contenu": "I purchased a Pro yearly plan with a 3 month and yearly subscription discount but quickly (within a week) realised I need to upgrade it to a Business yearly plan which was also on the offer and I was supposedly within the time to cancel my purchase or upgrade with the 3 month discount and yearly subscription also discounted but when I tried to pay for this on their website the discounts were not included in the final price. So I tried desperately to speak to someone who could apply the discounts to upgrade my account but after trying for 2 weeks to contact them via their contact form, email to their support at jouwweb.nl as well as calling them on the telephone to speak to a live person whom we spoke to 3 people over the 2 week period, all who said they couldn't do anything for us over the phone and that someone higher up would contact us shortly to solve the issue still no one has gotten in touch and we haven't even got a reply via email or otherwise to let us know what to do next. Next thing I tried to contact them again today on their telephone number to find out any updates or explanation but the number given doesn't even ring anymore. I am so frustrated over this as I had wanted this upgrade quickly. The worst non-existant Customer Service ever!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "JESSICA",
          "Nb_Reviews": 1,
          "Date": "2020-07-13T20:35:49.000Z",
          "Titre": "You have to have a stupid molli account…",
          "Contenu": "You have to have a stupid molli account and it’s too hard to work and too hard to cancel your subscription"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kenny Simpson",
          "Nb_Reviews": 2,
          "Date": "2022-06-16T20:24:40.000Z",
          "Titre": "Bad all over",
          "Contenu": "Bad layout, bad customer service. I would not recommend this to anyone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2023-06-17T02:59:13.000Z",
          "Titre": "You suck",
          "Contenu": "The worst customer service experience ever"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Anna Karova",
          "Nb_Reviews": 4,
          "Date": "2020-11-26T16:38:57.000Z",
          "Titre": "Terrible support",
          "Contenu": "Terrible support! Slow answers! Very little futures! Stay away you will be disappointed!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2021-07-18T23:22:39.000Z",
          "Titre": "hunny escorts service Lahore",
          "Contenu": "I'm not sure if you remember me but I was just wondering if you had any news on"
        },
        {
          "Note": 1,
          "Lieu": "GR",
          "Pseudo": "agglifast.webador.com",
          "Nb_Reviews": 1,
          "Date": "2021-01-05T13:09:53.000Z",
          "Titre": "I AM PASSWORD PROTECT PAGE",
          "Contenu": "I AM NOT VERY HAPPY FOR PASSWORD PROTECT PAGE BUT THIS IS ON VIP VERSION I AM NOT HAPPY"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "MR SAUL COGSWELL",
          "Nb_Reviews": 3,
          "Date": "2021-05-17T21:05:39.000Z",
          "Titre": "Website doesn’t publish if you don’t…",
          "Contenu": "Website doesn’t publish if you don’t buy it. Polls are faked and give random votes"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vicki",
          "Nb_Reviews": 1,
          "Date": "2021-01-18T22:44:46.000Z",
          "Titre": "I have contacted yall plenty of times…",
          "Contenu": "I have contacted yall plenty of times about my card not working but got no answer"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Loraine Devor",
          "Nb_Reviews": 1,
          "Date": "2020-07-04T13:48:33.000Z",
          "Titre": "VERY UPET",
          "Contenu": "Webador is charging me for their site that I cant use. I signed up to use their site on July 2 and cancelled on July 3rd. Here is our communication about my cancellation. I didnt want to give them any stars for rating but I had to give them 1 star in order to write a review. Their site is too hard to navigate and getting help was even harder.Me:I had a web page from your site for 2 days. Today is July 3 2020. I struggled to get the results i wanted when i added pages.I cancelled my subscription today July 3 2020. I got a confirmation e mail saying my subscription will cancel on sept 22 2020. Why so far away and i will not pay for this site untill the cancellation date when i cant use it and not on it?This is not what i expected. Very upset and disappointed.Dear Loraine Devor,Weador:​We always use one month's notice.Because you canceled after July 2, your package will expire on September 2.Hoping to have informed you sufficiently.Kind regards,Delayhla BoulonoisSupport team WebadorMe:One month from july 2 is Aug 2. Sept 2 is 2 months. I signed up on july 2 and couldnt navigate your site easily enough for me. I canceled my subscription the next day thats how frustrated i was. I month notice is aug 2 not sept 2. What your doing is keeping the site open an extra month to charge me for something i cant use and will not be using. Thats wrong to do that ."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "alfie deegan",
          "Nb_Reviews": 10,
          "Date": "2021-11-24T11:35:20.000Z",
          "Titre": "Again totally shocking service from…",
          "Contenu": "Again totally shocking service from this company who have sent me an email requesting payment for an account I closed and was told was closed now they are trying to extract more money out of a subscription I didnt agree too and threatening to contact a debt collector good luck with that.I shall be reporting this company to the relevant authorities and seeking a refund of all monies taken illegally.As you know and I sent you a copy of consumer laws 2014 by email a digital signature is illegal and given it clearly states you can try a 3 month subscription before you make up your mind well I will again state I didn t make up my mind to take out any subscription and as I have told you several times show me the evidence or signature I gave you to agree to this and since I also provided you evidence you have done this to several members ie:taken money you weren't, given permission to and trying to evade refunding my money at every turn i will be contacting the Judge in the Daily Record Scotlands biggest newspaper and we will see who is telling lies.I will also inform him i give my permission to run a story on your company practices.Also i tried several times to cancel and there was no link,no way to cancel by way of your website nor cancel my card,direct debit or otherwise and at no time while withdrawing from my account did you send me any confirmation of taking up a subscription nor taking monthly payments so as I said I will contact the Judge today and we will see who the law stands by."
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2020-08-06T06:15:20.000Z",
          "Titre": "Scammers",
          "Contenu": "Scammers, extorionistsNeed I say moreIf I could leave 0 stars I would."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2021-03-08T17:45:03.000Z",
          "Titre": "Webador HELP  -  USELESS HELP!",
          "Contenu": "I have been trying to get help from customer service to properly setup Microsoft 365 Email.  Every time I send information with screen shots of what Microsoft says needs to be changed (name servers to forward emails to MS) in order to receive emails for business.  First I receive a canned response read the help document.  (As if I haven't already).  Second this is the response that I received:\"​We cannot help you with changing the DNS in your Microsoft account. We simply do not have access to these details as this is your account in a different system. If you need help in changing the DNS with Microsoft, I would advise to get in contact with Microsoft itself. They will be able to help you with their system. ​Once you have managed to change the DNS in your Microsoft account you will be able to easily change the DNS in our Webador-system.​I hope this helps!Kind regards,A.K.\"That is what I am trying to do is change the DNS in Webador.  I do not understand what they are thinking.I give up.  If I cannot get this corrected, I will be transferring my domain back and tell everyone I know of the problems I have encountered with Webador.2nd Response:I do not need to make any Microsoft DNS changes. I need to make Webador DNS changes. This is the problem I am having nobody reads anything fully and you cannot speak with anyone. PLEASE READ THIS. I NEED TO MAKE WEBADOR DNS CHANGES. SPECIFICALLY NS CHANGES THAT ARE STATED IN THE HELP ARTICLE AND BY MICROSOFT INSTRUCTIONS."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kyle",
          "Nb_Reviews": 1,
          "Date": "2020-09-03T23:57:06.000Z",
          "Titre": "Very disappointed",
          "Contenu": "Very disappointed. Charged me 11 times for pro and dint upgrade me."
        },
        {
          "Note": 1,
          "Lieu": "GR",
          "Pseudo": "Ευαγγελία",
          "Nb_Reviews": 1,
          "Date": "2020-05-15T16:02:30.000Z",
          "Titre": "Bad sites",
          "Contenu": "Bad service. Not friendly sites on search machines. Disappointing"
        },
        {
          "Note": 1,
          "Lieu": "SE",
          "Pseudo": "Mira",
          "Nb_Reviews": 1,
          "Date": "2021-09-19T09:47:06.000Z",
          "Titre": "I tried to cancel my subscription but…",
          "Contenu": "I tried to cancel my subscription but wasn't able to."
        },
        {
          "Note": 1,
          "Lieu": "PT",
          "Pseudo": "Jacob Jan de Graaf",
          "Nb_Reviews": 3,
          "Date": "2020-04-24T01:01:18.000Z",
          "Titre": "I wanted to unsubscribe and I didn´t…",
          "Contenu": "I wanted to unsubscribe and I didn´t have help to do it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dora-Lynn Greene",
          "Nb_Reviews": 4,
          "Date": "2022-05-20T22:48:29.000Z",
          "Titre": "A very pleasing experience - updated",
          "Contenu": "This was one of the easiest sites I have ever put together. I have worked with computers since the early 90s and I found the editor and the offerings top-notch. I created a beautiful and useful site in about a half a day. Everything is streamlined, available and insightfully placed for ease of access. My site looks wonderful and modern. I highly recommend that people give this a try whether you are a highly technical user or a  non-technical user. You will be surprised and pleased. I have had to downsize this for the following reason. The biggest downside of this site is that you will still not be found unless you use a paid version, even if you set your setting correctly on the seo portion, I tried searching for my page and was not able to find it  the only way I could get to it was using the direct address. That makes it fairly pointless to create a website that can't be found. I will upgrade this if this changes in the future. UPDATE 5/20/22 Received an emai, which was nice it was written to me and I appreciate that they took the time to do this, like I said was nice, they explained that it is out of their hands and some stuff that google does not like sites with advertising and so on. The entire internet is one big advertising platform and almost every site I visit I am barraged with advertising so I know that can't be true, however I do know that they have the free sites locked down - meaning they are not submitted and may have a robot file directing google and other search engines away from them. Like I said I have been on the internet since the early 90's and I have kept up with some things. I also know that it can take time for Google to find a site so I will wait a few more weeks then look for another platform. this is pretty much usless to me if I cannot be found by a search engine without putting out a bucket of money. My site is for a public purpose to assist with voting and I will not reap any benefits from it monetarily. It deos however benefit me when I am researching candidates."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Vasile Valentin ISTODOR",
          "Nb_Reviews": 7,
          "Date": "2020-03-26T10:40:49.000Z",
          "Titre": "I worked hard to build my site but I am…",
          "Contenu": "I worked hard to build my site but I am not visible!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jesús",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T01:56:14.000Z",
          "Titre": "balls",
          "Contenu": "BUNS!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Eva Staniforth",
          "Nb_Reviews": 1,
          "Date": "2020-09-27T08:13:42.000Z",
          "Titre": "Good company as long as you don't try to leave",
          "Contenu": "Webador was a good company.  Service had always been very good.  That was until I tried to leave.  I requested that they release my domain name so that I could use it with a different provider.  I sent them the initial email on 3rd September 2020.  On 4th September 2020, I had to email them again to request that they cancel my subscription.  I received an email back saying that my Pro plan was cancelled and would expire on 27th October 2020.  I was a little bit unsure as to why so I went back to re-read the terms and conditions.  I found that they required a one-month cancellation notice but my payment was due to in the middle of that month.  So I emailed them again and offered to pay the next payment and requested that I had my domain released.  I said I didn't mind paying on 28th September 2020 even though I wasn't planning to use the site as it was me that wanted to end the contract and I didn't want to wait until the expiry date.  I had no issue paying the September payment.  All I wanted was my domain name released. The company I want to switch to suggested that I request that Webador \"pointed\" my domain to their servers and gave me the information which I passed on to Webador but they still won't do that. I was considering leaving them a good review in my blog when my new website was uploaded, until I had this problem.Update: Webador have now dropped my domain name today (27th September 2020) even though they specifically told me they couldn't until 27th October 2020.  I now cannot access my emails, even though I was expecting some to come in.  I can't connect my domain name to my new website provider still as it's still showing as unavailable.  Yes I wanted them to drop my domain name but I was willing to wait until 27th October since they said it couldn't be dropped earlier.  I didn't want it dropped unexpectedly like that.  I wouldn't have sent out those emails yesterday if I'd have known they were just gonna drop my domain just like that, with no warning!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2020-08-02T13:02:34.000Z",
          "Titre": "This website has a bad payment system"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Leona Bundy",
          "Nb_Reviews": 1,
          "Date": "2022-08-24T12:05:21.000Z",
          "Titre": "If I could score a 0 I would.",
          "Contenu": "If I could score a 0 I would.I am a regular 5 star person and it takes a lot for me to write a bad review but this took the cake. DO NOT USE THIS COMPANY!I really really wish I checked out the one star reviews before I signed up for my issue is identical to theirs. In June I attempted to cancel my domain, I followed their help section and clicked cancel and the page took me back to the home page - NO ERROR MESSAGE, NO PLEASE CONTACT CUSTOMER SERVICE so I believed all was well. Then I was billed in July. I thought okay my fault, maybe I didn't click all the buttons I was supposed to or missed a step. Let me try again, so in July I cancelled again. Followed every step they said, even though it took me round the bend a few times, I clicked cancel and i thought it was done with. Now they are trying to bill me again for August and WORSE they now say i owe them for September as well???? In all the years I dealt with Wix in America I never had this kind of scam like customer service! I then emailed to ask for the Aug invoice to be cancelled explaining the whole situation and low and behold I got a series of extremely rude and discourteous emails from one person, who I'm starting to think is the only person who works there suspiciously and so i responded aggravated in kind.   I then asked for this to be escalated to a manager of which i was told they would just say the same as her. I then asked for a phone call to calmly discuss the matter, suddenly they dont have one phone for such occasions? Her snobby email kept advising on policy... newsflash... you have nothing in your policy when it comes to clients who try to cancel who get no error message indicating their cancellation didnt work! There wasnt even a pop up to say please contact customer service but i was supposed to be psychic and just know the cancellation didnt go through and contact them. This has been the worst experience ever and I took time out of work to deal with it. I will be going to social media and trading standards about this as they are trying still to take money out of my account and its now classified as stealing. AGAIN BEWARE! DONT USE UNLESS YOUR PLANNING TO STAY WITH THEM FOR LIFE as you will never stop paying them.    BTW, They only have 500 followers on Insta and they don't answer any of their twitter comments and im fairly sure the 5 star reviews on this platform are not 100% genuine or are people who haven't tried to leave them yet. This isnt defamation its the truth and a real life story.****In reply to the review reply -1. No one threatened anyone2. I did not opt out to try and cancel my subscription that’s absurd3. As explained, trust pilot reviewed my review and posted it saying it was fine so another lie exposed4. Your still charging me for august so why are you saying you have cancelled all the charges, another lie.Everything I have said in my review is fact and if in doubt check out the other 1 star reviews. You can’t call us all liars.Seriously all, do not use this company!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Patricia",
          "Nb_Reviews": 1,
          "Date": "2021-04-18T21:18:32.000Z",
          "Titre": "Didn't suit my needs at all."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dewitt",
          "Nb_Reviews": 1,
          "Date": "2021-04-03T17:43:04.000Z",
          "Titre": "Great site works perfect for me."
        },
        {
          "Note": 1,
          "Lieu": "HR",
          "Pseudo": "CarolinaRoleplay",
          "Nb_Reviews": 1,
          "Date": "2021-02-01T14:08:47.000Z",
          "Titre": "Every two days",
          "Contenu": "Every two days, website is down."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T01:50:30.000Z",
          "Titre": "You don't have any free websites"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "owner of whatswrongwith.you",
          "Nb_Reviews": 1,
          "Date": "2023-02-22T23:51:50.000Z",
          "Titre": "All OK 👍webador rev review!",
          "Contenu": "All OK 👍! Slow process for me. Just playing. Nothing too serious. Am familiarising with the site trying out functional features.  Not sure about the click and drag, prefer click on. Just read the terms, trust pilot reviews, was surprised 'not to be used for business or marketing?'  What is the design workshop feature for? I have just read other people's reviews and noted they were mostly 5* appointed! Their reviews were very positive.  You may be glad of a sensitive sceptic on board. Lolx"
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T10:48:15.000Z",
          "Titre": "I cant disable the Gmails I get it’s so…",
          "Contenu": "I cant disable the Gmails I get, it’s so annoying!But overall I would say test it out, I don’t like it but you may do!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Marcelo Salup",
          "Nb_Reviews": 1,
          "Date": "2022-12-01T14:00:15.000Z",
          "Titre": "There are many structural details that…",
          "Contenu": "There are many structural details that sorely need improvement (eg, pictures not lining up), many things that need fixing (eg, only 4 or 5 type sizes), but my #1 complain is that customer service is slow, taking one entire day to respond) and ineffective. I had high hopes, but am very disappointed at the entire experience.December 1, 2022As a response to Nicola. I've given up. I sent absolutely clear screenshots. There is no point in doing a one on one to solve one problem when the inherent structural problem is not fixed. Nicola's reply also doesn't address the slowness of the customer service and the lack of type sizes.Just the fact that it took a month to reply to this speaks volumesWebador is a nice idea, but compared to even Weebly, which is bottom of the barrel, it's not ready for prime time"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T17:49:35.000Z",
          "Titre": "It's eh",
          "Contenu": "It's eh. Not quite modern enough or fully-featured enough"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Tony B",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T17:39:20.000Z",
          "Titre": "Difficulty making changes to my…websites",
          "Contenu": "Difficulty making changes to my websites. Despite these issues, Webador Free is relatively user-friendly."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Fox P.",
          "Nb_Reviews": 2,
          "Date": "2022-07-15T21:21:52.000Z",
          "Titre": "Simple builder, but there are other options",
          "Contenu": "It is an easy and very basic website creator that lacks a lot of options. There is a paywall that clears up some of them, but there should be basic QoL items considering there are ads on your page when you want to see it. HTML editing should be one of them, as the framework for pages is there, but minor changes that require any sort of option added is locked behind said paywall. It also does not allow for indexing on their ad-induced free section, so honestly... do not bother unless you are going to subscribe to their services. There are other options out there that can do what this does and allow for HTML and Google indexing, or you will never be found on the web unless you give your URL to anyone specifically."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Anita Whitney",
          "Nb_Reviews": 2,
          "Date": "2022-02-19T05:28:24.000Z",
          "Titre": "My review",
          "Contenu": "It seems that there are too many steps, too much back-and-forth, in order to get to that almost unattainable page where you can finally write your blog and then publish it. I have a professional helping me set this blogsite up, and that is what he said. I could not possibly do this alone."
        },
        {
          "Note": 2,
          "Lieu": "PT",
          "Pseudo": "Silvério Palma",
          "Nb_Reviews": 2,
          "Date": "2021-08-18T22:57:25.000Z",
          "Titre": "Webador team knows about my…",
          "Contenu": "Webador team knows about my unsatisfaction thru my e-mails, ....it is all there.I don't have to explain and expose my experience here in public.\"What happens in Vegas, stays in Vegas\"However I do recommend Webador for many reasons I will continue with Webador and I am thinking in upgrading from Pro to business.But for now I cannot give more than 2 stars"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Shayna",
          "Nb_Reviews": 2,
          "Date": "2021-07-16T22:33:35.000Z",
          "Titre": "The websites are very limited",
          "Contenu": "The websites are very limited, I paid for the \"Pro\". I'm an artist and just wanted to promote my work, very difficult to actually see what you are designing. I couldn't remove some features that I did no want. Unecessary boxes appeared from nowhere. I couldn't see any previews. it took days to go live. Then when I went live no one could find me because of an odd / at the end of my website address that even I did no know was there, I had to email to find out why the link did not work.  This may suit others perhaps if you want to sell or to blog but it did not suit me."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kellye",
          "Nb_Reviews": 2,
          "Date": "2020-10-29T11:07:51.000Z",
          "Titre": "The fact that I have to pay to upload a…",
          "Contenu": "The fact that I have to pay to upload a video is too much nickel and dime stuff.The click and drag add on is nice.  Easier to use than some sites.  It's just that every time you choose to do something it's like the old pay phone where you have to put in another dime to keep going."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Adam Grapa",
          "Nb_Reviews": 1,
          "Date": "2021-04-26T15:05:01.000Z",
          "Titre": "I don't know if they have a support team. I can't contact anybody.",
          "Contenu": "It was easy to go through the steps to start my business website. I was able to verify my web site for google business account. However, I am attempting to verify my business's gmail through the DNS servers. Google wants me to delete a MX called mail.jouwweb.nlI can delete the CNAME type with the name mail.jouwweb.nl but not the MX type.I attempted to ask Webador for support, but when I finished the request form, it said \"Thank you for your feedback\" and nothing else. It might mean they don't have a support team. On the web site it is the only way to contact them."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "khadijaconners",
          "Nb_Reviews": 3,
          "Date": "2020-12-03T23:07:40.000Z",
          "Titre": "Question of honesty for Webador",
          "Contenu": "Well I was very excited and proud of Webador friendly user but I see orders in the order section and numbers in my cart and not getting paid.  So there is a question of concern of the honesty and stripe has successful payments on the chart and stated the payments haven't been monatized so what can i do when it says you have no orders and inquired 3 times it made me curious is this a honest site went to BBB TO PULL UP REVIEWS I WAS SHOCK ON SOME OF THE COMMENTS THAT WAS SAID FOR AS HONESTY AND PAYMENTS BEING ISSUED MY MATTER STILL HASN'T BEEN RESOLVE"
        },
        {
          "Note": 2,
          "Lieu": "NO",
          "Pseudo": "Heva",
          "Nb_Reviews": 2,
          "Date": "2020-08-21T07:56:44.000Z",
          "Titre": "Bad Communication",
          "Contenu": "Bad Communication. They answer delay if you need help. If you have a fourmal website here is not suitable because if you got some trouble in your website it take along time to got help. In other things is okey.I hoppe that they devloped thier work soon."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stacey",
          "Nb_Reviews": 1,
          "Date": "2022-07-28T23:09:19.000Z",
          "Titre": "It was easy enough but lied in its…",
          "Contenu": "It was easy enough but lied in its initial advertising, it wasn't free.  The add said free/,free, for both.  Now my payments have to be paypal"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "joseph",
          "Nb_Reviews": 1,
          "Date": "2020-05-18T14:25:06.000Z",
          "Titre": "i havetried to find my website on…",
          "Contenu": "i havetried to find my website on google to no avail contacted you about this you informed me its on there but i went thru every page and its not so i will be looking at cancelling my subscription"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mark M",
          "Nb_Reviews": 14,
          "Date": "2020-06-24T13:05:46.000Z",
          "Titre": "Don't pay for the Pro version - flawed process. Disappointing customer help/service.",
          "Contenu": "The web build functionality isn't as intuitive as other sites. Customer service and support functionality really lets them down. The 'Help' functionality pretty much useless as it just picks up keywords in your question and quotes unrelated text in response. Questions via 'contact us' go unanswered. Surprisingly poor as such an obscure web-builder should have their help functionality spot-on as very difficult to find information outside of the Webador eco-system.   Surprisingly if you pay for the 'pro' version you can't publish your site without registering your own domain name (no option to choose a free webador domain) so if you have to wait 60 days or so for the domain to transfer over you can't publish the site."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "study sinshine",
          "Nb_Reviews": 6,
          "Date": "2020-06-17T13:58:43.000Z",
          "Titre": "Not loading on google",
          "Contenu": "I do not know why but when I search for my website study sunshine nothing comes up, I have to enter the whole https link to go on it and visitors are not going to be willing to do that"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Kay",
          "Nb_Reviews": 12,
          "Date": "2020-06-22T20:34:28.000Z",
          "Titre": "I was happy with webador until very…",
          "Contenu": "I was happy with webador until very recent. I have a business email address which was working fine until a few days ago. I contacted Webador to say my email has stopped working, and gave them the information they asked for. I then got another email asking me if I had put my credentials in properly which I thought was a bit insulting, giving the fact the emails were working perfectly fine before. The email also had a so called help sheet which was in dutch. I was then told to google translate the information. This was not helpful at all, I emailed back advising I need my emails working asap, as I have a very important opportunity and I was communicating via email with the organizer. This was this morning, as I write this review at 21:23 i've stilled heard nothing, so if it wasn't for my persistence I would have still not had my emails working. I actually worked the problem out myself, with a little help from a friend. I'm fuming regarding the service I have received. I will be definitely be looking to move my hosting/website elsewhere, as soon as I can find a company who actually care about their customers!!!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Cristiano Moniz",
          "Nb_Reviews": 2,
          "Date": "2020-11-21T22:39:05.000Z",
          "Titre": "Not useful",
          "Contenu": "Hi guys!Too much limitations to build up or allocate things and buttons.I am very upset with webador."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Beverley",
          "Nb_Reviews": 1,
          "Date": "2022-08-15T10:17:18.000Z",
          "Titre": "it would be more helpful if you could…",
          "Contenu": "it would be more helpful if you could speak to a person direct."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Zigmannmedia",
          "Nb_Reviews": 1,
          "Date": "2022-09-19T14:10:34.000Z",
          "Titre": "Having to reset links when I made it…",
          "Contenu": "Having to reset links when I made it live is bad"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "mustafa",
          "Nb_Reviews": 1,
          "Date": "2021-04-21T20:48:20.000Z",
          "Titre": "I feel customer service isnt good thats…",
          "Contenu": "I feel customer service isnt good thats the only issue we have with the website"
        },
        {
          "Note": 2,
          "Lieu": "RO",
          "Pseudo": "Veresjuli",
          "Nb_Reviews": 1,
          "Date": "2020-11-04T21:58:10.000Z",
          "Titre": "Quite ok",
          "Contenu": "Quite ok. But you have to pay for the nice stuff, very few things are free"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "owner of Club S& H",
          "Nb_Reviews": 1,
          "Date": "2023-01-22T22:09:40.000Z",
          "Titre": "Make everything free"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Jme Webb",
          "Nb_Reviews": 1,
          "Date": "2020-08-19T20:47:19.000Z",
          "Titre": "Unclear",
          "Contenu": "Not clear on the website at all. Payments don’t make sense"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Yousdad",
          "Nb_Reviews": 1,
          "Date": "2020-08-29T21:54:19.000Z",
          "Titre": "Payment system is always down"
        },
        {
          "Note": 3,
          "Lieu": "DK",
          "Pseudo": "Søren Andersen",
          "Nb_Reviews": 10,
          "Date": "2023-12-02T18:56:05.000Z",
          "Titre": "I had not understood the terms…",
          "Contenu": "I had not understood the terms regarding cancellation correct. It didn't make sense to me the way they practiced the terms. So I was not able to cancel when I wanted. It would last one month extra. But thanks to the kind customer service agent I got my cancellation as I expected after I had reported the unclear conditions here on Trustpilot."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T06:46:45.000Z",
          "Titre": "website",
          "Contenu": "people can not purchase items from your store unless you pay."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alister Crowley",
          "Nb_Reviews": 2,
          "Date": "2023-11-14T15:47:55.000Z",
          "Titre": "cohesion and simplicity",
          "Contenu": "I like that it is easy to update my site i just wish it could get promoted more. i am new to this and this is my first ever web site. I am at a loss for content and i feel my siirte is a bit schizophrenic in terms of information. i need a cohesion and simplicity"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Linda Green",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T09:11:05.000Z",
          "Titre": "I'm still new to it",
          "Contenu": "I'm still new to it. But so far I like it would like a little more traffic in 2 add. A subscription but we'll see what it takes me"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tammy",
          "Nb_Reviews": 3,
          "Date": "2023-09-01T16:49:29.000Z",
          "Titre": "I ONLY WANTED TO CHANG CARDS AND IVE…",
          "Contenu": "I ONLY WANTED TO CHANG CARDS AND IVE JUDT HAD A PAYMENT TAKEN OUT ON AUGUST 26TH IT IS SEPTEMBER 1 st   I CANT CHANG CARDS WITHOUT YOU FRYING ACCESS MY FUNDS,,, THIS IS WRONG I CANT EVEN CANCEL THE CARD AT ALL UNLESS I SPEAK TO SOMEONE> CANCEL MY SUBSCRIPTION NOW!!!"
        },
        {
          "Note": 3,
          "Lieu": "BG",
          "Pseudo": "chris pascoe",
          "Nb_Reviews": 2,
          "Date": "2023-08-18T17:32:51.000Z",
          "Titre": "Live help would be great.",
          "Contenu": "I like the overall ease of building the site, apart from having to up load images to my pages and then another image to products. I am on pay per mb. Now there maybe a way round this but I have not been able to find it. I have tried to contact you for advice via mail but heard nothing back. Questions about the site need answering within hours not days, even a live operator would the best."
        },
        {
          "Note": 3,
          "Lieu": "PT",
          "Pseudo": "edu",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T18:38:01.000Z",
          "Titre": "it is good for website building, but lacks some tools",
          "Contenu": "it is good for website building, but lacks some tools and some of the interface design could be better. you cant really choose where to place elements, just the order in which they appear."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "owner of Club vape Uk",
          "Nb_Reviews": 1,
          "Date": "2023-01-03T00:01:18.000Z",
          "Titre": "Fab app just wish you had ways of…",
          "Contenu": "Fab app just wish you had ways of excepting other payment methods as the two available do not take payments for the products I have. Please please please add a credit or debit card payment facility for customers to be able to pay. Other than this I would of gave 5 stars"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2023-02-17T20:05:18.000Z",
          "Titre": "Feedback",
          "Contenu": "I like this company because it has unlimited pages, unlimited storage and unlimited data traffic ( including the free plan as well. ) I also like the email use which is on my subscriptions. Things I don't like about Webador is that the Cumulative Layout Shift was 0.1 something then 0.55 then 0.53 then 0.13 then 0.53 then 0.53. Another thing I don't like is that you can't have a sub domain unless you have a multilingual website ( which you need to pay for. )"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eli",
          "Nb_Reviews": 3,
          "Date": "2023-03-13T21:09:49.000Z",
          "Titre": "3 star because I wish I could see the…",
          "Contenu": "3 star because I wish I could see the whole website with the pictures instead of having to pay and seeing the outcome other then that it's decent and more font options and photo stock. They have no photostock"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carlos",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T16:28:56.000Z",
          "Titre": "Good and bad",
          "Contenu": "I love how you can make a free website with links and stuff, but the part where I am left with disappointment comes with the domain names being locked unless you pay monthly, and the fees are expensive and add up."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Andrea Kunk",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T23:03:11.000Z",
          "Titre": "I love how easy it is to build a…",
          "Contenu": "I love how easy it is to build a website for blog or business. The down side I feel is when I try to upgrade it takes days even a week or so opposed to the 24hrs it states it could take. Other wise it's okay and once I get to where I can use the upgrade maybe it will work better."
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "Kalmia",
          "Nb_Reviews": 11,
          "Date": "2023-08-15T09:03:34.000Z",
          "Titre": "Site is wonky between switching languages",
          "Contenu": "I apologize I can only rate 3 stars from my experience despite being pretty sure there are numerous other good features I've yet to discover, but I faced so many difficulties while attempting to build my website here. Perhaps it's just my own personal opinion that is unique, similar to someone who finds iPhone interface not very user-friendly compared to Android even though the whole world prefer Apple products. Reading the reviews here, I can't deny that a part of me wished to still be using Webador for my site, but being in Italy perhaps, the site gets a little wonky here and there, making it uncomfortable for me to keep switching the site back to English. It's almost as if the English site is separated from the Italian site and they don't sync with whatever edits I made. It was a frustrating experience with so much refreshing and redoing.Again, maybe it was just that one day when I was working on it. But I stopped instantly after that and decided to stop using it altogether after discovering another platform. Therefore, I can't tell whether Webador is actually a good choice overall.Nevertheless, thank you for the opportunity and I'll definitely try again in the future in case there's some new improvements."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marcelo Salup for Salup.com",
          "Nb_Reviews": 3,
          "Date": "2023-06-19T13:28:15.000Z",
          "Titre": "Very primitive and unwilling to improve",
          "Contenu": "I have two websites with Webador, so I think I am by now an experienced client. I also have several websites with Weebly, so I can compare both effectively.On the plus side, easy to use and the blog page is great. I also like the fact that you can copy some elements from one page to another (e.g., the contact me and Calendly buttons) and that buttons can be colored and have icons.On the negative side✅ Highly ineffective assistance -- they are always nice in responding, but never seem to resolve anything. It's like little platitudes all the time, but serious, super ineffective✅ Very very limited font sizing -- Weebly has more, and Weebly is not THAT great.✅ No way of having a picture be the actual background of a page, which you'd think they would have resolved by now✅ Webador is a single page, they don't have \"sections\" like Weebly and they have not figured out how to integrate pictures in text✅ They have not been able to figure out how to drop a picture inside a text box✅ There are many other tools that other services have (e.g., making pictures automatically round, or having line dividers between columns) which are sorely missing here.💡 So, here's an idea, Mssrs Webadors... why don't you get a paid subscription to Weebly, Wix, Carrd and a few other services and just steal the best ideas?🌩️ And a big brainstorm... how about actually speaking to your customers and just creating an open-ended survey: which other services do you use and what ideas do you think we should rip off?"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Spencer Blackaller",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T15:17:08.000Z",
          "Titre": "A system within a system to improve the system.  First design the system so it meets it's purpose in the most efficient way to the general public",
          "Contenu": "It seemed nice an easy to get to the stage of creating the website and the templates were easy to setup and they were indeed free.  I'm a technical person though with experience so I think could have been better in terms of talking to the average user!  These people really don't know how to do much on a computer and they are just hoping it's going to be click this button, choose this style and get this website.  Which in some ways when you think about it, it should be like that, but it isn't, why not?  It's actually designing a signup process to give the user exactly what you say he gets in the free package and use as little steps as possible for him to get there.  It should be the easiest thing in the world to come up with so why isn't it?  You need to make money from it and you're under the illusion that if you hide marketing and signups within the process and make it more complicated for the user then you will get more signups.  What if you got more signups because the process was the best signup process in itself!  Basically you complicated a \"sign up process\" by doing something within to get more sign ups and ruining the sign up process.  Not necessarily in my opinion because I used to run my own IT business so I know how things are done and how to get around them but the average user wanting a new website which could potentially be a guy accessing a computer for the first time isn't going to get to the stage I did very quickly at all."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "datingadmin",
          "Nb_Reviews": 2,
          "Date": "2023-05-16T01:37:08.000Z",
          "Titre": "Very easy to use",
          "Contenu": "Very easy to use, it's great, but I give it a 3 star because it doesn't appear to be recognizable by search engines."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Randy Schreifels",
          "Nb_Reviews": 3,
          "Date": "2023-12-05T18:16:01.000Z",
          "Titre": "I am not sure"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T21:02:59.000Z",
          "Titre": "Nobody has heard of my website at all",
          "Contenu": "Nobody has heard of my website at all, can you please help make Webador websites more accessible?"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Rosie Cleaver",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T09:10:48.000Z",
          "Titre": "It seemed that you had to change…",
          "Contenu": "It seemed that you had to change something such as one of the colours in order to save new changes in design mode."
        },
        {
          "Note": 3,
          "Lieu": "TR",
          "Pseudo": "owner of Conat Ltd",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T11:40:19.000Z",
          "Titre": "would like to have e-commerce…",
          "Contenu": "would like to have e-commerce integration, else is perfect"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joseph Ephraim",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T04:55:28.000Z",
          "Titre": "One critical thing to look at and…",
          "Contenu": "One critical thing to look at and possible address is the process to tag and link pages"
        },
        {
          "Note": 3,
          "Lieu": "IE",
          "Pseudo": "Sean",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T17:55:52.000Z",
          "Titre": "Gives many ads on web padge and the…",
          "Contenu": "Gives many ads on web padge and the name is freee.2332222ww is so annoying"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T22:48:33.000Z",
          "Titre": "You need to pay"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Elon R. Musk",
          "Nb_Reviews": 1,
          "Date": "2023-09-17T23:19:23.000Z",
          "Titre": "It doesn't save",
          "Contenu": "It doesn't save! I type something really long and want to check it out when its published. But I see nothing!!!"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "me",
          "Nb_Reviews": 2,
          "Date": "2023-07-27T06:45:35.000Z",
          "Titre": "It is the most accessible and easiest…",
          "Contenu": "It is the most accessible and easiest website builder I have come across."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T17:10:11.000Z",
          "Titre": "It's a bit pointless to be charged",
          "Contenu": "It's a bit weird. It costs a bit of money. It does not link me up to customers. I like how easy it is technically to use."
        },
        {
          "Note": 3,
          "Lieu": "PR",
          "Pseudo": "Cassandra Eubanks",
          "Nb_Reviews": 2,
          "Date": "2023-04-01T18:23:02.000Z",
          "Titre": "I enjoy the opportunity to get a site…",
          "Contenu": "I enjoy the opportunity to get a site for free but until you pay it's not worth it"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "owner of UniqueAtripp",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T19:46:46.000Z",
          "Titre": "I'm still stuck on setting up but I'm…",
          "Contenu": "I'm still stuck on setting up but I'm taking my time it will take a minute."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patty Davi",
          "Nb_Reviews": 4,
          "Date": "2022-11-02T20:51:53.000Z",
          "Titre": "Finaly Webador tells me that I will not find my website at AOL...",
          "Contenu": "After many weeks finally Webador told me where my website can be reached and it is not AOL as I always use,  therefore if my clients who use AOL want to find my business they will not be able to find it.I still don't know what I have to do to tell all my clients how to find my business website. Many of tem use AOL I don't know to use Chrome or other than AOLNOT VERY PRACTICALWebador might not be criminals or scammers but their service did NOT satisfied my needs. I am looking for another website supplier because of that."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "BK",
          "Nb_Reviews": 1,
          "Date": "2023-05-06T05:39:49.000Z",
          "Titre": "The site Webador stamp and ads distract…",
          "Contenu": "The site Webador stamp and ads distract from the actual site too much."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "IsaacTech Solutions",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T23:39:34.000Z",
          "Titre": "Classic and great"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Linda Chinault",
          "Nb_Reviews": 2,
          "Date": "2022-10-18T22:47:18.000Z",
          "Titre": "Customer service is slow",
          "Contenu": "Customer service is slow. Anytime I have had to contact them I don't get a response until the next day I had a problem with a payment not going through. I sent an email at 9:00 am, it's now 1:45 pm and I haven't had a response yet.I have someone wanting to purchase and now I'm waiting so I can get shipped to her"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Darryl Davison",
          "Nb_Reviews": 3,
          "Date": "2023-05-28T05:40:32.000Z",
          "Titre": "My company is sinking but I know God is…",
          "Contenu": "My company is sinking but I know God is in control"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "usermichael",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T16:15:34.000Z",
          "Titre": "maytara",
          "Contenu": "banana like"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DREW A MAKARWICH",
          "Nb_Reviews": 2,
          "Date": "2022-08-22T00:18:53.000Z",
          "Titre": "This is Drew M",
          "Contenu": "This is Drew M. Need to make it very simple to get people with a my account . Full better access to cart wise. May need to improve accessibility for better maintenance. Great, cya Drew Makarwich P.s We will keep up with website to make sure it has more maintenance. Cya Drew Makarwich"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shannon",
          "Nb_Reviews": 1,
          "Date": "2023-01-08T02:19:26.000Z",
          "Titre": "It's a learning process but I love the…",
          "Contenu": "It's a learning process but I love the professional feel of the layout."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Elizabeth  Crates",
          "Nb_Reviews": 11,
          "Date": "2023-10-07T23:37:58.000Z",
          "Titre": "Everything good but need an app as a…",
          "Contenu": "Everything good but need an app as a quick go to."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "penis",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T00:18:02.000Z",
          "Titre": "it’s easy to use but could have more…",
          "Contenu": "it’s easy to use but could have more features"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2022-06-25T00:51:45.000Z",
          "Titre": "the web builder is not bad still waiting for answer from support on an issue.",
          "Contenu": "the web builder is not bad, there are only a limited number of templates but you can design a bit yourself.  the one problem I have is that the site is rejecting the forwarding from my domain provider.  I put in a support request and haven't heard back from anyone in over 24 hours.  Still waiting to find out why this is happening, webador is refusing the connection. We'll see if they come back with a solution."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "April",
          "Nb_Reviews": 1,
          "Date": "2023-06-18T12:06:31.000Z",
          "Titre": "I found it difficult to use."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Ameen",
          "Nb_Reviews": 12,
          "Date": "2023-02-11T08:39:02.000Z",
          "Titre": "I had few extra responses after I joined"
        },
        {
          "Note": 3,
          "Lieu": "NG",
          "Pseudo": "twentycreations group",
          "Nb_Reviews": 3,
          "Date": "2022-05-15T13:07:54.000Z",
          "Titre": "It's a great and generous builder",
          "Contenu": "It's a great and generous builder, I like webador as it's simple to use, but it will be nice if we can install plugins to it. As for the subscription, let it also accept debit card as not everyone own a credit card. Also, for we that are not eligible to have a stripe account, we'd appreciate it if you can integrate new payment method other than stripe and Pay Pal so customers can easily check out orders, while we'll be happy to recommend webador to friends and family.Thanks!"
        },
        {
          "Note": 3,
          "Lieu": "PT",
          "Pseudo": "Tomás",
          "Nb_Reviews": 1,
          "Date": "2021-12-02T20:47:13.000Z",
          "Titre": "Features you should add",
          "Contenu": "Its very helpful for those who are starting and want a clean a fast website although it doesnt let u customize every Page and thats bad alsoIt doesnt let you change the width of the Page.Overall its good because its cheap and is somewhat a powerfull website creater.Recomendations: give us more freedom in each Page let us change login and register Page as well as check out Page"
        },
        {
          "Note": 3,
          "Lieu": "PT",
          "Pseudo": "Guilherme",
          "Nb_Reviews": 1,
          "Date": "2021-07-07T20:42:16.000Z",
          "Titre": "Intuitive but limited",
          "Contenu": "Intuitive but limited. I cant create a proper walking tours website with a proper cart and design. Support offered litlle help or none.Anyways. Its an excelent choice for those seeking an easy way to sell their products. To create a products selling Shop. But not for specficic services.And i noticed they are improving every year like they added new payment methods for the webshop"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Thomas",
          "Nb_Reviews": 2,
          "Date": "2021-04-28T15:22:51.000Z",
          "Titre": "Why?",
          "Contenu": "Hi, I was editing my website this morning on the free plan, trying to embed some HTML scripts. It worked fine a couple of months ago, but now it is part of the pro subscription! The same thing happened when I was trying to edit a form, but again it said it was part of the pro subscription! Why did you have to make things that were originally free now a paid thing? It so annoying!Thanks,Thomas"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Lea",
          "Nb_Reviews": 1,
          "Date": "2021-03-24T10:06:07.000Z",
          "Titre": "Great website builder.",
          "Contenu": "Great website builder.I did struggle with the site at the beginning and sent an email. I didn't get a response but the issues was fixed however a courtesy email would have been preferable Overall competitive fees, great flexibility for a new website. Some of the prompts on how to find your way around the site were very helpful.I would recommend"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Andrew Nash",
          "Nb_Reviews": 3,
          "Date": "2020-12-02T23:29:53.000Z",
          "Titre": "No Paypal option",
          "Contenu": "There is a lot more you can do with this website builder one thing that is crucial is a paypal button millions of people use paypal and not having that option added to the builder is a step back. Adding paypal to the builder should be mandatory for every website builder no matter who it is. Other than that i am happy with the website builder add paypal then i would be over the moon and will give you full star rating."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Emily",
          "Nb_Reviews": 1,
          "Date": "2020-11-18T11:16:52.000Z",
          "Titre": "Really easy to set up and my website…",
          "Contenu": "Really easy to set up and my website looks professional. The payment side could be slicker and isn't really fit for purpose for UK users wanting to do bank transfers, but I am hopeful that Tech Support will sort this out for me. Fingers crossed or I will have to move my webshop elsewhere. Also wish there was more functionality to really bespoke the data capture on order form."
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "Laura",
          "Nb_Reviews": 1,
          "Date": "2020-09-18T22:09:27.000Z",
          "Titre": "The platform works quite good",
          "Contenu": "The platform works quite good, there are some things to adjust or add but it's ok. I'd like a real blog section with RSS service.The customer service is a bit disappointing. Sometimes I ended up solving issues on my own, or the explanations were not so clear. Moreover, the missing chat service doesn't help to speed up the process. Web security works great, as well as keywords positioning, although a bit delayed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "K Jones",
          "Nb_Reviews": 1,
          "Date": "2021-02-04T21:52:25.000Z",
          "Titre": "If there would Be been no hiccups it…",
          "Contenu": "If there would Be been no hiccups it would definitely be 5 stars no doubt so far! But you have charged my card 5 times, and attempted another 4... You registered the wrong domain name (mispelled) it was supposed to be Wreckinkrew.com you registered Wreckikrew.com... So I had to use my free extra domain to fix the problem. Once I got that done the services are great. Just tighten up the analytics and for the love of god refund me my $54.00 or give me credit please. Thank you,Kuper Jones"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "AddictionbyAngel",
          "Nb_Reviews": 1,
          "Date": "2020-11-18T23:53:40.000Z",
          "Titre": "Deposit Time to long",
          "Contenu": "This site is ok but the turnaround time for deposit of funds is what I do not like. Thinking of switching back to shopify for this reason. With shopify it only takes maybe  2 business days to receive funds once a purchase is made on your site. If that could be changed for Webador then I would give 5 stars."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "user",
          "Nb_Reviews": 11,
          "Date": "2020-07-21T12:07:18.000Z",
          "Titre": "l started with webador for two sites we…",
          "Contenu": "l started with webador for two sites we use, our charity site is great, using them l thought was great and the best l used and have used many.However, when it came to our webshop site, it  has now changed our mind, to get payments set up is a nightmare, l don't know where they got their ideas for Mollie, it is more like Molly Sugden than Molly payments, l have emailed several time with no joy and am now reconsidering our webshop options and will look to delete my account at end of day."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "PrisvilleMC",
          "Nb_Reviews": 1,
          "Date": "2020-11-26T00:41:22.000Z",
          "Titre": "Quick & Easy websites",
          "Contenu": "Easy to use, and great for those who want to setup a website as quickly as possible. It's very efficient and it also has a friendly UI. Only issues was understanding the limitations within website customisation. With a website like WIX you can do a lot more. But this is cheaper and easier!I had a hard time setting up DNS records and a few other advanced features. So maybe it might be worth giving the user more options and customisation with that.Overall, great service for what I needed! (It takes a while to get used to the limitations.)"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michelle",
          "Nb_Reviews": 1,
          "Date": "2021-06-15T08:52:07.000Z",
          "Titre": "First off I thought I was getting a…First off I thought I was getting a free webpage start it was a trial basis but after I clicked the button it says I’m in it for a whole year I’ve tried to cancel a",
          "Contenu": "First off I thought I was getting a free webpage to start. I thought it was a trial basis but after I clicked the button it says I’m in it for a whole year. I’ve tried to cancel but it said, because I didn’t cancel within a month that I can’t cancel. I think that’s a bunch of bull. I’ll tell you what starting next year they can go ahead and cancel me. You  asked me for a review that’s a review because on top of all that, it does not do what it’s supposed to do,and when I asked for help at your email I get crickets. I tried to email another email but I’m too old to go back-and-forth like this."
        },
        {
          "Note": 3,
          "Lieu": "NO",
          "Pseudo": "Qwerr Ftt",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T03:39:55.000Z",
          "Titre": "more features"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Caroline",
          "Nb_Reviews": 1,
          "Date": "2020-08-11T00:16:22.000Z",
          "Titre": "Webador is a good first time website",
          "Contenu": "Webador is a good first time website. Because I have the free option there is not too much I could include. Primarily basic things. I am not sure if people can comment even though I did apply that feature to my site. It seems that the upgrade (pay option) is best."
        },
        {
          "Note": 3,
          "Lieu": "FI",
          "Pseudo": "Simon",
          "Nb_Reviews": 2,
          "Date": "2020-04-22T21:36:43.000Z",
          "Titre": "great layout but when you start to add…",
          "Contenu": "great layout but when you start to add languages and live chat and cookies the is then covered up by the live chat and unable move the flag links into headers where people can find them quickly without scrolling down to footer would be handy to have"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Naria brown",
          "Nb_Reviews": 16,
          "Date": "2020-09-26T12:46:37.000Z",
          "Titre": "So far I've found the experience mixed.",
          "Contenu": "So far I've found the experience mixed. A solid 3 though until issue is fixed.Really easy to make the website and store as required. however and this is a major problem  the stripe payments did not code properly due to a slight break in connection and there seems to be no way to reset the connection. I have done what webador advised and revoked authorisation which means webador is no longer connected to my stripe. No way of reconnecting as it still says accepting payments via stripe meaning I've currently lost customers over past few days £170 worth to be exact due to payment error and no way for me or them to fix it"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "owner of Freedom Life Ministri",
          "Nb_Reviews": 1,
          "Date": "2022-11-13T12:31:29.000Z",
          "Titre": "Quicker response time with customers"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "David",
          "Nb_Reviews": 11,
          "Date": "2021-06-04T20:51:42.000Z",
          "Titre": "The web page is easy to set up.",
          "Contenu": "The web page is easy to set up and looks good.The only bad point about it is that there’s not a lot of choice on what you can do on the web site unless you pay for it. All in all it’s a good free website."
        },
        {
          "Note": 3,
          "Lieu": "BE",
          "Pseudo": "Yeed",
          "Nb_Reviews": 1,
          "Date": "2020-11-26T07:31:02.000Z",
          "Titre": "It is simple to use but can be improved",
          "Contenu": "It is simple to use. Really easy to make the website and easy to store as well. And really not expensive. The platform works very well but there are options which needs to be adjust or add. Design options are limited."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "emron",
          "Nb_Reviews": 1,
          "Date": "2021-07-23T13:14:32.000Z",
          "Titre": "pretty good but can use some updates",
          "Contenu": "i really liked the templates and the easy to share websites but i couldn't add more than two photos to a page and if i added two i couldn't have anything else i really got annoyed at that"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Theresa",
          "Nb_Reviews": 1,
          "Date": "2021-12-01T00:27:14.000Z",
          "Titre": "I really appreciated what you offered…",
          "Contenu": "I really appreciated what you offered and the price Was awesome. I am notGood at this lind of thing so it wasn’t right for me. The customer service was awesome."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Trisha",
          "Nb_Reviews": 1,
          "Date": "2021-11-09T23:19:15.000Z",
          "Titre": "Writing code",
          "Contenu": "The website is ok. I dont like how you have to write code( know how, or have to hire a coder) in order to accept payments with stride.Update 11/21 problem solved."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Aubrey",
          "Nb_Reviews": 1,
          "Date": "2021-02-02T00:31:18.000Z",
          "Titre": "I am still in the process of putting…",
          "Contenu": "I am still in the process of putting everything together. I've never put together a website before and it seems to be going very smooth so far. Monthly price is affordable."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Faltereg",
          "Nb_Reviews": 1,
          "Date": "2022-09-15T22:38:01.000Z",
          "Titre": "Not bad",
          "Contenu": "Not bad, decent layouts, do t like that logos on web vs mobile cut off or become too small"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2022-03-28T21:11:37.000Z",
          "Titre": "Was good",
          "Contenu": "Was good, but then you have a banner running through your site saying 'click here for free website'.  Trying Google sites now."
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "Jean-Jacques",
          "Nb_Reviews": 1,
          "Date": "2022-05-15T08:37:06.000Z",
          "Titre": "très simple  point positif",
          "Contenu": "très simple  point positif pas possible de mettre de diaporama sur ou de widgets pas de newsletters en version gratuite"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T13:49:14.000Z",
          "Titre": "It’s good and easy",
          "Contenu": "It’s goo and easy"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Traci",
          "Nb_Reviews": 1,
          "Date": "2021-10-25T10:32:38.000Z",
          "Titre": "I love using webador but I really wish…",
          "Contenu": "I love using webador but I really wish there was an application for it instead of having to get on a web browser to use it!"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2022-02-11T21:56:02.000Z",
          "Titre": "Easy to build and nice free URL",
          "Contenu": "Easy to build and nice free URL. But unfortunately even a photogallery only works for Premium Accounts."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lackbrain",
          "Nb_Reviews": 1,
          "Date": "2020-11-09T22:10:45.000Z",
          "Titre": "Love the templates hate that I have to…",
          "Contenu": "Love the templates hate that I have to pay to attach my domain name so it doesnt mess up the mobile platform experience"
        },
        {
          "Note": 3,
          "Lieu": "MT",
          "Pseudo": "Jerome",
          "Nb_Reviews": 1,
          "Date": "2020-09-18T02:58:22.000Z",
          "Titre": "Webador - Yes or No?",
          "Contenu": "Dont get me wrong here, Webador is very good, cheap and a straightforward website builder (which really and truly everyone wants). However, the builder lacks a modern and refreshed set of templates, lack of in-depth customization and worst of all, the online payment method for your store does not have PayPal partnered up with it. Other than that, its a great builder and although sometimes you’ll come across some “German” words (I think its German lol) the website builder doesn’t shy out on helping you to solves all your questions. Lastly, its statistics page is amazing...only if you live in certain countries - so if you’re like me, living on a small island called Malta, then you are quite limited to statistics based on you location.Yes - You would use this builder due to its simplicity to use, pricing and “what you get” for your money’s worth. Oh, and also because its a good way to start learning how to build a website.No - It lacks loads of things (read above) than I would need to use regularly and this end up trying to find a way to do what I intended to..hence waste time."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2021-10-03T21:35:27.000Z",
          "Titre": "Website slow to load",
          "Contenu": "Website slow to load. Easy program in designing what I want. Would be easier if it had drag and drop."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "filosofia-aqui-ahora",
          "Nb_Reviews": 1,
          "Date": "2022-07-20T04:49:11.000Z",
          "Titre": "Is not really open as a full tool box",
          "Contenu": "Is not really open as a full tool box to interect with the worl wide web."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Miss Sharron Rosa Giles",
          "Nb_Reviews": 21,
          "Date": "2021-10-05T11:54:36.000Z",
          "Titre": "They not only an amazing website…",
          "Contenu": "They not only an amazing website provider,but are a great support as you build one !¹!"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Katie",
          "Nb_Reviews": 1,
          "Date": "2020-07-04T20:38:53.000Z",
          "Titre": "My website",
          "Contenu": "Very simple and easy to use I appreciate everything and was so pleased with my domain nameThankyou"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mai",
          "Nb_Reviews": 1,
          "Date": "2021-02-15T22:19:28.000Z",
          "Titre": "Some of your practices are deceptive",
          "Contenu": "Some of your practices are deceptive. That is why we left as a customer. Good luck. Thank you"
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Georgia",
          "Nb_Reviews": 2,
          "Date": "2020-04-25T09:11:56.000Z",
          "Titre": "I don’t like the location settings",
          "Contenu": "I don’t like the location settings. In Shopify you could see exactly the city and a live moment."
        },
        {
          "Note": 3,
          "Lieu": "ES",
          "Pseudo": "Felicia",
          "Nb_Reviews": 1,
          "Date": "2020-04-23T11:52:39.000Z",
          "Titre": "I can not understand how to configure…",
          "Contenu": "I can not understand how to configure the pixel of Facebook and Google Search Console on the web"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "RE",
          "Nb_Reviews": 1,
          "Date": "2022-05-11T21:27:32.000Z",
          "Titre": "Straightforward",
          "Contenu": "Only new to the site, but seems pretty straightforward and easy to use."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rachel Smith",
          "Nb_Reviews": 3,
          "Date": "2020-09-03T13:22:38.000Z",
          "Titre": "The webpage is easy to understand",
          "Contenu": "The webpage is easy to understand. There is a lot of options and the price is right."
        },
        {
          "Note": 3,
          "Lieu": "TR",
          "Pseudo": "Edmond Che",
          "Nb_Reviews": 1,
          "Date": "2021-04-20T19:59:56.000Z",
          "Titre": "I enjoyed using the webador",
          "Contenu": "I enjoyed using the webador. But for no reason am not able to host a site again."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Young",
          "Nb_Reviews": 1,
          "Date": "2021-04-01T22:51:48.000Z",
          "Titre": "It is ok",
          "Contenu": "It is ok, the site builder goes down at times. But it's very simple to use."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "threep",
          "Nb_Reviews": 13,
          "Date": "2020-07-31T19:37:09.000Z",
          "Titre": "Wont allow you to use your own web…",
          "Contenu": "Wont allow you to use your own web address unless you upgrade to pro."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "IcyBoiAndyy",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T17:15:05.000Z",
          "Titre": "I poooooopyd"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Samir",
          "Nb_Reviews": 1,
          "Date": "2020-07-04T09:23:06.000Z",
          "Titre": "Great experience!",
          "Contenu": "I am new to use webador, learning and enjoying the experience."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Pretti Bulsara",
          "Nb_Reviews": 2,
          "Date": "2020-05-11T14:29:47.000Z",
          "Titre": "Overall good but unable to upload a…",
          "Contenu": "Overall good but unable to upload a background of my choice."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sheron",
          "Nb_Reviews": 2,
          "Date": "2020-10-23T21:06:24.000Z",
          "Titre": "The free option is just a ploy to get…",
          "Contenu": "The free option is just a ploy to get people to upgrade."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "A person",
          "Nb_Reviews": 2,
          "Date": "2021-01-23T14:38:44.000Z",
          "Titre": "really good",
          "Contenu": "really good website though some things are money"
        },
        {
          "Note": 3,
          "Lieu": "MU",
          "Pseudo": "ANDREW",
          "Nb_Reviews": 1,
          "Date": "2021-10-18T11:14:32.000Z",
          "Titre": "Can't accept payment from mauritius."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-08-21T22:31:59.000Z",
          "Titre": "Simple and adequate"
        },
        {
          "Note": 3,
          "Lieu": "GR",
          "Pseudo": "Giakoumhs",
          "Nb_Reviews": 1,
          "Date": "2020-07-09T20:48:17.000Z",
          "Titre": "Pretty decent cool looking and easy to…",
          "Contenu": "Pretty decent cool looking and easy to use"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "ethel",
          "Nb_Reviews": 1,
          "Date": "2022-03-02T02:53:41.000Z",
          "Titre": "goood",
          "Contenu": "goood so far  will see how it go"
        },
        {
          "Note": 3,
          "Lieu": "BE",
          "Pseudo": "Philip",
          "Nb_Reviews": 1,
          "Date": "2021-12-30T21:12:21.000Z",
          "Titre": "De handleiding kan beter dacht ik."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dolly",
          "Nb_Reviews": 1,
          "Date": "2022-06-06T10:57:48.000Z",
          "Titre": "Our experience is great!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2023-02-19T04:16:57.000Z",
          "Titre": "3 stars",
          "Contenu": "I give 3 stars."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chrysanthemum",
          "Nb_Reviews": 1,
          "Date": "2022-02-08T09:54:41.000Z",
          "Titre": "Nice Website Builder with Limited Url linking",
          "Contenu": "Update: I was the very 1st reviewer on Trustpilot.I was asked to make a review in exchange for a free ad site, which has not been applied yet, even though I contacted them.In reply to Webador's answer on my review, I don't think they grasp what I was teaching them in terms of good marketing to gain more users. I did not say I wanted to upload my own videos. I only want to insert video links from another video host platform other than youtube. I can't use their product if I can't even see if a simple html video link would work. Because of this Webador restriction, I found I can create and publish a static html website and link non-youtube videos for free on other platforms.While Webador got a respectful, and balanced review and free marketing advice from me.Original Review:I like the website builder. Its very user friendly and not complicated.I have a small website that is just for a few viewers so I find the free plan is all I would need, but I found out stumbling block after much time as I made a few pages.I have my videos stored on a video streaming host that is not youtube or vimeo. The price to level up in order to place a url of a video not on youtube or vimeo is too high. FYI: Paying is also required to use Embed html vids.If they changed the Free plan to ALLOW videos hosted on other platforms -  then I'd say this is a great place. They can do this by allowing special categories in the free plan to have this feature. For example: For very small websites like a memorial site or Special categories/something like that - which could be a good marketing tool and bring more popularity to this site.(Which would help them as usually cdn hosted video and images are a lot faster, smaller and secure that would help their server end, especially since they wouldn't be uploaded) So to offer this in the Free category woud help them/not hurt them, as to pay only to use non-youtube or non-vimeo links can be a deal breaker and stop growth in future customer base/relationship.If you only have images or just words then this would be a good way to go. You will have their subdomain website name.I hope they will allow video urls from other hosts cdn's or embed vid players in the free plan feature, Soon. Then people can see if its worth it to pay in the future if their website grows."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2021-10-25T10:34:12.000Z",
          "Titre": "Okay",
          "Contenu": "Okay site can't complain"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Alexander",
          "Nb_Reviews": 1,
          "Date": "2020-07-10T11:46:49.000Z",
          "Titre": "This user did not write a review"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Builder",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T22:45:18.000Z",
          "Titre": "Easy to use, needs photo batch upload",
          "Contenu": "The Website builder is fairly easy to use. The only thing I would like to see improved is the ability to upload a bunch of photos at once as we have photos on multiple devices which we would like to use on the site. This would require only one login per device rather than sorting through and selecting individual photos to go with certain content."
        },
        {
          "Note": 4,
          "Lieu": "IE",
          "Pseudo": "Billy Jackson",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T17:26:26.000Z",
          "Titre": "One of the best website designers",
          "Contenu": "This website has made it super easy to design a good website, and it’s really cheap!Only thing missing is a free trial, but I’m paying for the premium version anyway so that doesn’t matter!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Torrence",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T04:10:23.000Z",
          "Titre": "I like the way the website looks I like…",
          "Contenu": "I like the way the website looks I like how easy it was to build a website but I haven't had problems with one thing and that is the drop shipping I can't figure out how to get the product and put on my site to sell other than that is a great website builder"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jena",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T21:36:38.000Z",
          "Titre": "Great Walkthrough",
          "Contenu": "One thing I really appreciated was the walkthrough video that guided me on the basics of how to build my website. Once I got the hang of it, I felt at ease putting it all together. While i do like all the options that are available to me for free, my only complaint is that even though I don't get to choose my domain name, I should at least receive a domain name that has something to do with my website, and not just a bunch of numbers."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Em",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T18:12:02.000Z",
          "Titre": "Easy to Use",
          "Contenu": "Good to use, a few more limited functions and diplsays, but it was really easy to get things working and edit the templates to what I wanted. Would Recommend!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Angela Warren",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T09:14:36.000Z",
          "Titre": "Everything was easy to use",
          "Contenu": "Everything was easy to use, easy to design, and guided very well. The only thing I am really missing is the setup to sell digital products easily"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shelby GT",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T22:52:14.000Z",
          "Titre": "I have two sites with Webador",
          "Contenu": "I have two sites with Webador, for my small businesses.  Both are intuitive, fast and ranked pretty quickly with all pages optimized. My only issue is the email is not that great, from the way it sorts emails when you move them into a folder, it shows you who sent it, not who you sent it to.  Not very helpful.  Then also been having some issues, with the mail forward filters to my main provider.  Other than that, the website builder was great has all the modern features one would want."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JBS",
          "Nb_Reviews": 3,
          "Date": "2023-12-08T02:33:50.000Z",
          "Titre": "Tool is intuitive and very easy to use.",
          "Contenu": "Tool is intuitive and very easy to use.But more online help needs to be available, especially around setting up and using products and the limitations placed on those."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Ainaras Luste",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T05:44:59.000Z",
          "Titre": "Independently living your life",
          "Contenu": "Easy learn and easy to use help and support customers online questions and answers straight away. Step by step guidance. And lots more."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Justin Perron",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T13:59:54.000Z",
          "Titre": "Good experience",
          "Contenu": "Overall nice company, they provide some pretty unique and useful services. Also their customer support seems to be very well mannered. All considered I'm no professional website builder or designer, none of that. But I'd definitely recommend Webador as they may just have what your looking for, and more."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Fitzs",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T02:38:27.000Z",
          "Titre": "I do like the website platform",
          "Contenu": "I do like the website platform, it is easy to use, but I just wish the subdomain was the name of my site, but it's not my decision and the other feature of the color pallette back. I'm disabled and sick and can't afford the upgraded packages. I had a weebly site about 10 yrs ago. I like these drag and drop platforms. Thankyou"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "owner of KittyzShack",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T05:22:48.000Z",
          "Titre": "I really like my new website with…",
          "Contenu": "I really like my new website with Wedador. BUT, you need to allow longer videos to be uploaded. I share more than you allow.  Please consider."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eva",
          "Nb_Reviews": 3,
          "Date": "2023-10-16T22:31:15.000Z",
          "Titre": "Misunderstanding",
          "Contenu": "I like Webador but I didn't understand what I was getting into.  I wanted to design a blog website for myself.  However, it seems like I really need to upgrade in order to be successful at doing this.  I thought I would be able to build my own website, but I guess that won't be happening.  I do understand that my domain will be available to me for a little under a year, at this time.  I appreciate you, but I made a mistake."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T06:59:04.000Z",
          "Titre": "Easy to Use But Limited Web Building Tools!",
          "Contenu": "Overall the site building tools are innovative and very easy to use, which can be helpful building a website in a hurry. These tools however could be more exciting for example if webicon, and banners, short video clips maybe allowed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Sheppard",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T16:24:26.000Z",
          "Titre": "Overall experience",
          "Contenu": "Has a nice selection of templates to choose from, easy to use and build your site. Like that it transitions and adapts to whatever device your using. Only couple downsides that I've found. One is the color spectrum. Wish there were more colors to choose from when designing the pages. Second wish you could add extra social media buttons, like Instagram, TikTok, SnapChat. Otherwise I think Webador is great."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Njord Grjotgardsson",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T23:02:32.000Z",
          "Titre": "I think that Webador helped me create a…",
          "Contenu": "I think that Webador helped me create a creative and useful website."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David D.",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T14:02:38.000Z",
          "Titre": "Even I can do this :)",
          "Contenu": "Easy to use and at least to me, it has a professional look without spending hundreds or thousands for website design.The only thing I am disappointed in, is the very limited number of items you can have listed for sale at the level I am, but my little side-gig doesn't warrant spending more.That said, I highly recommend!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "owner of Cookieboy/afira.com",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T21:16:04.000Z",
          "Titre": "I like It but I wish I didn't have the… webador logo",
          "Contenu": "I like It but I wish I didn't have the webador logo at the bottom of I and you can't get I off with out paying but everything els Is good"
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Edgard Abadia",
          "Nb_Reviews": 2,
          "Date": "2023-09-16T08:44:40.000Z",
          "Titre": "Good service and product",
          "Contenu": "Good service and product. The title and Page editing could be more flexible and with more options for designing. I'm content with their system but hopeful for improvements on features in the future. I would recommend Webador for a web site indeed. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shadymist Kennel, LLC",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T17:06:57.000Z",
          "Titre": "Overall Great Product",
          "Contenu": "Overall, absolutely the easiest and most efficient web builder site I've used to date, including GoDaddy's and Wix. I had my basic site up and running in a few hours, and within a week I'd already had a decent amount traffic.My only complaint is turn around time for that \"professional help\" we were promised when we signed up. But, even with that one irritation, I'm still quite happy with the product and definitely recommend it."
        },
        {
          "Note": 4,
          "Lieu": "RU",
          "Pseudo": "_nkydn",
          "Nb_Reviews": 1,
          "Date": "2023-04-29T12:06:10.000Z",
          "Titre": "Very nice, but…",
          "Contenu": "A very easy-to-grasp and nice website builder, with excellent drag-and-drop features. I like how easy it is to build and launch a website.However, here are my suggestions:1. Ability to import my own “modules” instead of being stuck with the templates2. A revised look, the current one is quite dated3. Animated backgrounds"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Me",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T11:58:30.000Z",
          "Titre": "Amazing experience on Webador!",
          "Contenu": "Webador is by far the best free website maker out there! It's free and super easy and simple to use! Every aspect of the website I made with it is amazing, and I'm a complete amateur! The only problem is that you can't embed on a free plan. You also get a free subdomain in the free version of your choice. You do get a professional domain in the paid plan, though. Overall, I'd highly recommend Webador as the number one website maker. It's even better than website makers that are not free, such as Squarespace!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-08-12T02:42:52.000Z",
          "Titre": "Easy for beginners, not for Pros.",
          "Contenu": "I like the ease of use, the tools available make it easy for someone with no coding experience. However, as a Website Designer/Developer, I find it too restricted. I can't truly develope my ideal website."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Marty Green",
          "Nb_Reviews": 9,
          "Date": "2023-04-18T00:29:30.000Z",
          "Titre": "The app is easy to learn within a few…",
          "Contenu": "The app is easy to learn within a few hours; had a website up and running pretty fast. The site looks good on Desktop and Mobile, and with Webador Help and SEO auditors we got an A ranking for SEO. The Webador servers are pretty responsive with a decent internet connection our end.Dislikes: can't seem to place images where we want them on pages. Cheers."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 5,
          "Date": "2023-03-09T11:52:39.000Z",
          "Titre": "Flexible",
          "Contenu": "Email response is generally quick and to date, always completely address my question(s). We have just established the website (and part of it is live).The HELP files are good, but hopefully, in time, they will address more specific needs.Have viewed several of Webador YouTube videos and they too have been helpful."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "topvint",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T07:50:19.000Z",
          "Titre": "Easy to design with no knowledge",
          "Contenu": "Easy to design with no knowledge, although sometimes there is too much rigidity in the simplicity. Also there is no need for whois information which can be useful for some"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "STEPHEN TEUMA",
          "Nb_Reviews": 5,
          "Date": "2023-05-17T11:14:31.000Z",
          "Titre": "Can't be found using Google Search",
          "Contenu": "Creating the website for my hobby club was fairly easy and looks very professional. The only negative I have a present is that 'google search' will not be able to find the Free site as Webador won't enable google links unless you use one of their paid for plans. The site is totally accessible if you type in the https address but not if searching."
        },
        {
          "Note": 4,
          "Lieu": "MY",
          "Pseudo": "Nomadpix",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T17:10:55.000Z",
          "Titre": "Quick, easy and intuitive Editor",
          "Contenu": "It's what I was looking for....a variety of professional templates to choose from. Easy and intuitive Editor, that gives you many options. It allows you to choose the most suitable design to build your website and customize it to your own liking. A very interesting stock image gallery... especially if you use the search option.The only reason I didn't give 5 stars is that I initially found it a bit difficult to add text to an image... because when I tried to change something like the font, color, etc... it wouldn't retain the other settings.... but I was pleased to note that this problem was promptly fixed after a few days!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T16:20:03.000Z",
          "Titre": "I am a senior and not computer savy",
          "Contenu": "I am a senior and not computer savy, your page making system has been easy to us and works well for our Facebook Group for those folks that don't like to use Facebook, thanks! :)"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Shane farrow",
          "Nb_Reviews": 5,
          "Date": "2023-09-19T06:20:02.000Z",
          "Titre": "Fantastic easy to use",
          "Contenu": "Fantastic easy to use, could do with some more features such as a news letter sub option but overall great value for money"
        },
        {
          "Note": 4,
          "Lieu": "PT",
          "Pseudo": "ilze",
          "Nb_Reviews": 3,
          "Date": "2023-04-22T11:07:21.000Z",
          "Titre": "Easy for first time creators",
          "Contenu": "It is easy to navigate the uploads on the phone screen.  No need to have prvious knowledge for the webiste creation. However, some prior expereince with social media, online survey creation sites, video editing may be helpful."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Melody Li",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T03:24:37.000Z",
          "Titre": "Great website builder",
          "Contenu": "A very nice and user-friendly website builder with a good number of features. The only feature/setting that I wish the free version has is the ability to configure/edit shipping methods. More specifically, I wish that I am able to deselect the “Shipping costs - $7.50” under “Shipping” for all of my products, as that’s not the cost of shipping that I would like to set for my products. I wish that I could set the “Shipping” line to blank…."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "owner of Body Care By Thea",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T20:27:26.000Z",
          "Titre": "Simpler than I thought to set up.",
          "Contenu": "This is my first time using Webador to create my very own website. First of all, the price is very reasonable if you're a small business owner like me just starting out. The templates are easy to select, the actual set up takes very little actual technical knowledge to complete. They also have helpful tips to guide you in the process, as well as a customer support team. I would recommend anyone starting out to use Webador for it's simplicity to get your webshop up and running. Easy to use, easy to set up and easy on your wallet or purse. 💰 👜"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William Swisher",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T14:20:17.000Z",
          "Titre": "OK I guess",
          "Contenu": "The ease of use to create a website with your online platform is fine. I just don't know if someone actually visited my website and tried buy something. I thought was supposed to send an email with someone hopefully buying something but I was not sure if I set it up right. I suspect that I did set it up correctly I just would need to invest in bulk email marketing so as to bring to people to my website. But anyway I am trying to sell personal items at this point and not wholesale products at least for now."
        },
        {
          "Note": 4,
          "Lieu": "BO",
          "Pseudo": "Bruce",
          "Nb_Reviews": 1,
          "Date": "2023-04-30T15:56:06.000Z",
          "Titre": "I enjoy to use Webador",
          "Contenu": "I enjoy to use Webador, It provides us with useful and easy-to-use tools to create a page that is accessible and comfortable for our users. I recommend Webador to start positioning yourself on the web. As a suggestion I note that in the \"Comments\" section they allow Disqus to be installed. Thank you"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Steve Taylor",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T16:07:00.000Z",
          "Titre": "A truly excellent website platform",
          "Contenu": "A truly excellent website platform. Stylish templates, good selection of features, really easy to use (even for a complete novice) and excellent value."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Ian  Holt",
          "Nb_Reviews": 5,
          "Date": "2023-09-27T17:26:49.000Z",
          "Titre": "Website looks good now but not as easy…",
          "Contenu": "Website looks good now but not quite as easy to set up as they would have you believe. However they do offer quite a bit of support and handy tips. We're just starting out and this is our first attempt at a website. We will see where this goes."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "owner of naturalchemy",
          "Nb_Reviews": 1,
          "Date": "2023-02-18T10:49:02.000Z",
          "Titre": "Webador makes things really simple to…",
          "Contenu": "Webador makes things really simple to build an effective website, especially for someone like me that has no previous experience.  If there's one thing I'd like to be able to add it would be the ability for a client to select their own price rather than having only fixed options, I operate on a basis that people pay what they feel my services are worth or what they can afford."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Catherine",
          "Nb_Reviews": 5,
          "Date": "2023-10-18T20:56:21.000Z",
          "Titre": "Building a website is easy on Webador",
          "Contenu": "Building a website is easy on Webador, however, a widget for followers would be great since I'm a blogger."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marcus",
          "Nb_Reviews": 3,
          "Date": "2023-10-25T14:40:21.000Z",
          "Titre": "This is a New project for me and my…",
          "Contenu": "This is a New project for me and my first experience with Webabor.I look forward to better service and support for the future."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Douglas",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T21:44:10.000Z",
          "Titre": "I recently created my site",
          "Contenu": "I recently created my site and the process went smoothly. It is not a business site but more of an information site for a nonprofit organization. We do not sell any products and a majority of the options are not for me. I do wish I there was a more detailed tutorial for 1st time users."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Zachary",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T23:15:54.000Z",
          "Titre": "Webador is very easy to use and get a…",
          "Contenu": "Webador is very easy to use and get a store going. It is extremely simple to do. I highly recommend it. Customer service was helpful and quick to respond, namely Vanessa who replied to me each time. The only reason for 4 stars is their lack of payment options. Stripe and PayPal are offered but not all of the services of Stripe are available to webador, namely CashApp Pay. if that isn't a big deal for you, then webador will be great for you."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T15:51:31.000Z",
          "Titre": "Great website outline",
          "Contenu": "Great website outline, helped us promote our business well!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tonya",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T15:12:24.000Z",
          "Titre": "I like the different options I have to…",
          "Contenu": "I like the different options I have to design the website."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lee",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T15:53:14.000Z",
          "Titre": "GREAT SITE TO BUY",
          "Contenu": "The first is price.. The second is buying the domain and getting an email included with the domain purchase. I'd like the web page creation tool to be easier to use. It's not easy changing pictures and getting those pictures in place to stay from page to page. That's it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "N.M,",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T16:11:09.000Z",
          "Titre": "Ease of use, but most analytics aren't free to access",
          "Contenu": "I like how easy it was to create my website and I am grateful for the free option. I just wish I could view more analytics without having to pay."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "owner of A&H Handyman",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T22:43:09.000Z",
          "Titre": "It was easy and free to set up my…",
          "Contenu": "It was easy and free to set up my webpage with webador and I'm not good with this kind of stuff but was Easley able to accomplish creating a website for my business,thank u webador"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "owner of Bryant Remodeling",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T04:55:57.000Z",
          "Titre": "Well the website was easy to work with…",
          "Contenu": "Well the website was easy to work with the only thing I can’t figure out is how to get it on google? Can anyone help me with that"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Becky Davies",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T20:53:17.000Z",
          "Titre": "Great layout and easy interaction and tips.",
          "Contenu": "The set up and the easy layout. I have bad dyslexia so it was a god send to me. Only part is the price of the not free but once I make sales I will be able to do that part but can't contemplate paying out when making nothing it's sad but true."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "owner of hashbang guitarings",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T01:03:20.000Z",
          "Titre": "site not being indexed by Google",
          "Contenu": "I would rate it 5 starts but my site isn't getting indexed by Google and I'm very frustrated"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "owner of J. Lloyd's NetWorks",
          "Nb_Reviews": 1,
          "Date": "2023-06-11T04:51:32.000Z",
          "Titre": "What I think",
          "Contenu": "I gave it 4 stars and not five because even though the cost is more than reasonable, I don't believe they don't give the personal support that is needed to start a website for someone just starting out. Everything must be done by the one starting the website in detail and it takes a very long time, when if there was more help and make it easier to get the help you need building your website would be not so upsetting. The idea of building your own website should be fun and exciting not a drudgery agony and time consuming. It was the price that got my attention and I thought even though I knew it would be more challenging and it would take more time I could get all things worked out. But for the whole of it, this is a pretty good place to start a website, they give you information where to go to do what you need to do and it is easy to see."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "GemNi",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T14:23:07.000Z",
          "Titre": "Webador - Your One Stop",
          "Contenu": "I was skeptical about trying webador because I had tried several web builders and got stuck at a point in time.  Once you get hooked on Webador, you can't stop. Building a website with Webador is like playing a computer game. Webador is easy to master, and the features suit my needs."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Rob",
          "Nb_Reviews": 3,
          "Date": "2023-06-10T10:44:27.000Z",
          "Titre": "When I had a query they got back to me…",
          "Contenu": "When I had a query they got back to me via email what would be better have phone support so any issues can be sorted whilst on the phone or video chat"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Owner of THE A HARLAN FOUNDATI",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T02:57:42.000Z",
          "Titre": "CEO/Founding Member",
          "Contenu": "Its a great site, just don't know how to add my employee's email address's and add more pages"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "phill clark",
          "Nb_Reviews": 3,
          "Date": "2023-12-05T13:39:49.000Z",
          "Titre": "It’s fairly straightforward to use."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "AVM",
          "Nb_Reviews": 20,
          "Date": "2023-10-04T12:43:06.000Z",
          "Titre": "I loved using Webador to build my…",
          "Contenu": "I loved using Webador to build my online shop. Hence the four stars. It would have been 5 stars but I have deducted a star for the amount of time it takes to get a response to a request for help.Webador is my 2nd attempt at building an online shop. The 1st was one of the biggest providers in the UK and was way more complicated than Webador. I'm so glad I made the swap. I'm a complete novice and technophobe but Webador made it easy.The only thing that changed my experience from 5 stars to 4 stars is the manner in which you have to request help. I knew at the outset that there would be no telephone support. That wasn't an issue. I had assumed, wrongly it seems, that there would be a webchat facility. But in fact, the support is essentially by email. This is very frustrating when you have what should essentially be a short question to answer, but you have to send an email andcwait for a response. You can wait anywhere up to 24 hours to hear back from them. During that time my webshop is probably loosing money because customer have no idea how the cursor functions and there's not an obvious setting to change it from hover to click. The help guides can be difficult to use as well.I wouldn't want to go to another company. But I would rather be placed in a queue on a live chat than be frustrated waiting for an email that may take 24 hours be sent."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Dixie",
          "Nb_Reviews": 2,
          "Date": "2023-01-27T10:37:40.000Z",
          "Titre": "The best thing was seeing my artwork…",
          "Contenu": "The best thing was seeing my artwork displayed on screen and knowing that potentially lots of other people could do the same . It like having a personal art gallery that comes to your door."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Allan",
          "Nb_Reviews": 2,
          "Date": "2023-11-14T21:28:34.000Z",
          "Titre": "Great for my business",
          "Contenu": "Great for my business - small operator, has everything I need"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shelly",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T04:00:09.000Z",
          "Titre": "Good Website Builder With A Few Flaws.",
          "Contenu": "I was browsing around for a website builder, and I have tried a couple such as Weebly and Wix.Then I stumbled across Webador as I was searching around, and I noticed that the features may seem too good to be true at first, and it is somewhat.A gripe that I have with Webador is that it doesn't really tell you what features are exclusively for Pro or Business when you edit your website until you try to use them.  Yes, I am aware that they provide a list of what tiers have, but I think it would be beneficial if it some of the features, such as the photo album, would have like a label that only Pro/Business account can have.  Lite allows you to have a custom domain, but that's it.It would be nice if said features would allow you to toy them, but it wouldn't be able to publish the site until it was deleted, but Webador auto-saves your work, which is really nice!  This would really benefit people to give these premium features a try before buying, even if Webador gives a generous discount in the first year of subscription.It's pretty straightforward and doesn't involve coding (unless you want to try your hand with custom HTML feature, which also requires pro/business account).Webador doesn't allow too much customization for different pages for free, in which their selling point is getting to the point and ease of use for other people, which it clearly shows!That being said, the Free plan offers quite a bit for those what want to give Webador a try.Other than that, Webador does have potential and their support has been fantastic!  They were able to answer my questions that I had for them!  However, support isn't immediate (seems like a 24 hour turn around) so I would keep that in mind.  Webador is also one of the more affordable website builders you can get.  I'm looking forward to see how Webador grows in a span of years."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kate",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T03:16:09.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use. Advanced features. It isn't perfect, but for the price, this is a good website builder."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T16:29:37.000Z",
          "Titre": "The Ability to make a Website without a Domain is the most useful part",
          "Contenu": "There are many tools to use and many things to do I like it"
        },
        {
          "Note": 4,
          "Lieu": "LV",
          "Pseudo": "Catdy",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T09:30:30.000Z",
          "Titre": "I like Webador",
          "Contenu": "I like that even in the free version of Webador, there are still many good features.It's very simple and understandable to make a website on your own!Good customer service, who reached out shortly after I asked for advice.I would like if there would be more ways to display photos and videos in the free version. The rest, I love!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gamedoor-check out on webador",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T04:09:15.000Z",
          "Titre": "Really free",
          "Contenu": "It is a great site, would love a few more features. Also had question of where the response to the contact feature went. Overall would recommend. When it says free it means it."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mr Mark Eaves",
          "Nb_Reviews": 2,
          "Date": "2023-10-06T22:14:31.000Z",
          "Titre": "For someone not really computer…",
          "Contenu": "For someone not really computer literate this was pretty straight forward. Defo recommend"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 2,
          "Date": "2023-06-30T06:10:14.000Z",
          "Titre": "All Is Well",
          "Contenu": "My experience has been great. The platform is so user friendly. I don't have a lot of tech knowledge, but all is well. I don't I could be critical at this point, because I am still learning the system."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Nash",
          "Nb_Reviews": 1,
          "Date": "2023-02-20T20:09:44.000Z",
          "Titre": "Nice Templates, Easy Editing",
          "Contenu": "I liked being able to develop a website that reflected my product.  The controls are very easy to use and I can edit the site from my phone.  I didn't give a 5 star because: 1. I'm in the US and this webbuilder has mostly EU options. 2. I wanted more options for payment. 3. I was looking for Weebly but chose Webador by mistake (mostly because they changed their name to Square) 4.  It takes 24 hours to get a response to questions through emails.  Ultimately, I have kept my account because the site is so easy to use."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Pat Regan",
          "Nb_Reviews": 12,
          "Date": "2023-10-31T18:38:24.000Z",
          "Titre": "Very useful and always great to see…",
          "Contenu": "Very useful and always great to see really free websites without hidden costs. Thanks."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "GMills",
          "Nb_Reviews": 3,
          "Date": "2023-05-26T22:01:55.000Z",
          "Titre": "Webador is simple to update",
          "Contenu": "Webador is simple to update, add to and the design interface quite intuitive. It’s great for our blog and gives plenty of scope to expand what we use it for too."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "He Cares T&E Center",
          "Nb_Reviews": 1,
          "Date": "2023-05-06T21:52:47.000Z",
          "Titre": "The ease of creating a Webiste is good.",
          "Contenu": "The ease of creating a Webiste is great. It would be nice to be able to have more selection for developing and creating text within the content of site pages."
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "Noah",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T02:40:35.000Z",
          "Titre": "Good",
          "Contenu": "It's good, but I wanted a tool that can make bots because I want to update videos automatically because everytime I upload a new video to my channel I have to manually change the video in my website."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "bobby gavin",
          "Nb_Reviews": 2,
          "Date": "2023-02-19T16:31:08.000Z",
          "Titre": "Very easy to use and feature packed",
          "Contenu": "Very easy to use in developing the website to meet our needs. We are a charitable collective so needed something to meet our financial restraints while offering a professional result, and Webador did not let us down."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Ma `n` Pa Kettle Sauces",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T09:56:22.000Z",
          "Titre": "A BIG THUMBS UP FROM US !!!!!",
          "Contenu": "ITS JUST SO EASY TO USE , from start to finish  my website seemed to come together without a hitch, lots of tools to use and everything you need at a click, have a try yourself and startup fees for releasing website or cheaper than i even thought"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T05:11:56.000Z",
          "Titre": "Platform is easier to use",
          "Contenu": "Platform is easier to use. No tutorial needed, I developed my website within short period of time."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Vanilla1",
          "Nb_Reviews": 4,
          "Date": "2023-06-08T12:11:04.000Z",
          "Titre": "Well although I have finally got the…",
          "Contenu": "Well although I have finally got the design right, webador are helpful and its easy to use the designer.I've had alot of visitors too."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Glady Besona",
          "Nb_Reviews": 1,
          "Date": "2023-02-09T03:38:13.000Z",
          "Titre": "Easy for beginners",
          "Contenu": "The company helps beginners to start their website with a free trial of $1 for three months. It's difficult to find this elsewhere"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joli",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T15:33:31.000Z",
          "Titre": "Very easy to use!",
          "Contenu": "Very easy to navigate with limited experience. Nice templates and stock photos. I wish the mobile view could look as nice as the full site."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2023-04-02T04:36:30.000Z",
          "Titre": "Absolutely free",
          "Contenu": "Absolutely free. Didn’t have to pay anything. Website looks great but I would like my own domain name because it just looks wack but other than that it’s great !"
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Michael McDermott",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T20:54:32.000Z",
          "Titre": "The ease of use in creating my website…",
          "Contenu": "The ease of use in creating my website was fantastic I didn’t want to hire a team to build it because it was not needed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "owner of Bareville Woodcraft C",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T13:31:27.000Z",
          "Titre": "Easy to design & edit your own web…",
          "Contenu": "Easy to design & edit your own web pages, helpful customer service via email"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marble",
          "Nb_Reviews": 1,
          "Date": "2023-05-20T13:59:24.000Z",
          "Titre": "It Was a Pretty Good Tool",
          "Contenu": "It was a pretty good tool, though it was kinda annoying that login pages were locked behind a paywall."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CS",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T17:34:58.000Z",
          "Titre": "This was easy to set up. Not really free.",
          "Contenu": "This was easy to set up. They made it that it's not really free if you want any decent features. I'm still debating if I want to pay for service. You go through the trouble of creating the site then they tell you which features are free or not. Today's world.  If you are just writing a blog it's ok."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Manny owner of Jibber Jabbers",
          "Nb_Reviews": 1,
          "Date": "2022-12-30T18:30:39.000Z",
          "Titre": "I love the site builder",
          "Contenu": "I love the site builder, nice to have a domain name and hosting in the same place. The only thing i wish is that you could upload a bigger audio file."
        },
        {
          "Note": 4,
          "Lieu": "IE",
          "Pseudo": "owner of John Lennon Coaching",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T14:05:29.000Z",
          "Titre": "Website was easy to use",
          "Contenu": "Website was easy to use and follow through to end Point of having a website"
        },
        {
          "Note": 4,
          "Lieu": "PT",
          "Pseudo": "owner of Partido Democrata Por",
          "Nb_Reviews": 3,
          "Date": "2022-11-21T08:33:41.000Z",
          "Titre": "Webador",
          "Contenu": "Pretty good, the fonts were ok, I wasnt too sure how to put the Payment methods on there If It worked, the donation tab and then I wasnt sure where you were located, the .com . Pretty good still overall. Sergio"
        },
        {
          "Note": 4,
          "Lieu": "HR",
          "Pseudo": "Darko Malčević",
          "Nb_Reviews": 2,
          "Date": "2023-03-21T08:50:23.000Z",
          "Titre": "The only reason not to give 5 stars is…",
          "Contenu": "The only reason not to give 5 stars is the fact that i can't change the color of audio file player which is very important to me because of the overall appearance of the site."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Novice user",
          "Nb_Reviews": 1,
          "Date": "2023-01-20T04:10:12.000Z",
          "Titre": "Excellent website builder",
          "Contenu": "Excellent website builder, major time saver and easy to figure out with minimal experience.  I prefer a real time chat option for customer service."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "New homeowner in Warwickshire.",
          "Nb_Reviews": 10,
          "Date": "2023-04-22T10:50:25.000Z",
          "Titre": "Very straightforward to use.",
          "Contenu": "Webador was very straightforward to use. I created a clean, minimal-looking website, which was just what I wanted."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "owner of Neighs 'N Brays Equin",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T00:38:11.000Z",
          "Titre": "Easy to set up",
          "Contenu": "Easy to set up website and for free I think it's pretty good but I wish I could find my website by using Google. The only way to find it is to have the full website address."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Caroline",
          "Nb_Reviews": 6,
          "Date": "2023-03-22T22:45:12.000Z",
          "Titre": "Great free website",
          "Contenu": "Great free website, fairly easy to use- even for a complete technophobia. Easy to share the link to attract people to follow it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eric Weston",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T05:54:22.000Z",
          "Titre": "Was simple to do on my own and with…",
          "Contenu": "Was simple to do on my own and with very little time invested I had put together my first website for myself"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T15:09:59.000Z",
          "Titre": "Good for free no domain",
          "Contenu": "So far its good no issues I get what I get for unpaid"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "A&E Contractor",
          "Nb_Reviews": 2,
          "Date": "2023-05-26T18:55:23.000Z",
          "Titre": "Started my website in a matter of a few…",
          "Contenu": "Started my website in a matter of a few hours. Learning the system and continuing to develop a cleaner land page."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "joseph miles",
          "Nb_Reviews": 9,
          "Date": "2023-06-13T05:54:23.000Z",
          "Titre": "So fat good nothing special to another…",
          "Contenu": "So fat good nothing special to any other provider only time will show the results"
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Jacques BERNIER",
          "Nb_Reviews": 2,
          "Date": "2022-12-21T17:09:30.000Z",
          "Titre": "WEBADOR un moyen simple de faire son…",
          "Contenu": "WEBADOR un moyen simple de faire son site internet rapidement et sans connaissance. Webador n'a pas grand chose à envier à ces conccurents"
        },
        {
          "Note": 4,
          "Lieu": "FI",
          "Pseudo": "LZT",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T09:40:13.000Z",
          "Titre": "It is a good web site designer but they…",
          "Contenu": "It is a good web site designer but they culd add better button immages"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Jithu",
          "Nb_Reviews": 2,
          "Date": "2023-03-21T01:11:31.000Z",
          "Titre": "Webador Website Builder Feedback",
          "Contenu": "Webador Website Builder FeedbackJithu MarkoseShare a First of all, I must say that Webador is a great website builder platform with a lot of potential. The platform offers a variety of features and tools to create a website that suits one's needs. The templates are visually appealing, and the drag-and-drop interface is user-friendly, making it easy for anyone to use.However, there are a few areas where I believe Webador can improve to enhance its service and make it even more user-friendly. Here are some suggestions:Improve the speed and performance of the platform: While the platform is easy to use, it can be slow at times, which can be frustrating for users. Improving the speed and performance of the platform would greatly enhance the user experience.Offer more customization options: While the templates are visually appealing, they can feel somewhat limiting when it comes to customization. Offering more options for users to customize their websites would allow them to create a more unique and personalized site.Provide more detailed tutorials and support: While the platform is relatively user-friendly, it can be difficult for beginners to get started. Providing more detailed tutorials and support would help users get up and running more quickly.Overall, I believe that Webador is a great website builder platform, and with a few improvements, it has the potential to be even better. By improving the speed and performance of the platform, offering more customization options, and providing more detailed tutorials and support, Webador can enhance its service and become even more user-friendly."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Karen",
          "Nb_Reviews": 16,
          "Date": "2023-05-11T09:34:46.000Z",
          "Titre": "I love the simplicity of it but I did…",
          "Contenu": "I love the simplicity of it but I did struggle at first to keep remembering how to add a blog post. But then I am 63 and not very tech savvy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mary Prater",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T20:05:44.000Z",
          "Titre": "Pro and Con",
          "Contenu": "Setting up my blog is user friendly. I have asked for help linking my blog to my Pinterest account. I need to add an html tag. As of today, I have not received a response."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tiny Short-cakes FFXIV",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T14:04:57.000Z",
          "Titre": "Most things are locked behind prices. But what's free is Good.",
          "Contenu": "Most things are locked behind prices but for what is free it has everything you need for a simple website. (Not selling items)"
        },
        {
          "Note": 4,
          "Lieu": "SE",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T19:59:49.000Z",
          "Titre": "Features",
          "Contenu": "I like the features but could be more, also text size could be good like you choose an number urself"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T04:53:44.000Z",
          "Titre": "Webador is extremely easy to use and professional results",
          "Contenu": "Webador is extremely easy to use, even if you're unfamiliar with website design or coding. The built-in drag-and-drop editor makes creating pages and adding content a breeze, and you don't need any prior experience to get started. To work with Webador is always fun. I like that it helps me to create a stunning web for my community. As they have a lot of fabulous themes, I have a chance to play with them and to choose what I need."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Clinton",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T14:44:41.000Z",
          "Titre": "Give Webador a try.",
          "Contenu": "This is a review from a senior citizen. I desired a personal website to feature the dozens of photos I wanted to share on the internet.  With my VERY basic computer skills, I was able to easily create a site for myself. It appears through my novice eyes, that Webador can be of valuable assistance for users of all needs and abilities."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Donna Gandza",
          "Nb_Reviews": 5,
          "Date": "2023-12-20T07:27:02.000Z",
          "Titre": "Very user friendly site",
          "Contenu": "Very user friendly site. I’m new at building websites so there were a few things that took a bit to figure out, but overall very easy to use and customize."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "owner of David Nessner Photogr",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T23:46:17.000Z",
          "Titre": "Ease of use is your greatest feature",
          "Contenu": "Ease of use is your greatest feature.  I hope the company stays on the cutting edge of development ....many other platforms seem to get stagnant."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Neil Hobbs",
          "Nb_Reviews": 7,
          "Date": "2023-12-16T09:24:20.000Z",
          "Titre": "Web-Adore",
          "Contenu": "The website has been really easy to construct and looks really good.I would like the option of tool to discount all my shop products in the event of a sale and the option of using an image as a background. The site map when added to my home page worked OK with Google but when creating a site map page Google did not accept an HTML site map page. This may have been because the site map has to be in the root folder. I have done some websites using HTML but for anyone not familiar with HTML Webador provide a great service."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Normandy Beaches",
          "Nb_Reviews": 7,
          "Date": "2023-12-20T10:30:00.000Z",
          "Titre": "A very good website builder…",
          "Contenu": "Once I worked out what the instructions meant it is easy!! All in all an excellent user friendly site once you have worked it out!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "owner of Farrar Motorsports",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T23:40:01.000Z",
          "Titre": "Site was very easy to customize to my…",
          "Contenu": "Site was very easy to customize to my pictures and text of the services and the new email account. ThanksLou"
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "L. Rama",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T16:34:49.000Z",
          "Titre": "Intuitive, time-saver, fun!",
          "Contenu": "We are still on the process of looking for a website that suits our needs as an online store. We've tried almost all out there and we've find Webador to be the most intuitive allowing us to set our website exactly what we envision in  just 15 minutes. The drag and drop editor help editing easy and quick! The overall layout looks really good in a computer screen and mobile devices without the need for coding, adjustments etc. It just feels fun working on your store with the ease of access to all the functions!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angel Vegas",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T04:32:10.000Z",
          "Titre": "Amazing",
          "Contenu": "Amazing. Format super easy to fallow great insights from developer team . im happy so far"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick Brutsman",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T20:20:40.000Z",
          "Titre": "This is such an easy to use service I…",
          "Contenu": "This is such an easy to use service I think even my dog could build a good looking website using this service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "owner of Roccos Roofing & Home",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T17:43:18.000Z",
          "Titre": "This website is soo easy to maneuver…",
          "Contenu": "This website is soo easy to maneuver through, to set up Ur website! The little extras are pretty great as well! Give them a try, U'll see how Ur business will grow!Sincerely, Roccosroofingandhomeremodeling.com"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kittie Warren",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T16:56:50.000Z",
          "Titre": "I love this Webador Website",
          "Contenu": "I love this Webador website. This is the best because I can make the page up for free so If I want to change the name or domain At the last minute I can. Perfect! I would recommend to anyone starting a small business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lynne Warren",
          "Nb_Reviews": 2,
          "Date": "2023-12-03T17:54:52.000Z",
          "Titre": "Easy to use",
          "Contenu": "I built the website in a day and loved the ease of the website editor. The setup is very straightforward and the FAQ has easy to understand instructions. I didn’t NEED a lot of bells and whistles but Webador has enough options to make a professional looking website. Access to traffic stats is decent"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Tournas",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T19:24:29.000Z",
          "Titre": "Webador has been a Great tool for me!",
          "Contenu": "Webador has been a great tool for me and I would recommend the service to all that are getting started on their own or need a website. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T04:26:03.000Z",
          "Titre": "It could be okay but sometimes the when…",
          "Contenu": "It could be okay but sometimes the when my customers want to pay it says ‘file not entered correctly’ or the payment goes through but not their details"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chad",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T07:35:53.000Z",
          "Titre": "I am so happy I have found webador!",
          "Contenu": "I am so happy I have found webador! Building a successful website is now a dream come true. The drag and drop website builder makes it user friendly you will have a website up and running in minutes, I have used several other website builders out there but nothing compares to webador. Give it a try!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Balmer",
          "Nb_Reviews": 7,
          "Date": "2023-12-05T14:51:46.000Z",
          "Titre": "Webador Excellence",
          "Contenu": "I generally avoid writing reviews, then I found Webador. Overall I am not too savvy with anything more than switching on a pc, sending an email and the odd word document. Id checked several website builder options, most of all the popular ones with no joy,  I just found them complex and not user friendly.Enter Webador - The site allows you to build a free site first which is what I did, honestly I spent a couple of hours and my site was up and running.I just couldn't believe how easy it was, honestly I found building the site as follows - Extremely intuitiveUser friendly in all areasEverything needed providedWithin a few hours I had my website up and running with a domain and a business style email address.Easy to add images, audio and content, what's not to love ? Honestly I recommend Webador all day long, if you need a web building site stop looking and visit Webador, you wont be disappointed, very reasonably priced as well compared to others. Heres my site made in a few hours, there is also ample opportunity for editing which I will continue with to perfect. scottishvoiceover.org.uk"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "sona dowds",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T18:19:04.000Z",
          "Titre": "Excellent website builder, excellent customer service",
          "Contenu": "I have been using Webador to make websites for my small enterprises and couple of voluntary groups and organisations I'm part of. The website builder as such is very user friendly and has all the features I need for making professionally looking websites. But the best part is their super helpful customer service! I always get reply very fast and any issues I needed help with were resolved in no time at all. They are also very friendly and professional, unlike many other IT professionals I had to deal with over the years. Pricing is very reasonable in comparison to other websites builders."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T03:14:21.000Z",
          "Titre": "Great website builder",
          "Contenu": "Great website builder! User friendly!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vishnu Ramsamy",
          "Nb_Reviews": 3,
          "Date": "2023-11-26T05:51:59.000Z",
          "Titre": "I am new to blogging",
          "Contenu": "I am new to blogging, and Webador has provided me the tools to make it possible. As I evolve and learn from my experience, I believe the ease with using Webador is boosting my confidence and experiece each day. Thank you Webador for making this possible for me. Much appreciated."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Kev",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T12:10:47.000Z",
          "Titre": "Quite easy to use and the template I…",
          "Contenu": "Quite easy to use and the template I selected seems simple but attractive. I'm still exploring, but so far so good."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "owner of Emy's secret compagny",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T20:40:42.000Z",
          "Titre": "Nothing to say about perfect"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "owner of Kima Desire",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T22:22:32.000Z",
          "Titre": "I wanted to take a moment to express my…",
          "Contenu": "I wanted to take a moment to express my sincere gratitude for the exceptional work your team has done in developing my website.The level of professionalism, creativity, and attention to detail exhibited throughout the process has exceeded my expectations. From the initial concept discussions to the final implementation, your team has demonstrated expertise and dedication.I am particularly impressed with the user-friendly interface and the seamless functionality of the website. Your commitment to delivering a high-quality product has not gone unnoticed, and I am truly appreciative of the effort put into making my vision a reality.Thank you once again for your outstanding service. I look forward to continued collaboration and success with Webador.Best Regards,Kima Desire"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "owner of A Flooring Company",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T19:21:24.000Z",
          "Titre": "Could not have been easier to set up",
          "Contenu": "Could not have been easier to set up. I am the most tech phobic person ever but managed to create a website I’m proud of and all for a fraction of the price of any others and believe me I looked at loads!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "owner of -chen",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T03:07:48.000Z",
          "Titre": "Awesome",
          "Contenu": "Awesome! User-friendly with many features for a reasonable price. I am enjoying this platform. Thank you!!!!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Leo Conway",
          "Nb_Reviews": 3,
          "Date": "2023-12-02T04:41:12.000Z",
          "Titre": "The easiest site creator out there",
          "Contenu": "Absoloute legends, I have wanted to create a site for ages to document lighting in my area and I didn't know how, but when I found webador it was made so easy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "brett",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T08:22:41.000Z",
          "Titre": "Webador is the BEST for creating your own site!",
          "Contenu": "The process for creating the website was BEYOND easy. I have no experience in web design, but knew I wanted something for a community project I was given. So I did some Googling and found Webador. I have been MORE THAN satisfied with the process so far.Updating the site is easy too! Would definitely recommend to anyone looking to create their own website."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jaden Beall, owner Ohana Belle",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T02:37:12.000Z",
          "Titre": "The system and the process was…",
          "Contenu": "The system and the process was extremely intuitive and easy to use. I was worried that building my website would be a tedious process, but on the contrary it was quite fun. I haven't quite finished yet, there's still a lot to do before I'll be satisfied, but having come this far I know that it will be a fun and creative process. Thank you so much!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "C M",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T16:53:00.000Z",
          "Titre": "I find Webador very helpful to create a…",
          "Contenu": "I find Webador very helpful to create a website for the first time. The templates are very modern. I find the interactive templates very engaging which motivates."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Andrei",
          "Nb_Reviews": 4,
          "Date": "2023-12-08T11:11:27.000Z",
          "Titre": "Very easy to set up your own website.",
          "Contenu": "Very easy to set up your own website.The templates are great and the publication straight forward."
        },
        {
          "Note": 5,
          "Lieu": "NO",
          "Pseudo": "eier av OMARS SKREDDER- OG SKO",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T04:55:08.000Z",
          "Titre": "Good morning very good thank you all…",
          "Contenu": "Good morning very good thank you all for your work and your help"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "owner of Honeypie's LLC",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T09:20:49.000Z",
          "Titre": "I like you guys services it's easy to…",
          "Contenu": "I like you guys services it's easy to use and of course a person like myself with multiple businesses is very affordable for myself and of course I bring on friends and I pay for their balances as well that's trying to start a new businesses it's a great thing for people who's just starting businessesI only have one little small thing that I request and that is getting Google to update their accounts where our stuff will show on Google so people won't feel that our accounts are fake that's the only problem we have"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AyannaG/Guiton Art Design",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T12:55:02.000Z",
          "Titre": "My Webador Experience",
          "Contenu": "I am a professional Graphic/Website designer and Digital designer I’ve been working in this industry for over 15 years, have used many different types of website hosts & editors, and I love Webador the most so far. The editor is easy to navigate and there are easy to use professional templates available if you are a novice, or need something quick for your clients. They are drag and drop and only take minutes to complete. The SEO optimization is the easiest and best I’ve found so far. They have really great affordable package plans that also allow you try them out for a dollar for 3 months before you commit. I HIGHLY RECOMMEND"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Shoelace",
          "Nb_Reviews": 6,
          "Date": "2023-11-20T00:43:29.000Z",
          "Titre": "Homeless shoelace project recommends",
          "Contenu": "This is everything that we expected and a lot more. A really great experience which the homeless shoelace project would happily recommend too everyone ,.also for people on a tight budget"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Shahin Gurbanov",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T15:26:00.000Z",
          "Titre": "I think you are doing great job except…",
          "Contenu": "I think you are doing great job except of two things.1)I don't know how powerful is your seo.Because in wix they use internal links,in terms of internal links their websites are nor ranked high in google search.2)After adding youtube link to embed code its not possible draw the video to the center+Youtube shorts is not accepted by your video section.Only youtube posted videos."
        },
        {
          "Note": 5,
          "Lieu": "HR",
          "Pseudo": "Dina Delin",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T19:55:39.000Z",
          "Titre": "It is easy and understandable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jellbell",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T06:34:23.000Z",
          "Titre": "Webador has the most user-friendly UI",
          "Contenu": "Webador has the most user-friendly UI. It was SO much more difficult to create websites on other site builders like Wix or GoDaddy. 10/10 Definitely recommend!!!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Josh",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T12:43:50.000Z",
          "Titre": "A very comprehensive website builder",
          "Contenu": "A very comprehensive website builder, tried others before. Webador is easy for a rookie as well. Easy menu. Highly recommended"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "owner of dreamclean",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T15:23:08.000Z",
          "Titre": "WEBADOR PUT ME ON THE MAP 🤑💰",
          "Contenu": "I love how easily I'm able to go back and edit my website as I learn more about whats going to sell my cleaning services and grow so does my website and for only 6$ a month I've got the domain I wanted and a website I'm proud of"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessica Robles",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T06:48:07.000Z",
          "Titre": "This website is so easy to use!",
          "Contenu": "This website is so easy to use!I would definitely recommend this site to anyone. I will be using Webador in the future for all my website building needs. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greg Faulk",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T18:54:14.000Z",
          "Titre": "Everything was very easy and straight…",
          "Contenu": "Everything was very easy and straight forward. My only issue is not with Webador but with the issues getting verified with Google through any of my advertising campaigns. Thanks Webador"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dilsy hichos cleaning service",
          "Nb_Reviews": 3,
          "Date": "2023-11-28T04:35:19.000Z",
          "Titre": "I am very grateful to webador",
          "Contenu": "I am very grateful to webador, it helped me a lot with my website, others charge so much so webador makes it easy for us, thank you so much"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ben Pierce",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T23:07:34.000Z",
          "Titre": "Webador is an incredible website builder that's so easy to use you'll be online in no time",
          "Contenu": "Webador is an incredible, easy to learn website builder that didn't come off as intimidating like some other website builders put there. Webador is straight to the point and will have you online in no time. I've built multiple websites with Webador and my clients have been more than satisfied"
        },
        {
          "Note": 5,
          "Lieu": "KR",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T01:57:48.000Z",
          "Titre": "Easy to set up the website",
          "Contenu": "Easy to set up the website. No bug. I tried several tools to make my website but they need extra works and had some bugs. It seems that I could build my website fastest compared to other tools and didn't feel any problem to do without any help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "direstorms",
          "Nb_Reviews": 7,
          "Date": "2023-12-17T06:58:34.000Z",
          "Titre": "Wonderful way to build a website"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Cassandra Longclaws",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T05:03:27.000Z",
          "Titre": "My experience with webador",
          "Contenu": "It has everything I pretty much need for what I am trying to make for my assignment and also for myself"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "customer from Essex",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T21:13:57.000Z",
          "Titre": "Very easy to use",
          "Contenu": "Very easy to use. Tools are fantastic"
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "mantam",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T21:06:58.000Z",
          "Titre": "I really love that in webador we can…",
          "Contenu": "I really love that in webador we can add products with their cost and all the details. It's really worth it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "owner of Valhalla Custom LLC",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T05:21:13.000Z",
          "Titre": "Easy",
          "Contenu": "Easy, helpful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T07:57:29.000Z",
          "Titre": "Amazing platform for website hosting",
          "Contenu": "Great platform to have your website hosted. Very easy to navigate and edit your website. I great experience so far."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Journaler",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T23:45:11.000Z",
          "Titre": "Simple & Easy to use!",
          "Contenu": "Webador has been so easy to use! Drag, drop, upload and type. Self explanatory and simple. Perfect for a beginner!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "ALexandra Boyd",
          "Nb_Reviews": 7,
          "Date": "2023-10-13T16:22:24.000Z",
          "Titre": "It was such a simple process that even…",
          "Contenu": "It was such a simple process that even a novice like myself was able to put together a simple webpage .I would definitely recommend we adore to others no matter how tech savvy or not at all , if I can do it anyone can ."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Nigel Mellor",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T12:22:01.000Z",
          "Titre": "Simple site suits my simple needs",
          "Contenu": "The site is simple to operate for someone with limited IT ability. It produces a nice clean design quickly and the layout is flexible without needing massive brain power to understand the functions. The adverts on the free site are a bit  \" in your face \"   but I can live with them. I only use a fraction of  the functions that the site can provide ( I don't  do buying and selling, for instance) so my comments are somewhat restricted in their relevance. But I am happy with the site."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Law",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T14:27:54.000Z",
          "Titre": "Unfussy and uncomplicated website creation",
          "Contenu": "Building my website now, Webador has an unfussy, user-friendly drag-and-drop approach that sets it apart from competitors. I shopped around and know the site I want to make- the aesthetic, the layout- and Webador's ease of use gives me confidence that I have control and nothing is going to break from one page to the next."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sonya",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T15:43:53.000Z",
          "Titre": "Easy to use, overall great",
          "Contenu": "I really like the website building features, it is easy to use and very fast with no bugs or problems. I do wish that you could have a normal website name without paying though."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T14:13:10.000Z",
          "Titre": "Completely free brilliant service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Evans",
          "Nb_Reviews": 4,
          "Date": "2023-12-06T01:22:55.000Z",
          "Titre": "Easy to use website builder and good…",
          "Contenu": "Easy to use website builder and good response from support team."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Randy Schreifels",
          "Nb_Reviews": 3,
          "Date": "2023-12-06T21:09:07.000Z",
          "Titre": "I got my messages out and hope I'm…",
          "Contenu": "I got my messages out and hope I'm getting results.  I haven't had the chance to view others."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kimani Ware",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T01:17:32.000Z",
          "Titre": "giving me the opportunity to create and…",
          "Contenu": "giving me the opportunity to create and build my websites for personal and business purposes"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "owner of A Peachy Clean by Tif",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T08:49:11.000Z",
          "Titre": "Very user friendly",
          "Contenu": "If only more Online tools were as easy as using your website builder!!! Thank you"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Nigel",
          "Nb_Reviews": 4,
          "Date": "2023-11-03T01:37:45.000Z",
          "Titre": "Great Website Provider",
          "Contenu": "This site offers a great free website experience.  They offer a very good website builder and above all else the performance of their servers is superb whether you are a paid member or a free member."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joyce Gantt",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T01:47:04.000Z",
          "Titre": "Overall great for beginners.",
          "Contenu": "Overall it was great I just couldn't integrate my business with the domain being a pod business and it just disappointed me for that reason. Your webshop setup was fairly easy to do and would use you again if circumstances changed in future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "owner of Divine Love Quantum H",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T00:27:59.000Z",
          "Titre": "This website is so easy to use!",
          "Contenu": "This website is so easy to use!I've worked with several different web designing sites before and by far this was the easiest for me. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan Moore",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T10:34:28.000Z",
          "Titre": "affordable, easy to navigate, they start you out great!",
          "Contenu": "so far everything has been great! still a long way to go but its a fun road getting there. webador did a great job setting my website for me and its pretty easy to navigate through the site and make it excatly what we want. thanks for making these affordable and easy. thanks for helping me get started with our company website. come check us out for all your flooring needs! moorescustomflooring.com"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Lamb",
          "Nb_Reviews": 5,
          "Date": "2023-11-22T02:26:29.000Z",
          "Titre": "Best ever",
          "Contenu": "The best l ever had as a layman and would recommend others. User friendly & very professional & let alone the affordability."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Victoria Brown",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T05:36:04.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good. I just need to know how to change the name of my domain without being charged. I love webador actually"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eileen R  Sergi",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T06:39:20.000Z",
          "Titre": "your patience and insightfulness.",
          "Contenu": "I'm still trying to bring my business to life.  my ideas are still an working progress.  your patience and encouragement is what I need. thank you!"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "owner of MYSOUND",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T10:05:15.000Z",
          "Titre": "Everything is simple but great",
          "Contenu": "Everything is simple but great. It's easy to create your own website through webador. No need to learn coding, etc. I like the services especially when you're planning to sell some item in your website."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T20:43:14.000Z",
          "Titre": "Super easy to use",
          "Contenu": "Super easy to use! I was able to make a professional website for our nonprofit organization."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Owner of Travel Agency",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T19:46:15.000Z",
          "Titre": "Easy and fast!",
          "Contenu": "It was very user friendly.  It took much less time than I had anticipated, which was a bonus.  The stock pictures are great and it was nice to have help with the verbiage."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gerryc",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T08:39:56.000Z",
          "Titre": "Easy to navigate site",
          "Contenu": "Easy to navigate site. No complicated pricing. Easy to create website with lots of features for free. Paid prices are inexpensive and not complicated. Will be upgrading to paid service soon."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "La Rue",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T04:30:29.000Z",
          "Titre": "Super easy to build and edit",
          "Contenu": "Super easy to build and edit. Works beautifully.  Affordable! Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T04:23:17.000Z",
          "Titre": "Ease of Use",
          "Contenu": "Really user friendly interface, made it super easy to add in elements and customize."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Godsglory Ltd",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T07:37:07.000Z",
          "Titre": "You are excellent",
          "Contenu": "You are excellent.  You have given me a great and wonderful start.  Thanks so much"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Bassett",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T19:07:49.000Z",
          "Titre": "Webador provides a user-friendly…",
          "Contenu": "Webador provides a user-friendly website that has many options for upgrading as needed. The free website is basic but provides more of what I am looking for than similar providers allowing me to maintain a professional website to my liking."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joshua Swint",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T00:00:02.000Z",
          "Titre": "SO easy to put together FAST.",
          "Contenu": "I needed to get attention to a bunch of info quickly, and this was PERFECT."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carmen Oquendo",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T20:20:50.000Z",
          "Titre": "Great support",
          "Contenu": "I was able to build my own website and it was easy to add pages and information!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "owner of Lloyd Edward Jackson",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T20:50:51.000Z",
          "Titre": "Perfect for starter businesses.",
          "Contenu": "The web layout was easy. Great design and format."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Almquist",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T20:25:42.000Z",
          "Titre": "Webador is easy to use and access",
          "Contenu": "Webador is easy to use and access.  I am very pleased with Webador"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Need Homes AU Incoporated",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T03:54:05.000Z",
          "Titre": "Webador review after 4 weeks",
          "Contenu": "Webador, is easy to use and quick real time updates. Well done webador website people."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "owner of Employment Coach Rhon",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T21:49:31.000Z",
          "Titre": "Self Managing Website tools",
          "Contenu": "Ive designed my website that has been generating traffic it wasn't difficult to design. The Webador is very responsive and helpful with the process"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jeronim Anton Crep",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T21:33:52.000Z",
          "Titre": "It was so easy to use",
          "Contenu": "It was so easy to use . I was able to make 3 websites with ease ."
        },
        {
          "Note": 5,
          "Lieu": "NO",
          "Pseudo": "Jann",
          "Nb_Reviews": 9,
          "Date": "2023-11-01T11:00:13.000Z",
          "Titre": "User friendly web design software",
          "Contenu": "User friendly web design software1. Very easy to start with. like kids play the puzzle.2. Permanent stored in the cloud and no worry of lost data.3. Best choice for those start-up business or personals."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "owner of SpiritualityandBeyond",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T02:44:39.000Z",
          "Titre": "I Love the ease of use",
          "Contenu": "I Love the ease of use, I especially love the cost as of now. Im hoping our relationship last a lonnnng while Thank YOU so much❤️🦋💫"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "sss",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T13:44:44.000Z",
          "Titre": "Honestly great and easy to use",
          "Contenu": "Honestly great and easy to use, I like the builder and sub domains too"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Farris",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T04:31:40.000Z",
          "Titre": "It’s easy",
          "Contenu": "It’s easy, simple to figure out. I didn’t want to mess with Dreamweaver and code."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mathew Smith",
          "Nb_Reviews": 2,
          "Date": "2023-11-07T17:55:13.000Z",
          "Titre": "amazing start to finish",
          "Contenu": "what can i say about this amazing company started to lose my mind starting up but couldn't ask for much more when i contacted webador by email i was contacted back on the same day then problem had been solved and explained by the next cant fault at all five stars to the person that helped me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "owner of Knkn kicks",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T00:05:19.000Z",
          "Titre": "Good",
          "Contenu": "I has help me create my company"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "owner of Buckley Care Adult Fa",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T19:57:55.000Z",
          "Titre": "I like it because I can go in at anytime and edit and update my website at my convenience.",
          "Contenu": "I like it because I can go in at any time, edit and update my website with new pictures and information at my own convenience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dewayne C.",
          "Nb_Reviews": 4,
          "Date": "2023-12-01T00:18:53.000Z",
          "Titre": "Building my website",
          "Contenu": "Building my website was fast and easy to complete. Thanks to webador"
        },
        {
          "Note": 5,
          "Lieu": "UG",
          "Pseudo": "owner of Good Luck and Love Ch",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T14:17:49.000Z",
          "Titre": "Its not being visited",
          "Contenu": "Am happy to be with my own website, but its not being visited"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "owner of FastKill Pest Control",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T14:49:25.000Z",
          "Titre": "To the experienced person I know",
          "Contenu": "To the experienced person I know, the opportunity to help me promotes the business of your business with multi-faceted professional skills for an agreed upon assistant"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "owner of suni drives limited l",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T17:16:10.000Z",
          "Titre": "It was less hassle to create the website"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "owner of HARMON BIBLE CHURCH",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T15:18:50.000Z",
          "Titre": "Easy to use and intuitive."
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Mihaela",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T17:30:37.000Z",
          "Titre": "It is easy to create a basic website…",
          "Contenu": "It is easy to create a basic website and the support really works as expected. Friendly website builder."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Doyle’s Customer Service.com",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T15:38:39.000Z",
          "Titre": "Love Webador",
          "Contenu": "Love Webador! The best and most affordable website designer/editor hands down!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "owner of DSM EARTH MOON HERBAL",
          "Nb_Reviews": 2,
          "Date": "2023-10-06T06:56:49.000Z",
          "Titre": "The fact that it's online and the…",
          "Contenu": "The fact that it's online and the people can look at it face to face , besides wanting the herbs early than the shop opening.Great way to start a business that people want and need OkThank youDebbie norris"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "owner of DJR Publishing",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T00:03:59.000Z",
          "Titre": "Easy to use and update",
          "Contenu": "Easy to use and update. Inexpensive for a very small business."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T12:07:36.000Z",
          "Titre": "Easy to use service very functional…",
          "Contenu": "Easy to use service very functional layout, easy to use even if a first time website builder."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Michal Tanay",
          "Nb_Reviews": 3,
          "Date": "2023-12-11T22:36:56.000Z",
          "Titre": "great company"
        }
      ]
    }
  ]
}