{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "wecelltrade.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Miriam S.",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T21:22:24.000Z",
          "Titre": "Website appears to not be working",
          "Contenu": "Website appears to not be working. Tried on numerous computers and browsers to sell a product, and transaction could not go through due to an error message. When I tried to contact them via their support page, message could also not go through."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-24T20:32:46.000Z",
          "Titre": "quoted me one price and cut it in half…",
          "Contenu": "quoted me one price and cut it in half when item was received despite being in perfect condition."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T17:20:52.000Z",
          "Titre": "Would Not Honor Offer Price",
          "Contenu": "They would not honor the offer they quoted on their website.  They said that due to the screen being broken they could not repair the item even though the examples they give for a \"broken\" item on their website lists \"smashed screen\" as the first example of what a broken item could be.  This is false advertising at best, fraud at worst.  Do not waste your time sending anything to them unless it is in pristine condition at which point you'd be better off selling on eBay.Update:  In response to WCT's reply, I want to clarify that the apple watch worked fine, the only issue was the corner of the screen was cracked.  If they couldn't get it to turn on, then it just wasn't charged because the device was 100% functional."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Martine Dumont",
          "Nb_Reviews": 2,
          "Date": "2023-03-30T17:26:24.000Z",
          "Titre": "What's \"good\"? What's \"fair\"",
          "Contenu": "After receiving my device, they said my device was in \"fair\" condition because of scratches. But according to their own description of conditions, minor scratches are considered \"good\" (\"fair\" would be excessive scratches, which my device did not have). They changed the price they had offered for my device. I did complain about this discrepancy in definition and they offered a bit more, but not as much as what they had originally offered. I didn't want the device sent back to me because the whole point of recycling my device is to help the environment, shipping items back and forth would defeat the whole purpose."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T19:06:32.000Z",
          "Titre": "There was no reason for you to…",
          "Contenu": "There was no reason for you to downgrade the value of my phone."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-05-03T00:14:54.000Z",
          "Titre": "The process of giving the company you…",
          "Contenu": "The process of giving the company you electrictronics is easy. But there system on checking the quality of the products you sent is trash. I gave them a 2020 MacBook with some other stuff that I barely used. The price started at 1,020 and ended at 300. Did they test the earbuds I sent? Did they check that I sent the charges? Idk. But I know I will never send my things here again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Christopher Gipson",
          "Nb_Reviews": 3,
          "Date": "2023-03-09T16:34:41.000Z",
          "Titre": "Customer services Needs improvement but follow up by management is excellent",
          "Contenu": "Horrible does not even begin to describe the customer service that this company provides. I’ve used these services twice. First problem, no problem. Second problem was hung up on twice after asking for a manager about conflicting emails sent buy them. Bad out weighs the good, unfortunately that the way the world is.  I did eventually receive a call from a supervisor named Anna who was nothing but great after submitting a message via their website and also sending an email to the general company email.  That was very surprising, as most things like that go unanswered.  ***UPDATE 03/09/2023: received another call from Anna after writing my initial review to discuss our previous conversation and to see if she could help resolve any further issues.  I GREATLY appreciate her for doing that, taking her time yet again to try and make things right.  That's rare today!  She also gave me her direct number for any further communication and ask that I please give them another try if possible in the future.  To clear things up, I was in no way seeking anything out of this complaint or gain in any way, not did I receive anything.  I simply wanted them to be aware of the customer service that was being provided to initial calls made to the company.  Anna informed me that they are working to improve on their customer services and the issue with the partially person has been discussed.  Anna, thank you again for your consideration and care in providing a better customer experience, I hope that your business continues to grow and experience great success.  Stars improved to a 3 due to this, FYI I never leave a 5 because if we have reached the top we have no where else to go or improve on and that is when mistakes such as bad customer service begin.Thanks!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ian",
          "Nb_Reviews": 6,
          "Date": "2023-02-03T01:56:15.000Z",
          "Titre": "It was a good and easy trade",
          "Contenu": "It was a good and easy trade at the best price I could find. I hadn't realized though that it would have fees taken out by paypal as other sites I've used in the past haven't sent the money that way so that lost most of the extra that I earned from the transaction. Perhaps the other sites are doing that now too as this was my first trade in a while."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Suzanne",
          "Nb_Reviews": 2,
          "Date": "2023-02-09T17:59:39.000Z",
          "Titre": "make sure to pick your preferred payment method before you place your order.",
          "Contenu": "thanks for taking my very old phone"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "A Datta",
          "Nb_Reviews": 1,
          "Date": "2022-10-01T15:45:25.000Z",
          "Titre": "After review, they honored the price",
          "Contenu": "Initially WeCellTrade did not honor the price that I had locked in for two phones in late August. They said the website was making incorrect offers and was offering 50% less values to affected customers.While I initially did not receive the locked in price, after seeing an initial poor review the company did decide to honor the price and other than that issue the process was good. They've told me they've fixed the website issues and the prices are now honored for 21 days from generation, so hopefully everyone else is able to receive those prices upon validation of condition. Thank you WeCellTrade for honoring the original prices and thank you TrustPilot for helping to make sure companies follow best business practices."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Leigha Tate",
          "Nb_Reviews": 5,
          "Date": "2022-11-11T01:25:05.000Z",
          "Titre": "Prices are too low for \"good or great\"…",
          "Contenu": "Prices are too low for \"good or great\" items still in working condition"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay Smith",
          "Nb_Reviews": 7,
          "Date": "2023-07-17T00:37:37.000Z",
          "Titre": "Fast and honest phone buyer",
          "Contenu": "I buy/sell phones as a kind of a side hustle.  I have sold several phones to WeCellTrade.  They are one of my favorite buyers.  They are easily the fastest online buyer that I've dealt with.  They have always paid me (via Zelle) within 24 hours and often pay me the same day they receive my phone.  I've had other buyers take up to 15 days to pay me. I stopped selling to them in June while their website was being redesigned.  I'm glad to see it back up and running."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T21:44:08.000Z",
          "Titre": "Super happy with the transaction",
          "Contenu": "Super happy with the transaction.  Pretty simple entered the item that I wanted to sell.  They give you estimated value.  Ship it with the prepaid shipping label. When they receive it they'll let you know if condition check's out.  If you agree Bam get paid."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 2,
          "Date": "2022-07-15T02:42:55.000Z",
          "Titre": "Top dollar & fast turnaround",
          "Contenu": "I got a great price for my iPhone 12 after researching several on-line options, retail stores, and the drop-boxes at Walmart and some grocery stores.  The process was fast and easy.  They held the price for 28 days and sent me a pre-paid shipping label. I was paid just 2 days after they received the phone.  My only regret was choosing PayPal instead of having a check sent, as PayPal took 3%.  Otherwise, AWESOME and so easy!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hannah Stein",
          "Nb_Reviews": 5,
          "Date": "2022-07-14T22:42:11.000Z",
          "Titre": "Quick, easy, and reliable!",
          "Contenu": "Got my payment super quickly after they received my shipment. I was honestly expecting issues because things never seem to go smoothly with stuff like this, but I was pleasantly surprised by how easy this was! Will definitely use again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay Smith",
          "Nb_Reviews": 7,
          "Date": "2023-02-27T21:18:41.000Z",
          "Titre": "Top rate service",
          "Contenu": "I have now sold many phones to WeCellTrade and will continue to do so in the future.  I'm always pleased at how quickly they evaluate my phones and send my payment.  Plus, they always seem to be paying top dollar."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2022-12-06T00:57:38.000Z",
          "Titre": "Great experience selling used cell",
          "Contenu": "Found WeCellTrade as the highest quote bidder for my old cell phone. They promptly sent a postage-paid package for me to ship my phone, and true to word sent my payment via Zelle once received. I enjoyed the updates via email every step of the way. Great company; honest, fast and transparent. Would definitely sell them my next used phone again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "H. Pham",
          "Nb_Reviews": 7,
          "Date": "2022-12-16T17:04:01.000Z",
          "Titre": "Smooth Transactions. Helpful Customer Service.",
          "Contenu": "I've sold 8 phones to WeCellTrade. All transactions went well, the phones were inspected promptly and payment made quickly. Customer Service was helpful when I emailed to request a prepaid shipping label or to change/cancel an order."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trevskeee",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T17:53:54.000Z",
          "Titre": "Easy way to sell your old iPhone",
          "Contenu": "I had a great experience with this company. I was quoted a price, sent a box, packaged my phone, and got confirmation of their receipt of my phone and subsequent payment within 48 hours. Doesn’t get much easier than that."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "F.H",
          "Nb_Reviews": 1,
          "Date": "2023-01-24T14:43:46.000Z",
          "Titre": "Went out of their way to make sure I got paid.",
          "Contenu": "When my preferred payment method wasn't functioning properly, they worked with me and tried a couple of different methods to send the money. Ended up going with a check that arrived promptly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay Smith",
          "Nb_Reviews": 7,
          "Date": "2022-12-29T01:14:01.000Z",
          "Titre": "My favorite phone buyer",
          "Contenu": "I have sold several phones to WeCellTrade and will continue to do so.  I'm surprised by how quick they evaluate my phone and pay me.  I use Zelle and they have always paid me the same day they receive my phone.  They have always paid the promised price.  I sent my last phone on 12/18 and got paid on 12/21!  Great service from both UPS and WeCellTrade."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave Martin",
          "Nb_Reviews": 1,
          "Date": "2022-11-07T19:54:03.000Z",
          "Titre": "One of the easiest things I have ever…",
          "Contenu": "One of the easiest things I have ever done. 5+ stars for the service. Payment was immediate upon verification of what I sent, and the full amount was paid. Highly recommend WeCellTrade"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave M",
          "Nb_Reviews": 1,
          "Date": "2022-11-22T00:52:08.000Z",
          "Titre": "Good service and communication",
          "Contenu": "They did a great job communicating through every step of the process of shipping the phone.  They also were prompt on responding to my emails.  I would definitely use them in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Hansen",
          "Nb_Reviews": 5,
          "Date": "2022-12-22T15:08:03.000Z",
          "Titre": "Great Company",
          "Contenu": "Great company to work with.  Easy instructions to follow. They send all the packaging for shipping.  They couldn't make it any easier for you.  Would definitely use them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay Smith",
          "Nb_Reviews": 7,
          "Date": "2022-11-12T00:01:15.000Z",
          "Titre": "Fast Service",
          "Contenu": "This was my first time dealing with WeCellTrade.  I like that they offered a variety of shipping options.  UPS is easiest/best for me.  They evaluated my phone and paid me by Zelle the day after they received my phone (less than 24 hours).  They honored their offer and the whole process was smooth & fast.  I will likely be using them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Srinivas Tatapudi",
          "Nb_Reviews": 2,
          "Date": "2022-11-07T18:52:55.000Z",
          "Titre": "Great Service! I Recommend WeCellTrade.",
          "Contenu": "Great Service!. More importantly, there is someone who picks up phone when you call to inquire on the transaction and will update you right then and there!. I sold iPhone12Pro. Super Quick transaction - 10/31 sent, 11/2 paid. (Anna on  the phone was the best!)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 2,
          "Date": "2023-03-08T05:00:22.000Z",
          "Titre": "Great transaction",
          "Contenu": "Great transactionI got my quote for a phone I wanted to trade in.  They emailed me a shipping label and I sent in my device.  Soon after my phone arrived, they inspected it and I got the full amount they quoted promptly deposited in my Zelle account.  They are very easy to work with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ika",
          "Nb_Reviews": 1,
          "Date": "2022-11-07T18:57:05.000Z",
          "Titre": "fair prices, no scrutiny and quick payment!",
          "Contenu": "thank you for a great experience. prices are fair and excellent payment options. everything worked exactly as expected. thank you !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chelsea",
          "Nb_Reviews": 1,
          "Date": "2022-07-15T03:39:10.000Z",
          "Titre": "Not gonna lie",
          "Contenu": "Not gonna lie, I was definitely very skeptical of the service but the process was actually pretty quick once the device was shipped! Easy and legit service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MICHAEL P",
          "Nb_Reviews": 3,
          "Date": "2022-11-22T07:47:50.000Z",
          "Titre": "Excellent overall service",
          "Contenu": "Excellent overall service. WeCellTrade offered and efficiently delivered the best price between a number of online buy-back services. They paid exactly what they offered online and I received the reimbursement within a week."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jack dumbo",
          "Nb_Reviews": 2,
          "Date": "2022-12-07T05:05:09.000Z",
          "Titre": "i got my money quickly",
          "Contenu": "i got my money quickly. they took my phone and sent me the amount listed very simply. i would have liked a option too take back the phone if i changed my mind but i bet you could contact WeCellTrade in order too have that done"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julia",
          "Nb_Reviews": 1,
          "Date": "2022-07-15T04:01:06.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience! They processed my old phone very quickly and it was overall a simple and easy transaction. Definitely recommend!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-16T21:22:13.000Z",
          "Titre": "Iphone sale",
          "Contenu": "I sold my iPhone 11 very quickly and got the only on my Zelle account which is very convenient. Highly recommend their services!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larry B.",
          "Nb_Reviews": 1,
          "Date": "2022-11-03T23:07:17.000Z",
          "Titre": "Great Service - As advertised!",
          "Contenu": "Service & Process was exactly as presented and the whole procedure was very simple. Would definitely use again and recommend to others."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tyler McClary",
          "Nb_Reviews": 1,
          "Date": "2022-09-27T01:52:40.000Z",
          "Titre": "Great Experience",
          "Contenu": "Experience was great, all information was up front and transactions were process promptly according to schedule. Would definitely use again for a trade in!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dawn",
          "Nb_Reviews": 4,
          "Date": "2022-11-18T23:43:34.000Z",
          "Titre": "The whole process was quick and easy",
          "Contenu": "The whole process was quick and easy. Got a quote, they sent a shipping box and label, send it to them. They checked out my trade the day they received it. I could have gotten paid quicker but I wanted a check. All in all a hassel free trade."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Javier Carrillo Jr",
          "Nb_Reviews": 1,
          "Date": "2022-07-18T08:55:48.000Z",
          "Titre": "Legit Company!",
          "Contenu": "Love that they provide a label! Once item gets there, it literally gets checked within 48 hours. Payment gets to you fast! 100% legit!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Monica B Guerrero",
          "Nb_Reviews": 2,
          "Date": "2022-11-08T16:42:43.000Z",
          "Titre": "Not dissapointed",
          "Contenu": "I highly recommend WeCellTrade; the site is easy to navigate. Shipping was fast, payment was as promised. Overall, a great experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tanya",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T00:19:51.000Z",
          "Titre": "Gave  me a great price for my iPhone…",
          "Contenu": "Gave  me a great price for my iPhone Pro Max 11, where locally companies only wanted give me $100!!, Payment fast !!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "H. Pham",
          "Nb_Reviews": 7,
          "Date": "2023-03-10T01:07:41.000Z",
          "Titre": "Phone was inspected promptly",
          "Contenu": "Phone was inspected promptly after received and payment made quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laura",
          "Nb_Reviews": 2,
          "Date": "2022-12-07T21:47:58.000Z",
          "Titre": "Wonderful to Work With",
          "Contenu": "The customer service representative went above and beyond to help troubleshoot issues with my previous provider to be sure my transaction went through, the offer was fair, and the entire process was virtually painless.  I wouldn't hesitate to recommend WeCellTrade to anyone looking to make a little extra money!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-22T00:42:23.000Z",
          "Titre": "Very responsive and convenient",
          "Contenu": "Very responsive and convenient! Great to know this revive is there!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-26T05:14:06.000Z",
          "Titre": "A+++",
          "Contenu": "great communication, fast turnaround time, easy to do business with"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sarah",
          "Nb_Reviews": 1,
          "Date": "2022-07-15T19:49:03.000Z",
          "Titre": "Best Trade In Experience Ever",
          "Contenu": "Was a fast an easy trade in process. They gave me the fully quote value. Had my PayPal funds available right after the phone was delivered."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carolyn Lewis Joiner",
          "Nb_Reviews": 1,
          "Date": "2022-11-08T17:43:42.000Z",
          "Titre": "I received top dollar for my phone as…",
          "Contenu": "I received top dollar for my phone as compared to competitor quotes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Louis",
          "Nb_Reviews": 4,
          "Date": "2023-02-11T21:56:34.000Z",
          "Titre": "Sale of my Garmin watch was made easy…",
          "Contenu": "Sale of my Garmin watch was made easy and price paid was best I received when I looked around"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J.R.",
          "Nb_Reviews": 1,
          "Date": "2022-11-10T21:54:12.000Z",
          "Titre": "Straightforward and prompt transaction",
          "Contenu": "Straightforward and prompt transaction. Really appreciated how the process was so streamlined."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T23:59:02.000Z",
          "Titre": "Good experience",
          "Contenu": "Good experienceVery fast processing and payment"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer McBee",
          "Nb_Reviews": 1,
          "Date": "2022-07-17T03:34:49.000Z",
          "Titre": "Nice working with them.",
          "Contenu": "Was really happy with the whole process.  Prompt replies with swift replies and items needed to process the sale."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeremy Ostermeier",
          "Nb_Reviews": 2,
          "Date": "2022-11-07T17:38:02.000Z",
          "Titre": "Best pricing",
          "Contenu": "Best pricing, quick and kind service, great experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Monica B Guerrero",
          "Nb_Reviews": 2,
          "Date": "2022-12-15T16:32:41.000Z",
          "Titre": "Selling products on the website is so…",
          "Contenu": "Selling products on the website is so easy! I am very pleased with the company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nick",
          "Nb_Reviews": 1,
          "Date": "2022-11-04T14:55:33.000Z",
          "Titre": "Easy and fast and they honored the…",
          "Contenu": "Easy and fast and they honored the original price"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeremy Ostermeier",
          "Nb_Reviews": 2,
          "Date": "2022-11-11T21:08:57.000Z",
          "Titre": "Super easy and best prices I found…",
          "Contenu": "Super easy and best prices I found online. Top notch!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JAIMIE SALTA",
          "Nb_Reviews": 3,
          "Date": "2023-01-13T02:33:51.000Z",
          "Titre": "One of the Best!",
          "Contenu": "Great communication, very fast turnaround and great offers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Queen Joy",
          "Nb_Reviews": 2,
          "Date": "2022-11-22T22:52:55.000Z",
          "Titre": "They communicate with customers and…",
          "Contenu": "They communicate with customers and have good customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pamela",
          "Nb_Reviews": 4,
          "Date": "2022-11-11T01:55:46.000Z",
          "Titre": "Fast",
          "Contenu": "Fast, easy, and honest."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JAIMIE SALTA",
          "Nb_Reviews": 3,
          "Date": "2023-01-05T03:57:00.000Z",
          "Titre": "Great communication throughout the…",
          "Contenu": "Great communication throughout the transaction. Fast reliable payment."
        }
      ]
    }
  ]
}