{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "wowvendor.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kate",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T20:29:52.000Z",
          "Titre": "Company will not stop even when asked",
          "Contenu": "I have asked the company to stop soliciting in spam bot messaging in Destiny 2. This company can't respect a basic no thank you that has been made 5 times over. Every time it's oh give us you gamer tag and we will stop. Lol what a joke. After the clear ineptitude I wouldn't trust them with a pet rock let alone my game account."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 5,
          "Date": "2023-12-14T15:10:14.000Z",
          "Titre": "Too many customers with not enough…",
          "Contenu": "Too many customers with not enough service providers.  With everyone on your side saved, loot was scarce, and there were an unacceptable number or wipes.  I've used your service quite a few times now, but this will be my last."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ME",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T23:29:27.000Z",
          "Titre": "I've spent thousands on this site and…",
          "Contenu": "I've spent thousands on this site and sometime in the last week they seem to have changed to armor stacking to lower your chance they claim its random but its happened multiple times on multiple toons and classes that you have 7+ of the same armor type to roll against and not even counting tier tokens I have screen shots and videos as proof its shady AF and they have lost a longtime customer as a resultEdit after reply It had nothing to do with wanting to be the only one in the raid with an armor type but having literally 7/10 be the same every single time I went in raids on multiple classes which means its been stacked coz it can be random once or twice but not over and over"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Unhappy Cuntstomer",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T09:22:14.000Z",
          "Titre": "Slow run",
          "Contenu": "After all but the last boss the raid lead said that another group would finish the run and i would be contacted with more information.After 20 minutes of waiting i asked them what the problem was and how long it would be. Roughly 5 mins after that I was informed they had technical difficulties with no reason. I was informed the wait time would be another 10 minutes then i spent the next hour and a half waiting."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Beloc",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T07:06:49.000Z",
          "Titre": "Consistently delayed start times and Poor Customer Service",
          "Contenu": "Fourth (and last) raid I ran with them in a row, where the start time was delayed and nobody responded on the discord support service.  Finally got a hold of someone on the website and after 15 minutes I was told my raid was going to start.  Waited another 15 minutes and nothing. I will trying one of their competitors on my next run.  They may not be better, but they are significantly cheaper and they cant be worse.  The headaches you will experience with this service are worse than a PUG, so save your money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Frank Enbeahn",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T12:36:01.000Z",
          "Titre": "Run delayed by over an hour and a half…",
          "Contenu": "Run delayed by over an hour and a half in the middle of the night with no contact. After contacting customer support at the 30-minute mark, I was told it's a \"tech issue\". When contacting them again an hour later, I was asked to reschedule for yet ANOTHER four hours later. All of this without them contacting me at any point to explain these \"delays\".   Felt pretty sketchy coming to a site like this and I was absolutely correct, but at least I don't have to worry about getting banned from what else they bumble up. When asking for a refund they were evasive, and when doubling down I was just told \"sure :(\". This site is obviously a scam and I doubt I'm ever going to see this money refunded, but steer clear."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T15:45:33.000Z",
          "Titre": "They didn't fulfill enough unsaved…",
          "Contenu": "They didn't fulfill enough unsaved raiders which provided less loot on the main boss I needed, on the last boss of the raid they kicked me from the group before looting completed and I lost out on loot. I attempted to ticket with blizzard but they don't do loot reassignments."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bushy",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T08:39:53.000Z",
          "Titre": "My gold purchase from you",
          "Contenu": "My gold purchase from you, WowVendor, got my account banned for two weeks. Game support is taking back all gold or items purchased with that gold. Basically, your mistake getting caught and I have no game gold and lost real cash and suspended for two weeks. Wish I never tried to buy gold from you and would never recommend you to anyone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Beloc",
          "Nb_Reviews": 2,
          "Date": "2023-11-23T03:27:50.000Z",
          "Titre": "3rd raid in a row that has started over…",
          "Contenu": "3rd raid in a row that has started over an hour late.  Great service, if you are not time gated, but if you have limited windows to play in and need to have a semi accurate timeframe followed, this is NOT the service for you.  Look elsewhere."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joseph Lee",
          "Nb_Reviews": 5,
          "Date": "2023-11-20T05:47:59.000Z",
          "Titre": "I bought a Normal 9/9 run.",
          "Contenu": "I bought a Normal 9/9 run.They did 8/9. I followed up numerous times through 5 days. They were non-responsive. They kept telling me to sign up for the final boss. There were no openings. Also, the website wanted me to pay for the final boss again.I'm in dispute with them on PayPal.This company is the worse of all the running companies and twice the price as companies like KingBoost."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Sage",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T02:38:07.000Z",
          "Titre": "Got a raid boost and when they got to…",
          "Contenu": "Got a raid boost and when they got to the last boss they started asking some of the customers to port out of the raid and do it later…… clowns"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Matrix",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T22:41:27.000Z",
          "Titre": "Terrible Service Experience",
          "Contenu": "I have used your services dozens of time throughout the years, specifically in WoW.  Just got back into the game for the latest patch, and bought 2 normal raid runs for different toons.  First one was great as always- second one I wasn’t invited to group, so I was contacted on discord to join a later run… and then was not invited again.  I reached out on discord, and an associate did some research and said another character with a similar name was invited and completed the run and was able to see that it was in fact a mistake… which is fine, mistakes happen.  Here is the major issue… After relaying this info and recognizing the problem, the staff member said that since the run was completed for a different toon (not mine, no affiliation) that it was marked complete and I would just lose my money that I paid for the run?? Is this a reputable business or the mafia?? That explanation is comical, and I will just use one of the dozens of other services in the future."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T05:34:06.000Z",
          "Titre": "No Communication",
          "Contenu": "My run was scheduled for 7:30, and I waited til 10:30. no communication from them at all."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joseph Lee",
          "Nb_Reviews": 5,
          "Date": "2023-11-18T04:39:20.000Z",
          "Titre": "Didn't Finish Content",
          "Contenu": "I bought a full clear of the Amirdrassil raid.They were unable to kill the final boss on normal first week. I followed up every day. They never put me in another raid to finish. I wasted a lot of time reaching out to them to largely be ignored."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "The Sauce",
          "Nb_Reviews": 1,
          "Date": "2023-01-06T17:27:26.000Z",
          "Titre": "Split time window false advertising",
          "Contenu": "I purchased a heroic raid run and selected my time slot.  Once purchased they informed me that the entire run wouldn't be performed at the selected time but would be split between two different time frames.  I contacted customer service and were not helpful at all.  Seemed more interested in insisting they were not false advertising.  Asked for a refund and was blown off so I had to file a claim with paypal."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-06-03T18:03:18.000Z",
          "Titre": "account got banned using their service",
          "Contenu": "account got banned using their service, they then offered a heroic edition of dragonflight, a free lvling of a character 60-70 and also a normal raid carry so i could play on another account while my main was banned. I asked a week after they offered me this if the codes were available yet and support acted like they had no idea what i was talking about and blew me off. They shouldnt have offered if they were going to not follow through in the end"
        },
        {
          "Note": 1,
          "Lieu": "KR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-07T18:55:25.000Z",
          "Titre": "didn't complete all the runs",
          "Contenu": "didn't complete all the runs, swapped out members to only do the same 3 out of 8 dungeons for a 8x mythic +10 run. Seems like they didn't want to get me over 1k mythic plus rating as it would conflict with another service they were selling. Waste of 200 dollars."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T02:21:57.000Z",
          "Titre": "I ordered 3x checkpoints for a master…",
          "Contenu": "I ordered 3x checkpoints for a master RON weekly challenge and instead the recov just used my spoils to buy the other two weapons taking the short cut. Terrible service so I now will need to spend time getting those spoils back."
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Tias",
          "Nb_Reviews": 29,
          "Date": "2023-01-03T01:12:12.000Z",
          "Titre": "Persistent spammers",
          "Contenu": "These guys are nothing but obnoxious. They'll use any means necessary to reach out to people and spam them. I'm not interested in your god damn obnoxious service. If I was I'd look at the service channel. Don't freaking try to reach out to me you scummy people"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alan Tillman",
          "Nb_Reviews": 1,
          "Date": "2023-01-09T09:07:55.000Z",
          "Titre": "Misleading at Best",
          "Contenu": "Maybe try to claify you are putting Legend raids first and bot mentioning legend. Who would pay for a normal clear when Master is available. It is just stupid and this is a scam. Use other services that clearly state what they are selling."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2023-08-11T02:36:07.000Z",
          "Titre": "The guy who actually did the run was…",
          "Contenu": "The guy who actually did the run was just a random free service guy who had no idea I paid anyone, this company is just a middleman that get money for no reason. For poe anyway..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brad",
          "Nb_Reviews": 9,
          "Date": "2023-07-09T10:18:38.000Z",
          "Titre": "Poor Experience",
          "Contenu": "Very poor customer service as I purchased a service that was advertised to have 2 loot traders and in one of my runs I only got one. Also the boosters went so fast through the dungeons and I could not keep up with them. The boosters are non communicative during the run. Very unhappy with the service"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Matt",
          "Nb_Reviews": 2,
          "Date": "2023-08-21T17:39:41.000Z",
          "Titre": "The service is a complete joke",
          "Contenu": "The service is a complete joke. You can purchase the regular service but do not expect to get anything out of it other than AOTC. If you may think at all that loot will drop you would be wrong. They basically have all the raiders locked out so there is no chance of getting loot from the boss' The only reason I chose to do this was for the chance at some loot. I get that i wont get a bunch of it but i had hoped for maybe one piece or something. Good luck getting any gear at all. The experience is a joke and I will make sure that I never use any of their services again and push for a refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bryan Gallahan",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T23:10:44.000Z",
          "Titre": "Worst Care for Customer Service",
          "Contenu": "Very poor communication from company.  You are told to wait 20 minutes, 45 minutes later you are told hold on, after another 15 minutes you are told we are inviting in 5-10 minutes, after 25-30 minutes later you ask again and finally get into your party.  All you get from this time wasted is a \"o, we are sorry.  we screwed up\" I am aware you did.  They punish you if you have issues and are not on their timelines no matter what the reason.  Been with them for a long time but change is needed after this.  I would recommended going with a different company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shadow",
          "Nb_Reviews": 2,
          "Date": "2023-04-10T21:40:13.000Z",
          "Titre": "Master flawless solo lost sector",
          "Contenu": "Ordered master solo lost sector, the eta was 1- 24 hours. Booster ignored my order for 4 days. The booster Never responded to customer service, so I was left on read for hours on end. Customer service deemed 24 hours to complete a master flawless solo lost sector was unrealistic time frame."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-09-13T07:40:43.000Z",
          "Titre": "Usually my runs go great and there is…",
          "Contenu": "Usually my runs go great and there is no issue.I bought a weekly run, a hour before the raid was supposed to start and it included a +17 mythic.mythic added me and told me they would start soon- half hour went by. Okay, still got a half hour, i get into the dungeon and we are going through it. Well, the raid messages me and asks what is going on, that they can't wait for me any longer.I of course not thinking said that I bought their bundle deal and it wasn't my fault they did the dungeon first. Customer service ofc contacted me and said that since I mentioned boosting I have to wait 24 hours for the safety of my account. Since I didn't want to wait and was already peeved about being put in a situation I told them to just charge me the mythic and refund the rest.They gave me a store credit-- which honestly I probably won't use. I just felt stupid and pressured when I'm not the one setting up the times."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "AUSTIN LYON",
          "Nb_Reviews": 5,
          "Date": "2023-01-05T00:23:16.000Z",
          "Titre": "Greeeeeeeeedy",
          "Contenu": "These spamming scammers just want your money when there are thousands of people willing to help for free. Shame on these kids.Edit: thanks for the senseless comment Mary. Your input brought true value to the experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Waters",
          "Nb_Reviews": 3,
          "Date": "2023-05-25T05:16:42.000Z",
          "Titre": "Same as a PUG.  But....  A PUG is free!  Save your $$ or use a different service.",
          "Contenu": "Figured I would give this service one more try, after last nights fiasco.  I would have loved to have left a positive review today, but that isnt going to be possible.  After 2 hours, 5 wipes on the 2nd to last boss, we are still going.  I am very doubtful they will even be able to get us past Sarkareth.  I ranted and raved about this service in VOTI, but something has changed, because my runs in season 2 have been dumpster fires. Find another service or just save your $$ and run a PUG.  You will have the same result."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-08-27T19:28:27.000Z",
          "Titre": "Not worth",
          "Contenu": "Not worth, they check what your class is and on purpose don’t bring any of your class and so you don’t get any loot. Change classes before purchase and you can see how the time of the raid changes. Don’t waste your money unless you’re after the achievement only. They brought like 4 hunters and the only loot were mail and guns that none of us could use…"
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T03:25:21.000Z",
          "Titre": "Not worth it",
          "Contenu": "When u configure the boost it gives no clear explanation. Took longer than advertised to complete the order. The master NF order is only one run with no more options and it gives no reward. Just a total waste of money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Azzzz",
          "Nb_Reviews": 2,
          "Date": "2023-03-08T22:06:13.000Z",
          "Titre": "PACKAGE FAIL",
          "Contenu": "So I booked the package for Heroic Clear and a +16 dungeon on Monday morning. I asked if they could do the dungeon run today because the package allows 1-3 days to complete. The raid run was quick and smooth but I never heard anything more about the dungeon run. Three days later I'm trying to reach out and all they wanted to talk about was why I couldn't reach customer service via Discord. I gave up the run and this will be my last purchase with wowvendor.com."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Pierre",
          "Nb_Reviews": 2,
          "Date": "2023-11-17T18:16:38.000Z",
          "Titre": "Raid started 2 hours late",
          "Contenu": "Raid started 2 hours late. Got told there would be a short 10 minute break that ended up taking over an hour."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bryce Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T03:22:02.000Z",
          "Titre": "Ordered a level boost. Never got done",
          "Contenu": "Ordered a level boost. Gave them the account at level 28 so all they had to do was go to 55. Two weeks later never got finished. Even paid extra for the express option and website said to take 24-36 hours. So don’t expect it to be done when you want it to or what the website tells you it will be done. Cuz it never will be. Communication was terrible kept telling me it would be done daily then I would check progress daily and it never got touched."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Garfield Norris",
          "Nb_Reviews": 4,
          "Date": "2023-03-21T00:33:22.000Z",
          "Titre": "I ordered this company’s services to…",
          "Contenu": "I ordered this company’s services to assist me in completing Legendary missions in Destiny 2. They said they would be available for 5pm (CST) in the US. I gave them a 44 minute heads up. They responded saying they had 45 minutes. At 5pm and 5:15pm I got no response. I wrote them that if they were not online by 5:30pm I would file a complaint and reach out to PayPal for a refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ross - Pewpewdeluxé",
          "Nb_Reviews": 2,
          "Date": "2023-08-20T04:16:29.000Z",
          "Titre": "Disappointed - Not Good",
          "Contenu": "I've used these guys before, always 5 stars. Better than Overgear, especially when it comes to customer service. First booster messed up the logins, like 3 or 4 times, lol. Dude couldn't figure out the codes, repeated typo errors- probably high AF. Second booster did fine with the login. Before I ordered the boost, I let them know that it was -very important- that all my bars, keybinds and options settings needed to be put back to where the booster found them. After the boost was done, all of my bars and keybinds and options were screwed up. I contacted WowVendor, and the booster told them they had \"Technical Difficulties,\" so they couldn't change anything back (doubtful, yeah?) So the booster marked the order as completed and moved on without fixing anything. Unprofessional service from the booster on this order. After I complained about the settings problems, the booster said they were busy, and that it would take a few hours before they could correct their mistakes. Try again later. Will have to go through the login codes nonsense all over again. Bummer! Order #1182202edit: The customer service was again, excellent and they addressed my concerns afterwards, but I will add that the booster not only messed up my talents, he somehow OVERWROTE my other 2 talent builds. Had to rebuild my trees. Oof!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 14,
          "Date": "2023-05-18T00:27:34.000Z",
          "Titre": "$70 platinum GM fail",
          "Contenu": "Paid $70 for a platinum gm nightfall and didn’t get the platinum finish. Pro asked if I really needed it. I mean , I paid $70 what do you think. At least we finished the GM but still very disappointed and feeling robbed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Azzzz",
          "Nb_Reviews": 2,
          "Date": "2023-04-07T00:54:06.000Z",
          "Titre": "DON'T BOTHER WITH THESE PEOPLE",
          "Contenu": "I purchased a raid and M+ run combo. They came through for raid but never heard back from them on the run. Also no way to communicate even thru discord unless they contact you first. I've done a bunch of runs with these guys but no more. Don't waste your money. Also, this is the second time I've left this review because somehow my first review \"disappeared.\""
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-26T07:19:49.000Z",
          "Titre": "Every drop seemed to go to two people…",
          "Contenu": "Every drop seemed to go to two people in the raid and when their weee rolls they always won even on greed. Not the experience I was expecting nor will I return for any more runs with that group. Seems like those two were being fed gear on our dime."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 6,
          "Date": "2023-04-06T21:47:29.000Z",
          "Titre": "SCAM!",
          "Contenu": "SCAM! People from the carry guild will roll on items. They will also bring in alts from their guild to gear up during the carry run. I did speak to customer service during the raid when this happened and after. They said the TWO guild members rolled by accident and the items were given to the 2nd highest roller. This was not the case and the items were kept for themselves.I was offered a discount for my \"inconvenience\" but have yet to receive it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T02:32:09.000Z",
          "Titre": "I order MYTHIC +16 / +17 / +20 GREAT…",
          "Contenu": "I order MYTHIC +16 / +17 / +20 GREAT VAULT BOOST - BULK DEAL. It was the same 4 mythic dungeons. Very disappointment."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Drew",
          "Nb_Reviews": 2,
          "Date": "2023-05-30T07:13:04.000Z",
          "Titre": "The run didn’t go as planned took over…",
          "Contenu": "The run didn’t go as planned took over 4 hours. They switched groups three times. We took 25 minutes in breaks. I was told an 1:30 to 2:00 hours for abberus. The raid was 35 minutes late. To top it all off the stock email for the review said “hey superstar”. Yeah it was pretty much all bad. Little to no explanation as to why we were constantly wiping. I should’ve pugged."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-04-06T09:14:49.000Z",
          "Titre": "You killed the boss easily and i could…",
          "Contenu": "You killed the boss easily and i could do the fight which was great, i wasn’t expecting personal loot so could be my bad. But yea nah that wasnt worth it. Chances if loot was so insanely low it felt like a scam."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stooge",
          "Nb_Reviews": 1,
          "Date": "2023-03-05T23:26:16.000Z",
          "Titre": "If I could rate this 0 stars, I would. Be diligent with what service you buy from this site, the one I purchased was as close to a SCAM as you can get!",
          "Contenu": "If I could put 0 stars, I would. I paid $109 for a level 60-70 power-level + an 8/8 mythic 0 dungeon run by a TEAM who would try to gear the character as close to a full set of 379 gear from scratch from those 8 dungeons. What I received instead was a auto-played power-level that took multiple days, and then a SINGULAR booster to run the dungeons on my behalf on my account BY THEMSELVES in PUG groups without even trying to armor stack. All I got from this $109 was a power-level, and a few purple pieces. The funny part is, the Customer Service Bot even admitted that there was a flaw in their description of the service on the website. They did not mention anywhere in the package that the 8/8 M0 run was going to be auto-played and SOLO in PUGS. I have screenshots of them admitting this. They even repeatedly mentioned the boosters as a \"team\" several times throughout the process, when really it was one single person lollygagging around on my account when I'm not home. You might say I'm a clown for spending $109 on a service like this in the first place, and you're probably right, but this was a big decision for me and I felt it was in the best interest of my time and entertainment value of being able to immediately jump into end game content, but what I got was severely underwhelming and not what was originally described for me. I can't even queue for LFR on this character lol. What a joke."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "NOONE",
          "Nb_Reviews": 1,
          "Date": "2022-12-21T16:59:18.000Z",
          "Titre": "Abuse and Bad customer service",
          "Contenu": "First it was all going well till the last boss. We were kicked of the group so that they could kill it on their own and then they invited us back to kill it again. Of course since most of the raid had it done already their was no loot on the boss. I tried to complain to the customer service that told me it is normal. But it isn't. They are selling a run with the possibility to loot something on EACH boss. I understand that they may have a lot of demand but if the people leading the raid want to keep the loots for themselves then they shouldn't be paid to take people with. Either you take the money and offer the complete service or you just raid with your guild with noone to carry. I will certainly think twice next time i consider paying for help. And the way the service ghosted me afterward is conforting me in the idea that the quality of the service isn't there anymore. SHOULD PROBABLY TRY ANOTHER SERVICE."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sabastian Groshans",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T17:14:24.000Z",
          "Titre": "CUSTOM POWERLEVELING TO 60",
          "Contenu": "Booster was unreliable with meeting time frame of 47 hours. The booster was constantly offline and made the process Terrible. Customer service was amazing with helping out."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-21T06:06:46.000Z",
          "Titre": "Run went fine",
          "Contenu": "Run went fine. They didn’t add loot type for my armor class and got one piece that wasn’t my class piece out of entire run. Not worth getting advanced package."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-04-24T17:17:05.000Z",
          "Titre": "Bad loot rules",
          "Contenu": "They noticed I was tagging along for bosses and made it so only one piece of loot dropped per boss with their comp."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "valued customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T01:50:39.000Z",
          "Titre": "pack you in with 20000 others so you…",
          "Contenu": "pack you in with 20000 others so you can get 0 loot. Some of their \"boosters\" also couldnt parse higher than me."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "cliente",
          "Nb_Reviews": 2,
          "Date": "2023-08-13T23:37:48.000Z",
          "Titre": "bad powerleveling",
          "Contenu": "very slow they said it took 4 hours with the superfast boost and it took me 6 hours to do my boost"
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Lullichiiqa",
          "Nb_Reviews": 1,
          "Date": "2022-12-29T11:40:10.000Z",
          "Titre": "Constantly getting spammed with…",
          "Contenu": "Constantly getting spammed with Calendar Invites about them selling runs on all my characters.I never visited the homepage or showed any kind of interest in the service(s) they provide. So it's beyond frustrating to see it - not just in trade chat - but also get forced into invitations on 10+ characters daily, which you can't just ignore - because a question mark will keep pinning until you do some kind of reaction.This type of advertisement makes it feel desperate, and makes me even less ever want to use \"their product/service\", if I at any point should change my mind on getting boost services.And please don't waste your time on sending me a customer service response - just stop using it on people who never \"signed\" up to get your advertisement in this form.Or another way to deal with it - I just start sending you invoices and take payment for the time I spend on administrative work, on removing and now also blocking the \"inviters'”. It adds up when it's multiple characters and it's every single day.... So please keep your advertise where people can make a choice to react or not, and not forcing and bothering them =)"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T15:13:04.000Z",
          "Titre": "I had to move my time slot and got…",
          "Contenu": "I had to move my time slot and got paired with three others of the same class and spec. Made it almost impossible to get gear."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T22:19:19.000Z",
          "Titre": "It’s said loot would be traded but…",
          "Contenu": "It’s said loot would be traded but carrier kept mount"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Demonthoorc",
          "Nb_Reviews": 7,
          "Date": "2023-07-14T14:16:15.000Z",
          "Titre": "I pay for a better lot but the only the…",
          "Contenu": "I pay for a better lot but the only the trade me was armors for anorther class!!! Loss of my time"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mm",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T15:00:33.000Z",
          "Titre": "My account was banned because the…",
          "Contenu": "My account was banned because the booster did not use a VPN"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andres Santander",
          "Nb_Reviews": 4,
          "Date": "2023-07-26T05:17:59.000Z",
          "Titre": "They don't honor what's on their…",
          "Contenu": "They don't honor what's on their website but it must be a bug they say. Okay ill pass"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Huntmetoo",
          "Nb_Reviews": 5,
          "Date": "2023-05-20T06:13:21.000Z",
          "Titre": "Read my comments on Discord discussion…",
          "Contenu": "Read my comments on Discord discussion with you."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T06:02:01.000Z",
          "Titre": "Almost no loot dropped at all",
          "Contenu": "Almost no loot dropped at all, I got none.  Poor balance of interests"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T20:48:12.000Z",
          "Titre": "Yeah",
          "Contenu": "I just keep getting emails to review."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Blaze",
          "Nb_Reviews": 2,
          "Date": "2023-05-28T00:41:23.000Z",
          "Titre": "All runners loot locked so nothing…",
          "Contenu": "All runners loot locked so nothing dropped wasted time ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 6,
          "Date": "2023-04-04T17:50:29.000Z",
          "Titre": "SCAM!",
          "Contenu": "SCAM! People from the carry guild will roll on items. They will also bring in alts from their guild to gear up during the carry run."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 6,
          "Date": "2023-04-04T17:51:00.000Z",
          "Titre": "SCAM!",
          "Contenu": "SCAM! People from the carry guild will roll on items. They will also bring in alts from their guild to gear up during the carry run."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 6,
          "Date": "2023-04-04T17:51:21.000Z",
          "Titre": "SCAM!",
          "Contenu": "SCAM! People from the carry guild will roll on items. They will also bring in alts from their guild to gear up during the carry run."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 6,
          "Date": "2023-04-04T17:51:47.000Z",
          "Titre": "SCAM!",
          "Contenu": "SCAM! People from the carry guild will roll on items. They will also bring in alts from their guild to gear up during the carry run."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Novakai Uchiha",
          "Nb_Reviews": 3,
          "Date": "2022-09-01T23:33:37.000Z",
          "Titre": "Hacking Alert!!",
          "Contenu": "Worst experience ever!! Upon trying to get a recovery I got hacked and my bank account got robbed over $1,000. They ordered online from my psn account, which had the exact card number of all the fraudulent transactions. Whoever you guys gave my psn login clearly ordered from my psn account online. That's how its possible to get robbed. Customers delete any payment info so you are safe."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cathie Taft Starr",
          "Nb_Reviews": 2,
          "Date": "2022-08-15T03:23:53.000Z",
          "Titre": "Be very careful when you communicate…",
          "Contenu": "Be very careful when you communicate with these people.  They give you half answers.  I purchased what I thought was a full run to find out it was only 9 bosses.  I told the man I only needed to last boss and was loot locked on my main.  He went to check on something n never came back so I hurried and purchased the raid only to find it didn't include the one boss I needed."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Robert Furnseth",
          "Nb_Reviews": 2,
          "Date": "2023-03-04T14:21:01.000Z",
          "Titre": "think twice",
          "Contenu": "people pay for this service so be more thoughtful"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-01T18:54:48.000Z",
          "Titre": "The items I received were downgrades",
          "Contenu": "The items I received were downgrades, or items I already had. Not worth $164"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jonh Chen",
          "Nb_Reviews": 1,
          "Date": "2022-08-07T04:54:30.000Z",
          "Titre": "Don't waste your money",
          "Contenu": "Don't waste your money.  Ordered 6 hours farming Diablo immortal. Asking to farm Legendary gears. Only 1 Legendary and 3 pieces of set items were farmed.  Informing that booster was doing dungeons.  But battle pass only level up 1 level.  6 hours dungeons and battle only level up 1 level, you seriously?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Don",
          "Nb_Reviews": 1,
          "Date": "2022-07-29T04:15:29.000Z",
          "Titre": "Used, then got suspended.",
          "Contenu": "I've used these guys multiple times. I've spent well over 500 dollars for many mythic boosts and a few AOTCs. I've recently used them in season 3 to get my mythic title. Within 48 hours of running a few mythics with them, my account was suspended for 30 days by Blizzard for using boosting services. Buyer Beware."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amanda Finch",
          "Nb_Reviews": 2,
          "Date": "2022-08-07T00:34:53.000Z",
          "Titre": "Never Got An Invite",
          "Contenu": "Was told raid was ready, responded immediately. never got an invite. Got lots of excuses and blamed for being in a group when I was not. I was sitting on timeless isle killing rare spawns for 6 hours. Not only was I not in a group I was completely alone in an entire zone. 0/10 do not recommend."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "WOW Player",
          "Nb_Reviews": 5,
          "Date": "2022-07-08T07:45:18.000Z",
          "Titre": "Service Unsafe",
          "Contenu": "Service is unsafe.  Even if you don’t make any mention in game of the service and self play your account will still be suspended or banned.  This means you will be suspended by players already being watched closely by blizzard guilty by association.  Money wasted as any progress you made blizzard rolls back your account removing gear and achievments."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "WOW Player",
          "Nb_Reviews": 5,
          "Date": "2022-07-08T20:51:10.000Z",
          "Titre": "Service Unsafe",
          "Contenu": "Service is unsafe. Even if you don’t make any mention in game of the service and self-play your account will still be suspended or banned. This means you will be suspended by players already being watched closely by blizzard guilty by association. Money wasted as any progress you made blizzard rolls back your account removing gear and achievements."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "WOW Player",
          "Nb_Reviews": 5,
          "Date": "2022-07-08T20:51:35.000Z",
          "Titre": "Service Unsafe",
          "Contenu": "Service is unsafe. Even if you don’t make any mention in game of the service and self-play your account will still be suspended or banned. This means you will be suspended by players already being watched closely by blizzard guilty by association. Money wasted as any progress you made blizzard rolls back your account removing gear and achievements."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "WOW Player",
          "Nb_Reviews": 5,
          "Date": "2022-07-08T20:52:01.000Z",
          "Titre": "Service Unsafe",
          "Contenu": "Service is unsafe. Even if you don’t make any mention in game of the service and self-play your account will still be suspended or banned. This means you will be suspended by players already being watched closely by blizzard guilty by association. Money wasted as any progress you made blizzard rolls back your account removing gear and achievements."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Filthy Brigade",
          "Nb_Reviews": 1,
          "Date": "2022-07-25T06:27:32.000Z",
          "Titre": "If you want to waste your money and time, go ahead!",
          "Contenu": "I bought a 11/11 HC Sepulcher of the First Ones carry. The run started a few minutes late, then we wiped on the 2nd boss and 3rd boss. At this time after waiting a week for this, it was super disappointing and the team didn't seem to care. No apology or anything. I requested a refund via Discord and they said they will need to wait until a manager approves it. I was also removed from the group as well. Thankfully I paid with Paypal, however I can't recommend anyone use this website to get carried. Because you won't get carried anyways."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "WOW Player",
          "Nb_Reviews": 5,
          "Date": "2022-07-08T20:52:28.000Z",
          "Titre": "Service Unsafe",
          "Contenu": "Service is unsafe. Even if you don’t make any mention in game of the service and self-play your account will still be suspended or banned. This means you will be suspended by players already being watched closely by blizzard guilty by association. Money wasted as any progress you made blizzard rolls back your account removing gear and achievements."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "NotGood",
          "Nb_Reviews": 1,
          "Date": "2022-07-05T22:13:20.000Z",
          "Titre": "Purchased 4xM+15 runs",
          "Contenu": "Purchased 4xM+15 runs. Was contacted by booster that they could start in and hour or next day. I arranged for next day at 17:30. I was online from 17:00 to 20:30 with no contact from booster. In that time I contacted 'customer service' twice to be told they were checking. After not hearing for another hour I gave up waitingTold that customer service arranges time of run despite what it says when buying run. Used to be awesome service but now customer service is awful, runs are not smooth and more expensive then competitors. Such a shame!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-08-22T06:23:48.000Z",
          "Titre": "Service was horrible",
          "Contenu": "Service was horrible. Team tried and failed at completing my order now they “don’t” have a team available for my order and it was purchased 15hr ago. They stopped responding to me in discord after I ask about a team."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "nonya",
          "Nb_Reviews": 5,
          "Date": "2022-04-26T16:39:22.278Z",
          "Titre": "What was then isnt now",
          "Contenu": "They use to be pretty good at having a schedule that was more convenient for folks, Especially US , The schedule now is awful. The options to have more customized runs is very limited. But EU have very nice options, just not for the US. So people have to work, which means they must sleep too, to ask people to be ready in the middle of the night is becoming ridiculousness."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "dirtymojo",
          "Nb_Reviews": 1,
          "Date": "2022-08-16T00:40:52.000Z",
          "Titre": "No response on my question and they move on...",
          "Contenu": "Paid for a run and had to wait a whole day for the run to take place. I get the message 3 minutes after the expected time asking if I was ready. I asked if I could finish something really quick. No response for 6 minutes. The message I get at that point is WowVendor SupportBOT — Today at 6:10 PMUnfortunately, our team has already started the process of another order, we will try to contact you as soon as possible 🙏Then they could not start for another 1-2 hours, when I would no longer be able to be online. Had they just said \"no, we cannot wait\" or anything, I would dropped what I was doing. But no response and then just moved on? Such poor service. It has been like this of late."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Forrest Olson",
          "Nb_Reviews": 3,
          "Date": "2023-02-18T19:25:01.000Z",
          "Titre": "Awful",
          "Contenu": "Awful. Got me banned and have done nothing about it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Pafford",
          "Nb_Reviews": 3,
          "Date": "2022-05-10T02:19:41.000Z",
          "Titre": "All im getting is excuses as to why…",
          "Contenu": "All im getting is excuses as to why cant be boosted and teams not available . have been told tomorrow twice already . Tomorrow is reset and now will be another week before can get gear . will not be paying again . to me 34 dollars is lot of money and not going to do agina"
        },
        {
          "Note": 1,
          "Lieu": "NO",
          "Pseudo": "JOSTEIN KRISTIANSEN",
          "Nb_Reviews": 4,
          "Date": "2022-12-30T01:54:02.000Z",
          "Titre": "Stay clear",
          "Contenu": "Expensive , missleading prising , poor communicationStay clear"
        },
        {
          "Note": 1,
          "Lieu": "GR",
          "Pseudo": "vassilis kafetzopoulos",
          "Nb_Reviews": 2,
          "Date": "2022-01-29T16:20:46.000Z",
          "Titre": "Worst boosting company customer care",
          "Contenu": "The costumer care person was ironic (\"Why do you think so??\") (\"We're not doing personal raids for each of our customers. I'm sorry you were disappointed.\").They delayed the stream missing half of the raidThe booster did not restore my keybinds, and when I said ask him to fix them he said probably tomorrow."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stewart",
          "Nb_Reviews": 8,
          "Date": "2022-03-11T14:09:36.000Z",
          "Titre": "Spell Tomb Mount",
          "Contenu": "As usual, wowvendor came through flawlessly! I must admit I was hesitant to give my account info out, however all went off without a hitch. It took a little longer than I was expecting but I knew they would be swamped with orders. Will be using the service again soon.Update: 02/23 Banned for using this service. Be wary of Piloting. Will use other services again though."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Baby yoda",
          "Nb_Reviews": 1,
          "Date": "2022-02-27T22:41:55.000Z",
          "Titre": "Buyer beware unethical company",
          "Contenu": "When buying ilvl boosts from this company they sneek in a line \"by any means necessary\" which means they will basically buy you the gear with your money  or use other unethical means. You are not getting all of what you pay for. When questioned about this they chose to ignore the customer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2021-12-03T04:49:17.000Z",
          "Titre": "I ordered a Heroic SoD Advanced Loot…",
          "Contenu": "I ordered a Heroic SoD Advanced Loot Run. The group wiped on KT four times. I was the only player being boosted, and I was doing 3rd highest DPS. Also, if you buy a raid loot funnel you get guaranteed X amount of items, but it includes loot you personally receive as well as any loot you don't want or already have. Pretty flawed system. 1/5 stars."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 3,
          "Date": "2022-02-04T18:41:54.000Z",
          "Titre": "After talking with this company's…",
          "Contenu": "After talking with this company's support they got aggressive with me after I left truthful reviews about my experience. They asked me to rewrite my reviews if I wished to continue using their services. I would suggest going elsewhere for better customer service and product delivery."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "RodgerYankeeDelta",
          "Nb_Reviews": 9,
          "Date": "2021-08-17T17:08:20.000Z",
          "Titre": "30 Day suspensions across the board and no service or support",
          "Contenu": "Update: 30 day suspensions for many many people and Wowvendor has pretty much told their customers to go kick rocks. They are actively deleting reviews from Trustpilot to ensure that people don't know how widespread the issue is.You'll notice that these reviews are now missing from Trustpilot:* imgur dot com/7rgVVQA* i dot imgur dot com/sRQyuWiWill be going through my credit card company to reverse the charge(s)."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Adam P",
          "Nb_Reviews": 3,
          "Date": "2021-09-29T22:09:19.000Z",
          "Titre": "Pay them to carry their alts!",
          "Contenu": "Wanna pay money to help carry wowvendor's alts?  This is the place then.  The final boss groups are really good.  Raid clears, not so much.  They will bring alts wearing greens to the raid, and have no issue with taking your money and letting you help carry them, then acting like they provided YOU with a service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rex Flynn",
          "Nb_Reviews": 4,
          "Date": "2022-09-14T00:23:11.000Z",
          "Titre": "I should have stayed away.  You should too.",
          "Contenu": "I should have stayed away.  I've used them before, and though I've had some horrific experiences, I just returned to the game and figured I'd try them again.  This was the 3rd time I've used them this year, and the first two times were fine.  This last time was completely and utterly unprofessional.We did a run, and through no fault of their own, at the last boss, the system wouldn't let us go any further.  I'll give them that much credit, that there was nothing that they could do.  But the RL, and his crew, had us waiting around for about 45 minutes, and then they all just logged off.  Leaving us all high and dry.  I'm actually more offended at the communication than anything.If you're looking for a professional group, this aint it.  I don't think I expected much, except for them to be professional.  I'm not using them again, I'm sure there's someone else out there who will be professional."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 3,
          "Date": "2022-01-26T06:04:55.000Z",
          "Titre": "The prices of the listed options are…",
          "Contenu": "The prices of the listed options are too high for the quality of service you recieve. They make sure to go out of their way to not give you any gear or even the chance of having someone in your group that could pass it unless you pay for a loot funnel."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nonya",
          "Nb_Reviews": 5,
          "Date": "2021-09-11T20:40:07.000Z",
          "Titre": "After good service for years, now poor.",
          "Contenu": "I have used them for years, for the most part its been pretty good. 4/5 and 5/5. Now 1/5 -2/5However, as of late like last few months the service has been getting poor.  I have placed several orders that never got finished or never got started and resulted in either a credit or a refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-07-11T16:29:07.000Z",
          "Titre": "I got a 30 day ban after using this…",
          "Contenu": "I got a 30 day ban after using this service, I know i deserved, it to try and get a toon raid ready faster then the right way but just a word of caution Blizzard is onto this service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tyler Stiehl",
          "Nb_Reviews": 1,
          "Date": "2021-03-20T15:57:38.000Z",
          "Titre": "Absolute dumpster fire of a service",
          "Contenu": "Absolute dumpster fire of a service. I have a loot log and the two most important bosses i needed some how dropped one piece. I didn't see anyone loot. A guy came in with a lower wep. And hearthed came back all a sudden had a better ilvl. And so many excuses where given. Would never recommend this to anyone"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Adam Ledford",
          "Nb_Reviews": 1,
          "Date": "2020-12-23T06:01:52.000Z",
          "Titre": "Unresponsive, non-existant",
          "Contenu": "The order was due to start in 2-4 days from the time I made payment. We are now on day 5 with no contact. They keep saying they will have people contact me and no one does. Their customer service keeps making excuses and assuming these other reviews are not fake, it seems like they have no problem completing high-value orders."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "RodgerYankeeDelta",
          "Nb_Reviews": 9,
          "Date": "2021-08-22T20:21:47.000Z",
          "Titre": "Great for getting banned",
          "Contenu": "Doesn't stand behind their product(s). Will have members upload logs to warcraftlogs.com and thus people in the group get punished for their services. They do not tell people not to upload logs either and the raid lead doesn't attempt to hide the logs or remove them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mountainman",
          "Nb_Reviews": 4,
          "Date": "2020-05-09T01:14:29.000Z",
          "Titre": "Broken Checkout",
          "Contenu": "After selecting the service I wanted,  I ACCURATELY entered all of my card info for the purchase and their system said there was an \"issue\". Well, the issue is on your end folks.  It's not my card.  Yes, it's a debit card, yes, there are sufficient funds, yes it's a current card.  My time is too limited to waste time on more than one attempt to buy something."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "jimmy",
          "Nb_Reviews": 1,
          "Date": "2019-10-22T02:24:17.000Z",
          "Titre": "account banned",
          "Contenu": "please do not share account with this company for boosting service. account banned after 2 weeks, they keep switching IP address and Computer.  Said by the customer service: \"there is never a 100% of safety. \"   let me translate this :\" if account got banned, its your own  fault for trusting us . we take 0 responsibility of it, you want a refund? hell no."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "OceanicAnimalPS4",
          "Nb_Reviews": 1,
          "Date": "2019-09-24T20:21:19.000Z",
          "Titre": "Do not use WoWVendor",
          "Contenu": "Ordered a service and was told it would take 3-5 days to get started. Tried to get updates on my service during that time and nothing was being done to ensure me that it would be started on time. On the 5th day of me waiting for my order I asked if they would be finding someone and I was met with this response “ no, i cant know that”. Very bad customer service and professionalism. Will not use this service ever again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 17,
          "Date": "2023-12-16T22:52:48.000Z",
          "Titre": "Do Not Go for Loot",
          "Contenu": "I have purchased runs on every class and armor type, and every group is stacked with the same, making competition outrageous.If you change your class to one using a different armor type, you'll more often than not see that the times for those runs are different. This is done to ensure the most competition for you, the least likelihood of obtaining anything, and increasing the amount of runs they can complete, or persuade you to purchase a more expensive option. Great business model, but it feels so so bad as a customer.Check my other reviews, you'll see I am an avid customer, this is not a 1 off."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T05:07:54.000Z",
          "Titre": "Refund",
          "Contenu": "Responsive team, Im sure they would have provided the service i paid for but don't ask for a refund all they gave me was store credit."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 17,
          "Date": "2023-12-16T22:31:33.000Z",
          "Titre": "Stacked Against You",
          "Contenu": "Great boosters and CS, but they stack groups to ensure the most competition. Which leads to many rolling for the same token, or a token being passed by all.I have spent thousands and purchased dozens of runs. Trust me when I warn you, purchase a run for achievements and xp, not loot. Feels so bad to pay for a run and leave with nothing because you had to roll against 5-6 others."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 17,
          "Date": "2023-12-16T21:34:11.000Z",
          "Titre": "Stacked Roles for Competition",
          "Contenu": "Great boosters and CS, but they stack groups to ensure the most competition. Which leads to many rolling for the same token, or a token being passed by all.I have spent thousands and purchased dozens of runs. Trust me when I warn you, purchase a run for achievements and xp, not loot."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Alexander",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T06:02:32.000Z",
          "Titre": "Splitting the raid at the last boss was…",
          "Contenu": "Splitting the raid at the last boss was really shady and inviting other dps so you have a bigger chance of losing gear not the best"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T23:38:41.000Z",
          "Titre": "This was my 3rd boost",
          "Contenu": "This was my 3rd boost. My first and third boost were incredible. Easy 5 stars. My 2nd was quite the opposite. Wiping on normal, getting delayed by hours, 2 of the boosters were only ~335 item level. Zero communication unless I reached out first. Of course, I didn't get a link to review that run."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael Gala",
          "Nb_Reviews": 8,
          "Date": "2023-12-08T03:25:46.000Z",
          "Titre": "Normally these guys are awesome",
          "Contenu": "Normally these guys are awesome, but a 15 minute break before they said they are changing groups, then another nearly 15 minutes waiting on the next group. I will of course try them again, but will look for another service if this happens again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T19:08:00.000Z",
          "Titre": "Terrible loot experience",
          "Contenu": "23 people in raid, yet 6 bosses dropped 1 piece of loot. Defeats the purpose of running for a chance at loot if loot doesn't drop. Upgrading for armor funneling is one thing, but there should always be loot dropping. (23 people should guarantee 3 with a 60% chance at 4)."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T21:31:30.000Z",
          "Titre": "The loot rules seemed unclear and a bit…",
          "Contenu": "The loot rules seemed unclear and a bit rigged to be honest. The price was a bit higher than other sites service that are similar. Run went smooth and started promptly though, i guess thats good? Ill go with a different service next time though."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-11-23T09:47:56.000Z",
          "Titre": "Premium standard raid- Downed all but…",
          "Contenu": "Premium standard raid- Downed all but last boss (as normal it is split into two separate raids) I let them know via discord that after all bosses except the last had been killed, I had received 0 loot (Literally no leather dropped, lost every roll for trinkets/rings that are used as a tank) I received a response of \"damn :(\" no mention of being invited to another raid the following week per their \"no-luck protection\". The 1st group said \"another friend will message you with details on the last boss\" 2 hours had gone by, I received no messages. I sent a quick chat on discord asking if there was any news on when the last fight would be. 35 mins later, there was still no reply, other than \"truly sorry for the waiting time\" I'm fine with waiting, I'd just like an actual update so I can plan to be online.."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeremy Strickland",
          "Nb_Reviews": 2,
          "Date": "2023-11-17T04:28:06.000Z",
          "Titre": "Unfinished raid runs",
          "Contenu": "While they do usually give good runs they sometimes fall short on the raids and dont finish them, getting them to finish the run is a huge pain and they give your the run around, I've given up and wont be using them anymore."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Mark Ryan",
          "Nb_Reviews": 13,
          "Date": "2022-12-21T15:58:51.000Z",
          "Titre": "Purchased VAULT OF THE INCARNATES…",
          "Contenu": "Purchased VAULT OF THE INCARNATES NORMAL RAID BOOST and the raid went fine until last boss. the raid was ended. I messaged customer support and was informed that the last boss would be done about 5 hours later.I came back on to complete, no message no raid. I again contact customer support and they tell me it was canceled. Still waiting to finish."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-05-31T13:40:20.000Z",
          "Titre": "Not worth the money.",
          "Contenu": "No care or consideration is put into the group creation for the person being boosted. The primary reason most people are there is to get loot and you just haphazardly create groups with 6 people rolling for one tier token while you have other tier tokens that have 0 competition. Definitely not worth the money at all."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-05-21T19:04:24.000Z",
          "Titre": "Not great communication",
          "Contenu": "Unfortunately, they have a communication issue.One rep said that due to the several missed appointment times, and missing server reset, that they would redo my order the next week.Well, we didn’t finish and that representative is nowhere to be found.  I didn’t feel like pushing the issue as these guys don’t listen.Be sure to buy with the expectation that these guys are a mess with schedules.  Be flexible.I didn’t have that luxury.Eventually the order did get completed.  However, when you buy with a purpose and they are unable to have basic communication where you make and keep commitments… Sorry. Not the best experience…"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Unsatisfied customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-24T05:19:14.000Z",
          "Titre": "Horrendous waste of money…",
          "Contenu": "I would give it a 1 star review because of the efficiency of getting it done is what saved it. Otherwise it was an absolute waste of money got a piece of loot and took ages to get the mythic complete. I’ll never spend that much for nothing again. Customer support was good."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T22:13:49.000Z",
          "Titre": "The service was good; However...",
          "Contenu": "The service was good and the accomplishment was completed; however, all my UI options had been changed to someone else's choices not mine. My options in WOW are completely messed up! having a hard time resetting them back to my preferences. DO NOT CHANGE PEOPLES STUFF!!!"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Ridacoza",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T02:24:00.000Z",
          "Titre": "boosters rolling on gear they dont need",
          "Contenu": "The raid was run relatively smoothly no worries there, but when you have about 14 people paying around $70 or in my case 100 i think its bad that the boosters that are over 400 ilvl are rolling on gear they dont need"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joe Leon",
          "Nb_Reviews": 4,
          "Date": "2022-12-23T22:48:12.000Z",
          "Titre": "Raid was cleared, but no gear",
          "Contenu": "The raid itself went extremely smooth, however, only 5 people weren’t locked to the instance so maybe 4 pieces dropped from the entire run. I wouldn’t recommend anyone pay the money for a standard run."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Unhappy customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T05:33:13.000Z",
          "Titre": "Not professional.  Waste your time.  Eventually get the job done though.",
          "Contenu": "Beware of these guys.  They deliver eventually but they are never on time and they do not communicate.Most recently they disbanded a 6.30pm raid at 9.20pm with no communication.When I asked what was happening on Discord, they said we would reform in 20 minutes and to stay at my PC.  After 40 minutes of waiting they said I’d be scheduled for 11.30pm.  At 11.25pm they messaged and said they would be 50 minutes.They are over stacking the raid with boostees requiring them to split raids.  And because of that they wasted my entire night.This isn’t the first time I’ve had to deal with their lack of communication.Like I said, they eventually get the job done, but waste a lot of time with lack of organization and communication."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-14T02:01:05.000Z",
          "Titre": "Didn't get promised amount of loot.",
          "Contenu": "Advertised minimum raid loot of 4 pieces. Even ran me a second time, didn't get a 4th piece and they said loot that I didn't even get counted towards my promised loot kind of a shady move."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "AnnoyedCustomer",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T15:55:14.000Z",
          "Titre": "COMPLETELY Forgotten -TWICE!!",
          "Contenu": "This was the second time in a row that WoWVendor completely forgot about my booking - everything. They forgot the time. They forgot the looters. The run day and time was scheduled several days in advance. I messaged their customer service an hour BEFORE to make sure everything was ready. They were really slow to respond, and were not giving details. My scheduled run time came, and it went. Then a half hour later I finally had enough with them ignoring my messages and being 30 minutes late. Customer service responded saying their entire \"run team\" was in........ a storm with no internet connection? I said that was a lie, and they need to get someone out there immediately to do my run or I'm going to contest the charge on my card. FINALLY, an hour late and after demanding to get what I paid for, they managed to get people out to do the run with the 2 loot traders (which I had to make sure they provided because they likely would have forgotten). I am now extremely skeptical of this service. You've been warned.  The players doing the run were good and had no issues with the dungeon. But the organization here is non-existent."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ikemaster123",
          "Nb_Reviews": 20,
          "Date": "2023-05-19T15:53:01.000Z",
          "Titre": "Timelines that are on their website…",
          "Contenu": "Timelines that are on their website have not been correct. Lots of delays, over 1 hour sometimes. If you don't check in for your run, you might not get an invite at all. Customer service is very nice, but still wasting a lot of time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-07-12T07:18:52.000Z",
          "Titre": "Was not a smooth run",
          "Contenu": "Was not a smooth run. I have had multiple runs done amazing  but this one has been the worst. reconsidering not doing another it was that bad."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T23:23:56.000Z",
          "Titre": "No contact?",
          "Contenu": "The layers of obscurity and secrecy around contacting anyone are a bit too much. I missed a raid run today because nobody had contacted me to schedule the start time. I understand that the players need to be protected from bans, but I gave you four ways to contact me - the Wowvendor website, email,  Discord, and my Blizzard account. All I needed was \"Hey, we're gonna start at [time], and [player] will invite you.\"Instead, what I got was a random raid invite while I was doing dailies in the world, without any forewarning that it was for the run, or that the run was even happening on this day. In the current state of world content, that's simply not enough. I get random invites all the time while out in the world. Anyway, this run has been quickly rescheduled with little struggle. This is an acceptable, but frustrating, outcome."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-07-30T14:59:25.000Z",
          "Titre": "Job was done but meh",
          "Contenu": "Job was done, completed in a untimely manner. Account went unused for 36 hours that could've been spent gaming. Meh."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Andrew",
          "Nb_Reviews": 10,
          "Date": "2022-11-21T03:48:48.000Z",
          "Titre": "Raid boost not worth the $$",
          "Contenu": "The group did well, but 1 item for 31 boss kills was definitely not worth the money, I wouldn't recommend paying for raid runs unless it's with people feeding gear. Won't be doing that again.Low review is for the $$ spent for the reward. The group did fine."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 73,
          "Date": "2023-06-07T20:21:25.000Z",
          "Titre": "Pally Heavy Boost",
          "Contenu": "5 ret pallys boosties in a single raid.  would have been more but 1 boostie dropped before raid start.  Wowvendor has a system in place  to prevent this but simple didnt use it.  I feel completely ripped off"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Phillip Cooper",
          "Nb_Reviews": 2,
          "Date": "2023-01-17T01:53:19.000Z",
          "Titre": "Competent Clear with big flaws.",
          "Contenu": "Competent Clear - Loot barriers.So I've purchased and reviewed 100's if not 1000's of clears over the years. This was not the worst service. The group was competent, and cleared the content. The normal run took about 1.75 hours which was a little slow.The big issue. If you do not purchase premium services towards loot, you will not just roll against other carries. You will also roll against the carry members. Such as one of their healers rolling and winning a DPS trinket, clearly a heavily geared DPS rolling and winning plate. Until the final boss which I have experience on regardless of my poor damage on a new character was when the carriers versus the carries were really determined as the whole raid rolled on everything they could, whether to sell separately, or to collude to piloted characters.I would HIGHLY suggest purchasing carries elsewhere, where there are far more clear lines on what to expect. This is obviously a tactic to encourage you to return to service to purchase a premium service once you get that loot itch."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-11T12:44:46.000Z",
          "Titre": "Run was stacked with other plate…",
          "Contenu": "Run was stacked with other plate buyers. No attempt to balance the buyers across the runs."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jessica",
          "Nb_Reviews": 1,
          "Date": "2022-11-02T21:56:01.000Z",
          "Titre": "50/50 shot?",
          "Contenu": "It took my booster 4 days to log in, once logged in they didn’t play for 2 days bc of a blackout…I asked several different times to change boosters and was unable to. This entire experience took almost 2 weeks to go 8 levels. I could have done this faster on my own. I got no compensation even tho I was told I would get gold credit. However my bf paid for this the same day I did, also needing 8 levels and his booster was done in 3 days. I guess it’s just luck of the draw?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 2,
          "Date": "2022-11-02T22:25:04.000Z",
          "Titre": "Their raiders roll need on loot!",
          "Contenu": "Their runners will roll need on items that they want, even if a paying customer needs it as well. You literally have to compete against the people being paid to run you through a raid. I brought this to their attention and they basically said \"we will take your comments into consideration when we adjust our loot rules\" and let the runner keep the BiS spell dmg dagger (who was resto druid the whole raid). I would check with competitors first before choosing them to ensure you're not fighting a bunch of runners for loot!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 17,
          "Date": "2022-11-03T20:09:06.000Z",
          "Titre": "Avoid and use the finder.",
          "Contenu": "The boosters are good, and I used to whole heartedly recommend. Now I can’t. The last run felt really bad. The rolling system they use now could see you getting nothing while another who paid same price can get 5+ items. At that rate, don’t pay and just use the finder."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T07:33:33.000Z",
          "Titre": "Won’t use again",
          "Contenu": "Team was nearly an hour late at starting, and extremely slow on kill times. 4/10 will not boost again. Not worth the money spent."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 35,
          "Date": "2022-11-20T19:06:18.000Z",
          "Titre": "A plea to update raiding services",
          "Contenu": "I primarily use WowVendor's raid services to gear alts and my experiences have been mostly positive.Recently, there were changes to loot distribution in WoW but WoWVendor hasn't adjusted their services to reflect these changes with regard to gear funneling and competition for loot overall.There are no cutoffs regarding roster slots for armor types nor main spec roles in the carries that make up a standard group. In the latest raid, this meant that I was rolling against 6-7 others for every piece of gear. Suffice to say, it didn't go well.The advanced option is still there but true funneling for gear type no longer occurs.That leaves the premium option but I cannot justify the price for content that will be obsolete in a little over a week.My other complaint is the sheer number of carries permitted in each run. Since most self-plays are relatively fresh toons, we are essentially dead weight. The fights are buffed to reflect the extra bodies and this means not only longer run times in general, but multiple wipes on the final bosses.WoWVendor generally offers great services but I think I will be taking on pass on their raiding options unless they update their practices."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Meh Industries",
          "Nb_Reviews": 2,
          "Date": "2022-10-25T03:57:02.000Z",
          "Titre": "Missed 2x time slots for the runs",
          "Contenu": "Missed 2x time slots for the runs, both confirmed prior to by support and discord. Asked for a refund, waiting to receive it. Have spent thousands with these guys, but this time I did not receive the service they usually give. My recommendation would be to ensure staff know and honor the times given as for someone like myself, I'm busy and arrange my schedule accordingly."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Trevar Weight",
          "Nb_Reviews": 2,
          "Date": "2022-09-29T03:29:17.000Z",
          "Titre": "Dont plan on loot trades.",
          "Contenu": "Ran a Jailer run and found out later that all the runners had already looted boss for the week. Understandable as they run several runs a day but when your needed loot doesnt drop and there is no one else looting the bosses it leaves a bad taste in your mouth knowing you paid 18 dollars for a boss kill. Will be my last purchase here as I just dont feel the value from the service provided."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 5,
          "Date": "2022-09-07T10:04:36.000Z",
          "Titre": "Getting in to the raid raidwas very prompt…",
          "Contenu": "Getting in to the raid was very prompt but the person running it seemed very new to doing it , there was 4 wipes on one boss and a few others wipe on other bosses.  I have used this service before with out any problems it just seemed this lead was new"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "WARcustomer",
          "Nb_Reviews": 1,
          "Date": "2022-06-30T02:02:11.000Z",
          "Titre": "Didn't meet the guaranteed items",
          "Contenu": "Didn't meet the guaranteed items, they don't even match you with your own class (to ensure if the module drops, for teir gear, you receive it) and saw 3-4 modules drop with my gear traders that couldn't even trade because they were on paladin / death knight."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "mennah",
          "Nb_Reviews": 1,
          "Date": "2022-02-03T16:24:00.000Z",
          "Titre": "No loot trading on basic package",
          "Contenu": "Went on a full heroic mode SoD. Raid was on time, didn’t wipe, completed the run quickly. I chose the basic option, and ended the whole raid with 1 piece of loot (just bad luck). I noticed the raid would not trade anything, even if no one else in the raid needed it (there were 2+ items I could have used that got vendored instead). If they were nice about it and traded I would have bought more runs but not now. Thankyou though, achievement was good."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jimmy Sanders",
          "Nb_Reviews": 4,
          "Date": "2021-12-31T16:56:46.000Z",
          "Titre": "Subpar service (this time)",
          "Contenu": "I usually have great service with this business but the last couple of orders have been mediocre at best.  They didn’t update me on when my order was complete or show me a video of the 6 hour farming periods (which they have done in the past).  I recommend always uploading the farming videos to YouTube and providing a link to the customer."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 3,
          "Date": "2022-11-02T14:07:46.000Z",
          "Titre": "took 2 hours on phone to set new raid…",
          "Contenu": "took 2 hours on phone to set new raid time, also had to accept a different raid"
        },
        {
          "Note": 2,
          "Lieu": "BH",
          "Pseudo": "robert mcgee",
          "Nb_Reviews": 5,
          "Date": "2022-07-05T22:07:56.000Z",
          "Titre": "Buyer Beware",
          "Contenu": "Buyer Beware, buying a Raid boost with traders only gets you loot up until the last boss. Last boss is not included, which they do not make known until after you purchase. Aside from that, everything was good."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Steven Mills",
          "Nb_Reviews": 2,
          "Date": "2021-08-21T15:11:35.000Z",
          "Titre": "Use to be the best now just SO-SO",
          "Contenu": "The run was fine until the last boss which I understand they have to wait a couple of hours like it says on the website, but when I asked support they said it would be 3 days, if that is going to be the case then make sure the person who is buying the boost knows before they purchase it, In my case Sunday doesn't work for me since I will be out of town until reset."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Isaac Livingston",
          "Nb_Reviews": 2,
          "Date": "2022-07-11T03:51:39.000Z",
          "Titre": "The service was fine.",
          "Contenu": "Pros: At the end of the run the service was as advertised. The loot guarantee was met. Cons: started late, a number of wipes in the second to last boss, skipping large amounts of trash reducing BOE chancesI won't be doing this again. The overall experience was both rushed and boring.Edited to expand on my initial review and mention that WowVendor is getting pushy regarding my previous 3 star review. I feel that if they want a 5 star review, then they should provide 5 star service for the amount they charge. They did provide 3 star service initially; but after reaching out to me to express their dissatisfaction with my review, I feel I need to drop a star due to customer service.I am not looking for rebates, discounts, or any recompense here. This is my honest review."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Dominik Heuer",
          "Nb_Reviews": 3,
          "Date": "2020-09-23T08:35:02.000Z",
          "Titre": "Leveling costs Gold and Euro - _-",
          "Contenu": "Leveling took place in the specified timeUnfortunately a large part of my gold was used and apparently no gold was produced so that one claims to have spent 140gold for skills for lv 56Leveling was only from 54 to 60 ..... The gold was missing in a subject at the end of the 58 and 60 skills I also had to buy.Equipment was not purchased with it; my consumables were also used"
        },
        {
          "Note": 2,
          "Lieu": "RO",
          "Pseudo": "Vlad",
          "Nb_Reviews": 7,
          "Date": "2020-09-24T03:27:57.000Z",
          "Titre": "Awful run",
          "Contenu": "Awful run. Compared to my usual 5 star experience with WowVendor boosts, this one was just terrible.Nobody bothered to answer any questions, everyone played like they were forced to be there at gunpoint, the whole group died many many times, to the point where we were almost not finishing the dungeon in time.Just an awful experience. Maybe others get boosts simply for the loot but if the boost makes you feel like trash and not even part of the game.. that sucks."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "bruins00",
          "Nb_Reviews": 1,
          "Date": "2019-01-03T23:49:25.000Z",
          "Titre": "I've used this company for many boosts…",
          "Contenu": "I've used this company for many boosts before, but the last 3 times I've utilized them, they have messed up my keybinds and hotbars despite specifically asking this not be done.  I come home from work and log in for raid, only to be stuck re-fixing all my setup and UI.  They did provide the boost I paid for, but after a 3rd time of this happening after asking for it not to, I felt I needed to leave a comment on this."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Howard Asbury",
          "Nb_Reviews": 1,
          "Date": "2018-12-01T05:53:39.000Z",
          "Titre": "I had ADVANCED Personal Loot GUARANTEE",
          "Contenu": "I had ADVANCED Personal Loot.  they claim there will be 3 non-saved boosters of your Armor Type (cloth, leather, mail or plate), who are going to trade you ALL GEAR and WEAPONS they receive during the raid. They GUARANTEE: at least 5+ items in different slots. I receive not one piece of gear from anyone during this raid and when I asked about this all I got was silence."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Andrew",
          "Nb_Reviews": 3,
          "Date": "2019-09-11T23:41:01.000Z",
          "Titre": "I have used them before and had good…",
          "Contenu": "I have used them before and had good experiences but this time has been awful. I ordered a wow classic PL and it has been 3 days so far without it even being started. I tried to contact via discord and live chat for answers and have not received any answers. Normally great service, but this has been very bad."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mike Day",
          "Nb_Reviews": 9,
          "Date": "2018-07-17T14:33:17.000Z",
          "Titre": "You had to download Skype or Discord to…",
          "Contenu": "You had to download Skype or Discord to purchase services. I didn’t have either so started a Discord account and it was never used for the Argus kill I purchased. I lay dead for the whole encounter but I did get the achievement and mount which I’m very happy about. So why Skype or Discord when it was never used for instructions."
        },
        {
          "Note": 2,
          "Lieu": "NO",
          "Pseudo": "JOSTEIN KRISTIANSEN",
          "Nb_Reviews": 4,
          "Date": "2022-12-30T00:38:22.000Z",
          "Titre": "Expensive",
          "Contenu": "Expensive , none communicative experience Never again"
        },
        {
          "Note": 2,
          "Lieu": "NO",
          "Pseudo": "Rune Øverland",
          "Nb_Reviews": 1,
          "Date": "2019-09-18T12:22:00.000Z",
          "Titre": "Bought power-lvling last Saturday",
          "Contenu": "Bought power-lvling last Saturday and still haven’t hear anything from them? I am loosing valuable time and have no idea if they are able or willing to do it. My patience is gone and now I want my money back, but again it’s impossible to get in touch with them.  If they was upfront with, that they are overworked I would have understand that. I regret this decision and would advise people to not buy. And to Wowvendor please sort out your mess ASAP!Update! It seems that they are fixing it and Iam getting refunded. Thanks for fixing it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Zyphear",
          "Nb_Reviews": 1,
          "Date": "2018-11-14T03:56:05.000Z",
          "Titre": "Was supposed to start at 7PM EST we did…",
          "Contenu": "Was supposed to start at 7PM EST we did not start till 7:45 pm EST, they originally told me at 7 invites were going out, 15 minutes later they said they ran into issues and would start at 7:30, this did not happen about 15 minutes later at 7:45 we finally got started. This is really poor experience."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jonathan Stevens",
          "Nb_Reviews": 3,
          "Date": "2018-08-13T12:28:06.000Z",
          "Titre": "They advertised a special raid for Fiendish Hellfire Infernal Core.",
          "Contenu": "They advertised a special raid for a rare mount Fiendish Hellfire Infernal Core. 24 hours later I had not heard anything and time had run out to do this particular raid. This is the 2nd time I had purchased a raid or dungeon and there was no communication other than to confirm the purchase."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2018-10-14T14:15:38.000Z",
          "Titre": "I've ordered an Uldir boost and left my…",
          "Contenu": "I've ordered an Uldir boost and left my contact information. Three days have passed and no one has contacted me, the order hasn't been completed yet and the money has been paid.If it's not completed by Wednesday I will request a full refund. Disgusting attitude to the client."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "drodg",
          "Nb_Reviews": 1,
          "Date": "2019-10-05T15:50:09.000Z",
          "Titre": "No invite, extremely late",
          "Contenu": "Update: Run complete, but very late. Communication is a large issue with these guys/customer support is quick to blame the customer rather than take ownership for their own mistakes. The actual runners are decent, so if you can get ahold of them, it’s not a bad service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "brent coppens",
          "Nb_Reviews": 1,
          "Date": "2017-03-04T05:06:09.174Z",
          "Titre": "Slow service, so disappointing",
          "Contenu": "Ordered 24 hour leveling service - its been 2 days and I'm still waiting for them to START the process. Very disappointing, paying for a timed service and not receiving it in the specified time is the same as only getting a partial service. Can't say I'd recommend in the future."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Charles",
          "Nb_Reviews": 4,
          "Date": "2017-12-09T06:30:13.000Z",
          "Titre": "Had to get a refund",
          "Contenu": "I was left waiting nearly an hour before I was finally informed that I would not be invited to the raid and the raid would be rescheduled outside of my availability.The WowVendor discord user was courteous, but ultimately unable to resolve the issue.  I was forced to seek a refund."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sometimes good, sometimes bad.",
          "Nb_Reviews": 3,
          "Date": "2020-12-25T17:52:19.000Z",
          "Titre": "Boost was completed almost two days…",
          "Contenu": "Boost was completed almost two days later than proposed. Customer Service argued with me about the difference between \"ETA\" and \"deadline\" I received absolutely no updates when asked about my character. I had to have a friend log on to my account to tell me that, despite the boost originally intended to be completed the day before, my character was still level 51. Once they finally did finish my boost, my character was still renown 1, even though in the past when they boosted the character always ended at renown 5. Horrible job by the booster, and a horrible job by customer service. I will be charging back the paypal transaction."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2018-12-07T01:27:00.000Z",
          "Titre": "Not as advertised",
          "Contenu": "I did the personal loot run and it was good, so I decided to do a premium loot heroic.  It wasn't really as advertised.  I did get the amount of loot I was supposed to, but they traded trinkets and weapons to guildmates instead of carries that were paying."
        },
        {
          "Note": 2,
          "Lieu": "DK",
          "Pseudo": "Frank Voulund Andersen",
          "Nb_Reviews": 31,
          "Date": "2021-02-06T13:18:16.000Z",
          "Titre": "Maybe, just maybe another time.",
          "Contenu": "Spent to much time on their page, seeing payment error on 3 differ browsers, with all da sh!t disabled at the end, ended up with last slot taking, after i took the pp way - Lol a joke, used 1 hour +. CS nice  to talk to tho."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Agustin Gutierrez",
          "Nb_Reviews": 7,
          "Date": "2017-11-01T18:23:38.000Z",
          "Titre": "Wowvendor.com is simply not interested in providing a good customer experience.",
          "Contenu": "Unfortunately, this is the best rating I can give this vendor despite many, many purchases over the last year.  Their rude responses, or lack of response, missed commitments, etc. have simply become too much.  I will move on but felt its important others know before purchasing a service from wowvendor.com.To be clear, they did refund my money when I requested it, and that's a credit to them.  I simply expect more from those I purchase a service from in the way of a good customer experience.  I am happy to provide a screenshot of the most recent interaction I had with them to prove my point."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2020-11-28T17:56:26.000Z",
          "Titre": "Completed my order on time",
          "Contenu": "Completed my order on time. However, the individual who played my character switched around all of my key bindings. They also boosted the wrong spec (not a huge deal). Disappointed that such a reputable website let this fly."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kristin",
          "Nb_Reviews": 1,
          "Date": "2018-03-17T18:56:14.000Z",
          "Titre": "2.2k achieve gone bad",
          "Contenu": "I bought a 2.2k arena achieve for my character last season. Waited all season after the boost was done. Which took a quite awhile to get started. The customer service guy was rude and sassy and very unhelpful. I was contacted at the end of the season by a World Of Warcraft GM and my account recieved a mark agiainst it for using illegal people to help on the account. AKA wowvendor, the GM told me they could see the IP the wowvendor boosters were logging on from and removed my achieves and titles from that season I paid for and there was nothing I could do about it! Dont get caught out in the rain, dont gamble with these gents."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Joe M",
          "Nb_Reviews": 2,
          "Date": "2020-12-09T04:49:18.000Z",
          "Titre": "This site is definitely not safe if…",
          "Contenu": "This site is definitely not safe if you're going to buy any of their Powerleveling services I recommend you do not get them you will get banned 100% as I've already been banned for using these guys services."
        },
        {
          "Note": 2,
          "Lieu": "KR",
          "Pseudo": "Hyrul",
          "Nb_Reviews": 12,
          "Date": "2021-11-17T13:14:12.000Z",
          "Titre": "Honestly wasn't the best order I've…",
          "Contenu": "Honestly wasn't the best order I've had. Took way too long for what it was and there wasn't any communication unless I initiated. Probably won't be ordering from WV again"
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-12-28T13:22:15.000Z",
          "Titre": "Key not in time like the Service itself",
          "Contenu": "The Service Itself was okay. I was \"AFK\" and Still nearly Intime.Big negativ: The Waiting Time I buyed 1st Week and I get it 3-4 Week so I got It on my Main myself, so its a Wasted Money."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "damian",
          "Nb_Reviews": 2,
          "Date": "2020-12-22T19:24:30.000Z",
          "Titre": "Smooth run BUT",
          "Contenu": "Smooth run . Just noticed a habbit of starting 1/2 hour to hour late on my last few runs.  If they want my money they will need to start at the advertised time . My time is worth money too right ."
        },
        {
          "Note": 2,
          "Lieu": "CH",
          "Pseudo": "Mitch",
          "Nb_Reviews": 1,
          "Date": "2018-12-23T18:09:09.000Z",
          "Titre": "Did the job but in what a way...",
          "Contenu": "Did the job but in what a way...Did the Mythic Run but changed all the keybinding, talents and action-bars.Took me over a bloody hour to get back to my game. For that price I wished a much better service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mr Black",
          "Nb_Reviews": 4,
          "Date": "2018-11-28T20:44:09.000Z",
          "Titre": "Do self played runs.",
          "Contenu": "1st heroic run was good. I did 2 more after that and and zero loot after 16 bosses and they didn't even roll bonuses as i requested. Maybe it was bad luck but it just didn't feel right."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Adrian Douglas",
          "Nb_Reviews": 1,
          "Date": "2017-06-05T12:02:01.000Z",
          "Titre": "I bought the Mage Tower Challenge and …",
          "Contenu": "I bought the Mage Tower Challenge and after  3 days while The Event was active . No attempts were made even thou they said they would start on each Day .I cant recommend these Vendor Services ."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Connolly",
          "Nb_Reviews": 3,
          "Date": "2018-05-08T09:41:31.000Z",
          "Titre": "Not so good this time...",
          "Contenu": "Unfortunately there were many problems this time...The service itself was perfect, don't get me wrong. I got what I ordered.But the way to it was a pain in the a... my whole interface was messed up, afterwards. No excuses, whatsoever... only talking out of it and giving responsibility away. What a bs! Had expected much more... starting with a 'sorry' or maybe refund or special offer for next service. Nothing! That is so dissappointing. Communication with customer service was difficult anyway. I always had to ask about the state of my service. That was so much better last time.I almost had to reinstall my whole game and addons... and you guys just ignored me.As a matter of fact I am not quite sure if I order again. Sorry guys! But you can do much better."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-04T03:41:45.000Z",
          "Titre": "Pretty ordinary",
          "Contenu": "Pretty ordinary. Got the level boost for Dragonflight, only got up to the 2nd last zone on the Campaign so now I still need to do that. Also changed all my keybindings so had to reset them all. Better off just doing it myself if they dont even do the campaign"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Dan Pereira",
          "Nb_Reviews": 1,
          "Date": "2017-08-14T08:28:55.000Z",
          "Titre": "Ok, need to improve greatly",
          "Contenu": "Booked a H ToS 9/9 full clear on Alliance for 13/08  @ 6pmThe booking itself was good, no issues and was contacted to be online at the agreed start time. Received my invite on time and raid formed. This was the last of the smooth running,  I am not sure if this was a new group but we  took close to the 3 allocated hours and wiped 7 times (1x Maiden, 3x Avatar and 4 x KJ. With only around 4-5 carries in the group it seemed odd, even the hosts were dying to mechanics. I have used other services before and was completed in half the time and zero wipes.   I expect and understand some issues occur, mistakes etc but i would also expect a cleaner run when you pay for the convenience. All in all, nice guys, easy service but not happy with quality of product and will return to the previous used service next time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Faygo22",
          "Nb_Reviews": 1,
          "Date": "2017-03-07T01:37:28.185Z",
          "Titre": "Get results but it is odd...",
          "Contenu": "Before sharing this review, I am a huge pvp fan. I stopped for a couple of years and just wanted to see a good RBG group for Alliance again.I purchased 1 RBG on Saturday around 2:30pm EST. I didn't receive an invite until around 8pm EST on Monday, that is after me having to contact the site. I was excited and ready to actually fight the Horde, however, the Horde never came...Crazy thing is we won an RBG because there was no opposing team....The customer service was great from the site. It was awkward because not a single person spoke in the raid group and no invites were given to speak in Vent, Discord, Skype, or Team Speak. I guess if you are looking for boring wins with no action, then buy runs. In the end I feel like they are not earning my funds, just a way of cheating somehow. I am fine with running my main with pugs and actually enjoy the action."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "LG",
          "Nb_Reviews": 1,
          "Date": "2020-06-07T21:27:34.000Z",
          "Titre": "Poor comm and rude players",
          "Contenu": "2nd time using their service. This time arena 3s. Carry lead was a jerk, and I've learned my lesson using this company - won't happen again."
        },
        {
          "Note": 2,
          "Lieu": "IL",
          "Pseudo": "Jimbo",
          "Nb_Reviews": 1,
          "Date": "2019-09-07T21:29:03.000Z",
          "Titre": "just but now some boost and its start…",
          "Contenu": "just but now some boost and its start so bad.. and supporter just not anwar and not help and really not patient.. just make do all alone and do 3/10.."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "dnld trump",
          "Nb_Reviews": 1,
          "Date": "2019-03-05T02:20:15.000Z",
          "Titre": "If you don't get pvp services its great",
          "Contenu": "If you don't get pvp services its great. But if you want the pvp serice, order 3 days in advance for when you wanna play. Very slow."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Zu Yao Hong",
          "Nb_Reviews": 2,
          "Date": "2020-12-18T13:07:48.000Z",
          "Titre": "Boosters consistently stood in fire…",
          "Contenu": "Boosters consistently stood in fire (even in boss fights), and I was the one carrying them on the last boss of Plaguefall."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Benoit Gauthier",
          "Nb_Reviews": 7,
          "Date": "2019-12-30T06:00:38.000Z",
          "Titre": "A bit disappointed in the service in…",
          "Contenu": "A bit disappointed in the service in general, the raid went fine but I had a slight better experience with other sites."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "IseeAcokeBottle",
          "Nb_Reviews": 1,
          "Date": "2020-07-26T03:12:18.000Z",
          "Titre": "Slow response times",
          "Contenu": "Slow response times. They missed my scheduled time 3 times. I'm sad TitaniumBay can't serfice NA currently."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Z",
          "Nb_Reviews": 2,
          "Date": "2019-02-24T18:06:11.000Z",
          "Titre": "HORRIBLE - but getting better.",
          "Contenu": "An hour late for an invite for heroic BoD raid from the schedule on their website. Attempting to reschedule was a nightmare. Getting the refund is a nightmare. Very little communication throughout the process. Wasn't even sure I'd get my refund. The chat on the website kept asking me to use the chat in discord. Problem is though that the discord person takes forever to respond.This is a difficult thing for me to do because I've used the services before and they were prompt with delivery. This is just completely inexcusable for a repeat customer and an easy way to develop a horrible reputation.EDIT to the reply:This site does not have a support team. Once you do try to contact them, they tell you to goto a different person on discord. Only problem now is that I can't talk to anyone on discord because I've been blocked. Great Customer Service.......EDIT 2:So they're doing their best to make up for the service. We've rescheduled. Until then I'll make this review a 2 star instead of a 1 star. Will rewrite this review after the service has been completed."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "michael Smeda",
          "Nb_Reviews": 12,
          "Date": "2022-04-02T12:46:23.000Z",
          "Titre": "Hmm group from stormrage",
          "Contenu": "Hmm group from stormrage - in a lot of blues and greens. I had to carry them lol"
        },
        {
          "Note": 2,
          "Lieu": "PT",
          "Pseudo": "Malh",
          "Nb_Reviews": 1,
          "Date": "2018-08-17T15:33:32.000Z",
          "Titre": "Ppl buy 3 or 4 bossters we ask for…",
          "Contenu": "Ppl buy 3 or 4 bossters we ask for discont and give 10% is same ppl buy frist boost is a shame :("
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "joshua anderson",
          "Nb_Reviews": 2,
          "Date": "2019-06-20T02:33:51.000Z",
          "Titre": "Guy seemed to be playing on McDonalds…",
          "Contenu": "Guy seemed to be playing on McDonalds wifi 4-5 DC that led to downtimes and gold repair."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "joshua anderson",
          "Nb_Reviews": 2,
          "Date": "2019-06-04T03:01:38.000Z",
          "Titre": "First run didn't fully clear",
          "Contenu": "First run didn't fully clear. had to stay up to 3 am to get in another run."
        },
        {
          "Note": 2,
          "Lieu": "NO",
          "Pseudo": "liverpool_man",
          "Nb_Reviews": 6,
          "Date": "2019-02-08T06:26:48.000Z",
          "Titre": "2 people leave chat, third one says wrong info, they havent updated parts of site in 2 years",
          "Contenu": "so short version: 3 chats, 2 people leave mid conversation, 2,5 hours later still no asnwer to my question, and website not updated in 2 years. Hi I contacted the site to ask for 3 simple thing about their sale items: how much for 2k rating boost + 6 hours of coaching, and how much for vicious saddle boost. this should be easy to answer right? First chat with bella whisperwind, after my 2nd reply she took 30 min afk. I ask where she is after those 30 min. Waited mroe, and she left. Then I talked with Atalan or something. He introduced himself and says Hi, I copy pasted the convo so it was easy to get context and continue his parters chat. 10 minutes and DC from him too. Then, 3rd chat in 2 hours, I click Reconnect again after he DC-s. Now Nathan Fireheart or some similar name comes. I put it as simply as I can, third time. He asnwers last question and says vicious saddle isn't obtainable so it was removed. That's untrue and it's  come back since patch 8.1 after filling progress bar twice you get it. Now he claims \"its out of stock, it says so on the product.\". That is also wrong, the only description is \"slots left\" under price. Then i realise they havent updated the website in 2+ years since vicious saddle was removed from game. I ask why and he says They dont remove it when the item isn't obtainable anymore, and didnt update status eithere. only care to write review so other people dont waste Time and any normal person would be raging"
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "konrad szalkowski",
          "Nb_Reviews": 3,
          "Date": "2021-09-15T06:41:59.000Z",
          "Titre": "Little bit to expensive for normal run…",
          "Contenu": "Little bit to expensive for normal run with not trading gear"
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Stefan Gursch",
          "Nb_Reviews": 2,
          "Date": "2021-11-20T16:18:19.000Z",
          "Titre": "Fast",
          "Contenu": "Fast, good and uncomplicated, I can only recommend it"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Crystal VanArsdale",
          "Nb_Reviews": 3,
          "Date": "2021-02-12T19:31:51.000Z",
          "Titre": "Good fast run",
          "Contenu": "Fast run! Great customer service. Will use again"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Trust Me",
          "Nb_Reviews": 2,
          "Date": "2021-06-25T06:22:27.000Z",
          "Titre": "I waited 2 hours for a mythic+ carry"
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "Genius",
          "Nb_Reviews": 3,
          "Date": "2019-10-19T20:29:34.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience, good service!"
        },
        {
          "Note": 2,
          "Lieu": "SI",
          "Pseudo": "Thor",
          "Nb_Reviews": 9,
          "Date": "2019-12-30T04:10:47.000Z",
          "Titre": "Fast and good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 12,
          "Date": "2023-12-19T02:45:07.000Z",
          "Titre": "Disappointed",
          "Contenu": "I purchased a run using my own key and they didn’t use it. Was disappointed because had a chance at a piece of loot I wanted but they did up the key a +2."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Schlegel",
          "Nb_Reviews": 7,
          "Date": "2023-12-19T15:53:09.000Z",
          "Titre": "You can never tell what you will get",
          "Contenu": "All you can count on is the flight stones and crests on a m+ run"
        },
        {
          "Note": 3,
          "Lieu": "NO",
          "Pseudo": "willy larsen",
          "Nb_Reviews": 13,
          "Date": "2023-12-21T10:11:12.000Z",
          "Titre": "ok nothing more."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Sithe",
          "Nb_Reviews": 6,
          "Date": "2023-12-20T21:20:54.000Z",
          "Titre": "New loot system leads to loot hogs"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T21:40:53.000Z",
          "Titre": "Decent service",
          "Contenu": "I liked that this ws legit and they did what was agreed upon. Communication was always responsive and positive. What I didn't like was that there was zero timetable or estimate of time completed. I also didn't like that the name I provided to them was unavailable so they just added an extra letter at the end of the name, instead of asking me first what they should do."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Badmoon",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T03:09:43.000Z",
          "Titre": "My only problem with WoWVender is a…",
          "Contenu": "My only problem with WoWVender is a lack of communication. After I paid for a carry several days before, the payment sat on pending for some unknown reason and I couldn't get an explanation as to why. American Express said the payment went through on their end. When I finally did get a team invite several days later, it completly out of the blue and I was confused as I hadn't even discussed a day or time to run a M+ with anyone yet, so I didn't know who this player inviting me was or what they wanted. A quick introduction would have cleared things right up."
        },
        {
          "Note": 3,
          "Lieu": "PA",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-12-29T06:15:07.000Z",
          "Titre": "Good carry but ETA delay communication",
          "Contenu": "the first thing im going to say , is that the performance of the persons who take you to the carry is amazing. they do just perfect . the main area of oportunity will fall on the ETA time . I paid for the express completion service and because of ¨a high queue¨ i needed to wait a little bit longer than expected.     - what impacted me the most is that I needed to be the one contacting the customer service team to find out that there was a delay instead of them letting me know in advance."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jimmy",
          "Nb_Reviews": 17,
          "Date": "2023-10-04T03:31:55.000Z",
          "Titre": "Got the job done but lack of…",
          "Contenu": "Got the job done but lack of communication.  They finished in very good time, but I didn't know they were done because they never told me.  Also, the booster ruined my interface setup and I had to spend 30 minutes fixing it."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Matt",
          "Nb_Reviews": 5,
          "Date": "2023-01-10T14:31:40.000Z",
          "Titre": "Mythic +",
          "Contenu": "Bought 4 mythic 10 runs which went quickly, however no gear was traded to me even when it was not an upgrade for the boosters.  Result was a small bump in my mythic + rating.Would generally recommend buying in game with gold as a result as the people there tend to trade the loot"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jigglesworth",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T16:41:52.000Z",
          "Titre": "Ran late constantly",
          "Contenu": "The service itself was just ok. Did I get what I was after, yes. The runs averaged 20 minutes late with my third one running a full hour behind. Leaders were pretty uncommunicative. I expected timeliness and a minor amount of instruction."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brockstar_LIT",
          "Nb_Reviews": 2,
          "Date": "2023-02-26T18:23:26.000Z",
          "Titre": "Gimme my exotics back",
          "Contenu": "They got my service mixed up with another service, asked for a code to get in my acct multiple times jus to not get on my acct till the next day.. would get on with no notifications but then sometimes notify me.. did the job great and did the job fast, but then I was saving exotic engrams for light fall and I had about 15 in the post master and they ran my services and pushed out all but 2 of my exotics I was grinding for.. jus wish they paid attention a little more to peoples account and what they have.."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Horde Heroic Raider",
          "Nb_Reviews": 2,
          "Date": "2023-01-03T02:22:49.000Z",
          "Titre": "Bought a normal raid full run and 15 timed key",
          "Contenu": "Bought a normal raid full run. Went through 7/8 Bosses then kicked from the group. Was told to wait for another group. This was never communicated. Waited an hour before I got an invite to the next group. I also bought a timed15 M+ key. The group didn't time the key. That was ok but they refused to run another key and kicked me from the group. I had to talk with customer support to figure out when I can get my timed 15 key I paid for. Took an hour to be told that I had to wait till the next day to get another run. The customer support didn't know when I'll get the run the next day. Was told finally when the run will be the next day after asking support again."
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T11:07:19.000Z",
          "Titre": "I added two loot traders",
          "Contenu": "I added two loot traders, but didnt recieve the trinket that dropped. No ise to add loot traders."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "SCA",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T11:23:23.000Z",
          "Titre": "It is just okay",
          "Contenu": "I really appreciated the response on finding the group but would have preferred an actual carry team instead of a stacked tank only. We had several wipes from having little dps and a struggling healer"
        },
        {
          "Note": 3,
          "Lieu": "CH",
          "Pseudo": "Luca/Kasydrud",
          "Nb_Reviews": 1,
          "Date": "2023-04-29T11:51:56.000Z",
          "Titre": "Advanced Boost",
          "Contenu": "It was no so nice for the price of 84€ i hoped thaa the booster an unsaved for more loot but they wasnt this is a bit sad but alll other things where good"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sheila",
          "Nb_Reviews": 5,
          "Date": "2023-05-29T23:19:43.000Z",
          "Titre": "I purchased the mythic+ bulk deal for…",
          "Contenu": "I purchased the mythic+ bulk deal for timed 16. I thought I was getting 4 different dungeons, but what I got were 2 dungeons both of which we ran twice. I was a little disappointed."
        },
        {
          "Note": 3,
          "Lieu": "CL",
          "Pseudo": "Wthuun",
          "Nb_Reviews": 2,
          "Date": "2023-01-19T15:42:30.000Z",
          "Titre": "Meh experience",
          "Contenu": "I liked that every fight was clean with no wipes. I disliked that the standard loot was very bad (only 1 item per boss) since most of the raid already killed the boss. Thanks"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert Waters",
          "Nb_Reviews": 3,
          "Date": "2023-05-24T04:51:41.000Z",
          "Titre": "Runs were fantastic during VOTI",
          "Contenu": "Runs were fantastic during VOTI, but have gone way downhill in S2.  Not sure what has changed, but I will be looking for a new boost service, that is for sure."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T08:10:35.000Z",
          "Titre": "Run was fine",
          "Contenu": "Run was fine, deal should have disclosed the amount of loot too be rolled on. Raid that size should have been at least 4 pieces of loot per boss, there was only two. Don’t believe the amount I paid was worth it for the gear that was actually useful for me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 12,
          "Date": "2023-04-09T21:57:26.000Z",
          "Titre": "Temple of the Jade Serpent",
          "Contenu": "Was told they would start immediately but close to 40 minutes later. The group I had wasn’t as good as others but they did good   If you choose a Random you can pretty much bet it’s gonna be a Temple. They seem to love that one"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 15,
          "Date": "2023-11-03T07:52:05.000Z",
          "Titre": "Quick and easy kill",
          "Contenu": "Quick and easy kill. Did have a later start than on my order. Also was the first time there was no loot to roll for which was not the the case in past runs."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T21:32:19.000Z",
          "Titre": "Slow service",
          "Contenu": "Slow service, slow response. Lack of coordination with booster. Compared to another website I use the communication isn’t the greatest."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "DDeeb",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T06:33:04.000Z",
          "Titre": "Lack of luck/time",
          "Contenu": "Just had to wait 2 Days after purchasing a sherpa :( and got didn’t get any guns in the raid but the people were nice!"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Debbie Mash",
          "Nb_Reviews": 28,
          "Date": "2023-06-30T20:57:25.000Z",
          "Titre": "I usually have good runs with any team",
          "Contenu": "I usually have good runs with any team. I was quite shocked this time. I piece of loot on last boss. Got killed every time on a boss with over 900g in repairs. Sadly disappointed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 4,
          "Date": "2023-02-10T20:30:48.000Z",
          "Titre": "Raid was great, mythics were meh",
          "Contenu": "The raid portion was done very well. The keys on the other hand I felt were very poorly run, with very little time management."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Matt Harbin",
          "Nb_Reviews": 4,
          "Date": "2023-02-25T17:00:23.000Z",
          "Titre": "Went great on run but damn 1 piece of…",
          "Contenu": "Went great on run but damn 1 piece of gear drops for me all run from last boss and yall inviting 6 hunters for raz kill. Said 1-2 gear pieces and I got jack nothing. Fun run."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-05-20T02:59:49.000Z",
          "Titre": "Invite didn't go out on time",
          "Contenu": "Invite didn't go out on time, took an additional 30 mins before receiving, had to follow up with customer service to see if raid was even happening"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-27T18:46:08.000Z",
          "Titre": "Did not like that half the raid was…",
          "Contenu": "Did not like that half the raid was loot locked reducing the total loot possible"
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Doc",
          "Nb_Reviews": 13,
          "Date": "2022-11-12T19:55:33.000Z",
          "Titre": "Hard work",
          "Contenu": "Unfortunately it didn't work on the first evening after 3 attempts to complete the goal, after repeating it the next evening it worked on the first run. Thank you again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ikora Ray Adept",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T05:10:37.000Z",
          "Titre": "I felt like I was more skilled then the…",
          "Contenu": "I felt like I was more skilled then the player that was hired for my assistance."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Zac",
          "Nb_Reviews": 1,
          "Date": "2022-11-16T15:21:59.000Z",
          "Titre": "The service was great just wish there…",
          "Contenu": "The service was great just wish there where more times available that are earlier in the day for people who have school."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-10-20T19:01:11.000Z",
          "Titre": "5 in 1 Raid hard to set up and plan",
          "Contenu": "The players were good at what they do but planning the raids is too difficult as a paying customer I believe they should try to work with your schedule I provided 8:30am-12:30pm and 8-10pm daily and even offered the afternoon but was unable to get it set up. Started partially into the raid about second encounter then asked if I wanted to go back. I guess when I pay for a service I expect more effort to make the experience a good one."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bronxmedic",
          "Nb_Reviews": 5,
          "Date": "2022-11-05T15:21:35.000Z",
          "Titre": "Just wish the sherpas would explain in…",
          "Contenu": "Just wish the sherpas would explain in detail each encounter. I would like to do more than staying in one spot . I don't feel like I'm learning that much"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2022-10-09T04:58:57.000Z",
          "Titre": "timely,well executed, poor communication in raid",
          "Contenu": "The raid was timely and well executed. At a base level the experience was fine.  There is 0 communication within raid, and too much is unclear. Every single item I needed dropped but it dropped for another assigned loot trader. The one I was given looted 4 out of 5 items for me, 0 of the ones I needed. When i asked how the final piece would be given I was told \"items you loot count towards the total.\" Idk it just kinda sucked every item I needed dropped and every item I needed went to the other Hunter."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2022-09-26T16:54:55.000Z",
          "Titre": "Fast service.. after delays",
          "Contenu": "Had a boost for Trials and it was scheduled for 4 am, since I'm in the US, and had to wait until 5. Which was already late as it is, for me. Mods in Discord were a little slow, as well. Apparently it was backed up due to an October promotion.  Make sure to double-check the light level before signing up because I forgot the detail not including Artifact Level!Once it started it was speedy and they were efficient. Can verify it wasn't a scam."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-13T20:52:20.000Z",
          "Titre": "Pretty good",
          "Contenu": "Team was ready kind of sucked that there wasn’t a funnel option but it worked"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 102,
          "Date": "2022-09-21T18:52:52.000Z",
          "Titre": "Odd experience ...",
          "Contenu": "One of the few times I haven't had the best experience after purchasing a raid with trade ppl. They used to tell you who the other leather trades were and who would be giving you their loot. I was given a piece of loot that didn't fit my spec and it was called a \"bonus\" and as soon as I spoke to them on discord, some foot drop was given to me that had dropped from an earlier boss fight. The last raid boss we were told to portal to a spot and wait for the fight to be over, then summoned back for another fight. An hour elapsed during that time. I'm not a very happy camper this time!"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "CK",
          "Nb_Reviews": 4,
          "Date": "2022-07-16T23:28:38.000Z",
          "Titre": "Service not up to usual standard",
          "Contenu": "There was a delay of nearly 40 minutes between the 2nd and 3rd runs. Nothing was said about this. When I eventually asked what was happening, all I was told was ‘problem with hunt’.During the last key, one of the dps went afk for at least a third of the run. Again, no explanation provided.This used to be a very professional and reliable service and this particular experience was not up to previous standards."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-27T22:22:00.000Z",
          "Titre": "Time",
          "Contenu": "The waiting time from 2,5h was realy bad. But the Service was perfect."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Trevar Weight",
          "Nb_Reviews": 2,
          "Date": "2022-07-18T20:43:55.000Z",
          "Titre": "The price was fair but communication…",
          "Contenu": "The price was fair but communication significantly lacked as it was difficult for the communications person to get a response from a booster. I boosted 3 toons from 50 to 60 and the longest I waited was 36 hours to get a response from the boosters. Time zone difference was only an hours difference as well. It would have been helpful if boosters were more proactive about giving real time updates such as when they logged off they could have given an update as to current level. Overall I would purchase again I think."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-09-13T18:15:02.000Z",
          "Titre": "Run was late",
          "Contenu": "Run was late.  Posted 10-20 min delay and then silence after 45 min of waiting I had to contact and ask to be moved to a different spot as they said the other run was still delayed for a bit."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-08-22T00:30:34.000Z",
          "Titre": "Prompt starting time and invites",
          "Contenu": "Prompt starting time and invites.  More deaths and wipes than I expected and did not like having to wait 2 days for the last boss kill.  A little expensive compared to others also, especially given the notes above."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Matthew bridges",
          "Nb_Reviews": 2,
          "Date": "2022-07-09T14:57:28.000Z",
          "Titre": "30 day ban.....However the company did their best to make it right",
          "Contenu": "Strike the 5. Account was banned, f me for not wanting to deal with toxic pugsEdit: Still banned, but atleast wow vendor did what they could to make it right. I cant put things back to a 5 because of the ban, but I am pleased that they did what they could to compensate."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joe Harris",
          "Nb_Reviews": 1,
          "Date": "2022-04-20T16:19:14.348Z",
          "Titre": "Not as good as they used to be...",
          "Contenu": "I have used this company several times over the past couple of years. In the beginning they were great. Now, not so much. I used to be able to order a mythic 15 run and have it completed in a couple of hours at most. Now it takes a week or longer. Not sure what is going on with the group, but they are not as reliable as they used to be."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Snots",
          "Nb_Reviews": 1,
          "Date": "2022-02-26T09:59:13.000Z",
          "Titre": "It can go wrong",
          "Contenu": "Thought everything went fine, appeared to be a good service until my account got suspended by Blizzard and I think I have lost the thing they got for me.   I have been contacted by wowvender who have explained that this would have effect all these service companies when they started a banwave, I am very happy with the way wowvender have resolved this issue and I am more angry with Blizzard for what I feel are double standard as they are hardly squeaky clean as a company!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jimmy",
          "Nb_Reviews": 17,
          "Date": "2022-01-23T18:00:37.000Z",
          "Titre": "Room for improvement",
          "Contenu": "Room for improvement.  I’ve used the leveling boost service several times in the past but this time didn’t seem as good.  They left all kinds of junk and unwanted quest items in my inventory, expired auctions in my mailbox, and didn’t bother changing my spec to what I requested.  However, the amount of time it took to complete my order was very good.  For these reasons, I’m giving 3 stars."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tony",
          "Nb_Reviews": 2,
          "Date": "2022-02-07T12:52:18.000Z",
          "Titre": "Finished my Renown for them they had it…",
          "Contenu": "Finished my Renown for them they had it all the way to 78 on Saturday, and I asked them what’s the status and they said he’s done for the day at 12 PM. I also leveled the renown from 72-75 the day before Saturday “Friday”. They had 6 days to do 40-80. I also ordered a boost for my friend from them at start time 10 PM and they said no one is available until 12:30 am so we rescheduled to the next day. I’ve used them multiple times just was a little disappointed at this part."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "sean",
          "Nb_Reviews": 3,
          "Date": "2022-01-21T04:56:39.000Z",
          "Titre": "Run was very smooth but",
          "Contenu": "Run was very smooth. Only bad thing was half the people were either saved to KT or didn’t loot so they wouldn’t have to trade. When you buy with gold they sell you KT and sylv loot too. Will do that. Only 1 piece of loot off KT for a group of 16ish and we had 3-4 pieces off every other boss. So kind of ruins personal loot when others are locked"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nino Threshold",
          "Nb_Reviews": 4,
          "Date": "2022-04-22T03:04:49.518Z",
          "Titre": "Caution on the GM order",
          "Contenu": "Caution on the GM order.  The new addition of the GM list for Conquerors led to a deceptive description on the service that you'll get a run based on the current active GM for the week.  With access to the list, they have freedom to choose the GM they run.  If you want a certain GM run, you'll need to opt for the Conqueror Seal service at a significantly steeper price point.  Flawed description reported, but until it's updated... understand that the service will be different.  Otherwise, they performed well as always.  No other complaints.  Happy gaming."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-29T05:54:56.000Z",
          "Titre": "Average",
          "Contenu": "Ilvl 230, often dps was keeping up in the top 5, without even a Domination set.  I asked to participate and still did not received heals.  I would often have to heal myself, I'm 8/10M, I know what I'm doing, game is not fun when I'm tanking the floor.   I had made it clear to the RL that I was experienced and wanted to play. I understand runs need to go smooth, and most don't have a clue as to what they're doing.... but still :( That's why the review isn't lower."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Daniel Toth",
          "Nb_Reviews": 1,
          "Date": "2022-03-10T20:54:10.000Z",
          "Titre": "The first booster was from EU and…",
          "Contenu": "The first booster was from EU and didn't notify anyone that their net was lagging bad and thus provided a portion of the order which almost cost them a bad review here. Afterward they re-assigned a new person and they completed the order in a very efficient and speedy manner."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "whiskrbiskit",
          "Nb_Reviews": 4,
          "Date": "2022-05-15T14:34:53.000Z",
          "Titre": "Took payment, contacted 2 weeks later",
          "Contenu": "Took payment, told me it could take up to 7 days. On day 9 now with no contact.edit: They have contacted me and said they would attempt to correct the issue as soon as possible. Still no resolution but I can understand the difficulties."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-06-15T16:30:39.000Z",
          "Titre": "Network manipulation",
          "Contenu": "Network manipulation? Destiny 2 trials flawless boost. It was ok. Seemed a lot slower than I expected but was still complete. It does not look like the boosters play for you however. Looking at the trials report they got matched up with the same group repeatedly. They use your account to lose to other players then go get your wins. Wish I would have known about this prior to purchase."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dirtymojo",
          "Nb_Reviews": 6,
          "Date": "2022-04-26T12:37:07.497Z",
          "Titre": "Please speed up the time from payment to service",
          "Contenu": "Usually, the team is super fast in getting your run completed. The last two times have been a challenge. The first I had to ask for a refund. The second took 5 days and many instances of me asking for a time so I could plan to be online. I got the run completed, however, it would have been nice to get it sooner as I’d be paying for more runs if it was done timely.I’m sure it will get back to normal, where they are easily a 5, but for now, I can only give a 3. The team doing the work is by far a 5. Super patient, great team work, and efficient when running the event. Kudos to those amazing players for dragging some of us through things to receive our rewards."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ross",
          "Nb_Reviews": 11,
          "Date": "2021-04-20T02:35:47.000Z",
          "Titre": "Recommended and Room For Improvement",
          "Contenu": "All in all, a good service, I recommend them. Three concerns. When I asked when my run would be ready, I was told 20 minutes. Then I was told 1 hour. It happens, but 40 minutes is a big difference. They did fix the issue later on, so that's a plus. The run went a bit slow. Spires of Ascension is usually quick, but it took 70 minutes. Also, our healer wasn't the best. We had 3 or 4 wipes and people died quite a bit. Tank and DPS were solid."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "PDemo",
          "Nb_Reviews": 1,
          "Date": "2021-06-12T08:46:51.000Z",
          "Titre": "No contact from Wowvendor of boost....",
          "Contenu": "Have had previously good experience with using WowVendor for various things.However, earlier today I purchased a timed +15 boost run for one of my toons...an hour later of sitting on their discord have had no contact at all...Have also e-mailed for an update but got no reply as yet :(Just want alil feedback..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-05-24T04:30:48.000Z",
          "Titre": "Although in the end we got the boost…",
          "Contenu": "Although in the end we got the boost done, I repeatedly had to reach out to the admins about setting a time and would not get an answer back to the answer I did get was “Let me check” and no follow up."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-04-10T00:19:50.000Z",
          "Titre": "So-So",
          "Contenu": "The run itself went well with no issues. The communication on the other has wasn’t the best. I had to message them to find out when they were starting. Once I contacted them they found a booster who proceeded to attempt to log in. The booster tried multiple times to log into account without VPN. I also had to message and ask if they were done (8 hours later) rather than them telling me when they were done."
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "Ktheryn Winnick",
          "Nb_Reviews": 3,
          "Date": "2020-09-13T14:35:12.000Z",
          "Titre": "This company is highly recommended",
          "Contenu": "This company is highly recommended. They were able to finish my neighbor's orders within a very short period. We were very impressed with how these people worked. They are customer oriented, they worked to ensure that the customers are served effectively. Therefore, this company provides a wonderful job that is recommendable."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customersquirrelbait",
          "Nb_Reviews": 7,
          "Date": "2020-04-08T05:55:41.000Z",
          "Titre": "nice run no problems,but the reason am…",
          "Contenu": "nice run no problems,but the reason am giving 3 stars., is because we really need to do dungens that would give good gear for the class am playing,i have hand gear at ilvl 425,i would really like to get these to at least 465 and the best dungen is TOS.other then that nice job just wish we could run me thru better dungens for better gear,thank you."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Beastware",
          "Nb_Reviews": 1,
          "Date": "2019-11-11T14:39:32.000Z",
          "Titre": "The services are very professional",
          "Contenu": "The services are very professional, however if you are doing a rep boost service be aware it is only the zone specific world quests that will be done I.E. If you was Zandalar Troll they will only do the Zuldazar quests not all of the quests. Again they are very professional, but be aware before you buy it will take the same time to do it if you end up doing it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "nitan",
          "Nb_Reviews": 1,
          "Date": "2019-08-15T22:27:00.000Z",
          "Titre": "It was okay but they delivered",
          "Contenu": "It was okay but they delivered. I thought the overall experience wasn't what I expected considering the reviews they get. There weren't much of any communication from the boosters. I had to scream out to the support team to get some services done otherwise I wouldn't get what I paid for. Also, the delivery time took longer than the anticipated delivery time because of the communication issue."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-05-01T11:39:48.000Z",
          "Titre": "I did all ten Natharia bosses on heroic…",
          "Contenu": "I did all ten Natharia bosses on heroic I was satisfied with everything but the fact that there was another paying customer who was a hunter who was brought along and when we beat Huntsman Altimor and a mystic anima spherule dropped it was given to that hunter no idea why. I’m still stuck with a 194 staff. I ended up with a belt, trinket, neck and bracers that were upgrades if I socket the bracers. My Ilvl went from 106 to 108. It would have been nice to not have another customer getting pretty much exactly what I needed. Otherwise it was as advertised."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Benched",
          "Nb_Reviews": 1,
          "Date": "2020-04-02T12:55:54.000Z",
          "Titre": "Ordered two services which were…",
          "Contenu": "Ordered two services that were completed as advertised. My problem is one hour after my account was finished Blizzard suspended my account for 30 days..... I spent $200 and will see if the account will be reverted as Blizzard threatened.Update 04/02/2020: Blizzard didn't remove account gains as threatened so all and all, I am good!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rotten Peaches",
          "Nb_Reviews": 1,
          "Date": "2019-08-09T00:02:08.000Z",
          "Titre": "420 boost, not worth",
          "Contenu": "Purchased the 420 boost and I'm fairly satisfied. They did log into my account and reset key bindings on day 1 and did ~1 mythic a day until day 6. On day 6, they did more Mythics and did some Emissary quests & spent my prismatic manapearls upgrading junk Benthic gear to scrape out the last few iLvls and I wasn't really thrilled about that. But, they did technically get me to 420 within 7 days, so not sure what I expected."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anjamorigan",
          "Nb_Reviews": 2,
          "Date": "2019-07-11T09:53:05.000Z",
          "Titre": "Other than purposefully killing us when…",
          "Contenu": "Other than purposefully killing us when we were shrunk on High Tinker Mekkatorque the raid went smoothly.  They did this to me twice because I was dumb enough to self rez before I realized what they were doing.  Better to tell someone to stand in something and die than to purposefully kill them.  Left a very bitter taste in my mouth for the raid overall."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Jay C",
          "Nb_Reviews": 7,
          "Date": "2018-11-10T17:40:26.000Z",
          "Titre": "Decent",
          "Contenu": "Original order had a waiting time of a week. A lot of hassle getting it changed to another service. Once the boost was underway it was good. Did the 8/10 mythic boost. 4 pieces of 340 gear for upgrades The 8 mythics took us just over 3hrs, including time taken to get from one to the next etc (I chose the self play option)Just a shame about the dicking about changing the order"
        },
        {
          "Note": 3,
          "Lieu": "RU",
          "Pseudo": "Pandaren",
          "Nb_Reviews": 1,
          "Date": "2019-12-02T10:34:43.000Z",
          "Titre": "I'm a bit disapointed",
          "Contenu": "So, I've ordered an M10 run in Timer. I've asked the customer support if they have any Loot Trader option available. They've told me that they trade all loot. So why am I upset? Well, I'm wearing mail armor. And nobody in my party was wearing mail. I wasn't lucky on the loot drops and at the end of the dungeon, the rogue gave me the leather item. That's it. M10 run in timer for 1 item that's not even my armor type.Other than that, everything went great."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Jay C",
          "Nb_Reviews": 7,
          "Date": "2018-11-25T20:52:06.000Z",
          "Titre": "Glory of Uldir achievement run",
          "Contenu": "Glory of Uldir achievement run Run completed in around 1hr 20m in a very efficient manner Sadly however - if gear upgrades you could use drop for the guys doing the boosting (that they clearly do not need but would be great for you!)  any attempts to ask for them to be traded go ignored. Not even acknowledged and politely declined. Completely ignored. Mention this to someone on wowvendors discord chat and get nonsense replies Shame"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Daida",
          "Nb_Reviews": 11,
          "Date": "2018-02-16T00:23:22.000Z",
          "Titre": "Once a great service provider.",
          "Contenu": "The services that they provide lately are spotty at best but they still accomplish your order eventually.It seems like they cant get their Sh!t straight anymore. Was rescheduled 3 times in one day 15 minutes apart .. If you pick a specific time they seem to feel it is not their obligation to fulfill said times.Why do you let people pick there own schedule if you are just going to change it."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Douglas Saunders",
          "Nb_Reviews": 8,
          "Date": "2020-11-06T05:41:54.000Z",
          "Titre": "The carry told me to stay dead and not…",
          "Contenu": "The carry told me to stay dead and not release for the last ~8.5 minutes. They finished the dungeon without me, I didn’t get to experience any of the last boss. Wasn’t very communicative at the end but finally after 2-3 tries and 6-7 minutes I made it to the chest and got my loot etc"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JENNIFER SHULTZ",
          "Nb_Reviews": 8,
          "Date": "2019-02-22T23:17:02.000Z",
          "Titre": "For future reference when someone…",
          "Contenu": "For future reference when someone orders a premium run that guarantees them 7 pieces of loot make sure you tell them personal loot counts towards that 7 pieces. Because I thought we were supposed to be traded everything from the boosters especially seeing how I spent close to a $1000 this month with you guys but yea no hard feelings."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "NEXTEXPAC",
          "Nb_Reviews": 2,
          "Date": "2020-08-19T11:19:45.000Z",
          "Titre": "Deals soon? Please...",
          "Contenu": "I like the effectiveness once I get the run, but the the price point per run is steep and I always seem to get a dungeon I don't need with other members in the team being different gear type than mine. Also, I bought a raid with paypal recently and it somehow also accidentally charged my girls card for a raid..... didn't want a complaint ruin my chance at runs in the future so didn't press it. I still haven't got any deals in my emails either. That all being said < they are really good at what they do once the action starts."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bob",
          "Nb_Reviews": 4,
          "Date": "2019-01-06T08:34:34.000Z",
          "Titre": "no attempt to heal",
          "Contenu": "There was absolutely no attempt to include the customer characters in the combat of raids. No cauldrons. No feasts. No healthstones. Absolutely no healing. I died in all but one boss fights and several times to AOE from trash. It was not very enjoyable to die 20 seconds into fights and watch. Spent over 750 gold in repairs."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lynn Wilson",
          "Nb_Reviews": 5,
          "Date": "2018-04-02T20:42:39.000Z",
          "Titre": "Wipes",
          "Contenu": "Two wipes on the dogs. Three wipes on Varimathras. Was not as smooth as my run earlier in the week. It was done by the same Guild oh no not again maybe they just weren't into it. I was excited because I bought the run for my fiancee and saw that it was the same guild that had such a smooth run before. Only to wipe repeatedly.."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Jamie Lott",
          "Nb_Reviews": 1,
          "Date": "2018-01-09T02:45:54.000Z",
          "Titre": "Poor Service - Updated",
          "Contenu": "Poor Service - In Accurate Website ReportingAfter Making Post was contacted by their rep, and provided with a time. Asked to change review, I have updated review and will do a further updated once all services paid for are provided.Was not impressed to pay for a service up front and have website state next raid was starting in 1 hour, only to speak with someone in Discord and be told we have to schedule you for the 10th at 2PM EST or the 12th 2PM EST. (I work 9 to 5 MST)"
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "French pen",
          "Nb_Reviews": 10,
          "Date": "2019-02-12T19:14:57.000Z",
          "Titre": "Great carries always",
          "Contenu": "Great carries as always, customer service was a kinda rude when I was trying to get the initial run started (bought the wrong carry but was “fixed” Minutes later.) a day after the scheduled time I got to get a carry. I Should remember next time to wait a minute to read over an order before purchasing again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Artiru",
          "Nb_Reviews": 23,
          "Date": "2018-03-12T02:26:50.000Z",
          "Titre": "I've had better",
          "Contenu": "I really like WowVendor but the last Heroic Argus was kind of weird. The fog cone was placed erratic. I do think they should lower the price about $10 since Argus is so easy and be competitive with other carry services. Also would be nice to have more US based raids to join in. The last few have been, I believe in Russia."
        },
        {
          "Note": 3,
          "Lieu": "BR",
          "Pseudo": "Gabriel Serra",
          "Nb_Reviews": 1,
          "Date": "2019-11-01T19:48:43.000Z",
          "Titre": "delayed and delayed",
          "Contenu": "Well, first purchase... delayed already. they said were gonna start soon, then i spent my time waiting and nothing. So I logout and they pmed me offline calling for the boost... I saw that only when I got back into the game and they delayed again to 7 days later lol first and only one purchase"
        },
        {
          "Note": 3,
          "Lieu": "NO",
          "Pseudo": "Daniel",
          "Nb_Reviews": 8,
          "Date": "2019-10-06T19:48:33.000Z",
          "Titre": "Quick and effective boost",
          "Contenu": "Quick and effective boost, but was a bit disappointed that there were no classes that matched my armor type for sharing items at the end.I'm positive they had characters to make this possible, but decided to log on mediocre geared characters instead.All in all good experience though."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Matt",
          "Nb_Reviews": 1,
          "Date": "2018-04-01T12:08:28.000Z",
          "Titre": "It was a good service, but...",
          "Contenu": "It was a good service. Guys were friendly enough and helped newbies get around the dungeon/instance.However it's quite expensive when compared to the fact that you can have a better geared and more experienced guild like the 'Honestly' Guild (one of the top guilds in the world), do it for 300K gold."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tater",
          "Nb_Reviews": 5,
          "Date": "2020-10-14T01:49:25.000Z",
          "Titre": "Poor Communication",
          "Contenu": "I know I wasn't \"contributing\" to the run but once I died I wasn't sure what to do.  Do I release and run back?  Do I get a rez?  Do I wait?   Once run starts there is no communication until its over.  Is it too much to ask for a little clarity?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "L Holmes",
          "Nb_Reviews": 1,
          "Date": "2018-01-14T14:11:52.000Z",
          "Titre": "Not enough bang for the buck,",
          "Contenu": "Everything was handled quickly and the run went well. I was a bit disappointed that all loot earned during the run was not given to me as 2 items dropped for others in the group that were not upgrades for them but were for me and I was told afterwards that they don’t trade personal loot items. This greatly reduced the bang for the buck for me. You need to spell that out in the details on your website. In the end the cost is too much for what I got from the run so I will probably not be a return customer."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MCT",
          "Nb_Reviews": 5,
          "Date": "2020-12-16T21:24:54.000Z",
          "Titre": "Beware Shadowlands Content",
          "Contenu": "Beware.  The wheels have come off with Shadowlands.  These guys used to be great but are not keeping up with Shadowlands demand.  If you want help with new stuff, I would strongly recommend waiting until they have had more time to get their act together."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sooner",
          "Nb_Reviews": 1,
          "Date": "2019-04-08T01:20:41.000Z",
          "Titre": "Completed run, won't trade loot",
          "Contenu": "Run was completed on time, however, loot that could have been traded to me was not. Dropped group immediately when I asked about the loot being traded to me, said: \"Sorry, can't trade\" and bounced.I had already inspected and loot was lower ilvl than what was equipped."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nikodog77",
          "Nb_Reviews": 30,
          "Date": "2018-09-17T16:01:42.000Z",
          "Titre": "Once again great communication and…",
          "Contenu": "Once again great communication and successful run.  Keep in mind you aren't guaranteed to get every piece of gear you want.  They will get you through the content and do a great job every time.  Highly recommend this service. Don't expect upgrades without paying extra for the gear."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Whisper",
          "Nb_Reviews": 17,
          "Date": "2018-05-08T23:48:43.000Z",
          "Titre": "Legion flying done,but don't touch/delete any active quests.",
          "Contenu": "Overall,they got the Legion flying achievement down perfectly. The only reason I gave it 3 stars,is because now my Cataclysm Legendary staff quest has been removed from the quest log along with it's (horrendously long)progress. Please don't mess with my quest log like that again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sossamon",
          "Nb_Reviews": 2,
          "Date": "2018-08-27T14:49:36.000Z",
          "Titre": "8/10 Mythic 0",
          "Contenu": "Placed an order for 8/10 Mythic 0 on 24AUG18 and it was started immediately via shared access.When 48 hours elapsed I contacted them on discord for an update and was informed it wasn’t completed, and they’re starting now.  On the 56 hour mark they completed the order.  Only communication with them was at the start, restart, and completion.  I initiated conversation for the restart. VPN was not used according to Authenticator logs, unless it’s a VPN set to Russia.However, they delivered the described service + 8 hours over the max estimated time."
        },
        {
          "Note": 3,
          "Lieu": "DK",
          "Pseudo": "Helene",
          "Nb_Reviews": 2,
          "Date": "2018-07-14T21:47:16.000Z",
          "Titre": "Silence on skype, but they got it done",
          "Contenu": "It was my first time using a boost, I messaged them on Skype expecting to get some kind of  info on how it was going to go, what they would do and so on, but they just asked for log in info, and then silence after that. Three hours later they said they were done. Would have liked a, “okay we’re in, and will get back to you when its done” just to know that everything was ok. The lack of info didn’t really help a skeptic first time user. Nonetheless they got it done, and Im happy about that, would just have liked a bit more info on what was going on."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 5,
          "Date": "2020-08-12T02:05:48.000Z",
          "Titre": "When I have the second last run of…",
          "Contenu": "When I have the second last run of leveling, I told my booster to kill bosses also, but he said in the next term, but somehow, I think he knows that as I become 120, he will not kill any bosses of freehold. In our last run, he said he would kill, but as I turn 120, he died and logoff and like vanish from the server only. That's how you treat your clients or buyer. It very disappointing that your booster didn't listen to me. I also said after 10th run can we kill bosses please but he is least interested in those. I have two more char to level up, and now I think if this is your service, should I take it or what?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "CustomerGuy",
          "Nb_Reviews": 3,
          "Date": "2020-11-02T09:08:20.000Z",
          "Titre": "Quick Run",
          "Contenu": "Was a quick, silent run. Wasn't sure what was going on, but it got done. Through no fault of the runner, I only got one piece of loot, but oh well. Lots of deaths because I had no idea what was happening and there was no communication."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tman",
          "Nb_Reviews": 8,
          "Date": "2020-05-24T06:59:12.000Z",
          "Titre": "Could improve somewhat",
          "Contenu": "Started about 15 minutes late.  Raid seemed a little thin at heroic had like 12-13 plus 6 customers.  Beginning went pretty smoothly around Ra-den lost some main folks composition changed.  Went down to 10 plus 6 customers had some wipes, then it looked like someone contacted someone and we had like 4 or 5 added to the main group as well as the 6 customers seemed to stabilize everything and finished the raid. Not terribly bad but probably could have gone smoother.  Previous raids was usually around 20 plus 5-6 customers much smoother than running with a significantly smaller raid.  Still seems to be the go to group in general."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "WoW Player",
          "Nb_Reviews": 1,
          "Date": "2018-08-13T10:43:31.000Z",
          "Titre": "Even a TINY bit of communication would…",
          "Contenu": "Even a TINY bit of communication would go a LONG way to changing that 3 Star Rating to a 5.I wasn't provided with any information about how the process was supposed to work (it did work, though) and my attempts to ask for information were not answered."
        },
        {
          "Note": 3,
          "Lieu": "AT",
          "Pseudo": "Peter",
          "Nb_Reviews": 27,
          "Date": "2021-12-07T14:45:39.000Z",
          "Titre": "Average!",
          "Contenu": "The group did neither resurrect nor wait for me in the middle of the dungeon. This means that I could not get through in fight! Only wait dead until the group finishes the dungeon is not enough!"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Friend",
          "Nb_Reviews": 4,
          "Date": "2017-08-27T23:20:53.000Z",
          "Titre": "Average at best",
          "Contenu": "Was given a start time which was not met. Got into the group 20minutes late and then had a further 15minutes of waiting for the rest of the boosters to join the group. Then had 3 wipes during the one boss. Not the best experience but got KJ down in the end."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "alliance player",
          "Nb_Reviews": 6,
          "Date": "2018-11-28T22:12:13.000Z",
          "Titre": "Dont expect trades",
          "Contenu": "Update: purchased a +10 again. It was with a different group than before. Had to go off spec. Unfortunately i was a bit off my game and pulled an extra pack or two. They handled it better than nasty pugs. HOWEVER, dont expect them to trade you loot from the dungeon chest that they get. The person looted a 395 from the chest and wouldnt trade it. So DO NOT expect any other loot but your own. The site is kind of decieving. Original; Purchased a M+10 run. I was hesitant at first. However the lead in the group did a great job of communicating and getting things running. Within about 10 minutes of paying, I was running the dungeon."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2021-08-05T19:47:37.000Z",
          "Titre": "Toolbars and hotkeys were changed",
          "Contenu": "The service was quick and efficient, however, my toon was returned to me with my toolbars changed and my hotkeys unbound. Pretty annoying for a service I pay for, you could at least switch things back."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "timothy melero",
          "Nb_Reviews": 5,
          "Date": "2020-05-03T06:25:57.000Z",
          "Titre": "Mostly good",
          "Contenu": "Have had good experiences in the past and will use again. However the people in my group this time were only ok. Completed the run in time but would not have been possible if I hadn’t actually been able to pull my own weight."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bob",
          "Nb_Reviews": 4,
          "Date": "2018-06-24T00:23:27.000Z",
          "Titre": "I have used your service several times",
          "Contenu": "I have used your service several times. Some of your teams try to heal the carries at least some but some teams prefer us to die as quickly as possible. It is a more enjoyable to participate some. I understand the problem of poor mechanics."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 5,
          "Date": "2018-02-07T14:42:32.000Z",
          "Titre": "THE RUN IS GOOD BUT LOOT RULES SUX,YOU …",
          "Contenu": "THE RUN IS GOOD BUT LOOT RULES SUX,YOU CANT ROLL WITH OTHER THEY RATHER DES ENCHANT IT, I BEEN TRYING OTHER SITE WITH CHINESE GROUP AT LEAST YOU CAN ROLL WITH OTHER OR TRADE. MY LAST TIME USING THE SITE.....I thought I was a best customer :("
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DENNIS POOLE",
          "Nb_Reviews": 5,
          "Date": "2023-12-13T14:24:05.000Z",
          "Titre": "Communication was Laking",
          "Contenu": "Communication was Laking. Overall team did a real good job."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Schlegel",
          "Nb_Reviews": 7,
          "Date": "2023-12-06T21:31:48.000Z",
          "Titre": "Hint for future customers",
          "Contenu": "If you go for a raid carry make sure you hit the boss at least once. When you die at boss, do not release. The teams are pros and know what they are doing. As for mystic+ dungeons, stay back as much as  you can. If the trash on the way to Boss , gets you it's unlikely you will catch up. The team moves fast."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T00:26:55.000Z",
          "Titre": "Simple yet time draining",
          "Contenu": "They almost always deliver with their runs. And they do offer discounts for any failures and hindrances. Overall it was very productive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "GK",
          "Nb_Reviews": 27,
          "Date": "2023-11-24T22:59:57.000Z",
          "Titre": "Almost perfect",
          "Contenu": "Almost perfect, just dropped a star because we ended up starting almost an hour late. The run itself was great though!! I get it, things happen. But it warrants 4 stars."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Kunde",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T22:45:21.000Z",
          "Titre": "Good",
          "Contenu": "Good AS Always, but -1 Star, invite after 30 mins, and more wipes than useually."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-10-18T15:33:52.000Z",
          "Titre": "The group did not bring enough people…",
          "Contenu": "I was not satisfied with a service I received. While their customer support team did reach out and explain in length that without purchasing a higher package, more players cannot be guaranteed to ensure more than 1 piece of loot drops per boss, they did apologize for the disappointment and offered me a free  +17 run, as a sign of good faith to a long term customer. I really appreciated this gesture. Would still like to see something change so runs with 1 loot drops per boss don't happen."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Baconmage",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T14:24:53.000Z",
          "Titre": "Everything was done that was ordered, but took a while",
          "Contenu": "Everything was done that was ordered. But had to wait for a couple hours between the 8th and 9th boss for some reason. That wasn’t clear or expected so I had to stay in game much longer than I though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 102,
          "Date": "2023-09-16T19:27:15.000Z",
          "Titre": "Heroic Aberrus run",
          "Contenu": "I've been thru several of these heroic runs with WowVendor without issue, but after the 3rd wipe on the 2nd boss, I said something in Discord. In about a minute the raid was filled with new players and everything from that point on was perfect."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Direstraitz",
          "Nb_Reviews": 38,
          "Date": "2023-01-08T21:32:15.000Z",
          "Titre": "Only reason I am not giving this review…",
          "Contenu": "Only reason I am not giving this review a perfect rating is due to a coordination mix-up. Picked the weekly activities bundle and got invited to raid at the right time but had just started a run with the M+ boosters. The team other wise was just as fantastic as ever. Rescheduled raid and M+ timed and loot shared even after a (personal-my fault) mishap that caused a bad handoff."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Observer",
          "Nb_Reviews": 7,
          "Date": "2023-01-09T03:52:36.000Z",
          "Titre": "Mythic plus yeah raids meg",
          "Contenu": "The runners and customer service are always great. Some groups more friendly than others. The mythic plus service is wonderful and you end up with a good amount of loot. The raid services leave more to be desired on the basic package due to the extremely low loot squires. Ran 8 mythics got 7 pieces of gear ran normal and heroic raid got 1 so something to think about for everyone who is looking to get loot quickly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "J.R.",
          "Nb_Reviews": 23,
          "Date": "2022-12-20T15:00:39.000Z",
          "Titre": "It was good, but communication isn't great",
          "Contenu": "It was good, but not as great as it's been in the past. Communication has really fallen through and I had to keep contacting back to get information. They complete the first part of my single order and then after 4 days of nothing, I had to contact and ask what was up, when I could get in, for them to squeeze the rest of that single order in before reset. Which then the time got changed again before we went, but we got it done."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Alemany",
          "Nb_Reviews": 3,
          "Date": "2023-05-20T23:52:23.000Z",
          "Titre": "Fun and professional, but I have my thoughts",
          "Contenu": "This people are amazing and beyond professional. I'm giving 4 stars because in Aberrus the Shadowed Crucible, at least in Normal mode, you won't expect a raid group of 8 groups of people, which makes your loot options extremely lower than expected. Only in the last boss they kindly ask 2 groups to teleport out and make the fight with lesser amount of people. After beating it, those people leave and the remaining groups teleport back inside. So only on that last fight you'll get a decent loot option. They never said that in their website and that's a bit letdown."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Tau",
          "Nb_Reviews": 33,
          "Date": "2023-09-07T19:18:11.000Z",
          "Titre": "Dawn of the Infinite Mythic Run",
          "Contenu": "Dawn of the Infinite Mythic RunThe support team on discord was exceptional. They helped me editing a previous order and changing to the DotI Dungeon Boost without hesitation. 10/10!The boost team was good, though for the first time in a long long time that I’m using this service, they had to postpone more than once my run.I had time scheduling issues due to work and I suggested more than one time slot. In the beginning was supposed to be Friday evening, then Sunday. On Sunday it was moved to Monday, eventually we made it on Tuesday night. I am super comprehensive because they must have a ton of work too boosting all the customers, but all this time and date changing bugged me a little.Still great boost though!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T10:59:18.000Z",
          "Titre": "Great team",
          "Contenu": "They take a little time to get things together and the communication could be better but they do a FANTASTIC job within the game. Incredibly outstanding team. Third day of crota and they downed him first try!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Roxy_WoW",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T07:48:07.000Z",
          "Titre": "First time buyer",
          "Contenu": "First time buyer - I'm not a bot.Initial thought I was very very skeptical! As we all should be with so many boosts sites out there. I'm here to say that my wowvendor experience was great and very smooth process. FAST 24/7 customer service. They are very punctual and efficient with their service. I also love how they are very flexible to accommodate me with a last minute change on my schedule. 4/5 stars ez ggz!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T16:09:18.000Z",
          "Titre": "A little Faster Next Time!!! LoL",
          "Contenu": "Ordered the service on Sep 24th and paid for express completion. Didn’t get started until I sent a message on Discord on Oct 8th, and didn’t get completed until the 9th."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Emily Roulet",
          "Nb_Reviews": 3,
          "Date": "2023-01-20T18:02:16.000Z",
          "Titre": "I purchased a Heroic Raszageth carry…",
          "Contenu": "I purchased a Heroic Raszageth carry for my husband and I on our alts. Overall experience was okay, carriers were no world class raiders by any means but they got it done. Just for anyone looking to purchase this service in the future, this boost took a little over an hour to complete with 6 pulls total."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Krongitis",
          "Nb_Reviews": 4,
          "Date": "2023-11-02T17:43:49.000Z",
          "Titre": "Really good deal",
          "Contenu": "Really good deal, ran lost sectors until they got the arms I wanted along with a few others. Definitely a bargain"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 16,
          "Date": "2023-04-03T14:40:26.000Z",
          "Titre": "The Best Video Game Service!",
          "Contenu": "It may have taken them awhile to complete my order, but when they eventually got to it, they did a great job. I wouldn’t trust anybody else but then to get what I ask then to do done. If you aren’t comfortable sharing your account information, that’s understandable but I’ve done it every time and I’ve gotten my account back every time without any changes or purchases."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 16,
          "Date": "2023-05-16T14:29:58.000Z",
          "Titre": "Master VoD",
          "Contenu": "I got the Master VoD boost since I was feeling particularly lazy that weekend, but these guys never slack off. They always get your order done even if it takes them down to the last couple of seconds before reset. Wowvendor are the only people that I can trust that my money isn’t going to waste."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 15,
          "Date": "2023-08-11T18:52:17.000Z",
          "Titre": "The group was fantastic, ad is not right...",
          "Contenu": "The group was fantastic! My only complaint is that the marketing for the run says 50x Aspect's Shadowflame Crest Fragments, which is why I did the run to upgrade gear. Only 40 dropped. That last 10 would have upgraded another piece of gear, so I feel a bit mislead..."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Steven Adams",
          "Nb_Reviews": 1,
          "Date": "2023-01-19T12:17:50.000Z",
          "Titre": "But why no Destiny 2 reviews",
          "Contenu": "Seems like a productive service, however I’m considering using these guys on a certain night fall week I want a certain adapt weapon. Scrolling through there reviews all reviews are wow related & mythic raids. There’s not 1 single reviews towards destiny 2! Concerning.."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JuJuCho",
          "Nb_Reviews": 3,
          "Date": "2023-07-08T15:51:55.000Z",
          "Titre": "Great company with Fast Runs",
          "Contenu": "Great company. Always great runs with very little issues. Only problem lately, runs are not starting on time because you are waiting for other purchases that did not show up on time which is inconvenient"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ShadwLord",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T09:23:00.000Z",
          "Titre": "First time caller — would use again in future! :D",
          "Contenu": "This was my first time using their services. Based on previous reviewes, they seem like a great service. The team is really helpful (when available). While communication was pretty open whenever I asked for an update, I did a suggestion/thought. More details in updates would be helpful (ex. when you pay for 5-in-1, let the person know which Raid you’re working on). As well as letting them know when services are starting/continuing. Other than those, I was really happy with their service!"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Loek",
          "Nb_Reviews": 2,
          "Date": "2023-04-12T14:30:59.000Z",
          "Titre": "Very good and easygoing people.",
          "Contenu": "Very good and easygoing people. They were willing to work around my work hours and even got some of the challenges done within the raid. The only thing that was somewhat inconvient were the swapping charaters and somewhat long waiting times before actually starting a boss encounter. Overall I am very satisfied and will be sure to put in another order."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jessica Janson",
          "Nb_Reviews": 1,
          "Date": "2023-04-02T16:56:11.000Z",
          "Titre": "Fast and quality product",
          "Contenu": "Players are obviously elite. Fast delivery. I definitely got what I payed for. I only wish there was a little more communication in chat to briefly explain strategy for those of us who want to participate and learn. However, I have never had a negative experience and will purchase again in the future."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T09:06:17.000Z",
          "Titre": "Fine run",
          "Contenu": "Fine run. Need to get healers who know their rotation. Wiped 4 times on sark due to a lack of throughput from the healers not playing their classes correctly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Fellow WoW Lover with not enou",
          "Nb_Reviews": 3,
          "Date": "2023-12-01T18:07:04.000Z",
          "Titre": "Timely and friendly response",
          "Contenu": "Timely and friendly response. Great support"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T03:25:29.000Z",
          "Titre": "I did enjoy how fast heroic bosses went…",
          "Contenu": "I did enjoy how fast heroic bosses went down even if the last one did take multiple attempts, the lack of loot on heroic was interesting as it was mostly plate wearers so that was hard to get some. The normal run was really good and smooth and the loot was much better shockingly so it was a good experience although normal felt really clustered with the amount of people"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "GharethF",
          "Nb_Reviews": 4,
          "Date": "2023-05-19T12:45:22.000Z",
          "Titre": "Delivered what was promised",
          "Contenu": "Delivered what was promised as always but nothing more. Some, any communication would have been nice. Will still re-book because the end result is still delivered every time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jenn",
          "Nb_Reviews": 1,
          "Date": "2023-09-17T21:57:45.000Z",
          "Titre": "My interactions with the customer…",
          "Contenu": "My interactions with the customer service via Discord & chat were positive & informative. The booster was very quick & efficient in providing the service. I’d give a 5-star review if I’d received a confirmation email for the order. Great experience, will use again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Direstraitz",
          "Nb_Reviews": 38,
          "Date": "2023-03-21T21:38:44.000Z",
          "Titre": "A bit of a rough run",
          "Contenu": "Service completed and with several not repeated for good IO. Boosters struggled a bit but were very helpful. Wiped twice in one instance and didn't time one. But boosters made good by timing an extra run. It was fortunate I had time to complete.. though if I had not had the time, from past experience I am confident Wowvendor would have made it right."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "D.B.",
          "Nb_Reviews": 1,
          "Date": "2023-02-17T00:14:40.000Z",
          "Titre": "Very good service",
          "Contenu": "Very good service. Good payment options, not only credit card but also PayPal for people who do not have a credit card.Fast service, immediately after the purchase you will be informed of all upcoming steps both by email and by Discord.The contact persons are all very friendly and happy to explain individual steps. What I find a pity is that the time is limited to midnight even on weekends. I can understand that during the week, but many would certainly like to use the service longer than midnight. It would also be great if this was communicated in advance. But otherwise very competent people who have high standards themselves. Would like to use the service again."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T00:15:41.000Z",
          "Titre": "Easy transaction",
          "Contenu": "Easy transaction - Fast delivery. Did need to be up in the middle of the night to allow access but that serves me right for living on the other side of the world."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "August",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T21:14:13.000Z",
          "Titre": "Pretty good overall!",
          "Contenu": "I‘ve used the service several times for destiny 2, the support are very polite and helpful my only comment is occasionally added items such as secret chests and buying weapons at the end of raids are forgotten. If you catch it they are polite enough about it and fix it in a timely manner"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Ciel",
          "Nb_Reviews": 4,
          "Date": "2023-05-01T12:54:49.000Z",
          "Titre": "A mini-text with the invite would have…",
          "Contenu": "A mini-text with the invite would have been nice, just to let me know I was in the right group ;) Otherwise, everything went fine. Very fast kill, no hassle - and they even let you join, if you like (and don't do dumb stuff). ;)(I was waiting in the discord channel for said message as well, as I seem to remember it having been pointed out on the website that I should do so? Thus my confusion. ;) But thx for letting me know about the no-ingame-policy of messages at all. Thought „we’ll start now, hop in“ messages were unproblematic. No problem.)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Observer",
          "Nb_Reviews": 7,
          "Date": "2023-09-11T03:33:08.000Z",
          "Titre": "Good runs read more into deals",
          "Contenu": "Runs were smooth and the mythic plus was awesome ordered the extra rim the mega dungeon and thought it would be a loot funnel too but everyone they ran it was loot locked and wish that had been explained in the bundle outside of that was a good run"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-10-28T12:43:19.000Z",
          "Titre": "Suggestion",
          "Contenu": "Suggestion: Don't close out raid till all rolls are finished and items are received.. Thank you for you service.Squeeky"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-05-19T18:46:19.000Z",
          "Titre": "Support was kind and courteous and the…",
          "Contenu": "Support was kind and courteous and the run went well. Did fall outside the 36-hour mark and there weren't live comms but beyond that, it was a great experience. Highly recommend the service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JL",
          "Nb_Reviews": 3,
          "Date": "2023-01-28T15:01:11.000Z",
          "Titre": "For some reason the run started without…",
          "Contenu": "For some reason the run started without me and I missed the first boss. Was able to reschedule that kill the next day with no issues. The run itself was smooth. No issues other than the minor one."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kaneahi",
          "Nb_Reviews": 4,
          "Date": "2023-07-17T23:57:54.000Z",
          "Titre": "Runs were smooth",
          "Contenu": "Runs were smooth, as always. Only complaint was the hour wait in between runs to get it completed. It hasn’t happened before or since so I am under the impression it won’t happen again."
        },
        {
          "Note": 4,
          "Lieu": "NO",
          "Pseudo": "PH",
          "Nb_Reviews": 31,
          "Date": "2023-01-04T16:10:48.000Z",
          "Titre": "Correctly delivered",
          "Contenu": "Correctly delivered. Giving them 4 stars as they have some way to go to blazing boost, which sadly doesn't boost wow anymore.Was contacted by booster in wow, should have done it via Discord?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Basileia",
          "Nb_Reviews": 8,
          "Date": "2023-06-04T00:42:03.000Z",
          "Titre": "Heroic group was outstanding",
          "Contenu": "Heroic group was outstanding, as usual. :D 5 stars!The normal group i ran with today and last weekend didn't seem as organized. The group was slow paced and clumsy along with a wipe from trying to solo heal a 20 + person raid. D: 3 stars"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T11:53:40.000Z",
          "Titre": "Wanted to learn but…",
          "Contenu": "I was hoping I would be taught the mechanics of the raid, that's why I went with the sherpa version. Unfortunately that didn't happen and we just sped through it. But I'm super happy to have it done so overall 4 stars"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T04:06:29.000Z",
          "Titre": "Was a great experience was done in GM nightfall",
          "Contenu": "Was a great experience was done in a promt manner. Thought it would take a while since it was a difficult request but was done on the first try for the Grandmaster Nightfall"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "NotABot WoWplayer",
          "Nb_Reviews": 1,
          "Date": "2022-11-26T16:30:20.000Z",
          "Titre": "Actually came through on-time and delivered exactly what I ordered.",
          "Contenu": "Like many of you here reading these reviews before making a purchase I was definitely a skeptical person. Ultimately because they accept PayPal I figured what the heck ill give it a shot because I could always fight it with PayPal if it turned out to be a scam. Shortly after making my purchase I was contacted to set up a line of communication. I was told the raid schedule and to confirm whether the times would work. I accepted the first times I was given, my raid started on time. Of the raids I took part in there were a few wipes but they were able to pull through it all and complete everything I had purchased. All in all it was still pretty quick and I'm very happy with the service, definitely worth the price with the Black Friday discount."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2023-05-21T10:07:55.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service. Best run I've had so far. They messaged me almost 30 minutes in advanced and was way better compared to other runs!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Zac W Shortt",
          "Nb_Reviews": 3,
          "Date": "2023-02-25T18:57:24.000Z",
          "Titre": "Run was fairly smooth and they let you…",
          "Contenu": "Run was fairly smooth and they let you participate in every fight, just that the raid was so loot locked that only one piece of loot dropped from most bosses."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 16,
          "Date": "2023-04-18T15:20:18.000Z",
          "Titre": "Fastest flawless I’ve ever seen!",
          "Contenu": "When I asked for them to do a flawless trials, they told me I was under power level. However the booster decided to do it anyways and got me my flawless in under an hour. To whoever my booster was I thank very much!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T07:44:43.000Z",
          "Titre": "Good job",
          "Contenu": "Didn’t receive a message about setting up a specific time. Just got a random message asking if I was ready. Otherwise good and quick experience"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Marcel schumacher",
          "Nb_Reviews": 3,
          "Date": "2023-08-08T07:51:45.000Z",
          "Titre": "Delivered After 2 Hours",
          "Contenu": "Delivered After 2 Hours , was good , Just the Support only told me he dont Know between 1-24 Hours for deliveri."
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "customer",
          "Nb_Reviews": 9,
          "Date": "2023-06-30T16:58:14.000Z",
          "Titre": "My booster team did not even done a 20…",
          "Contenu": "My booster team did not even done a 20 for that dungeon, or even completed a 20 run. The run was terrible compared to all runs I bought Previously"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charles",
          "Nb_Reviews": 6,
          "Date": "2023-07-31T22:12:52.000Z",
          "Titre": "Great and quick",
          "Contenu": "First off, I paid for the service on Sunday, and the booster started Monday 7AM, finished Monday 1PM (1800 boost). WOW! Fast. He got me to 1846, BTW. The only reason it's 4 stars and not 5, is he didn't upgrade the gear, like I asked. Anyway, hope I can get to it soon."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Observer",
          "Nb_Reviews": 7,
          "Date": "2022-12-31T06:52:04.000Z",
          "Titre": "Run was good and the team was friendly",
          "Contenu": "Run was good and the team was friendly. Sadly for the raids right now all the runners were locked and that lead to 2 bosses not dropping any loot so that was rough."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephen LaMotte",
          "Nb_Reviews": 139,
          "Date": "2023-11-28T01:45:16.000Z",
          "Titre": "Survived half the bosses",
          "Contenu": "Got two items of no use, hope vault is helpful"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-09-18T11:15:42.000Z",
          "Titre": "Run was successful",
          "Contenu": "Run was successful, I had wished for some instructions as to where to stand, what was to come. Thank you for your service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-21T13:20:21.000Z",
          "Titre": "they are a decaberrusent group  the only  draw…",
          "Contenu": "they are a decent group  the only  draw back is when  you try to  get  answers  it takes awhile to answer sometimes"
        },
        {
          "Note": 4,
          "Lieu": "NO",
          "Pseudo": "angel",
          "Nb_Reviews": 2,
          "Date": "2023-03-31T17:10:24.000Z",
          "Titre": "clear communication leads the way.",
          "Contenu": "ran into some trouble through some destiny services but i was treated as a valuable customer and got things settled eventually."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rey",
          "Nb_Reviews": 16,
          "Date": "2023-05-31T05:15:07.000Z",
          "Titre": "+16 Vortex Pinnacle",
          "Contenu": "I am so happy that the WowVendor team always completes the mythics within the timer, even though I buy the no timer.   They always give me the loot in the end and always ask me if I need any of the drops.  Thank you WowVendor team!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 16,
          "Date": "2023-08-29T03:36:18.000Z",
          "Titre": "Love you Wowvendor!",
          "Contenu": "Imma keep this one short because there’s not much more I can say about them that I haven’t already said. There a great service and get things done fast and cheap."
        },
        {
          "Note": 4,
          "Lieu": "NO",
          "Pseudo": "PH",
          "Nb_Reviews": 31,
          "Date": "2023-02-09T09:26:12.000Z",
          "Titre": "They deliver as expected",
          "Contenu": "They deliver as expected, quickly and efficiently.However, I had hoped for something other than the same race, which they always run on unspecified"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Katherine",
          "Nb_Reviews": 1,
          "Date": "2022-11-24T00:49:17.000Z",
          "Titre": "Completed Successful Run After Initially Cancelled",
          "Contenu": "I signed up for a Heroic Jailer run to obtain the AOTC mount before Dragonflight launch. When I hadn't received a party invitation more than 20 minutes after the run was supposed to start, I contacted customer service to ask if there'd been a delay. I was told to run had been canceled and the agent offered to reschedule. I declined and they instead offered either a refund or a credit with with an additional coupon for my troubles. The agent was very kind and understanding. I took the credit and used it towards another run the next evening. I received my party invite on time and the run was successfully completed. There was not any communication or instruction from the group, so it was a bit disorienting, but I was able to tag the boss and get the achievement and mount that I needed. Overall, I'd say the order was filled successfully and I would use this service again in the future."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jbone",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T00:15:24.000Z",
          "Titre": "They finished really fast",
          "Contenu": "They finished really fast.  I do wish they would change all the settings (key bindings, etc) when they are finished.  Overall very good service."
        },
        {
          "Note": 4,
          "Lieu": "AT",
          "Pseudo": "MX",
          "Nb_Reviews": 1,
          "Date": "2023-01-14T01:40:58.000Z",
          "Titre": "Long Delay due to Holidays but Solid Customer Service Afterwards",
          "Contenu": "Solid and professional boosters, running a holiday discount and then have me wait for more than 2 weeks reduced the experience down to 4 stars"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Milkshake",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T22:32:16.000Z",
          "Titre": "I received my gold within 24 hours",
          "Contenu": "I received my gold within 24 hours. I wish it had been within just an hour but I am still happy with my purchase."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rawproph",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T12:30:16.000Z",
          "Titre": "It took 3 hours and there was no…",
          "Contenu": "It took 3 hours and there was no communication except by whispers.  And i clutched some wins for us too."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customermike",
          "Nb_Reviews": 5,
          "Date": "2023-03-01T03:25:00.000Z",
          "Titre": "Great teams with traders",
          "Contenu": "Great teams with traders. I only wish with the bundle packages they didn't repeat the same instances.quick response. Overall 4 stars"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-04-11T16:41:15.000Z",
          "Titre": "Excellent as usual",
          "Contenu": "Good fast run. My only problem was on Raz, raid lead said \"DPT for 1 min then jump off or I will kick you\". Thought it was a little harsh. He could have said something like please jump off platform after hitting the boss."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "punahou",
          "Nb_Reviews": 4,
          "Date": "2023-05-18T17:34:31.000Z",
          "Titre": "great intetaction",
          "Contenu": "great intetactionthey took me a day early and gpt me my aberrus aptc.only drawback is i didnt get 1 drop"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "codeplay",
          "Nb_Reviews": 2,
          "Date": "2023-05-01T03:28:16.000Z",
          "Titre": "Reliable and affordable",
          "Contenu": "Been using wowvendor a few times now. The customer service is helpful and fast responding, and the service itself is reliable and affordable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jean",
          "Nb_Reviews": 8,
          "Date": "2023-02-23T21:45:49.000Z",
          "Titre": "WoWVendor came through",
          "Contenu": "WoWVendor came through.  There were some internet issues that messed up the fun a bit - but they made it right and really showed me great service."
        },
        {
          "Note": 4,
          "Lieu": "KR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-02T20:50:55.000Z",
          "Titre": "Application for your service",
          "Contenu": "I'd like to thank booster Chaika_In_Paanic#1282. They were very respectful and helpful. All of the boosters w were great."
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "customer",
          "Nb_Reviews": 5,
          "Date": "2022-11-22T18:50:19.000Z",
          "Titre": "Was great",
          "Contenu": "Was great, just sucked that it happened an hour late...would defs use service again where I need some help 👌🏻"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 9,
          "Date": "2023-05-19T13:37:32.000Z",
          "Titre": "Get in early",
          "Contenu": "Got it done and done fast, but everyone was on loot lockout so good luck getting a drop"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Callum",
          "Nb_Reviews": 5,
          "Date": "2022-11-23T23:04:08.000Z",
          "Titre": "Delivered result as promised",
          "Contenu": "Delivered result as promised Few bonus wipes thrown in - randomly invited people at the end was a bit odd"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "James R Harper",
          "Nb_Reviews": 2,
          "Date": "2023-03-05T11:18:13.000Z",
          "Titre": "Communication and arrangement well…",
          "Contenu": "Communication and arrangement well planned out. Leveling process was as fast as advertised. Only complaint is that the streaming service was not completely reliable."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 24,
          "Date": "2023-03-21T17:28:03.000Z",
          "Titre": "Work Well done but communication was…",
          "Contenu": "Work Well done but communication was not that good how it was in the past!!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Miller",
          "Nb_Reviews": 8,
          "Date": "2023-05-02T17:07:38.000Z",
          "Titre": "all was fine",
          "Contenu": "all was fine, i got well boosted in 2v2 piloted, but i waited for it too long time. order made slow but well. good company i think"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Anoniem",
          "Nb_Reviews": 6,
          "Date": "2023-07-10T10:29:45.000Z",
          "Titre": "Great contact",
          "Contenu": "Great contact!  Updates on statusA bit expensive tho but hey! Everything is"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T08:38:10.000Z",
          "Titre": "Loved the 24h support always had an…",
          "Contenu": "Loved the 24h support always had an answer when I was looking."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer mango",
          "Nb_Reviews": 2,
          "Date": "2023-05-23T18:31:11.000Z",
          "Titre": "Aside from communication taking a while…",
          "Contenu": "Aside from communication taking a while the boosters do get the job done very satisfied."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Anrumn",
          "Nb_Reviews": 1,
          "Date": "2023-03-12T11:59:07.000Z",
          "Titre": "I think you need just more…",
          "Contenu": "I think you need just more communication. But  everything else was fine."
        },
        {
          "Note": 4,
          "Lieu": "LV",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T18:28:43.000Z",
          "Titre": "Everything was on time",
          "Contenu": "Everything was on time, and done super fast. Experienced team helped with everything. Great Job Guys :)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JuJuCho",
          "Nb_Reviews": 3,
          "Date": "2023-12-03T19:55:42.000Z",
          "Titre": "Good Run overall",
          "Contenu": "Good Run overall. Professional"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 8,
          "Date": "2023-09-11T23:03:10.000Z",
          "Titre": "Quick and reliable service",
          "Contenu": "Quick and reliable service. Will use again"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Smitty",
          "Nb_Reviews": 2,
          "Date": "2023-01-25T16:45:58.000Z",
          "Titre": "Great tour through mythic",
          "Contenu": "Great tour through mythic. Took sometime to be able get the service after paying. WoWvendor is great"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Boo",
          "Nb_Reviews": 6,
          "Date": "2022-10-25T06:04:51.000Z",
          "Titre": "Run was okay, but delayed",
          "Contenu": "Run was okay, but the lack of communication was frustrating. As a first time user and the raid randomly delayed for over 60minutes with no communication until I talked to someone through support on the website. When you pay for a service and it is late it appears that it will not occur or you are not getting your money worth."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Deli",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T15:26:16.000Z",
          "Titre": "Top tier ..very smooth run 8/8 on boss…",
          "Contenu": "Top tier ..very smooth run 8/8 on boss kills..only issue we were all kick before looting last boss ..and didn’t get a chance on the roll"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-10-29T14:52:49.000Z",
          "Titre": "People please read",
          "Contenu": "Yes they came through with what they were giving out which I am thankful for but I don’t get all these other Addons for certain things like light level having to be 1580 otherwise you have to pay an extra £15 and extra just to watch them play"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jon",
          "Nb_Reviews": 3,
          "Date": "2023-09-05T20:02:43.000Z",
          "Titre": "Wish it was a lil cheaper",
          "Contenu": "Nice and fast service but wish it was a lil cheaper.  Still glad you guys are around."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wayne S",
          "Nb_Reviews": 2,
          "Date": "2022-10-21T23:16:27.000Z",
          "Titre": "The raid started later than scheduled",
          "Contenu": "The raid started later than scheduled. It is always a little unclear how to join the raid. This time I asked to be invited rather than being invited. Communication during the raid was minimal. I would have loved to trade one of the two pieces of gear I did receive, but didn't need, for the leather wrists that I did need. At least I figured out how to gift one of my pieces to another one of the \"carries\" who needed it. But I accomplished my objective of downing Fated Heroic Lords!"
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-26T03:00:10.000Z",
          "Titre": "very professional when making the boost…",
          "Contenu": "very professional when making the boost 5/5, the only drawback was the delay, otherwise perfect."
        },
        {
          "Note": 4,
          "Lieu": "QA",
          "Pseudo": "Nasser",
          "Nb_Reviews": 2,
          "Date": "2023-06-25T17:16:36.000Z",
          "Titre": "fast respond as awalys",
          "Contenu": "fast respond as awalys good answersalso more safe service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T21:56:50.000Z",
          "Titre": "No issues",
          "Contenu": "No issues, not super fast so 4/5!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T15:43:38.000Z",
          "Titre": "It was pretty quick",
          "Contenu": "It was pretty quick, the group was good. Quick rez and summons for those that fall behind."
        },
        {
          "Note": 4,
          "Lieu": "NO",
          "Pseudo": "bustrr",
          "Nb_Reviews": 3,
          "Date": "2022-10-28T15:07:01.000Z",
          "Titre": "These guys got my mythic raid done in…",
          "Contenu": "These guys got my mythic raid done in one shot. Raid was Monday and reset was Wednesday so they had 2 days to complete. Items were in inventory with mount and all tokens! Super job again"
        },
        {
          "Note": 4,
          "Lieu": "RE",
          "Pseudo": "goodguys",
          "Nb_Reviews": 3,
          "Date": "2023-11-13T14:35:26.000Z",
          "Titre": "Verry fast and good support"
        },
        {
          "Note": 4,
          "Lieu": "JM",
          "Pseudo": "customer",
          "Nb_Reviews": 7,
          "Date": "2023-09-05T02:55:23.000Z",
          "Titre": "Stellar customer service",
          "Contenu": "The responsiveness of the customer service is stellar, great job as always"
        },
        {
          "Note": 4,
          "Lieu": "PR",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2022-10-05T06:28:22.000Z",
          "Titre": "I was skeptical at first since this is…",
          "Contenu": "I was skeptical at first since this is my first time using this kind of sites as well as the time to do the run was been moved up, but once it started everything move along without any issues. Got the Item I was seeking.I would recommend better communication before the service requested starts."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brad",
          "Nb_Reviews": 1,
          "Date": "2022-10-27T06:32:27.000Z",
          "Titre": "Really good communication from the…",
          "Contenu": "Really good communication from the support team. Got what I wanted. Only thing that disappointed me was forgetting a small request, but besides that very nice and would use again."
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Chris V.",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T00:14:18.000Z",
          "Titre": "Fast and professional",
          "Contenu": "Did the last two bosses of Amirdrassil HC and everything went as expected. The group was fast and efficient, and the customer service was friendly and helpful. I will definitely be using them again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff Kirkendoll",
          "Nb_Reviews": 11,
          "Date": "2023-12-20T17:27:19.000Z",
          "Titre": "Allowed to be an active member",
          "Contenu": "I enjoy the run because I was an active member of a very good team.  I will be using WowVendor weekly because its a sure fire way to get the keys you want completed and not have toxic, rage quitters to ruin a key."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George Biles",
          "Nb_Reviews": 11,
          "Date": "2023-12-17T02:21:02.000Z",
          "Titre": "Awesome experience",
          "Contenu": "Awesome experience! Had some difficulty getting the PSN password to work, but these folks made it work, and about 15 mins later they messaged me saying order complete. I will definitely be using these great game boosters again. Also, the people you talk to who relay the info to the boosters are very nice and helpful!!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Unholy Squirrel",
          "Nb_Reviews": 5,
          "Date": "2023-12-17T22:59:57.000Z",
          "Titre": "Heres a 5 star rating!",
          "Contenu": "Thanks for another great service!!! I am always so happy using your services! I been using wowvendor for some time now and I haven't had any issues at all. They have always been super friendly compared to other sites that I used in the past and the teams they have are really good at being punctual aswell."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alliance Warrior",
          "Nb_Reviews": 20,
          "Date": "2023-12-18T19:48:06.000Z",
          "Titre": "Heroic Amirdrassil",
          "Contenu": "Holidays ruined my raiding schedule.  Jumped into one of their heroic runs and we were done within 1 hr and a half!  Team did very well and super polite.  Would recommend WoW vendor for anything!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Joe Annon",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T03:23:29.000Z",
          "Titre": "HIGHLY RECOMMENDED",
          "Contenu": "At first, I was a little apprehensive about using a carry service, however; after purchasing a couple of M+ runs, a NM and HM raid through WowVendor, I have nothing but good things to report.Making the purchase was easy and shortly after, I received an in-game invite.The players were obviously very skilled and it quickly became clear that this was not just about a higher item level.During one of the M+ runs, anxiety got the better of me and I ended up making a ton of mistakes, however; they still managed to drag me to victory as promised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "HORDE",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T13:25:23.000Z",
          "Titre": "Reliable. Consistent. Friendly.",
          "Contenu": "I use them for a ton of different services and have for years. I used one other site one time and it was a disaster. I won't ever stray away from WowVendor again. They communicate quickly and clearly. And the rare times they've made a mistake they quickly offered me discounts or free services to make up for any inconveniences I may have experienced. Will continue to be a frequent customer!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sargee",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T02:17:46.000Z",
          "Titre": "The only place I TRUST to buy from",
          "Contenu": "Honest - Fast - Trustworthy! that is what you get with WowVendor.com I have purchased gold for Hardcore Wow multiple times now and every time I do I get the same amazing quality service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alliance Warrior",
          "Nb_Reviews": 20,
          "Date": "2023-12-18T19:44:06.000Z",
          "Titre": "Mythic Plus Runs",
          "Contenu": "Left stuck with the holidays and limited time I tried Wow Vendor for some quick Mythic plus runs.  They didn't disappoint.  Ran four 20's in about 1 hr and 15 mins and two chested if not 3 chested all of them.  Group was super cool and knew all the fights and trash.  Would highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen LaMotte",
          "Nb_Reviews": 139,
          "Date": "2023-12-20T00:00:24.000Z",
          "Titre": "Raid ilvl up 16 lvls",
          "Contenu": "Ilvl 439 => 459, replaced a 383 lvl neck with 476 lvl, plus 2 other pieces improved from the 437 to 460+ lvl made this huge improvement in armor and stamina."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T09:36:58.000Z",
          "Titre": "There was a problem with my original…",
          "Contenu": "There was a problem with my original time. I was given multiple options to swap  to a different time. They definitely made it right. Great to work with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Darius Spencer",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T07:09:20.000Z",
          "Titre": "They are very flexible with your time…",
          "Contenu": "They are very flexible with your time slot. If you signed up for a certain and can't make it anymore they will reschedule at no additional cost, they understand life happens."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Impressed",
          "Nb_Reviews": 32,
          "Date": "2023-12-21T02:22:05.000Z",
          "Titre": "Fantastic 4 Runs",
          "Contenu": "Fantastic 4 Runs. Team was as solid as any, routes were efficient, and the times were all under the limit."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Catnip Enthusiast",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T21:32:59.000Z",
          "Titre": "Quick and Efficient!",
          "Contenu": "My order was started and completed quickly after ordering, the whole experience from start to finish was smooth and efficient. Would order from them again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Windalyn C",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T17:20:45.000Z",
          "Titre": "Really Great!",
          "Contenu": "My boosters went out of their way to make sure I was able to complete my order. They were also patient and kind. Much appreciated!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen LaMotte",
          "Nb_Reviews": 139,
          "Date": "2023-12-21T09:05:30.000Z",
          "Titre": "ilvl 443 => 452 without vault add",
          "Contenu": "Survived one boss, wiped once and improved my overall ilvl to 452 and will get vault next week."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-12-21T16:19:12.000Z",
          "Titre": "X4 M+20 runs",
          "Contenu": "X4 M+20 runs, great team, great service, from top to bottom - prompt, effective and courteous.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T00:50:57.000Z",
          "Titre": "Perfect",
          "Contenu": "Efficient and to the point, absolutely perfect in all categories.  Can’t recommend enough and they have earned it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeffrey",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T00:18:19.000Z",
          "Titre": "Still have fun while not wasting your time!",
          "Contenu": "Groups are always friendly and and enjoyable!  Your contribution still provides as much as you put into it.  It's a great way to learn the mechanics for returning players!"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T14:34:30.000Z",
          "Titre": "5 starts to this specific team I had…",
          "Contenu": "5 starts to this specific team I had the last 2 raids. Incredible players, so efficient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeremy",
          "Nb_Reviews": 4,
          "Date": "2023-12-13T16:48:52.000Z",
          "Titre": "Always a great experience",
          "Contenu": "Great experience. fast runs, team was kind and respectful. only ran 1 dungeon twice. they did a good job trying to make sure each dungeon was different if they could. i have used wow vendor multiple times and they never disappoint. Always a pleasure to run with their teams. I like to run high keys but hate pugging them, these guys are great and know fights well i will continue to use them when i want to run high keys just for ease and completion and no toxicity like with pugs. I HIGHLY RECOMMEND THEM if your looking to avoid the hassle of dealing elitists in the game."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T06:54:27.000Z",
          "Titre": "Fast and reliable!",
          "Contenu": "These dudes were fast, have a great system to keep in contact with you, and are always reliable. Give them a try!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T06:54:07.000Z",
          "Titre": "amazing communication and great results…",
          "Contenu": "amazing communication and great results , but not very fast in comparison to other websites. offline mode would be a very valuable addition as well."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Mullet",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T18:52:40.000Z",
          "Titre": "Great",
          "Contenu": "Great carry service. Efficient even if there is wipes. Things are carried out quickly. Good communication. Will definitely keep using"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Ramos",
          "Nb_Reviews": 5,
          "Date": "2023-12-17T19:25:27.000Z",
          "Titre": "Quick and easy",
          "Contenu": "Quick and easy. Support team made experience run smoothly and was always in contact and informative. Will use again."
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "VdoggyO",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T12:37:48.000Z",
          "Titre": "Great booster",
          "Contenu": "Great booster. Good communication. Went above and beyond my expectations. Fast and reliable site to get whatever you need to be done.Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MR",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T18:11:44.000Z",
          "Titre": "Highly Recommended",
          "Contenu": "One thing that truly stood out was their prompt, courteous, respectful, and open communication!  At any cost, a key differentiator for me is communication, particularly through any challenges.  My initial engagement with this team was a little choppy and things weren't as smooth as could be; however, with their immediate, clear, and open communication pathways, I was able to feel totally comfortable every step of the way!  I absolutely recommend this service, even if they are a bit pricier than others, simply because of the peace-of-mind delivered along with their service!  They completed my order in the time they said it would take and I couldn't be more pleased. :)"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Sue",
          "Nb_Reviews": 11,
          "Date": "2023-12-20T21:08:47.000Z",
          "Titre": "Spot-on",
          "Contenu": "No trouble, smooth run. Great experience, as always. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Happy customer",
          "Nb_Reviews": 20,
          "Date": "2023-12-19T20:37:04.000Z",
          "Titre": "Fast and reliable",
          "Contenu": "Fast and reliable, my order was completed the first day with no trouble at all"
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Sérgio Luiz da Costa",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T23:22:56.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience, fast runs. They did a good job. Always a pleasure to run with their teams. I HIGHLY RECOMMEND THEM!Date of experience: December 13, 2023"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "TonixAU",
          "Nb_Reviews": 3,
          "Date": "2023-12-16T04:50:52.000Z",
          "Titre": "It was amazing got a rank 25-rank 30 in…",
          "Contenu": "It was amazing got a rank 25-rank 30 in brawl stars very efficient and quick loved the help from the team and booster thankyou."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "gion",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T21:31:10.000Z",
          "Titre": "My first experience with WowVendor",
          "Contenu": "My first experience with WowVendor, it was awesome!!The raid group was amazing, entire run was flawless; thank you very much.I recommend them to anyone can't raid with a guild or doesn't want to pug. 5 stars deserve."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "CCASSAP",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T09:45:22.000Z",
          "Titre": "Brilliant as Always",
          "Contenu": "Always deliver on what they promise with no fuss. Willing to let you have a go and coordination is fantastic."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T16:04:30.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience, fast, professional and got what I paid for!  Will definitely use again.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 27,
          "Date": "2023-12-14T16:59:45.000Z",
          "Titre": "Easy,straightforward,safe,reliable…",
          "Contenu": "Easy,straightforward,safe,reliable service.have used many times and never a problem.Cant recommend enough. 5stars."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T03:41:53.000Z",
          "Titre": "Fast and efficient",
          "Contenu": "Fast and efficient, the process from speaking to an agent prior to placing order was quick and easy"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-12-16T03:43:38.000Z",
          "Titre": "Always a pleasure doing business with…",
          "Contenu": "Always a pleasure doing business with these guys, always smashing bosses and keys like there is no tomorrow"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T20:12:09.000Z",
          "Titre": "Amazing",
          "Contenu": "Amazing! Quick delivery and great service. These guys are legit"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer69",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T16:25:15.000Z",
          "Titre": "Always a good experience!",
          "Contenu": "Delivery of service was delayed and they compensated me with a higher tier of product!  I’ve always had good experiences with wowvendor."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "lucaAlex gamer",
          "Nb_Reviews": 7,
          "Date": "2023-12-12T22:56:07.000Z",
          "Titre": "The Best Service",
          "Contenu": "The Best Service, Excellent communication, great teams and Good price for their services ! I do highly recommend them ! better then anyone else !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 102,
          "Date": "2023-12-14T08:24:09.000Z",
          "Titre": "Fast and easy normal RAID",
          "Contenu": "Fast and easy normal RAID. Quick RAID, no issues, finished in record time. Looking forward to a Heroic RAID run with these guys!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Snou",
          "Nb_Reviews": 56,
          "Date": "2023-12-21T14:45:23.000Z",
          "Titre": "Fantastic service",
          "Contenu": "Fantastic service, WoWvendor is the only i use and trust"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 16,
          "Date": "2023-12-20T02:29:49.000Z",
          "Titre": "Smooth and quick AMIRDRASSIL HEROIC BOOST",
          "Contenu": "WowVendor is the best boosting site. I have been using them for years and will continue to use them.Thanks"
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Dan",
          "Nb_Reviews": 5,
          "Date": "2023-12-20T17:39:11.000Z",
          "Titre": "Very good support",
          "Contenu": "Very good support! Fast and very easy to order and to get a response from the team. Did a few boosts with this people. And all I can say is that it's fast, easy and cheap! :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Snou",
          "Nb_Reviews": 56,
          "Date": "2023-12-13T15:55:38.000Z",
          "Titre": "Running out of words to describe the…",
          "Contenu": "Running out of words to describe the excellence. So i will say it in Spanish,  Tremendo servicio, simple, fàcil y divertido  :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T03:26:22.000Z",
          "Titre": "Service was prompt and the actual run…",
          "Contenu": "Service was prompt and the actual run was quick and easy"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Brutus",
          "Nb_Reviews": 188,
          "Date": "2023-12-16T02:36:29.000Z",
          "Titre": "It’s a normal run was ok though but…",
          "Contenu": "It’s a normal run was ok though but would of like help in the spears but we did it all with ease thanks again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T00:31:19.000Z",
          "Titre": "Great Experience",
          "Contenu": "Professional, courteous and really fun to watch =) worth it every time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RM",
          "Nb_Reviews": 30,
          "Date": "2023-12-19T04:29:26.000Z",
          "Titre": "Another excellent run from really great…",
          "Contenu": "Another excellent run from really great gamers!  A++"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 40,
          "Date": "2023-12-12T05:25:15.000Z",
          "Titre": "Great run",
          "Contenu": "Great run - couldn't ask for more. Pro team ran me through the instance without a problem. Not a worry with this service - they have always delivered."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dirtymojo",
          "Nb_Reviews": 6,
          "Date": "2023-12-16T16:48:54.000Z",
          "Titre": "Great experience, always!",
          "Contenu": "Always fast, respectful, and clean. Repeat user on multiple toons."
        },
        {
          "Note": 5,
          "Lieu": "NO",
          "Pseudo": "Petter A.",
          "Nb_Reviews": 7,
          "Date": "2023-12-10T02:43:13.000Z",
          "Titre": "I have been using their service for…",
          "Contenu": "I have been using their service for quite some time now, and they deliver 5/5 on everything. Easy to chat with customerservice."
        },
        {
          "Note": 5,
          "Lieu": "FI",
          "Pseudo": "ThunderiiZ",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T00:38:30.000Z",
          "Titre": "Quick and smooth run",
          "Contenu": "Quick and smooth run. If you are struggling to find a raid group to have easy 9/9 run, I can recommend this service."
        },
        {
          "Note": 5,
          "Lieu": "CZ",
          "Pseudo": "furry hunter",
          "Nb_Reviews": 7,
          "Date": "2023-12-13T18:51:59.000Z",
          "Titre": "so i had to wait quite a bit for the…",
          "Contenu": "so i had to wait quite a bit for the service, must have been a miscommunication cos it took a few days to be completed, however as per usual the completion itself was flawless - thank you"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Client",
          "Nb_Reviews": 6,
          "Date": "2023-12-16T00:55:38.000Z",
          "Titre": "It's really the best of the best",
          "Contenu": "It's really the best of the best service, punctual, professional, without a doubt the fastest and most serious."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen LaMotte",
          "Nb_Reviews": 139,
          "Date": "2023-12-18T07:11:29.000Z",
          "Titre": "Great run",
          "Contenu": "Ilvl raid change 440 to 450 without the vault.  Two nice weapons for Fury Warrior"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 27,
          "Date": "2023-12-19T13:38:36.000Z",
          "Titre": "Brilliant service",
          "Contenu": "Brilliant service, reliable and safe. Best providers around."
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Wacko",
          "Nb_Reviews": 7,
          "Date": "2023-12-13T03:03:37.000Z",
          "Titre": "Raid achievements",
          "Contenu": "Inv was on time, was really fast done, good communication, so it was all perfect"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JP Smith",
          "Nb_Reviews": 5,
          "Date": "2023-12-10T22:06:53.000Z",
          "Titre": "Team downed the bosses quickly",
          "Contenu": "Team downed the bosses quickly, and let everyone participate.  Was promptly resurrected when needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "W.McNally",
          "Nb_Reviews": 5,
          "Date": "2023-12-11T00:54:43.000Z",
          "Titre": "These people are amazing",
          "Contenu": "These people are amazing. You ask and they get it for you. No issues or problems. I don't have the time to grind for some of the things I would like to get. They'll do it for you. Really recommend them to anyone who doesn't want to be left out on when playing your game."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dynasty",
          "Nb_Reviews": 4,
          "Date": "2023-12-10T18:44:08.000Z",
          "Titre": "Top tier game service",
          "Contenu": "On time, as advertised - went perfectly.  have done, and will continue to do business with wowvendor!"
        },
        {
          "Note": 5,
          "Lieu": "TH",
          "Pseudo": "happy client",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T15:42:22.000Z",
          "Titre": "Reliable and fast.",
          "Contenu": "You can trust them. Delivery is fast and they even gave a bonus :) Will use again for sure."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "none of your business",
          "Nb_Reviews": 15,
          "Date": "2023-12-18T00:29:17.000Z",
          "Titre": "Fast Fast Fast",
          "Contenu": "Once again a great carry group..always fast and efficient"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dadlee",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T18:21:34.000Z",
          "Titre": "Everything was fantastic",
          "Contenu": "Everything was fantastic! Not a single issue at all."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T20:24:52.000Z",
          "Titre": "It was great experience and I highly…",
          "Contenu": "It was great experience and I highly recommend them for help."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T10:55:31.000Z",
          "Titre": "smooth runs",
          "Contenu": "I have several smooth runs here, very good"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "lucaAlex gamer",
          "Nb_Reviews": 7,
          "Date": "2023-12-15T02:01:12.000Z",
          "Titre": "Amazing range and offers",
          "Contenu": "Amazing range and offers, lovely customer service, and great speed of service"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Gypsy",
          "Nb_Reviews": 18,
          "Date": "2023-12-18T10:34:41.000Z",
          "Titre": "Professionally run group",
          "Contenu": "Professionally run group, smooth no fuss"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "mike gibbins",
          "Nb_Reviews": 33,
          "Date": "2023-12-10T14:46:56.000Z",
          "Titre": "Great mythic ru s very quick no messing…",
          "Contenu": "Great mythic ru s very quick no messing would highly recommend these guys"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kholir",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T07:37:59.000Z",
          "Titre": "Fast and easy",
          "Contenu": "Fast and easy. Reliable. Would order again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Booger Holler",
          "Nb_Reviews": 85,
          "Date": "2023-12-15T08:12:07.000Z",
          "Titre": "4x M+18s made it look easy",
          "Contenu": "4x M+18s made it look easy. Helped me get my Myth Keystone Master achievement."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "satisfied customer",
          "Nb_Reviews": 10,
          "Date": "2023-12-16T02:15:44.000Z",
          "Titre": "Super-smooth run",
          "Contenu": "Super-smooth run, no deaths, plenty of loot... and the raiders let me play too this time! Had a blast!"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Customer",
          "Nb_Reviews": 14,
          "Date": "2023-12-15T18:00:25.000Z",
          "Titre": "Easy raid",
          "Contenu": "Raid was quick and easy done. Unfortunate not good loot but still achieved ahead of the curve."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rey",
          "Nb_Reviews": 16,
          "Date": "2023-12-13T16:52:45.000Z",
          "Titre": "Wonderful service",
          "Contenu": "Wonderful service.  I always receive my order in WoW SoD super fast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T13:11:37.000Z",
          "Titre": "Good times",
          "Contenu": "Good times. Great and easy service. 10/10 would recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T01:57:48.000Z",
          "Titre": "Fast fast fast",
          "Contenu": "Fast fast fast.  And communication was on point.  Love these guys."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T04:07:27.000Z",
          "Titre": "Quick and easy",
          "Contenu": "Quick and easy run for H Fyrakk and H Tindral. No issues, very well done."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim",
          "Nb_Reviews": 5,
          "Date": "2023-12-15T17:47:41.000Z",
          "Titre": "Much wow!",
          "Contenu": "Fast and reliable. They communicate every step of the process."
        },
        {
          "Note": 5,
          "Lieu": "HR",
          "Pseudo": "Tomas",
          "Nb_Reviews": 23,
          "Date": "2023-12-19T16:59:03.000Z",
          "Titre": "Easy raid",
          "Contenu": "Easy raid. I enjoy these stressfree runs"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew",
          "Nb_Reviews": 10,
          "Date": "2023-12-12T02:45:09.000Z",
          "Titre": "It was a smooth run that I never had to…",
          "Contenu": "It was a smooth run that I never had to worry about and did exactly what it needed to do."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jr mills",
          "Nb_Reviews": 27,
          "Date": "2023-12-14T07:39:14.000Z",
          "Titre": "Fast and Easy",
          "Contenu": "Great run, Fast and easy their customer support is great!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Michael Walker",
          "Nb_Reviews": 10,
          "Date": "2023-12-18T09:34:02.000Z",
          "Titre": "Always as excellent as they've always…",
          "Contenu": "Always as excellent as they've always been :)"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T03:33:58.000Z",
          "Titre": "Very helpful and quick always giving me…",
          "Contenu": "Very helpful and quick always giving me updates and the customer support were friendly!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "sheenalove",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T02:31:38.000Z",
          "Titre": "fast service",
          "Contenu": "they are alwayts willing to work with you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 12,
          "Date": "2023-12-10T08:05:55.000Z",
          "Titre": "Mythic bulk package",
          "Contenu": "Purchased a Mythic bulk package of 4 runs and they up each run a +3 and they gave me all the loot. What more can you ask for"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andriah School",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T07:56:13.000Z",
          "Titre": "Service delivered as expected",
          "Contenu": "Service delivered as expected. Great customer service response time and guidance. Efficient fulfillment of requested order purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "christopher Kile",
          "Nb_Reviews": 4,
          "Date": "2023-12-11T17:44:10.000Z",
          "Titre": "Worth it for old dudes who don’t have time.",
          "Contenu": "I’ve used them a bunch. It’s nice having something simple when you don’t have a lot of time with work and everything. I’m too old to play like I did in 2004. I’m glad they are around."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adam",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T20:33:09.000Z",
          "Titre": "Great experience",
          "Contenu": "Fast and great customer support"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T19:31:33.000Z",
          "Titre": "Always a good choice",
          "Contenu": "Always easy and good service"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "DR",
          "Nb_Reviews": 14,
          "Date": "2023-12-11T18:22:38.000Z",
          "Titre": "Super fast invite",
          "Contenu": "Super fast invite. Fast, efficient key team. Amazing service as always."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Brutus",
          "Nb_Reviews": 188,
          "Date": "2023-12-12T09:22:41.000Z",
          "Titre": "Always learning",
          "Contenu": "Always learning, that why always a great fun with these guys"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "tobijas",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T03:39:05.000Z",
          "Titre": "Gladly again",
          "Contenu": "On time, fast and uncomplicated + some good items. Gladly again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Damonischer",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T21:17:53.000Z",
          "Titre": "Quick",
          "Contenu": "Quick delivery, system seems to be very thorough"
        },
        {
          "Note": 5,
          "Lieu": "KW",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T21:36:12.000Z",
          "Titre": "Good group",
          "Contenu": "Good group wasn't expecting loot for the price and I got 2 items"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Jan",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T14:15:39.000Z",
          "Titre": "Fast, Safe and Professional",
          "Contenu": "very fast and professional help in my dungeon, perfect"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Impressed",
          "Nb_Reviews": 32,
          "Date": "2023-12-17T19:49:57.000Z",
          "Titre": "Another great run",
          "Contenu": "Another great run, thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CJ",
          "Nb_Reviews": 9,
          "Date": "2023-12-13T20:30:18.000Z",
          "Titre": "Excellent",
          "Contenu": "Excellent! Great customer service and performance. Very speedy as well."
        },
        {
          "Note": 5,
          "Lieu": "FI",
          "Pseudo": "Lexi Rockas",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T03:39:32.000Z",
          "Titre": "Fast service",
          "Contenu": "Fast service, friendly people and exactly what was requested. Definitely supporting again 😊"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen LaMotte",
          "Nb_Reviews": 139,
          "Date": "2023-12-16T21:20:18.000Z",
          "Titre": "Best run yet",
          "Contenu": "4 pieces I could equip, and two new weapons.  Ilvl 441 now 451, and that is without the vault loot."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shaman",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T05:44:52.000Z",
          "Titre": "Professional",
          "Contenu": "Professional, quick, and trusted. Great run!"
        }
      ]
    }
  ]
}