{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "wpengine.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Max",
          "Nb_Reviews": 3,
          "Date": "2023-12-16T15:11:50.000Z",
          "Titre": "Handling of issues is very disappointing",
          "Contenu": "I have been a customer for about 2 years, I have some WooCommerce client sites but no complicated sites/use cases. Up until a few weeks ago I had one bad experience with multiple hours of downtime due to server issues (but that's not what this review is about).On November 8, 2023 I contacted support to talk about modifying my plan and then had a call about it. What followed was 5 stressful weeks of trying to get replies and solutions.Emails I was asked to sent apparently did not reach their recipient (it was later confirmed this was due to issues/mistakes at WP Engine). Almost no replies to the support ticket (even after almost 2 weeks of waiting), and no reply that actually solved the situation. Over the 5 weeks I opened 4 additional chats to ask what's happening and was told again and again that managers had been pinged and replies/solutions would come as soon as possible but nothing ever happened. I also called a number I was given, left a message but never got a reply.Since my plan modifications included upgrading to more sites and during the initial call it was confirmed this was going to happen asap, I made plans with clients, cancelled other contracts, etc... These 5 weeks cost me over 200$ for interim solutions, many hours of unpaid work, angry clients and one client lost.After 5 weeks I finally got an email and a call was scheduled. WP Engine apologized, admitted that they messed up with multiple things and took all the blame. I was told a few months of free hosting as a goodwill offer should be possible and so I agreed to staying with WP Engine (at this point only because of what my clients want).Unfortunately the \"goodwill\" was quickly reverted and was turned into a 100$ gift card (in this case value equivalent of a month free hosting) for some online shop in some other country, so useless for me.As of now I cannot recommend WP Engine at all. There are lots of hosting companies out there and pretty much all of them work great as long as there are no issues. The important thing is, how does the company handle the situations when issues arise and in my experience WP Engine completely failed in this case.I have also read similar stories before."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric S Flores",
          "Nb_Reviews": 7,
          "Date": "2023-11-07T18:18:22.000Z",
          "Titre": "It's the most dishonest company you…",
          "Contenu": "It's the most dishonest company you will ever deal with. I was oversold on a hosting plan and could not get WPEngine to control their greed and charge me for a plan I belonged in. WP Engine's hosting service is overpriced compared to many companies with nearly identical service and support. My suggestion is that you do your best to avoid their sales department as they will steamroll you into services that you don't need. I have 50-60 visitors a day and they felt that I needed to be in their $ 1,050-a-month plan. There is no integrity or ethics that guide this company to do the right thing."
        },
        {
          "Note": 1,
          "Lieu": "AE",
          "Pseudo": "Atiqrev",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T16:49:54.000Z",
          "Titre": "Very Bad and poor Experience",
          "Contenu": "They are Just Kidding With Their Clients, Supports are non technical persons. Without any reason middle of conversation they just leave.If some how they connect again not answering after 30mins to until you bored and disconnect by yourself..People are not kidding with their clients like thisWE ARE PAYING VERY HIGH COST THAN OTHER HOST IN HERE.Sham Sham"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Darren Peel",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T05:38:48.000Z",
          "Titre": "WPEngine has been horrible!",
          "Contenu": "WPEngine has been horrible! I have been trying to stop my services for over a month and they will not downgrade my account. I am paying over $900 a month and desperately trying to downgrade and they won't let me. I opted for a custom 100-site server. They told me I needed to upgrade and get a bigger server when I had only 70 small sites because we ran out of storage! I decided to move all my sites to Kinsta which has been WAY better for performance. I now have 24 sites on my servers (yes... read that again... 24 small sites on a 100 site plan) and WPEngine is refusing to downgrade my plan saying my utilization levels require my 100 site server!I should be paying less than $250 for a 24-site plan and WPEngine is refusing to downgrade my plan that is close to $1000/month. That should be criminal."
        },
        {
          "Note": 1,
          "Lieu": "MA",
          "Pseudo": "Nabil K.",
          "Nb_Reviews": 5,
          "Date": "2023-11-02T02:02:31.000Z",
          "Titre": "11-days-wait with WPEngine support",
          "Contenu": "Do you really need 11 days to create a backup that contains LargeFS files? I used the AWS CLI and taught my client how to use it, and we were done long before you responded to me. A very bad experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "RealReviewGuy",
          "Nb_Reviews": 2,
          "Date": "2023-07-19T13:29:50.000Z",
          "Titre": "No phone number for erroneous billing issues.",
          "Contenu": "Horrible customer service. There is no phone number for billing issues - you simply won't get a response on very large recurring bills WP engine made in error. and your credit card company may not allow you to dispute the charge.  I ichatted/texted with Aaron and he did the best he could to hid his identity and not give me any phone number to anyone at WPengine.  Subscribe at your own risk."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nick",
          "Nb_Reviews": 3,
          "Date": "2023-06-16T22:48:35.000Z",
          "Titre": "Shady Terms of Service & Cancellation Process",
          "Contenu": "Thought I canceled their service, but when it auto-renewed, I canceled immediately. I received an email that said the cancellation process takes 30 days and is part of their ToS. While this is probably buried in their ToS, it is poor business practice, especially since I have nothing hosted on their service now. I was told that my yearly contract amount would be prorated after the 30-day process. Terrible and shady business practice. Beware!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brice Blackerby",
          "Nb_Reviews": 2,
          "Date": "2023-06-15T19:34:59.000Z",
          "Titre": "Not The Same Company I Use to Love and Recommend to My Clients",
          "Contenu": "Have had nothing but issues for the last few months with WP Engine. They have a salesman sending emails saying our usage was almost at its limit and that we needed to contact them to upgrade our server. After reaching out to support i found out the salesman was lying and we were not even close to 1/4 of our storage limit. Their predatory sales tactics have made me switch from their service after years of being a loyal customer... CEO needs to re-evaluate their business before their sales team scares others off."
        },
        {
          "Note": 1,
          "Lieu": "RS",
          "Pseudo": "Milenko Radic",
          "Nb_Reviews": 4,
          "Date": "2023-05-19T15:04:26.000Z",
          "Titre": "One of the worst hostings I ever used as a developer in last 10 years",
          "Contenu": "As a freelancer I tried many different hostings in last 10 years and this one is one of the worst definitely.Support is the worst I ever had. They will forward problem to other experienced colleague and than open a ticket and then each day different expert will answer without even reading previous messages.Support also enters in wp-admin and change settings without even asking for permission.I had slow server respond and they said it is because of plugins, when I disabled plugins they said it was because of theme, when I set basic theme then they said some third reason...they do not even bother to check...they just tell you something random."
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Emil Andersen",
          "Nb_Reviews": 18,
          "Date": "2022-12-05T13:52:54.000Z",
          "Titre": "Unfortunatly we've experienced a very…",
          "Contenu": "Unfortunatly we've experienced a very slow server eventhough we are paying around 700 USD per month. I wouldn't recommend WP Engine to anyone that are looking for a quick server. Furthermore it's almost impossible to get to know you server details. Even the most basic information like RAM they wont tell you. Probably because they are putting your site on a shared hosting"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rob",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T00:03:52.000Z",
          "Titre": "WP-Engine told me I needed their most…Overpriced",
          "Contenu": "WP-Engine told me I needed their most expensive hosting product for $600/month for my website that has nothing complicated, no commerce, etc.  I needed something quick and went along because my salesman Thomas said I could cancel anytime.  They even initially tried to get me to agree to over $800.  After 17 days I emailed my sales rep Thomas that I want to cancel and found good hosting for $300 per year.  He called right away and acknowledged that I was cancelling.  Now I'm being billed for another month at $665 minus 4 days. Thomas conveniently for WP-Engine never mentioned to me that I have to go sign in and cancel by myself or I'll get billed continuously.  Thanks a lot Thomas and the customer service crew at WP-Engine for being a rip-off for $1200 for over-sold product."
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Blauw Mostert",
          "Nb_Reviews": 8,
          "Date": "2023-01-02T07:14:05.000Z",
          "Titre": "Pure rubbish",
          "Contenu": "Pure rubbish! They are using alien language that i have never heard of before. Then when i contact the 24/7 customer support, i found that there is actually no such thing. Only a bot that doesn't understand my question. Very frustrating. Will rather go back to Hostinger."
        },
        {
          "Note": 1,
          "Lieu": "EG",
          "Pseudo": "Mohamed Hussein",
          "Nb_Reviews": 13,
          "Date": "2023-08-10T18:56:29.000Z",
          "Titre": "Unprofessional sales support",
          "Contenu": "Unprofessional sales support. from the first look and chat with support I don't recommend this company when they are hiring someone even doesn't know anything about the company or anything to help me and they only push you to pay for any package to get support, I asked Sam one of the support team members if I needed to buy Array Themes which was acquired by WP Engine and he doesn't know anything about that and kept asking me to buy a hosting package first and I said to him I only ask about the theme, then he started to collect data by asking about the URL and so.totally Unprofessional sales support and terrible experience"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gail Velez",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T02:02:50.000Z",
          "Titre": "Family Publications signed up for…",
          "Contenu": "Family Publications signed up for service and we were quoted $1300 as a flat fee. We were billed for $1415.38. We email our sales person. Told the difference was taxes. When we explained that he quoted as a flat fee of $1300. I ask to speak with his supervisor but the supervisor never contact us. Very disappointed. Just wanted a sales. You should honor the $1300 included taxes. Sales service unethical."
        },
        {
          "Note": 1,
          "Lieu": "SE",
          "Pseudo": "Daniel Veritas",
          "Nb_Reviews": 40,
          "Date": "2023-06-28T23:47:25.000Z",
          "Titre": "Created an account to try it out before…",
          "Contenu": "Created an account to try it out before deciding which hosting to go for. Got a very poor experience with WP Engine.- The migration process was useless. Plugin didn't work and it was just awkward. Had to upload my files with FTP and wait for the support to add everything. Just weird.- Domain doesn't work. There is something going on with their SSL or whatever. Even though I pointed the A record and DNS has propagated, it still doesn't work. Useless.- They charged extra to add GeoIP but it doesn't work. I am still waiting.- Support agents are sloooooow. It takes ages for them to respond as if they have 20 tickets open at the same time. None of my issues were resolved.Will cancel my plan and go elsewhere."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Leah Gunter",
          "Nb_Reviews": 2,
          "Date": "2023-05-30T05:01:05.000Z",
          "Titre": "HUGE Bot Problem + 30,000 Spam posts",
          "Contenu": "I had this service on a WordPress blog with 20 posts and after 3 years ended up with over 30,000 spam posts I had to manually remove. I spoke with their tech support, altho knowledgeable nothing was ever fixed. I’ve been on the phone with support many times over this and finally decided to cancel."
        },
        {
          "Note": 1,
          "Lieu": "RU",
          "Pseudo": "Nick Ursu",
          "Nb_Reviews": 3,
          "Date": "2021-10-01T12:26:49.000Z",
          "Titre": "WPEngine customer for 6 months got into…",
          "Contenu": "WPEngine customer for 6 months got into a situation where my card got stolen and I could not pay the subscription. My site is down for 2 days. I asked them to change my payment method to Paypal. I was told no. I asked them to give me access to my account but they are saying I need to deal with databases, FTP, zip downloads which I don't know how to do. I asked them to just give me access for 1 hour to download my website myself, 4 times contacting support no solution. Won't recommend, you're screwed if anything happens with the website."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dave Linder",
          "Nb_Reviews": 4,
          "Date": "2021-09-17T19:17:43.000Z",
          "Titre": "Tech support will try to break your site for an extra $8 a month",
          "Contenu": "I asked a simple question on the live chat about Github integration. They guy on the live chat he said it would be easier if he rings me. He then calls me on the phone to tell me he doesn't know the answer to my question, thanks Grant, that was a great use of both our time time.  But he then tried to upsell a start-up 'plus' plan, that automatically updates all my plugins. A service that can be set up for free, and actually service that shouldn't even be recommended for a site as large and complex as my own, the chance of a fatal incompatibility error arising form automatic plugin updates would be close to 100%.So you ask WP Engine a simple technical question, they ring you to tell you they dont know, but then try to upsell you to a more expensive plan that would break your website. Nice work"
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Niall Flynn",
          "Nb_Reviews": 3,
          "Date": "2022-03-18T11:03:32.000Z",
          "Titre": "A very overpriced WP host, with poor at best service",
          "Contenu": "Gone from a very decent host to a really poor one. Overall the hosting is fine, but for what they charge, the live chat is really slow, the email based support is via Zendesk so requires a second login. Sales are persistent and quite annoying. I was a big fan of WPE, but since 2021 I have seen a noted decline in support and a lot of email spam to up sell things. I as a web developer can no longer recommend them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jessica Eddowes",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T23:28:01.000Z",
          "Titre": "After being with wpengine for 5 years.",
          "Contenu": "After being with wpengine for 5 years.. I'm pulling my business.. had a salesperson lie and sold us a server so that we could combine three servers into one server for $100 more than we were spending, which was supposed to be faster.   After moving, they decided they wouldn't be able to combine the servers after all so now we're paying $1,000 more than we agreed, and I can't get a sales manager to work with me to resolve the issue..  so, after several months, we're just going to move our $3500 in servers somewhere else..  thanks for NOTHING...Edited after response.. We already tried escalating to the leadership team.. we called in and spoke to someone and asked to have a sales manager call us with 0 response.  I received a response today from people AFTER we cancelled taking responsibility for dropping the ball, but NOONE has addressed that we were overcharged by nearly $3,000 over the last few months because the sales person basically lied on multiple occasions.  and.. then.. contacted us at another company with another client and tried to pull the same trick, which is why we ended up leaving..   Too little too late and Waaaay too much trust broken at this point..   very disappointing end to a 5 year relationship."
        },
        {
          "Note": 1,
          "Lieu": "RO",
          "Pseudo": "Vetan Lucian Valentin",
          "Nb_Reviews": 2,
          "Date": "2022-02-14T22:27:24.000Z",
          "Titre": "Want to be treated like *? Come to WPEngine",
          "Contenu": "First of all, I've been a customer for 3 years. Can't say it was bad until now, but I can't say it was great either.This all started when they decided to disable .htaccess. According to them, they will provide support for all existing customers to migrate their .htaccess rules. That was a lie.Tried for 2 weeks to get some help for a simple task, all I got were copy-pasted messages and ZERO actual help. They were telling me set up a staging environment when I specifically told them from the start I am using it and wanting to test the Ngix rules on it. Guess they don't even bother reading your messages.Customer support? Get the ef our of here!!My 2c? Use something else, there are plenty other companies that care about their clients."
        },
        {
          "Note": 1,
          "Lieu": "KR",
          "Pseudo": "Harvey Wang",
          "Nb_Reviews": 5,
          "Date": "2023-04-22T10:53:58.000Z",
          "Titre": "Terrible experience",
          "Contenu": "Terrible experience, I cannot log in to my site properly. When seeking assistance from the agent service, she simply told me to try again and then ended the chat.The agent is Katie S."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Steve Jennings",
          "Nb_Reviews": 7,
          "Date": "2021-09-30T17:08:11.000Z",
          "Titre": "As others have said…",
          "Contenu": "As others have said their support is terrible, my most recent experience is spending an hour on live chat to be told to do something and go away and see if it worked. Despite it being contrary to their own documentation. Clearly an attempt to get rid of me. Their system is overly complicated and has proprietary quirks which makes it idiosyncratic and it would seem nobody there understands it full - and/or bothers to keep their own documentation up to date. There are way better and simpler WordPress hosting options out that which with a couple of plugins give better, more robust performance and a more 'vanilla' maintenance experience. Used them on and off for years - really liked what they were about originally but they've pursued there 'unique' system down a blind alley and allowed their support to deteriorate beyond reason. Do not even go there, you will regret it if you do."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Russell",
          "Nb_Reviews": 3,
          "Date": "2023-01-30T16:51:26.000Z",
          "Titre": "Overcharged - Company Refused To Refund",
          "Contenu": "Well over a year ago, I contacted WP Engine via customer support live chat as I wanted to add 2 extra sites to my hosting.I asked how to do this and the costs involved. They told me the costs to add 2 extra sites would be $40/month extra.They assisted me with the changes and I have been paying $84 per month ever since.Recently, I discovered that WP Engine actually offers a plan that includes the three sites for considerably less than the $84 per month that I have been charged.After discussion with the company, and a phone call with management, they confirmed that I have been paying more and that this was due to the fact that a technician rather than billing manager gave me the information and that there was a lack of resources to properly give me the proper information.The company has refused to refund me the extra money I have paid for something I should not have paid due to their own mistakes and lack of resources. They have offered me $200 credit if I stay with them, however, I am leaving this service.Please be careful if you are looking to use this host - my advice is to avoid. There are many other options out there!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Josh",
          "Nb_Reviews": 3,
          "Date": "2022-11-13T00:06:11.000Z",
          "Titre": "Did Not Want My Business",
          "Contenu": "I reached out for a consultation for a $600.00 monthly plan and spoke with Shakira via phone and chat and she stated they were unable to call me after she stated I would receive a call within 20 minutes. They had 2 people working that day. It is extremely sad that I did not have any luck with a company with so many good reviews."
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Oana Purda",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T16:20:59.000Z",
          "Titre": "Aggressive sales tactics, insanely high prices & a bad experience altogether",
          "Contenu": "We recently decided to switch from WP Engine to Cloudways after a salesperson from WP Engine contacted us saying that we need to urgently upgrade our plan to a considerably more expensive one. The reason was that we were using too many resources on the shared server. The only proof that they were able to provide was an Excel sheet with the name of our website and the usage percentage next to it.The salesperson insisted that we needed to upgrade immediately, employing high-pressure sales tactics. Therefore, we decided to cut ties with this provider altogether.I would not recommend WP Engine since they are much more expensive than their competitors without providing any extra value. Plus, sooner or later, they will try to upgrade you to a plan that is 5x times more expensive than what you are paying now.After reading the other reviews here, I realized that many other companies went through similar experiences with WP Engine. Have I known this a few years back when we started using them, I would have definitely went with a different provider instead."
        },
        {
          "Note": 1,
          "Lieu": "GR",
          "Pseudo": "Ola",
          "Nb_Reviews": 4,
          "Date": "2021-12-13T16:58:11.000Z",
          "Titre": "Their 60 days guarantee is a scam",
          "Contenu": "Their 60 days guarantee is a scam. The speed is a scam..I tried WP- engine and got disappointed. The speed is average. So I decided to use the 60 days guarantee..When you try to cancel you get a reply, that they will discuss the case after 30 days.. They are making it really hard to get money back on purpose."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Ronald",
          "Nb_Reviews": 1,
          "Date": "2023-01-30T19:57:37.000Z",
          "Titre": "We are still not receiving  our…",
          "Contenu": "We are still not receiving  our customer orders - sent through WP - on our desktop.  (We are receiving them on our phone.)  Can you fix this?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jennifer",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T21:04:43.000Z",
          "Titre": "WPEngine - Underdelivered",
          "Contenu": "We've been hosted by WPEngine for several years with a small art website that never required the bandwidth we paid for. This year, we had an online sales event that we'd been planning since last year. We contacted WPEngine in advance several times to discuss the high level of traffic that we'd have at show opening and paid to increase our bandwidth significantly after considering their input and being told that would take care of it. Another small business owner we know had a website crash last fall under similar circumstances (with WPEngine) and we wanted to prevent that from happening. As soon as the show went live, the website crashed. While WPEngine was responsive and managed to get the site back up in about ten minutes, they immediately tried to upsell us multiple times to an account with a $2500-$3500 monthly fee. The one time we needed what we paid for, WPEngine didn't deliver and used that moment of high stress to try to upsell us to something we couldn't afford and didn't need. WPEngine promised the other company they had it covered (and then it crashed) and then we had the exact same experience.  We had a number of customers who missed out on one of a kind merchandise they wanted because of the website difficulties. It was our launch of a new concept and a number of frustrated customers contacted us and let us know they wouldn't be back. The following week, we began our research and as of today, we've moved to a different highly rated host company that is providing us more bandwidth, storage and service for half the price."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Meme Warrior",
          "Nb_Reviews": 2,
          "Date": "2021-10-17T17:27:52.000Z",
          "Titre": "Wordpress admin real slow because of…",
          "Contenu": "Wordpress admin real slow because of this. Switched over to bare metal much faster now. Its  just fancy and overpriced for some odd reason."
        },
        {
          "Note": 1,
          "Lieu": "TH",
          "Pseudo": "James Brown",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T13:07:50.000Z",
          "Titre": "Don't make the mistake of going to…",
          "Contenu": "Don't make the mistake of going to them. I was advised against going to wp engine, but I decided to take the risk anyway.I migrated to wp engine several months ago. At first, everything went well, until the first month, when I started to be harassed by e-mails from a wp engine \"account manager\".They're desperate to get me on the phone to check up on my account. I refused, because I don't want to talk or need any advice. But the person persists, and sends e-mails every 2 days. Until one day they tell me that my site is consuming too many resources. (Even though I had the max plan before the personalised one) and I had contacted an agent and told him about my statistics and needs. He recommended this plan.I was told that I absolutely had to change my plan. Naturally, I asked why, and how much it would cost. (I was paying $300 a month)I was told that a personalised server would cost $3,600 a month. WHAT? At what point am I going to go from a 300 euro server to 3600 euros? I politely refuse by e-mail.They send me another e-mail saying they can give me a 50% discount. That's 1800$. (a nice margin nonetheless).So I took the liberty of leaving wp engine, and going elsewhere, for a better and much cheaper service.BUT THAT'S NOT ALL.Having several accounts with wp engine, I had an identical server, for testing, with no traffic. The hosted site was empty.Guess what? I received dozens of emails from a female account manager who insisted on talking to me on the phone. Telling me that my site exceeded the permitted resources.And unfortunately, on the internet, you can read many reviews similar to this one. It's really dishonest to do that.I don't recommend it. Unless you want to lose your money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scott Mack",
          "Nb_Reviews": 4,
          "Date": "2023-05-26T22:05:52.000Z",
          "Titre": "They say the migration process is easy",
          "Contenu": "They say the migration process is easy, but this is not the case. Be ready to spend some money to hire someone to migrate for you and it wont be cheap."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "CustomerTrustpilot",
          "Nb_Reviews": 1,
          "Date": "2022-09-23T21:30:57.000Z",
          "Titre": "Severly limited and restricting hosting…",
          "Contenu": "Severly limited and restricting hosting service. They are now removing .htaccess!!! Why? Because they want you to build the website you own, their way! Wait they are removing all .htaccess to enable their users to use their horrible UI \"Web Rules\" Dashboard! WOW DID ANYONE ASK FOR THIS BS? Why not make it OPTIONAL???From their recent email: \"At WP Engine, we’re focused on delivering the most innovative platform in WordPress to power your digital experiences. We are thankful for your continued business and want to share an upcoming change. In order to continue evolving our platform, we will be removing .htaccess functionality by October 2022.This removal is part of our plan to enable users to self-serve web behavior rules from the Web Rules dashboard in the WP Engine User Portal.\"Heres the PROBLEM. \"By default, WordPress uses the . htaccess files to manage redirects and permalink structures. \"So WPENGINE A WORDPRESS HOST is removing a CRITICAL file that is used by WORDPRESS!! Does no one see the problem here??? FFSDO NOT HOST YOUR WEBSITES HERE!!! If you want full control over how you build your website YOU OWN, and how and when YOU want to update the website YOU OWN, DO NOT HOST YOUR WEBSITES ON WP ENGINE.WHY ON EARTH WOULD YOU REMOVE A FEATURE such as .HTACCESS TO ENABLE A FORCED FEATURE like the \"Web Rules\" dashboard? What is your management team smoking? FAIL! FAIL! ZERO STARS!This is beyond ridiculous. When this change goes through I will be removing ALL of my websites from this horrible website hosting provider. I'm tired of them auto-updating my wordpress even though I have auto updates DISABLED, I'm tired of being pushed into newer versions of PHP because they disable previous PHP versions, I'm tired of being bossed around every month on HOW I CAN BUILD THE WEBSITE I OWN! WP ENGINE SUCKS AND IS EXPENSIVE!!!! WP ENGINE IS THE WORST HOSTING PROVIDER! -20 Year DevUpdate 9/23/22 WP-Engine has contacted Trustpilot to remove this review. Wow! What happened to freedom of speech?"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "HOBA TECH",
          "Nb_Reviews": 1,
          "Date": "2023-02-18T02:56:04.000Z",
          "Titre": "Absolute crooks, avoid avoid avoid!",
          "Contenu": "Absolute crooks! avoid these clowns! Been with them for 4+ years, have 6 sites with them. Their sales guys saw an opportunity to pitch a 'free' upgrade trial (beware the free lunch, of course), promised it was low touch/minimum to no changes required, we agreed, then the rath of additional changes came flying thick and fast, it was clear it was not seamless, nor straight forward, neither were they forth coming with the actual cost. Not until we got the upcoming invoice due, despite communicating with them on email back and forth, not to start the trial, they started it anyway, we get the invoice that says that package we didnt want, nor need was actually circa 10x my current package?! going from c£100/mth to nearly £1,000/mth, to a package that was not required and more suitable for a high volume eCom store(s). What was more disappointing was on checking their site, there was a more and better suited package was available for c£250 (not £1000!), that of course was not offered not once in any communication, even after they knew the product wasnt suitable, the customer expressed many times he didnt want or need it, and was unhappy with the proposal, and service. Who in their right mind thinks if a customer can go from a c£100/mth to £1,000/mth 1) they would have done it already, 2) they could afford it, especially when 3) there is a more suitable feature, functional and price wise £250/mth package available? At no time, did the sales guys offer the more suitable alternative, and continued to insist on the upgrade. We however insisted. We advised Support, again, not to continue, and do the 'downgrade', thinking that was the end of the ordeal. Support then decide its a good idea to reply to my email and ask me a bunch of irrelevant questions, that sure enough, ticked down the clock that low and behold, guess what they debited our account for? Yes, exactly!This is snakes in the grass. They dont listen to their customers, doesnt matter if youve been with them for years. Stay clear of these snakes. We have heard good things about Kinsta, will be getting our refund and then leaving. Avoid these crooks. Take your money and business elsewhere."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kate",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T01:06:26.000Z",
          "Titre": "I moved away from WPEngine a long time…",
          "Contenu": "I moved away from WPEngine a long time ago. I left because I had chronic issues with site speed that could not be resolved. I moved to Squarespace."
        },
        {
          "Note": 1,
          "Lieu": "RO",
          "Pseudo": "Paul D",
          "Nb_Reviews": 2,
          "Date": "2023-09-17T17:18:30.000Z",
          "Titre": "Websites down for half a day due on…",
          "Contenu": "Websites down for half a day due on their fault as error 404. They did not have any backup solution. No 99.99 Sla"
        },
        {
          "Note": 1,
          "Lieu": "PH",
          "Pseudo": "Ralph Laurence Quito",
          "Nb_Reviews": 3,
          "Date": "2022-01-24T19:47:14.000Z",
          "Titre": "My site is down for 2 days",
          "Contenu": "My site is down for 2 days, and my support ticket is just sitting for 2 days and no one bother to respond. Dont use them, their the worst"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "dee alvarado",
          "Nb_Reviews": 1,
          "Date": "2023-01-13T22:46:38.000Z",
          "Titre": "We decided to go with another company",
          "Contenu": "We decided to go with another company. Performance didn't meet the requirements we were looking for."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Greg Dorrance",
          "Nb_Reviews": 2,
          "Date": "2023-03-25T18:25:48.000Z",
          "Titre": "Wp Engine---Support  Keep going around in circles.",
          "Contenu": "WP Engine supportKeep going around in circles. Keep charging overages. See copy of email Sep 22, 2021, _________ ______ fixed the problem. I do not  run the servers, would not know how.Same answers for past year. My IT person asked what was wrong, no answer.Last email from ___________ totally missing the problem.My last answer back can not even be replied to, but maybe I am missing something.Called support number with ticket number could not help. Sat, Mar 18, 8:57 PM (3 days ago) to WPNo one has answered our questions. Mine or my IT guy. Never get answers.Same bull last year.I think it's time to send an article to PC Magazine and others to see who else this is happening to.As you can see again from your own reports we do not use that much  bandwidth . But you have charged me many months for overage,copy here__________   _________ (WP Engine Support)Sep 22, 2021, 3:13 AM CDTHi Greg,I hope you are doing well !I have taken a look at your bandwidth and since Monday when those bots were blocked I am seeing a huge decrease In the bandwidth which looks as though was the main cause of your high bandwidth :Monday+-----------------+| Total Bandwidth |+-----------------+|         18.3 GB |+-----------------+Tuesday+-----------------+| Total Bandwidth |+-----------------+|         6.38 GB |+-----------------+Today+-----------------+| Total Bandwidth |+-----------------+|         2.21 GB |+-----------------+I would like to put this on hold for 24 hrs to then check again to make sure that bandwidth Is kept low. After 24 hours we will check again and let you know if everything Is looking good.If you have any further queries please feel free to let us know !Kind Regards,___________  _______, Technical Support SpecialistWP Engine, Inc.  ReplyHello Greg,Your ticket (#6312962) has been updated.To review the status of the ticket and add additional comments, follow the link below:You can also add a comment by replying to this email. ____________ (WP Engine Support)Mar 18, 2023, 10:57 PM CDTHello Greg,Thank you for reaching out to us regarding the billing for your WP Engine account. I am writing to address your concerns and provide clarity on our billing policies.Firstly, I want to clarify that we do not charge for bandwidth, as detailed in our documentation here:  However, we do bill for billable visits, which are measured differently than the bandwidth outlined in our documentation here: . I hope this clears up any confusion you may have had regarding our billing policies.Our team has reviewed our records, and there are no other open tickets from you with questions for our team. The current thread to which you replied only has one response and no questions for our team.If you would like us to investigate the billable visits, we can open an investigation and provide our findings. Please keep in mind that this may take some time, as we need to pull logs for each of those visits.Best regards,_________________________| Technical Support SpecialistWP Engine, Inc.Support Resources:Support Center | System Status | BlogWP Engine website"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Eduard Fleischmann",
          "Nb_Reviews": 1,
          "Date": "2021-08-25T22:47:03.000Z",
          "Titre": "Arbitrary prices are defined, 25% more expensive for no reason",
          "Contenu": "It's not possible to upgrade your plan by your own. You need to open a ticket. I upgraded my managed hosting startup plan to managed hosting professional plan and wrote explicit that it shouldn't cost more than 49 EUR. The new pricing was 69 EUR. The pricing table is showing 55 EUR. After 3 chat sessions and 3 tickets, nobody could explain me why it cost more. For me this is not trustworthy, prices are simply defined arbitrarily."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mr R Selvanayagam",
          "Nb_Reviews": 35,
          "Date": "2021-06-18T15:18:00.000Z",
          "Titre": "Be very careful about choosing…",
          "Contenu": "Be very careful about choosing WP-Engine.  Once the traffic on your site increases, they raise their prices ridiculously.  They have their own way of calculating traffic which is widely disparate from data shown in Google Analytics.  We're stuck with them as one of our essential plugins can only run with WP-Engine.Probably ok if your site has 1,000 visitors a month or lower but I guess that's how they 'reel' you in..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Luca",
          "Nb_Reviews": 1,
          "Date": "2021-08-12T18:48:09.000Z",
          "Titre": "Terrible customer service",
          "Contenu": "Terrible customer service. They double charge our services several times, and we went through hell to get those refunded. They do whatever they can to trick you to pay for the next period and good luck in getting that back! Terrible company, with horrible people working for it."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Samir Dhingra",
          "Nb_Reviews": 1,
          "Date": "2020-06-17T14:06:10.000Z",
          "Titre": "They charged me whopping 600$ a month",
          "Contenu": "They charged me whopping 600$ a month, i bought a plan for 900 USD a year, THey start blackmailing me, They told me they were charging extra for over trafic , they show me the trafic of 300000 People monthly, but when i compared the traffic with my google analytics it was just 60000. They start using my debit card and deduct any amount they wish and sending me very understandable excuses. Beware WPengine is a fraud, they are cheater."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Josiah Partin",
          "Nb_Reviews": 3,
          "Date": "2020-08-04T16:51:51.000Z",
          "Titre": "What a rip off",
          "Contenu": "What a rip off. They charge these high prices and then give you nothing in return. The service is faulty, the support has declined. You're better off with another hosting provider. I used to really like WPE and back them but I'm tired of explaining to my clients why they have problems and downtime. I'm done!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Greg Bowen",
          "Nb_Reviews": 3,
          "Date": "2020-05-11T20:57:21.000Z",
          "Titre": "Never had good luck with these people",
          "Contenu": "Never had good luck with these people. Today, they accidentally sent an entire chat transcript to the wrong person. The people they have on the front lines of the chat system are beginners and make bad recommendations.I don't even reach out to them anymore. I almost always find the issue first.When I was working for a large client, they tried to bully me around, going over my head as the lead developer/contractor to reach upper management.There are much better options tbh."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "James Fawcett",
          "Nb_Reviews": 6,
          "Date": "2019-09-09T09:45:17.000Z",
          "Titre": "They used to be good...",
          "Contenu": "We have three servers with WpEngine, their support and speed was incredible a few years ago, but now is appalling. You could not make up how bad these guys are now with their response times and answers. Really unhelpful and untrained over anything other than simple CMS usage in the Wordpress admin. Where have all the decent customer support team gone!? To top it off, the servers are extremely slow now and we regularly see DNS issues and downtime."
        },
        {
          "Note": 1,
          "Lieu": "MY",
          "Pseudo": "Leney Jinlee",
          "Nb_Reviews": 1,
          "Date": "2020-03-31T11:27:39.000Z",
          "Titre": "Ripped off",
          "Contenu": "Ripped off. I had to pay more because of traffic increase. I checked Google analytic, nothing. There wasn't any spikes. According to them, Google analytics would only track unique visits from people, while Wpengine would visits from people and from BOTS. Where does this bots come from? Where's the proof?"
        },
        {
          "Note": 1,
          "Lieu": "BY",
          "Pseudo": "Aleksandr",
          "Nb_Reviews": 1,
          "Date": "2023-01-23T15:37:14.000Z",
          "Titre": "Slow",
          "Contenu": "Slow any dynamic, aggressive caching and etc"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lindsey Jones",
          "Nb_Reviews": 2,
          "Date": "2019-10-14T13:36:00.000Z",
          "Titre": "WPEngine USED to have great customer…",
          "Contenu": "WPEngine USED to have great customer service and very knowledgeable reps. Over the last year, the quality of their reps has gone downhill so significantly that I am regularly more knowledgeable than their reps. I've even had reps send me 'articles' as if I haven't already read articles prior to contacting them. WPEngine - Customer Service is what originally set you apart from the other hosts. You can't raise your prices and then lower the quality of service. We're on the way out if this continues."
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "hemmeligt",
          "Nb_Reviews": 4,
          "Date": "2016-05-31T07:54:44.000Z",
          "Titre": "bad service and poor support",
          "Contenu": "I bought wpengine for 3 reasons.1) Performance2) Security3) supportThe performance is ok, however many other hosts can follow their speed nowerdays .. with PHP7 and HHVM ect.Security - my site has been hacked twice .. atlthough they promised extreme security ... when i asked how it happend and if i can get more security, i am told to find another host.. in my opinion, its not worth the money. I am moving after such a flippant reply from support."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "A Gauberti",
          "Nb_Reviews": 27,
          "Date": "2019-08-30T11:59:40.000Z",
          "Titre": "StudioTheme and WP Engine are the worst…",
          "Contenu": "StudioTheme and WP Engine are the worst piece of \"s...\" ever. They charge you outrageously high amounts for their themes, or their hosting services, and then they give you fucko customer service, and DO NOT EVEN REPLY TO THE TECHNICAL SUPPORT TICKETS YOU SENT THEM. Worse IT providers ever, for real.Besides, their Gutenberg plugins are hecking useless and unusable. Shame of these people who are merely milking cash cows, and destroying their own brand. Shame and stay away from Studiopress and WP Engine at all costs."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "David Jones",
          "Nb_Reviews": 2,
          "Date": "2019-09-10T08:44:04.000Z",
          "Titre": "If I could score them lower I would",
          "Contenu": "If I could score them lower I would!  Terrible service.  They appear, on the face of it to reply quickly etc.  But they are never able to fix complex issues and I have spent HOURS on live chat trying to sort issues that always end up being their end.  Their TTFB is also absolutely terrible"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Cody Madi",
          "Nb_Reviews": 1,
          "Date": "2018-10-09T03:30:31.000Z",
          "Titre": "Company forced an approximately 25%…",
          "Contenu": "Company forced an approximately 25% increase on the basic annual plan this year. They introduced a couple small additional functions applicable to only users that require multiple websites in an effort to justify it. All plans forced to upgrade to new plans. Price gouging at its finest."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Lutz",
          "Nb_Reviews": 2,
          "Date": "2020-10-20T06:13:03.000Z",
          "Titre": "Better choose other service in Europe",
          "Contenu": "If you are in Europe, I must recommend to pick a local provider. WP-Engine apparently outsources its service here and its really bad. If you think you can manage a page without service, then you might go for it. But there are obvious alternatives ..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rob Sanders",
          "Nb_Reviews": 1,
          "Date": "2019-03-18T15:19:22.000Z",
          "Titre": "Pretty bad, horrible support, mediocre hosting.",
          "Contenu": "They used to be okay and convenient, now they are pretty useless. Their chat support used to be able to offer basic help with their services, but they are utterly useless now. You wait in a 30-80 person queue for a while, someone finally gets on and asks you the equivalent of did you trying restarting it. Simple things like did you update your plugins. Or I am pasting an error from the error logs in case you completely didn't even try to check the error logs on your own. What the error means, they have NO clue. Its sad, there was potential, but don't see them lasting much longer."
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Lars Skjoldby",
          "Nb_Reviews": 15,
          "Date": "2017-08-09T23:44:22.000Z",
          "Titre": "Worst hosting experience ever",
          "Contenu": "Worst hosting experience ever! 3 times in less than 4 months the server was down 5, 6 and 7 hours because of DDOS attacks. Not against us but other websites on the same server.At our old one dollar hosting provider they could reroute DDOS attacks in minutes. But at WP Engine, where you pay at least 30 times as much, they just do not have the skills.\"Funny\" thing is: We moved because we wanted more security and to be sure to keep a solid uptime.What we got was 30 times higher costs, wasted money on online advertising through the down time and properly lost leads."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Steve Cooper",
          "Nb_Reviews": 1,
          "Date": "2020-11-19T01:06:55.000Z",
          "Titre": "Service going down hill",
          "Contenu": "Hi So I go to make contact with a live person to help solve a problem, but there is only a virtual service now. What happened to the real guy?That was your strong point having a real person to connect within real-time."
        },
        {
          "Note": 1,
          "Lieu": "LU",
          "Pseudo": "Marco Freitas",
          "Nb_Reviews": 5,
          "Date": "2021-03-24T20:07:48.000Z",
          "Titre": "even worse  acess to your hosting than Wix",
          "Contenu": "I will immediately ask a refund with my credit card company .Their Hosting plans have no access to add database  users etc.. Support live chat takes hours .it worst than \"Wix\" for control"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Oliver Meakings",
          "Nb_Reviews": 55,
          "Date": "2019-04-02T18:24:33.000Z",
          "Titre": "Avoid",
          "Contenu": "AvoidMassive overage charges for visits that aren't seen in GA. In fact WPEngine claimed my site was delivering 2.5 times more visits than GA. This is an issue seen across their client base. Avoid. Avoid. Avoid."
        },
        {
          "Note": 1,
          "Lieu": "EG",
          "Pseudo": "Hans Gr",
          "Nb_Reviews": 45,
          "Date": "2021-07-29T15:00:33.000Z",
          "Titre": "not professional even at sales!",
          "Contenu": "not professional even at sales!the live chat (so called expert)kept ignoringand when I told him I'm leaving the chathe replied:I am so sorry, you have a happy day 😀"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "AudienceGainNet Admin",
          "Nb_Reviews": 2,
          "Date": "2021-08-23T03:27:49.000Z",
          "Titre": "Terrible Customers Service",
          "Contenu": "Their service was great but not now.Their customers service is extremely bad. They will never been their if you need their help, that's how they are!Stay away 100000 miles"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sofie Brenna",
          "Nb_Reviews": 2,
          "Date": "2019-07-18T17:14:35.000Z",
          "Titre": "Unethical liars who only want more $$$",
          "Contenu": "I've been with WP Engine for over 6 years and pay for 100 installs/mo.  So I get faster chat support and dont wait in the queue that smaller accounts have to wait in...  Years ago, they were the best, but as they've grown they've gone from taking customers for granted to treating us like absolute crap.   I'm starting the process of transferring all my sites away so think twice before signing up.They tell you sites that you've transferred off your account are gone, but they are still on your account using your resources - giving them a free ride off your $$.   Then they use the issues of limited resources to tell you that you need to upgrade your account... none of which is true, they just see you as a bank account they can dig into.   RUN AS FAST AS YOU CAN AWAY FROM THESE GREEDY......."
        },
        {
          "Note": 1,
          "Lieu": "NO",
          "Pseudo": "Trond",
          "Nb_Reviews": 2,
          "Date": "2020-09-27T10:26:59.000Z",
          "Titre": "Never WP Engine again - false stats",
          "Contenu": "Never WP Engine again. They tried to make me upgrade my package by telling me that I have more than 4 times as many visitors to my site than I actually have."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Leon Heuser",
          "Nb_Reviews": 2,
          "Date": "2019-12-16T20:20:00.000Z",
          "Titre": "Avoid if you want your sites to be online",
          "Contenu": "I used to be a big promoter of WP Engine, but they have turned into a money grabbing bad hosting company. When my website was down because another customer on the server (yes, you're only getting shared hosting at >$100!) was hogging all the ressources, I only found out because my own ping monitoring notified me. Everytime I contacted customer service regarding this, they didn't even know what's happening at the beginning.It shouldn't even happen once, but it actually happened several times. My sites were offline for several hours. They can't claim to be premium hosting, charge premium prices but then offer hosting that you get elsewhere for $10/month.The final reason for me to leave this review came when I cancelled: they won't even let you use up the time you paid for. The account gets deactivated and all your data deleted within 24 hours, even if you have half a month of service left.Please don't make the same mistake as I did and AVOID WP ENGINE"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christian Robinson",
          "Nb_Reviews": 1,
          "Date": "2019-03-11T16:22:28.000Z",
          "Titre": "Board line scam not worth your time",
          "Contenu": "Board line scam not worth your time. I've had to use WP Engine for close to a year now and I cannot wait to get rid of it. Their hosting service is unreliable at best. Random outages, environments will redirect so you have production links driving to development sites, slow site speeds, a useless CDN and just the worst support. The support you get from their live chat is a joke. They will lie to you, mislead you and in general tell you what you want to hear to get you off the chat as fast as possible. I've had dozen of calls with account reps, developers and various other customer service people and I never feel like I'm talking to anyone with actual knowledge of their product or care taken in their customer's satisfaction. They refuse to give out any actual helpful information about their service. They won't tell you the type of server your data is hosted on out of fear of the customer finding out they are just reselling cloud flare hosting at a higher rate."
        },
        {
          "Note": 1,
          "Lieu": "SE",
          "Pseudo": "David Sundberg",
          "Nb_Reviews": 2,
          "Date": "2021-09-20T14:47:02.000Z",
          "Titre": "The live support chat is the worst."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric Abrantes",
          "Nb_Reviews": 2,
          "Date": "2018-06-07T17:14:44.000Z",
          "Titre": "Have had multiple issues with WPengine…",
          "Contenu": "Have had multiple issues with WPengine on client accounts. With so many hosts on the market, it is east to fine one that works better."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "JorgeLuisBorges",
          "Nb_Reviews": 1,
          "Date": "2019-01-09T11:32:54.000Z",
          "Titre": "Price hikes, lies, threats.",
          "Contenu": "Since being with them they've reduced the number of visits included in a plan, and increased the price of the plan by 25%.On top of that -I was told on signup - that the ony impact of going into overage (over the allowed number of visits) was financial - a charge per visit. I subsequently got contacted by a \"support\" staff member telling me the account had \"the potential to be\" limited because it looked like we would potentially go over the plan.Let me be clear. They were saying that our account could suffer outages (even though I asked whether this was a risk of going over the visit limit, they told me no, I would just be charged) - not because we had exceeded our quota, but because it looked like we were going to. We have to upgrade NOW or our site might slow down, freeze up, even though we were below our quota.Yes it's fast and stable, yes the features are good - but they lied to me, they reduced my package, they increased the price. The are abusing the loyalty of their customers."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Oliver Meakings",
          "Nb_Reviews": 55,
          "Date": "2018-03-01T15:15:33.000Z",
          "Titre": "Avoid avoid avoid",
          "Contenu": "Avoid avoid avoidLack of transparency* They will not tell you the amount of RAM your environment has even if you have a dedicated server* They do not follow industry standard billing by bandwidth, but instead by visits - using their own logic to define what a visit is Expensive* For the same setup they are significantly more expensive than most over providers* They bill overage charges for every visit over your allowance without a cap* Cash flow issues led us to ask for a holiday payment one week before invoice was issued. This which was refused and we were threatened with this site being taken offline within 14 days. This was after > 1 year of paying every invoice immediately.Account downgrade* A requested account downgrade on September 4th 2017 took 45 days to complete.* This was mainly caused by them incorrectly migrating the website to a shared server in the wrong location, and then having to migrate a second time.* Was billed at the higher price for this whole period, costing my company over $500. They offered $125 compensation after many hours of phone calls.Site speed* Their own site speed tests show an 11 second load time for 'visitor complete' and 23 seconds for 'render complete'.* Average for our industry is 6 seconds."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Andrew",
          "Nb_Reviews": 2,
          "Date": "2021-08-03T14:41:46.000Z",
          "Titre": "it takes too much efforts to stop the…",
          "Contenu": "it takes too much efforts to stop the subscription"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Rick",
          "Nb_Reviews": 3,
          "Date": "2020-10-22T08:34:45.000Z",
          "Titre": "Awful",
          "Contenu": "Awful. Terrible customer service. Avoid at all costs."
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Robin Grønborg Sand",
          "Nb_Reviews": 10,
          "Date": "2018-08-30T03:11:16.000Z",
          "Titre": "Must read (very detailed)",
          "Contenu": "Seriously...Don't even know where to start. Tried migrating my site over from UNOEURO (WORST DECISION OF MY LIFE PROBABLY) Just launched a new website, and we wanted quicker loading speed, so I read that WpEngine would be a good solution.Tried the \"automated migration\" they offer, apparently, that doesn't work, since you cant \"auto\" with Wordpress. The funny thing here, WP Engine = Wordpress Engine, and it can't automate through Wordpress. Ridiculous. Now okay, I then try the manual migration. That makes everything worse, now getting fatal errors, plugins don't work, themes don't work. Absolutely insane. Back and forth with the support team, and no one seems to know jack sh** about anything, you have to be a specialized SFTP, the fu****g advanced WordPress ex PHP file user to even get your way around this. Tried several times with this, backing up, uploading and so forth, with no luck what so ever. Then after like 5th try suddenly my page wasn't responding, and everything went full slide and wrong fonts and so on. This they couldn't help with, the only thing they would know how to do, was to do a \"fresh\" backup from before. I spent nearly three days back and forth with this s*** and now they want me to do a backup again. At this point, I felt my head exploding, and my inner Mike Tyson came through, wanting to punch these guys through the screen. Gave up on this horrible company and poorly educated support team, and asked for a refund. Staying at UNOEURO until I find something more reliable.Read for yourself if you think it's worth your time trying this hosting provider. Furious regards,Robin Sand"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "The Prescott Times",
          "Nb_Reviews": 1,
          "Date": "2022-09-01T18:28:43.000Z",
          "Titre": "You charge to much."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Lee",
          "Nb_Reviews": 2,
          "Date": "2017-08-21T16:45:50.000Z",
          "Titre": "Poor product knoweldge from staff - service offering has huge gaps",
          "Contenu": "I signed up for WPengine after speaking with a helpful sales guy (UK based). The server needed to include 2x installations of Wordpress, one for the website and another for the blog (it was actually a news site for SEO, but for the purposes of this review we will just call it a blog) www.(main)fistwpinstall.co.uk/(blog)secondWPinstall/  I was informed I could do this on the personal plan, no problem. Yey! On signing up, paying for a year on the personal plan with UK Data centre, I figure this is not possible by doing some research. I spoke to a colleague via the chat box to clarify, and they tell me I need to buy a Professional Plan unless I add an additional website (at an additional $14 a month) and add set up a forwarder on the DNS for the sub domain, not happy I use a second account (Which I purchased with the original order but was hoping to use it for another website, but this is a different story) So I install the blog and try to set this up via the DNS - Im struggling at this point so I speak to another Technical advisor via the Chatbox and he informs me, no, this can not be done! - As you can imagine, not happy at this point! I speak to the original chap on the phone again who advises I upgrade to the professional plan. A little unhappy, I ask to speak to his Boss. I don't understand why it is so difficult to add a second installation of WordPress on the server and why this is going to cost me an additional $700, so when you include UK data Centre this works out at $1500 total. I understand the benefits of using WPEngine; I get it! I just don't know how you can go from a plan that allows 1x WordPress install to a plan that accepts ten installs. I don't need ten installs; I only need 1 install and sub folder with wordpress installed for the website blog, how is this so difficult for WPengine to understand, surley most companies have this? why are you talking to me like I am the first person to ever ask this question. IN short, I have spoken with two people on the phone - employee 1x didn't have a clue what he was talking about. The other (his manager) didnt understand the point I was trying to raise, he was very abrupt and kind of told me to go away, they're not interested, \"The product is not for me, and I need to find another server, WP Engine isn't suitable for you riff-raff\" (he didn't say riff-raff, I made that up, but that was how I interpreted it. Secondly the support staff on the chat facility the first person did not have a clue, she took a long time to get back with replies, she must have been the 1st day on the job. She kept referring me back to blog posts for answers. She gave me the wrong advice and wasted a good few hours of my time. The 2nd chap I spoke to on the chat - in all fairness he was very knowledgeable, he shot from the hip, was very to the point and didn't skirt around any of the points I was raising. If any of the management at WPEngine are reading this I would ask that you, please look over this case, you very clearly have issues that need addressing. Some of your employees don't know the product they sell,  and you have a big gap in your service offering. I am now going to go back to the drawing board and try to find another server - a full 3/4 hours of my life wasted!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Martin Reed",
          "Nb_Reviews": 1,
          "Date": "2021-07-11T14:15:01.000Z",
          "Titre": "Account closed (and it was surprisingly easy to switch providers)",
          "Contenu": "We had been broadly happy with WPE after we migrated half our online presence to them at the beginning of 2020. The migration and onboarding were straightforward, their support team has always been great, and when we needed to upsize and add an extra layer of security after a few months the process was easy.However, this week we have migrated to a new provider (Cloudways) after some very opaque communications from our account manager.He contacted me a few days ago to say that our site is using up too many resources and poses a risk to sites on the shared server, including our own. I was told this was urgent. Naturally we took this seriously and wanted to address it directly. I asked our account manager three times for further information - to find out what the issue was and how long it had been going on. We're problem solvers and wanted to be able to prioritise practical time investigating (and hopefully fixing) the issue this weekend. The requested information would have enabled us to do so in a focused way. While intuitive, the WPE admin interface offers no diagnostic tools apart from a basic PHP web log, so without this information we could only guess at where to start.However, instead of providing practical information, our account manager only gave vague responses and would not put me in touch with the support team who had apparently flagged the problem in the first place. He was only interested in setting up an 'urgent account review' meeting. Although urgent, this account review meeting was scheduled for six days after the account manager's original email.The most specific thing the account manager mentioned was that we share our server with 150-200 other accounts. Having been paying £168 (approx $230) each month, I was a bit surprised that so many other websites might be competing for resources.During this email exchange, I contacted WPE's support desk and in the course of a brief text chat got some useful pointers from one of their support team, with some useful pointers for improving the health of our database (to be clear, their frontline guys are great and our decision this week has nothing to do with them). I don't think the support person who helped me could see any evidence of issues raised by the support team about our account, which seemed very strange.This gave me the impression that our account manager was not interested in helping us improve our website. The account review would not have looked at the site from a technical perspective. My guess is that he would most likely just have tried to upsell a more expensive package (a point he did not deny when I asked him). I have no problem being sold to, but only if the sales rep is being open about it. But if you're going to tell me your tech guys are concerned about our website, and that it is urgent, then please urgently put me in touch with your tech guys so they can say what they need to say. If something is urgent, help us do what we need to do to fix our site. Don't send us vague comments and defer the whole thing to a non technical meeting six days later.In the course of investigating the issues, we actually migrated a copy of the website to a Cloudways server on a three day free trial. Not only did the Cloudways facility give us (free) tools to start investigating issues, but from the outset the site ran substantially faster even on the basic setup offered by their free trial. Their facility, flexibility, price point, ease of migration, not to mention site responsiveness and the extra few points we earned on the Google Pagespeed Insights without fixing anything, are all a great challenge to WPE, so we have decided to stay. Not something I thought we'd be saying a few days ago, but there you go.The ease with which we have been able to move quite a complex website (it took only two hours yesterday morning) has been a good reminder of the importance of keeping our technical suppliers in competition - because changing them has not been an arduous process.I'm very disappointed in WP Engine. My initial experience with them was great. But the approach this week from our account manager was incredibly opaque.As a result they have lost a customer.PS - for others having doubts about WPE, Google throws up lots of WP Engine vs Cloudways comparison blogs, which are worth a look.PPS - the information above was shared with WPE when we closed our account.EDIT - I've just read the other 1 and 2 star reviews on here. It looks as though the tactics our account manager seemed to be adopting have been used on others, who have subsequently ended up paying more without explanation. Meanwhile, a huge number of 5 star reviews are tagged 'INVITED' and came in within a few days in November 2020. Call me a cynic, but maybe this says something about the work culture at WPE."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Steven Nicholls",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T12:09:18.000Z",
          "Titre": "As a new user",
          "Contenu": "As a new user, I am very disappointed. Always trying to 'Upsell' and lock you in. They were attractive on paper because I could easy push and pull from local. But then I had pushy account managers warning me about usage and then trying to upsell to a new package. Then I find out I have to 'upgrade' (surpise!) to create a sub domain or sub directory. Be cautious and always evaluate this. Reading previous reveiws they used to be very good. Now seem to be 'upsell' driven!"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "James",
          "Nb_Reviews": 8,
          "Date": "2023-09-25T14:36:04.000Z",
          "Titre": "Has gone downhill - no longer recommend",
          "Contenu": "Was a happy customer for many years but service has really declined in our experience.  First they moved us onto a worse server (without telling us) even though we were paying £1000 + a month.  To fix this we had to upgrade again multiple times and were being pressured by the account manager to do this with calls on the last day of the last month of the quarter. We are now with AWS and the performance is already a lot better for a fraction of the cost."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Zsolt",
          "Nb_Reviews": 3,
          "Date": "2023-06-06T23:37:22.000Z",
          "Titre": "Good performance, but lots of outages!",
          "Contenu": "Overall good performance for the price, but frequent outages - and support is insanely difficult to deal with, that is if you actually get to even talk to a person. We're paying for the middle tier, that is supposed to give better support, yet here we are, our website is down, and there is nobody responding. Unacceptable."
        },
        {
          "Note": 2,
          "Lieu": "SE",
          "Pseudo": "Thomas Karlsson",
          "Nb_Reviews": 1,
          "Date": "2022-06-29T20:13:38.000Z",
          "Titre": "Getting worse by the day",
          "Contenu": "We've been using WPE for years and as time goes more and more things are starting to break.The server error logs are not up to date (or show anything), copying environments from production to stage/dev keeps failing in one way or another, new PHP versions takes forever to be added and so on.There are good things though like the emails they send on vulnerable/out of date plugins, support is often nice, in built geolocation but as a developer these things don't make up the day to day struggles."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jessica",
          "Nb_Reviews": 1,
          "Date": "2023-01-30T17:00:53.000Z",
          "Titre": "We were forced to upgrade our plan…",
          "Contenu": "We were forced to upgrade our plan because our usage skyrocketed. While your team was great about reaching out, we've struggled to get any support to find out why this could have happened when we made no changes to our site."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "XZR",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T13:55:39.000Z",
          "Titre": "They used to be a great",
          "Contenu": "We were customers since 2015 with a small group of non commercial low traffic sites and we just ported out our final two sites this month.  Our sites have always been stable but they have recently been slow especially on the back end. We are also constantly bothered by our \"account managers\" or \"customer relationship managers\" to upgrade our plan. Tech support used to be fast and helpful but now there is a bot followed by a chat queue so you can wait for generic copy and paste responses. You can also create a support ticket that gets a similar quality of response.Their metrics do not appear to be accurate except for use as a sales tool. They will contact you with claims of \"Exceeding Plan Limitation\" or statements like \"...this can place a heavy strain on the server and lead to performance issues, downtime, and errors.\" Every time we look at our data their number of visits is roughly 1.5-2X more than google analytics, and their bandwidth metrics make no sense.  If you ask for additional info you either get a csv in excel or a screenshot of bandwidth usage that is basically useless.Overall we would no longer recommend wpengine even for a basic website. There are many other managed Wordpress hosts with much higher limits on bandwidth and storage for the same cost or lower."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Awespire",
          "Nb_Reviews": 1,
          "Date": "2022-08-08T22:34:13.000Z",
          "Titre": "From \"Gold Standard\" to \"Brown Standard\" in Hosting!",
          "Contenu": "I've been recommending WP Engine to clients for years now as the \"gold standard\" in hosting, even at the elevated pricing (compared to other hosting services).  And, while I sincerely believe that was once true, it's no longer the case.  Technical Support has been replaced by an AI bot, which does its best to force you to figure it out yourself from links to FAQ pages, and upgrade to their latest upgraded services, then makes you wait forever to connect with a tech.  Then, once you connect to a live tech, the response is always the same boilerplate garbage: create a staging site, turn all the plugins off, one by one to see which one is causing the issue, etc.\", only to finish up with \"contact the plugin developer as we do not support plugins.\"  I, for one, will be moving on other hosting providers."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joshua  Lane",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T19:34:23.000Z",
          "Titre": "Need an advance email letting me know the yearly  renewal price is due",
          "Contenu": "Hello, I would like an advance email letting me know my yearly subscription is about to be due. Thank you,Josh LaneHere's To Your Health with Joshua Lanewellness radio"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 8,
          "Date": "2023-09-17T02:04:10.000Z",
          "Titre": "As a long-term client of WP Engine…",
          "Contenu": "As a long-term client of WP Engine across multiple companies, it's disheartening to witness the decline in both service and performance over the years. WP Engine was once a go-to solution for reliable and high-performing WordPress hosting, but recent years have shown a noticeable degradation in these areas.Server PerformanceThe server performance, which was once robust and reliable, has taken a significant hit. Load times have increased, and the overall responsiveness has deteriorated, affecting not just the user experience but also SEO rankings. Downtime has become more frequent, causing disruptions in business operations.Customer SupportWP Engine's support, although accessible, has become increasingly ineffective. The support team often provides solutions that are either too generic or ineffective, leading to prolonged issue resolution times. What's worse is the complete lack of care in addressing customer concerns. Support tickets often lead to conversations with account executives who are more interested in upselling services than in resolving the issues at hand. This has resulted in a loss of trust and increased frustration among long-standing clients like us.Final ThoughtsThe decline in WP Engine's service quality and server performance is not just disappointing but also detrimental to businesses that rely on their hosting services. The lack of genuine customer care and the focus on upselling rather than problem-solving have further eroded trust. It's a far cry from the high standards they once set in the industry. Long-term clients have been left to reconsider their hosting options, as the current state of affairs is unsustainable for serious business operations."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ed",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T01:26:57.000Z",
          "Titre": "You all should leave me the f-ck alone",
          "Contenu": "You all should leave me the f-ck alone. I am not a web developer and I had to pay a contractor to make my site, now I have to hear from you and it's pointless."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Tom Watts",
          "Nb_Reviews": 3,
          "Date": "2020-08-21T15:54:24.000Z",
          "Titre": "WPEngine support is good but their…",
          "Contenu": "WPEngine support is good but their prices are truly catastrophic. We were overcharged a whopping £230/month for a few sites on a low-fi shared server! They don't reveal how many people you are sharing with either, but they'll happily have their salespeople hunt you down and constantly tell you that you need to spend more! One to avoid if you don't like throwing money away."
        },
        {
          "Note": 2,
          "Lieu": "JP",
          "Pseudo": "Edu Gate",
          "Nb_Reviews": 1,
          "Date": "2020-09-14T12:32:30.000Z",
          "Titre": "Support is no longer good...",
          "Contenu": "Support used to be very good but then... not sure what happened.  It's like the whole new team of customer support is incompetent.  Not only is the wait time incredibly long now, they don't know what to do with basic requests.  They also tell you they will finish a ticket and email you but nothing happens.  I have had TWO tickets disappear into thin air in the last three days.  When I contacted them again, they apologized that the ticket was accidentally closed.  Need to think about moving my site soon."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Humberto Tordecilla",
          "Nb_Reviews": 11,
          "Date": "2017-11-11T00:01:35.000Z",
          "Titre": "ok but not for me",
          "Contenu": "They are remarkably expensive, I am not really sure how they justify the cost. I tried them but left for various reasons, server kept going down which is strange as from what I know they use Google servers, so it leads me to believe they are installing multiple WordPress instances on the same server - cutting costs. If you a really want a good reliable service get your own managed server."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Priority Pixels",
          "Nb_Reviews": 5,
          "Date": "2019-03-26T16:34:26.000Z",
          "Titre": "Servers are lightning quick but…",
          "Contenu": "Servers are lightning quick but very expensive for what it is. You are also unable to install third part SSL's on their startup package. You have to upgrade to their growth package which costs three times as much. Even as a business we can't justify these costs!"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Stuart Edwards",
          "Nb_Reviews": 17,
          "Date": "2019-03-27T11:13:08.000Z",
          "Titre": "We have used WPE for 3+ years now",
          "Contenu": "We have used WPE for 3+ years now. Generally have had a good experience and liked the great support on chat but now thats all changed. We get put in a que in line with 25+. Horrible and totally different. Considering our options to find an alternative."
        },
        {
          "Note": 2,
          "Lieu": "SE",
          "Pseudo": "Tobias",
          "Nb_Reviews": 1,
          "Date": "2018-06-28T08:07:53.000Z",
          "Titre": "lacking behind",
          "Contenu": "Pushing changes via git is throttled (< 100KiB/s). Overall I got the impression that the management console did not get much attention in the past time. The tooling is not up to date industry best-practices.Would not recommend."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "TD2",
          "Nb_Reviews": 8,
          "Date": "2018-04-01T11:15:41.000Z",
          "Titre": "Bad performance and billing practices",
          "Contenu": "Bad performance and billing practices, lots of \"emergency maintenance\" and infrastructure issues on a regular basis. I caught wpengine over-billing me by fudging the site traffic numbers (by 2 magnitudes no less). Also be aware that when they \"refund\" you, they just credit your wpengine account and you have to call to actually get the money back onto your credit card. I will be moving off their service for sure as they have just informed me that they will be increasing my monthly bill by about 40% starting in 5 months. I wouldn't even consider staying, mostly because the website performance is quite horrible from whatever corner-cutting they are doing behind the scenes. I really regret choosing them as I have to move all these sites again!"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "tm",
          "Nb_Reviews": 1,
          "Date": "2020-12-08T04:34:10.000Z",
          "Titre": "Tickets sometimes better than chat - option?",
          "Contenu": "Creating a ticket is more efficient for me than waiting in queue for a live chat. The issue needs solving as it seems to be recurrent. A Subdomain comes up as a broken link."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Advisory Services",
          "Nb_Reviews": 7,
          "Date": "2018-08-15T18:29:26.000Z",
          "Titre": "WP Engine has become a different animal over the past 12 months...",
          "Contenu": "WP Engine has become a different animal over the past 12 months. They have always been an expensive way of hosting websites but I have had my personal and corporate accounts with them for 2-3 years now.There support was always outstanding - really friendly people where nothing was too much trouble. I leaned on a bit of advice from these support guys once or twice and they were always exceptional. That always justified the high end hosting pricing for me.However they have moved into support that is average and doesn't really seem to care like they once did and have introduced major hikes in pricing. What was 10 sites costing me $99 per month had had to be cut to 5 sites costing me $115.Numbers are obviously much greater on corporate site.As i say, a different animal, and as soon as I get the time I will start the project of moving away from them."
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "31West",
          "Nb_Reviews": 2,
          "Date": "2023-01-21T05:48:43.000Z",
          "Titre": "Very expensive"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lindsey Miller",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T19:47:09.000Z",
          "Titre": "If you track metrics, not the right host for you",
          "Contenu": "If you are someone that likes to track visits to your site using UTM or gclid then this isn't the platform for you. They need to uncache each page in order for it to work properly. With every single code created. On top of that when you need to reach support, you can't do it through the normal portal. You have to go into a different system, create a brand new username and password then you can communicate on tickets that are created. There are such better options out there that don't cause such a headache."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "PB in STL",
          "Nb_Reviews": 2,
          "Date": "2023-06-06T16:11:35.000Z",
          "Titre": "What happened to the very good support?",
          "Contenu": "I've hosted several sites for years on WPE. The day to day hosting experience is good. The support USED to be very very good and responsive. Now it's chatbot hell and often a waste of time. Solid hosting, but the support is average at best these days."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Arzan Sam Wadia",
          "Nb_Reviews": 1,
          "Date": "2023-01-26T18:09:00.000Z",
          "Titre": "I am neutral on WPEngine",
          "Contenu": "I am neutral on WPEngine. Their service is fantastic. The servers are fast and there is never a glitch. However their pricing is extremely high, to the point where I may switch to another host. I host a few websites for clients and they are on different sites. WPEngine's competitors offer a lot more storage and pageviews for the same price and they don't nickel and dime over pageviews."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Amir",
          "Nb_Reviews": 1,
          "Date": "2023-01-24T18:15:17.000Z",
          "Titre": "No longer recommending due to overage charges on bot traffic",
          "Contenu": "I've been recommending WPengine as a tech person to non tech people for years. But my recent experience made me stop doing this. You keep charging this person for \"users\" overage even though it's all 100% bots and spam. You claim you block bots and spam, yet this user has so many hits that you charge overage for them. We have to proactively reach to support all the time to block the very obvious bots to avoid overage. They add nginx rules manually. This is very frustrating."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T20:01:23.000Z",
          "Titre": "The good: Decent support. The bad: you will probably need it.",
          "Contenu": "Had to talk to three different support people to get an issue resolved that was totally their fault. We accepted a site transfer when taking over a WPEngine site from another account, and weeks or months later, our site went down due to the domain still be associated with the old account. The first support person seemed to think it's possible to have DNS records for a single domain split across more than one DNS provider (it isn't) so I had to disconnect and reconnect with a different person who tried a couple of things and then promptly escalated the issue to the person who solved the problem.So they have some architecture problems but, fortunately, fairly responsive support."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kim Snow",
          "Nb_Reviews": 2,
          "Date": "2022-12-09T21:15:52.000Z",
          "Titre": "No can do",
          "Contenu": "Being a novice, having no experience building a website, WP Engine added an extra layer to my confusion. My daughter who has designed websites for the world’s largest food manufacturing company couldn’t figure out why WP Engine and WordPress were not linking up."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marc",
          "Nb_Reviews": 1,
          "Date": "2023-01-26T02:15:57.000Z",
          "Titre": "having trouble getting you guys to sort…",
          "Contenu": "having trouble getting you guys to sort out our bandwith issues"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brandon A",
          "Nb_Reviews": 2,
          "Date": "2022-08-18T00:59:15.000Z",
          "Titre": "WPEngine Starting to Degrade",
          "Contenu": "I feel a lot of the reviews here are quite misleading, as WPEngine has a lot of proprietary features and has helped the Wordpress economy as a whole by moving things forward and acquiring quality companies (ex. deliciousbrains).However, I have slowly noticed the quality of things to go down slowly. I have been a WPEngine customer for over 8+ years now. First & foremost, over the past year I have noticed my installs have steadily declined in speed. While I continue using all the most up-to-date technology and little to no plugins. But this does not stop the recent degrades. Things like TTFB and the whole experience have begun slowing down.WPEngine has some stellar features others don't. Like Smart Plugin Manager. One of the best plugins that is very underappreciated. SPM is extremely helpful if you are running a large number of sites because it not only updates your plugins, but also does a visual scan on your pages to ensure they don't break. If it encounters a visual change, it auto reverts and emails you. You can then choose to take action, or wait a few days and the plugin gets another update that fixes the issue, and the SPM does its job.This is great if you have a large number of sites, or a very unsteady site with a massive number of plugins. WPE smart plugin manager is a godsend when you are taking in clients from other developers. As you don't have to ensure your whole website fails from upgrading one tiny plugin that hasn't been updated in 3 years.But outside of that one thing, their service has really begun lacking. Their extra charge for \"Global Security\" is a bit ridiculous, counting if you are already an ECOM customer. The upsells have gotten a bit out of hand pricewise and there are far to many.Everything from advanced site search, to new proprietary cache engines for ECOM sites, SPM, Global Edge security and that's just to name a few.Their new superpowered network isn't really a big upgrade either, just feels like it makes the site a little chalkier on load. The legacy network seems more stable.WPEngine has done a great job serving myself and my clients for the past 8+ yrs. Their SPM has been a lifesaver, but their cost isn't cutting it anymore. If I messaged WPEngine customer service 2-3 years ago I would have an answer from an engineer within minutes. They would go into my install and find whats wrong.The new support is very different. You very rarely get that developer anymore, often times you get the typical run around of \"disabling all plugins\" and other extremely basic stuff any professional has already tried. The support isn't what it used to be anymore.I have tried almost every Wordpress host under the sun and found WPE, while its price point was always bigger than their competitors, it was always the best. Hands-down, if setup properly it was blazing fast, secure and the best. But recently, things have taken such a turn for the worse I have migrated.Sad to see myself go as WPEngine continues to grow, I hope they just don't grow too large. Fairwell old friend."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Matthew Pont",
          "Nb_Reviews": 5,
          "Date": "2021-08-03T10:13:19.000Z",
          "Titre": "Great hosts, great support, terrible disk space restrictions",
          "Contenu": "I really like WPEngine, but the one (big) issue I have with them is the really tight disk usage restrictions that they put on your account.I pay over £100 a month for 10x websites, and they only allow 20Gb for this which really isn't enough. I've had to store images on one site on Amazon S3, and they still chase me up complaining that I am over their threshold.I could understand if this was a £10 a month service, but for over £100, I expect to not have restrictions as tight as this."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Emery Sanchez",
          "Nb_Reviews": 2,
          "Date": "2020-08-26T22:21:46.000Z",
          "Titre": "I would not recommend this company",
          "Contenu": "I would not recommend this company, Not the best web panel, support is 24/7, but very slow and always need to escalate your topics to supervisor to get any smart solutions."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "ROD LAWTON",
          "Nb_Reviews": 4,
          "Date": "2020-12-13T16:01:01.000Z",
          "Titre": "Excellent support, but expensive for high traffic volumes",
          "Contenu": "I have found the WPengine experience a mixture of brilliance and frustration. WPengine has been endlessly helpful in the process of migrating and improving my WordPress site with direct and knowledgeable personal support. My site also loads very, very fast. However, the pricing structure is less effective for me. My site is funded by affiliate commissions which naturally, require fairly high levels of traffic. Right now, I'm in a Catch-22 situation: if I get more traffic, I will have to upgrade my plan, which means much of the extra revenue from increased traffic will be swallowed up by a more expensive plan. I think WPengine may offer great plans for companies or individuals willing to set aside a marketing budget for a site with a different kind of revenue stream (or better conversion), but it does not work well for sites which depend on high traffic and affiliate revenue."
        },
        {
          "Note": 3,
          "Lieu": "PH",
          "Pseudo": "Elite",
          "Nb_Reviews": 1,
          "Date": "2023-01-24T17:16:18.000Z",
          "Titre": "Too much captcha",
          "Contenu": "Too much captcha. I just want to log in."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dean",
          "Nb_Reviews": 2,
          "Date": "2021-01-11T11:10:20.000Z",
          "Titre": "Not as FAST as advertised",
          "Contenu": "Not as FAST as advertised. The Free templates provided are very outdated. Good customer service"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Jax",
          "Nb_Reviews": 1,
          "Date": "2020-11-20T01:38:37.000Z",
          "Titre": "Good dashboard, lame support",
          "Contenu": "The host dashboard is good. It's easy to download backups, revert to backup, copy live site to staging site, add password protection to staging, and so on. The reason for mediocre rating is support. This comes in 2 forms: chat support and ticketed support.Chat support is hit-and-miss. Some people know what they are doing and want to find a solution. Others either don't know or don't seem to care. With all chat support, you're better off multi-tasking due to the long waits between responses, but that seems universal on the web. I've had some great chat support so overall, this would only bring the score down one star.The real downfall is ticketed support. Generally, issues move to ticketed support when it takes too long or is too hard for chat support. (You can't log into ticket support in the Chrome/incognito browser, by the way, or at least I can't.) Any ticket-item I've had has basically had zero support. Your site could be in flames and they probably wouldn't look at it for a week. (And that's just the initial look, not a solution.) So you end up trying again and again with chat support and hopefully you get a resolution there. In summary, it's a pity about WP Engine's support level (mainly ticketed support). The rest of the system/interface is good and much cleaner that what I've seen on the two other hosts that I've tried. For me, timely support is important so I'm actually considering a change to another host."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Chen",
          "Nb_Reviews": 9,
          "Date": "2023-10-26T19:13:52.000Z",
          "Titre": "Support Tries, Bit Dated",
          "Contenu": "Their support tries very hard to make it work. GitPush is very particular and SFTP had a lot of trouble working due to unusual protocol and port setup so that was very unpleasant overhead to the usually simple wp development. The hosting service is getting dated with lack of good devops or devX so that's a big warning."
        },
        {
          "Note": 4,
          "Lieu": "BD",
          "Pseudo": "Buyzed Hossain Akash",
          "Nb_Reviews": 2,
          "Date": "2023-10-24T04:36:48.000Z",
          "Titre": "nice platform"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brandon",
          "Nb_Reviews": 1,
          "Date": "2022-11-07T23:10:38.000Z",
          "Titre": "I removed one star because of the advanced network migration method.",
          "Contenu": "I removed one star because of the advanced network migration method. I have to get the client to change their DNS once to go live and then again to use the new network. I ALWAYS have to explain why it has to be done this way."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T19:54:07.000Z",
          "Titre": "The problem was resolved quickly",
          "Contenu": "The problem was resolved quickly; however, I asked for more explanation and was given a generic response.  As long as the issue doesn't occur again then I'm happy."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "James Easley",
          "Nb_Reviews": 2,
          "Date": "2022-09-20T14:26:16.000Z",
          "Titre": "Long term partner",
          "Contenu": "As an integrated agency that covers digital at our core, when it comes to hosting we need a responsive and progressive partner that can support us with our day-to-day challenges as well as longer term strategy for our clients. WordPress Engine is that partner - first class server side support, with an evolving eye on the future direction of WordPress."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Sanjay",
          "Nb_Reviews": 1,
          "Date": "2023-01-27T05:42:45.000Z",
          "Titre": "Well .",
          "Contenu": "Well .. it took a while to replicate prod to stage .. but the team did fantastic job doing it manually"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Red Fred Creative",
          "Nb_Reviews": 1,
          "Date": "2022-09-15T04:03:16.000Z",
          "Titre": "Reliable and stable hosting",
          "Contenu": "Reliable and stable hosting. Most common requirements are catered for. Migration, staging, backups, encryption are simple and effective. I recommend this platform for Wordpress Hosting."
        },
        {
          "Note": 4,
          "Lieu": "IM",
          "Pseudo": "Sam",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T17:53:31.000Z",
          "Titre": "Initial communication is excellent",
          "Contenu": "Initial communication is excellent, but once the issue was passed to the engineering team to work on, further details on what the problem was and a timescale for fixing it were (seemingly) slow to appear"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AMJ",
          "Nb_Reviews": 6,
          "Date": "2022-03-11T23:49:04.000Z",
          "Titre": "A safe and reliable WordPress hosting…",
          "Contenu": "A safe and reliable WordPress hosting service. A bit expensive though."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Sharn",
          "Nb_Reviews": 24,
          "Date": "2023-08-03T09:56:45.000Z",
          "Titre": "Great support",
          "Contenu": "As always, knowledgeable support. Thorough and relatively easy to use."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "aAnonymous",
          "Nb_Reviews": 1,
          "Date": "2021-01-27T08:28:10.000Z",
          "Titre": "Service is excellent with very helpful…",
          "Contenu": "Service is excellent with very helpful staff and no problem is too much. There was a problem with my site once and it went down ... I rung them immediately and they were excellent at giving me phone support and talking through everything and had it back up and working the same day. It's expensive for what it is, but you do get extensive support for that!"
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Robyn M.",
          "Nb_Reviews": 3,
          "Date": "2021-04-01T11:35:48.000Z",
          "Titre": "Qualities that matter",
          "Contenu": "Kindness without competence loses its value, and WP Engine is extremely knowledgeable and the support kind and professional. A little bit expensive but it's an excellent service for businesses that are already well underway :)"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Peter Fenwick",
          "Nb_Reviews": 6,
          "Date": "2021-01-12T23:40:12.000Z",
          "Titre": "Straight forward and easy to make edits",
          "Contenu": "Our webmaster set up our new website on WP Engine and it is very good, fast and functional. I'm still learning it but it seems pretty straight forward and easy to make edits. I leave the complex changes and updates to our webmaster."
        },
        {
          "Note": 4,
          "Lieu": "DK",
          "Pseudo": "Elkjær",
          "Nb_Reviews": 29,
          "Date": "2023-08-02T09:51:08.000Z",
          "Titre": "Used to be the best",
          "Contenu": "Since our bad review in 2020, our customer experience has improved. Edited from 2 to 4 stars.2020:Used to be very happy about Wpengine, but recently the service level has declined, and the account manager has started using shady sales techniques like saying we have an urgent problem, when he actually just want to sell us an add-on."
        },
        {
          "Note": 4,
          "Lieu": "IE",
          "Pseudo": "Hitesh",
          "Nb_Reviews": 13,
          "Date": "2021-01-07T10:07:34.000Z",
          "Titre": "We loved the support but found the…",
          "Contenu": "We loved the support but found the Multisite setup a bit challenging as we get numerous emails saying our bandwidth is maxed but when we see our stats in the dashboard it shows its not even 60%."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mark Pack",
          "Nb_Reviews": 23,
          "Date": "2020-12-19T17:24:01.000Z",
          "Titre": "Great customer support",
          "Contenu": "Not the cheapest of hosts, but consistently good customer support. Always feels like you are dealing with a human, not a bot, and one who wants to get things working for you."
        },
        {
          "Note": 4,
          "Lieu": "IE",
          "Pseudo": "Roisin Oflaherty",
          "Nb_Reviews": 2,
          "Date": "2021-01-19T17:10:47.000Z",
          "Titre": "WP Engine is easy to use and create…",
          "Contenu": "WP Engine is easy to use and create backups for your site. They are fast to help when you have an issue."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Paul Grey",
          "Nb_Reviews": 13,
          "Date": "2019-03-24T07:39:07.000Z",
          "Titre": "Have become quite expensive recently but outstanding customer service make it a worthwhile investment",
          "Contenu": "I am genuinley surprised at the negative feedback re support and outages off wp engine.I have been with wp engine for about 4 years now. We host a range of websites on their servers - approaching 100 in all mostly hosted via multisite installs. I cant recall any issues with websites down or server issues over that time and the technical support is the best I've had anywhere. In fact when they put their prices up last year I only stayed because of how good tech support is/In the past 4 years wp engine have been spot on delivering a great and reliable service - however, by far the best asset is technical support. I ring them or message them 24 hrs and someone is there to walk me through issues - almost immediately. Technical support is critical when dealing with large numbers of sites and the level of back up offered have definitely helped us expand.I also like the fact they specialise in wordpress - this is a great fit for comp[anies that specialise in wordpress technology.The downsides?The pricing. Last year wp engine went from 10 installs to 5 installs for the same price, essentially doubling their price.This means that although I'd recommend them on service, look carefully at pricing before you commit."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Keegan",
          "Nb_Reviews": 1,
          "Date": "2023-01-20T18:46:54.000Z",
          "Titre": "Josh is great",
          "Contenu": "Josh our tech rep is great"
        },
        {
          "Note": 4,
          "Lieu": "AT",
          "Pseudo": "Niclas",
          "Nb_Reviews": 4,
          "Date": "2019-03-01T09:35:10.000Z",
          "Titre": "Great support but not accepting PayPal payments sucks.",
          "Contenu": "WP Engine's support is no short of outstanding: For the past two years I've been with them, I've always dealt with really competent and friendly support guys where nothing was too much trouble. That, for me, always justified the high end hosting pricing. I still have 15 other \"minor\" websites hosted on OVH, which at least do not need the garanties and security provided by WP Engine. And when you come from OVH, you know what it's worth to have someone jump in within less than 10 minutes when you're having an issue. With OVH, you can wait up to 5-7 days until someone shows up to give you a standard copy/paste answer. So I really appreciate WP Engine's support. The price hike though was not necessary I think. WP Engine already offers pricey services (in terms of bandwidth and hosting, their prices are in average 5x higher than other competitors). My website is on autopilot and isn't memory intensive. I also don't use support that much (maybe once every two months). Another negative thing: WP Engine doesn't accept PayPal payments. And for users based outside of the US, this means that we get a $20 conversion fee from our bank on top of the subscription we pay every year to WP Engine. I think it would be fair if WP Engine gave us $20 back in credit if they're not able to offer PayPal as a checkout option."
        },
        {
          "Note": 5,
          "Lieu": "RS",
          "Pseudo": "Valeka",
          "Nb_Reviews": 4,
          "Date": "2023-12-21T14:58:16.000Z",
          "Titre": "Everything you require in a single hosting service",
          "Contenu": "Great service! Always provide prompt assistance. There are excellent and very patient specialists. Hosting is working very well with a lot of useful options."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Raphaëlle Normandin",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T22:47:16.000Z",
          "Titre": "EXTRAORDINARY support, every time !",
          "Contenu": "Every time I needed it (at least half a dozen times), I have always had access to friendly and super efficient support through the live chat. I absolutely LOVE WPEngine! Thank you !!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leslie Rice",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T18:20:40.000Z",
          "Titre": "Always Great",
          "Contenu": "Their chat team is accessible and helpful. I have been working with them for several years and they have always provided excellent help!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Doug Rek",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T17:53:34.000Z",
          "Titre": "The BEST wordpress host. Period.",
          "Contenu": "The user experience is seamless the way a good hosting setup should be (I've hosted with the competition so I know of what I speak). And if you do encounter a problem? Customer support is second to none."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Dave Bellous",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T03:07:06.000Z",
          "Titre": "I had a technical issue and within a…",
          "Contenu": "I had a technical issue and within a few minutes I was on with a very friendly and helpful technical support person who took care of my issue and kept working at it until it was solved.  Friendly and knowledgeable, and resolved my issue quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JF",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T19:45:29.000Z",
          "Titre": "I love WPEngine",
          "Contenu": "I love WPEngine; their support has always been top-notch and their infrastructure is on-point. SuperWebPros would not be where we are without their help!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "dxGW3yla",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T01:34:51.000Z",
          "Titre": "The 24/7 tech support chat is always excellent",
          "Contenu": "The 24/7 tech support chat is always helpful and knowledgeable. Have been with WPEngine for years and glad to host our sites with them!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Cleveland",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T06:35:23.000Z",
          "Titre": "WPEngine is the best",
          "Contenu": "WPEngine is by far the best hosting company I've ever worked with in my long 25+ years of web development.  Their support team is superb and their security, servers, and management dashboard is amazing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T15:29:40.000Z",
          "Titre": "I cannot express enough how satisfied I am...",
          "Contenu": "I cannot express enough how satisfied I have been with WordPress Engine. Thus far, I have nine websites on WP-E and it has been a great experience.The tools available to manage the environments are well documented, easy to use and make it simple to do what's neededAdd to all of this, excellent support with knowledgeable support tech's. Loving it :-)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kat",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T15:44:59.000Z",
          "Titre": "Worrying about my wordpress uptime is a thing of the past.",
          "Contenu": "I've been a WP Engine customer for more than 6 years now. My website is up, running smoothly and secure. Plus, if I have a problem, their tech support is AMAZING."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aaron Miller",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T22:07:32.000Z",
          "Titre": "The best wordpress hosting platform…",
          "Contenu": "The best wordpress hosting platform ever!It's well organized, and easy to use, easy to deploy, and of course supports backup, data migration, and so on.Also it has best support ever. :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rob Moore",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T17:55:46.000Z",
          "Titre": "WordPress experts answer on the first call!",
          "Contenu": "Anna P. went above and beyond to resolve my issue, then explained it to me perfectly so I understood what was happening and can handle it myself in the future. Top-notch service and expert advice is why I use WPEngine, and why I invite all of my clients and colleagues to do the same!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JimL",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T00:37:58.000Z",
          "Titre": "Helping stop a DDOS Attack!",
          "Contenu": "Got a Call from a Support Engineer over the weekend that our site was under a DDOS attack. WPEngine provided instructions on migration to the advanced network. Site was put under attack mode until levels dropped to normal.This is great support - which is hard to find these days."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Hart",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T18:36:03.000Z",
          "Titre": "Technical Support is great",
          "Contenu": "Technical Support is great! I rarely have issues but when I do (usually based on a third party integration tool to my website, Evan and the tech support team are VERY responsive, patient, and detailed oriented to get to a positive result outcome in a TIMELY manner...and oh by the way, I am not very techie so to get results that I am able to fix myself speaks volumes to their ability to walk you through the process. Very satisfied with WPE!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rebecca Olson",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T02:25:05.000Z",
          "Titre": "Worth Every Penny!",
          "Contenu": "I am a small business owner (not a developer) who manages my ecommerce website. Moving to WP Engine has been a lifesaver. On the rare occasion I have an issue the agents are helpful, patient, knowledgeable, and sincerely friendly. I can tell I'm chatting with a human and not a chatbot (or someone just pressing canned responses). Today they quickly helped me troubleshoot the reason my site was so slow (a spammer) and gave clear, simple instructions for how to resolve it. They saved me hours of trying to diagnose the issue. It's a relief to have WP Engine on my team. They are worth every penny."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Anthony",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T22:20:50.000Z",
          "Titre": "Amazing Support",
          "Contenu": "Amazing Support The entire WP Engine platform is top notch, but what really sets them apart is their 24/7 support by very knowledgeable and qualified people.  I would never host my sites anywhere else."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T21:22:05.000Z",
          "Titre": "Best tech support in the business.",
          "Contenu": "I've used WPE tech support on many occasions and they consistently go above and beyond in solving issues and problems. The latest today Claire O. was amazing, as well as Craig H. They took care of an extremely pressing matter and had our site up and running quickly and efficiently. Craig was able to finish up the network settings and everything works like a charm. Their professional demeanor and can-do attitude kept me from panicking along the way. That in itself is worth its weight in gold. WPE is the best!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sam Ingersoll",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T00:22:47.000Z",
          "Titre": "I've been using wpEngine for over 10…",
          "Contenu": "I've been using wpEngine for over 10 years. They have the best technology for Wordpress hosting and excellent support. Not the cheapest but the fastest, most secure, and least hassle. Any business owner with any decent sized operation will save money by using wpEngine."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Raymond Campbell",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T02:12:45.000Z",
          "Titre": "Customer service is at the top of the…",
          "Contenu": "Customer service is at the top of the list for my hosting needs and WPEngine delivers.  Every time I have had a problem I can not fix they have helped me find a solution."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Fink",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T17:53:57.000Z",
          "Titre": "Amazing support!",
          "Contenu": "Support is always super helpful and I have never left a support chat without a resolution plan in place. I would call out names but honestly every single person that has helped me has been great."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Adam Butler",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T15:05:32.000Z",
          "Titre": "Best livechat helpdesk of any host",
          "Contenu": "The live chat help functionality is amazing and the live chat team are always so helpful, particularly for a novice user like myself."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Web Designs Palm Beach",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T16:52:54.000Z",
          "Titre": "What can I say that would deliver the…",
          "Contenu": "What can I say that would deliver the point? WP Engine is the most amazing service in the world. Talking about delivering everything you could possibly hope for .... that's WP Engine. Incredible tech, and the most amazing SUPPORT in the world, and I can't say enough about how good these guys are. It's incredible truly. If your not sure about it, just stop and listen to me, there is nothing else out there that comes close to WP Engine."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristi Collier",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T20:51:57.000Z",
          "Titre": "Terry V was incredibly helpful and…",
          "Contenu": "Terry V was incredibly helpful and fixed my issue without making me feel like a moron.  WP Engine and its support team alleviate so much of the stress of building a website.    WP Engine allows small business owners like me the ability to create a website on my own terms, with the security of knowing there is a team who has your back if you get stuck."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wordpress Developer",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T23:15:48.000Z",
          "Titre": "Best Managed WordPress Hosting platform",
          "Contenu": "As a pretty in the weeds developer, and having worked for managed WP hosting companies in the past, I absolutely love the tools and support WPEngine provide. Their environments, and support tools are 2nd to none in my humble opinion. AND they are WordPress experts... which helps... :D"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "elliot telford",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T19:03:59.000Z",
          "Titre": "honestly makes owning a blog refreshing…",
          "Contenu": "honestly makes owning a blog refreshing and easy, especially after putting many hours into learning the basics on my own. I can't recommend this service enough. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Josh S",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T03:11:20.000Z",
          "Titre": "Great customer support",
          "Contenu": "Great customer support - solved my issue in 5 minutes!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Madrona K- School",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T10:57:07.000Z",
          "Titre": "Darren M was fantastic",
          "Contenu": "Darren M was fantastic. Very helpful. Love the support of WP Engine"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Gurtner",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T22:12:22.000Z",
          "Titre": "Give Terry Y a gold star!",
          "Contenu": "I had questions for our Wordpress upgrade procedures and Terry was super helpful and patient with my questions. Terry also gave me many good support documents to review."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janyer Dominguez",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T20:15:42.000Z",
          "Titre": "Great support 24/7",
          "Contenu": "Great support, I am extremely happy with WP Engine as a managed WordPress hosting platform."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "AM",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T16:23:52.000Z",
          "Titre": "First Class Support Partners",
          "Contenu": "We have a strong partnership with our website hosting partner WP Engine. During the last 12 months we have carried out extensive changes and upgrades to our websites so the content and security is up to date. I can honestly say every time I ask for resources to be on standby when we make critical changes they have always delivered. We also use a content management agency so to have the expertise of WP makes all the difference and provides a level of comfort in case we need to rollback any changes.    If I am honest I have been with the firm 4 years now and WP have never ever let us down. A massive thank you would be down to our lovely account manager joanna ighofose We continue to look forward to working with them in 2024 and beyond (please note this is NOT a sponsored ad but important feedback is given for all their kind support especially from Jo and her amazing technical support team - nothing but professional)  ."
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Felicity Borrelli",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T08:50:42.000Z",
          "Titre": "They know their stuff!",
          "Contenu": "As a relatively non-technical person who is responsible for our company's website I rely heavily on the live chat support service. Talking to someone who knows WP and can fix my issue straight away, or point me in the right direction, saves me hours of googling an often very niche issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julie Kiffmeyer",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T00:25:45.000Z",
          "Titre": "Excellent Support",
          "Contenu": "Their online chat support is simply amazing!  Easy to connect with.  Normal wait time is not too long.  Technicians are knowledgeable and helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shane Baker",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T00:41:26.000Z",
          "Titre": "Tristin and WPEngine support for the win!",
          "Contenu": "Consistently the best support of any business I interact with. Today, Tristin helped me fix a DNS issue I created by accident. She was quick, efficient and methodical. My website issue is fixed and I couldn't be happier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jami Teer-Murphy",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T02:36:49.000Z",
          "Titre": "Daniel L",
          "Contenu": "Daniel L. delivered a GREAT customer service experience for me. My site had gone down due to a rogue plug-in (which I turned off), and to avoid future outdated SSL issues, we updated DNS settings. He walked me through the updates, and together we successfully got my site back up in minutes!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Becky Kilimnik",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T00:56:33.000Z",
          "Titre": "Best customer service on the planet",
          "Contenu": "Best customer service on the planet. I have been using WP Engine for years now and every time I have to contact support it's a pleasant experience. The support staff is knowledgeable, polite, and always fixes things on the first try. I've worked with many other hosting providers with atrocious customer support, and I can attest that WP Engine stands out as a shining beacon towering over the subpar competition. Well worth every penny!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Meshach Weber",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T06:54:13.000Z",
          "Titre": "The best service I've seen",
          "Contenu": "The best service I've seen (and I've been hosting clients for over 2 decades—even fortune 50's). Not since the old Rackspace days has a hosting firm offered such consistently great service, staffed by thoughtful and talented people."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Darren",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T23:11:37.000Z",
          "Titre": "I've used many hosting companies over…",
          "Contenu": "I've used many hosting companies over the years.  These guys are by far the best!  If you run into an issue the support staff know EXACTLY what to do.  I know they are a bit more but trust me its worth it.  Recently I had a domain hacked by Bluehost and my site was stolen and domain taken down.  I spent 5 days working with them to get it back. Every time I contacted support they said \"wait 24 hours and it will be fixed\".  This went on for 5 days with no resolution.  I went to WP engine and they had my site uploaded and running in less then 30 minutes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Courtney Marie",
          "Nb_Reviews": 4,
          "Date": "2023-11-13T22:48:15.000Z",
          "Titre": "BEST Customer Support",
          "Contenu": "Rhiannon was HANDS DOWN the BEST tech support person I have ever had anywhere. She went above and beyond to troubleshoot with me. We had a frustrating situation but she kept suggesting solutions and trying various methods. She is a superstar and WP Engine is lucky to have her on the team. If I could leave 10 stars I would. THANK YOU RHIANNON!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nick Napoli",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T22:58:31.000Z",
          "Titre": "Customer For About 10 Years, Never Leaving.",
          "Contenu": "I've been with WPEngine for maybe a decade now hosting about 30 of my client's websites.  I would never go anywhere else.  Their customer support is one of a kind.  It's special.  In a world with 'virtual assistants' and AI chat bots making everything terrible, their support will help 24/7 with things that will suprise you.  Domain transfers, website errors, plugin updates...they are just the best."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lara Haehle",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T00:20:01.000Z",
          "Titre": "Excellent service and support",
          "Contenu": "Excellent service and support! Not all hosting is the same. WPE helps keep sites updated and protected, and they provide the best customer service and support around. We've been using them for over 8 years for this reason and advise all clients to use them as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Cormio",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T17:01:29.000Z",
          "Titre": "Industry's best support - hands down!",
          "Contenu": "What sets WPEngine apart from other hosting providers is their support team. They are personable, FAST, and go above and beyond their job responsibilities to ensure customer satisfaction."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Chris B",
          "Nb_Reviews": 2,
          "Date": "2023-11-13T23:52:55.000Z",
          "Titre": "Top-notch service and teams.  Highly recommended",
          "Contenu": "I have been working with WPEngine for several years and, not being technical, I will inevitably need some help.  Their teams are top notch, patient and informed.  Very glad I chose them way back when."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barry",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T02:04:45.000Z",
          "Titre": "WP Engine Focused on the Customer",
          "Contenu": "WP Engine is responsive, easy to get to a chat tech person for support, and if the problem needs escalation, it happens quickly. No \"faking it until making it.\" They do not waste your time and are focused on getting things right."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Leons",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T04:44:39.000Z",
          "Titre": "I think you made my day beauttiful",
          "Contenu": "I think you made my day beauttiful. hahahaha... That would be all. If there's anything else I'll popup the assistance. That's it for now. Thanks Evan L you're AWESOME!! Perfect! Awesome Support! Yeah Supercool support by Evan L."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sam Stevens",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T19:22:38.000Z",
          "Titre": "WPEngine is by far the best host for…",
          "Contenu": "WPEngine is by far the best host for Wordpress we've ever used.  We have about 80 active sites with them their range of tools to allow you to easily test, develop, stage, and roll things forward and back is unsurpassed.  But when something does go wrong, you have amazing support.  There is no tier 1 level, its all tier 2 or higher technicians.  Simply the best"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kaiser Design Studio",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T03:12:45.000Z",
          "Titre": "I recommend them to every one of my clients happily!",
          "Contenu": "As a web designer and developer, I've moved as many clients as I can convince over to WP Engine. Their sites are never hacked, lightning fast, and they honestly have the BEST tech support in the industry. Super quick to respond via the chat feature.. no calling in and being put on hold for hours.While the price is much more than places like GoDaddy, BlueHost, SiteGator etc.. it's WELL worth the extra price for speed and security. There are also no unneeded add-ons for security and SSL's that the other hosts charge -- which end up making their prices comparable. I recommend them to every one of my clients happily!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kyle Towler",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T20:55:12.000Z",
          "Titre": "Saved The Day",
          "Contenu": "Support was available, and acted fast. Saved the day!"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Khalid Hussain",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T18:50:41.000Z",
          "Titre": "I'm glad you found it helpful",
          "Contenu": "I'm glad you found it helpful! If you have any more questions or if there's anything else I can assist you with, whether it's related to coding, WordPress, or anything else, feel free to ask. Good luck with your client review, and if your clients have any questions or need further assistance, I'm here to help!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T17:52:37.000Z",
          "Titre": "Excellent",
          "Contenu": "It's expensive, but you get what you pay for. We host an e-commerce site with three language versions and over 40,000 products - all linked to our ERP system. WPEngine hosting and support keep it all spinning for us without problems. Their support people are excellent, and I always get to speak to an engineer who knows what he/she is doing."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Mirela Smajovic",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T15:50:22.000Z",
          "Titre": "Great experience with the support team",
          "Contenu": "Great experience with the support team. Always efficient, knowledgeable, quick and really friendly and on top of that its 24/7."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Natalie Grogan",
          "Nb_Reviews": 2,
          "Date": "2023-10-13T17:01:20.000Z",
          "Titre": "Incredible Tech Support!",
          "Contenu": "WP Engine has hosted my website for 5 years and there have been many times I've needed their support urgently, when my website has been down or compromised. Every single time, they deliver! I'm only medium tech savvy and they politely walk me through what I need to do and successfully solve my problems. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alex Tinoco",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T20:34:14.000Z",
          "Titre": "Best Customer Service Period!",
          "Contenu": "WP Engine is great! Their products and customer service are always outstanding. If you've ever tried to reach tech support in the past with other companies, you know it can be a dreadful experience. I have contacted WP Engine's support team dozens and dozens of time, and the wait ranges from under a minute to maybe a few. The help is always professional and productive. I love working with WP Engine. Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "iKN Spain",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T14:20:45.000Z",
          "Titre": "It's always a pleasure to have the help of the support team",
          "Contenu": "It's always a pleasure to have the help of the support team when you have a problem with your website and you know they will help you solve it.WPEngine is not just hosting: it's a complete service.Thank you for your work"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary Vonnegut",
          "Nb_Reviews": 3,
          "Date": "2023-11-15T01:36:58.000Z",
          "Titre": "The support team at WP Engine is terrific",
          "Contenu": "The support team at WP Engine is ready and able to help with every problem I've encountered with the many websites I run. I recommend WP Engine to everyone who asks me about hosting."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aaron Deimund",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T19:27:44.000Z",
          "Titre": "Amazing response times.",
          "Contenu": "Most times to get third party support, I have to go through some ticketing system and wait for a response. With WP Engine, I just put something in the customer service chat and I get immediate help. I've had some larger issues and some smaller ones, and I've never had to sit and wait for a response to a ticket."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher Kelsey",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T23:51:31.000Z",
          "Titre": "Excellent, Clear Responses Every Time",
          "Contenu": "Excellent, clear responses to questions and efficient solutions. I really appreciate how easy WP Engine's customer support is. (Thank you, Violet, for your help today!)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bobby Cissell",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T23:29:25.000Z",
          "Titre": "WPEngine is hands down the best hosting…",
          "Contenu": "WPEngine is hands down the best hosting provider I've ever used. Their speed, security, and support are unmatched. The staging environments, user-friendly dashboard, and automatic backups make managing websites a breeze. Plus, their specialization in WordPress hosting is a game-changer. If you want hassle-free hosting, go with WPEngine. They've earned every star!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gary G",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T21:26:53.000Z",
          "Titre": "DMARC RUA reports questions",
          "Contenu": "I had obscure questions related to unfamiliar items in RUA reports for DMARC.  I did not set up our site. John P. at Wordpress support helped greatly closing some of my knowledge gap so hopefully I can solve our problem."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Diego Oliveira Sanchez",
          "Nb_Reviews": 2,
          "Date": "2023-11-07T10:46:14.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience. Very reliable hosting, and their support is excellent. Every time I have a technical question I get it sorted super fast. Reasonable pricing and great features! Been a customer for years and love every bit of WPengine"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kenneth Hughes",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T05:23:09.000Z",
          "Titre": "This company has the best tech support…",
          "Contenu": "This company has the best tech support of any company online. No matter how small or complex, WP Engine will either walk you through it or step in to help out. All the reps are top notch. Nick was my most recent support rep I had interaction with. He just stepped in and solved an issue that was causing issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T16:41:37.000Z",
          "Titre": "Jerome was extremely helpful",
          "Contenu": "Jerome was extremely helpful. Our site and dashboard went down and he got it back up very quickly. He also helped answer questions on what went wrong to create the issue and how to fix it so it wont happen again...some theme issues. He also gave me a link to helpful information to get me started."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trent Wolf",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T20:29:01.000Z",
          "Titre": "Where is the amazing button",
          "Contenu": "Where is the amazing button?  James was so helpful and very patient with me... I'm not the best with website stuff and his support was top notch! He helped me resolved our SSL issue in just a few minutes!  A+ for knowledge and kindness!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Katrina Cravy",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T18:21:57.000Z",
          "Titre": "As a small business owner",
          "Contenu": "As a small business owner, I'm not savvy on website back-end tools. There was a critical error on my site and WP Engine's Live Chat was super fast and effective to get my site back up. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Caryn Anderson",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T22:54:27.000Z",
          "Titre": "WP Engine support is helpful, efficient, and patient with newbie me",
          "Contenu": "I've had to contact WP Engine Support a number of times, and everyone has always been super helpful, efficient, friendly, and very patient with me. I'm not a pro developer. I've been helping a friend/client with web content and their tech person bailed. I've been trying to help with updates and such but am a bit out of my depth sometimes. But WP Engine support folks have been great - not just with resolving the technical stuff, but doing so in a way that calms me down when I'm panicking. :) Thanks team!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greg Matthews",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T00:42:30.000Z",
          "Titre": "Out-of-this-world customer service",
          "Contenu": "I have been using WP Engine to support my business web site for 5 years. I have zero technical acumen, so I've had to lean on their customer support more than a few times. It has ALWAYS been incredibly fast, helpful and has never failed to solve whatever problem I had caused. I would never host anywhere else!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristian A.",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T23:30:21.000Z",
          "Titre": "WP is the way to go!",
          "Contenu": "I love WP and their support team. Always helpful, knowledgeable and will go above and beyond. Milo was a godsend in helping to correct my website error. 10/10!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Floyd",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T23:15:45.000Z",
          "Titre": "My site was down hard - and it was my fault",
          "Contenu": "I had a problem with my site that I created. With no access to FTP I needed the support team to intervene and they did - like rockstars. I've used WPEngine.com for years and will never switch hosting services. Amazing platform with amazing support techs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brad Chesney",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T22:03:00.000Z",
          "Titre": "This company changed my view of…",
          "Contenu": "This company changed my view of Wordpress.If you can spare the scratch, these people are worth their salt and will make your Wordpress experience much better."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Visionova HR",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T07:43:43.000Z",
          "Titre": "Tech support was perfect",
          "Contenu": "Tech support was perfect. Dean was fantastic help. Fixed my SSL issue for life. I was using and third party. He recommended a better and less of a headache way. 10mins it was done."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ron Schlangen",
          "Nb_Reviews": 2,
          "Date": "2023-11-16T19:01:34.000Z",
          "Titre": "Excellent support, friendly, above and beyond",
          "Contenu": "I received instant help when I contacted the Support Team.  It was quick, easy and painless.  It sure is refreshing to not have to communicate with a machine or software."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Diana McMahon",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T21:39:32.000Z",
          "Titre": "They have been extremely responsive and…",
          "Contenu": "They have been extremely responsive and helpful with any website issues we have been experiencing. In a world where your website is such a crucial part of your business it's great to have a team that can respond quickly to issues you are experiencing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Merissa Stockton",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T18:57:00.000Z",
          "Titre": "Knowledgeable & Organized Tech Support",
          "Contenu": "Latest tech support question I had was met with a well knowledgeable person who not only helped me brainstorm and research, but gave clear step-by-step instructions for next steps."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Mann",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T01:28:01.000Z",
          "Titre": "Top-notch WordPress Support",
          "Contenu": "Top-notch WordPress support, they've never failed to resolve any issues we've had with our WordPress sites. Unlike some competitors, who won't even look at your site, WP Engine support is always willing & happy to help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joshua Anglero",
          "Nb_Reviews": 3,
          "Date": "2023-10-19T19:22:33.000Z",
          "Titre": "Always helpful and informative.",
          "Contenu": "I have always had a wonderful experience with wp engine. they go above and beyond to help resolve any issue I have. The best part is that, if it is something I don't understand, they have no reservation with breaking it down for me to fully understand!. hands down the best hosting company i have ever worked with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Drew Pearson",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T23:10:20.000Z",
          "Titre": "Jaime was excellent and helped me…",
          "Contenu": "Jaime was excellent and helped me finish getting my site setup! WP Engine support has always been the best, and it continues today."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Farid SanieePour",
          "Nb_Reviews": 2,
          "Date": "2023-10-07T06:52:20.000Z",
          "Titre": "First Experience",
          "Contenu": "Today is my first day using WP Engine, and I'm thoroughly impressed with the level of help and support I've received. The team has been exceptionally professional, kind, and supportive. Their expertise shines through, making me confident that I've made the right choice. Looking forward to a great partnership!"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Earl Gamueda",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T14:41:14.000Z",
          "Titre": "Blake C",
          "Contenu": "Blake C. was very helpful with my issue, even with the maintenance issue that WPengine was having. He had another option for him to assist me with my domain to my site. Awesome guy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aaron Sommerville",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T18:15:51.000Z",
          "Titre": "Top Notch Support!!!!",
          "Contenu": "Michael W was amazing to work with. He was able to work through a complex issue and I am so grateful for Michael honestly. Please give this man a raise and a promotion. I've had some great service at WP Engine but Michael is number 1 by far!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandy Connolly",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T15:32:58.000Z",
          "Titre": "Extremely patient and knowledgeable!",
          "Contenu": "Blake was extremely patient helping me navigate several entangled problems with caching, DNS, Cloudflare, moving a site to the Advanced Network. While I do web development, I don't feel confident navigating DNS issues, and he stayed with me to the bitter end and was quick to respond. I felt like I was the only customer he was helping at the moment.I am very grateful. WP Engine is the best!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tommy Madison",
          "Nb_Reviews": 2,
          "Date": "2023-11-16T04:51:26.000Z",
          "Titre": "The absolute best company",
          "Contenu": "The absolute best company.  I would never choose any other hosting company ever!!! 24/7 support saved my butt multiple times"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alisa",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T07:02:52.000Z",
          "Titre": "Support is there for all your needs",
          "Contenu": "Support is there for all your needs, even when you make a mistake they are there to help & support you. I am new to word press and when I deleted my site Loki helped me recover my backup and was very kind/ supportive. I am a newbie when it comes to creating so it was reassuring to have the help & not be made to feel bad about a simple mistake I made. Best online chat support! I give it two thumbs up!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Sonheim",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T04:47:16.000Z",
          "Titre": "Best support team in the game!",
          "Contenu": "Best support team in the game!I work with a lot of tech software support teams and I can't say enough about how competent, efficient and generally kind this team is. It's the main reason I recommend WPEngine to all my clients."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tanner",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T20:31:31.000Z",
          "Titre": "wpengine has top notch support",
          "Contenu": "wpengine has top notch support. They really apply themselves towards solving your issue whatever it may be. Wpengine has the kind of support you want when something goes wrong."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kaesi Corne",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T03:14:45.000Z",
          "Titre": "Worth EVERY penny!",
          "Contenu": "Worth EVERY penny!Knowing WP Engine has my back allows me to focus what i'm best at web design, but the technical part of web is TERRIFYING. I know the WP engine crew will make sure I succeed in with site launches!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Clif Brigden",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T03:40:37.000Z",
          "Titre": "It's always about the support",
          "Contenu": "It's always about the support. Being able to get a knowledgable, attentive support person on chat any time of the day is, for me, what sets WPE apart. I'm a designer and \"let's see if this button works\" level sys-admin and over the years  have wasted countless hours on other platforms trying to get answers to what are no-brainer questions for WPE support staff. And they do it all without making me feel like an idiot noob. At first I thought their pricing was nuts, but as my client base grew and I no longer had the luxury of spending hours on hold with a budget host, the more of a deal WPE became. I now have 20 sites with them and wouldn't think for a second about moving them anywhere else."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cindy",
          "Nb_Reviews": 6,
          "Date": "2023-11-03T20:36:39.000Z",
          "Titre": "WPEngine is the Best!",
          "Contenu": "We have been with WPEngine for many years and they have the best support staff that I have worked with. Always patient and very helpful in explaining situations and getting issues resolved. They are great to work with!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kurt Lammers",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T19:54:21.000Z",
          "Titre": "WPE has an excellent support team",
          "Contenu": "WPE has an excellent support team, as well being an outstanding hosting platform. I have all of my clients hosted here, for years - and years to come."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Rob G",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T01:25:49.000Z",
          "Titre": "Highly recommend WP Engine",
          "Contenu": "After moving one site to WP Engine a few years ago, I now recommend them to everyone. The 24x7 support is incredible and having a Dev, Staging and Production environment and fully automated backup systems is amazing."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Michael Kay",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T11:35:54.000Z",
          "Titre": "Reliable Partner",
          "Contenu": "I have been a customer since 2014 and will continue to host with WP Engine. Since Day 1 the support has been fantastic and the services offered stable. The TCO is fantastic."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deep Datta",
          "Nb_Reviews": 2,
          "Date": "2023-10-20T19:30:58.000Z",
          "Titre": "The support engineer",
          "Contenu": "The support engineer, Laura - was helpful, knowledgeable, and quick to resolve the DNS propagation issue I had while transferring my site to a new hosting. And this is the norm - their processes and tech support know what they're doing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Braff",
          "Nb_Reviews": 7,
          "Date": "2023-12-21T01:19:00.000Z",
          "Titre": "WP Engine is excellent!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cyrus Drake",
          "Nb_Reviews": 3,
          "Date": "2023-11-08T16:40:59.000Z",
          "Titre": "WPEngine is top tier Wordpress hosting!",
          "Contenu": "I've been using WPEngine for several years now and can vouch for them as the best option for Wordpress hosting. I've used a few other options out there and WPEngine always comes out on top. Their prices are not overly complicated or high. They provide several features accessible from the web for those less tech-savvy folks, as well as ssh if you really need the nitty gritty. Though often times I find myself not needing to do that because the controls on the user portal side are so simple and easy. Also I rely heavily on the customer support which is a quick chat feature on the web. Sometimes it can take 15-20 minutes in line to talk to someone, other times there's no line. You do need to get through the AI chatbot which wants to help you instead, but this is easy to overcome by typing \"support\" and providing your pin. Customer support is always very friendly and attentive to whatever I may need or however dumb my questions may seem. Typically my problems lie with my servers not synchronizing from prod, staging, or dev and this is usually a simple fix on their part. I also love that SSL is built in whenever you need it, making what can be a monumentally cumbersome task become a couple minutes of setup and automated beyond that. Obviously I cannot recommend WPEngine enough and this is in no way a paid review. I am totally serious about my fondness for them and will continue to use them as long as Wordpress is still a major player in the web world. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kelsey",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T19:40:24.000Z",
          "Titre": "Support chat figured out what I needed…",
          "Contenu": "Support chat figured out what I needed and got it done. They were patient and walked me through some complicated things as I was navigating my first migration. Super helpful!"
        },
        {
          "Note": 5,
          "Lieu": "SA",
          "Pseudo": "Korespond Agency",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T10:48:11.000Z",
          "Titre": "Thank you for a seamless tech support…",
          "Contenu": "Thank you for a seamless tech support experience. Part of the reason I stay subscribed to WPEngine is their flawless tech support. Thank you very much. as always, I will continue to support WPEngine and recommend them to anyone I know. CheersAhmed"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ted Bigham",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T23:52:29.000Z",
          "Titre": "WPengine Support is Top of Class",
          "Contenu": "WP Engine and the support behind it has been awesome for my business. I really enjoy the live chat support which is great for my needs. The chat is run by people which is fantastic. WPengine hosting is fast overall and better than the lower cost brands for hosting. Im a big fan and recommend it to others."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Nupur Dubela",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T12:17:09.000Z",
          "Titre": "Thami B is a great help",
          "Contenu": "Thami B is a great help. I am very happy with his assistance.He helped me to get a Multisite option. I was struggling with this for a long time.Thank you so much!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nathan Owens",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T16:33:51.000Z",
          "Titre": "Their customer service truly can't be beat",
          "Contenu": "We've used WPEngine for years, and not only has their hosting interface been easy to use and their reliability been top notch, but their customer service is simply outstanding.  We've had to reach out several times for assistance with various things, and we've never had to wait long for a support tech to join the chat, and they've always been able to resolve our issue quickly and professionally. Their reliability and ease of use makes them an excellent choice for hosting, but their customer service puts them way over the top.  Can't recommend them highly enough."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "N",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T01:36:49.000Z",
          "Titre": "I had a major technical issue",
          "Contenu": "I had a major technical issue, and my support agent jumped straight in and checked it out for me. They did a great job of working everything out, and advising me on solutions! Couldn't be happier!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christine O'Neill",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T23:41:46.000Z",
          "Titre": "Site Environment Support & Site Down Investigation",
          "Contenu": "Worked with L1 & L2 Technical Support Rep's Ronnie & Craig and they quickly and efficiently resolved my issues with my hosting environments. Provided wonderful support, timely responses, resolved issues & provided added training/advice on how I can feel more confident going forward supporting my clients. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Australian by Nature",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T08:11:22.000Z",
          "Titre": "It is so nice to get real service from a supplier.",
          "Contenu": "It is so nice to actually get real assistance from a supplier, they do a great job and happy to recommend to anyone."
        }
      ]
    }
  ]
}