{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "wpfixit.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "IB",
          "Nb_Reviews": 4,
          "Date": "2022-10-21T12:29:15.000Z",
          "Titre": "They will threaten your website",
          "Contenu": "I posted a review 2 days ago, after I was dissatisfied with the service. In essence, I was hoping I could fix a WP issue without STFP credentials. I paid for the service but was told it couldn't be done without it. I asked for a refund and I was offered 100% credit or 50% cash. I was unhappy, so I posted a review that reflected my negative experience. After that, I received over 10 emails threatening my website and business. The senders were both an employee and a manager. My WP credentials were also used by someone to take my website down (i can see activity under my name when I wasn't online).  Here are a few examples of the emails I received:\"You have five minutes to remove your Google review or I will destroy your business online and let everybody know how you do business with others. I can play the same game with your company. Report back when the review is removed and I will stop all actions.\"\"OK!!!Get ready for the pain!!I will spend all day leaving bad reviews for your company.It can all stop as soon as you remove yours.\"\"Here is another and there will be 100s more.  You are wrong and the time I spent here IS NOT free.\"\"OK.  You will get the SAME treatment.Our refund policy was clear and you agreed to it when you made a purchase. I spent an hour here and that time is not free!!!!​I have a massive agenda to kick in tons of negative SEO against your website over the next six months.It could all end as soon as you remove your review.\"I do not recommend dealing with WP fix it."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "NO",
          "Nb_Reviews": 4,
          "Date": "2022-06-02T23:12:55.000Z",
          "Titre": "Incredibly horrible service",
          "Contenu": "Incredibly horrible service. Did not solve issue. But claimed they did.Update: claims to have no record of having done business with you. Requests the 1 star rating be removed. But it stays on as it has been verified. <-- reviewer has been verifiedTake note: beware this unethical business that threatens its customers if they are unhappy with their service. Be sure to check their BBB profile which has been renamed to Wordpress Fixed Now. And trust the other negative reviews."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Jimmy Luw",
          "Nb_Reviews": 1,
          "Date": "2021-10-07T11:13:39.000Z",
          "Titre": "It was a terrible experience with their…",
          "Contenu": "It was a terrible experience with their Speed Optimization service. The speed was even slower than before, and their agent start blaming your hosting provider! I'm with Siteground by the way, which I believe is one of the top hosting providers in WordPress. The ticket agent doesn't even like trained technical people in WordPress, all he did was just play around with the cache plugin. I emailed their office to request a refund, but never got a reply. Will never recommend anyone to use this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "LF",
          "Nb_Reviews": 1,
          "Date": "2021-08-26T17:08:43.000Z",
          "Titre": "There are no words to describe them",
          "Contenu": "There are no words to describe how awful this \"company\" is. They bully, they threaten retaliation, and we've got the emails to prove it. Their customer service is by the far worst of any online company we've ever worked with.The owner is probably going to post a reply to this review saying that we're not customers, that they have hundreds of five star reviews, etc. etc. etc. Or they'll cut and paste their usual reply to negative reviews. Yes, they have lots of positive reviews, and maybe some of them are actually real. But why is the second highest percentage of reviews so incredibly negative? Do yourself a favor and read all the negative reviews and look for the patterns. Then ask yourself why so many people say the same things?There are many services who can fix wordpress problems for about the same price without the headaches and complete lack of professionalism.###UPDATED: Read their reply. No apology, just assumptions and accusations. We're not tarnishing their reputation, we're telling the truth. They do a perfectly fine job of tarnishing their own reputation.As for details, our experience was the same as virtually every other negative reviewer. When you raise legitimate concerns, they reply with insults and threats.And this isn't a fake account, it's a new account we created for TrustPilot. As we said before, just read their one and two star reviews and do your homework. Do you see this many people saying the same things about other companies?###UPDATED: Good, legitimate companies always apologize first for misunderstandings or miscommunication and trust their customers. The customer is always right. Well, that is unless you're working with WPFixit.Again, just read the reviews, their business model is to over-promise, under-deliver, and then harass and bully and threaten. Also, we never said \"the majority of reviews\" — as any literate reader can see by reading our review. We simply asked why the #2 most popular category is 1 star.Potential customers: Please just take the time and read their negative reviews. It's not hard to see how these guys operate.And as for all the five-star reviews, maybe ask yourself if they're using one of the many services where you can buy paid reviews. They're easy to find.###UPDATED: Once again, wrong. They keep repeating lies in hopes their potential customers cannot read. We have not said \"the majority of people are unhappy\" — that's them twisting words, as they have done with so many clients.But why is there such a clear pattern in their 1 star extremely negative reviews?We are happy to provide additional information privately to potential customers of this small business. But we will not reveal ourselves here so that WPFixIt can blackmail us by posting fake negative reviews about our own company, even though they've never been our customers. (thankfully) Yes, sadly you can buy fake reviews for site and others. Just Google it, we did and found several options.And finally, potential customers who might be reading this review, don't you think it's interesting that he said our review and account were fake, but then wrote this?\"These reviews are all fully verified and real because that is the power behind TrustPilot. You cannot provide fake reviews.\"Exactly. And our review is not fake."
        },
        {
          "Note": 1,
          "Lieu": "TW",
          "Pseudo": "Stefano Lodola",
          "Nb_Reviews": 36,
          "Date": "2021-03-10T03:37:17.000Z",
          "Titre": "Failed",
          "Contenu": "They tried to solve my issue, but it didn't work out. Their \"fix\" left my website down with an error.Right now I'm asking for a refund and they're not giving it.In their reply, they're even denying that I'm their customer.They're also retaliating by writing bad reviews about me."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mick S",
          "Nb_Reviews": 9,
          "Date": "2020-06-24T13:34:55.000Z",
          "Titre": "Arrogant US based and slow",
          "Contenu": "Arrogant US based and slow. A Complete waste of time and money - they cant actually do anything with Wordpress - instead they blame it on hosting and insist on access to your hosting site - for most companies that is out of the question when sensitive data is stored there - who would give unrestricted access to this to unknown third parties. They wasted a week of my time and $90 of our money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Barbara Rietheimer Lyngarkos",
          "Nb_Reviews": 1,
          "Date": "2019-04-16T17:52:44.000Z",
          "Titre": "They worked on my site and showed me…",
          "Contenu": "They worked on my site and showed me that it was faster via a report generated from GT metrix.  In reality, the site is not faster, as seen from subsequent reports from GTmetrix.  They were not interested in discussing or helping to fix this. I feel like I threw my $87 down the toilet.  They take one pass at your site and you have no input on the results or recourse if you are not happy. They don't even give you the option to purchase additional assistance.  And to boot, they were not very nice about it.   Buyer beware."
        },
        {
          "Note": 1,
          "Lieu": "RO",
          "Pseudo": "Remus Costin",
          "Nb_Reviews": 2,
          "Date": "2020-05-22T10:56:04.000Z",
          "Titre": "An incompetent developer nest",
          "Contenu": "A low rated company, after pointing out all the flows that they have, they simply blocked me from their FB group and from their website. I would not advise anyone to interact with a company that simply blocks constructive negative feedback."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Charles C",
          "Nb_Reviews": 3,
          "Date": "2019-10-28T16:51:29.000Z",
          "Titre": "Stay Far Far Away",
          "Contenu": "Stay Far Far Away - Nothing but lies and scamsI had hired wpfixit while on vacation due to a site being hacked. Granted one of my 30 addon domains had this issue. The exact same day and time frame I allowed wpfixit access to ftp every other addon domain was infected with the same exact folder and files. I thought nothing of it til I had all 30 addon domain clients contacting me complaining they have had issues.My host finally confirmed and removed all the infected files this company installed. Just like everyone else with a negative review, they attempt to tarnish your search results if you write a negative review. Save your money, these guys will take full advantage and destroy your websites."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dawn",
          "Nb_Reviews": 4,
          "Date": "2019-01-24T03:54:27.000Z",
          "Titre": "Terrible Customer Service",
          "Contenu": "I just received terrible customer service from Jay (I'm told he's the boss, but he's not the owner, so there is someone above him) at WPFixit. I'm still going to try to find a contact for someone above him, but I doubt now I will. I tried chat to find someone and she literally told me \"sorry can't help you\". I want to post here because I want to warn you all not to go there for help with your site. The amount of time I've spent with him is more than I would of fixing the problem myself. Do NOT go there for help.They didn't even solve the problem, I did after to deleted their access to my site.  I have screenshots of the entire conversation."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Coen",
          "Nb_Reviews": 3,
          "Date": "2019-12-14T22:09:01.000Z",
          "Titre": "Payed, no service.",
          "Contenu": "Bought the service that the woman in the live chat told me I would need for my specific issue, did not get the service, and it was hard to finally get a 50% refund. I got really angry since after talking to 3 people and sending several messages, each time they were only saying it is my fault for not reading their website texts. I had spoken about this issue in live chat, the least they could do is provide a full refund, but they didn't care about my experience.This company seems to have the rudest mentality I have ever experienced.Since I published a review about them, they have been harassing and threatening me and my company with some serious stuff. Seems like a strong way to manipulate review score."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Sebastian",
          "Nb_Reviews": 2,
          "Date": "2020-01-23T16:47:00.000Z",
          "Titre": "Worst experience ever! They don't know what to do.",
          "Contenu": "Worst experience ever. They could not solve our issue within 3 days and after file transfer terminated we had to search for someone who knows what to do. We got our website cleared within 2 hours with another company then. Ridiculous. There is no 24/7 support as they advertise as well. As we are from Europe, we always had to wait the whole day for them starting to work on the issue. Better stay away.Edit: As the owner of the company tries to delete this review, saying I am not a customer, I can provide the Invoice with number 5881. All the conversation within the ticket on their website is shot as well. And now they started sending e-mails threatening us with bad reviews etc. People, really stay away from a company which behave like this."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andi",
          "Nb_Reviews": 1,
          "Date": "2019-10-06T02:59:56.000Z",
          "Titre": "A very nasty person and company!",
          "Contenu": "A very nasty and unfriendly guy decided to harass and send my friend threats for a negative review Be warn they're not good people. All nice and friendly before they get your money, and then a total harassing rude nightmare when they do. If they cant fix it they won't refund you. Find a better business one that doesnt threaten your website with bad reviews if you dont remove yours. Also they will bash your website, post your website to say \"beware\" they claim they're filling police claims due to you putting a negative review. (Are you serious cant ha dle a negative review what children run this company?) They're just parasites. Wouldn't put it past them to make all these fake positive reviews themselves."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "GMS INT",
          "Nb_Reviews": 1,
          "Date": "2019-10-28T09:04:57.000Z",
          "Titre": "Avoid at all costs!",
          "Contenu": "WP Fix It should be avoided at all costs. Their work: They take short cuts, and often break things to get the fix you are after. Their morals: They create back doors to your website so they can access it illegally. If you complain or ask for a refund, they will threaten you or delete your site completely. They have done this to countless people.Their responce to compaints: If you leave a negative compaint on here, they will seek to destory you. Look at other 1 star reviews and reviews on other sites and you will quickly understand how this company operate. They use Trustpilot to blackmail people.What you can do: If you are blackmailed for your trustpoilit review, compain to trustpilot support. If WPFIXIT hack your site report it to the FBI as this is a federal offence."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Veritas in Vino",
          "Nb_Reviews": 26,
          "Date": "2021-01-15T02:55:23.000Z",
          "Titre": "Had a very odd experience with WPFixit",
          "Contenu": "Had a very odd experience with WPFixit. After paying they quickly assigned someone who asked for all my login details, I provided them and off he went. 1 day. Then he seemed to want to close out my ticket but I hadnt had time to check and had a few questions. Then he went silent. Then I couldnt access my account. And suddenly he resurfaced saying he never received anything these past few days. All I can say is either they have a major tech issue OR just playing games and unprofessional. As far as work goes, he improved my site but also left one thing broken which I now need to sort so will give then benefit of the doubt and add another star. Final update: after writing to them 20 times to find out what happened NO ONE got back to me, which of course is very rude! I also just checked my GTMetrix and my performance declined from D to F!!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Greg Maurath",
          "Nb_Reviews": 1,
          "Date": "2019-03-08T04:14:38.000Z",
          "Titre": "DO NOT TRUST",
          "Contenu": "DO NOT TRUST. THEY ARE ASKING FOR PERMISSION TO ACCESS WITHOUT VERIFICATION. WANTING TO TELL YOU IT TAKES 12 HOURS TO DO SOMETHING THAT REALLY ONLY TAKES 10 MINUTES"
        },
        {
          "Note": 1,
          "Lieu": "KR",
          "Pseudo": "Youngdo Kim",
          "Nb_Reviews": 1,
          "Date": "2019-07-11T00:41:19.000Z",
          "Titre": "Different response time & attitude before/after purchase.",
          "Contenu": "Had issue with website server. Took extremely long to respond on an urgent matter, so I requested a refund but said they couldn’t issue one. Difficult to believe that many people are satisfied with their service. Very prompt and kind until you purchase the ticket, but very slow and rude after the purchase or at refund request.Update - Email I received after posting the review... Great customer service:HelloNo way will we be returning any portion of your payment because of your review on TrustPilot.  Furthermore we will be starting a massive negative SEO campaign against the site at bastetpalace.com because you wish to tarnish our reputation simply because you do not agree with our refund policy which you did when you made your purchase.All this can end and refund when you delete your review and send confirmation of this.   The 1st 24/7 WORDPRESS SUPPORT COMPANY!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Brandon",
          "Nb_Reviews": 1,
          "Date": "2020-07-25T02:44:33.000Z",
          "Titre": "The worst customer service I ever…",
          "Contenu": "The worst customer service I ever experienced. I was asking some general questions about their policy and interested in using their service to fix an issue on my Wordpress account and the guy on the chat got really aggressive and rude saying that I was making things complicated, practically calling me stupid and incompetent and said I’m high maintenance and didn't want my service. Ive never been so disrespected when I was just asking a few questions. I’ve reached out to the manager addressing the way I was treated and he too got rude and aggressive over our email conversation and refused for me to speak to his superior and said they dodge a bullet after I refused their free service, based of what I experienced and repeatedly being disrespected and my phone calls ignored. this place lacks a sense of professionalism and I would not trust giving them your account information !!! I reached out to the ceo and he to failed to contact me.  BE CAREFUL!!! LOOK AT OTHER REVIEWS! DO NOT RECOMMEND USING THIS COMPANY!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Trevor",
          "Nb_Reviews": 3,
          "Date": "2019-05-23T21:39:20.000Z",
          "Titre": "Absolutely the worst service I've ever…",
          "Contenu": "Absolutely the worst service I've ever received on anything.  When I posted my problem, the tech first told me my problem was with the PHP version and closed the ticket without actually resolving anything.  After arguing with him and showing him proof I was running WP5.2 and PHP 7, he eventually shared a screenshot saying my server was running PHP 5.4 - but it was the WRONG URL!!!  It wasnt' even my website.  When I told him this, he refunded my money and said it was impossible to help me because AWS setups are a nightmare to troubleshoot.  When I asked him again to check the URL, he replied \"We have issued a full refund.  We can not help you any further.\"  What a joke.  I'm sure they have a great service if you get the right tech, but this guy is clearly not a capable technician.  I guess you roll the dice on this sort of service, but I wish I could have gotten the help I need.  I guess I'll stick to using Fiverr.com--Edit:  Coincidentally...  Our site was attacked and trashed just moments after posting this review."
        },
        {
          "Note": 1,
          "Lieu": "CH",
          "Pseudo": "Maxim Haag",
          "Nb_Reviews": 1,
          "Date": "2020-01-04T15:53:00.000Z",
          "Titre": "Absolutely avoid this company",
          "Contenu": "Most of the good reviews on this site are certainly part of the manipulation of this company. I advise you to absolutely avoid working with this company, they show a beautiful side but concretely it is only wind and theft. I will briefly tell you about my experience.The technician with whom I spoke was very bad faith, rude and aggressive for no good reason. I asked him for explanations about his work which was totally inconsistent, he did not want to give it to me and insisted not to give it to me. I finally gave him access and he immediately changed the password by blocking my access to all of my hosting, again without any reason. For security I restored all my sites to previous versions because according to the opinions of other people, they would install viruses on the installations to create accessible breaches.Then the strategy of WP Fix it is to offer you a 50% refund if you are not satisfied, they are certainly used to it and therefore collects 50% all the same having provided a catastrophic and sometimes completely illegal service as in my case. It is a huge sham that I advise you to avoid at all costs. Hire a freelancer who can cost you even less on fiverr.com, toptal.com or freelancer.com, ... and make a good job."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Aradia Willow",
          "Nb_Reviews": 2,
          "Date": "2019-01-28T19:20:38.000Z",
          "Titre": "Not recommended",
          "Contenu": "Long story short Jay was good at first, and then messed up my site, I had to use up all my credits I bought to fix his mistake. His responses were condensing and it sounds like a theme with him. If you look around you can see many reviews with same type of bad experience as I did with Jay. EDIT: This company's response has actually been quite scary. They have decided to go after me personally and my business instead of address any of my concerns (or heaven forbid apologize). If you read other responses to bad reviews you can see how they go after the reviewer. And they seem to have no problem completely making things up. I didn't ask for a refund, I just decided not to work with them again. And I certainly was never vulgar with them.  Only because I had given a previous review I wanted to update my response to warn others.  I seriously can't believe their response. If you read through their responses to negative reviews you can see clearly how they turn to slander in attempt to get people to take their reviews down. Then today I get an email through my website from someone saying they wanted to do business with us but found the response on this site and now have concerns. Huh? Do you usually email massage therapy studios to tell them you don't want to work with them after reading a comment for a wordpress business? Me neither. This situation has gone from annoying to totally bizarre. I hope people can research and read their responses and see the very obvious."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Paula",
          "Nb_Reviews": 2,
          "Date": "2020-01-30T16:08:57.000Z",
          "Titre": "Disappointed with service from WP Fix…",
          "Contenu": "Disappointed with service from WP Fix It. Original work order - speed fix my site - was swift and efficient only to find a small issue (found two days later) introduced after work was complete. Company was not even prepared to investigate the possibility of an issue without me paying more. The technician even threatened to reverse work he  had done. I found him defensive and reactive. It could have been so easy for them to say - 'Just give me 10 minutes on your site to explore and see what we think.' But a straight out - this wasn't our fault, seems so unprofessional. I do not recommend this company due to a lack of concern for their customer; not for works completed.  #consumerprotection #wpfixitfast @wpfixFurther to wpfixfast reply - I don't think a company can categorically state they didn't cause a new issue (just 48 hours after they accessed my site) without even offering to jump on the site and take a look. This to me is unprofessional and yes, I do not expect to pay for an investigation of an issue I feel is very likely due to the initial 'fix'. This is just what a professional service looks like to me.Jan 30, 2019 (I was just notified that WP Fix IT have now edited their reply and offered to correct the situation ... 1.5 years after my initial review). I think I will leave my review as is. A year and a half later, my site has long since been fixed but NOT by WP Fix IT. Perhaps they have since improved their customer service. I hope so."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Just a Dude",
          "Nb_Reviews": 1,
          "Date": "2020-01-11T00:26:11.000Z",
          "Titre": "Rude",
          "Contenu": "Very rude! The way they talk to people is just not right."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gigi Griffis",
          "Nb_Reviews": 1,
          "Date": "2019-03-26T14:27:52.000Z",
          "Titre": "Absolute WORST customer service I've…",
          "Contenu": "Absolute WORST customer service I've ever encountered. They broke my website and didn't even perform the service I paid for - and then they all-caps email shouted at me when I complained.I hired them to do a site speed up service. At first, all seemed well. They sent me screenshots that seemed to indicate the site was going faster. Great.Two days later, I noticed that ever since they updated my site, my Google traffic had disappeared. When I contacted them about the issue, they claimed there was no way it could have been a problem they created, even though it happened on the day of the service.I spent hours of my own time figuring out that they'd somehow broken my analytics code. My code is tied to my advertising network, which means I lost income during the 2.5 days between their service and my fix, in addition to the time and frustration of spending hours fixing what they broke and being talked down to when I suggested that they were the ones who broke it.Finally, irony of ironies, I checked my site speed via Google's speed checker and...it's the same speed it was before they got in there. So not only did they break my site and cost me time and money, but they didn't even speed up my site! I reached out to customer service to try and get a refund and they didn't seem to even read my emails. They just kept sending irritable responses telling me I had to deal directly with the person who'd broken my site (who had already been testy with me and who I never wanted to deal with again).Absolutely do not use their service if you value your website. This company does not give a crap about your site or you as a person and if something does go wrong, their customer service will just yell at you about it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Harry",
          "Nb_Reviews": 1,
          "Date": "2019-10-14T18:49:28.000Z",
          "Titre": "This service is a joke. And they will retaliate if you post negative reviews",
          "Contenu": "This service is a joke. The agent was rude, unprofessional, and incompetent. Midway through the left me hanging telling me he was going for a coffee. Then he simply submitted a ticket to Gravity Forms and told me to wait for their response. Oh yes, and he said I was \"high maintenance.\"After posting this review I received the following messages from the company:Re: [The Agent] has updated your support ticket...WP Fix It Support  Mon 09.23.2019 5:32 PMTo:  You can forget any other help here and I will be starring a massive negative SEO campaign on your site (XXXXX) because ofyour review. Remove the review and I will stop all actions. Got 10 minutes.--- Re: [The Agent] has updated your support ticket...WP Fix It Support tickets at wpfixit dot comMon 09/23/2019 5:41 PMTo:  Here is the first of many I will plaster the web with.https  www dottrustpilot dot com review xxxxxxxx---And 2 more similar messages.---Then finally someone at the company changed my login information:Hi harry,This notice confirms that your email address on WP Fix It was changed to xxxIf you did not change your email, please contact the Site Administrator atsupport at wpfixit dot comThis email has been sent to xxxxRegards,All at WP Fix Ithttps: wpfixit dot com---Midway through our session, the agent took a 10-minute coffee break:From: WP Fix It Support  Sent: Monday, September 23, 2019 4:08 PMTo:  Subject: Had to step out for a moment... Hello HarryJust wanted to apologize for the extra wait here. I am not currently at my desk right now because I stepped out for some strong coffee to keep me going but I will respond in detail and carry on with your support ticket as soon as I return which will be very shortly.  No need to reply to this message or your ticket as this email was an auto reply to let you know I am not available and you will receive it again if you reply.Thank you for hanging tight on this and I can not wait to get back and carry on with your questions and support request!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Catherine",
          "Nb_Reviews": 4,
          "Date": "2019-05-11T20:29:08.000Z",
          "Titre": "Something was seriously off",
          "Contenu": "I engaged this company to help me with a plugin that was significantly slowing a wordpress site. I started with the basic plan as I had read all the services and it seemed to fit. I was promptly advised to pay for a more expensive service, which I did. The agent was really very rude, but I figured he might be having a hard day or something and carried on with the services. Next he asked for my hosting credentials which seemed a little off. I gave it to him trusting the reviews I read were spot on. Next he informs me that my hosting company is \"the worst\" and that I should change it to another one where I, no surprise, I get a great deal if I use their coupon code. NO THANK YOU. I call my hosting and do what he told me to do, and next thing you know, I have a security warning screen and my site is TOTALLY GONE. He, again with a lot of attitude, informs me that this is my fault and he can't do anything until it is back online. But I had literally only done what he asked. Next, I find out that my IP address had been changed, WEIRD. I am now on my 4th call to my host trying to undo what he has done and when I asked for a refund, I was told I could have 50% back of the more expensive plan that they sold me to no fix my issue. DO NOT ENGAGE THIS COMPANY.EDIT POST REPLY:It appears that this company also bullies after being reviewed poorly. I run a tiny internet shop that is focused on being a good person and putting out good vibes. Reviewing our interaction, there really is no reason for him to continue to come after me. The profanity he refers to is the following comment \"Is there anyway we can talk on the phone? I for some reason have given you the impression that I am an a**hole, but I am totally not. I am just worried about how long my shop has been down\". The worst part is that after I honestly answered a survey on the site that my experiece was \"Not Good\" he replied to my ticket  \"Game On!!!\". I feel scared for the integrity of my online business, is that really a company you want to ask to help?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel Mitchell",
          "Nb_Reviews": 1,
          "Date": "2021-02-11T19:59:56.000Z",
          "Titre": "CAUTION!!!",
          "Contenu": "CAUTION!!!WP Fix It  is HORRIFIC!They broke the site... We still cannot log in to WordPress after Wp Fix It broke it, and now threaten me and lie about me being rude and how good they did. They lie & the facts remain.AVOID!*** THEY ALSO shared my log in user name and password to my hosting company on a public forum. This database contains protected information and revealing as they did is in violation of federal laws. Agreed... STAY AWAY!  Lori Wagner - APRNHired them to speed up my WordPress site.In trying to speed site, they corrupted the PHP login (which prevents you from logging in to your site)Then offered to sell me a security product that would “stop hackers”.When I contacted them, minutes after they logged in to work on site… this is the reply I received.. trying to blame hackers or my hosting company.”On Tue, Feb 2, 2021 at 10:49 AM WP Fix It Support tickets@wpfixit wrote:Well, I really think your hosting provider made changes…The only other explanation maybe that your site is hacked. Your hosting provider accused us of changing PHP, so please let them investigate this. They should be able to check logs etc. If your site is hacked, we offer also a Malware Removal Service, which you can order below: They only got rude from there… then they deleted my account on their site to try to hide their tracks.CAUTION!!!This is the first time I have EVER left a bad review for any company.Worse experience I have ever had in 30 years of hiring people to work on dozens of websites.STAY AWAY!*** Follow-up:1 hour after my reviewand now… they just sent an email threatening to post many reviews online related to me personally and the site they destroyed, if I don’t remove my honest, 100% accurate review of my experience.This company is an absolute nightmare.UPDATE... I appreciate the emails they shared as it verifies some of what I said but they conveniently omitted the emails in the link provided that threatened me... and tried to sell me additional products and also showed that they logged in but couldn't after 15 minutes of \"fixing site\"  (not hours like they said)Also.. please note: there was nothing combative about any of my emails.. I remained calm, professional and asked for help. Even after they tried to scam me, upsell me, broke my site and then threatened me.Simply the worse!AVOID!"
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "London Media",
          "Nb_Reviews": 4,
          "Date": "2020-01-27T09:25:40.000Z",
          "Titre": "This is a live chat with wpfixit:",
          "Contenu": "This is a live chat with wpfixit:Hi...my name is ****** and I did receive what you just sent. Before we connect live, can I have your first name please?nathan27 minutes ago*****Thanks nathan 😎 Please give me a sec to jump on this chat and get all your questions answered.sure27 minutes ago*****Hello. How can I help?i see you speed up cpucorrect?26 minutes ago*****We have a speed up service.We can jump into action right now making your site as fast as possible. See full details at im having an issue with my wordpress site that every time someone loads the site the cpu jumps to 100i scaled the server to double and still the issue persists25 minutes ago*****This service will correct that.what im trying to say, there must be an issue, not just general cpu speed up. Is this also included?25 minutes ago*****Yes. We will correct CPU issue and speed up the site.and is there a money back garauntee?also my site is live so can everyhting done first on staging site?24 minutes ago******No need. We will fix the issue and speed up your site. We do 100s of these every week for 10 years now.If you want staging and then live you need to pay twice.Also you can not optimize a staging site. We work on live site.im just worried, you understand? i dont know who you are and its a live site that we spent months building22 minutes ago*****There is no down time.ok thanks22 minutes ago*****Is there anything else I can help you with?any money back garauntee?any speed garauntee22 minutes ago******Did you see my reply before?like you garauntee the site will load and navigate in ... sec21 minutes ago*****It’s impossible to know the end speed load time before the work is done.Every site is built and hosted differently.so really i can pay 50 bucks and you work and then come back to me and say works done - and the speed is half second betterthats not secure20 minutes ago*****I think we will pass on this. Good luck.ok i see your not the pacient normal person i want working on my sitethats not how you do business19 minutes ago******Not that at all.your an isiot. I TREAT MY CUSTOMERS LIKE GOLD!!!and thats why im running 5 succesffull companiesi just dont understand to tech.have a good night18 minutes agowhats the delivery time from purchase?anyone there?so your ignoring me... ok this is going on trustpiloti opened a different chat under a diff name and she responded. So she IGNORED ME! That is bad service to be honest!!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Moritz",
          "Nb_Reviews": 18,
          "Date": "2020-12-28T22:03:13.000Z",
          "Titre": "Consider this",
          "Contenu": "I have used many digital services for my business. This seems to be one of these companies that have shiny marketing (even the owner sends you personalised videos) but once you purchase it's chaotic and simply rude. I spent $147 to get my website speed improved. After the purchase, you get an email asking you to supply your WordPress login data (I made another admin account for them). I submitted this right away via a simple web form.You then get a series of emails explaining how 'easy peasy' everything is. I was able to log into my account and download my invoice. The account overview looks decent.The 'ticket' section, however, didn't allow me to log in (password not matching). There is no password recovery option. I sent a manual email to reset. A representative rudely replied \"I sent you an email about 3 hours ago and you did not follow what it says.  You will not have an account created until you do this.\" I tried to explain to him that I DID have an account - how could I have otherwise downloaded my invoice? I even attached screenshots.It went back and forth a few times until he wrote \"You will not see any tickets because you have not created a ticket yet. You have to follow the instructions in the email that was sent to you twice in order to create a ticket and create an account.\"I have no idea which email he refers to.It's still a mystery to me why I have to create any ticket at all when I have bought a simple service. Why can you not just deliver what I've paid for?Anyways, after maybe 10 emails I've had enough of his incompetence and unwillingness to help. No work had yet be done so I requested a refund. I was sent a link to their 'refund policy' and guess what... it asked me for a ticket number! So I went back to the very first email and did the whole process again and somehow managed to create a ticket number. After supplying the ticket number I was given two options: 50% money back, or a voucher.This is totally unacceptable. You are keeping your customers trapped. Every decent company is transparent from the start about how to stop a service and request a refund.Shortly after I received an email that my login details have been changed to an email that is not my own anymore. (xxxx AT yyyy.dispute) . Now I am locked out.I reached out to PayPal to escalate the issue there. In the reply of WP FIX IT I was threatened with legal action \"This request is fraudulent and further pursuit will result in legal action.\"Now I am locked out of the account, I cannot reset any password and I'm being threatened on PayPal.WP FIX IT will probably refer to their small print in the T&C's when replying to this message. I can only say that I am utterly disappointed how a company that seemed so capable on the outside turned out to be the exact opposite after they have taken my money. I will continue trying to get my money back and will update this review when I know more."
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Juliette",
          "Nb_Reviews": 1,
          "Date": "2018-09-07T20:57:53.000Z",
          "Titre": "Horrendous experience with one particular agent",
          "Contenu": "I recently had a horrendous (and frankly, quite unbelievable) experience with WP Fixit.  Unfortunately I found my assigned agent to be rude, pushy and not the slightest bit interested in providing customer ‘care’. I tried to explain 5 times what I needed done (as evidenced by the transcript), but this agent refused to respond to my request. Instead, he made a ‘fix’ that I did NOT request and ultimately left my site in a worse condition than it was prior to his supposed help. I've since had to hire another developer at a cost of over US$200 to fix the damage.As soon as it became obvious that the agent’s work was causing more issues on the site and that he was not taking time to understand my actual problem, I asked him to stop working and to please provide me with documentation on what he had done, so that I could hopefully remedy the worsening situation. At this point the agent quickly closed the ticket so that I could no longer communicate with him. He failed to provide me with any explanation or any documentation. And I could no longer access my site. After contacting my hosting provider, it turns out that this agent had deliberately inserted some code into the .htaccess in the root directory to cause a 500 Internal Server error.  My host had to remove this code to allow me to access my site again.  At first I couldn't believe that the agent would have sabotaged my site out of spite, but after reading reviews about him on another site, I absolutely believe that he did.  What’s more, when I contacted ‘support’ to make a complaint and ask for a refund, the attitude was similarly rude and nasty. Despite a courteous, detailed email from me explaining the situation and offering evidence to back my position, ‘support’ was clearly not interested and fobbed me off in two short sentences. The email wasn’t even signed – just a rude, anonymous message that I wouldn’t be getting a refund.When I asked for the name of a superior who could help, the reply was just ‘I am the boss. No-one higher.”I have used this company in the past and had excellent service from other agents. I was shocked and distressed by this recent interaction and won’t be using the service again. I still don’t have a refund, despite the damage that was done to my site and additional cost of getting it rectified.I have tried to contact the owner to report this agent's criminal behaviour but haven't had any luck as yet.IN RESPONSE TO WPFIXIT'S REPLY BELOW:  Unfortunately it appears you've confused me with another customer.  Contrary to what you say below, I have only ever been decent and polite in my communications.  I have also never asked or expected any work to be done for free.  Nor have I EVER been given a refund or asked not to use the service again.  I have seen the exact same response given to another customer on another review site so suspect that you have me confused with them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tanya Carter",
          "Nb_Reviews": 1,
          "Date": "2018-12-05T02:49:33.000Z",
          "Titre": "They broke our site and refuse to help fix anything.",
          "Contenu": "I purchased the speed up service a week ago. Before work commenced, I stated that this was a multisite, and that we had a special setup involving redirect code, and that any time of caching (historically) would break that code. After work was completed, our site was completely broken. We were told the site was faster, but users are getting random 404 errors on pages that definitely exist, getting random 502 timeout errors, https:// urls are redirecting to http:// and giving insecure content warnings, and worst of all - none of the sub sites within the multisite are accessible at all, not front end nor in the admin dashboard. The service technician refuses to fix the problem, and continually blames our web host (WP Engine), saying our server must have \"infections\", and that it's not his fault or his problem. When I asked for a refund he refused. When I asked to be placed into contact with a supervisor, he said he was the supervisor. When I asked to be put into contact with the manager, he said he was the manager. When I asked to be put into contact with the owner, he refused. Now we are forced to restore our site to a backup from a week ago, which means we lose content and woocommerce order data, which costs us even more time and money. This is absolutely ridiculous, and certainly the worst customer service I have ever experienced in my life.IN RESPONSE TO WP FIXIT'S REPLY:Every time I described the issue, the agent alternately kept saying \"this is not our issue - your server is full of infections, this is not my fault\", then would turn around and say please describe your problem so I can look at it\". After a week of this I am done. The site is broken as a direct result of what the technician did. No other work was done during this time. He has stated he cannot fix it. He has refused to issue a refund. He refused to put me in contact with anyone of higher authority to discuss the issue. There is absolutely nothing inaccurate about anything I said, and I am happy to share the full ticket transcript with anyone who would like to see it.Direct quotes from the service agent on the ticket - \"That issue has nothing at all to do with the work I completed.\" - \"Please ask your host. None of my actions are related to your issues now. Ask your host. They are are a very difficult host to run a site on. So many limitations. \" - \"I am sorry but even if I reverse all that was completed and put in a default .htaccess file, multisite still does not work. There are also some infections in your account. You will need to work with host to correct.\" - \"I spent 3 hours on your site this morning and no matter what multi site will not work. You have bigger issues. You also have infections on the server.\" - \"You can even turn off every single plugin on the site and multi-site still will not work.\" - \"Refund is not happening. I have spent about 7 hours on this ticket and sped it up and provided proof of that. Have the host scan account for infections and you will see. I am simply reporting what I see and what I know. I do this all day every day for 10 years now.\" - \"Not happening. More than happy to help fix what you see broken and I have reported to you that site is infected and multi site issues have nothing to do with my work. Why don't you restore site to before work and we can go from there with starting over. That will still not remvoe infectiosn though.\"....and on and on and on....The fact remains that the site worked just fine (slow - but working fine) before you did any work - now it is completely broken. I gave the technician examples of what was broken several times, and kept getting the same answers over and over. So please don't put the blame on me for not accepting help.IN RESPONSE TO WP FIXIT'S 2ND RESPONSE:Wow...very professional.  Write a bad review of WP Fixit, share the details of the service ticket to back up your review, and get your company bad mouthed.  No, \"we're sorry you had a bad experience, let's find another way to help you\", no \"we did what we could, if you are not satisfied we'll stand by our policy and issue a refund\".  Just a total flat out denial, lying about our refusal to tell them the problem when I did several times, and a public sharing of our private customer details.  Then they have the temerity to tell people not to purchase products from our site.  Again - anyone who would like a copy of the complete and whole transcript of the service ticket so you can judge for yourself, I am happy to share it!   Good luck to you all!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John W",
          "Nb_Reviews": 10,
          "Date": "2023-04-12T20:12:06.000Z",
          "Titre": "Used the service several times",
          "Contenu": "Used the service several times. There is a major issue that everyone should be made aware of. Regardless of what they say, their ability to fix things is necessarily very limited. They will swoop in and fix a symptom, but not a core problem, so don't expect anything more. In addition, they will not try to solve a problem in the context of the site and can - and did in our case - screw up more than they came in to fix. By blindly optimizing our WP site, they configured the plugin of *their* choice incorrectly for the site's needs and it literally cratered the site, putting us out of business for an extended time period. Further, they took NO responsibility for their lack or preparation or the consequences. Zero. It resulted in nearly $2000 in repair work that was essentially a rebuild. Very small, inconsequential issues is what they can fix, but DO NOT entrust them with anything more than that."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Eric Palazzolo",
          "Nb_Reviews": 2,
          "Date": "2021-01-16T18:28:52.000Z",
          "Titre": "Incomplete Job and Poor Customer Service",
          "Contenu": "Support agent implemented a bandaid fix which could be responsible for the \"white screen\" error received shortly after. When looking for further support on the same issue it was dismissed and inadequately explained to me. Initial support was decent but the follow up was quite poor. Will not be using this service again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Meaghan",
          "Nb_Reviews": 1,
          "Date": "2019-06-26T03:07:40.000Z",
          "Titre": "It states on the front of their website…",
          "Contenu": "It states on the front of their website that it's free, then the person in the chat asked for all of my login info and contact info, then said that I had to buy a subscription because the error was going to \"take hours\" to fix. I said no and went to the web host (Host Gator) and they fixed it (for free) within a minute. I'm SO glad I didn't buy the subscription to WP Fix It."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Carrie Murphy",
          "Nb_Reviews": 1,
          "Date": "2019-08-16T23:04:10.000Z",
          "Titre": "BLACKMAIL Rude and unethical",
          "Contenu": "My issue was fixed for a day, then returned. When I asked them to fix it again (same exact situation and error message) under the same ticket, they refused (incredibly rudely). It's one thing to require a new ticket (which I could have easily accepted and moved on), but the language and phrasing was unacceptable. They then contacted me and told me to remove this review or they would remove my site from Google (and the internet). They continue to edit their reply to this review with libelous information about me, including that I harassed their online chat representative (which didn't happen). Exact text of email I received after posting a review about the rudeness of the reply: \"REALLY!!!!!!  i will make this site disappear from Google unless you remove your review now!!!!!  you have 10 minutes.\" Because the tech, \"Jay,\" still had access to my WordPress password, he removed my site for a period of about four hours until I was able to get it back up.  Their customer service only routed me back to my ticket, so I could not reach a human on the phone or via their chat function. They then blocked my IP address from their site. They blackmailed me and I have the screenshots to prove it (I would upload if TrustPilot offered that option). Jay, the customer associate from from WPFixIt.com blackmailed me and provided threats. Subsequent email I received: \"I am going to make it my life mission letting others online know about how you operate and to stay far far away from your business.  I was very nice and response to you here fixing your issue FAST and explained that the error message you see is a general message for 1000s of different issues.  This is what WordPress displays when there is an issue.  DOES NOT mean it is the same issue every time. Those 18 years of SEO experience will really come in handy.\" STAY FAR AWAY FROM WPFixIt.com Do not use WPFixit.com.I submitted a complaint with the BBB and also consulted a lawyer, as blackmail is a considered extortion and a crime. Since I am a professional writer with work in national publications, I will be covering this situation in the media as a cautionary tale to other business owners."
        },
        {
          "Note": 2,
          "Lieu": "IT",
          "Pseudo": "Rosalba Fiore",
          "Nb_Reviews": 2,
          "Date": "2020-10-18T18:27:54.000Z",
          "Titre": "They can help you as they can destroy you",
          "Contenu": "Although I bought several times the automatic review request sent by Trustpilot never reached me ....However the first time the service ran well and this got me excited, so I had taken other services like virus removal and speed optimization that went well at least there were no obvious problems. Enthusiastic I took the 3-month subscription and it comes out there and I can't do this and I can't do this one, in the end maybe they just upload some text and some images for you .. so canceled. Then I take the package to speed up the site again and here the impossible occurs ... I was in an area with little network coverage and I could not immediately see the result on the site side but the metrics they had reported were excellent GTm double A then I go to verify in practice the css do not load, it results page without background and text at random, on the PC you need to scroll the page and at that point it loads but on the mobile phone a blank page appears. In these 8 days that the work has finished, I contact the chat, send the ticket etc but they do not answer me only today they ask me that I have to repay ... repay what you did wrong. In the meantime, however, after not having received a response from them, I also tried to do all the plugin updates to see if it resolved but nothing. I have an e-commerce that does not load for 8 days get a little idea of ​​the damage I am suffering.2 stars and I don't put 1 because the first few times they worked well but this last thing is destroying me for old customers, it's an eleraning platform so they can't study, and for new ones who don't see the site well.UPDATATE AFTER YOUR REPLYYou are lousy you have made it clear my website and the admin user and password of my site in the pdf linked here on this page.UPDATE AND AFTER JUST 2 MINWP Fix It (Changing Lives) ha scritto una nuova recensione a 1 stella di Fiorerosalba:The owner of this website hired up to do some work and it was completed exactly as described and then they when and disputed the charge to get their money back after the work was completed. Stay far away from this company.Is this serious business behavior? What should I expect you to hack me and destroy the site now?UPDATE 8:26 pm (Italy time)And even on the corporate Facebook of FioreRosalba.com Mr. Jarrett Gucci owner of wpfix went to put his negative review\"Horrible Communication and Reputation Shaming...The owner of this website my company to do some work and it was completed exactly as described and then they when and disputed the charge to get their money back after the work was completed.See full details of the entire service communication at url (of pdf whit admin user and passwod that he shared before)Stay far away from this company.\" Forgetting that the € 598 I paid him in 2020 for various jobs I opened the dispute only for the last € 77. Instead of going to look at the site it is filling the internet with negative reviews. This is bully behavior."
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "ADRIEN",
          "Nb_Reviews": 7,
          "Date": "2019-07-03T03:02:24.000Z",
          "Titre": "The Wp Fix It system of tickets is easy…",
          "Contenu": "The Wp Fix It system of tickets is easy to use and understand. I used the speed-up service. It worked to speed up the site but the plugin configuration was not optimal. I encountered several issues after that with pages not loading properly. So I had to fix it myself. I tried another ticket which really worked and was quickly resolved. And another one for an analytics tracking code that was not installed properly on wordpress (probably a plugin misconfiguration). Agent was rude, didn't understand the request and didn't want to work on it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Ellis",
          "Nb_Reviews": 2,
          "Date": "2023-04-17T19:56:02.000Z",
          "Titre": "We were having trouble with our site on…",
          "Contenu": "We were having trouble with our site on godaddy, and godaddy was NO help trying to get it fixed. (Seriously, we were on the phone with them for HOURS and repeatedly getting disconnected...) I paid for WP Fix It's speed optimization fix. They also couldn't fix the issue, but my understanding was that godaddy needed to fix something on their end and really no one outside of godaddy could fix it. And godaddy support is just awful. So, based on their recommendation, I simply signed up with WP Fix It to host our site. They had the site ported over to their servers AND had the problem fixed within an hour. It's really expensive hosting for what little we have/need, but for them to have fixed our problem and be able to do so for no extra charge in the future may be perfect for us. Everyone that helped us was incredibly responsive (on a Sunday no less), friendly, and capable. I knocked off a star for having paid for the initial service that didn't fix our problem (although it seems like they spent a fair amount of time on it, and ultimately I don't think any third party could have fixed it) and their hosting is pricy. Again, it may very well be completely worth it. I'll update this review after we've used them for a bit."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Paul Bussey",
          "Nb_Reviews": 3,
          "Date": "2018-11-07T14:37:07.000Z",
          "Titre": "WP Fix It get the job done though how does their feedback system really work?",
          "Contenu": "WP Fix It get the job done and communication is good. They advocate a 24 hour, 7 day service but with less than 10 agents I'm not sure if they really are taking shift work to actually cover that type of service or if they cover multiple time zones. There were a number of hours before my ticket was allocated to someone.After the fix I had an email with \"Thank you so much for submitting your feedback. We really appreciate it and use this info to keep making us better.\". I don't believe I submitted feedback. The feedback that I \"submitted\" was \"Awesome\". So I'm annoyed that WP Fix It appear to award themselves \"Awesome\" on what could be an automatic or default basis.On a second support case, this went through much more quickly with Kumar. Again good communication occurred. I'm testing the fix at the moment. I'm happier on this second experience and would use WP Fix It again I think."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "dan",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T18:51:00.000Z",
          "Titre": "Landen was amazing",
          "Contenu": "Landen was amazing, I was very worried about my site, and within minutes its back up, amazing job, thank you Landen 🥳🥳🥳🥳"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T16:08:16.000Z",
          "Titre": "Great experience working with Samantha",
          "Contenu": "Great experience working with Samantha! She solved the issue in minutes and everything is back up and running smoothly.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Beth Nichols",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T00:49:09.000Z",
          "Titre": "Joseph literally saved my life!",
          "Contenu": "Joseph literally saved my life! I had been working at least 14 hours a day for 2 weeks trying to fix this site and felt so defeated. Stumbled upon wpfixit's great reviews and excellent price AND fast turnaround so I went for it. He stuck with me the entire time and kept me posted upon his findings and even put up with my 20 questions after. I have already ordered 3 more and if my next support specialist is as heroic and Joseph you can hire me for a commercial!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "J W Adams",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T16:32:10.000Z",
          "Titre": "Another fantastic experience! Thanks Adam!",
          "Contenu": "Another fantastic experience with WPFixit! My technician Adam was extremely patient and helpful, delving deep into my website to troubleshoot. Absolutely superb customer service and incredibly reassuring to know that my website is in good hands. 5 stars!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "MJ",
          "Nb_Reviews": 4,
          "Date": "2023-12-07T16:47:51.000Z",
          "Titre": "The service was fast and my problem was…",
          "Contenu": "The service was fast and my problem was resolved!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debra Joy",
          "Nb_Reviews": 2,
          "Date": "2023-11-08T19:24:38.000Z",
          "Titre": "Amazing service - thorough and fast",
          "Contenu": "Gus was super fast and I didn't have the right information for him. He talked me through what he needed and was able to fix things fast. He's a great communicator and because of him I am going to switch hosting to wpfixit"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "D.K.",
          "Nb_Reviews": 2,
          "Date": "2023-10-02T20:52:46.000Z",
          "Titre": "Proactive and professional.",
          "Contenu": "Wpfixit.com is proactive, intense, committed and operates with integrity. They only offer chat and email support, which I was a little worried about at first, but they did everything right, fixed my problems and restored my peace of mind about my business website and fixed the security/malware issues in about 5 hours. The problems had plagued my site for months and I tried Bluehost first, but was very disappointed in their lack of follow-through and professionalism. That's when I tried wpfixit.com and I'm so glad I did. I highly recommend them."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jessica",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T20:46:58.000Z",
          "Titre": "A quick fix to an issue with WP that I…",
          "Contenu": "A quick fix to an issue with WP that I have been struggling with for weeks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vicky",
          "Nb_Reviews": 2,
          "Date": "2023-08-17T14:56:59.000Z",
          "Titre": "First time user here",
          "Contenu": "First time user here. Although I am learning Wordpress there is still lots I don't know. Decided to try WP FIX IT and was not disappointed and Gus specifically was super fast and helpful. Will definitely use their services again. Highly recommend!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T00:09:32.000Z",
          "Titre": "Landen and the WP Fix It crew is the BEST!",
          "Contenu": "We had THE MOST FRUSTRATING problem on our website with a redirection that felt like it came out of NOWHERE. We put in for a request for help here and Landen jumped right on it! He did an amazing job of REALLY looking into the problem and researching what was happening. He found the problem and fixed it so quickly compared to other companies we have used. And he was knowledgable and able to explain what was happening in layman terms for me, and I so appreciate his patience! Thank you Landen for your help, you're amazing!"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "DB",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T19:46:26.000Z",
          "Titre": "Superfast fix",
          "Contenu": "Superfast fix.   It's definitely worth hosting with these guys.  Any problems bosch!! They're fixed.  Peace of mind."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Glenn Shepard",
          "Nb_Reviews": 4,
          "Date": "2023-01-05T18:11:01.000Z",
          "Titre": "We’re not used to this kind of 5 Star service in WordPress world!",
          "Contenu": "We needed to figure out why a hook in the functions.php file that removes “Previous Post” and “Next Post” on the bottom of individual posts suddenly stopped working after Astra’s latest update. Landen not only fixed it, but fixed it the RIGHT way by using CSS instead of editing the functions.php file so that we won’t have to do this every time the Astra theme updates. We’re not used to this kind of 5 Star service in WordPress world, but we’re now major fans of WPFixIt and WILL be using them again. – Glenn Shepard, Glenn Shepard Seminars, Nashville, Tennessee"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Martin Costello",
          "Nb_Reviews": 7,
          "Date": "2023-02-14T15:43:17.000Z",
          "Titre": "WP Fix It Are Brilliant",
          "Contenu": "WP Fix It has been massively helpful for me on several occasions when everything goes bang on my WP shop site, absolutely critical to keeping things running. This time my lifesaver agent was Landon and he fixed what looked like an utter mess in just a few minutes. Brilliant as always, thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-09T17:15:55.000Z",
          "Titre": "Prompt and Positive Experience",
          "Contenu": "Our Support Specialist, Landon, was fast, effective, and thorough. After over a month of trying to trouble shoot an issue on our own, our issue was fixed promptly thanks to his help. He went above and beyond with providing a website back up and explaining where it is located. We are so thankful for this fix and such a positive experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2023-07-30T15:53:45.000Z",
          "Titre": "Quick, Affordable, and Thorough WordPress Service",
          "Contenu": "My experience with WP Fix It was great because they quickly diagnosed and fixed the problem with my WordPress website for a very reasonable price.  The technician who helped me was very prompt, professional, and got the job done right the first time.  I have used WP Fix It several times and the service is always top of the line!"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Brian Scott Carey",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T22:27:50.000Z",
          "Titre": "I've been using wpfixit for many years…",
          "Contenu": "I've been using wpfixit for many years and they have always been fast and efficient. I've recently moved my hosting from godaddy to wpfixit and Quincy put in a lot of extra work to help me migrate my client sites over. Looking forward to many more years with great service from Wpfixit."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ted Quinn",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T17:59:59.000Z",
          "Titre": "Great Fast Service That Actually Worked!",
          "Contenu": "Put in a website speed enhancement ticket in rather early in the day and within an hour I went from a D to an A on the speed test of Gmetrix. Fred immediately got to work, communicated well and did what needed to be done! I have a few more websites I am going to have him fix in the near future and won't make the mistake of using any other company again. Consistently great service. Many thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Diane L.",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T20:29:27.000Z",
          "Titre": "Quick and easy-to-use WP tech service",
          "Contenu": "Quick and easy-to-use WP tech service. Patient with my questions. Kumar was a knowledgeable and friendly representative. I wish I had found wpfixit sooner because they have a thorough understanding of all things WordPress and can troubleshoot and fix things better and faster than I can. I became a designer to design, not fix backend issues that can crop up. Thanks for making me look good to my clients by solving the problem quickly. PS. This service was recommended to me by another designer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ilsa",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T19:41:40.000Z",
          "Titre": "WP Fix It solves problems quickly",
          "Contenu": "WP Fix It always provides super quick service.This time around, Russel was no exception. He replied right away, gave me very clear directions, and was kind and patient (I am NOT computer savvy.)  Last year I moved over hosting of my website to WP Fix It for exactly this reason. They never disappoint!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristi",
          "Nb_Reviews": 3,
          "Date": "2022-05-03T01:54:35.000Z",
          "Titre": "Exceptional service",
          "Contenu": "I had a critical error and didn't know what went wrong. The web designer who fixed my site worked quickly and efficiently. He helped turn a bad situation into a positive one and I highly recommend this company for ALL small business owners who don't have their own tech staff. Thanks, WP FIx It for once again saving the day."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vicki M.",
          "Nb_Reviews": 1,
          "Date": "2023-01-07T01:47:09.000Z",
          "Titre": "All-star Landen",
          "Contenu": "Landen was very knowledgeable, quick, and skilled at solving my software issue. Those things are very important, obviously, but what I was most impressed with was his patience and kindness when answering my novice questions. I even forgot to list additional windows that my particular issue was affecting but he handled those too…and without hesitation. Great job! I will be using WPFixIt again in the future - without a doubt. Thank you Landen 😃👍"
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Binh",
          "Nb_Reviews": 7,
          "Date": "2023-09-07T13:58:09.000Z",
          "Titre": "Samantha was very professional",
          "Contenu": "Samantha was very professional and knew what she was doing. My big problem was fixed in no time (so far) and communication was very clear and fast. 5 star support"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Staci",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T19:09:43.000Z",
          "Titre": "Lightning Fast Help from Live Chat to Work Being Done",
          "Contenu": "Live chat with Trevor earlier to ask questions was fast, and informative. Adam, who was all over the updates for my website as part of my monthly service purchase within THREE MINUTES, completely convinced me this service is basically going to save my sanity. The entire sign up and purchasing process was easy, and fast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jin Gee",
          "Nb_Reviews": 2,
          "Date": "2022-03-25T20:31:40.000Z",
          "Titre": "This was a fantastic experience",
          "Contenu": "This was a fantastic experience.  Immediately in touch with me about my website and had a thorough and detailed report ready super quickly. Our phone chat was excellent and gave me so many ideas for improving my sales page and my entire site.  Extremely knowledgeable, I was very comfortable asking questions. I would do this again without hesitation!! Thanks so much!"
        },
        {
          "Note": 5,
          "Lieu": "CZ",
          "Pseudo": "Jiri",
          "Nb_Reviews": 3,
          "Date": "2023-08-29T20:22:42.000Z",
          "Titre": "Awesome service",
          "Contenu": "Awesome service! I had hired a couple of freelancers, but nobody was able to solve my issue. Landen from Wpfixit managed to resolve my problem in a reasonable amount of time. Thank you so much!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Tara Smith",
          "Nb_Reviews": 3,
          "Date": "2023-03-28T14:39:26.000Z",
          "Titre": "Landon has been amazing",
          "Contenu": "Landon has been amazing. I came to him with a problem with coding, he dug right in, and found multiple threats with malware. Not only did he fix my problem quickly, he provided solutions to prevent it from happening again in the future. He is currently working on that ticket right now, but I couldn't be happier with his service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nora Kramer",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T14:40:58.000Z",
          "Titre": "My technician went above and beyond",
          "Contenu": "My technician, Russel, went above and beyond over the course of three days of back and forth with me on a WooCommerce issue on a client’s site. He kept trying different solutions and approaches, and hit on the right one in the end, getting our WooCommerce site back up and running again. In the course of the fix, I found out about their WooCommerce monthly subscription package, which for the price they are asking, is an absolute steal! I will be subscribing the store they fixed, as well as any other Woo stores I manage for my clients, to this service with WP Fix It. It definitely takes a load off this busy website designer, so I can get other things that I am more skilled at done. Bravo!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeannene Langford",
          "Nb_Reviews": 4,
          "Date": "2022-05-25T17:45:26.000Z",
          "Titre": "From Crashed to working in under 5",
          "Contenu": "Ths site I was updating to wp 6 crashed.  Contacted WP Fix-It and the site was up and running again in under 5 minutes. Which is extremely important to my client's business. Thanks to Landen for debugging to delete the error codes so quickly.The service I paid for was for correcting an issue not identifying the cause which leaves me unsure of how to proceed but thankful it is functional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J.C. Mitchell",
          "Nb_Reviews": 1,
          "Date": "2023-01-10T04:36:59.000Z",
          "Titre": "WP Fix It and Landen Were Perfect!",
          "Contenu": "Landen responded to my query immediately. All communication was courteous and clear. I felt I was in good and knowledgable hands from start to finish. The issue I had was resolved completely and speedily. I will definitely turn to WP Fixit again if (when) problems arise with my website."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MACMCD",
          "Nb_Reviews": 4,
          "Date": "2022-06-21T18:58:30.000Z",
          "Titre": "5 stars every experience!",
          "Contenu": "Every experience with WP Fix It is 5 star.It's affordable, they respond fast after issue is submitted, and it's solved quickly. I can't recommend this company highly enough. I've used them many times and they have never disappointed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill H.",
          "Nb_Reviews": 2,
          "Date": "2022-08-08T21:51:43.000Z",
          "Titre": "WP Fix It is the place to go for us…",
          "Contenu": "WP Fix It is the place to go for us non-techie folks who have that heart-stopping moment when something goes wrong.  WP Fix It comes through as advertised... fast at a reasonable cost and (most importantly for me) excellent communication on the status of fixing my site.  What a relief to find WP Fix It!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bee H.",
          "Nb_Reviews": 1,
          "Date": "2022-03-22T17:15:20.000Z",
          "Titre": "I was having some serious issues with…",
          "Contenu": "I was having some serious issues with my wordpress site going down (hostgator), being slow, and possibly infected. This was negatively affecting my business. Reached out to these guys and they were incredibly fast to respond, troubleshoot with my hosting provider and fix the issue. I ended up moving all my services over to them because of their stellar service and knowledge.  So far, my website has been up and running and now I can rest easy knowing it's in good hands. My personal thanks to Gregory who stayed on with me until the issue was resolved, my site was fully migrated and operating properly. Cannot thank you enough!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "kelly",
          "Nb_Reviews": 1,
          "Date": "2022-12-30T19:50:08.000Z",
          "Titre": "I can't say enough good things about WP…",
          "Contenu": "I can't say enough good things about WP Fix It. They provide the best customer service at lightning speed and are extremely helpful, courteous and affordable. Adam resolved an issue with my site in record time after spending over a month with the original hosting company providing no support. Once WP Fix It was brought on the issue was fixed within a matter of hours. I've since moved hosting over to them as well and have been extremely pleased at how easy and fast the transition was. Highly recommend. Adam, THANK YOU!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Craig",
          "Nb_Reviews": 3,
          "Date": "2023-09-11T00:45:46.000Z",
          "Titre": "Amazing service",
          "Contenu": "Amazing service. Samantha reached out to me proactively for a task that I was needed to accomplish. She went above and beyond to provide exceptional service."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Len Chappell CEO Forces Online CIC",
          "Nb_Reviews": 9,
          "Date": "2022-03-14T14:52:16.000Z",
          "Titre": "Over the past week I had an issue which…",
          "Contenu": "Over the past week I had an issue which was preventing my WordPress admin dashboard loading correctly.  I tried a few forums plus my host.  I approached WP Fix It this morning and they sorted the issue within a couple of hours.  I can't thank them enough, and I will definitely be using them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bri",
          "Nb_Reviews": 3,
          "Date": "2022-06-10T22:08:44.000Z",
          "Titre": "Thank you Landen! Another great job done by WPFixIt",
          "Contenu": "Landen did a fantastic job and help me clean up a huge mess that I had made! A hosting platform migration did not go well and the website broke completely - but Landen was able to get the site up and running so quickly! I love working with WPFixIt because their team communicates well, moves quickly, and always gets the job done right. Thank you Landen!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Craig",
          "Nb_Reviews": 3,
          "Date": "2023-04-19T21:53:36.000Z",
          "Titre": "Outstanding and Immediate Service",
          "Contenu": "Outstanding and immediate service. My agent Adam helped resolve an issue within minutes that had rendered the site useless. It's great to know I have the support of WP Fix It, always at-the-ready for such a critical component of our business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T17:23:18.000Z",
          "Titre": "Solved issue - front end of WP site down",
          "Contenu": "Solved issue of front side of site not displaying lightning fast! Explained what the issues were that were fixed, and asked if we had any more questions. Super service."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Simone",
          "Nb_Reviews": 12,
          "Date": "2022-07-27T17:11:36.000Z",
          "Titre": "If I could give them 10 stars I would",
          "Contenu": "If I could give them 10 stars I would! Literally the best support ever, every time I use WP Fix It. I've been using their services quite often as I am not an expert with technical website stuff and they solve my problems within minutes. Yes, literally MINUTES. They're so quick, friendly, and knowledgeable... like I really love WP Fix It."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "D A Baker",
          "Nb_Reviews": 2,
          "Date": "2022-11-02T20:34:04.000Z",
          "Titre": "Rapid Response & Expertise Plus",
          "Contenu": "First, I was amazed at the rapid response. I had replies to each enquiry within, literally, just a couple of minutes. Second, I explained my Word Press site issues very briefly, and WP Fix It made the needed corrections just as quickly. I am impressed and, if needed, will certainly be back. I did go ahead and buy their monthly maintenance package also."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tammy Helfrich",
          "Nb_Reviews": 2,
          "Date": "2023-11-07T01:06:24.000Z",
          "Titre": "Amazing service",
          "Contenu": "Amazing service! Quick and knowledgeable and kept me informed. I will definitely recommend this service to others."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 6,
          "Date": "2022-11-11T03:27:21.000Z",
          "Titre": "Fast and Courteous Service",
          "Contenu": "I was experiencing a WordPress critical error when trying to modify pages. Laura quickly identified the problem, fixed it and explained to me what she had one. This is typical of the service I have received from WP FixIt in the past. Thank you Laura, you saved the day."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Neil Richmund",
          "Nb_Reviews": 1,
          "Date": "2022-03-24T20:13:11.000Z",
          "Titre": "Don't wate time trying to solve it yourself - send it to WPFixIt!",
          "Contenu": "I had an issue that was taking too much of my time to troubleshoot, so I sent it over to the guys at WPFixIt. The issue had been plaguing me for months and I had come back to it a number of times but never got close to resolving it. WPFixIt had it resolved in about 10 mins, causing me to again say, why do I hold on to these things myself. It's always quick, easy and nearly every time results in a successful solution - which is awesome."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Diana",
          "Nb_Reviews": 2,
          "Date": "2022-12-15T22:51:37.000Z",
          "Titre": "Quincy of WP Fix It resolved my issue…",
          "Contenu": "Quincy of WP Fix It resolved my issue so quickly! Within a minute of my ticket being submitted Quincy confirmed he had my ticket and confirmed he needed a Collaborator role setup where my site is hosted. The How to was easy to follow. The process was maybe 20 minutes from the time I submitted the ticket to getting confirmation my issue was resolved, with an explanation of the resolution - and this includes MY time to respond and setup the access necessary. They make it easy for you to share information on the issue, to add screenshots. Really amazed and will be back for help in the future. Thanks Quincy!"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "John Fowler",
          "Nb_Reviews": 1,
          "Date": "2023-01-13T21:53:10.000Z",
          "Titre": "Great Hosting, Skilled Support",
          "Contenu": "We reached out WPFixit for help with a tech issue on our wordpress site about a month ago. They said that they couldn't fix it because it was an issue with our server, but suggested that the problem would likely improve if we swtiched to hosting our site at WPFixit. We made the switch and the problem improved, and more importantly, our site became much, much faster! Since starting hosting a month ago, we found another tricky problem with our site and Landen at WPFixit spent hours helping us dig into it, and eventually found a solution - He was tenacious and spent a lot of time with us, even though I thought we weren't going to be able to fix it and would just have to live with it. But he was able to find a solution and we're very grateful! Highly recommend hosting at WPFixit and their support services as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob",
          "Nb_Reviews": 1,
          "Date": "2022-08-30T20:44:31.000Z",
          "Titre": "Major issue, quick fix.",
          "Contenu": "The tech was able to quickly identify and fix our issue with a broken core plugin.  Something our hosting site couldn't help us with and the developer had stopped supporting the plugin.  Brilliant!  Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill Ramey",
          "Nb_Reviews": 1,
          "Date": "2022-06-02T20:58:58.000Z",
          "Titre": "Great service!",
          "Contenu": "I have used WP Fix It several times and I have never been disappointed.  Recently, my WP site was compromised and I purchased their Malware Removal service and Landen took care of it.  I will definitely use again when needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lura Willhite",
          "Nb_Reviews": 1,
          "Date": "2023-01-28T23:29:47.000Z",
          "Titre": "So quick and accurate!",
          "Contenu": "Mitch worked so quickly to fix an issue that had been holding me back for weeks. He did it fast, with a great attitude and showed patience when I was having issues getting him an answer. He, and your other great employees, are the reason I come back fo WP Fix It when I have issues. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Camille Dareau",
          "Nb_Reviews": 3,
          "Date": "2023-03-28T19:41:20.000Z",
          "Titre": "Very Rapid Solutions Every Time",
          "Contenu": "Every time I have an issue with either of my websites I have received such quick resolutions from Landen at WP Fixit. It makes such a difference to know the support is there when I need it! The hosting service as a whole is excellent and I would recommend it 100%Thank you so much ✨"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-06-16T02:11:49.000Z",
          "Titre": "Outstanding support",
          "Contenu": "Outstanding support.  Super fast and always on point.  You guys are amazing!  Thanks Quincy for resolving our issue exactly right.  You rock!"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Camille Dareau",
          "Nb_Reviews": 3,
          "Date": "2023-01-09T15:33:55.000Z",
          "Titre": "Excellent Support Service",
          "Contenu": "Landen is an excellent support agent, he always responds rapidly and is very friendly and helpful in resolving whatever problems come up. I feel that I can really trust the company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donald Cannon",
          "Nb_Reviews": 6,
          "Date": "2023-03-17T19:15:06.000Z",
          "Titre": "Adam is Awesome!",
          "Contenu": "Adam was excellent and super fast at getting my site back operating correctly. It took me longer to describe the issue than it took Adam to correct it! Awesome company. I always turn to WP Fix It when I have any issues with my site. Top Notch! Thanks, Adam."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vicky",
          "Nb_Reviews": 2,
          "Date": "2023-09-20T14:51:10.000Z",
          "Titre": "I've used WPFixit several times and the…",
          "Contenu": "I've used WPFixit several times and the service is always quick, easy and they get the job done. I wish I'd known about them sooner!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Doug Gazlay",
          "Nb_Reviews": 3,
          "Date": "2022-08-23T20:53:24.000Z",
          "Titre": "I was panicked because an error message…",
          "Contenu": "I was panicked because an error message showed up on one of my client's Word Press sites.  Not knowing what to do, I searched the web and found WP Fix It!  I am relieved to say that they fixed my client's site within 1/2 hour of paying the one-time fee!   I'm hooked and feel more confident selling my web services for WP after finding WP Fix It!  Thank you for the peace of mind I just learned is possible!  - Doug Gazlay"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sara Johnson",
          "Nb_Reviews": 1,
          "Date": "2022-12-23T04:15:50.000Z",
          "Titre": "All I can say is wow",
          "Contenu": "All I can say is wow! I started panicking when my WordPress site had the “white screen of death” after I tried updating some plugins. I thought that maybe I could fix it myself, but once I started going down that rabbithole, I knew I needed help because it would have either taken me all night or I would have messed things up even worse. I found WP Fix It and went straight here to Trustpilot to verify their credibility because it seemed too good to be true. Alas, within 5 minutes of submitting my request, Rosario responded to me and assured me they were on it! We had some back and forth with login credentials and such, but in under an hour, the problem was identified and fixed. She went above and beyond to help with a form that was found to be the issue.Excellent, truly fast service at an unbeatable price. I will not hesitate to contact WPFixIt in the future when I (unfortunately but inevitably) mess something up. Thank you Rosario!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "CN",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T16:18:49.000Z",
          "Titre": "Excellent support!",
          "Contenu": "Gus did an excellent job! I could not be happier with my results and support.Very knowledgeable, trustworthy and efficient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff V.",
          "Nb_Reviews": 4,
          "Date": "2023-04-03T16:36:22.000Z",
          "Titre": "Russell is a great agent and deserves…",
          "Contenu": "Russell is a great agent and deserves the highest rating for his support. He not only fixed my problem but he did it quickly and was patient with me and asked the right follow-up questions. I have been using WP Fixit for a few years now to fix things that I have broken and I certainly received 5-Star support today. I am very grateful. My only regret is that I did not reach out to him sooner. Thank you Russell!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kate “Kathi” Frank",
          "Nb_Reviews": 1,
          "Date": "2022-06-06T22:38:45.000Z",
          "Titre": "Suspicious to Very Satisfied",
          "Contenu": "Honestly, I was suspicious. I have been burned by so many people claiming to be a WordPress expert. The service was VERY fast and accomplished a task I have spent hours trying to resolve. I am grateful and will certainly return for more help in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter J. Meilahn",
          "Nb_Reviews": 1,
          "Date": "2022-03-29T16:44:23.000Z",
          "Titre": "Quick help for a code problem that…",
          "Contenu": "Quick help for a code problem that brought my site down (SoundTherapy.com). Poeple rely on the site for their health, and Frankie with WpFixIt got it back up in under 20 minutes after I contacted them.Thanks Frankie and WpFixIt, Peter Meilahn, Founder, SoundTherapy.com, Memoir.com, and others."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Krow",
          "Nb_Reviews": 3,
          "Date": "2023-05-23T22:28:09.000Z",
          "Titre": "Super fast and great customer service!",
          "Contenu": "I am setting up a dedicated server for the first time and Gus has been super supportive, fast, and attentive! Great start out of the gate here. Super excited. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "T.J. Quesnel",
          "Nb_Reviews": 1,
          "Date": "2022-09-16T20:01:01.000Z",
          "Titre": "Fantastic Service",
          "Contenu": "Ive used WPfixit for a number of hacked sites throughout the years.  They've fixed the ones that were compromised VERY quickly and even  helped me reassure my client that the site was in fact clean already.  I highly recommend WPfixit."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rachel Roberts",
          "Nb_Reviews": 1,
          "Date": "2022-03-28T22:10:13.000Z",
          "Titre": "Form error fixed & updates run",
          "Contenu": "A form on my site was throwing an error, no idea how or why this happened.  I put in a support ticket and it was fixed in less than 30 minutes.  This isn't the first time I have used WP fix it.  They are fast and reliable when my site has an issue or just needs updates.  Would recommend to any small business owner that does not want to manage their own website."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leah Einwalter",
          "Nb_Reviews": 6,
          "Date": "2022-05-11T18:32:17.000Z",
          "Titre": "Superior Support",
          "Contenu": "Once again, WP Fix It has offered superior support during the most stressful of times. Landen, my support agent, was exceptionally fast and communicated often. I really appreciate all the work he did for my site."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Web Owner",
          "Nb_Reviews": 2,
          "Date": "2022-11-30T02:18:32.000Z",
          "Titre": "Quincy at WP Fix It is awesome!",
          "Contenu": "Quincy was amazing - fast, professional, and went the extra mile to help my website get back to working order as quickly and smoothly as possible. Highly recommend WP Fix It!"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "forex trading",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T21:06:29.000Z",
          "Titre": "I use web press hosting for more than…",
          "Contenu": "I use web press hosting for more than my three website and its very impress my experience with this is too amazing and its domain are very pocket friendly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James - West Virginia USA",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T03:19:53.000Z",
          "Titre": "Genius techs - super fast service",
          "Contenu": "The service was super fast.The genius tech who helped me was amazing and professional - really first rate Five Star rating.James from West Virginia"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "R Lipkin",
          "Nb_Reviews": 1,
          "Date": "2022-04-15T20:58:50.000Z",
          "Titre": "Landen was fantastic!",
          "Contenu": "Landen was fantastic--knowledgeable, kind, responsive, and, more than all that--Landen fixed my problem! I'm so impressed with both Landen and Timothy, whom I chatted with, that I'm thinking of switching my web hosting over to your company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eliza Cross",
          "Nb_Reviews": 1,
          "Date": "2022-12-18T19:23:51.000Z",
          "Titre": "Fast, Competent, Friendly Technical Support",
          "Contenu": "WP Fix It helped me with a technical issue on my website that I wanted to be sure it was done properly. The service was amazingly fast, performed perfectly, and supported with friendly communication. So impressed!"
        },
        {
          "Note": 5,
          "Lieu": "BZ",
          "Pseudo": "Grant",
          "Nb_Reviews": 2,
          "Date": "2022-12-04T00:04:21.000Z",
          "Titre": "Vexed and almost gave up...",
          "Contenu": "I had a vexing problem I nor my tech support could figure out. I wasted many hours trying to fix it. I gave up and thought I would have to rebuild the entire website and then I searched and found WPFixIt. Paid the fee and crossed my fingers. They responded quickly, asked a few questions, and figured it out...fixed! I am so grateful to them. Highly recommend!!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Stuart Alderton",
          "Nb_Reviews": 10,
          "Date": "2023-01-22T16:48:17.000Z",
          "Titre": "Excellent service as ever",
          "Contenu": "Excellent service as ever.  This time from Landen.  Every time I have a problem that I can't fix (and nobody else) WP Fix-it hits the spot!  Highly recommended for those difficult to fix wordpress problems."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TheMarketingMomma",
          "Nb_Reviews": 1,
          "Date": "2022-11-19T00:17:26.000Z",
          "Titre": "Landen has been a great help to me on…",
          "Contenu": "Landen has been a great help to me on many Wordpress projects.  Always very knowledgeable and pleasant to work with!  Resolved our issue and got everything back up and running quickly!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bradley",
          "Nb_Reviews": 3,
          "Date": "2023-01-12T00:20:00.000Z",
          "Titre": "My wordpress person couldnt figure out…",
          "Contenu": "My wordpress person couldnt figure out how to fix why my website was not loading properly. WP Fix It figured it out in minutes after I made payment. You are AWESOME!!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carrie Hausfeld Meurer",
          "Nb_Reviews": 3,
          "Date": "2022-04-07T17:41:24.000Z",
          "Titre": "FAST and affordable!",
          "Contenu": "I've used WP Fix It twice now and they have solved both of my issues QUICKLY (as in, within 15-30 minutes). Very easy to communicate with and affordable! Definitely plan on using them again and again and again.... :)"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Glen R",
          "Nb_Reviews": 3,
          "Date": "2022-05-24T20:34:04.000Z",
          "Titre": "Not all heroes wear capes!",
          "Contenu": "Our website was experiencing technical troubles with our cart not storing customers items, we reached out to WPFIXIT who are our go to source for technical support.   We opened an emergency ticket and Landen the support agent had the issue resolved in 15 minutes!  If you have a wordpress site or operate some for your clients, I would always recommend WPFIXIT as your emergency bandaid, 99% of the time they can fix it quicker than if I tried it myself and for incredibly cheap rates!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lea Hart",
          "Nb_Reviews": 3,
          "Date": "2023-08-16T00:48:26.000Z",
          "Titre": "Gus has once again saved my site",
          "Contenu": "Gus has once again saved my site. He did it in a flash and spotted a problem that I wasn't even aware was there. A true rockstar. I  give him and this service a hundred gorgeous gold stars."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Cameron",
          "Nb_Reviews": 66,
          "Date": "2023-04-20T11:36:21.000Z",
          "Titre": "Great company make sure to use this…",
          "Contenu": "Great company make sure to use this hosting if your going to be making a website for your company or community keep up the good work up."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sameer",
          "Nb_Reviews": 1,
          "Date": "2022-03-30T15:31:16.000Z",
          "Titre": "wpfixit made me realize what a quality host can do!",
          "Contenu": "I had a terrible experience with BlueHost after they forced an upgrade to PHP8 w/o ensuring my site was compatible. Their solution in the past was to just downgrade the PHP which worked until 8 was enforced. I asked for solutions, and they gave patches. Their response rate was super slow too. I got super frustrated and tested out wpfixit. $47 for an issue? Too good to be true? BUT THEY NAILED IT! Super fast and accurate. I had them do more things and THEN migrated to them as a host. I couldn't be happier and feel they will take care of me as they have throughout this migration. My site is stable and I love that it is on the latest of all!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bri",
          "Nb_Reviews": 3,
          "Date": "2022-04-21T04:31:18.847Z",
          "Titre": "Landen was a HUGE help and went above…",
          "Contenu": "Landen was a HUGE help and went above and beyond to solve my issues. Whenever I reach out to WP Fix It I am in a state of stress and despair, but WP Fix It Support Specialists like Landen always save the day. I can't believe how quickly and effectively they work. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T17:13:45.000Z",
          "Titre": "Excellent service",
          "Contenu": "Very quick - had my site back up an running in no time. Great communication, great price, great service. Will definatley use again."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Shaun Adams",
          "Nb_Reviews": 2,
          "Date": "2023-02-23T15:43:01.000Z",
          "Titre": "Gregory is a beast 👾",
          "Contenu": "Had a problem that was confusing and annoying as hell for about 2-weeks. Then this bloke wonders in and bam! Sorted. Very happy with all my dealings with WPFixIt, but Gregory is a beast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angelique Adelina",
          "Nb_Reviews": 1,
          "Date": "2022-09-26T23:55:31.000Z",
          "Titre": "Nathan was fantastic",
          "Contenu": "Nathan was fast, kind, and professional. He fixed the site within ten minutes of diagnosing the issue. I was still waiting for a response from the hosting site and he already had it fixed. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristi",
          "Nb_Reviews": 3,
          "Date": "2022-03-15T15:09:53.000Z",
          "Titre": "WP Fix It Designers Are The Best",
          "Contenu": "I absolutely loved working with WP Fix It. My assigned web designer was phenomenal. He was very friendly and cooperative and finished my WordPress errors quickly and efficiently. As a small nonprofit organization, people rely on our website to find financial assistance for their pets and I appreciate this designer very much. A++++++ service. Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JS",
          "Nb_Reviews": 3,
          "Date": "2022-12-30T02:02:41.000Z",
          "Titre": "Fast and furious fixing",
          "Contenu": "Fast and furious fixing! Thank you so much for Adam for jumping in and taking care of a few PHP errors we were having on the homepage of a busy website."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nancy",
          "Nb_Reviews": 2,
          "Date": "2022-09-23T15:51:38.000Z",
          "Titre": "Once again they quickly fixed an…",
          "Contenu": "Once again they quickly fixed an important plug-in conflict that was affecting our calendar. Huge thank you to Keith."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brandon McCloskey",
          "Nb_Reviews": 3,
          "Date": "2023-03-16T22:19:00.000Z",
          "Titre": "You have to use their hosting!",
          "Contenu": "This review is about their hosting service! Over the past year or so the various WP Fix It support members who have helped me fix client sites have mentioned their hosting services. Admittedly I was really wary about making the change. Price was a big factor but also the idea of trying to convince several hundred clients to make the move AND having their website hosting in one place and their domain with another.Cher with WP Fix It reached out to me and answered every question I threw at her until I couldn't come up with a reason not to make the move. She was that thorough and understanding in making sure I had all the information I needed before I made the leap of faith. So with nothing left to ask and only money to lose I made the leap on March 1st. I knew to sell my clients on the idea of making this move I needed examples and WP Fix It server setup support free of charge (included in initial setup) migrated all the sites that I was hosting myself (about 14). The speed in which it was completed was amazing and the performance improvements of the websites amazed me as well! I knew I could start selling my clients on the idea.In 16 short days I've convinced about 2 dozen more to make the move with a lot more to go. But every step along the way WP Fix It has answered every support ticket I've submitted and fixed every issue that has come up. I can say that WP Fix It is the leader in WordPress hosting and support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carla Hansson 💫",
          "Nb_Reviews": 2,
          "Date": "2023-01-07T20:27:50.000Z",
          "Titre": "My Go-To!",
          "Contenu": "Landen was fantastic. Quick, patient, and professional. I enjoyed our correspondence. WP Fix  It is my go-to when I can't do!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T17:47:30.000Z",
          "Titre": "This was a great first-time experience..!",
          "Contenu": "This was a great experience. My agent was awesome and discovered the issue and quickly resolved-it. I was very reluctant at first...but decide to take a chance. I'm glad I did."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Natalie",
          "Nb_Reviews": 9,
          "Date": "2022-11-02T06:43:08.000Z",
          "Titre": "Thankyou Allen",
          "Contenu": "Thankyou Allen, the issue was fixed quickly and we were back up and running with little downtime at all. Much appreciated."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2022-12-08T16:43:08.000Z",
          "Titre": "I was so nervous about potentially…",
          "Contenu": "I was so nervous about potentially losing 30 hours' worth of work in building a website on WP. But WP Fix-it came to the rescue and restored the files and help me move the domain name over. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bri",
          "Nb_Reviews": 3,
          "Date": "2022-05-09T19:48:37.000Z",
          "Titre": "I always have the best experience with…",
          "Contenu": "I always have the best experience with WP Fix It service and Casandra was no exception. She fixed my problem, was responsive, and wonderful to work with. Thank you Casandra!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nancy Murrell",
          "Nb_Reviews": 4,
          "Date": "2023-09-27T17:08:25.000Z",
          "Titre": "WP Fixit always bails me out",
          "Contenu": "WP Fixit always bails me out, and fast. Well worth the money to not have to agonize over code when I have other things to do."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Catherine Thomas",
          "Nb_Reviews": 3,
          "Date": "2023-10-07T22:34:25.000Z",
          "Titre": "Quincy Rocks! :)",
          "Contenu": "This is my 3rd time using Qunicy and he is the best.  Understands the issue and fixes.  Just perfect!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nancy",
          "Nb_Reviews": 2,
          "Date": "2022-12-13T17:45:03.000Z",
          "Titre": "Quincy solved my issue in under 5…",
          "Contenu": "Quincy solved my issue in under 5 minutes. I'm not kidding. It would have taken me hours to find the custom CSS code snippet that was causing problems."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T16:22:29.000Z",
          "Titre": "My tech tracked the problem down…",
          "Contenu": "My tech tracked the problem down quickly. I would have never imagined it would be a reputable plugin from a very reputable author."
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Riette Error",
          "Nb_Reviews": 2,
          "Date": "2023-01-14T12:25:22.000Z",
          "Titre": "Very efficient and friendly",
          "Contenu": "I have used WP fix it a couple of times and have yet to be disappointed. Landen was extremely patient and very friendly solving my latest issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jen",
          "Nb_Reviews": 3,
          "Date": "2022-07-25T16:49:56.000Z",
          "Titre": "They made my online form work!",
          "Contenu": "I installed WP Forms Lite but it wasn't working. The submitted data was not going to my email address (or anywhere else). It seemed that I needed to install some sort of STMP thing but I had no idea how to do it.The WP Fix It agent set it up in less than 30 minutes. Phew! Thanks, Fix It folks!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Charles Pearmain",
          "Nb_Reviews": 12,
          "Date": "2022-05-16T21:28:54.000Z",
          "Titre": "Swift, effective service.",
          "Contenu": "Agent understood the issue with my site and resolved it in good time with an explanation of why the problem had occurred. Great service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John S.",
          "Nb_Reviews": 3,
          "Date": "2023-10-15T11:33:16.000Z",
          "Titre": "Very happy with the service",
          "Contenu": "Very happy with the service. Very quick responses to the issues I have had. I can only reccommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 6,
          "Date": "2022-04-30T00:10:22.000Z",
          "Titre": "Casandra did an excellent job migrating…",
          "Contenu": "Casandra did an excellent job migrating the site. The migration was done promptly and professionally. Thank you WP Fix It."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maynestreet.com",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T00:22:19.000Z",
          "Titre": "My site was saved!!!",
          "Contenu": "This was a great experience.  Don't get me wrong, my site was hacked and while this is mostly brochurware. losing our content and posts would be a huge loss for us.  The process was swift and I am back in control of our website.  Thank you, thank you, thank you!!!"
        }
      ]
    }
  ]
}