{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.toluna.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-12-21T03:43:22.000Z",
          "Titre": "Don’t waste your time with the surveys!",
          "Contenu": "Don’t waste your time with the surveys! You might get rewarded for two out of every five you actually complete! They let you use your time to finish the survey, giving them all your input for them to sell to a third party(read the fine print), then they give you the excuse, “ We’re sorry, but we’ve had sufficient participants to make quota, but please don’t give up? Keep trying. Might get lucky!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mary Huggins",
          "Nb_Reviews": 4,
          "Date": "2023-12-21T22:19:49.000Z",
          "Titre": "You have made a error and refuse to fix it.",
          "Contenu": "I have been a loyal and responsible Toluna survey taker for nearly 15 years. One day, out of the blue, you cut me off from taking any surveys.  I still get invites and am able to take the 15 point sponsored surveys.  I have called you several times. Your response was something I never heard of.  My techie grandson looked into it a concluded you made an error and I have done nothing wrong.  I already knew that. What a shameful way to treat loyal consumers. Shame on you.  Mary Huggins"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Amanda Jarem Jarem",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T01:07:06.000Z",
          "Titre": "Doesn't matter how many incentive…",
          "Contenu": "Doesn't matter how many incentive surveys that I complete I am still not receiving any points. I am wasting 5 hours of time every day for 0 points. I will get that odd survey where I do complete and receive points. I am completing 3 surveys a day at least and get rewarded for completing 1 survey the most."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lisa Ortiz",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T17:41:09.000Z",
          "Titre": "One survey was too long and only…",
          "Contenu": "One survey was too long and only offered 1000 points. It kept asking the same questions over and over. I fell asleep and eventually exited out of the survey. It was not worth it.I was in the middle of a survey, I hit next and it said I had already completed the survey. Another survey told me I did not qualify and I was more than halfway through and answered a lot of questions pertaining to the survey not just screener questions. What a waste of time. I should have received partial credit."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Talha",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T15:32:15.000Z",
          "Titre": "Toluna - Not Worth Your Time.",
          "Contenu": "I spent almost 3 weeks amassing 190,000 points to redeem through PayPal but it's been more than 2 weeks & I still haven't received my payment or any updates regarding it. The website says PayPal payment takes about 1-3 weeks, but I'm not sure I'll ever receive it though. I'll update this review if I ever do, but until then I would suggest people to not use Toluna, it's just a scam from my experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer Shari Lynne Tribble",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T20:31:42.000Z",
          "Titre": "PayPal Payment Processing is abysmal",
          "Contenu": "PayPal Payment Processing is abysmal! It was annoying enough that they charge you a processing fee and only processed payments once a week, which used to be on Mondays with an occasional delay to Tuesday or Wednesday. Then it slid to Thursdays, irritating but at least it was still weekly. Since November it's gone completely downhill--they processed once for the whole month, and anything that has been submitted since then is still stuck in Pending. Tired of being quoted the \"1-3 week\" timeframe (which is BS since every other survey site does them instantly) and now they just keep making excuses about how they've had an overwhelming number of redemptions--blah, blah, blah! Get it together and get us paid in a timely manner--no more excuses."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cody Bryan",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T22:51:50.000Z",
          "Titre": "Broken Promises",
          "Contenu": "I signed up to take surveys to earn points and make money, what's the point of taking surveys when everytime you take them there is a problem and I don't get my points because of an error in the survey.. so I hsve only taken one survey and the very first survey is broken.. nope fck this site!"
        },
        {
          "Note": 1,
          "Lieu": "TW",
          "Pseudo": "l. c",
          "Nb_Reviews": 4,
          "Date": "2023-12-18T08:27:28.000Z",
          "Titre": "I've been using Toluna for a long time",
          "Contenu": "I've been using Toluna for a long time, and it has always been good. I've successfully redeemed rewards several times. However, this morning, I suddenly can't log in for some unknown reason.【Error:Authentication failed. Please try again.】"
        },
        {
          "Note": 1,
          "Lieu": "HK",
          "Pseudo": "Michael Chan",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T03:48:53.000Z",
          "Titre": "Toluna is a scam",
          "Contenu": "What a company! Even 50 PayPal reward can’t pay to the users! How much time that users have put on the surveys and get the 50 dollars. It’s not easy! And you said you can’t transfer that 50 Hk dollars and that’s how you scam users to do the surveys for you over and over again?! There are surveys out there which are getting over 200 dollars within 2 hours! And they were paying by cash. How dare you to collect peoples’ opinion and sell them to the third party and let users reward nothing! I have also spent weeks on the surveys to get only 50 dollars. You’re literally a scam company!Pathetic!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alexandria - Stone",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:06:41.000Z",
          "Titre": "feels scammy",
          "Contenu": "the first survey i completed i got all the way to the end and then it gave me an error timeout message, the second survey i spent 15 minutes on to be told they were looking for a different profile. very scammy."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Alan",
          "Nb_Reviews": 6,
          "Date": "2023-12-20T15:04:24.000Z",
          "Titre": "Seems like this is a very cleverly arranged SCAM!",
          "Contenu": "You offer 10 000 points for completing 3 surveys in the first week - BUT - after I've only completed TWO proper surveys (with LOTS of your own meaningless mini surveys - you conveniently inform me \"CAN YOU BELIEVE IT! WE ARE CURRENTLY OUT OF SURVEYS\"with Points Balance Points: 7180!I'm guessing - since only payment only after $50 in points has accumulated has been mentioned - that that probably requires 50 000 points?With the surveys mostly only offering 1 000 points and running out of surveys, clearly this must be a SCAM where suckers answer lots of surveys that Toluna gets paid for - but when we eventually give up in frustration without ever being able to reach 50 000 points you have had free surveys answered that YOU get paid for - without having to actually pay most of your reviewers for wasting their time doing surveys for NOTHING!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Martin Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T07:25:56.000Z",
          "Titre": "They sell your data in a scammy way",
          "Contenu": "Toluna is the worst among all other research communities. They will sell your data to research companies, and get paid but will ban your account without warning and forfeit your reward as well as point. So, ultimately you won't be paid for your data. Besides, their reward takes a longer time to arrive (7 days to 10 days) than other sites. At this time if you get a ban, you will lose your account and the reward that you waiting for.   I earned 300k points, using this platform for the last 8 months, and got paid $75. But one morning suddenly they banned my account and forfeited my points which cost $16 of data by saying almost nothing specific. You have seen in the Trustpilot review they doing the same to a lot of users with the excuse of their terms and conditions. So the site is time-killing and doing scams is a smart way. please AVOID the site."
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Abby Guild",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T01:36:36.000Z",
          "Titre": "Website crashed at the end of my 20…",
          "Contenu": "Website crashed at the end of my 20 minute survey which is very convenient.. Site is too slow in general and takes 5 minutes before letting you know you haven' qualified. Total waste of time"
        },
        {
          "Note": 1,
          "Lieu": "ZA",
          "Pseudo": "gift sempe",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T18:31:08.000Z",
          "Titre": "Points offered too low",
          "Contenu": "Points offered too low. One has to complete over 20-25 surveys before qualifying for a reward. not fair at all"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Manmohan Vyas",
          "Nb_Reviews": 4,
          "Date": "2023-12-17T01:40:50.000Z",
          "Titre": "Account closed abruptly (follow up review)",
          "Contenu": "Zero commitment and customer service team either don’t respond or they seem to don’t care about you. Better to sign up for other available platforms. My account for closed abruptly and all my points were cancelled, I was assured account will be reactivated and after every follow up you get a new response (usual wait time for 3 or more days to get email response). None of the customer service team member actually reads your email and they seem to be just copy pasting standard drafts and send it to you to close tickets. Very unhappy experience"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Curious Customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T03:25:46.000Z",
          "Titre": "This is dumb",
          "Contenu": "I went to do my first survey After doing it for 15 minutes, it said there was an issue. I did receive points, no did I receive a resolution"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Katy Dermas",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T20:52:06.000Z",
          "Titre": "I have been an active member of the…",
          "Contenu": "I have been an active member of the Toluna community, I have worked honestly and sincerely.Unfortunately, I can no longer even participate and log into my accountThis behavior is not appropriate for us or the Toluna community"
        },
        {
          "Note": 1,
          "Lieu": "MY",
          "Pseudo": "faakef",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T12:35:32.000Z",
          "Titre": "Bullsh*t",
          "Contenu": "Bullsh*t, I wasted an hour to do a survey, until 99% it showed I do not have permission to ascess this session, then forcing me back to homepage, after that logged out my account, and my account just gone, tried forgot password, but they didnt even send email to me. Now all my points gone.This is everything, there's no more further detail. It just logged out my account after forcing me to home page and I can't log in now, eventhough forgetting password, i still yet receive any email to reset my password."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cherie",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T05:48:04.000Z",
          "Titre": "Won't let me complete the surveys.",
          "Contenu": "I'm receiving and doing the surveys but it never let's me complete them. It just tells me that something went wrong on your end. This is starting to feel like a waste of my time and I don't like that. Time is money!!!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T02:10:45.000Z",
          "Titre": "None of the inquiries has ever been…",
          "Contenu": "None of the inquiries has ever been understood or resolved.  Please note it has been a recurring problem.  Not a single incident."
        },
        {
          "Note": 1,
          "Lieu": "ZA",
          "Pseudo": "emmanuel williams",
          "Nb_Reviews": 5,
          "Date": "2023-12-20T20:38:57.000Z",
          "Titre": "Im so disappointed in Toluna",
          "Contenu": "Im so disappointed in Toluna. I \"was\" a member for more then 2 years and a few weeks ago i cashed out and 2 days after cashing out i couldn't login. I enquired many times and only after 7 days i got a reply that my account was suspended and guess why cause of they suspect that i have many accounts. Strange Toluna says you can invite people and get 500 points which i have been doing but all of a sudden i have multiple account and strange i only use one account and cash out on one account. They even went to far by declining my rewards that was cashed out while my account was still active. I cant help it if i have a huge family and friend circle and i wanted them to also be part of the Toluna community. They were a very good company that always provided a great service to me but lately their services dropped. If you suspected i have many accounts why wait for 2 years and these suspected account can you prove that i have cashed out on one of them and secondly why decline rewards that has been valid when cashed out? Toluna is getting a 1 star just a pity there is no -10 starts cause thats what i will give them. I have contacted all my friends and family that i have invited to toluna and will show them the treatment Toluna gave me and tell them to unsubscribe from Toluna"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Lynn",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T05:54:59.000Z",
          "Titre": "Much too many emails vs functional surveys",
          "Contenu": "Much too many emails vs surveys that I qualify for or that are functional.I have made, in 2023, much more from other survey companies. 200% in one case and may possibly opt out of Toluna."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Emma Petersen",
          "Nb_Reviews": 4,
          "Date": "2023-12-21T15:42:30.000Z",
          "Titre": "Login problems",
          "Contenu": "Hi Jordon thanks for getting back to me I have responded and they say every time to click on forgot password but it dosent work still , are you able to sort it out for me as it is the correct email and password"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jk",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T18:31:33.000Z",
          "Titre": "Lots of time for no reward",
          "Contenu": "Lots of time for no reward.  Many times I am 20 minutes into survey, then it just kicks me out with no points.  That is frustrating."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Bauer",
          "Nb_Reviews": 7,
          "Date": "2023-12-14T15:41:43.000Z",
          "Titre": "They cheated me out of a lousy $15 gift…",
          "Contenu": "They cheated me out of a lousy $15 gift certificate after I spent many hours completing surveys to earn one, and they \"resolved\" the case by calling me a fraud and refusing to send me the gift card. Case is not \"resolved\". Don't use Toluna. Read all of the negative reviews first before you sign up."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "AnnMarie",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T11:22:10.000Z",
          "Titre": "not for me…",
          "Contenu": "survey always tell me its full but then send a reminder to do the survey .. cancelled account.*update - I have already contacted Toluna, they gave me various excuses as to why I can no longer answer surveys, the last one being my IP address is blacklisted due to FRAUD!!!!...utter rubbish...I even completed the suggested website to check the IP and it was not blacklisted/flagged*I have cancelled my account.."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Emma Petersen",
          "Nb_Reviews": 4,
          "Date": "2023-12-18T16:39:10.000Z",
          "Titre": "Login problems",
          "Contenu": "Hi I have been with Toluna a while now but yet again I’m having the login problems like I did before , could someone please help me with this please ? Thanks"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Manmohan Vyas",
          "Nb_Reviews": 4,
          "Date": "2023-12-13T19:06:27.000Z",
          "Titre": "They closed my account abruptly",
          "Contenu": "They closed my account without information. On repeated requested it was informed that I have reported incorrect facts in a survey however they did not inform me even after repeated request which survey and what problem was detected. They closed account and all my reward points were denied. Very very unprofessional behaviour, I have spent a hours filling survey atleast inform me what went wrong and then close account or invalidate points etc. unhappy with the approach and responses by customer care"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 7,
          "Date": "2023-12-21T17:43:14.000Z",
          "Titre": "I spend time filling out mwasted timey personals…",
          "Contenu": "I spend time filling out my personals over and over and do not qualify.  Why is my time being wasted over and over???"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Vishu - Pawar",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T12:43:43.000Z",
          "Titre": "webpage was crashed after doing a…",
          "Contenu": "webpage was crashed after doing a servey of 25 minutes. no points were credit to me. the error displayed a messege something went wrong with thispage from our end. survey was easy and good but crash at the final step and waste my plenty of time due to your internal error."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Anita - Jain",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T14:21:00.000Z",
          "Titre": "Very bad",
          "Contenu": "Never gives giftcard reward always says we are looking for a slightly different profile on every survey"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sandy K",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T14:32:28.000Z",
          "Titre": "Total waste of time",
          "Contenu": "Okay at first, but eventually they scammed me. I was paid a little here and there, but when I decided to save my points (95,0000) to redeem for $30 to Paypal, they never paid it. They let me continue doing surveys for two weeks, earning almost 40,000 more points, while I waited for payment. Then with no warning they locked me out and “suspended” my account unjustifiably. They said the account was flagged for “inconsistencies between the data provided in your account and the settings our system is detecting for the machine used to complete surveys; such as using an account in a way that does not match the country of registration.” This is complete garbage because I’m an average US user with an iPhone and no weird settings or anything. Plus I had already been doing surveys with no issues for probably over a month. Total waste of time!"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Kanhaya - Chaudhary",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T13:29:11.000Z",
          "Titre": "Every time survey throw outside.i…",
          "Contenu": "Every time survey throw outside.i attend many surveys and survey 15-20 min. When survey is about to end then So we are thrown out of the survey. totally time waste. Please everyone don't time waste in this."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joe Weigel",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T18:23:19.000Z",
          "Titre": "In the last several days",
          "Contenu": "In the last several days, the site has been unusually slow, I have taken surveys and not been credited and I have been terminated from surveys as I was about to complete them.Not the same site as when I signed up several months ago."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Szabi Antal",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T22:06:24.000Z",
          "Titre": "The earning potential is super slow",
          "Contenu": "The earning potential is super slow. I spent hours on this and haven't even earned $1. The surveys are super low paying (and they are very low) and most of them disqualify you for no reason and you just wasted another 15-20 minutes for no reward. I would avoid Toluna."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Yvonne",
          "Nb_Reviews": 3,
          "Date": "2023-12-07T23:29:54.000Z",
          "Titre": "A lot of your surveys are…discriminatory and agist!",
          "Contenu": "A lot of your surveys are discriminatory and ageist. I spend a fair amount of time giving you my information, then 10 minutes into the survey, you conclude that I am not your goal person.  This makes me angry. Maybe you should identify who is your target people are BEFORE in the initial email!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert - Barnes",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T07:13:58.000Z",
          "Titre": "I take the time to do the first survey…",
          "Contenu": "I take the time to do the first survey and at the end I get a sorry an error has occurred. Its a turn off for someone who wants to get started with the service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sarah Engstrom",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T16:53:54.000Z",
          "Titre": "I used to be a very happy user of Toluna, and now I am an extremely frustrated user. This company is Fishy, do not use it!",
          "Contenu": "I have been a user of Toluna for about a year with great success. I even went as far as giving a great review on the Google App Store shortly after becoming a member. However, as of today, I have received an email saying that I did not get my points processed and that they were canceled. The cancelation was not done on my end, and now I have been having issues with accessing my account. I have emailed support through multiple sources such as inquiry tickets, helpdesk, and Luna, the AI helper assistant, and I have received nothing but automated emails that do nothing to support or resolve my issues. Update as of 12/12/23Now, as an honest,kind stay at home mom, I am being accused of doing illegal misconduct and being told I have had my account suspended!? Something is just not adding up here.12/14/2023THIS COMPANY IS A FRAUD PRETENDING TO BE A LEGITIMATE COMPANY! THEY HOOK YOU FOR A LONG TIME AND THEN THEY ACCUSE YOU AS THE FRAUD. STAY AWAY!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mehul Kamdar",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T00:32:56.000Z",
          "Titre": "I spent twenty minutes on a survey that…",
          "Contenu": "I spent twenty minutes on a survey that went dead right at the end. It was a waste of time and your survey site was totally unhelpful."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Barbel",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T05:38:11.000Z",
          "Titre": "Account cancelled.",
          "Contenu": "My account was cancelled as I was accused of \"violating their terms and conditions\". I find this hard to believe as I spent many hours answering Toluna surveys and always completed them honestly and conscientiously. I have absolutely no idea what I did wrong. They punished me by taking all my earnings away. It all sounds a little dodgy to me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nicole",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T18:48:46.000Z",
          "Titre": "This company is a scam",
          "Contenu": "This company is a scam! I completed hundreds of surveys. I accumulated over 35,000 points and chose the PayPal $10 reward. After waiting weeks I was told the reward couldn’t be processed and I would be refunded the points. At that time I would have had over 80,000 points. The next day I was unable to login to my account. After exchanging several emails with them trying to reset my password, I was sent an email saying that my account was suspended due to violating their Terms. Don’t waste your time on these surveys!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lewna",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T09:23:24.000Z",
          "Titre": "Too many errors with 0 points",
          "Contenu": "It seems like half of the surveys end up cutting off near the end with an error page and then you are given 0 points, even though you just spent 20 minutes answering nearly all questions."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Romeo Cam",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T07:34:49.000Z",
          "Titre": "Surveys are scam here",
          "Contenu": "Surveys are scam here. Once you answer everything it will say you are not qualified for this or we look for different qualification. And they don't pay u points. The points they give us in bonus can be only used for charity wow I mean no one is working for charity. Everyone who seeks such job are needy people. But this toluna is super duper scam website. Don't fall prey to such third class online survey job. Very misleading and cheaters."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "elaine - yip",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T23:53:24.000Z",
          "Titre": "working on surveys and suddenly i get…",
          "Contenu": "working on surveys and suddenly i get an error in the middle of the survey. happened a few times."
        },
        {
          "Note": 1,
          "Lieu": "ZA",
          "Pseudo": "gillian - Olivier",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T21:03:43.000Z",
          "Titre": "I never get a survey to complete.",
          "Contenu": "Alway when I try to complete a survey I get turned down or I don't fit the profile, very disappointed in it. I would like to do more surveys."
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "Irish Irish",
          "Nb_Reviews": 8,
          "Date": "2023-12-14T11:35:46.000Z",
          "Titre": "Rewards out if stock far too often",
          "Contenu": "Their invites to surveys always result in a survey being available but their rewards are out of stock far too often. Very disappointing"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jared Balf",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T05:41:11.000Z",
          "Titre": "Not filling out for Toluna",
          "Contenu": "I spent 20 minutes filling out a survey to get to the end and have it say, “we are sorry an error has occurred with your survey”."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Leslie Centner",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T21:47:22.000Z",
          "Titre": "I went through the whole process and…",
          "Contenu": "I went through the whole process and then was told there was a system error. It was then reloading for an extended period of time. 🙁"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "NL",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T00:11:14.000Z",
          "Titre": "I couldn’t complete any surveys",
          "Contenu": "I couldn’t complete any surveys - errors kept occurring 🤷🏻‍♀️"
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "ANCA BOGHITOIU",
          "Nb_Reviews": 4,
          "Date": "2023-12-11T15:51:31.000Z",
          "Titre": "Is Toluna scamming people?",
          "Contenu": "I finished a 15 min survey only for the thing to get \"technical issues\" exactly after me answering the last question... I was supposed to get 1200 points for it but obviously I didn't get anything. The screen just blocked and that was that... Since this is not the first time it happened I am starting to believe there's something very well planned behind these \"technical issues\".... It's so frustrating considering that people do these surveys in good faith, trying to make a difference and that they expect to be paid as it should be. It's not like you are paying a lot but I guess if 500 people have \"technical issues\" exactly after answering the last question,so when the survey is completed,it adds up to 600000 points which is... what... about 5 euro???? But then if 1000 people go through the same thing... You see where I am going with this! It's just ridiculous going on disgusting. I am sorry for even giving you 1 star, but there is no option for 0 stars...."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Ajaz - Aslam",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T23:42:03.000Z",
          "Titre": "Always says not compatible with what…",
          "Contenu": "Always says not compatible with what our company is looking for after doing whole survey"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Shreyoshi - Tarapdar",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T09:50:27.000Z",
          "Titre": "Account blocked after taking my…",
          "Contenu": "Account blocked after taking my personal information.This app is fraud."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Sharmaine DeClercq",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T02:49:10.000Z",
          "Titre": "Hard to quantify for surveys",
          "Contenu": "I have just tried numerous surveys and spent a lot of my time trying surveys and was kicked out, very frustrating. Also you need way to many points to get any reward! You end up losing points because you can’t redeem them for anything."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Barbara Drabek",
          "Nb_Reviews": 6,
          "Date": "2023-12-12T07:40:42.000Z",
          "Titre": "Surveys ask too many questions before…",
          "Contenu": "Surveys ask too many questions before they decide I am not qualitified. Tell me right away so I don't waste my time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "S M-N",
          "Nb_Reviews": 3,
          "Date": "2023-12-06T02:31:31.000Z",
          "Titre": "Survey were time consuming",
          "Contenu": "Survey were time consumingAfter spending several hours over the course of about a week or two. It was not rewarding to put all them time and effort into a survey, to find out when you're done. You dont meet the qualifications. Not to mention the time you've invested does not match up with the rewards. You need 30k point to get a simple meal.  AND for that reason I'm OUT!!"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "kunika - sharma",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T06:49:00.000Z",
          "Titre": "dont trust toluna",
          "Contenu": "i have done everything possible. spent hours doing survey and completing them successfull and have earned approx 18000 points and then my id was suddenly logout and i cannot log in again its saying authecation failed what the hell is this you guys are fake snatched the opportunity from genuine people i will suggest just dont trust toluna"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Michela",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T13:23:51.000Z",
          "Titre": "Unclear rewards",
          "Contenu": "I have been adviced not to be suitable for a survey, only after spending my time completing it. I donated the point balance to a charity before closing my account and most regrettably, the notice message stated that my orders would be cancelled."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 16,
          "Date": "2023-12-02T17:05:39.000Z",
          "Titre": "Scammy",
          "Contenu": "ScammyOn the advert, it claimed that points rewards could be gifts or cash. But all it has in the rewards section is vouchers and so-called rewards of giving points to charities that pay their CEOs ridiculous sums of money - of course, in those cases, the points get converted to cash.I frequently get adverts for surveys that don't exist or it does exist but I fill it in and it claims it's looking for a slightly different profile - in other words, they want to pay you less than the amount of points offered by claiming you don't fit the profile, AFTER getting you to answer a load of questions which are clearly the actual survey."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Iris Nakahara",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T21:46:40.000Z",
          "Titre": "Takes a while to get code then only 15…",
          "Contenu": "Takes a while to get code then only 15 minutes to enter it and usually indicates it is not the correct code"
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "Hansell",
          "Nb_Reviews": 7,
          "Date": "2023-12-09T17:39:04.000Z",
          "Titre": "Not for everyone",
          "Contenu": "It takes a lot of points to cash out. Among other inconveniences.This site is popular but I dont know why. Other sites, like Swagbucks ,are better in my opinion."
        },
        {
          "Note": 1,
          "Lieu": "AE",
          "Pseudo": "customer",
          "Nb_Reviews": 5,
          "Date": "2023-12-12T22:11:47.000Z",
          "Titre": "Very bad condition survey is points not…",
          "Contenu": "Very bad condition survey is points not credited and very long to point is earn withdrawal is long points using very poor wast"
        },
        {
          "Note": 1,
          "Lieu": "PH",
          "Pseudo": "Ronnel De Jesus",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T15:47:10.000Z",
          "Titre": "I can't relogin my account it always…",
          "Contenu": "I can't relogin my account it always say wrong email or password but I use forget password but the email don't send to my email fix this please. I already contact toluna about the but there's no response"
        },
        {
          "Note": 1,
          "Lieu": "MY",
          "Pseudo": "MISHAA - VIJAYAKUMAR",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T04:56:03.000Z",
          "Titre": "HI,DON'T WORRY,NOTHING TO SAY ABOUT HONESTY,TRUTHFUL & CONSTRUCTIVE.  AS SURVEY'S SOMEONE NEED TO WIN OR LOSE EITHER TODAY OR TOMORROW BUT WHAT I CAN OBSERVE IN TOLUNA SINCE I REGISTERED IN SEPTEMBER",
          "Contenu": "HI,DON'T WORRY,NOTHING TO SAY ABOUT HONESTY,TRUTHFUL & CONSTRUCTIVE.AS SURVEY'S SOMEONE NEED TO WIN OR LOSE EITHER TODAY OR TOMORROW BUT WHAT I CAN OBSERVE IN TOLUNA SINCE I REGISTERED IN SEPTEMBER 2023,IN WEEK, I UNABLE TO WIN,ANSWER OR SCORE THE POINTS.IN FACT,I WROTE A FEW COMPLAINTS TO THEM BUT THEY ADHERED MY STATEMENT.TOLUNA TEAM,PLEASE WAKE UP!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dave B",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T14:35:07.000Z",
          "Titre": "Giant Pain in the @$$",
          "Contenu": "They sell your phone number, you get spam email,and spam calls !!!! STAY AWAYUpdate :I attempted to fill out the form that they put in their reply and after filing everything out, giving a detailed account of my experience .... I get this message Error:It looks like something went wrong on our end. Please refresh the page and try again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bryan Buchanan",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T08:55:15.000Z",
          "Titre": "Approximately 1 out of 20 surveys…",
          "Contenu": "Only approximately 1 out of 20 surveys I can actually take. If it continues to redirect and I can't take surveys how can I get points or $. The one's I get don't offer hardly any points."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mr M",
          "Nb_Reviews": 26,
          "Date": "2023-12-13T00:51:57.000Z",
          "Titre": "I gave up!",
          "Contenu": "I have tried so many times. I either get a weird thank you screen when I press start survey, or I start a survey and get sorry and error occurred and that's that. Tried on mobile browser and my PC both edge and chrome."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Bauer",
          "Nb_Reviews": 7,
          "Date": "2023-12-12T02:25:04.000Z",
          "Titre": "They don't pay out rewards. Avoid.",
          "Contenu": "Suspended my account for no reason when I attempted to cash out a $15 reward. This is a scam survey site. Don't sign up for them."
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "David Withell",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T05:17:53.000Z",
          "Titre": "Did not receive any points",
          "Contenu": "I did a 25 minute survey that actually took me an hour and I didn't even get any of the points promised. Won't do anymore surveys until it appears 4,000"
        },
        {
          "Note": 1,
          "Lieu": "PH",
          "Pseudo": "Mara",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T14:40:34.000Z",
          "Titre": "Discontinued with mo rewards after being in the survey for a long time.",
          "Contenu": "It is pretty annoying when you are 75% in the survey and suddenly it closes because it’s filled or there’s an error and can’t go back."
        },
        {
          "Note": 1,
          "Lieu": "TH",
          "Pseudo": "HOTND Official",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T11:31:03.000Z",
          "Titre": "Can't claim my reward",
          "Contenu": "Can't claim my reward. I've been doing their surveys for almost a month. They sent me an unredeemable code for my reward. Their support said they'd fix it, but it's been a week, and I still couldn't claim the reward."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joe Z.",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T18:51:03.000Z",
          "Titre": "Tired of spending large amounts of time…",
          "Contenu": "Tired of spending large amounts of time on surveys giving lots of information to have an error with no credit, or even worse... after all the info being told that I don't qualify and only get a few points"
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Clive",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T03:43:17.000Z",
          "Titre": "Most surveys do not let me complete…",
          "Contenu": "Most surveys do not let me complete them or they only partially complete then drop out. Really annoying software!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jonathan - Bellini",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T21:23:38.000Z",
          "Titre": "Measly points for the time EFFORT…",
          "Contenu": "Measly points for the time EFFORT INVOLVED COULD BE MORE GENEROUS 1000 POINTS PER SURVEY PLEASE."
        },
        {
          "Note": 1,
          "Lieu": "MY",
          "Pseudo": "Jake Goh",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T07:33:15.000Z",
          "Titre": "Wasting time in doing the not suitable survey",
          "Contenu": "There are not much of survey available, some even after we complete it and it stated that is not suitable for our profile. In this case, this is totally waste of our time, why it doestn't filter out at the first place, after we complete the survey only it stated like that and didnt counted the point to us, this is wasting of our effort."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Charles Bishop",
          "Nb_Reviews": 3,
          "Date": "2023-12-12T21:41:36.000Z",
          "Titre": "Halfway through the survey",
          "Contenu": "Halfway through the survey, git an error message saying something had gone wrong. Great start!!"
        },
        {
          "Note": 1,
          "Lieu": "PH",
          "Pseudo": "Jovel clark - Contratista",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T07:03:47.000Z",
          "Titre": "Every time you answer a survey, it will not give you points",
          "Contenu": "Every time you answer a survey, it end up that particular survey got all my answers and then it will tell you that they are looking for slightly different profile. Meaning, you will not be granted with points. I don't recommend toluna as a side hustle."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Peter Fulcher",
          "Nb_Reviews": 3,
          "Date": "2023-12-06T15:57:51.000Z",
          "Titre": "Great diffficulty redeeming points for…",
          "Contenu": "Great diffficulty redeeming points for gift vouchers.Most times webpage says Toluna has just run out of surveys"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Barbara Middlemast-Neal",
          "Nb_Reviews": 11,
          "Date": "2023-11-25T21:00:30.000Z",
          "Titre": "Many of the surveys don't work",
          "Contenu": "Many of the surveys don't work - you get about 1/3 of the way through and \"sorry, something went wrong\".Sometimes the site directs you to a German language site (not helpful if English is your only language). Site also directs you to multiple surveys from which you are immediately screened out. Absolute waste of time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ilene - tannahill",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T06:42:16.000Z",
          "Titre": "I spent half an hour on my first sutvey…",
          "Contenu": "I spent half an hour on my first survey just to encounter an error from the survey source."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Rishika - K",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T07:08:12.000Z",
          "Titre": "Not allowing to login",
          "Contenu": "Not allowing to login. Shows authentication failed without any reason. No customer support was given. Not able to cha ge the password too. Very disappointed. Worst app."
        },
        {
          "Note": 1,
          "Lieu": "PH",
          "Pseudo": "Katherine",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T22:28:06.000Z",
          "Titre": "i cant log back in",
          "Contenu": "i cant log back in, i tried the reset password option but i never received any emails to reset my password. it keeps saying authentication failed/error."
        },
        {
          "Note": 1,
          "Lieu": "PE",
          "Pseudo": "Ana Belen",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T18:01:51.000Z",
          "Titre": "Worst platform",
          "Contenu": "There are many problems with your platform. First, the rewards they give are a pittance, especially compared to the other rewarded survey platforms. In the whole year I have gotten less than 20 dollars from you and I have completed too many long surveys for such a miserable reward that in addition to scoring few points for each one, I have to reach an extremely high score which takes more than six months to achieve. Secondly, sometimes you don't even add up the points, I am completing surveys and everything is fine until the moment when I have to look at my points total to see that even though I have completed the survey correctly, you don't deign to add up my points. Third, the surveys are almost never available, I know that not many of them fit my profile but it is strange that I am the only platform with these problems when in all of them it is almost always the same surveys. And when there is a survey as soon as I open it, it says that it is no longer available even though it appeared a few seconds ago. Finally, their roulette is designed to not even make us earn 10 points, if they will never give surveys at least improve their rewards roulette. It is the worst paid survey platform out there."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Kristy",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T06:38:53.000Z",
          "Titre": "I was part way through the survey and…",
          "Contenu": "I was part way through the survey and the page closed and wouldn’t reload."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Albert Osagie",
          "Nb_Reviews": 5,
          "Date": "2023-12-05T12:33:47.000Z",
          "Titre": "Broken survey link",
          "Contenu": "Every time I tried to take a survey the page is awlays broken with a notification that something went wrong its not you but us try again later"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "xyz",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T00:01:23.000Z",
          "Titre": "The surveys didn't work",
          "Contenu": "The surveys didn't work!  came across errors on every attempt.  Seems sketchy!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "irfat jaan",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T10:30:04.000Z",
          "Titre": "I was just about to withdraw my points…",
          "Contenu": "I was just about to withdraw my points but suddenly my account logged out and I tried to re login but couldn't login to my account. Please look into my account and fix the problem and I will give you five star. Same email trustpilot and toluna"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kelly Whitener",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T05:13:35.000Z",
          "Titre": "Waste of time",
          "Contenu": "Well I did the whole survey and when I got to the end it said there was an error with your survey like you were trying to waste my time"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "….",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T17:50:20.000Z",
          "Titre": "Scam!!!!!",
          "Contenu": "What a total scam and waste of time. I tried to redeem points for a $10 credit to my PayPal and it never arrived, when I inquired about it they gave me a blanket email and they also locked me out of my account and I was unable to reset mysteriously. It’s not worth your time. Don’t do this one, so many others to try."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Manorama - Pal",
          "Nb_Reviews": 2,
          "Date": "2023-11-26T13:59:11.000Z",
          "Titre": "More points but point value is very low…",
          "Contenu": "More points but point value is very low if we say rs 100 to 10 rupe note but real value of that is only 10 rupees not 1000 minimum withdrawal is 21000 point that's equal only 200 😂😂😂😂😂"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "MUKUL - DAS",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T11:45:27.000Z",
          "Titre": "You people are chitter because you want…",
          "Contenu": "You people are chitter because you want free survey by us and earn money yourself. Just before survey completion you people display ERROR on survey site and bound us to leave survey."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Liz Newton",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T16:57:32.000Z",
          "Titre": "Reward vouchers never arrive and…",
          "Contenu": "Reward vouchers never arrive and mysteriously neither do replies to emails enquiring why...."
        },
        {
          "Note": 1,
          "Lieu": "PH",
          "Pseudo": "Mary - Engelbrecht",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T15:17:10.000Z",
          "Titre": "The assesment to qualify a person to do…",
          "Contenu": "The assesment to qualify a person to do a survey is ridiculus. It takes time for the points to be added. You dont have a chance to win on a game to spin and the other game also hang."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "vasantha",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T17:35:56.000Z",
          "Titre": "Very less points for the time we…",
          "Contenu": "Very less points for the time we spent... this is the only site that pays poorly.. the length of the survey is high but the points are very less.. it takes months to accumulate 50000 points to be able to redeem and that too for the mere 500 rupees"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Stephen",
          "Nb_Reviews": 3,
          "Date": "2023-12-14T18:31:02.000Z",
          "Titre": "The something went wrong!",
          "Contenu": "The something went wrong! header came up again towards the end of the survey!!!This is not the first time that this has happened….."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Lachlan",
          "Nb_Reviews": 3,
          "Date": "2023-12-14T14:19:24.000Z",
          "Titre": "Got 15 min in and it then said sorry…",
          "Contenu": "Got 15 min in and it then said sorry something went wrong with your survey! So won’t be doing that again"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "kalyani nimbalkar",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T14:10:22.000Z",
          "Titre": "Not rewarding.",
          "Contenu": "I just completed a survey but I did nit receive any points even though the survey was completed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Henderson",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T05:42:31.000Z",
          "Titre": "Not what you are looking for!!",
          "Contenu": "Apparently you are looking for an ethnic person who lived in a big city and is 25-35 years old.  Sorry, I'm a small town white male in his 70's and nobody wants my opinion.  This has been a big waste of my time"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Selin Apaydin",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T03:21:01.000Z",
          "Titre": "my points didn’t get to my account i…",
          "Contenu": "my points didn’t get to my account i have spent an hour completing those surveys and the points just keep getting pending."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael  Mcfadden",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T19:26:48.000Z",
          "Titre": "Not worth the time and make no money",
          "Contenu": "I did not get paid anything for the amount of time i took surveys. I did not have many options on how to get paid cash. I was mislead about how much time and money i could make"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "meera patkar",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T09:14:01.000Z",
          "Titre": "NO surveys & just wasting my time to…",
          "Contenu": "NO surveys & just wasting my time to answers to some irritating questions.N0 points awarded for incomplete surveys, which others give for the efforts & time spent."
        },
        {
          "Note": 2,
          "Lieu": "IE",
          "Pseudo": "Paul - Heaney",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T00:04:21.000Z",
          "Titre": "I spend a lot of time completing…",
          "Contenu": "I spend a lot of time completing surveys and then get a message stating there is a problem loading. Very frustrating after spending 15 to 29 minutes. And this happens frequently despite having updated the ap."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mo",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T21:27:55.000Z",
          "Titre": "I took 3 surveys that ended up being…",
          "Contenu": "I took 3 surveys that ended up being the same. Then I attempted 3 others and either I didn't qualify or at the end there was some issue on your end."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Heather RH",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T19:41:02.000Z",
          "Titre": "Survey Fail",
          "Contenu": "I have started two surveys out of 3 and they fail part way through which is a waste of time. I get the notification that something went wrong."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "bob diehl",
          "Nb_Reviews": 15,
          "Date": "2023-12-15T00:27:00.000Z",
          "Titre": "Can you believe it? We are currently out of surveys.",
          "Contenu": "well here we go again was taking surveys fine no issues then get the message can you believe it we are out of surveys .i have talked 2 customer service probably a dozen times & they blame my internet provider or their security if that is the case it would not be an intermittent issue i think it is a glitch on their end or just plain blocking me !!!!!! here is a thought toluna instead of replying back and making yourselfs look blameless fix the issue once & for all !!!!!!! i prefer a fix over any response ty !!!!!!!!!!"
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "Grant Mcfaull",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T05:43:54.000Z",
          "Titre": "im sick of doing a survey and part way…",
          "Contenu": "im sick of doing a survey and part way or almost all the way through it all of a sudden saying \"we are looking for a different profile\" this is daft...all responses should be taken and points awarded as we have spent time for nothing,...this really pisses us off"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MIke Castro",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T03:31:08.000Z",
          "Titre": "Issues with the surveys",
          "Contenu": "Issues with the surveys. It seems that once I get to the end of the survey to me they completed on the next step o get a message saying “We Are Sorry An Error Has Occured With Your Survey” However, it always happens at the end of the surveys it seems quite odd.It has happened multiple times."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Ken Latta",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T22:15:15.000Z",
          "Titre": "For some reason every time I try to…",
          "Contenu": "For some reason every time I try to respond to an email request to do a survey it comes back saying the survey is not available or a screen saying it is nit my fault appears and my attempt is terminated."
        },
        {
          "Note": 2,
          "Lieu": "GY",
          "Pseudo": "Steph",
          "Nb_Reviews": 5,
          "Date": "2023-12-19T18:53:48.000Z",
          "Titre": "survey had an error partway through",
          "Contenu": "survey had an error partway through, so i probably spent my time doing it and didn't get any points!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "THOMAS MCDOWELL",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T04:15:12.000Z",
          "Titre": "Waste time",
          "Contenu": "You ask the screening questions, then tell me I don't qualify for the survey - ask the same screening questions for the next survey, only to disqualify me again.  You should save the screening questions and use them to choose surveys for which I DO qualify."
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "Niti Anand",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T06:33:31.000Z",
          "Titre": "many time survey gets invalid after…",
          "Contenu": "many time survey gets invalid after filling up the entire survey with the message \" sorry this survey has been filled recently\". simply wasting the time invested in filling up the survey."
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "Sujoy - Mukherjee",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T20:06:21.000Z",
          "Titre": "The payment and payout is very low",
          "Contenu": "The payment and payout is very low, After so many surveys....This money is below the basic minimum wages"
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "doug prince",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T21:49:28.000Z",
          "Titre": "Despite my profile telling you I don't…",
          "Contenu": "Despite my profile telling you I don't drink alcohol or smoke I still get sent surveys on those subjects which is offensive. TOLUNA seems to be the most disorganized survey group I've dealt with. What few surveys come through aren't well written and force people to lie to continue through the survey. And as you should be aware when people are forced to select options they normally wouldn't select this skews the survey and the survey becomes invalid and untruthful."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Marie Lefort",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T01:07:36.000Z",
          "Titre": "Most surveys are not a good match!!",
          "Contenu": "I receive emails saying that a survey is waiting for me. However, when I try to access the surveys, they are rarely a good match -- apparently--, which is very frustrating. If you are interested in young people only, just say it and do not open an account when people who do not meet your age criteria or do not send them an email that will raise false hopes."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Angela Edwards",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T23:23:54.000Z",
          "Titre": "Went thru an entire survey for it to…",
          "Contenu": "Went thru an entire survey for it to have an error when submitting."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Janet Coan",
          "Nb_Reviews": 5,
          "Date": "2023-12-20T00:03:37.000Z",
          "Titre": "spent an hour on a survey which crashed…",
          "Contenu": "spent an hour on a survey which crashed when submitting so go nothing for it"
        },
        {
          "Note": 2,
          "Lieu": "PH",
          "Pseudo": "Chi",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T17:50:06.000Z",
          "Titre": "I am disappointed with you",
          "Contenu": "I am disappointed with you, Toluna. It has been over 6 weeks already and I still haven’t receive my points. And now, December 12, 2023, I finished two surveys but my points hasn’t been credited to my account yet. Do I need to wait for a year for the points to be credited on my account? And I don’t mean to sound rude or anything, but sometimes, the customer support is not even giving enough help or answer to the user of Toluna. They closed the tickets and marked as ‘solved’ without proper solution to the issue."
        },
        {
          "Note": 2,
          "Lieu": "IE",
          "Pseudo": "Margaret Kelly",
          "Nb_Reviews": 6,
          "Date": "2023-12-09T12:14:23.000Z",
          "Titre": "Absolutely fed fed up of spending ages…",
          "Contenu": "Absolutely fed up of spending ages answering survey and at the very end get message pop up saying oops sorry it's not you it's us,come back later,never get those points, Also far far too may points needed for rewards compared to other survey platforms"
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "Barbara",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T21:15:25.000Z",
          "Titre": "It's very difficult to cash in your…",
          "Contenu": "It's very difficult to cash in your rewards in fact I haven't managed to do it yet"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jerry Sodan Sr",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T03:16:15.000Z",
          "Titre": "If you honestly answer you’re rejected",
          "Contenu": "I go through the preliminaries and am then told I’m not what the survey is looking for.  I am rejected about twice as many times as I’m accepted.  I answer the questions honestly."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Angelica Casasola",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T22:38:06.000Z",
          "Titre": "The past three surveys I got an error…",
          "Contenu": "The past three surveys I got an error message when I was almost done with them."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Nadine Mills",
          "Nb_Reviews": 9,
          "Date": "2023-12-11T14:49:30.000Z",
          "Titre": "Completion of entire surveys for no reward",
          "Contenu": "I have been a member of Toluna for a couple of months. Over that time the one fault I keep getting is undertaking a survey which takes 15-20 minutes - It gets right up to the end when they then ask for personal details like age, salary bracket etc. The survey then concludes and when you press the last button - you get the Toluna page saying 'this survey just filled up heres 50 points'. It is just so wrong as the client has got all the data gathering and you've got nothing for your time. This has occurred now on several occasions and I feel very conned by this. When I contact customer service they just give a generic reply and don't really seem to grasp the issue. Ive had a couple of rewards but beginning to get very frustrated with this company and the fact that this keeps happening."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 5,
          "Date": "2023-12-18T00:43:16.000Z",
          "Titre": "I got ONE survey completed out of dozens",
          "Contenu": "I got ONE survey completed out of what seemed like dozens of attempts in multiple hours. I feel like I'm wasting my time."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Glenn",
          "Nb_Reviews": 6,
          "Date": "2023-12-11T10:42:02.000Z",
          "Titre": "On average I receive around 9 Toluna…",
          "Contenu": "On average I receive around 9 Toluna Surveys per day, Of the 9 surveys I receive I would be very lucky for 1 of them to go through. This has been happening now for over a month. I have a better success rate with other Companies for Surveys.  Sorry"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "PatriciaD",
          "Nb_Reviews": 14,
          "Date": "2023-12-14T07:22:50.000Z",
          "Titre": "I have to spend 5 minutes complete the…",
          "Contenu": "I have to spend 5 minutes complete the same set of questions each time, to only then get rejected from the survey. Extremely annoying."
        },
        {
          "Note": 2,
          "Lieu": "ZA",
          "Pseudo": "Tefo",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T13:16:47.000Z",
          "Titre": "You always get me survey that I don't…",
          "Contenu": "You always get me survey that I don't qualify for"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Arlene",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T21:16:26.000Z",
          "Titre": "I spend too much time answering questions that were not actually part of the survey",
          "Contenu": "I spend too much time answering questions and then being told I do not qualify.I had two surveys today which quit and went back to the main page.  I may not have qualified for those either, however, that was never said.At least twice I clicked on the survey taps and got the main page again.I completed on survery and at the end was given an error message.Overall, I spent over an hour and actually completed and told I would get credit for one short survey."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Sharron Scott",
          "Nb_Reviews": 4,
          "Date": "2023-12-17T21:39:44.000Z",
          "Titre": "Not a great user expereince",
          "Contenu": "Out of 4 surveys completed 2 failed at the end point showing an error message and there is no way of progressing or reporting the issue and this could be a huge time thief as it tends to be at the end of the surveys and this is where you would gain your points for your insight."
        },
        {
          "Note": 2,
          "Lieu": "AE",
          "Pseudo": "AAA",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T12:32:53.000Z",
          "Titre": "Recent issue with the website",
          "Contenu": "I always enjoyed using Toluna and I am thankful for the financial rewards received in exchange for giving our honest opinion. But recently, it is increasingly very difficult to login to my account although I keep trying multiple times. Also, the same is happening using either the Edge or Google browsers. Sometimes I am able to login but then the website crashes and logs me out.I made sure that VPN was off, but the same problem continued.Thank you Toluna once more and I hope this issue is sorted once and for all."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Alice Tmea",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T01:46:39.000Z",
          "Titre": "Surveys give errors and don’t load on…",
          "Contenu": "Surveys give errors and don’t load on my PC, but they work on my mobile phone."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "RUTH DELLER",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T17:01:50.000Z",
          "Titre": "Emails not delivered to my primary…",
          "Contenu": "Emails not delivered to my primary email addressSlow delivery of rewards."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "George Yarkie",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T01:50:39.000Z",
          "Titre": "I get surveys that do not support my interests",
          "Contenu": "I get surveys that do not support my interests. Cars, travel, alcohol, sports, cigarettes I don't do any. I also get multiple sending of the same survey. Many of my surveys also ask for my age, postal code and province multiple times over and over. Today was 4 times in a row on one survey."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mary - Bromen",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T04:49:17.000Z",
          "Titre": "I don't qualify for very many surveys",
          "Contenu": "I don't qualify for very many surveys.  I am a very active 67 who looks and acts like 55.    When put my age in the survey boom \"thank you for time but we are looking for a different participant\"  and a lesson on how to get picked.  I do write surveys that I take my time, write meaning full responses, and care about the surveys subject."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Hugh - Gordon",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T13:23:16.000Z",
          "Titre": "Glitches in connectivity issues",
          "Contenu": "Glitches in connectivity issues, repetitive questions within the same survey.modern day dumbos who think they're way clever but in real are just grist to the mill."
        },
        {
          "Note": 2,
          "Lieu": "IE",
          "Pseudo": "Simon Jegan Porphy",
          "Nb_Reviews": 6,
          "Date": "2023-12-17T10:40:34.000Z",
          "Titre": "The entire survey experience to be deceptive.",
          "Contenu": "I find the entire survey experience to be deceptive and unsustainable.Participating in surveys seems to be a futile effort, as it often results in a significant waste of time. After dedicating a substantial amount of time to answering survey questions, the disappointing revelation is that one is frequently deemed ineligible for the survey. This recurrent pattern raises suspicions about the legitimacy of these survey platforms.It appears that these survey companies might be primarily engaged in data mining, leading to concerns about the potential misuse of personal information. The overall experience leaves one questioning the credibility and ethical practices of such survey provider."
        },
        {
          "Note": 2,
          "Lieu": "SG",
          "Pseudo": "Clev",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T04:16:41.000Z",
          "Titre": "Surveys Already Full So Could Not Proceed Halfway Through",
          "Contenu": "After answering a myriad of questions, suddenly the survey was full. This happened not just once, but many times. Please profile properly and direct your emails to the right groups of participants."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Kirsty",
          "Nb_Reviews": 4,
          "Date": "2023-11-30T00:53:36.000Z",
          "Titre": "Great when going well",
          "Contenu": "Great when going well, my favourite survey site. But problems occur often. Currently can complete surveys but I'm not aloud to cash in any points. When questioned told it was a vpn which I donf know what that is or inconsistent answers. Also wrong I spend ages taking time to answer, just an excuse. I've emailed twice with no response. I'm currently doing a product trial for a well known company, I'm going go email them and let them know whats going on with the company they are using. Really quite upset as this is how I pay for anything for my children."
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "Danish - Asgar",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T13:56:50.000Z",
          "Titre": "Nice app",
          "Contenu": "Nice app, but needs to improve more, should provide more surveys and should increase the referral limit, atleast upto 50-60 referrals per month"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Deanna Greer",
          "Nb_Reviews": 7,
          "Date": "2023-11-27T20:58:40.000Z",
          "Titre": "I can't do the surveys",
          "Contenu": "I can't do the surveys, i have tried to work with the customer service team but I always get there are no more surveys in which the response was my answers are inconsistent. I don't think many are but they get very repetitive after awhile. And to get enough point to redeem anything is a lot more time and effort than other survey platforms. I wish to donate the rest of my points to the Morocco donations and i am closing my account."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kelly G (USA)",
          "Nb_Reviews": 3,
          "Date": "2023-11-21T16:22:04.000Z",
          "Titre": "Very Frustrating!",
          "Contenu": "Sometimes answering the surveys is a waste of time as most of the time I dont even finish before there is an \"error\" message. Its very frustrating. Trying to get enough points is impossible when you cant even complete a survey. Wondering if I should just quit this before I waste anymore time. Oh, and the rewards can only be gotten when you complete surveys and if your not getting the points because of \"errors\" and to get a voucher is over a hundred thousand plus....well its almost impossible to earn anything."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Rose-marie Mckinnon",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T20:29:03.000Z",
          "Titre": "hard to qualify for the surveys"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nyema",
          "Nb_Reviews": 3,
          "Date": "2023-12-02T06:31:56.000Z",
          "Titre": "Ever since the transformation",
          "Contenu": "Ever since the transformation, things have been different with the platform. I'm hoping for another revamp to make Toluna more user friendly. It's difficult taking surveys but not impossible."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "sarah",
          "Nb_Reviews": 8,
          "Date": "2023-11-29T20:20:48.000Z",
          "Titre": "Found expired points",
          "Contenu": "Found expired points, didn't realise, wish you'd warned me. Not been fully functional for a few months but must try harder from now on so doesnt happen againl"
        },
        {
          "Note": 2,
          "Lieu": "AE",
          "Pseudo": "Shivily Jamal",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T01:57:07.000Z",
          "Titre": "Receive very less surveys.",
          "Contenu": "Receive very less surveys.Some surveys after completing some portion, will stop in between saying you are not qualified.Takes months to earn a voucher."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nogan glmsia",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T13:26:01.000Z",
          "Titre": "I cannot solve a questionnaire .When I…",
          "Contenu": "I cannot solve a questionnaire .When I enter a questionnaire to solve it,it takes me out of it and this phrase appears\"Can you believe it? We are currently out of surveys.\""
        },
        {
          "Note": 2,
          "Lieu": "PH",
          "Pseudo": "Dorotea - Estrella-Jalova",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T07:13:39.000Z",
          "Titre": "It always disqualifies you",
          "Contenu": "It always disqualifies you. Few surveys. And it keeps asking your personal info, like age, gender etc. I suggest you save all those info so you don’t have to repeatedly ask the same questions. It’s time consuming and tedious. And it would really help to explain what kind of  respondent you needed so we don’t have to waste our time answering bunch of questions for you to just disqualify us. Be better."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Jon Ban",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T16:13:36.000Z",
          "Titre": "Do Toluna think life's a gamble?",
          "Contenu": "Overwhelming majority of survey invitations fail to connect successfully with whichever survey interface invitation appears to have been intended to link, usually resulting in messages perceived as errors, for example  \"Oops, something went wrong\", \"We are sorry, an error has occurred with your survey\", \"It's not you it's us. Please try again\", 504 error The request could not be satisfied\", \"504 gateway time out\" or most commonly \"Can you believe it? We're currently out of surveys...that match your profile\""
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Richard C",
          "Nb_Reviews": 3,
          "Date": "2023-12-13T00:52:30.000Z",
          "Titre": "You won't make any money here.",
          "Contenu": "There are very seldom surveys available and when they are you get bumped off right away."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "William Alder",
          "Nb_Reviews": 7,
          "Date": "2023-11-20T15:07:34.000Z",
          "Titre": "There will be dozens of \"available\"…",
          "Contenu": "There will be dozens of \"available\" surveys when I log in. I'm surprised if one of those is capable of being completed every couple of days. My beef is not necessarily that I have very few rewardable surveys but that I get so many that I'm \"not the group we're looking for\". Your screening software is badly broken and I end up wasting a lot of time clicking on surveys that I can't even start."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sidney Jackson",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T21:01:26.000Z",
          "Titre": "Bad action.",
          "Contenu": "Several times I have tried to begin a survey after receiving a notice that new surveys were available and went to take one without success.  A notice would come up saying no surveys available.  Not good."
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "Subramani - Manikandan",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T12:44:13.000Z",
          "Titre": "Bad algorithm",
          "Contenu": "Well, most of the offered surveys are taking initial information and suggesting it's not me, it happened 90% of my surveys"
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "Shilpa Srikanth",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T06:20:15.000Z",
          "Titre": "Points given are very less for survey…",
          "Contenu": "Points given are very less for survey and redemption points are more for less rewards"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Caroline  J.",
          "Nb_Reviews": 21,
          "Date": "2023-11-15T16:29:49.000Z",
          "Titre": "Hot Air Balloons 000ooo00s",
          "Contenu": "Encouraging people to join Toluna you offer Vouchers, ummh appealing. Problem when I finished my survey questions which was ok I was eager to see what I had earned. How complicated you make it with all the Zeros for points. An opening oneliner says Get ur £20 Voucher   Why don't you include the word WHEN after Voucher ? I also was left to decifer how many Zeros were in what category I had to get in to qualify. Come on be realistic why not just use a points system of 1- 50 or something? Not 100,000 qualified then novice 300000 master 500000 then trainee 10000 What a load of 00oo00 bubbles and underwater big puffs of nonsense. Nevermind hopefully the next survey I look at won't be written by the same writer as this one."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Screenout",
          "Nb_Reviews": 4,
          "Date": "2023-11-15T04:52:55.000Z",
          "Titre": "Errors, Misleading Time Committment, and Few Points",
          "Contenu": "I keep completing surveys that are much longer than promised (says 5 minutes, but actually take 20-25 minutes) and then AFTER I've completed it and hit Submit, I continually get errors and then are not credited with points. The points are abysmal for the amount of work required."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Brett - Starkey",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T04:25:52.000Z",
          "Titre": "Too many broken surveys",
          "Contenu": "Too many broken surveys. Surveys that say 5 mins but take 25 mins. Too much rubbish in general. Rewards are low in comparison to others"
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "Sowmya - S",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T12:59:12.000Z",
          "Titre": "The surveys are low paying and most of…",
          "Contenu": "The surveys are low paying and most of them tell you that you are not eligible for the survey midway which is a total waste of time. I have also recently noticed a decrease in number of surveys."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Cameron Foster",
          "Nb_Reviews": 6,
          "Date": "2023-11-29T19:48:35.000Z",
          "Titre": "You keep sending me opportunities to…",
          "Contenu": "You keep sending me opportunities to take a survey, then say \"Can you believe it? We're out of surveys!\" That, of course, is a blatant lie. If I am not a suitable candidate for a survey, tell me that. Don't lie to me!"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Tony Underlay",
          "Nb_Reviews": 4,
          "Date": "2023-11-12T12:48:48.000Z",
          "Titre": "Fun but not worth it",
          "Contenu": "First time doing this. Actually quite good fun and cathartic in many ways. As it gets to know you, you end up giving opinions on things you actually like talking about. I answered some questions about a new car launch; said what a great car but it will fail because of ridiculous / embarrassing name ! Let's see if it has any effect ! BUT and its a big BUT - to earn any cash out of this (something useful rather than a single coffee or a sausage roll) would take weeks. To get to £35 for PayPal - an actual cashable reward - would probably take 5-6 days FULL time. So, not worth it really - unless you're bored."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Larry Finkel",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T14:38:44.000Z",
          "Titre": "Keep clicking through and getting…",
          "Contenu": "Keep clicking through and getting screen that says, \"Oops, something went wrong, and it's our fault\"Many surveys freeze and can't proceed when in the middle of it.A could I did used 20 minutes of my time, and right near the end, said \"you don't qualify\" instead of giving me 8000 points, I got 130! Angry at this and almost quit the service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Andrew Scherzinger",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T00:32:47.000Z",
          "Titre": "I do all of these surveys that states will receive money or gift cards",
          "Contenu": "I do all of these surveys that states I'm going to get 3000 points however ONLY receive a MERE 75 points.  To me that is false advertising.Also get half way through answering the questions THEN is stops it?????"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Edwin Poultney",
          "Nb_Reviews": 4,
          "Date": "2023-12-06T16:52:29.000Z",
          "Titre": "Toluna sends far too many emails that just waste time to respond to.",
          "Contenu": "Toluna sends far too many emails and >95% of the time when I click on the the email it says can i believe it they are out of surveys? Yes I can believe it, they are a total waste of time!!!!"
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "Farida Ali",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T21:22:02.000Z",
          "Titre": "I don't get enough surveys as compared…",
          "Contenu": "I don't get enough surveys as compared to what I used to get earlier."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ronald",
          "Nb_Reviews": 3,
          "Date": "2023-11-27T18:19:55.000Z",
          "Titre": "Qualification and completion issues",
          "Contenu": "This panel obviously does not use the profile data that they collected to pre-qualify participants when sending out survey invitations.  Otherwise, we would not have to attempt so many surveys before qualifying to complete one.  There are also far too many \"Oops\" messages which indicates a problem that they seem unable to fix."
        },
        {
          "Note": 2,
          "Lieu": "IE",
          "Pseudo": "Mike Riordan",
          "Nb_Reviews": 3,
          "Date": "2023-11-23T09:19:23.000Z",
          "Titre": "Why does it take 1 to 3 weeks to…",
          "Contenu": "Why does it take 1 to 3 weeks to process a Paypal payout? 8 days now and still no reward. A site yesterday had my payout of 20 euro in my paypal account within 4 hours?? Its ridiculous."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Deuce Fireblood",
          "Nb_Reviews": 5,
          "Date": "2023-12-18T20:40:54.000Z",
          "Titre": "Takes to long to get a PayPal gift…",
          "Contenu": "Takes to long to get a PayPal gift card, surveys are to low"
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "ANGELITA LARA",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T23:50:56.000Z",
          "Titre": "the redemption points seemed very low",
          "Contenu": "the redemption points seemed very low, i.e. for paypal, will it really take me to earn 20,400 points before i get to redeem $10?  That seemed to be a lot of efforts to make...."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tina - McMahon",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T16:43:38.000Z",
          "Titre": "Too many times I don’t get picked for…",
          "Contenu": "Too many times I don’t get picked for surveys so it’s not worth my time"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Olga Cao",
          "Nb_Reviews": 2,
          "Date": "2023-11-14T01:09:07.000Z",
          "Titre": "Delay or Unpaid Rewards",
          "Contenu": "When I first started using Toluna it was great. I had no issues when claiming rewards for my points accrued. However, lately, I have had to contact them multiple times for missing rewards. A couple of times I just gave up because it was too onerous and I felt my peace of mind was not worth the $25 reward. This is a shame because I recommended them to various friends but at this point, I don't feel I can do that anymore."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Denise A",
          "Nb_Reviews": 2,
          "Date": "2023-11-13T15:43:59.000Z",
          "Titre": "This site used to be a fun",
          "Contenu": "This site used to be a fun, social way to take surveys, play some fun games and talk with people all over the world. After the site rehaul, it is now impossible to talk to anyone else on the site, the only way is an overly co fusing forum which is the opposite of user friendly. The last straw was when recently over half my points just disappeared on my birthday and I was told they had \"expired\" and that this was clearly posted....there was NOTHING posted on my page and that had literally never happened to me before and I've been using this site for at least 10yrs. I'm wondering whether it's worth staying now that that's happened on top of everything else. What a shame, it used to be such a great site and a reliable source of a fee extra bucks since I'm on disability."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Andrew Christopher",
          "Nb_Reviews": 5,
          "Date": "2023-11-17T02:28:22.000Z",
          "Titre": "General grievance about points not allocated.",
          "Contenu": "My grievance is not about \"this time\" but at least three previous occasions, when I feel I was taken advantage of (I don't believe it was intentional) with respect points not allocated. On One occasion I had spent a considerable amount of time doing the Nielsen survey (I had completed 4 or 5 sections) and when I clicked to do the next section, I was told that something had gone wrong, and it was your fault, not mine. I have received no points for that one. Not long after that, again I had spent much time doing a survey, which I thought I had completed, but when I clicked I was taken to the home page where the message said I didn't qualify for that survey.Poor form, guys."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Rusty-Anne",
          "Nb_Reviews": 11,
          "Date": "2023-11-07T02:04:54.000Z",
          "Titre": "Not pairing surveys to clients",
          "Contenu": "There isn't surveys that  accept me. How many times must I take 5 minutes filling out a requirement   survey, only to be knocked back, because of age, or some other excuse  why send me surveys I'm not right for.. waste of my time actually"
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "Kp",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T02:27:25.000Z",
          "Titre": "More surveys needed",
          "Contenu": "Surveys are less. After filling in much of the information, questions - msg appears doesn't apply for you - waste of time.Adequate rewards need to be available"
        },
        {
          "Note": 2,
          "Lieu": "IE",
          "Pseudo": "Aisling",
          "Nb_Reviews": 4,
          "Date": "2023-12-13T17:52:00.000Z",
          "Titre": "Toluna low payback for time",
          "Contenu": "The surveys are long and time consuming. The level of points you need to make to even get 5euro is alot of work."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alynda",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T14:21:35.000Z",
          "Titre": "It’s very difficult at times to get a…",
          "Contenu": "It’s very difficult at times to get a survey. Either it’s no longer available or I do not qualify."
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "Chetan - Singh",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T04:37:22.000Z",
          "Titre": "Number of survey I am getting are less",
          "Contenu": "Number of survey I am getting are less. Sometimes survey is completed and money is not given. Sometimes half of survey is done or almost to completion and survey stops saying that this survey is full. How can this be possible in the middle of the survey??? Sometimes in the middle of survey it says you are not right candidate for this survey. Atleast in such situations it should pay half of money."
        },
        {
          "Note": 2,
          "Lieu": "PH",
          "Pseudo": "Takumi - Fujiwara",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T08:42:19.000Z",
          "Titre": "Too much technical problems",
          "Contenu": "Too much technical problems which are making the surveys replying bad, since you're coming to answer but suddenly an unexpected problem will come to stop you, and you're just gonna lost your time, since Toluna isn't giving you any consideration, even when you have proofs.I mean it's ok if it happens seldom, but they often have technical problems. Add the fact it's difficult to contact them for real, because they're replying with copy paste or a bot is doing so. If you finally get in touch with a real person, they're making their solutions pretty well, but not always.Also starting a survey for few minutes, and suddenly kicked out, don't bring you any points as a consideration for your work and time. Other survey websites are giving few points atleast even they disqualified you from a survey.The contest section is coming soon since more than a year. There are so many things to improve."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Scott  Wetherson",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T10:55:24.000Z",
          "Titre": "It took me 10-15 minutes to go thru a…",
          "Contenu": "It took me 10-15 minutes to go thru a pre-survey survey just to find out that I couldn't participate in said survey. This happened to me about 4 maybe 5 times."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Captain Morgan",
          "Nb_Reviews": 2,
          "Date": "2023-11-24T22:48:03.000Z",
          "Titre": "Often times I log in to do surveys…",
          "Contenu": "Often times I log in to do surveys suggested for me and like today, I tried about a dozen but was only selected for one.  It is sad that I spend so much time but get almost nowhere.  Wish the site/platform worked better"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Janet Williams",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T06:41:12.000Z",
          "Titre": "Frustrating",
          "Contenu": "Most times if I respond to an email, I answer questions only to be told you are \"looking for a different profile.\"I have to search and get turned down several times (2-3) before I actually get to participate in a survey--and for less points that the email stated as a CTA.Sometimes, you answer questions, get redirected, answer some more questions and find out you are not actually doing the survey. And, then, the survey takes MUCH longer than estimated."
        },
        {
          "Note": 2,
          "Lieu": "PH",
          "Pseudo": "Lorien",
          "Nb_Reviews": 4,
          "Date": "2023-12-10T16:01:16.000Z",
          "Titre": "Payment system are so disgusting",
          "Contenu": "Payment system are so disgusting. They paid late via paypal"
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "amit",
          "Nb_Reviews": 2,
          "Date": "2023-11-09T06:08:58.000Z",
          "Titre": "Recently most of the surveys",
          "Contenu": "Recently most of the surveys, I attempted got closed due to overquota at the end.. If the required numbers is achieved, then closed the survey initially rather than allowing people to come in and terminate at the end.. Such a waste if time & effort"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Clare Minchin",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T20:56:18.000Z",
          "Titre": "Either I start a survey and it decides…",
          "Contenu": "Either I start a survey and it decides part wsy in it’s not suitable.Or I get constant reminders to take a survey and it either says there are none or there is an error try later. Worst is spending 10 mins then getting oops something went wrong!!!"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Linny",
          "Nb_Reviews": 17,
          "Date": "2023-11-10T18:49:32.000Z",
          "Titre": "Frustrated",
          "Contenu": "I have become extremely frustrated with Toluna surveys because sometimes I have spent several minutes filling in the survey when it suddenly stops and goes to the home page saying they have enough. Sometimes the error page appears while I am part way through a survey."
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "Kevin",
          "Nb_Reviews": 2,
          "Date": "2023-11-11T08:22:31.000Z",
          "Titre": "The surveys are regular and rewarding",
          "Contenu": "The surveys are regular and rewarding. However the surveys frequently have an error code and cannot be completed therefore no reward. Occurs at any stage of the survey. Most annoying waste of time."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Nicki",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T23:58:57.000Z",
          "Titre": "The site is very hit and miss",
          "Contenu": "The site is very hit and miss. You can nearly finish a task and it kicks you out so unfortunately it’s then costing you time. But, if you’re bored it’s worth a go, you will not earn many points unless you sit on here all day and even then it wouldn’t be great."
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "Adeeba",
          "Nb_Reviews": 6,
          "Date": "2023-11-07T08:38:46.000Z",
          "Titre": "I have faced several issues",
          "Contenu": "I have faced several issues, recently my 3450 points deducted without any prior notice . In many surveys after successfully completing i didn't get points and this happened every month. Surveys do come but not get qualified after giving honest opinions."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Dusan Milutinovic",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T05:49:24.000Z",
          "Titre": "Dearth of surveys…",
          "Contenu": "Most of the time there are no surveys or there are none after one. It is a little frustrating, plus some of the surveys don't key on interesting or 'important' topics."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Charles Hoch",
          "Nb_Reviews": 5,
          "Date": "2023-11-19T14:59:57.000Z",
          "Titre": "The surveys are not user friendly",
          "Contenu": "The surveys are not user friendly. They are very complicated and have no or incomplete directions for completing the process. I spent almost a half hour on the last survey and was not able to complete it. What a waste of time!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kacy Gaimaro",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T23:04:20.000Z",
          "Titre": "Frustrating",
          "Contenu": "Very frustrating for me. It constantly is redirecting me and then it constantly says oops sorry there’s a problem. It doesn’t happen when I do anything else but only when I’m on Tulena"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Graeme Wright",
          "Nb_Reviews": 18,
          "Date": "2023-11-28T04:33:56.000Z",
          "Titre": "No reward for time",
          "Contenu": "You waste our time with too many questions and then you screen us out with no reward for the considerable time spent"
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "Vedant - Prabhalkar",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T05:52:29.000Z",
          "Titre": "Annoying survey",
          "Contenu": "You survey end most time when I am filling my survey form and pop-up windows come this survey form is full."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Peter",
          "Nb_Reviews": 10,
          "Date": "2023-12-03T03:00:04.000Z",
          "Titre": "You rarely allow me to take any…",
          "Contenu": "You rarely allow me to take any surveys.  Half the time you say there aren't any to take, the other 45% you disqualify me."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Barbara Bloom",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T19:41:06.000Z",
          "Titre": "I am trying to get an access code to…",
          "Contenu": "I am trying to get an access code to redeem points. I am instructed what to do but still no success.  You should establish another way to get codeTestAutomated phone call.I am sure I am not the only person having trouble...I do nt receive an access code for redemption of points"
        },
        {
          "Note": 2,
          "Lieu": "SG",
          "Pseudo": "Teck Loon 李迪倫 Lee",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T10:37:15.000Z",
          "Titre": "inquiry #1339062",
          "Contenu": "Few days ago, I sent a query to your Toluna team for the 1st time, asking if you guys know the Lazada e-voucher (Rewards) might still be available for redemption in near/ distant future... cause I notice it's been 'out-of-stock' for around a month already.If YES, I'd continue to wait as I wish to buy some higher-priced items from Lazada and get a discount. If NO, I'd just redeem others such as Fairprice supermarket e-voucher.Yet, the disappointing response reads like a templated reply without answering my question at all, or any indication if Lazada might cease to be 1 of the redemption-partners in future (for example). Not helpful at all, as my query remains un-answered.The original response to my inquiry #1339062: \"Thank you for submitting your request!To see how you can spend your Toluna points, please visit the Rewards section after logging into your account - you will see here the entire list of rewards available to choose from once you have earned enough points to redeem.\""
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Bigbadbaab",
          "Nb_Reviews": 7,
          "Date": "2023-11-08T21:05:15.000Z",
          "Titre": "Lack of concern or assistance by them",
          "Contenu": "Not only did my surveys crash out (again) but when I requested a fix and explained that it was their end they statedthat they could do nothing and that I should fix it.  They have now made the fix, after I had given my remainder points away and was about to close my account."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mrs  A",
          "Nb_Reviews": 10,
          "Date": "2023-11-07T17:53:52.000Z",
          "Titre": "Started very well but !",
          "Contenu": "Started very well but for a long time now I keep being screened out , sometimes after I have been doing the survey for some time. It is now taking me far too long to get enough points to cash out .I can try several surveys on after the other and get nothing for my time. Allso some are taking much longer to complete than it says it will."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Alice Dodean",
          "Nb_Reviews": 3,
          "Date": "2023-11-22T18:21:09.000Z",
          "Titre": "They have interesting surveys but after…",
          "Contenu": "They have interesting surveys but after completing more than 80- 90% of the survey they do not recognize the answers claiming that the profile does not apply. I"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Barbara Hill",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T01:07:12.000Z",
          "Titre": "Unable to take surveys",
          "Contenu": "I have attempted to take several surveys..and unable to do Either survey filled up or. do not meet targeted requirements"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stacy M.",
          "Nb_Reviews": 8,
          "Date": "2023-11-10T20:09:03.000Z",
          "Titre": "These survey companies are just not…",
          "Contenu": "These survey companies are just not paying what my time is worth anymore. I used to do these 20 years ago and the pay was much better. Prices are sky high right now. And this is my thought, if I do not give my time away at work for less than $20 an hour, what makes you think on my time off from work I will just want to freely give up that time to you for less than minimum wage pay per hour. This pay just does not add up to much of anything anymore!"
        },
        {
          "Note": 2,
          "Lieu": "MY",
          "Pseudo": "Keshminder Singh Kehar Singh",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T11:36:42.000Z",
          "Titre": "Time wastage before being linked to an available survey",
          "Contenu": "The surveys are straight forward and easy however, many times alot of time is wasted as after answering multiple questions, the page goes to \"sorry...can you believe it? We are out of surveys at this time\". Bullocks!"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Ian McLeod",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T08:51:55.000Z",
          "Titre": "Promised 9000 points if I completed a…",
          "Contenu": "Promised 9000 points if I completed a survey in addition to the points from the survey as I had not done one for a while. I completed the survey Toluca did not supply the points."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Angela Lee",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T10:01:47.000Z",
          "Titre": "Surveys are poor quality",
          "Contenu": "Surveys are poor qualityDifficult to take when using a mobile phone.Have checked my IP address thoroughlyand found nothing wrong.However. Toluna still say something is wrong with my IP address.Sometimes survey you end up taking is not theoriginal survey you entered.Toluna survey is the only one I have problem accessing with my laptop."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "BeautifulMess",
          "Nb_Reviews": 17,
          "Date": "2023-12-19T19:06:15.000Z",
          "Titre": "I have no idea what I'm writing this…",
          "Contenu": "I have no idea what I'm writing this about. Toluna didn't include in the email a reminder of what help I was requesting. For that reason, I'm giving 3 stars for an average rating. I do, however, know that just before I'm able to redeem, I don't seem to qualify for any surveys that are emailed to me. I get turned away before I can answer even one  question. I make sure that my profile is always updated. So if I'm being sent surveys that are a good match for my profile, how come I'm disqualified before I can answer any questions at all? Anyway, I keep trying."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Swapna - Renigunta",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T08:49:00.000Z",
          "Titre": "Number of surveys I have done but…",
          "Contenu": "Number of surveys I have done but always it as unfortunately you are not eligible for this survey. After spending about 10 minutes or 15 minutes means it's really harsh. Atleast for participating or for spending time , you to provide some points"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Janice - LynchLynch",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T06:37:58.000Z",
          "Titre": "I have had several fail towards the…",
          "Contenu": "I have had several fail towards the end. I have also spent several minutes answering questions only to be rejected. Surely some of this xould be kept on file"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Davey",
          "Nb_Reviews": 2,
          "Date": "2023-12-22T00:06:36.000Z",
          "Titre": "I love the surveys, but...",
          "Contenu": "I love the surveys. However, about 33% crash near the end and I never receive credit for them. This frustrates me to know when after spending nearly 20 minutes doing a survey. I answered them honestly and with lots of thought. The least you can do is make sure they all work properly. Some of them tell me that I have a non-standard browser, yet it is running in the Toluna app. I just don't get it."
        },
        {
          "Note": 3,
          "Lieu": "SG",
          "Pseudo": "Joyce Chong",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T06:46:14.000Z",
          "Titre": "Most of the questions in the survey…",
          "Contenu": "Most of the questions in the survey seem unclear and unrelated to the topics.I also encountered after finished the survey and while waiting for my reward the whole page hanged"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marion T",
          "Nb_Reviews": 7,
          "Date": "2023-12-22T01:07:25.000Z",
          "Titre": "I love it when it works",
          "Contenu": "I love it when it works, but I seem to be able to get very few surveys. I can go several days without qualifying. It would be 5 stars if I could get in with any regularity."
        },
        {
          "Note": 3,
          "Lieu": "PH",
          "Pseudo": "Albert Fan",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T14:56:33.000Z",
          "Titre": "i like the surveys",
          "Contenu": "i like the surveys; usually available; what i don't like is that when the survey is currently cut without any credit points even having answered several questions already"
        },
        {
          "Note": 3,
          "Lieu": "SG",
          "Pseudo": "erika maglente",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T05:36:19.000Z",
          "Titre": "The wait is over",
          "Contenu": "I was waiting for so long to get a survey and long is I mean like 3 months, ended up, I just needed to update my profile and after I did, I was able to receive surveys to add up to my points. Though there are still times that I have so many surveys on my dashboard, still message prompts appear that I do not have any surveys. Confusing."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Diwakar Ramachandra",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T17:16:46.000Z",
          "Titre": "The rewards are very low",
          "Contenu": "The rewards are very low. You have to complete atleast 15 surveys to earn ₹200, that works out to less ₹13 per survey. Further you saw the profile doesn't fit after completing more than 50% of the survey."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "P. O.",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T21:47:29.000Z",
          "Titre": "Okay to kill time.",
          "Contenu": "Dislike that invote links only connect to designated survey about 50% of the time.Disllike that points for survey completion take too long to be credited and sometimes are not.Like survey opportunities."
        },
        {
          "Note": 3,
          "Lieu": "PH",
          "Pseudo": "Halinaw",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T00:47:41.000Z",
          "Titre": "Great content",
          "Contenu": "Great content, easy UX/UI and good compensation package. However, could be frustrating at times due to redundancy of screener questions only to miss or not qualify for a survey. Also, they should add more payment mode other than Paypal."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "L Fitzgerald",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T15:55:56.000Z",
          "Titre": "Qualify vs Errors",
          "Contenu": "I feel like as soon as I start a survey. It immediately closes out because I don't qualify. Or once I start one it will turn around and tell me that there was there an error."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Trish Hoogland",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T03:51:21.000Z",
          "Titre": "Every survey I have tried to take…",
          "Contenu": "Every survey I have tried to take kicked me out and said it was an error on your part. Frustrating, which is why I quit doing surveys from you in the past. Hopefully it improves"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patrick",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T22:14:46.000Z",
          "Titre": "It’s frustrating to waste hours of time…",
          "Contenu": "It’s frustrating to waste hours of time answering survey questions only to get told I don’t qualify. They have my profile and suggest surveys, I answer 40 questions and then don’t qualify. It feels like a huge waste of time"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Jan Mooney",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T08:03:27.000Z",
          "Titre": "Most was ok but found sometimes forced…",
          "Contenu": "Most was ok but found sometimes forced to put a certain number of responses when I did not agree with enough of the answers. Therefore, my answer was untrue."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Maria",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T01:30:10.000Z",
          "Titre": "It is sad to see most surveys that are…",
          "Contenu": "It is sad to see most surveys that are more of value you don't get a chance to a attempt.Good part is many surveys are available regularly"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Mrs Sheila Crerar",
          "Nb_Reviews": 19,
          "Date": "2023-12-21T00:24:17.000Z",
          "Titre": "Screened out due to age?",
          "Contenu": "Recently I have gone days without qualifying for any surveys, I suspect that I may be being screened out due to my age, which in my opinion is nonsense."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Linda - Voss",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T05:34:03.000Z",
          "Titre": "Many glitches in the beginning",
          "Contenu": "When I started there were so many glitches it was maddening.  When a page would load it would “wrap”, meaning the columns weren’t lined up and it was extremely difficult to follow, I would get error messages, pages wouldn’t come up and more. Tonight was the first time everything went smoothly!  Yay!"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Peter Tingle",
          "Nb_Reviews": 9,
          "Date": "2023-12-16T14:17:31.000Z",
          "Titre": "poor matching",
          "Contenu": "All too often I get almost all the way through a survey only to be told I don't qualify, this is a waste of my time. Surely you have enough information on me to better match surveys to me, often you invite only to tell me after no questions that I dont match, again why send them if I don't match."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Lou Symonds",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T05:50:22.000Z",
          "Titre": "Should have stuck with the previous portal",
          "Contenu": "I have been a member of this survey panel for more than 10 years.  Until recently I was totally satisfied with the amount and topics of the surveys I was receiving.  I do not like the new portal, I prefer the previous portal where you could see the survey topics, time of completion and reward points.  In this new portal, one just has to take pot luck as to the topic you are assigned under each group of priority, quick and premium surveys, often wasting my time trying a survey that is not relevant to my profile.I do hope that Toluna sees this review and seriously considers my constructive criticism of its new portal."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Emma Alexandra",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T14:11:35.000Z",
          "Titre": "Really long survey with no forewarning…",
          "Contenu": "Really long survey with no forewarning and no way to track how far along you are. Not bad, but that was distressing. I also wish there were less personal questions and it was more about opinion. I know demographics matter but I’d really rather not share that with a site I don’t know or trust yet."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Neeraj Goel",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T05:05:11.000Z",
          "Titre": "Redemption of rewards rakes too much…",
          "Contenu": "Redemption of rewards rakes too much time and not a transparent policy, further no points are been issued against surveys completed by me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Melissa Shorter",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T22:41:20.000Z",
          "Titre": "Until today every time I clicked a link…",
          "Contenu": "Until today every time I clicked a link to take a survey I got an error \"It's not you it's us\".  I was ready to unsubscribe when I finally got through today."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Merirose de Pooter",
          "Nb_Reviews": 3,
          "Date": "2023-12-12T20:38:25.000Z",
          "Titre": "and repeat!",
          "Contenu": "Too often Toluna lists many 10-minute surveys, that turn out to be the same--have opened up to ten sometimes!Waste of time and energy for me, not helpful to Toluna.  There may be a survey available of value to us both, but I leave the site without finding it.  This is a relatively new annoyance, and I hope it goes away.  Otherwise I will probably unsubscribe."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Janet Topliss",
          "Nb_Reviews": 5,
          "Date": "2023-12-15T11:58:02.000Z",
          "Titre": "You can fill in half a survey but not get any points for it again don't meet the type of people they want.",
          "Contenu": "I think the instructions are printed too small,  it isn't well explained why the questions aren't moving on when you have made a mistake it isn't easy to see where.  You have often spent a while filling in the questionnaire just to receive a \"sorry we are looking for a different demographic \" so you don't receive any points, or \" sorry it's not you it's us \" message."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 3,
          "Date": "2023-12-17T14:08:48.000Z",
          "Titre": "I don’t like that it takes so long to…",
          "Contenu": "I don’t like that it takes so long to get your reward once you’ve earned it. I don’t like that I almost complete many of your surveys and then am told I don’t qualify or that the survey is full. This happens too often."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Kodhai",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T11:06:49.000Z",
          "Titre": "don't cut offf from surveys mid way when im answering correctly"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Marcel Bédard",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T18:23:40.000Z",
          "Titre": "the connection to a sruvey",
          "Contenu": "The main problem I do have so far, is to get the chance to do a survey, since my IP is often blocked by your system.   Once I can get to a survey, everything is fine."
        },
        {
          "Note": 3,
          "Lieu": "SG",
          "Pseudo": "Preetha",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T16:41:38.000Z",
          "Titre": "Resetting of password disabled: When I could not login using the…",
          "Contenu": "When I could not login using the password and I am unable to login until now. And I am not allowed to reset the password too."
        },
        {
          "Note": 3,
          "Lieu": "PH",
          "Pseudo": "Jeremiah - Aquino",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T22:10:39.000Z",
          "Titre": "I like Toluna because it gives bigger…",
          "Contenu": "I like Toluna because it gives bigger points compare to other survey sites but please inform just immediately if we are not suitable to a survey, most of the times I already answered a lot but at the end it will say that I am not suitable. Thank you."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Shweta Raval",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T15:20:01.000Z",
          "Titre": "Liked the overall Website",
          "Contenu": "Liked the overall Website. But most of the time it happens that we complete whole survey but at the end when the answers are submitted, we got the message of rejection. After spending so much time, it makes us very much upset that we get late rejection."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Jim Ottaway",
          "Nb_Reviews": 3,
          "Date": "2023-12-15T07:32:48.000Z",
          "Titre": "Not always honest",
          "Contenu": "I find it very annoying to enter my details and then be asked for them again if accepted for a survey.  It i also annoying to seem that you have been accepted and then told you don't meet the criteria"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Leanne",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T02:11:25.000Z",
          "Titre": "I do not qualify for a lot of surveys…",
          "Contenu": "I do not qualify for a lot of surveys being a little bit older and not having kids at home"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rhonn Carrillo",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T19:17:26.000Z",
          "Titre": "It's ok",
          "Contenu": "It matched me with a good experience but the ad said a 100 dollars for completed survey Wich I did not get😐"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-12-08T15:23:58.000Z",
          "Titre": "Most surveys make you waste several…",
          "Contenu": "Most surveys make you waste several minutes of your time before dumping you out as \"not required spec\", at least you get a few points for them now. Have had several that have gone full time only to fail on last page and no points added to total...this needs addressing. Overall, this is mainly going to be a software fault. The site itself is easily accessible, easy to navigate and worth the effort when you do get enough points to claim a gift. Score of 3/5 reflects personal experience with content."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Peggy - Roode",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T20:42:35.000Z",
          "Titre": "What I dislike about this company is that the points don't show up.",
          "Contenu": "What I dislike about this company is that when I do surveys, I don't see the points from that survey that was just completed."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Meera",
          "Nb_Reviews": 3,
          "Date": "2023-12-14T12:03:04.000Z",
          "Titre": "Invitations to not-relevant surveys",
          "Contenu": "I am often invited to do a survey and after answering a number of questions I am told I am not eligible . This is in spite of giving information in my profile. It means I have just wasted my time."
        },
        {
          "Note": 3,
          "Lieu": "PH",
          "Pseudo": "Henry - Cain",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T08:30:01.000Z",
          "Titre": "The survey is hard for me to understand…",
          "Contenu": "The survey is hard for me to understand even if it's translated in pilipino word. The question is so hard. Asking some basic information then. It will say the survey doesn't fits you. Why didn't you survey about groceries product or fast food chain like McDonald's what the experience or do you try this product what's will rate for this."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Elizabeth",
          "Nb_Reviews": 5,
          "Date": "2023-12-20T07:51:47.000Z",
          "Titre": "Not one of the best survey sites",
          "Contenu": "Often find half way through surveys you are screened out . Wasting a lot of time. It also takes a lot of surveys to get cash back"
        },
        {
          "Note": 3,
          "Lieu": "NZ",
          "Pseudo": "Fiona Smith",
          "Nb_Reviews": 3,
          "Date": "2023-12-15T07:53:06.000Z",
          "Titre": "Not as good as it was.",
          "Contenu": "The points are useful for paying for my cell phone, however, I am not getting as many surveys as I used to and I am being screen out of more."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Trevor",
          "Nb_Reviews": 3,
          "Date": "2023-12-11T03:39:21.000Z",
          "Titre": "For no apparent reason I was stopped…",
          "Contenu": "For no apparent reason I was stopped from doing any surveys for several months due to being \"flagged\" due to no fault by me, according to your investigation.Making content is no longer easy since a major changes to the sight last year."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Teresa C.",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T21:42:42.000Z",
          "Titre": "A dynamic site, but reward redemption has changed for the worse",
          "Contenu": "I've been a member of this site for many years and enjoyed it. Reward levels are challenging to reach, but it's a friendly, playful environment. However, about a year ago I ordered my usual Paypal reward it was rejected, saying it 'couldn't go through,' even though I don't have this problem with any other rewards site I belong to. So I use the Amazon reward instead now. I find this suspect, and so I can't rate this site very high for trustworthiness in this regard."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "MOHAMMAD KHAN",
          "Nb_Reviews": 5,
          "Date": "2023-12-21T18:13:15.000Z",
          "Titre": "the reward system means that you would…",
          "Contenu": "the reward system means that you would have to spend hours just for a £5 reward. Not sure if it's worth my time."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Rob Nixon",
          "Nb_Reviews": 13,
          "Date": "2023-12-07T22:51:33.000Z",
          "Titre": "Toluna reviews",
          "Contenu": "Toluna is better than many of the review sites and many are interesting while enabling a reward in terms of points which are then transferable. Though you still get the odd survey that you provide information only to be informed that it has closed or your input is not relevant it is rare compared with other survey sites.Overal Toluna is my preferred site of this nature."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brenda Tucker",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T02:50:19.000Z",
          "Titre": "Opportunity for improvement",
          "Contenu": "Opportunity for improvement I have accessed several surveys within a hour of launch and after answering a few questions, it says it full/closed.  Why keep it available"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "peter turnbull",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T04:11:56.000Z",
          "Titre": "Survey couldn’t be finished as it went…",
          "Contenu": "Survey couldn’t be finished as it went into error"
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Bijender Singh",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T02:12:17.000Z",
          "Titre": "Surveys are not available and payment…",
          "Contenu": "Surveys are not available and payment is to low other websites pay me far better than this and on toluna we get easily disqualified multiple times but not on other websites"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nicole Lynn",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T17:48:37.000Z",
          "Titre": "I've had a lot of trouble with surveys…",
          "Contenu": "I've had a lot of trouble with surveys closing or just stopping after almost finishing them and then not getting credit for them"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Vernon Taylor",
          "Nb_Reviews": 9,
          "Date": "2023-12-10T05:38:16.000Z",
          "Titre": "I like Toluna except that I am screened…",
          "Contenu": "I like Toluna except that I am screened out of far too many surveys and often have to do a significant amount of work to reach the point of being screened out - it is very frustrating and it is worse at the weekend. The amount of time I spend working on surveys before I am allowed to complete one is often much longer than the time a successful survey takes and for my wasted time the company shows no material appreciation...It therefore isn't possible to take a quick dip and complete a couple of surveys as a change from other work. It means I have to set aside significant time and be prepared to waste it and be frustrated. Today I must have been screened out of half a dozen or more plus one that had closed and one that had filled up. It can be very frustrating, but other panels usually don't make panellists suffer in that way - maybe their algorithms are better..."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "TIMOTHY HOUSE",
          "Nb_Reviews": 4,
          "Date": "2023-12-14T11:28:40.000Z",
          "Titre": "I Completed the Last Survey Fully on…",
          "Contenu": "I Completed the Last Survey Fully on the Subject of the National Lottery but was not Rewarded with any Points. This was a 20 Minute Survey too. Not Good."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "clarke allen",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T13:24:12.000Z",
          "Titre": "get lots of invites but surveys do not…",
          "Contenu": "get lots of invites but surveys do not apply to me."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "mark ward",
          "Nb_Reviews": 3,
          "Date": "2023-12-03T11:49:07.000Z",
          "Titre": "Daily email recieved",
          "Contenu": "Daily email recieved , supposedly aimed at my profile. Clicked in and had a load of pre questions to complete before being advised the survey is either not suitable or full up,  this typically takes as long as the advertised time for the survey.When you do get a survey they tend to be easy to complete and rewards added . Haven’t cashed any rewards yet as haven’t checked that process yet"
        },
        {
          "Note": 3,
          "Lieu": "ZA",
          "Pseudo": "Mpho - Dau",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T07:11:29.000Z",
          "Titre": "Sometimes you don't get your points…",
          "Contenu": "Sometimes you don't get your points even though you completed the survey until the end. It's a bit frustrating"
        },
        {
          "Note": 3,
          "Lieu": "AE",
          "Pseudo": "Gouri Kulkarni",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T06:50:01.000Z",
          "Titre": "Only 1 out of 5 survey invitations go…",
          "Contenu": "Only 1 out of 5 survey invitations go through till end to  get points. Most of the surveys do not work.  Toluna committee should ensure, that based on the profile, all surveys should work till end to gain the points. Otherwise it is discouraging."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Gary Black",
          "Nb_Reviews": 4,
          "Date": "2023-12-06T13:42:13.000Z",
          "Titre": "I get really annoyed at some surveys",
          "Contenu": "I get really annoyed when I complete a survey and receive a \"your profile does not fit this current survey\" or similar wording. Had it happen a few times now so its not a one off. If my profile does not fit the current survey TELL ME BEFORE I START IT. I'm 77 and after the points and don't need my time wasted."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Sheila Krishnan",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T02:39:30.000Z",
          "Titre": "Surveys sent are not suitable matches…",
          "Contenu": "Surveys sent are not suitable matches and I get disqualified every time."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Zakiruddin Nasir",
          "Nb_Reviews": 5,
          "Date": "2023-12-12T15:29:48.000Z",
          "Titre": "Collecting points is a long tedious…",
          "Contenu": "Collecting points is a long tedious process.More points should be awarded per survey.I think that Lifepoints is the leader in suveys"
        },
        {
          "Note": 3,
          "Lieu": "BD",
          "Pseudo": "MH Shawon",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T06:16:01.000Z",
          "Titre": "Toluna Point Pending Issue",
          "Contenu": "I am faceing point pending issue. When complete a survey properly they said your point will be credited soon...but last 3 days ( 04/12/23,  05/12/23, 06/12/23) each an every surve comleated ( 8 survey complete)  by me...all the point are pending. Can any one tell me this.. Profile issue... Or Toluna website issue."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Rodney Haylock",
          "Nb_Reviews": 3,
          "Date": "2023-12-11T20:54:28.000Z",
          "Titre": "I keep get a message after taking a…",
          "Contenu": "I keep get a message after taking a survey \"its not your fault its ours ,something went wrong.I had trouble getting 2 vouchers I ordered ,it took about a month to sort out."
        },
        {
          "Note": 3,
          "Lieu": "PH",
          "Pseudo": "Evelyn ANCERO",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T06:02:55.000Z",
          "Titre": "I enjoy the surveys given to me as I…",
          "Contenu": "I enjoy the surveys given to me as I relate to most of the products. What I dont like is the frequent technical glitches and the prompt of ineligibility to the survey after spending 20 minutes or more in the survey."
        },
        {
          "Note": 3,
          "Lieu": "NZ",
          "Pseudo": "MJ",
          "Nb_Reviews": 4,
          "Date": "2023-12-05T08:46:13.000Z",
          "Titre": "Good when you can actually complete a survey...",
          "Contenu": "I start so many surveys that I then get locked out of - survey full, don't meet the criteria etc etc. Can be 5 or more surveys in a row and it gets tiresome. Toluna need to do more selective offerings based on the personal profile."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Chiranjit Baidya",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T15:11:15.000Z",
          "Titre": "I am like toluna platform.but toluna…",
          "Contenu": "I am like toluna platform.but toluna many surveys I fill and every survey discolified. I am user this platform from 2019 . I am very disappointed for this app. One time earn redeem points rewards.iam also say this site official to development team to improve it ."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "pat purkiss",
          "Nb_Reviews": 89,
          "Date": "2023-12-16T14:56:43.000Z",
          "Titre": "Dislike.Being directed to the page with…",
          "Contenu": "Dislike.Being directed to the page with a man scratching his head saying, “It’s not you it’s us”."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steven",
          "Nb_Reviews": 3,
          "Date": "2023-12-12T01:37:32.000Z",
          "Titre": "Slim chance at survey success",
          "Contenu": "This was the first or maybe second survey I completed.  I get turned down for almost all surveys.  I probably won't do many more since my odds of taking a survey are only about 1 chance in 20."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Sally",
          "Nb_Reviews": 12,
          "Date": "2023-12-12T16:06:54.000Z",
          "Titre": "Good, but can be annoying",
          "Contenu": "A lot of the surveys I have done recently have gone all the way through then when I press finish it says error, also it is very annoying when you get halfway or more through a survey and it stops and says the survey is full"
        },
        {
          "Note": 3,
          "Lieu": "ZA",
          "Pseudo": "Rosetta Tobo",
          "Nb_Reviews": 6,
          "Date": "2023-12-20T12:16:35.000Z",
          "Titre": "Toluna Experience",
          "Contenu": "Easy and doable surveys but a slow flow and reward system."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paulette Bowen",
          "Nb_Reviews": 7,
          "Date": "2023-12-12T11:41:00.000Z",
          "Titre": "I add a bad experience for the last 4…",
          "Contenu": "I had a bad experience for the last 4 months due to every survey I started give me an error message. \"Sorry there is an error\". \"Ops it not you but us\". I tried every day for 4 months with no success."
        },
        {
          "Note": 3,
          "Lieu": "PH",
          "Pseudo": "JMJay",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T09:01:00.000Z",
          "Titre": "All goods",
          "Contenu": "All goods, and I hope my points credited in my balance, until now its pending."
        },
        {
          "Note": 3,
          "Lieu": "PH",
          "Pseudo": "Mark Anthony - Espiritu",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T05:50:10.000Z",
          "Titre": "REWARDS",
          "Contenu": "In my first to second month the payment processing is great, like you will receive your earnings about 5 days up to 7 days but after 5 months the process of rewards are too long like 4 weeks, and yet they can process the rewards for just about 5 to days. Right?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 7,
          "Date": "2023-12-14T02:01:01.000Z",
          "Titre": "Most of the time when I access surveys…",
          "Contenu": "Most of the time when I access surveys there are no more available which is frustrating."
        },
        {
          "Note": 3,
          "Lieu": "CO",
          "Pseudo": "Natalia Burbano",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T00:01:38.000Z",
          "Titre": "I barely get surveys anymore",
          "Contenu": "I barely get surveys anymore, and haven't been able to claim rewards years ago, not exaggerating"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Bob Dowd",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T01:55:48.000Z",
          "Titre": "I ONLY GET TO COMPLETE 2 OUT OF ABOUT…",
          "Contenu": "I ONLY GET TO COMPLETE 2 OUT OF ABOUT 5, GET \"REJECTED\" SOMETIMES WELL INTO A SURVEY - VERY VERY ANNOYING & TIME-WASTING. aLSO, SOME OF THE SURVEYS ARE VERY REPETITIVE IN THE QUALIFYING STAGES, SAME QUESTIONS SEVERAL TIMES."
        },
        {
          "Note": 3,
          "Lieu": "SG",
          "Pseudo": "Kelvin",
          "Nb_Reviews": 2,
          "Date": "2023-12-03T17:35:26.000Z",
          "Titre": "About 20 mins into the survey and…",
          "Contenu": "About 20 mins into the survey and accidentally press the back key and the survey broken.  Wasting effort.  This is quite common happening.  Sometimes the system broken after the last screen 😔"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Matthew Steeples",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T13:52:41.000Z",
          "Titre": "Toluna",
          "Contenu": "The surveys can be too long and the questions a bit bizarre, but there are plenty of them. The rewards could be given more readily surely also."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "William - Woods",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T16:30:42.000Z",
          "Titre": "Not the right guy",
          "Contenu": "Evidently I'm not a person you're looking for to answer questions. I tried to answer 3 different surveys and they all said not looking for my type person."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Pranesh - Misal",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T08:57:39.000Z",
          "Titre": "I am getting points for completion but…",
          "Contenu": "I am getting points for completion but not surveys that i am completing. Status is pending since 2 days.."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Priscilla Prah",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T12:53:35.000Z",
          "Titre": "Sometimes after answer more than 70…",
          "Contenu": "Sometimes after answer more than 70 percent of the survey then you say the person doesn’t qualify. And award the person with small points which is not fair"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "L Spin",
          "Nb_Reviews": 22,
          "Date": "2023-12-07T22:38:20.000Z",
          "Titre": "It's good if you don’t get locked out",
          "Contenu": "It's good if you don’t get locked out! I have many times spent 15 mins on a survey to suddenly be told that they have reached their limit on survey takers. I don’t understand this at all. From the moment you start the survey you should be locked in. They should not allow people to start if they already have the right amount of people. It’s time wasting and also infuriating. I even wrote to them and got nowhere. They don’t even offer some consolation points to thank you for your time. Otherwise the surveys are good"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "IdJ",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T17:38:54.000Z",
          "Titre": "High disqualification rate.",
          "Contenu": "There are a lot of surveys where I've answered a lot of questions and invested a fair amount of time only to be disqualified."
        },
        {
          "Note": 3,
          "Lieu": "PH",
          "Pseudo": "Gary Marquito",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T16:22:31.000Z",
          "Titre": "I don't know if you intentionally…",
          "Contenu": "I don't know if you intentionally reject me from completing a survey but i have experienced during the many months, i was able to complete only 1 survey."
        },
        {
          "Note": 3,
          "Lieu": "PH",
          "Pseudo": "Leonardo JR. Seco",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T23:08:04.000Z",
          "Titre": "I'm experiencing technical error upon…",
          "Contenu": "I'm experiencing technical error upon opening the app this week.I can't open it 5 fays now"
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Shagun Sharma",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T05:07:26.000Z",
          "Titre": "I really like it but not all surveys…",
          "Contenu": "I really like it but not all surveys pay. The overall impression is really good with timely payouts. Though it shouldn't charge rs. 10 for PayPal transactions. It's irritating."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Phil",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T05:00:29.000Z",
          "Titre": "Finished 2 surveys and each time it…",
          "Contenu": "Finished 2 surveys and each time it crashed at the end of the survey and no points were allocated"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "George Luke",
          "Nb_Reviews": 34,
          "Date": "2023-12-08T16:52:17.000Z",
          "Titre": "I like the concept of lots of surveys but…",
          "Contenu": "I like the concept and lots of surveys but find it frustrating having entered a lot of questions to then find the survey has filled up or it is stated that it is not apropriate."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cindy Ayala",
          "Nb_Reviews": 3,
          "Date": "2023-12-15T03:43:21.000Z",
          "Titre": "So often an error occurs after…",
          "Contenu": "So often an error occurs after completing the survey so points aren’t awarded."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Beverly - Cooper Edwards",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T14:47:08.000Z",
          "Titre": "Most surveys I’m not qualified for I…",
          "Contenu": "Most surveys I’m not qualified for I think because of my age.  Surveys say the are looking for a different demographic"
        },
        {
          "Note": 3,
          "Lieu": "AR",
          "Pseudo": "andylavalle",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T17:27:34.000Z",
          "Titre": "I think that Toluna can be better…",
          "Contenu": "I think that Toluna can be better giving more money for rewards"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Lorraine Burford",
          "Nb_Reviews": 4,
          "Date": "2023-12-16T08:23:45.000Z",
          "Titre": "The reward value is less than I would…",
          "Contenu": "The reward value is less than I would like, quite a lot of surveys on offer"
        },
        {
          "Note": 3,
          "Lieu": "ZA",
          "Pseudo": "Veronica Snyman",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T18:27:51.000Z",
          "Titre": "May times there are no surveys duitable…",
          "Contenu": "May times there are no surveys duitable for me or they have just filled up."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "MMP",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T10:15:49.000Z",
          "Titre": "Several surveys taken and responded but…",
          "Contenu": "Several surveys taken and responded but Toulana indicates at the end \"survey has been filled\" and does not credit points. When raised to through their ticket system the response is unconvincing and irrlevant."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "caroline macfarlane",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T04:38:32.000Z",
          "Titre": "So far most surveys are telling me I…",
          "Contenu": "So far most surveys are telling me I don't fit their profile"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sheryl Graves",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T20:04:53.000Z",
          "Titre": "Many times lost time and points",
          "Contenu": "Many times I spend a lot of time answering questions only to get near the end and the app locks up and won’t let me finish. I have lost a lot of time and received no points as I was unable to finish. Why does this happen?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jazmine - Savage",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T23:48:27.000Z",
          "Titre": "I like how I receive points for taking…",
          "Contenu": "I like how I receive points for taking the surveys. What I don't like is how I don't qualify for most of the surveys or how they seem to fill up right when I go into them."
        },
        {
          "Note": 3,
          "Lieu": "ZA",
          "Pseudo": "Nonkululeko - Ndumo",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T09:49:21.000Z",
          "Titre": "I dislike the fact that when I try and…",
          "Contenu": "I dislike the fact that when I try and do surveys they are always unavailable."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "JP",
          "Nb_Reviews": 10,
          "Date": "2023-12-16T02:12:15.000Z",
          "Titre": "I dislike repeat screening question.",
          "Contenu": "I dislike having to answer the same question regarding if anyone is expecting a baby over and over."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "NG",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T10:52:17.000Z",
          "Titre": "Not Bad, But Need More Realistic / Fitting Surveys...",
          "Contenu": "They do remember some of your choices when screening. I do, however, get screened out a lot. They don't appear to be as invasive about what data they take from your system as others."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carrie",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T20:51:58.000Z",
          "Titre": "Couldn't understand directions in my…",
          "Contenu": "Couldn't understand directions in my email on how to redeem points."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Trevor B",
          "Nb_Reviews": 19,
          "Date": "2023-12-10T18:42:04.000Z",
          "Titre": "The website keeps closing down in the…",
          "Contenu": "The website keeps closing down in the middle of surveys. plus you get points deducted periodically."
        },
        {
          "Note": 3,
          "Lieu": "NZ",
          "Pseudo": "Lindsay McGowan",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T17:57:07.000Z",
          "Titre": "Your site will show several available…",
          "Contenu": "Your site will show several available surveys then when you go to open them it says do you believe it we are out of surveys or you spend time doing the preliminary questions to then find the quota has been met"
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "George Ezirim",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T03:39:39.000Z",
          "Titre": "The company survey is always smooth i…",
          "Contenu": "The company survey is always smooth i hardly experience interruption .point giving once finished. But i have problem with redemption, it take too long to  to receive money in paypal. You should work on that on that , at least once money is approved let it be received that or at worst 5 days. If that is applied it will encourage people to work harder, when they know it wont take long before they receive their money"
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Lene",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T18:16:47.000Z",
          "Titre": "giving them 4stars cause i get a good…",
          "Contenu": "giving them 4stars cause i get a good amount of easy and non-complicated surveys unlike other survey sites. the points they give for each survey is great making it quicker to earn points to redeem. to anyone looking for a survey site that pays out right away, toluna isn't the one for you. the redemption actually takes 3 weeks to reflect on your paypal which is quite long but you can always keep earning points while you wait"
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Norman Florentino",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T04:55:25.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience! Registration to Toluna is completely free - Not only will you never be asked to pay, but just by answering surveys and engaging in fun community activities like content and games, you will earn points that can be exchanged for vouchers and cash payments.Had received multiple payout already but sometimes surveys quite long."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Julie Pereira",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T06:58:32.000Z",
          "Titre": "Team surveys",
          "Contenu": "Surveys were interactive, unique. The time spent in putting my thought to enhance the customer thought process, marketing and economic growth was encouraging.New products were a kickstart 4 me to engage & maintain this relation with TOLUNA.Rewards did make a difference in my account. The team support was encouraging."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "alfred newton",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T14:16:48.000Z",
          "Titre": "Advice From an 80 Year Old Geezer Still Movin' It",
          "Contenu": "One should aleways thrive to learn, maintain and always rremember as much as they can because it is never known that a particular knowledge might come in as important and needful.  It lies there in the back of your brain waiting until it will be called on.  When I went back to college, everything I thought I forgot was actually still there - it just needed a little flavoring."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "richard cowen",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T02:24:48.000Z",
          "Titre": "a progress graph would be great!!",
          "Contenu": "many surveys seem to be in line with estimated times, but often they take far longer than estimated.....a progress graph should be on all surveys, otherwise i am very happy to me a member of toluna community."
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Mulalo Madavha",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T08:52:04.000Z",
          "Titre": "Getting us more survey to participate on",
          "Contenu": "I really love this website it's doing me good I can participate on survey and I earn big playing games also help me to boost my points and it is easy to withdraw your points"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeremy Smith",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T20:25:58.000Z",
          "Titre": "Toluna review",
          "Contenu": "Not over doing notifications,good/relevant questions, rewards I like (if I really do earn them and there is no fine print scam stuff going on)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Newcomer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T03:29:48.000Z",
          "Titre": "Sometimes they fizzle out before…",
          "Contenu": "Sometimes they fizzle out before completing. I have not used any points yet have to see how to redeem them. Usually these are well put together but I get irritated when you change a few words and ask the same question"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Clinton Barlow",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T15:42:51.000Z",
          "Titre": "Great questions about self value and…",
          "Contenu": "Great questions about self value and how I perceive that personally and in the business world.. Too many questions about climate change... We should focus on improving our economy before we try to do anything about climate change."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Ashokkumar Patel",
          "Nb_Reviews": 9,
          "Date": "2023-12-18T15:54:31.000Z",
          "Titre": "many surveys do say 10 mins/ misleading survey time",
          "Contenu": "many surveys do say 10 mins. but turn out to be longer when one connects.some surveys just take information and cuts off before the survey is completed. Very annoying."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Rebecca Braham",
          "Nb_Reviews": 10,
          "Date": "2023-12-16T08:50:59.000Z",
          "Titre": "This is one of the better survey panels…",
          "Contenu": "This is one of the better survey panels and I have been a member for quite a number of years now.  Sometimes it is hard to qualify for surveys and I don't complete many for a while, and next there's a boom.  Reward options are good and varied, and redemptions are now paid much sooner than they used to be."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Shirley",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T07:55:17.000Z",
          "Titre": "The surveys are usually quite…",
          "Contenu": "The surveys are usually quite interesting with few technical issues.  It would be better if I was able to do more of them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Valri",
          "Nb_Reviews": 9,
          "Date": "2023-12-16T00:13:15.000Z",
          "Titre": "I've been with Toluna for many years",
          "Contenu": "I've been with Toluna for many years.  I started out doing some product testing with them and taking surveys.  Now I just do surveys.  It's getting harder to qualify for surveys.  I tend to get disqualified more often now which is frustrating.  I still like the site overall though."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "henry/Nicky",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T02:19:59.000Z",
          "Titre": "you offer many and varied surveys and…",
          "Contenu": "you offer many and varied surveys and are a good survey site but the rewards offered are less than for other survey sites .Good and trusted survey site"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mary Bowers",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T22:53:31.000Z",
          "Titre": "There are always a lot of surveys…",
          "Contenu": "There are always a lot of surveys coming through, might not qualify for all of them, but you do get the opportunity to earn points every day."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marianne Mccumber",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T22:37:59.000Z",
          "Titre": "Good distraction",
          "Contenu": "I enjoy taking the surveys and casting my votes. It's a good way to relax at the end of the day or to pass time when waiting for something to start."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Jo",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T23:39:04.000Z",
          "Titre": "Good but does not accept my personal…",
          "Contenu": "Good but does not accept my personal email address. Insists on business email. Did not allow me to complete survey without business email"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Whitney Millikin",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T01:13:12.000Z",
          "Titre": "Can be a long wait for credit, but plenty of variety & surveys to take in the meantime!",
          "Contenu": "It takes a long time for higher point numbers to come in, since it seems like they stay open for a long time (though I don't see others staying open as long when I try to take them and they're gone). However, the points so always come through. I also like that there is a wide range of points and lengths for various surveys, so I can make them a good use of my time if I am able to take it. And there's always lots of surveys to take!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JULIE SPEED",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T23:13:17.000Z",
          "Titre": "nice today, overall....just ok.",
          "Contenu": "mostly I don't get the whole survey. today, I got some partial credit, which is nice. rewards? not so great. wish better tier of rewards."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Julie Anne Carter Cannons",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T01:09:12.000Z",
          "Titre": "I find I don't qualify always.",
          "Contenu": "I find I don't qualify for a lot of the surveys now a days as I'm older but anyway, never mind."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "John Reyche",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T12:23:47.000Z",
          "Titre": "Good survey website",
          "Contenu": "This survey website gives me the opportunity to engage in different opinions regarding customer feedback. Also, it offers me the opportunity to earn extra rewards by answering simple surveys. On the other hand, sometimes the surveys are not compatible with my profile. I'm hoping for more related surveys for me and that you will continue your service."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "sylvia",
          "Nb_Reviews": 6,
          "Date": "2023-12-19T21:43:17.000Z",
          "Titre": "sometimes your website is not safe and…",
          "Contenu": "sometimes your website is not safe and you are not able to get into and take a survey, that is a bit annoying."
        },
        {
          "Note": 4,
          "Lieu": "AE",
          "Pseudo": "Niren",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T14:31:07.000Z",
          "Titre": "TOLUNA surveys are designed in such a…",
          "Contenu": "TOLUNA surveys are designed in such a way that, the responder feels engaged while completing it."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Ricca",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T03:51:55.000Z",
          "Titre": "I enjoyed so much in participating…",
          "Contenu": "I enjoyed so much in participating different surveys. However, I wish the redemption of PayPal would be faster. Also, I'm hoping to have more surveys to answer. But overall, the experience is great!"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Kavya V K",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T17:13:42.000Z",
          "Titre": "how the services",
          "Contenu": "its very interesting and quite good to work with the company. easy and comfortable to work."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "CJ",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T11:14:53.000Z",
          "Titre": "Everything else is great",
          "Contenu": "Everything else is great, but sometimes the website has some problems when logging in. I have to retry logging in or reload the page a few times."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kerry Royce",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T21:32:48.000Z",
          "Titre": "Everything seems pretty stream lines",
          "Contenu": "Everything seems pretty stream lines. I'm just waiting to get my rewards up and see if I can actually cash out."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michelle",
          "Nb_Reviews": 3,
          "Date": "2023-12-15T16:02:47.000Z",
          "Titre": "I would have given it 5 stars but often…",
          "Contenu": "I would have given it 5 stars but often I encounter a technical glitch when I try to go to the surveys. I think the surveys are interesting and the points awarded are really good."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Arvind - Singh",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T08:33:33.000Z",
          "Titre": "Good Surveys and Reward Redemption",
          "Contenu": "The company gives out loads of opportunities for good surveys and even thought it takes time to redeem rewards, it is always worth it."
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T10:42:20.000Z",
          "Titre": "The questions are phrased appropriately…",
          "Contenu": "The questions are phrased appropriately so it is easy to understand the intent. They are also were formatted -- not the type that asks for Good Vs Negative impressions."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "John Padgett",
          "Nb_Reviews": 3,
          "Date": "2023-12-14T03:50:50.000Z",
          "Titre": "It does take some time, not fast",
          "Contenu": "I don’t mind answering question that are relevant to my interests so it was easy. The questions do get a little redundant and repetitive but all in all it’s good"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Medha Rajput",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T06:09:47.000Z",
          "Titre": "Honestly earlier I was getting…",
          "Contenu": "Honestly earlier I was getting surprised for getting more than two service per day but from now I don't know what happened it doesn't provide proper service as well as it make us out of criteria at the moment when the surveys going to over and other thing is that I want more and more surveys according to my profile"
        },
        {
          "Note": 4,
          "Lieu": "AE",
          "Pseudo": "Robert - Tavengwa",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T08:31:13.000Z",
          "Titre": "7/12/2023",
          "Contenu": "The questions are well designed to get as much info as possible on whatever topics are being researched on. They are not that intrusive comfortable enough"
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Tans",
          "Nb_Reviews": 4,
          "Date": "2023-12-12T01:38:29.000Z",
          "Titre": "I am satisfied with the number of…",
          "Contenu": "I am satisfied with the number of survey invites but very disappointed when the survey stops or suddenly lags for reasons i do not understand..I am also not happy with the long wait to redeem my reward."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Dennis Schneider",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T17:02:30.000Z",
          "Titre": "The last survey",
          "Contenu": "The last survey that I completed was very well written the questions were clear as to what information was to be given."
        },
        {
          "Note": 4,
          "Lieu": "MY",
          "Pseudo": "Aqilah Ikram",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T16:20:35.000Z",
          "Titre": "I LIKE THAT YOU GIVE FAIR POINTS IF A SURVEY IS DONE. HOWEVER, I CANNOT TAKE PART IN SOME SURVEYS EVEN THOUGH IT SAYS THAT IT IS AVAILABLE?"
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Flora Reyes",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T09:35:54.000Z",
          "Titre": "I am a newbie here at Toluna",
          "Contenu": "I am a newbie here at Toluna. So far, so good. I am enjoying and at the same time learning about anything. So far I haven't receive my first paymet but that's okay. I am here to support toluna.. More power."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Noni",
          "Nb_Reviews": 8,
          "Date": "2023-12-18T22:42:20.000Z",
          "Titre": "Long survey!!!",
          "Contenu": "Long survey, sometimes longer than expected. Reward not always worth it"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Rashmi Swain",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T14:09:41.000Z",
          "Titre": "This is one of the genuine survey…",
          "Contenu": "This is one of the genuine survey application I have been using for long time.. their customer service support is good & Totally Trustworthy & highly recommended."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "SIAN ANYON",
          "Nb_Reviews": 6,
          "Date": "2023-12-19T05:32:48.000Z",
          "Titre": "Easy to do and great rewards",
          "Contenu": "Easy to do , great rewards. Finds surveys to suit individual"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patricia  DAngelico",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T21:39:00.000Z",
          "Titre": "Surveys are generally relevant",
          "Contenu": "Surveys are generally relevant, don't like answering 20-30 questions, then being told sorry we are looking for a slightly different profile."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Mattheu",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T23:45:38.000Z",
          "Titre": "Toluna's site is easy to navigate",
          "Contenu": "Toluna's site is easy to navigate, and fair on it's compensation."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Beverly - Martin",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T19:48:58.000Z",
          "Titre": "It is important hat your match the subject matter that your answers will give a true insight of the content  so others can rely on your experience.",
          "Contenu": "One thing I admire about this company is that they let you know early in the survey if you are not a match, so you do not waste time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeffrey Fowler",
          "Nb_Reviews": 9,
          "Date": "2023-12-21T21:15:33.000Z",
          "Titre": "Needs to be more surveys that I qualify…",
          "Contenu": "Needs to be more surveys that I qualify for"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Williams",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T02:21:01.000Z",
          "Titre": "Good personalized surveys",
          "Contenu": "The surveys were about things that I’m familiar with which made answering them easier and more relaxing."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "cherish betonio",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T02:55:24.000Z",
          "Titre": "The rewards system",
          "Contenu": "The rewards system. I am motivated to answer surveys because I am always excited to redeem the points that I've earned."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Batson",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T20:02:01.000Z",
          "Titre": "Reviews should be posted at the author’s discretion",
          "Contenu": "Not having to give my take on the experience. Make reviews an option, not a requirement."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mrs Sharyn Smith",
          "Nb_Reviews": 10,
          "Date": "2023-12-17T17:19:47.000Z",
          "Titre": "Offer regular and various surveys of…",
          "Contenu": "Offer regular and various surveys of different lengths and a wide range of topics to keep your interest"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carrie",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T03:23:31.000Z",
          "Titre": "Most of the links I tap bring me to a…",
          "Contenu": "Most of the links I tap bring me to a valid survey. I look forward to earning points!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Karine - Durieux",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T14:19:27.000Z",
          "Titre": "Easy",
          "Contenu": "The questions were clear and easy to answer. The survey wasn't too long."
        },
        {
          "Note": 4,
          "Lieu": "ID",
          "Pseudo": "deka yurika",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T00:06:53.000Z",
          "Titre": "I have a good experiences with Toluna",
          "Contenu": "I have a good experiences with Toluna, sometimes I failed the surveys, but sometimes I passed the surveys. I hope toluna will give me more survey in the future."
        },
        {
          "Note": 4,
          "Lieu": "IE",
          "Pseudo": "Fran Mcgrory",
          "Nb_Reviews": 4,
          "Date": "2023-12-20T14:20:32.000Z",
          "Titre": "The surveys are very practical and…",
          "Contenu": "The surveys are very practical and interesting and of a reasonable length with clear questions"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Colin Hutchings",
          "Nb_Reviews": 3,
          "Date": "2023-12-11T01:32:14.000Z",
          "Titre": "I receive plenty of surveys but get…",
          "Contenu": "I receive plenty of surveys but get accepted about 1 in 10. It's a little frustrating. Other than that I'm happy with the company."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Eka",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T21:30:37.000Z",
          "Titre": "It's Okay some surveys don't work…",
          "Contenu": "It's Okay some surveys don't work proper or stop halfway"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mark  Goodson",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T20:16:36.000Z",
          "Titre": "The surveys are varied and generally…",
          "Contenu": "The surveys are varied and generally interesting. I do believe you should be rewarded with 50 points when you have to go through the preliminaries but are then told not suitable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kelley - Jones",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T23:52:35.000Z",
          "Titre": "Surveys are a little long but enjoyable"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul Bergetz",
          "Nb_Reviews": 3,
          "Date": "2023-12-15T23:42:21.000Z",
          "Titre": "Works well sometimes the system does…",
          "Contenu": "Works well sometimes the system does not complete the survey for some reason"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Angelique - Mace",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T00:43:50.000Z",
          "Titre": "Pretty good",
          "Contenu": "Pretty good, but I don't like the threshold for cash out or the confusing number of points needed. Should be simplified."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Ruth Horne",
          "Nb_Reviews": 8,
          "Date": "2023-12-10T10:59:17.000Z",
          "Titre": "Interesting surveys",
          "Contenu": "Interesting surveys and easy to complete. The only down side is that too often the surveys fill up before I have chance to log in."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Maritess Bersabe",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T17:18:16.000Z",
          "Titre": "It's Easy to get rewards",
          "Contenu": "It's Easy to get rewards. If response in email is quick, I give you a perfect rating."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "TB",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T10:59:59.000Z",
          "Titre": "I have been doing surveys for Toluna…",
          "Contenu": "I have been doing surveys for Toluna for a while & am always amazed at how varied they are & easy to complete"
        },
        {
          "Note": 4,
          "Lieu": "PE",
          "Pseudo": "Iris",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T18:46:16.000Z",
          "Titre": "Good",
          "Contenu": "Good, it is reliable; however, the accumulation of points is slow."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Srikanth kl",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T09:01:07.000Z",
          "Titre": "The survey site is very good I love it…",
          "Contenu": "The survey site is very good I love it but the reward is very low points comper to other survey websites"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Jyoti Vattam",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T07:45:47.000Z",
          "Titre": "feedback of toluna surveys",
          "Contenu": "surveys are enjoyable and also the rewards."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Alma Rosano",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T07:38:34.000Z",
          "Titre": "Honest",
          "Contenu": "It's a good to participate in a survey from time to time."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Gwen",
          "Nb_Reviews": 27,
          "Date": "2023-12-10T17:55:17.000Z",
          "Titre": "The surveys frequently freeze part way…",
          "Contenu": "The surveys frequently freeze part way through and it's not possible to return to where you were on the survey"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Indraja - M",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T16:01:06.000Z",
          "Titre": "Good toluna influencers",
          "Contenu": "Good toluna influencers. I want some money for my higher studies"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "christian",
          "Nb_Reviews": 8,
          "Date": "2023-12-14T21:53:54.000Z",
          "Titre": "Simple but very repetitive...",
          "Contenu": "Simple but very repetitive...Some questionnaire are a little hard to fallow"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Mallika - Nagasuri",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T14:03:35.000Z",
          "Titre": "Well at first it is really frustrating…",
          "Contenu": "Well at first it is really frustrating to use because if I start a survey and after completing half of it,it says you are not eligible for this survey and like that I wasted my time but now after completion of two surveys and getting some points I think it's good to be surveyed"
        },
        {
          "Note": 4,
          "Lieu": "PE",
          "Pseudo": "Sofia Teresa",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T19:30:28.000Z",
          "Titre": "It's very good AND very interesting"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "A Herniman",
          "Nb_Reviews": 16,
          "Date": "2023-12-18T03:24:57.000Z",
          "Titre": "Great on",
          "Contenu": "Great experience with helpful tips and enjoyable surveys, questions were clear and understandable, they covered a range of topics and were of closely matched interest to me, the questions moved quickly from one to another and the survey time advertised was accurate."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Sohanur - Rahaman",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T08:55:23.000Z",
          "Titre": "Yes this is completely genuine web…",
          "Contenu": "Yes this is completely genuine web site. Anyone can fill up it's surveys.i like this site."
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "nicholas - xaba",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T16:31:03.000Z",
          "Titre": "The survey were veryeasy to engage",
          "Contenu": "The survey were veryeasy to engage , responsive and very  insightful"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Prajkta - Somvanshi",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T07:09:08.000Z",
          "Titre": "Your work is easy but you don't give…",
          "Contenu": "Your work is easy but you don't give sufficient money"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Irfan - Haider",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T21:14:25.000Z",
          "Titre": "You people are doing good I love to…",
          "Contenu": "You people are doing good I love to involve in surveys"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Norest",
          "Nb_Reviews": 7,
          "Date": "2023-12-16T20:58:29.000Z",
          "Titre": "Very thought provoking surveys and…",
          "Contenu": "Very thought provoking surveys and educative at the same time."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Hemanth Kumar",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T15:19:33.000Z",
          "Titre": "Thanks for giving an opportunity to…",
          "Contenu": "Thanks for giving an opportunity to earn money through surveys"
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Ian Oliphant",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T14:53:21.000Z",
          "Titre": "Very easy or simple surveys to take and…",
          "Contenu": "Very easy or simple surveys to take and always enjoyable"
        },
        {
          "Note": 4,
          "Lieu": "AE",
          "Pseudo": "luiallives",
          "Nb_Reviews": 6,
          "Date": "2023-12-15T12:48:47.000Z",
          "Titre": "Somehow Good",
          "Contenu": "It was good the only thing I find not good is the points that you will take just to get the $15 in PayPal."
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "Lucy Tan",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T05:05:08.000Z",
          "Titre": "can select the type of question you…",
          "Contenu": "can select the type of question you want to answer."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "ALAN FINLAYSON",
          "Nb_Reviews": 7,
          "Date": "2023-12-19T00:08:02.000Z",
          "Titre": "GOT WHAT I EXPECTED AT A DECENT PRICE"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Rhonda - Evans",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T09:58:19.000Z",
          "Titre": "I enjoy most of the surveys",
          "Contenu": "I enjoy most of the surveys, but gets annoying when some questions are repeated in sequence"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Tiger12#",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T11:25:09.000Z",
          "Titre": "Toluna is a very good su korvey sites.I…",
          "Contenu": "Toluna is a very good survey sites.I beleive this sites."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joi Cardinal",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T21:14:29.000Z",
          "Titre": "i enjoy sharing my opinion"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Denver Hipp",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T21:24:05.000Z",
          "Titre": "Interesting surveys",
          "Contenu": "Interesting surveys.  The criteria for continuing, or stopping, a survey baffles me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karla Cherry",
          "Nb_Reviews": 6,
          "Date": "2023-12-13T03:36:07.000Z",
          "Titre": "It's an interesting experience",
          "Contenu": "It's an interesting experience, but it does take quite a few points to redeem anything."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Sarita Saini",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T04:35:00.000Z",
          "Titre": "Good Surveys",
          "Contenu": "It was a great experience."
        },
        {
          "Note": 4,
          "Lieu": "MY",
          "Pseudo": "Peter Wong",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T15:14:17.000Z",
          "Titre": "Simple and easy",
          "Contenu": "Can easily choose the answer, simple and clear."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Dulaney",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T05:31:32.000Z",
          "Titre": "Surveys",
          "Contenu": "Haven't been able to do surveys lately. More times than not, there have been none to do."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "reetu lahiti",
          "Nb_Reviews": 4,
          "Date": "2023-12-15T07:15:00.000Z",
          "Titre": "It's the best platform to share opinion…",
          "Contenu": "It's the best platform to share opinion & earn reward."
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Samkelisiwe - Jengqa",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T12:20:41.000Z",
          "Titre": "I was just flowing through out the…",
          "Contenu": "I was just flowing through out the survey the questions were not that personal"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lois Pidde",
          "Nb_Reviews": 21,
          "Date": "2023-12-16T00:00:17.000Z",
          "Titre": "surveys that meet my needs",
          "Contenu": "surveys that meet my needs.    easy to earn rewards, easy to see why toluna is tops."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T21:31:45.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good. I have been with your company for some time now."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jennifer Warg",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T06:25:18.000Z",
          "Titre": "New to Toluna",
          "Contenu": "Just started, but have done a few surveys & hope to start earning soon!"
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "Ofelia Obnamia",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T04:05:04.000Z",
          "Titre": "Question is easy to understand"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Marg",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T11:07:01.000Z",
          "Titre": "I enjoy giving my opinion on a variety…",
          "Contenu": "I enjoy giving my opinion on a variety of subjects and products. Surveys are interesting and enjoyable."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Christine Rhea - Igna",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T08:27:31.000Z",
          "Titre": "lovely to answer surveys and learn new…",
          "Contenu": "lovely to answer surveys and learn new things"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Raewyn",
          "Nb_Reviews": 10,
          "Date": "2023-12-19T04:54:42.000Z",
          "Titre": "usually has great surveys"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ken Mears",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T00:46:32.000Z",
          "Titre": "The length of the survey was good",
          "Contenu": "The length of the survey was good. One question was hung up for a bit but then resolved."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Graziel - Sarmiento",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T17:03:05.000Z",
          "Titre": "Toluna influencer help me a lot because…",
          "Contenu": "Toluna influencer help me a lot because of the survery that I earned. Its very convenient as part timer specifically if I wanna kill my time all. I've been getting a rewards so Many times and it's very helpful. Thank you so much for this opportunity. A legit survey. Merry and Christmas and happy new year."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Saundra Radtke",
          "Nb_Reviews": 5,
          "Date": "2023-12-21T17:08:16.000Z",
          "Titre": "All credit to Toluna and a big thanks…",
          "Contenu": "All credit to Toluna and a big thanks to Rachel who expedited my $30 PayPal payment. I actually love giving input on societal and political issues as well as my opinion on consumer topics. It means a lot to have a personal touch. I encourage everyone to participate and be a part of the process of change."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "TANYA - WATSON",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T14:58:49.000Z",
          "Titre": "I'm really enjoying taking part in your…",
          "Contenu": "I'm really enjoying taking part in your surveys.  They are quite interesting and well put together.  There are no errors, offer qood quantities of points and lots of variation.  Also easy to understand and flow very well."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Neelu Mohammed",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T08:30:16.000Z",
          "Titre": "its been a wonderful expirence and so…",
          "Contenu": "its been a wonderful expirence and so exited to share my thoughts through toluna. its gives some earning opportunties during free time and help to understand how our feed back help to build best product"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Marco Antonio  Molina",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T20:02:50.000Z",
          "Titre": "Rewarding surveys",
          "Contenu": "It has been a pleasant and rewarding experience since it gives me the opportunity to participate in surveys of goods or services and at the same time to receive economic benefit.The surveys are generally nice, easy to answer. Time is something that we must consider since some are extensive and require just the time to be able to respond adequately."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Atan",
          "Nb_Reviews": 4,
          "Date": "2023-12-18T07:46:31.000Z",
          "Titre": "100% legit and trustworthy",
          "Contenu": "100% legit and trustworthy. I already earned money from this platform since I joined. I am very happy that I discovered this platform because it helps me to earn money just doing surveys like giving your opinions about the specific product or services."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Danilo Bayani",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T08:25:25.000Z",
          "Titre": "Survey questions are clear",
          "Contenu": "Survey questions are clear and precise. Toluna really pays unlike other surveys that requires a lot of red tape resulting in survey takers not being able to collect, or collecting only after months of waiting."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Beatrice U",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T21:04:13.000Z",
          "Titre": "The varieties of the questions",
          "Contenu": "The varieties of the questions, how some surveys help to learn new things. When we take our time to do a survey, it is to help the compagnie to have an opinion from public to improve something or launch a new subject, but there is a frustration when you start a survey and after 20 min doing it and you receive a message saying: you're not qualified for the survey, please think about our time.Thanks,"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 6,
          "Date": "2023-12-20T23:23:38.000Z",
          "Titre": "I love the tolunda website",
          "Contenu": "I love the tolunda website, surveys are interesting,  easy way to earn extra cash, fast return on redemption of rewards.  Try it, you will love it too!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Olive Akpagu",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T17:46:31.000Z",
          "Titre": "Overall Great Experience",
          "Contenu": "Overall Great Experience.. The wide range of questions about sports, I found them interesting and informative too. Would love to try out more surveys afterwards."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deb",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T12:12:26.000Z",
          "Titre": "Toluna is my favorite survey site",
          "Contenu": "Toluna is my favorite survey site. Anytime i’ve had an issue or question. I get a response right away. I dont get qualified for alot of the long surveys, but i dont mind because I like the 5 to 10 minute surveys better anyway. Its not a problem for me at all."
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Quentin Xavier Viljoen",
          "Nb_Reviews": 21,
          "Date": "2023-12-18T07:59:34.000Z",
          "Titre": "Influencer",
          "Contenu": "I have been with Toluna for quite a few years now, and having become an influencer, makes me feel more apreciated. All my experiences with Toluna have been simply great! Hop I can influence you to join as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "April - Graham",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T20:32:54.000Z",
          "Titre": "IM fairly new to Toluna",
          "Contenu": "IM fairly new to Toluna. BUT I GOTTA SAY. I secretly love it.. morning routine  2 hours coffee and toluna. Hahaha  I started in October. Payday! ROCKS!  THANK YOU TOLUNA!!! TRULY ❤️"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "エルガとー（Elgato）",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T20:59:01.000Z",
          "Titre": "Legit App",
          "Contenu": "I'm changing my review from 1 star to 5 star Toluna for me is legit I got my problem solved that's why I leave it with 5 star. This is paying app I used this Toluna for almost 2 years now if I'm not mistaken. I'm sorry Toluna for my mistakes earlier I love this Toluna. 5 ⭐"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Amelia Abella - Montillano",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T13:38:12.000Z",
          "Titre": "My experience here in Toluna is great…",
          "Contenu": "My experience here in Toluna is great because I'm enjoying answering survey that gives me relief of work stress. Just to unwind myself I see to it to  participate survey in Toluna.I'm very much thankful because the points converted to Paypal satisfy myself"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "prathyusha kondamudi .l",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T14:39:43.000Z",
          "Titre": "I liked the rewards section containing…",
          "Contenu": "I liked the rewards section containing the  options to donate and help others and planet which is absolutely fantastic and heart touching. I was able to contribute through this platform which otherwise would not be possible for me ,I am so happy to be a part of toluna which has such great vision and heart for helping others and also providing opportunity to people help others.God bless you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harold",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T21:27:56.000Z",
          "Titre": "I'm not your typical person",
          "Contenu": "I'm not your typical person. I don't usually do things like everyone else. I think that has caused me to have more rejected than approved. A few were stopped during the survey. I'm trying a few places out.Then they switched to more getting in my head surveys so they could stop wasting time on surveys I'm not suited for.Long story short, they kept pushing instead of quitting."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justyn - Headlee",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T15:28:27.000Z",
          "Titre": "LOVE The Wide Variety of Survey Topics As Well As The Length!!!",
          "Contenu": "I really love the wide variety in topics when it comes to your surveys, as well as the length of them. They are all neither too long, not too short which helps keep me engaged and interested while I am taking them."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Anu",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T18:06:36.000Z",
          "Titre": "I am really enjoying the surveys",
          "Contenu": "I love the toluna website, surveys are interesting, easy way to earn extra cash. Try it, you will love it too!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Caroll K",
          "Nb_Reviews": 7,
          "Date": "2023-12-21T16:12:40.000Z",
          "Titre": "Toluna one of the better surveys to do.",
          "Contenu": "Great surveys just right amount and good rewards. Easy to redeem you points for rewards. Good topics and easy to understand the surveys."
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Mpho",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T09:38:57.000Z",
          "Titre": "Since I have joined Toluna I have had a…",
          "Contenu": "Since I have joined Toluna I have had a great experience with surveys and rewards and other earning opportunities. By far, my experience has only been the best and the communication or updates from them are sufficient and not too much"
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Adila Bajema",
          "Nb_Reviews": 4,
          "Date": "2023-12-21T07:11:08.000Z",
          "Titre": "Do Surveys- get rewarded",
          "Contenu": "Love to do the surveys and to get rewarded for it is a bonus! And the games offered are also very interesting. I use my Toluna app daily for the games alone."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Lito - Loquinto",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T02:06:38.000Z",
          "Titre": "My experience with Toluna survey.",
          "Contenu": "Toluna help me know more about a certain product and it gives me the right to choose the best answer, which I believe is good as for my own opinion."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Chielo - Honrada",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T10:06:06.000Z",
          "Titre": "The platform is user-friendly",
          "Contenu": "The platform is user-friendly, and I love the variety of surveys available. The rewards program is generous, and I've easily redeemed points for great perks. Overall, a reliable and rewarding survey platform that I highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Sheila Ferrao",
          "Nb_Reviews": 5,
          "Date": "2023-12-20T03:23:47.000Z",
          "Titre": "Frequency in surveys",
          "Contenu": "Frequency in surveys. Started giving points even though our answers were rejected by the client, for sparing time in answering the surveys"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "anson joy perez",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T23:06:03.000Z",
          "Titre": "Great Experience",
          "Contenu": "It is great. because The surveys are different with each coming from different products. and some of it are new products. I was glad that i was the one who was question if the product would be very good even if it newly released."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Desiree Trujillo",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T02:08:39.000Z",
          "Titre": "The right surveys for me",
          "Contenu": "For the time that I’ve been a surveyor for Toluna, I’ve never had a bad experience on a survey. Most if not all the surveys I’ve done have been entertaining and relevant."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Lizel Luiz",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T11:40:41.000Z",
          "Titre": "Very reliable survey website",
          "Contenu": "Very reliable survey website, good features and easy payout. Very active when it comes to responses for all the questions I need to ask."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Syed Imran Hashmi",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T19:38:41.000Z",
          "Titre": "Toluna is a leading technology company",
          "Contenu": "Toluna is a good company for the influencers who express their views through surveys and get paid for the work but sometimes when it comes to points which doesn't get credited after completing the whole survey is disappointing thank you!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Richard Maclachlan",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T05:06:01.000Z",
          "Titre": "Surveys that actually interest me",
          "Contenu": "Surveys that actually interest me and make me think about new products to try."
        },
        {
          "Note": 5,
          "Lieu": "SA",
          "Pseudo": "Room Tep",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T17:21:11.000Z",
          "Titre": "It's legit and good in terms of payment…",
          "Contenu": "It's legit and good in terms of payment though some points take long to be approved"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lori Marshall",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T21:42:17.000Z",
          "Titre": "Great Survey",
          "Contenu": "That was a great survey. I loved the subject of mandarins. The survey was short and to the point and it was very easy to answer the questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin - Erskine",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T13:57:27.000Z",
          "Titre": "The survey was easy to understand",
          "Contenu": "The survey was easy to understand, all worked well. No dead-ends or other malfunctions. Not all survey's seem to be tested first, but not for this."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Marc",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T07:16:09.000Z",
          "Titre": "I enjoy it its easy and way more…",
          "Contenu": "I enjoy it its easy and way more injoyable surveys than the others thank you so much for this great oppurtinity!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sharon - Tobolski",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T15:46:40.000Z",
          "Titre": "Toluna is BY FAR, HANDS DOWN, the BEST online survey options there is out there!!!",
          "Contenu": "Toluna is one of my absolute FAVORITE survey sights!! The surveys Toluna offers are pretty much the best all the way around when it comes to the numerous survey sights that I am a member of and that I participate on a daily basis. The variety of surveys as well as the length of them keep me entertained, engaged, and just overall satisfied while participating in each and every one :) I am also particularly fond of the points system and the rewards that are earned in that points system. They offer a wide variety of gift cards with numerous  categories to chose from, including restaurants and coffee shops like The Cheesecake Factory and Starbucks, chain fast food restaurants like McDonald's, Burger King, and ChicFilA. Big department stores like Walmart and Target. Even grocery stores including Kroger, as well as online shopping options like Amazon and reloadable virtual visa/MasterCard gift cards. Toluna even offers cash out options so you can transfer your points and turn it into immediate cash like PayPal (which of course consists of a few more points needed to earn this option, but totally worth it in my opinion!!) So all and all, Toluna, by far, is one of the best survey sights around and I highly recommend them as my number one and first choice if you are looking to join and  participate in this kind of online extra cash gig!! Each of their surveys are enjoyable and does not bore you into not even finishing. Keep you excited and engaged the entire time. It also educated you in all types of subjects. Thanks Toluna!! You all are seriously the BEST!!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ibukun Aminu",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T20:12:11.000Z",
          "Titre": "Fantastic service",
          "Contenu": "Fantastic service. When you email customer service they answer on time and fix whatever issue you are emailing on."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rebecca Paulsen",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T23:48:46.000Z",
          "Titre": "Genuine!",
          "Contenu": "Genuinely care about clien. Totally upfront and professional about their goals."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Roan",
          "Nb_Reviews": 7,
          "Date": "2023-12-19T06:38:35.000Z",
          "Titre": "Best platform for surveys",
          "Contenu": "Toluna is a great platform for taking surveys.  The points earned are high enough to earn extra money.  Thank you Toluna"
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "rowena gonzales",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T08:28:10.000Z",
          "Titre": "you will enjoy answering the surveys",
          "Contenu": "this made my day everyday,,and i already got vouchers out of answering the surveys"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Jebay",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T05:18:19.000Z",
          "Titre": "It was great experience wherein i can…",
          "Contenu": "It was great experience wherein i can share  my knowledge,perception on a different areas."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 18,
          "Date": "2023-12-17T16:10:26.000Z",
          "Titre": "Lots of varied surveys",
          "Contenu": "Lots of varied surveys , lots of points on offer for each one . Pays out quickly . Very good trustworthy survey business"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Rolando Iglesia",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T22:23:17.000Z",
          "Titre": "Every survey given gives us a lesson and something new and need to explore",
          "Contenu": "It has given me a lot of help. I am still learning some new facts about the surveys. It is really worth it reading and answering surveys."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Michaela - McKinney",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T01:51:36.000Z",
          "Titre": "Great app",
          "Contenu": "This is a great site to earn some extra money if you are willing to invest some time"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Ella - Deru",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T05:13:28.000Z",
          "Titre": "Easy to read",
          "Contenu": "The survey was easy to read and follow. I understood every question."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Sarah - Barnard",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T19:47:46.000Z",
          "Titre": "Good experience!",
          "Contenu": "It was great fun to participate in this review and I look forward to doing many more"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "yogesh saini",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T11:33:24.000Z",
          "Titre": "Good platform",
          "Contenu": "Great surveys to experience here like it's better than others in the market"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Moses - Sekao",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T11:03:01.000Z",
          "Titre": "Moses' survey on drinks",
          "Contenu": "The question asked asked are relevant for the products in subject."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Margaret Key",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T23:56:22.000Z",
          "Titre": "Easy to navigate surveys and always…",
          "Contenu": "Easy to navigate surveys and always about things I am interested in."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-12-21T17:46:16.000Z",
          "Titre": "Surveys are easy to understand and…",
          "Contenu": "Surveys are easy to understand and answer! Keep up the great job you do!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Geraldine Kennedy",
          "Nb_Reviews": 11,
          "Date": "2023-12-20T15:55:37.000Z",
          "Titre": "Better luck next time",
          "Contenu": "I love doing the surveys & I like spinning the wheel for extra points"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Morgane Perron",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T11:16:57.000Z",
          "Titre": "Its It's great the experience provided…",
          "Contenu": "Its It's great the experience provided by toluna it's an amazing app"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer elohima",
          "Nb_Reviews": 4,
          "Date": "2023-12-22T00:49:17.000Z",
          "Titre": "Love doing surveysvthere in addition to…",
          "Contenu": "Love doing surveysvthere in addition to that they have game to stimulate your mind"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "RM",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T05:51:59.000Z",
          "Titre": "It's a genuine platform to earn money …",
          "Contenu": "It's a genuine platform to earn money  and also provides reliable service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bakin",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T02:09:40.000Z",
          "Titre": "Easy to use.....",
          "Contenu": "Easy to figure out what to do and wasn't a joke and bouncing me all over the internet."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Subramanian Chidambaranathan",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T08:12:16.000Z",
          "Titre": "Good survey site",
          "Contenu": "Good survey site , Honest and making us Honest to earn points."
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Tsakani - Ngobeni",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T20:42:56.000Z",
          "Titre": "Excellent",
          "Contenu": "The company is doing well is always giving me opportunity to answer all the questions and they are patient with me although my network is down"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Iron - Fist",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T13:25:09.000Z",
          "Titre": "Toulna",
          "Contenu": "Toulna, as a paid survey platform, offers a convenient and accessible way for users to earn income through participating in surveys. The platform's straightforward design makes it easy for users to navigate and engage with various survey opportunities."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan Jackson",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T23:05:14.000Z",
          "Titre": "theyare consistent with there surveys i…",
          "Contenu": "theyare consistent with there surveys i receive a good amount and i love playing there games"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "SM",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T14:25:22.000Z",
          "Titre": "Easy",
          "Contenu": "A very easy way to engage in surveys and convey my oponion."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Ian David Del Rosario - Del Ro",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T04:44:07.000Z",
          "Titre": "About different things in life",
          "Contenu": "I really love how the company really chose who will and not answer the surveys"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Carole",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T02:09:42.000Z",
          "Titre": "always a number of surveys to do on a…",
          "Contenu": "always a number of surveys to do on a variety of subjects"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Farook - Farook",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:21:26.000Z",
          "Titre": "So good the best earning platform in…",
          "Contenu": "So good the best earning platform in online survey"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Sab Naq",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T00:56:32.000Z",
          "Titre": "current affairs",
          "Contenu": "Best questionare to reflect the views of people"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandy - Ad",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T18:11:32.000Z",
          "Titre": "It has unique surveys that aren’t…",
          "Contenu": "It has unique surveys that aren’t boring or mundane to answer"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "julie baillif",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T20:37:24.000Z",
          "Titre": "Love Toluna",
          "Contenu": "Love Toluna! Get survey's and good payouts.  Jul."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pedro G",
          "Nb_Reviews": 4,
          "Date": "2023-12-21T02:57:03.000Z",
          "Titre": "this site is awesome,my opinion here is…",
          "Contenu": "this site is awesome,my opinion here is important."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Gary Pitzer",
          "Nb_Reviews": 14,
          "Date": "2023-12-20T15:42:38.000Z",
          "Titre": "Toluna is great",
          "Contenu": "Toluna is great. Easy to follow surveys and great rewards"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Annie",
          "Nb_Reviews": 12,
          "Date": "2023-12-22T00:21:28.000Z",
          "Titre": "Because it is a very good Panel and…",
          "Contenu": "Because it is a very good Panel and redeemed points quicklyLa"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Omolara - Bayode",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T06:09:06.000Z",
          "Titre": "The reviews gave me opportunity to air…",
          "Contenu": "The reviews gave me opportunity to air my opinion"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "mabs soriano",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T11:06:07.000Z",
          "Titre": "IT IS A GOOD WEBSITE FOR ANSWERING A…",
          "Contenu": "IT IS A GOOD WEBSITE FOR ANSWERING A SURVEY, 5 STARS FOR A GREAT JOB!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angela - Knebel",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T02:50:34.000Z",
          "Titre": "Easy to understand",
          "Contenu": "Easy to understand and answering is easy. Not sure where to find points."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Selena Yan",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T02:43:56.000Z",
          "Titre": "A great experienece",
          "Contenu": "There has been numerous survey to complete but whether my demographic is suitable for that survey is promptly indicated"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "David Meakin",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T12:52:48.000Z",
          "Titre": "Awesome",
          "Contenu": "Easy to fill in and has awesome information"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Glora",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T18:56:50.000Z",
          "Titre": "Great people",
          "Contenu": "Great peopleamazingIt is nice to give your opinion on products that will be approved in the future"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Anil - Dubey",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T03:59:05.000Z",
          "Titre": "Great place to do surveys",
          "Contenu": "Great place to do surveys and get rewarded"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Thomas Costelloe",
          "Nb_Reviews": 27,
          "Date": "2023-12-22T00:03:59.000Z",
          "Titre": "A great company great surveys very fast…",
          "Contenu": "A great company great surveys very fast payers great customer service and effective service"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jamie",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T08:14:42.000Z",
          "Titre": "Great app lots to do and enjoyed my…",
          "Contenu": "Great app lots to do and enjoyed my spare time doing surveys"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Paul Finegan",
          "Nb_Reviews": 14,
          "Date": "2023-12-20T13:19:42.000Z",
          "Titre": "What's not to like :-)",
          "Contenu": "What's not to like - give your opnion and get voucher rewards ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Al Hartman",
          "Nb_Reviews": 4,
          "Date": "2023-12-20T16:29:42.000Z",
          "Titre": "Finally got to sign into a survey."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alfreda Weaver",
          "Nb_Reviews": 11,
          "Date": "2023-12-21T19:58:12.000Z",
          "Titre": "Your surveys are not long or boring."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Sanjukta Das",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T05:33:28.000Z",
          "Titre": "Enjoyable",
          "Contenu": "Very good for earning enjoyable also."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Gary James Long",
          "Nb_Reviews": 10,
          "Date": "2023-12-21T20:52:04.000Z",
          "Titre": "love it and its great sharing my opinion"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "anjucc",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T19:05:24.000Z",
          "Titre": "I still need to get my rewards",
          "Contenu": "I still need to get my rewards. But Toluna is doing well."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Aloke Pande",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T18:23:32.000Z",
          "Titre": "the studies are of good quality and…",
          "Contenu": "the studies are of good quality and interesting"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "maria escobar",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T20:21:36.000Z",
          "Titre": "This site is very perfect and honest"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Lynch",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T21:02:01.000Z",
          "Titre": "Great website",
          "Contenu": "It gives me insight I why I like the things I like and why I buy the things I buy"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Adelard - Dumas",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T23:26:55.000Z",
          "Titre": "Probably not fast enough for answers to…answers to....but????",
          "Contenu": "Probably not fast enough for answers to my questions."
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Anas Khan",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T10:10:03.000Z",
          "Titre": "Easy surveys",
          "Contenu": "Surveys were easy, not bad for the amount of money they give."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Richa Srivastava",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T08:56:34.000Z",
          "Titre": "GET REWARD BY EXPESSING YOUR VIEW"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Luis Antonio Martinez Araujo",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T22:46:50.000Z",
          "Titre": "Great diversity of survey."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Narender singh - Karayat",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T18:17:32.000Z",
          "Titre": "Great it is amazing  experience",
          "Contenu": "Its best knowledge gaining place with earning"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Peter Robert",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T23:28:20.000Z",
          "Titre": "amazing and attractive i like it very…",
          "Contenu": "amazing and attractive i like it very much"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Carla Jane Cassells",
          "Nb_Reviews": 4,
          "Date": "2023-12-17T18:13:40.000Z",
          "Titre": "Surveys are multiple choice easy to…",
          "Contenu": "Surveys are multiple choice easy to complete."
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Sathish - Munjala",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T16:31:30.000Z",
          "Titre": "Good experience",
          "Contenu": "Good experience in the part of survey participate on this day"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rosa - Roberts",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T23:45:27.000Z",
          "Titre": "It's ok now getting my other paypel…",
          "Contenu": "It's ok now getting my other paypel money"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Ambadas Vyawahare",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T12:30:59.000Z",
          "Titre": "Awards Generosity",
          "Contenu": "Consistent offers of variety of surveys and generous award points."
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "sipho martin",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T23:06:42.000Z",
          "Titre": "The best out of all surveys",
          "Contenu": "The best out of all surveys. Their topics are the best and shape the future"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Lilly Alilovic",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T01:24:04.000Z",
          "Titre": "Easy to complete",
          "Contenu": "Easy to complete, no software issues"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Somasekhar - Giddappa",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T12:18:21.000Z",
          "Titre": "Good",
          "Contenu": "Survey questions are very good"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Janet Worona",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T00:29:36.000Z",
          "Titre": "easy surveys to complete"
        }
      ]
    }
  ]
}