{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.tritondatacomonline.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andrew Belken",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T21:04:30.000Z",
          "Titre": "Order was missed in the data dump…",
          "Contenu": "Order was missed in the data dump between systems and was never processed.   No notification was made from the company.  Had to call to ask where the order was."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Ori Bryt",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T09:59:49.000Z",
          "Titre": "Bad experience",
          "Contenu": "Bought the product, and then out of nowhere after two weeks I get a refund instead of the product. Zero communication with the store, even after I sent them a mail. They are not trustworthy. Buy somewhere else."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Glenn Peterson",
          "Nb_Reviews": 1,
          "Date": "2022-02-11T03:59:36.000Z",
          "Titre": "Ordered a Polycom VVX500 and received a…",
          "Contenu": "Ordered a Polycom VVX500 and received a “Lame Device) that would not even Initialize when booting up…., even after setting to factory default two or three times.    Good phones like these have to initialize and they’re never gonna go anywhere.Waiting for good replacement information or refund information from seller"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 1,
          "Date": "2021-07-09T18:31:51.000Z",
          "Titre": "Bad experience ordering new ATA191 devices…",
          "Contenu": "I ordered two new ATA191 devices and received two remanufactured ATA191 devices instead. Additionally, no plug was provided for the power adapters. Talked to a Sales rep about the order and was advised he would get back to me about a refund, however, he nor anyone else at Triton Datacom has returned a call."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Martin Hayes",
          "Nb_Reviews": 1,
          "Date": "2021-10-22T17:53:31.000Z",
          "Titre": "You won't answer the email I've sent…",
          "Contenu": "You won't answer the email I've sent stating the wrong powersupply was sent with the unit, but I'll get one email a day asking to review the product.. I still need a refund for the very overpriced power supply if anyone happens to read this!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nancy Yee",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T01:18:04.000Z",
          "Titre": "terrible about shipment",
          "Contenu": "terrible about shipment, as promised.  the worse.  all talk.  If the phones don't arrive...maybe a scamplace"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joe Kerrigan",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T02:10:11.000Z",
          "Titre": "Threats from their CFO",
          "Contenu": "I ordered products in 2019.   I am a reseller and was NOT charged sales tax in Ohio at the time (Triton's choice as they weren't charging sales tax at the time).  They were caught for this and four years later I receive an invoice for sales tax for $550.   I received threats from their CFO.   If they simply asked for my Sales Tax Exemption form, this could have all been avoided."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael N.",
          "Nb_Reviews": 1,
          "Date": "2021-06-22T20:17:58.000Z",
          "Titre": "Long Delays & Lack of Customer Support",
          "Contenu": "Order took weeks to process and had to follow up multiple times to get an update. Finally when I was able to talk to someone and let them know the date the phone were needed for an install. They assured they would have them out. They waited a few more days and instead of overnighting the phones or next day shipping them. They sent them ground. This forced us to go to another distributor and have phones overnighted. They have unfortunately gone down hill in the last few months since Manny left."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alisher Keldibayev",
          "Nb_Reviews": 2,
          "Date": "2022-06-16T03:07:15.000Z",
          "Titre": "Very poor service",
          "Contenu": "Very poor service, it’s says on website in stock, took my 12000$ keep my money weeks, then sent me refund, i lost my time, never use this website again!"
        },
        {
          "Note": 1,
          "Lieu": "MY",
          "Pseudo": "MOHD SHAH",
          "Nb_Reviews": 1,
          "Date": "2023-04-25T06:22:53.000Z",
          "Titre": "Just make sure items published  on your…",
          "Contenu": "Just make sure items published  on your website have actual stocks and don't simply put new items but actually was refurbish items."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Berneice Lechuga",
          "Nb_Reviews": 2,
          "Date": "2021-06-23T17:30:22.000Z",
          "Titre": "Stay away",
          "Contenu": "We received no ethernet cord for the phone. When I called the rep said we don't need one. Because of the way we are wired, we do he argued and said we don't. I wasn't going to go back in forth we were int the middle of a move I would deal with it after. Upon setting up afer the move, the power cord provided is not a match. I am sending the phone back. Do yourself a favor, buy directly from your phone provider or the manufacturer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Deana Chase",
          "Nb_Reviews": 2,
          "Date": "2023-05-09T03:40:45.000Z",
          "Titre": "I placed my order on April 25th and…",
          "Contenu": "I placed my order on April 25th and still have not gotten my headset for work.  I would love to say that they work great and I would recommend your company bit I can't say that.  Please fix this issue"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "john fritz",
          "Nb_Reviews": 1,
          "Date": "2023-02-03T20:38:01.000Z",
          "Titre": "this is the third time this company did…",
          "Contenu": "this is the third time this company did not ship the product. WILL NEVER BE BUSINESS WITH THIS COMPANY"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sean Rutherford",
          "Nb_Reviews": 1,
          "Date": "2021-04-29T15:53:35.000Z",
          "Titre": "They cannot figure out their operations",
          "Contenu": "Order was placed 4/8, showed shipped on 4/15. Look FedEx on 4/23 and it never left their facility. They offered to refund the order and shipping as a customer service measure, although I just asked for the shipping to be refunded and they said it would ship that day and, again now almost a week later and NOTHING. All this aggravation for a $30 order!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nate Guy",
          "Nb_Reviews": 1,
          "Date": "2021-01-14T11:52:28.000Z",
          "Titre": "The product was fine...service was horrible",
          "Contenu": "The product was fine...service was horrible.  I paid $100 for next day shipping but the item took 5 days to arrive.  Was told I would be issued a credit for the shipping costs but that never came.  I emailed a rep several times but they never bothered to respond after initial contact.  I'll never buy from Triton Datacom again!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rafael Fuentes",
          "Nb_Reviews": 1,
          "Date": "2021-01-25T19:54:47.000Z",
          "Titre": "I was very unsatisfied with your…",
          "Contenu": "I was very unsatisfied with your resonse to the issue with the power supply. I think you should include if if you raise the price of the phone you should include the proper power supply for that phone even it isn't necessary just in case others do not have a POE device that would power the phone. Just a thought."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Abhineet Pratap Singh",
          "Nb_Reviews": 2,
          "Date": "2021-12-15T16:40:43.000Z",
          "Titre": "Product not delivered",
          "Contenu": "Product not deliveredAnd status says delivered"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carol",
          "Nb_Reviews": 3,
          "Date": "2020-04-15T16:15:40.000Z",
          "Titre": "Misrepresented product",
          "Contenu": "Misrepresented product. Website description says \"Genuine Cisco\". The price I paid was what I would expect for a Cisco product. I received a no-name generic item. We are in desperate need for these items, so we won't send them back. But Triton Datacom has taken advantage of the pandemic to cheat their customers."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Susan Desiena",
          "Nb_Reviews": 2,
          "Date": "2019-02-02T22:18:54.000Z",
          "Titre": "TO WHOM IT MAY CONCERN;",
          "Contenu": "TO WHOM IT MAY CONCERN;i NEVER RECEIVED MY REFUND OF $49.01 IN TOTAL FOR THE PHONE i PURCHAED AND THEN ALREADY SENT BACK WITH THE RETURN LABEL YOUR HAD FORWARDEDi JUST RECEIVED MY BANK STATEMENT AND CALLED MY BANK AS YOU KNOW THE PHONE WAS RETURNED AS IT DID NOT MATCH WITH MY WIRLESS CARRIER FROM THE  LACK OF INFORMATION FROM YOUR WEBSITE AND REPS..i AM DEMANDING MY REFUND BACK IN FULL OF $49.01Sincerely,Susan Desiena"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "N B",
          "Nb_Reviews": 1,
          "Date": "2020-09-16T16:01:25.000Z",
          "Titre": "Orders take days or weeks to ship out…",
          "Contenu": "Orders take days or weeks to ship out after being placed. So far 2/5 devices ordered were not working on arrival. The most recent 3 devices ordered haven't shipped in the 2 weeks since they were ordered. After this I'm not doing business with Trinton Datacom again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dominick Spina",
          "Nb_Reviews": 1,
          "Date": "2020-03-19T16:52:55.000Z",
          "Titre": "i put in a PO for 30 phones on a…",
          "Contenu": "i put in a PO for 30 phones on a Wednesday.  They sent me an invoice to pay online on a Friday at 5:30 after I had left the office.  I got informed on Monday morning that they sold the phones to another party putting me in a bad position as a project manager."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rose Bistany",
          "Nb_Reviews": 2,
          "Date": "2021-02-09T00:09:04.000Z",
          "Titre": "Feedback requests before ever receiving product",
          "Contenu": "I have received four requests for how you did, but I’m still waiting to receive my order. Going on three weeks and no update on delivery but lots of requests for feedback.  My feedback is, please deliver the product I ordered and paid for"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "mike h",
          "Nb_Reviews": 1,
          "Date": "2019-02-26T13:53:06.000Z",
          "Titre": "Incorrect Shipping Method used - cost me money",
          "Contenu": "In a bind I needed a network module. This company had that module $70 higher than all other vendors but guaranteed that they could ship the day of my order for early am overnight delivery. They did indeed ship the same day but shipped ground even though I paid $150 for early am shipping. Now another day of downtime and scrambling to try and find one locally that I can send fedex same day which will cost tons of money. This type of mistake is just unacceptable especially with online ordering systems. There is no reason that the proper shipping method should not have been processed"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "BLW",
          "Nb_Reviews": 3,
          "Date": "2020-01-20T19:49:03.000Z",
          "Titre": "More information about the phone would have helped",
          "Contenu": "I assumed that the IP phone would have come with an AC adapter since there was a port for that. I don't have a power over ethernet system, and no AC adapter was provided. I had to buy an AC adapter and paid separate shipping. The company is awful."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Yonatan Osorio",
          "Nb_Reviews": 1,
          "Date": "2019-12-19T02:52:09.000Z",
          "Titre": "Fair prices but bad customer service.",
          "Contenu": "This company is known for having bad customer care. I decided to give them a try for parts I needed ASAP.  After being on hold for more than 15 min, I decided to contact the “chat” support on their website. I was on hold for more than 30 minutes."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dave Paral",
          "Nb_Reviews": 1,
          "Date": "2020-03-23T20:19:51.000Z",
          "Titre": "We asked for express shipping and it…",
          "Contenu": "We asked for express shipping and it still took a week for delivery. Out of the 70 phones, we have 8 to 10 bad ones out of the box. Mostly network connectivity errors and only the speaker phone worked, handset and headset did not work."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steven Fournier",
          "Nb_Reviews": 1,
          "Date": "2021-02-15T10:56:51.000Z",
          "Titre": "Waited about two weeks just to find out…",
          "Contenu": "Waited about two weeks just to find out you did not have the product advertised and the order was cancelled, I only found out because I had not heard back and had to request information on the order"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Maria D Hernandez",
          "Nb_Reviews": 1,
          "Date": "2019-02-11T16:22:20.000Z",
          "Titre": "Dissapointed",
          "Contenu": "They should make this phones that support all kinds of phone companies I have my own business I work from home I bought this phone and they’re telling me that my phone company doesn’t support this phone really 🙄"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "paul yannello",
          "Nb_Reviews": 1,
          "Date": "2018-10-05T17:37:54.000Z",
          "Titre": "didn't have item in stock sent they…",
          "Contenu": "didn't have item in stock sent they said would work but did not have ask to return item and exchange it for what I ordered a week ago still waiting to hear from them not a happy customer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "VP",
          "Nb_Reviews": 1,
          "Date": "2020-12-28T22:06:51.000Z",
          "Titre": "Routers were advertised as available",
          "Contenu": "Routers were advertised as available, but clearly weren't in stock, as order was cancelled by the merchant after it was placed resulting in significant wasted time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Peter Amiri",
          "Nb_Reviews": 1,
          "Date": "2020-03-20T22:26:36.000Z",
          "Titre": "Ordered power supplies that never arrived",
          "Contenu": "We order the power supplies over a week ago and paid the enormous fees for second day air shipments but have not received our order yet. I would never order from you again."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "an unhappy customer",
          "Nb_Reviews": 1,
          "Date": "2021-02-26T15:33:31.000Z",
          "Titre": "support",
          "Contenu": "buying is easy and quicklybut support is very difficult ... to have answer while a problem occur; each time i  need to ask question or help many time"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 1,
          "Date": "2021-04-20T15:27:01.000Z",
          "Titre": "The 908 came in a large box with some…",
          "Contenu": "The 908 came in a large box with some padding. The outside cover is bent with scratches on it and it didn't come with any mounting hardware"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "BLW",
          "Nb_Reviews": 3,
          "Date": "2020-01-24T01:24:44.000Z",
          "Titre": "AC adapter was not included",
          "Contenu": "AC adapter was not included, and I didn't know that an AC adapter was not included, even though my ethernet does not include power over ethernet."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Fox",
          "Nb_Reviews": 1,
          "Date": "2018-06-11T16:15:55.000Z",
          "Titre": "Defective unit",
          "Contenu": "I was sent a defective unit with multiple issues. Realizing they are all refurbished but mine did nit work, they don’t notify you several parts are extra. Very difficult getting a refund and I would not after this experience recommendIn regards to the Response, Over 285 Condos in my Building have this exact Phone in their condo so when working properly it Will work in my Unit! Their is an IP line running through every condo in our building. The phone you sent did Not have a charger, it was Not advertised without a charger. You misinform your customers after it’s delivered then expect them to pay more for it. The camera did not work and the handset was faulted. It took forever to get a refund and multiple calls before this could happen then it was forever before you credited it back. This review is more than fair and completely justified. I want nothing to ever do with your company ever again"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kendra McCabe",
          "Nb_Reviews": 1,
          "Date": "2020-11-25T15:56:22.000Z",
          "Titre": "Never received this order and when I…",
          "Contenu": "Never received this order and when I called to ask for the status, a customer service agent said he would get back to me and never did"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Verified Customer",
          "Nb_Reviews": 1,
          "Date": "2020-08-11T22:28:17.000Z",
          "Titre": "We placed our order 2 weeks ago and it…",
          "Contenu": "We placed our order 2 weeks ago and it still has not been shipped.  We are on a tight schedule and need the part."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "john RODGERS",
          "Nb_Reviews": 1,
          "Date": "2019-11-14T20:15:48.000Z",
          "Titre": "You never aid they only work wIth CISCO…",
          "Contenu": "You never aid they only work wIth CISCO CALL MANAGER.  They are useless for me.  I need to return them.for a refund"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alisa",
          "Nb_Reviews": 1,
          "Date": "2018-06-05T15:49:26.000Z",
          "Titre": "I would give zero stars if I could",
          "Contenu": "I would give zero stars if I could. False advertising. Difficult to work with. Hard to return products. Rude people."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Frank Stapanowich",
          "Nb_Reviews": 2,
          "Date": "2020-09-30T20:33:38.000Z",
          "Titre": "Defective product, no response to support ticket",
          "Contenu": "Received a defective power adapter. Filed a support ticket over the weekend and 3 days later...no response."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scott Forest",
          "Nb_Reviews": 1,
          "Date": "2019-08-01T15:17:47.000Z",
          "Titre": "no one has contacted about the bad…",
          "Contenu": "no one has contacted about the bad power supply i purchased and wish to RMA it for a replacement."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "AG",
          "Nb_Reviews": 1,
          "Date": "2020-09-08T14:20:33.000Z",
          "Titre": "My order was cancelled",
          "Contenu": "My order was cancelled. I came to know about this only after chatting with a representative."
        },
        {
          "Note": 1,
          "Lieu": "ID",
          "Pseudo": "Casey Tongue ilham",
          "Nb_Reviews": 1,
          "Date": "2021-06-02T23:13:44.000Z",
          "Titre": "you are a scammer",
          "Contenu": "you are a scammer. until today i don't receive the devices."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Spencer Clarke",
          "Nb_Reviews": 2,
          "Date": "2021-03-26T18:13:55.000Z",
          "Titre": "Product never shipped and the trackking…",
          "Contenu": "Product never shipped and the trackking number was BS"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Curbo Parking Curbs",
          "Nb_Reviews": 1,
          "Date": "2019-08-12T17:05:14.000Z",
          "Titre": "Ordered a device & the 3,6,&9 keys do…",
          "Contenu": "Ordered a device & the 3,6,&9 keys do not work!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2021-01-22T20:18:55.000Z",
          "Titre": "Phone won't work without a firmware…",
          "Contenu": "Phone won't work without a firmware update..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tomas",
          "Nb_Reviews": 1,
          "Date": "2018-06-05T23:50:49.000Z",
          "Titre": "I have not received my product over 5…",
          "Contenu": "I have not received my product over 5 day already"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "rex abara",
          "Nb_Reviews": 1,
          "Date": "2019-02-11T20:12:30.000Z",
          "Titre": "Didn't do a good job shipping out my…",
          "Contenu": "Didn't do a good job shipping out my item"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MICHAEL OCONNOR",
          "Nb_Reviews": 2,
          "Date": "2020-12-26T13:26:41.000Z",
          "Titre": "did not receive the stands for the phone"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Ferrara",
          "Nb_Reviews": 1,
          "Date": "2021-04-26T14:34:57.000Z",
          "Titre": "It doesn’t work for the polygon 350."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MICHAEL OCONNOR",
          "Nb_Reviews": 2,
          "Date": "2021-01-27T19:31:40.000Z",
          "Titre": "Ordered two phones both won’t work"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mark Buse",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T06:34:32.000Z",
          "Titre": "The Polycom VVX411 phones were not…",
          "Contenu": "The Polycom VVX411 phones were not reset to factory firmware. Instead, the first one booted to a prior owner's phone system, with us locked out of making any changes."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chris Bartow",
          "Nb_Reviews": 2,
          "Date": "2023-10-23T18:42:14.000Z",
          "Titre": "Shipping and procesing late",
          "Contenu": "Umm - you emailed me that order #34393 shipped last Thursday 10/19 (took 3 days to ship) and based on the tracking, it actually has not shipped - still in \"label created\" status and not picked up as yet by UPS."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Johnson",
          "Nb_Reviews": 1,
          "Date": "2022-08-20T01:33:29.000Z",
          "Titre": "Trying to download JobControl 11.4 and…",
          "Contenu": "Trying to download JobControl 11.4 and the notes state that version 10 is required to be installed first, but that version is nowhere to be found.  Contacted tech support and they said version 10 not required.  Please post accurate and relavent information so you don't confuse people or waste their time.Since I can't reply to the reply below, I never purchased anything from you.  I'm trying to use the CNC Laser owned by my employer."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "jeff",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T00:08:35.000Z",
          "Titre": "poor service",
          "Contenu": "The only reason this isn't a 1-star is because I was refunded fully. Your company sent me the wrong product and instead of fixing the mistake I was told to just reorder (and pay) for the correct one. Own up to your mistakes and help the customer. Don't inconvenience the situation even further"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Amber Burton",
          "Nb_Reviews": 1,
          "Date": "2021-10-13T16:35:50.000Z",
          "Titre": "The shipment of product was timely but…",
          "Contenu": "The shipment of product was timely but what I received was not what I ordered. I was told all items would be new and there were several clearly refurbished ones, some \"new\" looking ones with packages within them opened. Additionally, they only provided 7 of the 10 substituted items that would actually work as replacements and the other three would not. I intend to return my order in full."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stacey P",
          "Nb_Reviews": 1,
          "Date": "2022-03-02T17:02:14.000Z",
          "Titre": "Please tighten up your shipping policies",
          "Contenu": "I had purchased a phone, and it didn't show up in the time frame expected.  I called, and it hadn't even been shipped.  So they said they would overnight it.  Timing is critical for our team and is costing effeciency in our company.  When I got the shipment tracking, it was not overnight priority, it was 2 day!!! When I checked with the shippers, that two day turned into 3!!! Unacceptable."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Antoine Smith",
          "Nb_Reviews": 1,
          "Date": "2021-10-12T17:27:53.000Z",
          "Titre": "Bait & Switch Sales Approach",
          "Contenu": "I have yet to receive my purchase and it has been beyond 3-5 business days. Secondly, I feel as if the product offering was a \"bait & switch,\" as buried in the fine print was the fact that the purchase \"DID NOT\" include the 5V Power Adapter. So the investment of buying the phone refurbished was negated at $67.00, when I still had to invest an additional $16.00 to purchase the 5V Power Adapter after receiving the phone. --- I might as well have purchased the product new for $87.00 from a different provider."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2022-11-09T21:05:16.000Z",
          "Titre": "Misinformed",
          "Contenu": "I was issued a refurbish machine and was totally unaware!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kathleen Flores",
          "Nb_Reviews": 1,
          "Date": "2022-02-28T20:14:53.000Z",
          "Titre": "Plantronic headset",
          "Contenu": "I bought this to use for work. I am very disappointed that the charge only lasts an hour. I need to for a full 8 hour day."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sue Kohler",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T22:39:36.000Z",
          "Titre": "Short Delivery",
          "Contenu": "We ordered (2) of an item and only got 1 delivered.  Once you were made aware you sent out the 2nd unit."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 3,
          "Date": "2022-09-01T18:48:27.000Z",
          "Titre": "We have been unable to use the phone…",
          "Contenu": "We have been unable to use the phone since we cannotfind the old password."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Paul Bailey",
          "Nb_Reviews": 5,
          "Date": "2020-01-02T19:42:32.000Z",
          "Titre": "We were told the (4)units that we…",
          "Contenu": "We were told the (4)units that we bought were new, but we were shipped used units. Two phones were configured for another company. The other two were missing all the parts, just phone in a plastic bag in an empty box. I have spent a few days trying to get these phones fully updated to current os versions. One would expect New if we paid New phone price.  I notified sales rep but haven't heard anything back."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "CS",
          "Nb_Reviews": 2,
          "Date": "2020-10-29T18:59:25.000Z",
          "Titre": "Nice team and good prices but poor communication",
          "Contenu": "I placed my order a week ago and it has still not shipped. When I inquired on Tuesday (10/27) I was advised for the first time that the item was on backorder but I would be getting an email with shipping details by EOB on 10/28 and have still received nothing (as of 10/29). The team was very nice over chat and went out of their way to help me find exactly what I needed but had I known there would be such a delay I absolutely would have opted to spend a little more to ensure delivery was made in a timely manner."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MarkB",
          "Nb_Reviews": 1,
          "Date": "2018-12-08T21:50:07.000Z",
          "Titre": "So-called refurbished Cisco switches are NOT",
          "Contenu": "Selling Cisco switches as fully 'refurbished', but the switch Triton sold us does not operate according to Cisco documentation. Triton support then ignored a request to deal with that problem. We have an unresponsive switch that behaves like it still carries a locked-down corporate configuration. That makes it risky for deployment as planned."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Todd Giblette",
          "Nb_Reviews": 3,
          "Date": "2020-02-19T22:26:22.000Z",
          "Titre": "One phone was unusable out of 2 in the…50% didn’t work",
          "Contenu": "One phone was unusable out of 2 in the order.  This is a quality control issue, particularly since it happened to another location of ours with the same result.  That means that twice, we were shipped 50% of the phone hardware in non-working condition.  How does that happen?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Todd Giblette",
          "Nb_Reviews": 3,
          "Date": "2020-02-19T22:25:31.000Z",
          "Titre": "50% failure rate",
          "Contenu": "One phone was unusable out of 2 in the order.  This is a quality control issue, particularly since it happened to another location of ours with the same result.  That means that twice, we were shipped 50% of the phone hardware in non-working condition.  How does that happen?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ron Miller",
          "Nb_Reviews": 4,
          "Date": "2020-12-23T20:12:59.000Z",
          "Titre": "First (and hopefully only) bad experience",
          "Contenu": "We have ordered many times from Triton and have always had stellar product and service.  This time, however, was different.  I paid for UPS and it was sent FedEx ground, which is less expensive (not by much, but a little).  We did receive the product quickly, which was as expected.  The connecting hardware for the sidecar, however, was not in the box and they have not responded to emails requesting it is extra/separate or for it to be sent.  Unfortunately, I have to give a 2 star rating this time instead of the normal 5 star rating they normally get.  Evidently, I'll have to find the connecting hardware for the sidecar somewhere else."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Wholesale  Telecom",
          "Nb_Reviews": 1,
          "Date": "2021-04-22T14:18:14.000Z",
          "Titre": "Not very good with the follow up on the…",
          "Contenu": "Not very good with the follow up on the sale. I ordered some Cisco phones and had to call several times to get tracking. I am still waiting on tracking for the second order.  This is not good customer service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 4,
          "Date": "2020-11-28T17:01:03.000Z",
          "Titre": "I am used to receiving switches from…",
          "Contenu": "I am used to receiving switches from triton datacom that have the configuration files already wiped.  One of the three switches I received had existing VLAN configuration still on the switch.  Luckily I know how to clear out existing configuration files from a Cisco switch, but it could have been a major hurdle for someone who is just getting into networking.  The switches were wrapped in Saran Wrap and so were the rack ears and screws.  I am used to receiving individually packaged switches from triton datacom, so to see three switches stacked on top of each other wrapped in Saran Wrap was concerning.  The switches themselves were fine and fully functional, I have just come to expect a particular level of service when I purchase network equipment from your company."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stephen Kaupp",
          "Nb_Reviews": 1,
          "Date": "2019-09-27T21:03:53.000Z",
          "Titre": "Not sure why this order waited for 7…",
          "Contenu": "Not sure why this order waited for 7 days to be picked up after processing. Nobody responded to my email requests for information."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "RICHARD NAGEL",
          "Nb_Reviews": 3,
          "Date": "2019-12-04T12:46:17.000Z",
          "Titre": "The phone I ordered didn't come with a…",
          "Contenu": "The phone I ordered didn't come with a power cord.  I was told it would be sent separately."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David Lankford",
          "Nb_Reviews": 1,
          "Date": "2020-01-29T17:47:33.000Z",
          "Titre": "Order was not correct",
          "Contenu": "Order was not correct. 3 emails no response Order Number #21004"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mitch Stroderd",
          "Nb_Reviews": 1,
          "Date": "2019-09-20T15:59:32.000Z",
          "Titre": "sent the wrong product"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steve Polydoros",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T21:46:07.000Z",
          "Titre": "The unit is working now",
          "Contenu": "The unit is working now, but the internal battery would not charge. The replaced the dead battery, with the extra battery that was send with the Polycom and now it charges. Could we get a replacement battery?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ignacio  Padilla",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T03:27:16.000Z",
          "Titre": "Wish I would of knew before I ordered",
          "Contenu": "My first initial order of 5 Polycom phones now everything was in good condition however they came with no power adapters…I reached out and I had no one ever respond to me….so I had to place a second order just for adapters so I paid two 2day shipping fees for something that should have only been one. How can I ever give a 5 star ?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Prince",
          "Nb_Reviews": 3,
          "Date": "2021-11-09T15:28:36.000Z",
          "Titre": "Tried to place orders for phones",
          "Contenu": "Tried to place orders for phones. Online ordering software allow the order (twice) even though there was no stock. I did not know until I received and email. I know hardware is in short supply but the online ordering software should not allow you to order something that is not available."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Prince",
          "Nb_Reviews": 3,
          "Date": "2021-10-06T16:59:47.000Z",
          "Titre": "Order did not ship when it was supposed…",
          "Contenu": "Order did not ship when it was supposed to. However, when I made you aware you overnighted the order. As a result I got the product a day later than expected. You ended up incurring expenses that you should not have and I ended up incurring additional cost as I had to expedite my shipping to my client."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cynthia Rabas",
          "Nb_Reviews": 1,
          "Date": "2021-12-13T22:08:45.000Z",
          "Titre": "Just not enough instructions",
          "Contenu": "Just not enough instructions!  I had to set up by myself in the office, missed a bunch of calls because I never had one of these before.  I got it hooked up but took me about an hour or more and then I could not figure out how to answer the calls.  I hit the button on the headset and I could hear the people however they could not hear me...Finally think I figured it out but not for sure.  Needs more instructions as to how to operate after installation.  There was nothing!!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Tweedy",
          "Nb_Reviews": 1,
          "Date": "2021-07-28T16:02:40.000Z",
          "Titre": "Typically the shipping is great",
          "Contenu": "Typically the shipping is great, however, our most recent order came 3 days late and really put us in a bind for our customer."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joel Reissner",
          "Nb_Reviews": 1,
          "Date": "2022-05-17T17:24:07.000Z",
          "Titre": "I bought 8 refurbished phones with this…",
          "Contenu": "I bought 8 refurbished phones with this company.  out of the 8 phones, half of them were missing the power adapter and had to order the power adapter on amazon."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jonathan Sharvit",
          "Nb_Reviews": 1,
          "Date": "2022-07-13T16:45:04.000Z",
          "Titre": "Much room for improvement",
          "Contenu": "I used to get the best service, Not impressed anymore."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Warlock",
          "Nb_Reviews": 2,
          "Date": "2021-05-22T06:28:33.000Z",
          "Titre": "Did not ship the complete order",
          "Contenu": "I have to give Triton a 3 star review mainly due to fact they did not ship my complete order. I ordered a Cisco phone and a power adapter. They only Shipped the phone.But what saved them from a 1 or 2 star review was that their customer support was very good. Shipped out the adapter in a timely manner with little fuss."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tina S.",
          "Nb_Reviews": 1,
          "Date": "2020-11-09T11:02:29.000Z",
          "Titre": "The item is as described it arrived in…",
          "Contenu": "The item is as described it arrived in a timely manner. However the item is a bit antiquated, There’s a lot of static and feedback on the line and the manual channel button provided little to no resolution. I may have to return the headset for something more up to date."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Little Joe",
          "Nb_Reviews": 3,
          "Date": "2019-10-08T13:22:06.000Z",
          "Titre": "The products I received from Trito was…",
          "Contenu": "The products I received from Trito was superb and their willingness to fix their shipping issues was 5-star performance. However, their ability to ship correctly is about a 1-star rating. First there was the phantom shipment, where their records show creating the shipment, but the packages never left their dock., Triton recovered quickly from that fiasco, but then shipped all the products I ordered to my address, when there was multiple shipments going to several address. But, in the end, they did get it right and at their cost; just don't order from them if you need the product in a hurry."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "SHERI",
          "Nb_Reviews": 3,
          "Date": "2020-11-05T14:51:43.000Z",
          "Titre": "I like the product I purchased but what…headset",
          "Contenu": "I like the product I purchased but what I didn’t like is that they weren’t clear as to whether or not it was an actual Bluetooth it only hooks around your ear not goes around your head to one ear, other than that the product is good"
        },
        {
          "Note": 3,
          "Lieu": "JO",
          "Pseudo": "Musallam Jazini",
          "Nb_Reviews": 1,
          "Date": "2020-11-17T06:57:13.000Z",
          "Titre": "Musallam Jazini",
          "Contenu": "1- On the date of 11/5/2020, an amount of $ 979 was transferred to make the order, and the shipping fees were not added. I asked several times that I want to add the shipping fees to complete the order and I did not receive any response from you.2- On the date of 9/11/2020, the value of the order was fully transferred to $ 1186.24 including shipping fees # 23776 and he sent me Track Shipment: 398778515055 and on the date of 11/10/2020 it was found that the order was canceled by you, I sent several times Ask why It was canceled and I did not get a response to the boil of the hour.Please send the shipment as soon as possible and cancel the first order $ 979"
        },
        {
          "Note": 3,
          "Lieu": "BG",
          "Pseudo": "JD",
          "Nb_Reviews": 1,
          "Date": "2021-05-08T06:19:32.000Z",
          "Titre": "I would rate this 5 stars if it weren't…",
          "Contenu": "I would rate this 5 stars if it weren't for the excessive shipping costs. The item could have been sent priority mail for $5 instead of UPS for $18. The price for item was fair."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jason G",
          "Nb_Reviews": 1,
          "Date": "2021-07-30T20:46:40.000Z",
          "Titre": "The phone works but did not arrive on…",
          "Contenu": "The phone works but did not arrive on time"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Art Goring Jr.",
          "Nb_Reviews": 6,
          "Date": "2021-03-09T16:07:37.000Z",
          "Titre": "Instructions would have been…",
          "Contenu": "Instructions would have been appreciated. This was big oversight. I was forced to find manual online but the instructions online weren’t very clear how to get calls."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Stemke",
          "Nb_Reviews": 1,
          "Date": "2018-10-14T14:29:42.000Z",
          "Titre": "Product was in poor shape",
          "Contenu": "Product was in poor shape, had dents and scratches, didn't look \"refurbished\" at all.  Was also 4 years older than the one it was replacing.Price was fair."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rafael Fuentes",
          "Nb_Reviews": 1,
          "Date": "2021-01-10T16:18:06.000Z",
          "Titre": "I tryed to place another order knowing…",
          "Contenu": "I tryed to place another order knowing I had credit in the account I used in the first place and the order did not allow me to place my second order."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "ABC",
          "Nb_Reviews": 1,
          "Date": "2020-04-21T20:03:26.000Z",
          "Titre": "GOT THE PRODUCT SUPER FAST BUT IT TOOK…",
          "Contenu": "GOT THE PRODUCT SUPER FAST BUT IT TOOK FOREVER  FOR LOWES CLEVELAND TN STORE TO FIND IT AND GIVE IT TO ME, OVER AN HOUR!!!  4-PIECES??"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dan C",
          "Nb_Reviews": 2,
          "Date": "2021-04-21T12:01:49.000Z",
          "Titre": "Missing ...",
          "Contenu": "Order correct.  But did not have the special power cords the Cisco uses on these switches."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James Halphen",
          "Nb_Reviews": 2,
          "Date": "2021-05-13T14:27:20.000Z",
          "Titre": "Firmware Updates Should Have Been Done Prior to Selling the Phone",
          "Contenu": "I would have given 5 stars if the phone would have been upgraded to the newest firmware."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DL",
          "Nb_Reviews": 1,
          "Date": "2018-10-06T02:12:37.000Z",
          "Titre": "Did not come with the power supply.",
          "Contenu": "Did not come with the power supply.How do you use something without the power supply.Not happy."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Phillip Abernathy",
          "Nb_Reviews": 2,
          "Date": "2018-10-22T20:46:50.000Z",
          "Titre": "Communication",
          "Contenu": "Communication was excellent.  But product information before ordering was not very clear."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2020-01-30T22:57:09.000Z",
          "Titre": "Ordering product was easy. Still waiting on shipment",
          "Contenu": "Ordering product was easy. After 10 days still waiting on shipment (1 phone)"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Candace Brown",
          "Nb_Reviews": 1,
          "Date": "2019-07-15T16:38:05.000Z",
          "Titre": "I wasn't aware that no cords came with…",
          "Contenu": "I wasn't aware that no cords came with the phone."
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "JAVIER BAMIO",
          "Nb_Reviews": 1,
          "Date": "2018-10-17T23:55:21.000Z",
          "Titre": "one of the phones arrived with very…",
          "Contenu": "one of the phones arrived with very scratched plastic"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Don P.",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T21:01:35.000Z",
          "Titre": "I was unaware that the  Yealink Phones…",
          "Contenu": "I was unaware that the  Yealink Phones did not come with a power supply so we had to order separately. I also did not read the full detail that states power supply is \"optional\" so the company is not fully at fault. It would have been nice however if those information were mentioned by the sales person while making the order."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kyle Lindley",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T16:20:32.000Z",
          "Titre": "knowledgeable sales staff and very…",
          "Contenu": "knowledgeable sales staff and very friendly"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bradley Voyles",
          "Nb_Reviews": 3,
          "Date": "2023-09-21T17:47:34.000Z",
          "Titre": "Good Price",
          "Contenu": "Good Price, arrived well packaged, prompt.  Should have been given a heads up that there was NO charging cord and maybe given an option to add it at the time of purchase."
        },
        {
          "Note": 4,
          "Lieu": "KW",
          "Pseudo": "Mohammed",
          "Nb_Reviews": 2,
          "Date": "2023-10-25T19:53:31.000Z",
          "Titre": "Excellent Customer Service and Very…",
          "Contenu": "Excellent Customer Service and Very Good Price and Products"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T21:32:07.000Z",
          "Titre": "everything went well except the shipping",
          "Contenu": "everything went well, the only hiccup was we paid for Fedex standard overnight and your shipping department shipping it out Fedex ground, which slowed down the project we were working on.  They did refund the shipping costs, but would have rather had the product when we needed it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joshua",
          "Nb_Reviews": 2,
          "Date": "2023-06-28T20:25:22.000Z",
          "Titre": "Easy ordering",
          "Contenu": "Easy ordering, responsive customer service when I had a question.Switch had a loose screw inside the case when I received it, QA could be improved."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ron Miller",
          "Nb_Reviews": 1,
          "Date": "2021-09-16T14:03:53.000Z",
          "Titre": "Quick shipping and correct item, but no cable",
          "Contenu": "Quick shipping and correct item.  It was just missing the cable to connect the AOM to the phone.  Fortunately, I already had something that would work so I was able to connect it and it is working fine.  It would have been a 5-star review had the cable been in the box with the connecting bar and the AOM."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alex Paz",
          "Nb_Reviews": 1,
          "Date": "2021-08-28T00:30:18.000Z",
          "Titre": "When I received the shipment it was a…",
          "Contenu": "When I received the shipment it was a messed. The power cords were all other inside the box, plus the shipment was not well packed,"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike Collins",
          "Nb_Reviews": 7,
          "Date": "2022-12-14T19:33:56.000Z",
          "Titre": "Minor issues but responsive and willing to help resolve.",
          "Contenu": "Some issues with shipping.  Resolved and after some short delay got our products as required.Thanks,Mike"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "stephen major",
          "Nb_Reviews": 1,
          "Date": "2022-02-28T22:08:12.000Z",
          "Titre": "So far so good haven't tried them yet…",
          "Contenu": "So far so good haven't tried them yet but shipping was prompt and we'll see how we do"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pete",
          "Nb_Reviews": 1,
          "Date": "2022-05-02T00:21:53.000Z",
          "Titre": "Timely response and shipping"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CJ",
          "Nb_Reviews": 1,
          "Date": "2020-11-03T22:29:38.000Z",
          "Titre": "Loved the chat help!",
          "Contenu": "Loved the chats with Al, who guided my purchase wonderfully for a refurbished wireless headset.  The headset came without instructions or any paperwork explaining where to access a manual online. And the unit did not look like it was cleaned well.After a further chat, Al again said he would email me a manual.Overall it was a great experience with Triton."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alexandra D",
          "Nb_Reviews": 1,
          "Date": "2019-03-22T12:44:56.000Z",
          "Titre": "Rocky Start but an excellent finish.",
          "Contenu": "Rocky Start but an excellent finish.My initial order received was wrong but the company acted very quickly in fixing the problem and ensuring I received the correct item. The polycom cords I purchased work perfectly and the customer service was excellent. I was contacted within an hour of letting them know the initial problem and had a replacement within 2 business days!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carla Sarmiento",
          "Nb_Reviews": 1,
          "Date": "2019-10-11T17:04:12.000Z",
          "Titre": "I ordered a power cord from them",
          "Contenu": "I ordered a power cord from them. I did receive it within the time frame that they estimated, the BUMPER! was it was not what I had ordered, I called and they were very responsive about it. Apologized they had mailed the incorrect one and gave me immediate credit for it!! We all make mistakes... NO ONE! is perfect, the important thing is to take accountability and setting it right! and that is exactly what Triton  Datacon online did. Awesome way to conduct business guys!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bruce Carlson",
          "Nb_Reviews": 2,
          "Date": "2019-06-21T19:55:44.000Z",
          "Titre": "Good products & cust svc but would like to see more testing of equipment",
          "Contenu": "I truly appreciate they range of products Triton offers.  I have been purchasing refurbished Polycom IP telephones.  My only reason for not scoring with 5 stars is I wish Triton would do more testing of refurbished Polycom IP phones to ensure all functionality is works on phones being sold.  I have had to return and replace IP phones that had testing been done would not have been necessary.  Their staff is polite and knowledgeable and there is no issue with returning defective equipment."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve Olson",
          "Nb_Reviews": 1,
          "Date": "2020-04-19T21:21:09.000Z",
          "Titre": "Ordered a part for a Cisco phone that…",
          "Contenu": "Ordered a part for a Cisco phone that did not work.  However, they immediately sent me a replacement and the return label to send back the old part that didn't work at no cost to me.  Handled professionally.  We all make mistakes but it is how you handle them that is important."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gina Moore",
          "Nb_Reviews": 1,
          "Date": "2018-12-12T13:37:41.000Z",
          "Titre": "Great customer service",
          "Contenu": "There are sometimes issues with reliability of the product, which prevents the 5 stars, but customer service - Damon and Manny - are always responsive.  When things change or go wrong they go out of their way to make it right.  That dedication makes this company a definite recommendation."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike Collins",
          "Nb_Reviews": 7,
          "Date": "2018-07-13T22:44:27.000Z",
          "Titre": "Good job!",
          "Contenu": "Fantastic job.  Only thing that you could have done to make this a better experience for us would have been to include the rack mounting brackets with the router... or at least an option to add that to our purchase.Thank you,Mike"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2018-12-11T22:09:15.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service! Website needs some work, turn off \"suggestions\" for items that aren't compatible, but thankfully your customer service team is amazing and can fix any situation. Thanks Damon & Manny!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ron Stroope",
          "Nb_Reviews": 3,
          "Date": "2019-07-22T21:01:37.000Z",
          "Titre": "Happy to buy again from Triton.",
          "Contenu": "Baring minor IOS issues with one of the 4 2960s purchased, I found the interaction with Triton satisfactory.  The hardware was in very good condition, clean w/ears included with the purchase."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Barton",
          "Nb_Reviews": 1,
          "Date": "2019-02-26T20:43:43.000Z",
          "Titre": "Two reason I didn't award 5 stars",
          "Contenu": "Two reason I didn't award 5 stars. The first one is due to the length of time it took to get the product. Placed the order on 2/1 and finally received it on 2/26. The second is because of the lack of communication. I was not told, after placing the order online, that the product was not in stock. I had to email Triton on 2/7 to find out why the order had not shipped to be told that they were out of stock, but had product coming in in a few days. Sent another email on 2/17 and did not get a response. Received an email on 2/18 that the product had been shipped (it hadn't). Received another email on 2/21 that the product shipped (it did). The phone I ordered works just like it was supposed to, so no issues there. Just a little better communication from Triton would have earned 5 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "GARY BELLANTI",
          "Nb_Reviews": 3,
          "Date": "2019-01-28T17:57:38.000Z",
          "Titre": "There was a slight misunderstanding on…",
          "Contenu": "There was a slight misunderstanding on what was included with a bundle but they made an earnest effort to mitigate the problems.  Delivery was quick and products were in great shape."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Derek Simsic",
          "Nb_Reviews": 1,
          "Date": "2019-10-28T21:51:05.000Z",
          "Titre": "Sales team didn't respond to online…",
          "Contenu": "Sales team didn't respond to online chat or email sent to the address on the contact us page; however, product ordered showed up in good condition and at a good price."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Craig Sutton",
          "Nb_Reviews": 1,
          "Date": "2018-06-26T23:08:06.000Z",
          "Titre": "The customer service rep that popped up…",
          "Contenu": "The customer service rep that popped up on my screen when I visited the web site was very helpful and answered all my questions. I will be using your services in the future."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "BBH",
          "Nb_Reviews": 1,
          "Date": "2020-01-06T22:40:40.000Z",
          "Titre": "Couple hiccups w previous order but this one was 100% intact",
          "Contenu": "Had a couple hiccups with previous orders having to be RMA'd due to damage of units on arrival, but the vendor made corrections. This order came 100% intact."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nelnet Inc P Card",
          "Nb_Reviews": 1,
          "Date": "2018-12-21T14:02:00.000Z",
          "Titre": "Terrific turn around on the item",
          "Contenu": "Terrific turn around on the item.  We had to cancel with another company and go with you to get the items we needed.  My only comment is that your cost was 30% more."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Danny Dukes",
          "Nb_Reviews": 2,
          "Date": "2021-01-12T15:29:49.000Z",
          "Titre": "All units were delivered timely and in…",
          "Contenu": "All units were delivered timely and in great condition. We only had one dead battery in one of the headsets. Great company and products!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Juan F.",
          "Nb_Reviews": 1,
          "Date": "2018-07-03T01:52:48.000Z",
          "Titre": "Purchasing on line was really easy",
          "Contenu": "Purchasing on line was really easy. A responsible company that call the client when something goes not as planned or promised."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Al",
          "Nb_Reviews": 3,
          "Date": "2021-01-19T16:39:30.000Z",
          "Titre": "A lot better now the email i got only…",
          "Contenu": "A lot better now the email i got only showed 46 phones and their serial numbers we fix that and we are at 100%"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joshua Collins",
          "Nb_Reviews": 1,
          "Date": "2020-01-07T14:19:29.000Z",
          "Titre": "While their inventory system could use…",
          "Contenu": "While their inventory system could use a makeover, their customer service is excellent.  Great prices, too."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Garrett Garland",
          "Nb_Reviews": 2,
          "Date": "2019-08-11T17:40:41.000Z",
          "Titre": "Easy to do business with but the phones…",
          "Contenu": "Easy to do business with but the phones we purchased did not work as we were told."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lisa Foster",
          "Nb_Reviews": 2,
          "Date": "2019-11-19T17:56:36.000Z",
          "Titre": "My only request is to receive…",
          "Contenu": "My only request is to receive invoice/receipts when items are shipped. Thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ron Stroope",
          "Nb_Reviews": 3,
          "Date": "2019-11-21T18:57:08.000Z",
          "Titre": "Good Overall Experience",
          "Contenu": "Good overall experience in purchasing used hardware."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "kATHY NOVAK",
          "Nb_Reviews": 1,
          "Date": "2018-11-26T20:51:30.000Z",
          "Titre": "good service but incomplete order…",
          "Contenu": "good service but incomplete order required correction"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mariko Mamadou",
          "Nb_Reviews": 2,
          "Date": "2020-11-12T00:46:53.000Z",
          "Titre": "Very good products and helpful customer service by Manny",
          "Contenu": "Very good cutomer service and quality products"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brad Hansen",
          "Nb_Reviews": 1,
          "Date": "2021-02-18T19:15:48.000Z",
          "Titre": "The phones arrived quickly",
          "Contenu": "The phones arrived quickly.  Very pleased"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eric McKenzie",
          "Nb_Reviews": 1,
          "Date": "2021-02-02T06:44:43.000Z",
          "Titre": "Great product and it arrived on time!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ken Thibodeaux",
          "Nb_Reviews": 3,
          "Date": "2018-06-25T15:47:14.000Z",
          "Titre": "Pricing is good",
          "Contenu": "Pricing is good.  Availablitiy is fair."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Allen Robertson",
          "Nb_Reviews": 1,
          "Date": "2021-02-06T00:43:07.000Z",
          "Titre": "Great service",
          "Contenu": "Great service, fast shipping."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrew Brown",
          "Nb_Reviews": 1,
          "Date": "2019-11-26T17:45:55.000Z",
          "Titre": "Great vendor",
          "Contenu": "Great customer service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DAVE GRIMM",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T23:03:49.000Z",
          "Titre": "Easy to work with",
          "Contenu": "Easy to work with!  Having a website with items available is very helpful.  I wish I saw you years ago.  Shipping time is impressive!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Herring",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T14:45:31.000Z",
          "Titre": "Devices made it promptly to my…",
          "Contenu": "Devices made it promptly to my customer. The customer service was very helpful and worked on giving best price with quanity ordered. Still awaiting customer review once devices are installed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Randell Durk",
          "Nb_Reviews": 7,
          "Date": "2023-11-30T16:56:11.000Z",
          "Titre": "Had an issue with the order",
          "Contenu": "Had an issue with the order, TritonDatacom took leadership of the issue and resolved it the very next day.  Easy to work with and honors their product 100%."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MacMusicGuy",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T04:20:26.000Z",
          "Titre": "Solid info on the product I wanted to…",
          "Contenu": "Solid info on the product I wanted to purchase - they doublechecked that I was ordering the correct part.The package was missing a part of the order - which they fixed immediately, with a minimum of fuss.Much appreciated!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greg Wirth",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T21:56:21.000Z",
          "Titre": "Product arrived as ordered."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Randell Durk",
          "Nb_Reviews": 7,
          "Date": "2023-10-23T15:17:13.000Z",
          "Titre": "Triton Datacom always has exactly what I need.",
          "Contenu": "Triton Datacom always has exactly what I need and gets here on most orders the following day.  Has a lot to do with being located in the same state.  But always a pleasure doing business with Triton Datacom."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ann",
          "Nb_Reviews": 2,
          "Date": "2023-10-10T21:21:38.000Z",
          "Titre": "I received an email about an order that…",
          "Contenu": "I received an email about an order that I had placed, however, I had never placed it.  I was able to contact them via their online chat and then a follow-up phone call and was able to get the order canceled as well as the cc information to be able to contact my bank to cancel the card.  Thank you so much for all the help!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gary M Farral",
          "Nb_Reviews": 5,
          "Date": "2023-10-23T20:16:03.000Z",
          "Titre": "Timely delivery!",
          "Contenu": "Timely delivery!The handset solved only half my problem as I should have looked closer at unit for the correct handset.  I sent you a message about returning this handset"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christine Mazzella",
          "Nb_Reviews": 2,
          "Date": "2023-09-29T17:28:51.000Z",
          "Titre": "Office Manager",
          "Contenu": "I wanted to confirm I was ordering the correct bracket for my new telephone and with a quick online chat it was confirmed and ordered.  The part was received a few days later and worked perfectly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 3,
          "Date": "2022-09-01T21:50:15.000Z",
          "Titre": "Customer Service that is off the charts!  Buy from Triton",
          "Contenu": "Al at Triton went above and beyond on his level of customer service.  Most companies would not return an email for an order this small; however, Al made sure the phone was operational and we were completely satisfied.  We will purchase every phone from this point forward from Triton"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Michael Stephenson",
          "Nb_Reviews": 3,
          "Date": "2023-04-15T19:46:02.000Z",
          "Titre": "Spa525g and Spa500ds",
          "Contenu": "well I am happy and pleased with the phone  and side car for the phone I bought.   However even if the phone is great the manual that comes with the phone and side car  sucks as it does not have any info on how to program either one and there is no complete info on how to add numbers into the side car or phone I am finding info but none of it is complete enough to make it work as it should"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David V.",
          "Nb_Reviews": 1,
          "Date": "2021-10-25T16:31:30.000Z",
          "Titre": "Great service and great products",
          "Contenu": "Triton Datacom Online has been my go-to source when in need of Cisco equipment for the business. Ordering switches through their website was easy and fast. They will go the extra mile to help your business succeed!I strongly recommend their services to anyone looking for telecom equipment."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 3,
          "Date": "2022-02-16T22:18:31.000Z",
          "Titre": "I'm not a big fan of website chat…",
          "Contenu": "I'm not a big fan of website chat windows (I'm looking at you, Sprint/T-Mobile), but \"Damon S.\" really made it work. His knowledge helped me to take a deep dive into product differences, and make a really informed purchase decision. Kudos to Triton, and Damon!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Norman Perez",
          "Nb_Reviews": 2,
          "Date": "2022-06-11T03:41:03.000Z",
          "Titre": "We are an IT company located in orlando…",
          "Contenu": "We are an IT company located in orlando Florida and we are super happy with the Triton team. Not only they have really good prices but any time I have had any issues with anything they have issued an RMA and return pretty quick no questions asked. Thank you Triton Datacom. from Norman at Orlando IT Services."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "C Tully",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T02:09:15.000Z",
          "Titre": "I needed a part ASAP",
          "Contenu": "I needed a part - same day - and they are local enough in Florida to give a try. Their agent stayed online with me to find the part I needed (actually a newer version) until i had what i needed. Picked the part up at their office and my client was back in business. Can't ask for more from a supplier. We've also ordered from them for other clients (mainly GrandStream products).100% satisfied."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "P Ebbs",
          "Nb_Reviews": 1,
          "Date": "2023-02-09T18:22:55.000Z",
          "Titre": "Great prices and incredibly fast shipping!",
          "Contenu": "Pricing was very competitive and Ordering was super simple.  I was able to confirm availability of the items I needed very quickly and a Sales engineer sent the invoice within minutes.  After placing the order online, the items were delivered within 3 days.  Very pleased with the entire process!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa Kokkinis",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T18:09:38.000Z",
          "Titre": "Thank you to Michael Guzman",
          "Contenu": "Thank you to Michael Guzman!  He was incredibly helpful in helping me navigate my order!It is also nice to find a place that stocks inventory for immediate shipment!Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larry F.",
          "Nb_Reviews": 4,
          "Date": "2022-11-04T23:45:58.000Z",
          "Titre": "Time wasn't on our side.",
          "Contenu": "Time wasn't on our side. I had visitors from Brazil and was Friday and they will return on Monday evening. They find out that the equipment use there failed to perform was old and obsolete and couldn't be repaired. Contacted you company and Al Stutz was in other side of the line. I explained to him the situation and he said \"let me see how I can help.\" Few minutes he returned with the solution. He will ship de equipment overnight via Fedex and I will received by Monday before noon, and we received before that. They flew to Brazil on Monday evening, and on Wednesday were installed and they are working fine. We would like to thank the help we received from Al. Regards Larry F."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cherry Steinwender",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T17:02:51.000Z",
          "Titre": "The experience was good from the time…",
          "Contenu": "The experience was good from the time we placed the order, and the question asked if we had this kind of phone in our office.  They did not want us to purchase something we did not need.  The package arrived ant the time it said and informing us by you made me fill comfortable.  Yes I will  let others know about you.Cherry Steinwender CEO"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Argelys Pena",
          "Nb_Reviews": 4,
          "Date": "2022-11-09T20:29:56.000Z",
          "Titre": "As an MSP providing IT Support and…",
          "Contenu": "As an MSP providing IT Support and Solutions for businesses it is great to count on Triton Datacom to deliver products to my clients when needed the most. You can always rely on them to go above and beyond. I have sent some of my clients to acquire call center headsets and other telecom items directly from them and have received nothing but positive feedback from our client experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Corral WTAX",
          "Nb_Reviews": 1,
          "Date": "2022-08-27T22:40:44.000Z",
          "Titre": "I ordered a refurbished Cisco SPA525G2…",
          "Contenu": "I ordered a refurbished Cisco SPA525G2 phone and power adapter.  It was shipped quickly. I received the phone and it looked like a brand new phone, it came with a long receiver cord and Ethernet cable. Unfortunately the display was not working. I requested an RMA. Received the RMA the same day and they cross shipped me a phone that again looks like new. Great experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 3,
          "Date": "2022-12-29T23:30:33.000Z",
          "Titre": "I was working with AL to find the right…",
          "Contenu": "I was working with AL to find the right adaptor cord to go between a Cytracom VOIP phone and a Plantronics W02 wireless headset. AL did some digging and determined that Cytracom was a brand name but not the manufacturer. The manufacturer turned out to be Granstream. I would have never figured this out on my own. From there AL, found the correct adaptor cord and got it shipped to me promptly!!The adaptor cord was plug and play right out of the box!! Thanks AL for your First Class service!! I really appreciate your help. -KenTo anyone reading this, if you have obscure telecommunication equipment to integrate, AL at Triton Datacom is your guy!!   -Ken"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Victor",
          "Nb_Reviews": 1,
          "Date": "2022-12-21T18:55:33.000Z",
          "Titre": "Very Helpful and Prompt",
          "Contenu": "Damon was a very helpful and prompt customer representative. We received our Cisco 1572 Wireless Access Points very quickly. I'm glad Triton had these, because it was difficult to find any other suppliers with them on hand."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Sagoian",
          "Nb_Reviews": 2,
          "Date": "2022-10-19T21:10:01.000Z",
          "Titre": "Cisco Router Order",
          "Contenu": "The routers we originally ordered had a bug and weren't able to be shipped but Damon found us a model upgrade to replace them for us at no charge and expedited our shipping.  Thanks Damon and Triton!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phil Smith",
          "Nb_Reviews": 1,
          "Date": "2021-11-01T16:36:09.000Z",
          "Titre": "Very easy to work with and…",
          "Contenu": "Very easy to work with and knowledgeable about their products. I purchased used gear as well as maintenance support for other Cisco existing switches I had dropping off of SmartNet. I have also recommended them to others."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "The Union",
          "Nb_Reviews": 4,
          "Date": "2022-02-22T00:05:51.000Z",
          "Titre": "Triton's customer service was stellar",
          "Contenu": "Triton's customer service was stellar. We received our product in 24 hours - without rushing. It's in great shape and ready to go. This is my second review - hoping this review company would quit sending emails."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edward Silha",
          "Nb_Reviews": 2,
          "Date": "2022-05-09T15:34:39.000Z",
          "Titre": "Saved my life....",
          "Contenu": "Despite all of the electronic protections we have, a transformer explosion during a storm took out our main managed switch that controls our vLANS and fiber trunks to various buildings.Triton was able to have a refurbished one onsite next day and I was back in business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "The Union",
          "Nb_Reviews": 4,
          "Date": "2022-02-13T17:15:52.000Z",
          "Titre": "Customer service was great",
          "Contenu": "Customer service was great! Someone actually answered the phone! Speedy process from order to shipping. I caught a screw up on my end and had to cancel my order before it shipped and order something else, the rep was really helpful and my credit was issues immediately."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John G",
          "Nb_Reviews": 4,
          "Date": "2022-01-20T00:54:11.000Z",
          "Titre": "Triton has the products I need when I…",
          "Contenu": "Triton has the products I need when I need them, always at great a price. Their customer service is outstanding. I have been doing business with them for several years now. I highly recommend that you give them a try. You will not be disappointed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keith A.",
          "Nb_Reviews": 3,
          "Date": "2021-10-13T18:37:52.000Z",
          "Titre": "Good people, great service",
          "Contenu": "Had a small problem with a refurbished phone.  They immediately started a replacement as well as helping me troubleshoot this one.  Turns out a 10 minute reset fixed it.  Good, friendly people."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michelle Herrera",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T20:11:42.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "Ordering was easy. They communicated every step of the way to make sure I knew when my order was ship to when it was delivered."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dina Price",
          "Nb_Reviews": 1,
          "Date": "2022-03-25T16:58:45.000Z",
          "Titre": "Excellent customer service.",
          "Contenu": "I received my refurbished phones, and so far, they work perfectly. I am not worried, though, because of their warranties. I plan on purchasing all our phones from Triton Datacom!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "G. King",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T20:49:13.000Z",
          "Titre": "Great Service",
          "Contenu": "Al in the sales department was super knowledgeable. He was able to assist me and answer my questions quickly. He provided a quick quote to my email. The shipping even though I didn't pay for express shipping was really fast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lee Linton",
          "Nb_Reviews": 1,
          "Date": "2021-11-21T13:38:28.000Z",
          "Titre": "Knowledgeable, Easy to Reach, & Excellent Customer Service",
          "Contenu": "The folks at Triton Datacom are knowledgeable and quick to provide excellent customer service. They are easy to reach by phone, website chat, and e-mail. I would highly recommend them for anyone in the market for IP-technology equipment."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Miguel Alonzo",
          "Nb_Reviews": 1,
          "Date": "2023-03-04T16:55:28.000Z",
          "Titre": "great company",
          "Contenu": "Since I entered the company's website, it gave me a lot of confidence.  I used the chat on Saturday at the end of the afternoon and they served me great.  I bought and on Monday they called me to let me know that they were going to send me the equipment and it would arrive on Wednesday.  everything was excellent.  thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nelson",
          "Nb_Reviews": 3,
          "Date": "2022-09-26T21:27:21.000Z",
          "Titre": "We purchase 12 new phones from this…",
          "Contenu": "We purchase 12 new phones from this company.  The phone arrived on time and all new as described.  I have nothing else to say except it was a good experience purchasing something from them.Nelson"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JOSEPH PAPCZYNSKI",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T18:25:50.000Z",
          "Titre": "Quick response from this company…",
          "Contenu": "Quick response from this company associates. They did exactly what they said they would do for my company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nelson",
          "Nb_Reviews": 3,
          "Date": "2022-09-16T17:59:47.000Z",
          "Titre": "We purchase 12 phones",
          "Contenu": "We purchase 12 phones, they shipped them immediately and the products arrived as described.  In new condition.  It is good to have trustworthy people to do business with.Thanks,Nelson"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter Johnson",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T22:31:44.000Z",
          "Titre": "Defective Product",
          "Contenu": "I ordered two PoE switches for our test lab and they are both in working order and were furnished with all necessary accessories.   Great prices for the features!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Ingo",
          "Nb_Reviews": 1,
          "Date": "2023-04-29T18:07:51.000Z",
          "Titre": "Borderless quality in time and budget",
          "Contenu": "Delivered very fast and with high quality to Germany.Product in very good condition, a complete recommendation from my side for these Guys."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aaron Kincaid",
          "Nb_Reviews": 1,
          "Date": "2022-07-25T22:09:27.000Z",
          "Titre": "I received the stack cards only at…",
          "Contenu": "I received the stack cards only at first.  I called and the first gentleman was unable to help me.  I used their chat interface and the gentleman there was on vacation.  The third try on the chat the gentleman was able to see that my equipment was not shipped.  He had it sent overnight, and I got it next day.  Everything is working nicely!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fernando Brea",
          "Nb_Reviews": 6,
          "Date": "2022-01-20T20:57:41.000Z",
          "Titre": "Absolutely the best experience any…",
          "Contenu": "Absolutely the best experience any issues and they go above and beyond to ensure the Customer is Happy with the purchase and any technical things that may pop up.. Great work!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Fletcher",
          "Nb_Reviews": 2,
          "Date": "2023-07-26T02:07:34.000Z",
          "Titre": "Great service …great value!",
          "Contenu": "Great service …great value!! Been buying from Damon for over 10years wouldn’t ever buy from anyone else or elsewhere!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan Kennedy",
          "Nb_Reviews": 1,
          "Date": "2022-12-01T21:33:57.000Z",
          "Titre": "Great Warranty / All Items Worked As Expected",
          "Contenu": "We ordered 9 of the same items, all packaged securely and shipped very quickly from across the country. All the items worked as expected and were in good condition."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Drew",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T21:56:26.000Z",
          "Titre": "Very knowledgeable sales staff",
          "Contenu": "Very knowledgeable sales staff.  I was actually able to speak to a person when I called.  I will definitely use them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Theo W",
          "Nb_Reviews": 3,
          "Date": "2022-04-21T18:34:37.568Z",
          "Titre": "Excellent customer service!!!",
          "Contenu": "There was an issue with the order. I informed the Triton Datacom team, They took care and rectified the issue fast and efficiently! Would not hesitate to order from Triton Datacom again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Theo W",
          "Nb_Reviews": 3,
          "Date": "2022-10-28T21:57:55.000Z",
          "Titre": "Best place to order refurb equipment",
          "Contenu": "Customer Service is top notch, fast to answer any inquiries, and pricing is hard to beat!!! Best place to order refurb equipment!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "WEDerm Telecom Mgr",
          "Nb_Reviews": 7,
          "Date": "2023-01-25T15:42:58.000Z",
          "Titre": "Triton DataCom our first stop for Telecom and now IT equipment",
          "Contenu": "We have been purchasing equipment from Triton DataCom for 7+ years.Their products and service always meet or exceed our expectations."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kenn Dessinger",
          "Nb_Reviews": 2,
          "Date": "2022-05-11T18:20:22.000Z",
          "Titre": "Triton Datacom is the best place on the…",
          "Contenu": "Triton Datacom is the best place on the entire internet to get VOIP phones.  We have been extremely happy with the quality. Even the refurbished phones are like new.  A+++"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Flenniken",
          "Nb_Reviews": 1,
          "Date": "2022-08-25T06:53:16.000Z",
          "Titre": "Great customer service and an easy…",
          "Contenu": "Great customer service and an easy transaction.   Parts ordered and arrived faster than expected.  Will definitely be doing more business with Triton!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin Sullivan",
          "Nb_Reviews": 1,
          "Date": "2022-10-21T18:43:30.000Z",
          "Titre": "Great products and service",
          "Contenu": "Found the exact product I needed for our office with the help of the \"Chat\" support agent.  Ordering was a breeze and the shipment arrived very quickly.  First time shopping with Triton, but it won't be the last.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Luke Ng",
          "Nb_Reviews": 1,
          "Date": "2021-10-22T21:51:24.000Z",
          "Titre": "Quick response and shipped expedite to…",
          "Contenu": "Quick response and shipped expedite to us in time to meet our deadline.   Products were in excellent condition and well packed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DAVID CHRISTY",
          "Nb_Reviews": 1,
          "Date": "2021-10-29T20:46:54.000Z",
          "Titre": "Excellent transaction",
          "Contenu": "Excellent transaction! The product was ordered on a Friday afternoon and delivered before Noon on the following Monday. Would deal with your company anytime!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patricia Miller",
          "Nb_Reviews": 1,
          "Date": "2022-12-08T23:10:08.000Z",
          "Titre": "They called me late on the day before…",
          "Contenu": "They called me late on the day before Thanksgiving to make sure that may order was correct and arrived in a timely manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cole Henslee",
          "Nb_Reviews": 2,
          "Date": "2023-03-08T21:32:53.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service, they were out of the model WYSE I ordered, called me, and sent a better model at no upcharge."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rex Spell",
          "Nb_Reviews": 2,
          "Date": "2022-03-02T22:23:45.000Z",
          "Titre": "There was a little mix up with my…",
          "Contenu": "There was a little mix up with my order, but Damon took care of everything for me over a chat session and has my parts shipped."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "S Egzi",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T14:36:27.000Z",
          "Titre": "Good customer service",
          "Contenu": "Good customer service. Ontime and  the product is as expected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ron Stephens",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T21:02:48.000Z",
          "Titre": "The shipping was super fast I didn't…",
          "Contenu": "The shipping was super fast I didn't even time to track the shipment before it was here. Also the grade of the product wax an A but they looked brand new."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jon N",
          "Nb_Reviews": 2,
          "Date": "2022-02-26T01:42:46.000Z",
          "Titre": "Damon is the man!",
          "Contenu": "Damon is the man! Very helpful and honest. He does whatever it takes to make sure we have what we need to operate, and at a great value. I appreciate that and so does my boss. He has a customer for life. Thanks again brother!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carl",
          "Nb_Reviews": 3,
          "Date": "2022-09-19T15:49:05.000Z",
          "Titre": "The website was very easy to navigate…",
          "Contenu": "The website was very easy to navigate to find what I was looking for. Good price and excellent shipping and service. Will order again the next time I am in need of a phone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matt C.",
          "Nb_Reviews": 2,
          "Date": "2022-11-18T15:50:03.000Z",
          "Titre": "Helped fix small issue quickly",
          "Contenu": "Al helped fix an issue that came up very quickly, and went above and beyond to make sure I was happy with my purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Theo W",
          "Nb_Reviews": 3,
          "Date": "2022-06-07T17:54:57.000Z",
          "Titre": "Triton Datacom is a pleasure to work…",
          "Contenu": "Triton Datacom is a pleasure to work with. The staff is knowledgeable and courteous! Wouldn't hesitate to order from them again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2023-04-10T16:44:26.000Z",
          "Titre": "Great pricing and best 5 years warranty…",
          "Contenu": "Great pricing and best 5 years warranty on refurbished Cisco equipment along with wonderful Sales team."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dblain",
          "Nb_Reviews": 1,
          "Date": "2022-05-17T16:06:07.000Z",
          "Titre": "shipped super fast and in perfect…",
          "Contenu": "shipped super fast and in perfect condition. Online chat confirmed the item we needed was in stock and available."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay Jackson",
          "Nb_Reviews": 1,
          "Date": "2022-08-05T21:00:13.000Z",
          "Titre": "Ordered a refurbished firewall",
          "Contenu": "Ordered a refurbished firewall. It arrived and was quick and convenient. I will be a return customer. Thank you Triton"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frontier",
          "Nb_Reviews": 1,
          "Date": "2022-04-11T19:20:39.000Z",
          "Titre": "They had the headset that we needed at…",
          "Contenu": "They had the headset that we needed at a very reasonable price.  It came in quickly and in great visual condition.  We have been using it for a week now and it seems to working great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fernando Brea",
          "Nb_Reviews": 6,
          "Date": "2023-09-08T16:13:05.000Z",
          "Titre": "Support Excellence",
          "Contenu": "Support is excellent on any issues that arise albeit the need is far and in between as I have been purchasing from them for years and I have had maybe 1 or two instances where I needed to get support involved and once they are the issue is immediately rectified"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Corey Wendling",
          "Nb_Reviews": 1,
          "Date": "2023-02-02T23:34:12.000Z",
          "Titre": "I ordered a power supply and got…",
          "Contenu": "I ordered a power supply and got exactly what I ordered in a timely fashion and the power supply is working great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Timothy Haas",
          "Nb_Reviews": 1,
          "Date": "2023-07-30T02:07:09.000Z",
          "Titre": "Delivered the VOIP phone exactly as…",
          "Contenu": "Delivered the VOIP phone exactly as promised. A very happy new customer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2022-09-30T22:09:58.000Z",
          "Titre": "Triton Datacom provides exceptional…",
          "Contenu": "Triton Datacom provides exceptional products and services. I'm extremely satisfied with their wide range of network products and their expedient shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles Cooks, Galaxy Consulting, Llc",
          "Nb_Reviews": 6,
          "Date": "2022-07-20T16:02:21.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience.  The order was quickly processed and delivered.  The alerts during the processing and shipping process were extremely helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jimmie Jines",
          "Nb_Reviews": 1,
          "Date": "2022-10-12T21:25:39.000Z",
          "Titre": "Daytona State College Emergency Router Replacement",
          "Contenu": "Al's attention to detail and quick responses ensured that this purchase helped us restore services to a campus as quickly as possible!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Craig Belcher",
          "Nb_Reviews": 7,
          "Date": "2022-05-16T18:53:14.000Z",
          "Titre": "What a company",
          "Contenu": "What a company, such amazing customer service.  They are my new go to partner for all things Cisco!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Happy Canuck",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T17:45:12.000Z",
          "Titre": "Delivery was very fast and ordering was…",
          "Contenu": "Delivery was very fast and ordering was very easy!  Will order other products in the future!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ed McLendon",
          "Nb_Reviews": 1,
          "Date": "2022-08-31T00:48:48.000Z",
          "Titre": "My purchase from Triton",
          "Contenu": "Great selection to choose from. Ordering was easy. Arrived ahead of schedule. The switches were like brand new."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary  Eder",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T16:34:12.000Z",
          "Titre": "Product was delivery in a timely…",
          "Contenu": "Product was delivery in a timely matter, came as promised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dixie Giddens",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T18:02:52.000Z",
          "Titre": "Sales team helped me",
          "Contenu": "Sales team helped me find what would work with my equipment and shipped fast.  5 year guarantee it a major selling point!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim Emmons",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T02:57:09.000Z",
          "Titre": "Product was in perfect condition!",
          "Contenu": "I got exactly what was expected, the packaging was very carefully done to prevent shipping damage, and I am very satisfied with my purchase!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shannon  Fisher",
          "Nb_Reviews": 1,
          "Date": "2021-12-03T18:21:06.000Z",
          "Titre": "Very helpful",
          "Contenu": "Very helpful - when I called them, they helped me find a product I was looking for in just minutes after I had been searching for a long time.  Shipped next day too!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeffery G.",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T14:41:28.000Z",
          "Titre": "Great Service",
          "Contenu": "Easy to manage website. Quick delivery.  Great product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kenn Dessinger",
          "Nb_Reviews": 2,
          "Date": "2022-05-05T17:49:06.000Z",
          "Titre": "Trition is easy to do business with and…",
          "Contenu": "Trition is easy to do business with and you always have the VOIP phones that we need in stock. Also your prices on the renewed phones are amazing!  Keep up the great work!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joi Guarino",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T16:46:07.000Z",
          "Titre": "They are very helpful. They value their customers.",
          "Contenu": "They really helped me find what I needed. They were out of stock and upgraded my phones to a better phone for the inconvenience?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alan Foidl",
          "Nb_Reviews": 1,
          "Date": "2023-01-16T17:55:18.000Z",
          "Titre": "we are a church and this helps…",
          "Contenu": "we are a church and this helps throughout the building. The delivery time was fantastic."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "steve selimos",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T17:42:36.000Z",
          "Titre": "Great customer service and experience",
          "Contenu": "Great customer service and experience Company is great to do business with"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dr. W.",
          "Nb_Reviews": 2,
          "Date": "2022-07-02T14:56:27.000Z",
          "Titre": "Excellent and prompt service",
          "Contenu": "Excellent and prompt service.  I received the product in good condition and exactly what I ordered."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony Holt",
          "Nb_Reviews": 1,
          "Date": "2021-10-29T17:48:48.000Z",
          "Titre": "Phones were in good condition and was…",
          "Contenu": "Phones were in good condition and was able to configure them without any issues!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pat",
          "Nb_Reviews": 1,
          "Date": "2022-08-10T16:51:45.000Z",
          "Titre": "Great Service",
          "Contenu": "Reasonable price for what I purchased.  Packaged well and shipped quickly.  Couldn't ask for more."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roger Borlinghaus",
          "Nb_Reviews": 2,
          "Date": "2022-05-15T20:55:47.000Z",
          "Titre": "Thanks Triton Datacom",
          "Contenu": "Thanks Triton Datacom!  You carry some harder to find products at reasonable prices, and ship fast!!"
        },
        {
          "Note": 5,
          "Lieu": "RU",
          "Pseudo": "Paradise",
          "Nb_Reviews": 2,
          "Date": "2022-04-01T15:56:19.000Z",
          "Titre": "I bought a phone from them over a year…",
          "Contenu": "I bought a phone from them over a year ago and it still works flawlessly. I even dropped it more than once, but it is intact. There are very high quality products here."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Schifano",
          "Nb_Reviews": 1,
          "Date": "2022-06-23T16:31:55.000Z",
          "Titre": "Good Experience",
          "Contenu": "Products were shipped and received in a timely manner and were offered at a very fair price.  Easy transaction."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2021-09-28T21:21:10.000Z",
          "Titre": "Great customer service",
          "Contenu": "Had a issue with the cord on the spa550ds I bought and they sent me a new cord no questions asked. All works well now. Great customer service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eddy L.",
          "Nb_Reviews": 1,
          "Date": "2022-08-26T19:31:45.000Z",
          "Titre": "Great company to work with",
          "Contenu": "Great company to work with. They have excellent customer service and fast response."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Argelys Pena",
          "Nb_Reviews": 4,
          "Date": "2023-05-04T22:33:00.000Z",
          "Titre": "As usual these guys are always…",
          "Contenu": "As usual these guys are always exceeding expectations. Great job Team Triton!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan Kohler",
          "Nb_Reviews": 3,
          "Date": "2023-09-08T22:35:16.000Z",
          "Titre": "Chat worked great but I'm still waiting…",
          "Contenu": "Chat worked great but I'm still waiting on the RMA I was promised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill Herold",
          "Nb_Reviews": 2,
          "Date": "2023-09-13T22:32:24.000Z",
          "Titre": "Al was most helpful in helping me find…",
          "Contenu": "Al was most helpful in helping me find just what I needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shawn McDonald",
          "Nb_Reviews": 1,
          "Date": "2023-01-06T18:24:42.000Z",
          "Titre": "Great delivery times",
          "Contenu": "Great delivery times.  Great communication.  Pleased with product.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "rdecker",
          "Nb_Reviews": 1,
          "Date": "2021-10-27T15:51:31.000Z",
          "Titre": "Shipping was quick",
          "Contenu": "Shipping was quick. Products arrived as advertised. Prices were on point."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff Paulson",
          "Nb_Reviews": 1,
          "Date": "2022-02-14T21:32:00.000Z",
          "Titre": "Always a reasonable price",
          "Contenu": "Always a reasonable price. Equipment always works and is cleaned up."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CEO House Of Gems Inc",
          "Nb_Reviews": 1,
          "Date": "2022-06-14T19:32:18.000Z",
          "Titre": "Great service and knowledgeable staff…",
          "Contenu": "Great service and knowledgeable staff nothing more I can ask for"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Soner Yasti",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T17:05:31.000Z",
          "Titre": "Fast service",
          "Contenu": "Fast service, works as promised."
        }
      ]
    }
  ]
}