{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.zeldacards.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Glen",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T20:08:34.000Z",
          "Titre": "Won't stop emailing me",
          "Contenu": "I told you that you have the wrong email address and to stop emailing me...but you keep emailing me and have now asked me to complete a survey. If you had even a basic email verification process, this wouldn't have happened and you wouldn't be spamming me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2022-01-03T23:17:43.000Z",
          "Titre": "Very unhappy, random cards.",
          "Contenu": "The cards do not follow the official numbers thus, you have no idea what you arw ordering. You end up with cards from every set, even when you say you don't want Serino, but nothing is complete and tons of cards are missing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kristopher Williams",
          "Nb_Reviews": 1,
          "Date": "2022-10-25T03:35:31.000Z",
          "Titre": "Ordered over a month ago",
          "Contenu": "Ordered over a month ago. Never received items and only communication is a repeat email telling me to reach out to USPS to get an update….Horrible customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "KMO",
          "Nb_Reviews": 1,
          "Date": "2021-03-20T00:31:30.000Z",
          "Titre": "I did not receive the set that was…",
          "Contenu": "I did not receive the set that was pictured. I already had the set I got and my daughter was very disappointed as she was looking forward to have new characters to invite to her island. Chose the set I did because it had Aurora in it and my daughter loves penguins. Very frustrating."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Taylor Magaha",
          "Nb_Reviews": 1,
          "Date": "2021-12-02T02:18:53.000Z",
          "Titre": "When I received my order I noticed that…",
          "Contenu": "When I received my order I noticed that the Sheik card was not working. The shipping was also very slow, but that doesn’t bother me as much as one of my cards being defective."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Morgan N.",
          "Nb_Reviews": 1,
          "Date": "2022-04-18T18:46:10.000Z",
          "Titre": "Didn’t receive my full order",
          "Contenu": "I ordered a full set of Zelda cards that came in a  crystal case. It was to include the new Loftwing card and a free gift. I only received the Loftwing card and gift. I reached out to the company through the email on the website and the email givin in the package for customer support and didn’t hear anything from either. Disappointed I didn’t get what I ordered, but the free gift was cool. 🤷🏼‍♀️"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Duane Mier",
          "Nb_Reviews": 1,
          "Date": "2021-12-13T22:02:40.000Z",
          "Titre": "I ordered a package on 26 November it…",
          "Contenu": "I ordered a package on 26 November it is now 13 December. I don’t understand why it’s taking so long. I have not received my package. I’m getting pretty upset about it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sleepy Deer",
          "Nb_Reviews": 1,
          "Date": "2022-04-27T02:24:01.770Z",
          "Titre": "This website might be a scam be careful",
          "Contenu": "This website might be a scam my phone kept glitching everytime I revisit their website page on chrome history I can't even check out their trustpilot without getting transfer to their website."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kat",
          "Nb_Reviews": 5,
          "Date": "2022-04-24T14:01:41.000Z",
          "Titre": "Multiple Misprints, arrived late",
          "Contenu": "I didn’t realize that more than half of the series five cards have little dots all over the character pictures. I never would have ordered the cards knowing that. It completely ruins the cards. It took much longer than the 5-8 business days they claimed it would take to arrive. Then there’s misprints on the cards - characters name spelled wrong. I paid too much money for this to just be garbage. I do not recommend these cards to anyone.Edit: Still waiting on customer service. I emailed them before I posted this review and it’s been 2 days since they claimed they contacted me.Edit 2: they finally messaged me for the first time after the bad reviews, not responding to my first email that I sent to their site. Then they respond with that I finally answered even though they have NEVER emailed me. Such a rude company.Another update: even though I told the company I DID NOT want more cards, just a refund - they sent more cards anyways and they STILL have little dots all over the picture. And they still haven’t refunded me!! NEVER DO BUSINESS WITH THIS COMPANY."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kat",
          "Nb_Reviews": 5,
          "Date": "2022-04-14T13:21:30.000Z",
          "Titre": "were Great cards not anymore",
          "Contenu": "The cards arrived really quick - within 8 days. I ordered all the animal crossing cards they had at the time (204) and I checked all of them and they all work perfect. Only issue was one of the cases were broken. Edit: had someone try to mansplain what cards I have in my possession when I told them I was missing a card. Not cool. Then I was stupid and reordered from them and they arrived really late and had misprints on nearly half of the cards. Not worth it"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 2,
          "Date": "2021-02-08T10:06:31.000Z",
          "Titre": "Useless.",
          "Contenu": "They sent an email refunding my purchase. No explanation at all. The refund was $2 less than I had sent them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel Fulcher",
          "Nb_Reviews": 1,
          "Date": "2021-11-07T23:45:49.000Z",
          "Titre": "It would have been good if I received…",
          "Contenu": "It would have been good if I received my package! They said it was delivered on the 3rd of Nov. But, no one delivered anything. My ring door bell shows no one delivered it at that date!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William Matthews",
          "Nb_Reviews": 2,
          "Date": "2020-10-05T21:18:09.000Z",
          "Titre": "Delivery of this product is horrible."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shannon J",
          "Nb_Reviews": 1,
          "Date": "2022-12-29T04:35:10.000Z",
          "Titre": "I still have not gotten my item",
          "Contenu": "I still have not gotten my item. The shipping said 5-8 days."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Megan",
          "Nb_Reviews": 1,
          "Date": "2022-01-14T17:14:23.000Z",
          "Titre": "I had some issues with ordering",
          "Contenu": "I had some issues with ordering. I placed an order but realized I purchased the incorrect set. Asked to cancel within the same hour. They emailed saying it was already shipped 4 hours later. I didn’t receive a shipping notification until an hour after they emailed me it shipped. They refunded half my order. Then I received my order with only 1 item. I didn’t get the 6 scenario cards."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Catherine Kelly",
          "Nb_Reviews": 1,
          "Date": "2023-06-10T23:18:11.000Z",
          "Titre": "The cards are awesome, delivery not so much",
          "Contenu": "The cards are amazing, easy to transport, and the art is ABSOLUTELY beautiful. I was so excited to replace my old set, as they had vanished, and it would be here on the 28th of May, so I could continue to get items for TOTK. And then... the package was delayed. And then delayed again. I was told it was delivered, went to the mailbox, nothing.  And then it went back to 'being delivered' and 'processing'. And back and forth from one county to another, each link for the package tracking saying a different thing. It did finally arrive, after I sourced a comparable card set that I nearly bought, almost a week into June. So, not satisfied with delivery estimates, but satisfied with how it works."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carlos Acosta",
          "Nb_Reviews": 2,
          "Date": "2020-04-27T00:58:19.000Z",
          "Titre": "Honest Review👌🏻👌🏻",
          "Contenu": "Love it and the fast shipping it work as I wanted it, however i give it 3 star because the Gannon card wasn’t working. Besides that every other card worked well. Sorry about the 3 star but I thought all of the card would work."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "CrimsonToker",
          "Nb_Reviews": 2,
          "Date": "2020-01-16T19:39:03.000Z",
          "Titre": "Not a great buying experience",
          "Contenu": "Website is super ad heavy for the very thing I was trying buy, while I was trying to buy it. Very annoying. After my purchase, there has been no tracking info at all, so I don't know when I will get my cards. Haven't gotten them yet, so I can't say if they work or not. Fingers crossed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nanamany",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T20:56:08.000Z",
          "Titre": "Great transaction. Item is great!!",
          "Contenu": "Great transaction, item is great!!!We received the item purchased in good condition. It was packaged well. It took a long time but was here in plenty of time for when we needed it. It was a good purchase and we are happy with the transaction."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Christian Bertram",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T06:27:25.000Z",
          "Titre": "Review Zelda BOTW Amiibo NFC Cards",
          "Contenu": "The customer service is commendable however since the art on the NFC cards is lazy at times this only gets 4 Stars. It is difficult to differentiate between most of the Link cards (The toon link cards barely look any different from other Link cards) and Zelda having brown hair on some of them (for whatever reason) doesn't help either. Nevertheless the Amiibo NFC Cards themselves work perfectly fine and the quality of said cards is good as well. It took about 10 days to arrive which is in the spectrum of 7-12 days they have provided, so I'm mostly satisfied."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Nikita Tiurpenko",
          "Nb_Reviews": 2,
          "Date": "2021-01-13T08:00:08.000Z",
          "Titre": "The cards are way smaller than I…",
          "Contenu": "The cards are way smaller than I expected but they work great! I wish they had the actual amino character art but I understand that copyright © comes into play and that they don’t wanna get sued by Nintendo.."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dana",
          "Nb_Reviews": 1,
          "Date": "2021-11-17T03:38:53.000Z",
          "Titre": "I have not received my cards",
          "Contenu": "Update: I had an issue due to my apartment number not being listed causing my cards to be returned. Kyle with Zeldacards was very kind and helpful and I was refunded. I plan to purchase from them again once I get moved."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JuniperLHeart",
          "Nb_Reviews": 2,
          "Date": "2021-10-20T19:36:47.000Z",
          "Titre": "Barely any troubles. Great product.",
          "Contenu": "There were only three cards I had trouble scanning into the game but with a little patience and some finaggeling I got them to work to. Every rfid card worked and I reaped the rewards that followed handily. The card art is adorable and the over all quality is a must for cunsumers. Just maybe do a little more QA and your absolutely golden. Thanks for the awesomeness and keep doing what you do."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Elizabeth",
          "Nb_Reviews": 1,
          "Date": "2022-02-03T02:24:15.000Z",
          "Titre": "One of the cards unfortunately did not…",
          "Contenu": "One of the cards unfortunately did not work as expected. However, they look amazing, were shipped in a timely manner, and the rest all work like a charm. We would recommend again, and we would buy from them again for ourselves."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Red",
          "Nb_Reviews": 1,
          "Date": "2021-12-17T23:17:53.000Z",
          "Titre": "Took a while, but worth it",
          "Contenu": "It took almost a full month between initial purchase and receiving the package, but after testing every card and seeing them work every time is worth it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Arianne R",
          "Nb_Reviews": 1,
          "Date": "2022-04-18T14:11:22.000Z",
          "Titre": "Great Cards",
          "Contenu": "It took a little while to get here, but that’s okay. I was just very excited to try them out and not patient enough. They actually work and I plan on buying a different set it the future."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "hades",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T09:00:56.000Z",
          "Titre": "Can't HOLD all these cards!",
          "Contenu": "PROS: - Appearance- Fixed error in order- Cards do as advertisedThe cards look nice. The ones that work are very convenient. One of my cards did not work, but they sent me a replacement and it works very well. I am satisfied.CONS:-8 extra cards I have NO use for at all-Had to wait 15 days to get the card I ordered the set for.-Customer Service could be better.The problem with sending me an entirely new full set is that I have no use for 8 extra amiibo cards. I just wanted one. I would be happy with one. I thought it would be nice to get just the one that was broken, and one additional one. I even offered to pay for the additional one.Recommendation:They do work, and if your first set comes in. Make sure to test them all. The team does make sure you get what you ordered. If you need any of them urgently, I don't recommend getting them here. If there is an issue it will take a while and you will end up with a whole lot of unnecessary extras."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Annabelle",
          "Nb_Reviews": 2,
          "Date": "2022-03-12T14:56:16.000Z",
          "Titre": "Mostly perfect, 1 typo",
          "Contenu": "Mostly perfect except ace’s card had His name spelled wrong: Aoe"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ron Euefrueno",
          "Nb_Reviews": 1,
          "Date": "2021-11-03T19:48:58.000Z",
          "Titre": "The card's are awesome and the book…",
          "Contenu": "The card's are awesome and the book binder thing is even better"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William Welch",
          "Nb_Reviews": 1,
          "Date": "2021-06-23T14:00:41.000Z",
          "Titre": "Card size",
          "Contenu": "I thought they were full size cards not the small ones but they work so it turned out ok."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Terri Lannister",
          "Nb_Reviews": 1,
          "Date": "2021-03-24T00:55:50.000Z",
          "Titre": "All worked except Ruby would by from…",
          "Contenu": "All worked except Ruby would by from them again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hyrum Pearson",
          "Nb_Reviews": 1,
          "Date": "2019-08-30T17:09:13.000Z",
          "Titre": "The cards are really cool",
          "Contenu": "The cards are really cool! I'm loving them so far. Sad to say though, one of the cards doesn't work. I think it may be the sheik one. Anyways it's a great product but can't put 5 stars. Thanks!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe Schmoe",
          "Nb_Reviews": 1,
          "Date": "2020-04-19T14:51:28.000Z",
          "Titre": "Decent value",
          "Contenu": "One card doesn’t work 👎. The cards are very compact 👍."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lochlan McFarland",
          "Nb_Reviews": 1,
          "Date": "2020-03-24T22:23:11.000Z",
          "Titre": "Botw 23 Amiibo Card Pack",
          "Contenu": "It shipped on time, all cards arrived in a case neat and orderly, and I enjoyed looking at the cute designs. However the Zelda Windwaker Amiibo card was defective."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vinto",
          "Nb_Reviews": 4,
          "Date": "2020-02-19T13:32:45.000Z",
          "Titre": "I can change my mind",
          "Contenu": "Changing my review due to slow shipping. Supposed to arrive today. I’m sure it will and product will be great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BA",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T18:58:57.000Z",
          "Titre": "Great experience!",
          "Contenu": "I found what I needed and it arrived on time and in good condition."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Druzow",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T12:21:49.000Z",
          "Titre": "Easy to order",
          "Contenu": "Easy to order, fast delivery"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alex Jean",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T21:12:12.000Z",
          "Titre": "They work!",
          "Contenu": "My order came relatively fast and I'm happy to report that the amiibos work!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gabriel",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T23:19:11.000Z",
          "Titre": "I was nervous at first, but great value!",
          "Contenu": "I was nervous at first, but all the cards work and do exactly what they said they do.  If you dig a little the site has a link to a Google Sheet with what each Amiibo card gives you. That's helpful.  An incredible value and my kid is thrilled he didn't have to pick one amiibo for his birthday, but got ALL OF THEM."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angel Sepulveda",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T00:14:57.000Z",
          "Titre": "All works",
          "Contenu": "Just wish the art wasn’t just botw link."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thompson G",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T01:19:55.000Z",
          "Titre": "Excellent product",
          "Contenu": "Good prices, fast shipping, and a solid, worthwhile product. These cards work perfectly. I wish they were slightly bigger so I could see the art better, but then they'd cost more, so overall, I think the pricing is excellent."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Xenon Lee",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T20:31:49.000Z",
          "Titre": "Love them!",
          "Contenu": "I love how compact the cards are! And so well packaged too!I am definitely going to order again soon!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Kait",
          "Nb_Reviews": 2,
          "Date": "2023-03-17T18:31:35.000Z",
          "Titre": "Great experience and the cards are exactly what I was looking for",
          "Contenu": "The cards work great and I’ve had no problems scanning them in. They were exactly what I was looking for — much more small and portable than the amiibo figurines and easy to use. Communication was clear and shipping was efficient and fast, especially considering it was coming to my home in Canada from China. I wouldn’t hesitate to order from Zelda Cards again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Taylor Koch",
          "Nb_Reviews": 1,
          "Date": "2022-06-04T18:14:01.000Z",
          "Titre": "Couldn't be happier!",
          "Contenu": "Package just arrived, got to Illinois all the way from China in only 11 days! Super impressed with the graphics, the cards look great, and so excited for the themed joystick caps! What an awesome business to also include bonus gifts! Highly recommend and personally I will be purchasing from them again soon!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sam",
          "Nb_Reviews": 1,
          "Date": "2023-03-18T17:43:56.000Z",
          "Titre": "Zelda Cards",
          "Contenu": "A few of the cards I received seemed to be duplicates of each other and were not correct. I contacted customer support and received a quick response and a promise to receive replacements. (Props to the support team)Apart from that, the cards scan well and are of good quality. And the price is incredibly reasonable. I wholeheartedly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer Hernandez",
          "Nb_Reviews": 1,
          "Date": "2023-03-19T21:19:23.000Z",
          "Titre": "They work well and got them at a great price",
          "Contenu": "I was happy to find these Amiibo cards at a great price, including the shipping. My only complaint is I received these a few days after the date I was originally given for delivery. I don't know who is to blame, so I'm not going to knock a star off for something the company had no control over. But even though I have only used them once, they seem to work really well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hugh G Rection",
          "Nb_Reviews": 1,
          "Date": "2021-11-04T15:30:17.000Z",
          "Titre": "Worked as advertised",
          "Contenu": "Worked as advertised. I'm glad I found out about these nfc cards because trying to buy the actual amiibos for BOTW would've been not only time consuming but expensive. Resale on amiibos is ridiculous! So thank you Zeldacards for saving me tons of money and offering a great product at a reasonable price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SquatchDa",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T02:09:08.000Z",
          "Titre": "Perfect, no issues at all.",
          "Contenu": "Everything was perfect. Shipping was smooth, even coming from Hong Kong. Every card works everyday. Case is solid. Manual is very detailed, it even has info on how to care and maintain the cards which isn't a big deal but the fact that the effort was made to give the end user every detail possible in a simple way is a good thing. Very pleased with the purchase, I honestly don't have a single complaint. Keep up the detailed and diligent work, you have my trust."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alice Esperanza",
          "Nb_Reviews": 3,
          "Date": "2021-10-23T18:14:42.000Z",
          "Titre": "I ordered ALL Animal Crossing cards…",
          "Contenu": "I ordered all Animal Crossing cards available. Very good quality and they’ve all worked so far. Only sucky thing is I couldn’t use two different coupon codes when I placed the order. Neither of them worked but I was desperate to order them as the BIG update is upon us and I know they become impossible to find. Overall great experience. 9/10 recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RBF",
          "Nb_Reviews": 4,
          "Date": "2021-10-28T20:46:46.000Z",
          "Titre": "Easy to order, great selection",
          "Contenu": "Easy to order, good selection - I was able to find what I wanted (we ordered two older series Amiibo cards for Animal Crossing in advance of the update)!  The website explained clearly where the package was coming from so I was aware that there could be a wait, however I was pleasantly surprised that it arrived faster than I had expected.  The tracking was accurate and overall it made for a great shopping experience.  I saw that the seller will also be offering Series 5 cards - I will be back & will get those when they come out!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessica Hammond",
          "Nb_Reviews": 1,
          "Date": "2023-06-03T04:13:40.000Z",
          "Titre": "Good site for NFC Cards!",
          "Contenu": "They delivered the product in a timely manner, and the vast majority of them worked perfectly. I told them about the the one card that did not work, and they immediately began the process of shipping a replacement back out to me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T07:20:06.000Z",
          "Titre": "Cards are great and compact",
          "Contenu": "Update 2/20/2023I was contacted about my dissatisfaction with the cards and was given a new set at no cost. To me, that shows how much this company values their customer satisfaction and I really appreciate it. Original postI bought these cards about a month ago and they all worked flawlessly. I noticed the cards started to give me issues about a week ago where some of the cards wouldn't scan no matter what I did from restarting the game to moving around to a more open spaced area. The cards wouldn't scan. Sometimes the card scans but no items drop immediately. There's too much hangtime in that matter. Even as I write this review I'm still having issues with some cards not working anymore. The biggest culprit being the Sheik card. I'm disappointed overall with how these cards fail when they stated that it'll work 100% of the time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RangusDangus",
          "Nb_Reviews": 1,
          "Date": "2021-01-22T16:31:41.000Z",
          "Titre": "Ugly but awesome",
          "Contenu": "The artwork is absolute $hit but the cards work great and the price is awesome. They're also the perfect side for a pro controller which is a huge plus. Id recommend these to anyone who wants the amiibo functionality without spending a fortune."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Space Surfer",
          "Nb_Reviews": 1,
          "Date": "2020-12-01T02:00:37.000Z",
          "Titre": "Great quality cards!",
          "Contenu": "Placed my order the day before thanksgiving and got it the following week on Monday. Came a lot faster then I thought being a holiday week. Great little cards for traveling! Nintendo is missing out on a great market idea. Thank you Zelda Cards for providing an amazing service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carlos Zatz",
          "Nb_Reviews": 1,
          "Date": "2021-09-20T04:19:36.000Z",
          "Titre": "Great all around",
          "Contenu": "Great all around - purchase was easy, shipping was faster than expected, and product was very useful with really nice artwork on each card. Would definitely recommend to anyone who doesn’t have the money to buy all the necessary Amiibos!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karey Yates",
          "Nb_Reviews": 1,
          "Date": "2022-09-05T13:16:00.000Z",
          "Titre": "Never received them. Lost",
          "Contenu": "was going to get these for a birthday present that was 3 days ago, thought they'd be a great idea. I ordered the cards and never received them it's been about 2 weeks. I've emailed them still haven't heard anything.Update: USPS has lost them, such a aggravation. I fist gave 1 star change to 5 only because zeldacards gave me a full refund and offered 10% if I reorder them. I really do but I don't trust the USPS anymore. I wish they could use UPS or FedEx."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Lisa Hutchison",
          "Nb_Reviews": 2,
          "Date": "2020-08-24T03:32:24.000Z",
          "Titre": "Amazing!",
          "Contenu": "The cards came fairly quickly ( I'm located in Australia ) and every single one works! They're incredible for the price I had my doubts but they've definitely been washed away If you don't have the 100's of dollars it'd cost to have all the amiibos, this is the BEST alternative They come neatly in a box and have super cute artwork too Super happy with this purchase, definitely going to recommend to friends! Outstanding for the price honestly, I love them"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rodney Mullikin",
          "Nb_Reviews": 2,
          "Date": "2020-05-30T03:04:21.000Z",
          "Titre": "Absolutely amazing!",
          "Contenu": "Absolutely amazing! Fast delivery, every card works as promised,they give you 2 sweet sheika thumb grips, and they give you over $100 worth of downloadable bonuses. Very happy with my order. I will recommend to anybody that loves BOTW!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Black Link",
          "Nb_Reviews": 1,
          "Date": "2021-10-28T16:46:12.000Z",
          "Titre": "I’ve never written a review on anything…",
          "Contenu": "I’ve never written a review on anything before but i said screw it. These cards are a life saver if you don’t really care about having amiibos but want the in-game rewards.Its basically like buying 25 amiibos for 20 bucks! Issa steal"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vick O.",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T18:52:37.000Z",
          "Titre": "Wonderful service!",
          "Contenu": "The quality of the cards is wonderful, the shipping time was quite short, and the little cap covers were very cute and on-theme for what cards I purchased!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brocarina of Time",
          "Nb_Reviews": 1,
          "Date": "2020-07-13T17:21:10.000Z",
          "Titre": "Definitely recommend if you don’t wanna buy all those amiibos",
          "Contenu": "Cards word exactly as advertised! The art style is a bit different from the actual Zelda characters so it took me a minute to figure out which one was what, but they work! Excellent shipping and delivery time too! 10/10"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Ron Jeremy",
          "Nb_Reviews": 1,
          "Date": "2022-10-01T19:07:09.000Z",
          "Titre": "Tiny little things but they absolutely…",
          "Contenu": "Tiny little things but they absolutely work as advertised. Shipping estimate time was right on. Will probably buy again when my cat inevitably pushes them off the table and they disappear into oblivion."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alyssa Lillian",
          "Nb_Reviews": 1,
          "Date": "2020-11-05T20:34:41.000Z",
          "Titre": "Best customer service",
          "Contenu": "Best customer service. I had received some defective cards and I was immediately was reached out to and given a completely new set of amiibo cards that worked perfectly and shipped quickly! I’ve never had that kind of service before."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alec C",
          "Nb_Reviews": 1,
          "Date": "2022-02-02T13:51:47.000Z",
          "Titre": "Extremely fast service and invaluable bonuses!",
          "Contenu": "They went above and beyond to provide a great product and additional free items. I am extremely happy that I bought from this site, and everything has been very thorough to ensure I received all my purchase benefits."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alina",
          "Nb_Reviews": 1,
          "Date": "2022-04-10T22:20:03.000Z",
          "Titre": "Quick delivery and good quality.",
          "Contenu": "The delivery was really fast considering it was coming to the US from over seas. This is my second purchase of all the Animal Crossing’s cards and plan to buy a 3rd set for my other nephew. I just need a card book holder now haha. I did notice there are some cards that come looking like it’s a caravan card but it’s just a normal character so I wish those would’ve come w just the character pictured like the others so I can more easily see which character it is. Since they are so small and only seen them in the driver window. I haven’t had to use their customer service for issues w the cards bc I haven’t checked if they work, but they send a card w contact info for any issues and I expect they will resolve any issues timely. I want to purchase the Zelda sets but I am not happy with how they look compared to other sites."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lex",
          "Nb_Reviews": 1,
          "Date": "2022-01-09T23:41:29.000Z",
          "Titre": "Excellent service!!!",
          "Contenu": "Excellent service!!!! Excellent Cards!!!! Son says all but one card work (a River card). Maybe he’s not using it at the right time/ place??? Otherwise - AMAZING!!!! Arrived in the 7 days as promised. Will order from you again in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "calab chavez",
          "Nb_Reviews": 1,
          "Date": "2021-01-11T09:20:34.000Z",
          "Titre": "I had trouble with the information I…",
          "Contenu": "I had trouble with the information I put in and I emailed the staff to fix these and they seemed like very nice people and helped my situation.Overall this is my first experience with purchasing things online and having them come to me so this was very nice."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dj",
          "Nb_Reviews": 1,
          "Date": "2020-07-12T18:53:40.000Z",
          "Titre": "Tbh I got the cards to use on skyrim…",
          "Contenu": "Tbh I got the cards to use on skyrim for that purpose they were perfect I also used these on smash bros. But they dint really do anything tbh wish they worked on there too i haven't used them for botw yet but I will soon and will update my review but so far I am very happy with this purchase maybe the company with also do custom fighter cards or special amiibos for smash ultimate in the near future. Rating 10/10Price 10/10Shipping speed 9/10Overall 10/10"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony",
          "Nb_Reviews": 2,
          "Date": "2022-05-15T18:09:47.000Z",
          "Titre": "Product and service are top tier!",
          "Contenu": "Product and service are top tier! I received the amiibo cards in the mail in almost no time at all and they worked great. I had a slight issue with my Majora’s Mask card but they were very accommodating. They immediately replaced the card and shipped it out to me for free. The service was excellent and prompt. I would definitely purchase more products from them in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2021-06-24T14:36:35.000Z",
          "Titre": "Solid site for amiibo cards",
          "Contenu": "Fast shipping and good quality items. This is just a genuinely convenient site, especially when you don't have a ton of money to drop on actual amiibo figures but still want the amiibo-exclusive items."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2022-02-09T03:44:07.000Z",
          "Titre": "Nice site, good review",
          "Contenu": "Original: The cards weren’t delivered. That fault was entirely my own, but what’s infuriating is that there was not one bit of a refund at all. $16.77 might not be much, but I’d still like my money back.Edit: Got the money back. I apologize for wasting your guys’ time, I’ll leave a nice review here, besides, the site looks and feels pretty nice."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zachary Morris",
          "Nb_Reviews": 1,
          "Date": "2022-01-25T05:02:27.000Z",
          "Titre": "Very happy with my purchase",
          "Contenu": "They function as intended and the price is fantastic. Very happy with my purchase and grateful that this service exists. Delivery was completed in the agreed upon time window. Thank you and well done."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Taylor",
          "Nb_Reviews": 1,
          "Date": "2020-05-04T21:17:30.000Z",
          "Titre": "They're really awesome actually",
          "Contenu": "They're really awesome actually, they got here much faster than I thought, they are tiny and adorable, and they function! Highly recommend using the lid as a \"discard\" holder to keep track of them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher Manalansan",
          "Nb_Reviews": 1,
          "Date": "2022-01-31T23:37:31.000Z",
          "Titre": "Great buy for Zelda gamers!",
          "Contenu": "The cards are functional. They are sturdy and easy to use. Multiple manuals and help are provided for use. Delivery is on time and I definitely recommend buying from this seller. The only suggestion I have would be a print-out of the card list and it’s functions. There is a pdf file that you can use via scanning it but it just directs you to a website link from their main and the print is too fine to read."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cyanne Tate",
          "Nb_Reviews": 2,
          "Date": "2022-06-19T02:31:59.000Z",
          "Titre": "Great Purchase!",
          "Contenu": "This is my second time purchasing from Zelda Cards and they’ve yet to disappoint me! The cards all came in great condition and work great in game! I’m so excited to have more of my dream villagers in Animal Crossing!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lumen",
          "Nb_Reviews": 1,
          "Date": "2021-11-30T07:00:36.000Z",
          "Titre": "There was an issue in the delivery…",
          "Contenu": "There was an issue in the delivery process that ended up having everything delayed but they got back to me quickly when I asked, gave me a partial refund, and sent me a replacement without me even asking ( though I was considering asking for one ).  All in all a good experience despite the hitches"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Manntir",
          "Nb_Reviews": 1,
          "Date": "2020-05-12T00:44:02.000Z",
          "Titre": "A Really Good Product",
          "Contenu": "It has been about a week since I bought the Zelda Amiibo cards and I am astounded on the great service I received. The package was delivered swiftly and in top shape. Everything promised was given and everything worked perfectly. I am really pleased with my purchase and would recommend to anyone who likes the Legend of Zelda series or  the rewards of the amiibo."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Ken",
          "Nb_Reviews": 2,
          "Date": "2022-01-10T19:25:38.000Z",
          "Titre": "Definitely meet all expectation!",
          "Contenu": "Alright, I was a bit leery to order from so far but let me tell you, this is the real deal. The method of payments was fast and what I wanted. The shipping took about two weeks but it was expected since it was from China. The cards were perfect, they all worked and i got them all. Even the way those chips are made, just amazing. Now i can benefits from all the important amibos and didn't have to waist thousands of dollars on some status that I couldn't carry so freely as these cards."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ellie",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T20:03:55.000Z",
          "Titre": "Super Easy and Fast!",
          "Contenu": "Super easy and arrived earlier than expected! Also came with super cute bonus gift for my switch!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sam",
          "Nb_Reviews": 1,
          "Date": "2021-11-18T23:44:53.000Z",
          "Titre": "Exceeds all Expectations",
          "Contenu": "I ordered the full set of ACNH mini cards (3 listings at the time since a new one just released). I got my order in and right there was something wrong, turns out it was just a miswording on the listing they admitted could cause confusion. I didn’t expect to get the missing items since it was an honest mistake and it actually wasn’t supposed to come with it but they sent those out anyways because of the error. The support has been amazing. For Ian’s in the U.S. shipping was very fast and even for the out of country item it was fast shipping so things considered with the delays right now. All 204 amiibo cards I got all work perfectly and are extra cute! They are very high quality and the printing on them is amazing. I couldn’t suggest them enough."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Allen",
          "Nb_Reviews": 1,
          "Date": "2021-05-13T12:43:07.000Z",
          "Titre": "All of our cards work great",
          "Contenu": "All of our cards work great. If you get the free joystick covers (pink and blue), the may separate the card from the joystick too far for the card to read. We had a couple of cards the didn't read with the cover on, so we removed it, and then they worked well. Zeldacards, this solved the Amiibo scarcity problem and opened up the parts of BotW that we couldn't access! So fun!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jose Fernandez",
          "Nb_Reviews": 1,
          "Date": "2022-01-10T22:37:36.000Z",
          "Titre": "Really all 25 Amiibos!!!",
          "Contenu": "I purchased these cards after reading through the reviews just in case it was a scam. After being satisfied this wasn't a scam I purchased the pack. Once they arrived I decided to use them all immediately and thankfully they all work! No repeats are also in the art! each card is unique. And they are very tiny! That picture of one next to the quarter is the best way to imagine them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "usncti",
          "Nb_Reviews": 1,
          "Date": "2021-12-08T20:23:34.000Z",
          "Titre": "I was worried at first that it may be a…",
          "Contenu": "I was worried at first that it may be a scam but I’m very happy to say it’s completely safe. I was so excited to use the cards and I’m very happy that I could buy these instead of spending thousands of dollars on amibos."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brandon",
          "Nb_Reviews": 4,
          "Date": "2021-07-24T19:31:45.000Z",
          "Titre": "A Great and reliable seller with great packs",
          "Contenu": "Bought Animal crossing cards from them and I love how it came out and the quality is great. I bought Zelda cards from them before and I think the same about those and I use them a lot.Top quality packs for sale and the seller is very reliable and very fast with their shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marlene Abshear",
          "Nb_Reviews": 2,
          "Date": "2021-11-19T13:55:58.000Z",
          "Titre": "Repeat Customer",
          "Contenu": "I ordered Zelda cards for my son and ACNH cards for myself. They were perfect! So much so that I came back for the new ACNH cards when they were released. Awaiting my package now, but if you’re on the fence, definitely order from zeldacards. They’re awesome!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brandon",
          "Nb_Reviews": 4,
          "Date": "2021-05-05T23:25:14.000Z",
          "Titre": "Bought a 24 pack of Zelda amiibo cards…",
          "Contenu": "Bought a 24 pack of Zelda amiibo cards and I gotta say I love how it all came out they are a bit smaller than I thought but oh well it was cheap and they work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2021-11-09T01:43:34.000Z",
          "Titre": "Review",
          "Contenu": "Delivered ahead of schedule and every mini Animal Crossing Amiibo card scanned in as the villager pictured. No missing cards either!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Austyn Beichner",
          "Nb_Reviews": 1,
          "Date": "2023-04-22T02:47:01.000Z",
          "Titre": "AMAZING SERVICE",
          "Contenu": "I had my order on time and the extra joy con joy stick covers honestly made my day they were small and extra but was happy to receive them"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "smma",
          "Nb_Reviews": 3,
          "Date": "2022-02-04T06:14:59.000Z",
          "Titre": "Good bargain, would purchased more",
          "Contenu": "I had not heard of this group before but took a chance on the ACNH cards. I was very pleased. They are in great condition and all seem to work properly. We also purchased a binder for them to keep them organized. I intend to order more and would recommend it to anyone interested as well. They are reasonably priced and good quality for what they are. They are small though. They are mini cards in case you are not familiar with them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tracy Bagley",
          "Nb_Reviews": 2,
          "Date": "2022-03-12T15:48:52.000Z",
          "Titre": "Product arrived as described in a…",
          "Contenu": "Product arrived as described in a timely manner. All amiibo cards have worked so far and they even included a little gift that was much appreciated!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MMarks",
          "Nb_Reviews": 3,
          "Date": "2022-04-25T20:07:27.891Z",
          "Titre": "Received items ordered quickly and…",
          "Contenu": "Received items ordered quickly and amazing they work as supposed to! It’s amazing! I haven’t tested them all but immediately tested my faves…KK, Judy, and Julian😁"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carrie",
          "Nb_Reviews": 2,
          "Date": "2022-03-12T14:41:01.000Z",
          "Titre": "Faster than expected",
          "Contenu": "The cards came earlier than expected and are very cute, I haven't had a chance to test them out yet. Thanks again, if they work at 100% I will definitely be doing business with them again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristle",
          "Nb_Reviews": 1,
          "Date": "2021-04-15T21:30:42.000Z",
          "Titre": "ACNH Amiibo cards",
          "Contenu": "I bought from them through Amazon, but the Amazon listing is no longer there for me to review. I bought a set of 24 Animal Crossing Amiibo cards. They arrived quickly and all but one worked. I contacted their customer service about the one that did not work and they replaced it promptly and even sent an extra along with it! I am very pleased with them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jesse",
          "Nb_Reviews": 3,
          "Date": "2020-05-03T20:13:02.000Z",
          "Titre": "Shipped faster than predicted, works great.",
          "Contenu": "Shipped faster than predicted. Costs less than other similar products on Amazon. I emailed once to clarify a shipping date, and got a quick reply.  I am very satisfied!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kinich Chew",
          "Nb_Reviews": 1,
          "Date": "2022-02-16T01:19:30.000Z",
          "Titre": "Good customer service",
          "Contenu": "Good customer serviceWhen I needed help with something, I got the problem solved with help from a worker. They were quick to reply, were kind, and helped me solve my issue.Overall good customer service."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Zoe",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T21:53:59.000Z",
          "Titre": "literally amazing and perfect…",
          "Contenu": "literally amazing and perfect experience, I genuinely was like not sure about the purchase but literally every card works, I got a lot of amazing loots from the cards, and I hate how long it takes me at the beginning to forage to get food but these made it so easy to get stuff like meat and mushroom and fish plus it gave me great weapons to fuse and great things to fuse on the weapons!!! anyways literally amazing and perfect I recommend this place 100% the shipping was fast and everything wahoo"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan",
          "Nb_Reviews": 1,
          "Date": "2021-07-02T16:36:01.000Z",
          "Titre": "Excellent",
          "Contenu": "Excellent!  I ordered the NFC game cards nine o'clock Monday evening and by 10:30 the next morning I already had an e-mail saying they were shipped out.  Every card worked perfectly!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DanO",
          "Nb_Reviews": 1,
          "Date": "2022-05-03T18:42:27.000Z",
          "Titre": "Ordered the full Zelda Pack and every…",
          "Contenu": "Ordered the full Zelda Pack and every one of then works perfectly!  Great alternative to spending hundreds on space eating Amiibos!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marie Figueroa",
          "Nb_Reviews": 1,
          "Date": "2023-06-04T23:53:10.000Z",
          "Titre": "These amiibos have made the game so fun!",
          "Contenu": "Totally necessary to ease into the game and lessen the stress of making foods/elixirs and replacing weapons!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alexa",
          "Nb_Reviews": 1,
          "Date": "2020-08-03T13:53:21.000Z",
          "Titre": "When I got my cards I was so happy to…",
          "Contenu": "When I got my cards I was so happy to finally receive them I tried them on my nintendo switch and they actually worked I'm so glad I bought and I hope to use them more in the future 😊😊😊😊"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda Robbins",
          "Nb_Reviews": 1,
          "Date": "2020-12-07T19:09:20.000Z",
          "Titre": "Exceeded expectations",
          "Contenu": "I ordered Zeldacards as an Xmas gift. The package arrived in good condition, well in advance of the holiday. Very pleased with the service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff Luker",
          "Nb_Reviews": 3,
          "Date": "2023-01-25T01:09:06.000Z",
          "Titre": "Shipping very fast. Great cards",
          "Contenu": "The shipping was fast for coming from China. Only took 10 days. Other places took a month. The cards work fine. A couple of them take a second or two to respond but that happens in my other self made set also. The cards are small(like a postage stamp) almost too small for my big hands. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony Martin",
          "Nb_Reviews": 2,
          "Date": "2022-04-03T17:59:06.000Z",
          "Titre": "The cards are absolutely 10/10",
          "Contenu": "The cards are absolutely 10/10. I may buy another pack. My only issue was long wait for delivery but totally worth it!  Amazing!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2022-02-05T16:27:36.000Z",
          "Titre": "Arrived sooner than expected",
          "Contenu": "Arrived sooner than expected, tested a handful of cards, all worked so far. Would recommend this to friends."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff K",
          "Nb_Reviews": 1,
          "Date": "2021-12-11T20:18:01.000Z",
          "Titre": "Found this great site",
          "Contenu": "Found this site while searching for Amiibo Cards for BOTW on Switch. This site had a variety of options to choose from on how many cards I wanted. The prices were fantastic and even got a few dollars of with a code on their site. The only thing that was a downside was the shipping. It took almost 3 weeks to receive them because they came from China. But I emailed the site and they got back to me in a day and did their best to take care of me and make sure I was happy. I finally received the cards and they are absolutely perfect. They are about as small as a Nintendo Switch game. The art on them is fantastic and have a very sturdy feel where they don’t feel like breaking (They still have to be handled carefully though). They work amazingly with BOTW and I couldn’t be any happier. I will certainly be buying the Animal Crossing cards (all the sets) for my next purchase. Thank you ZELDACARDS! You got another satisfied customer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Turner",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T18:24:28.000Z",
          "Titre": "Two of the cards did not work-updated",
          "Contenu": "Two of the cards did not workUpdate rating as customer service was great. They replacement the two card that did not work"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lacey",
          "Nb_Reviews": 1,
          "Date": "2021-11-11T14:38:02.000Z",
          "Titre": "I absolutely love these amiibos their…",
          "Contenu": "I absolutely love these amiibos their so cute and small for easy storage! I've tried a few of them and they work perfectly! I would love to see a full set of old NPCs and the new Series 5 full set to be made because I would 100% order them! ♡"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ash ketchum",
          "Nb_Reviews": 1,
          "Date": "2020-08-10T03:08:40.000Z",
          "Titre": "Cheap and great",
          "Contenu": "This is amazing and extremely great if you don’t want to spend a fortune on amiibos and the way the cards feel are great. Oh yeah and the artwork is great. It really is a great alternative. The fact that it doesn’t take up that much space and the fact that it works is astounding."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joaquin Banks-Williams",
          "Nb_Reviews": 1,
          "Date": "2020-11-08T22:09:41.000Z",
          "Titre": "Took a leap of faith but i was skeptical",
          "Contenu": "Was skeptical but went to GameStop for amiibos and was directed to ur website and i took a leap of faith, thank you for being legit!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zelda fan",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T14:57:38.000Z",
          "Titre": "All cards work!",
          "Contenu": "The cards arrived exactly as described and pictured and each one works. I got what I paid for!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Garcia",
          "Nb_Reviews": 1,
          "Date": "2021-11-02T03:25:39.000Z",
          "Titre": "Absolutely amazing totally worth the…",
          "Contenu": "Absolutely amazing totally worth the money you get valuable items and ingredients that can always be used, I would totally buy again and recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ren Amamiya",
          "Nb_Reviews": 1,
          "Date": "2020-07-14T16:20:00.000Z",
          "Titre": "Fast Shipping, Amazing Product",
          "Contenu": "My cards got to my house fast, took only 2 days from ordering! All work perfectly :) definitely choose these over the Amiibo, and I love the artwork too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Missy",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T03:50:35.000Z",
          "Titre": "cute and works",
          "Contenu": "Everything came quickly and works well. The cards are so cute! I only wish they had some written ID on them. There’s so many different Links, I never really know which one I’m scanning! But surprise is a bit fun, too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 3,
          "Date": "2021-08-05T11:39:55.000Z",
          "Titre": "100% satisfied and will likely buy again",
          "Contenu": "Although there were delays in shipping due to product availability, which they did also refund the 2 day shipping I paid for and still overnighted the one package, and a slight lag in communication due to an unspoken \"waiting for product\" time period, overall the process of working with ZeldaCards was amazing. I was reluctant to purchase two sets in fear of overlapping cards, but between the 90 card set and the 42 there were absolutely zero duplicates. I would highly recommend these Micro Animal Crossing Amiibo cards to anyone that is looking to increase their collection."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hi",
          "Nb_Reviews": 1,
          "Date": "2021-07-23T08:47:00.000Z",
          "Titre": "Received only 2 days after order",
          "Contenu": "Received only 2 days after order, they are very fast. Cards work great, so exciting to invite campers to my island."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Asher Storms",
          "Nb_Reviews": 1,
          "Date": "2021-07-16T21:42:57.000Z",
          "Titre": "I'm extremely satisfied",
          "Contenu": "I'm extremely satisfied! The cards are perfect, travel size, and have no issues reading on the switch. I recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lane Baze",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T17:36:34.000Z",
          "Titre": "All Metroid Cards Worked",
          "Contenu": "All cards worked, try to order before having game as the cards took ~1wk to arrive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jenny",
          "Nb_Reviews": 1,
          "Date": "2022-08-18T04:50:20.000Z",
          "Titre": "Sanrio cards",
          "Contenu": "Wasn’t sure if they were really gonna work since they’re so small but they worked perfectly!! Definitely recommend👍🏽"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kayla Grant",
          "Nb_Reviews": 1,
          "Date": "2021-11-14T12:30:56.000Z",
          "Titre": "Amazing service and delivery",
          "Contenu": "Amazing service and delivery! On time and I was updated the whole time on my package. Cards are in awesome condition. You guys rock!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cindy Kolman",
          "Nb_Reviews": 1,
          "Date": "2021-07-16T13:14:19.000Z",
          "Titre": "My order arrived much sooner than…",
          "Contenu": "My order arrived much sooner than promised and was double packed ton ensure no damage Great job 👏🏻"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tyler.",
          "Nb_Reviews": 1,
          "Date": "2020-06-03T15:10:18.000Z",
          "Titre": "I love these cards. Exactly what I wanted",
          "Contenu": "Kept me up to date and offered lots of support if needed. You can trust these guys kept me informed of the package's progress in the mail. Got here safe and sound. Express shipping lives up to its name. Worth it if you ask me if you want it as soon as possible.  Thumbs up from me ^_^-b"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "kriz kiss",
          "Nb_Reviews": 1,
          "Date": "2021-12-13T05:51:58.000Z",
          "Titre": "The best in communication,action right…",
          "Contenu": "The best in communication,action right way if u have problems in ur purchase. i will100% buy again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chevychick",
          "Nb_Reviews": 1,
          "Date": "2022-03-15T23:56:02.000Z",
          "Titre": "These cards work!",
          "Contenu": "These cards work!!  I never have a problem with them as I do with another set I have from a different seller. They are small but as long as they work that doesn’t matter. It took about a week to get my order. Great job!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessica Mallegol-Hansen",
          "Nb_Reviews": 2,
          "Date": "2021-07-20T17:13:37.000Z",
          "Titre": "Great product",
          "Contenu": "Great product. Animal Crossing cards feel high quality and each one I have used work so far. I got the 72 pack and they came in cute little plastic containers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brenden",
          "Nb_Reviews": 2,
          "Date": "2022-01-04T16:33:47.000Z",
          "Titre": "Work well. And free gift was cool",
          "Contenu": "Work just fine. Online card list is helpful for identifying what is what. Free gift of thumbstick covers was very cool"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chad",
          "Nb_Reviews": 1,
          "Date": "2021-11-11T04:08:13.000Z",
          "Titre": "The cards work!",
          "Contenu": "The cards work! We've only tried 2 so far and you have to put them on the controller just right to get them to work. More finicky than our Nintendo amiibos but I suppose that's to be expected!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sukhoi & Family",
          "Nb_Reviews": 1,
          "Date": "2022-10-09T21:58:46.000Z",
          "Titre": "Excellent & affordable",
          "Contenu": "Excellent affordable working NFC cards with supreme email communication sealing my satisfaction as a customer. We’ve been using the cards daily since receiving them several weeks ago.Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Tamara Hocken",
          "Nb_Reviews": 1,
          "Date": "2023-05-14T23:09:35.000Z",
          "Titre": "Sent replacement for defective card",
          "Contenu": "I got the pack of Zelda amiibo cards, all worked except one, I asked for a new one of that card and they sent one out! Even sent surprise joy-con covers with!! 10/10 would buy from again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karos",
          "Nb_Reviews": 1,
          "Date": "2022-04-26T00:13:39.995Z",
          "Titre": "Adorably Awesome",
          "Contenu": "Literally smaller than a Switch cart and work incredibly. Easy to take anywhere and then some!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brandon",
          "Nb_Reviews": 4,
          "Date": "2021-05-06T15:48:38.000Z",
          "Titre": "Generally great",
          "Contenu": "The service was fast and easy to use the website is easy to navigate and the cards I bought from them were great quality"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryan N.",
          "Nb_Reviews": 4,
          "Date": "2023-07-26T18:32:44.000Z",
          "Titre": "Great experience",
          "Contenu": "They were quick and answered any questions I had regarding the shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ames Pond",
          "Nb_Reviews": 2,
          "Date": "2021-10-29T01:13:08.000Z",
          "Titre": "Fair Retailed Price for WORKING Cards",
          "Contenu": "Bought ambiio cards for Animal Crossing for a fair price. Most sites have them priced gouged for double cost and not all cards work. All cards worked perfectly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Em",
          "Nb_Reviews": 1,
          "Date": "2022-03-16T13:39:44.000Z",
          "Titre": "Great!",
          "Contenu": "The cards work just as expected! They were perfect for what I was wanting and at an affordable price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lora",
          "Nb_Reviews": 2,
          "Date": "2022-06-10T23:27:01.000Z",
          "Titre": "Love this place",
          "Contenu": "Love the cards, they work great! Loved the themed caps! Got to Oklahoma in 10 days! Thank you for the experience will definitely come back!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Heidler",
          "Nb_Reviews": 1,
          "Date": "2021-01-08T18:16:36.000Z",
          "Titre": "I am very happy with the product",
          "Contenu": "I am very happy with the product. They are amazing and very compact. Only issue that I had with it was not having a tracking number or anything to know where the product was."
        }
      ]
    }
  ]
}