{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.mrisoftware.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Leslie Hou",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T21:02:23.000Z",
          "Titre": "I have sent a feedback before already…",
          "Contenu": "I have sent a feedback before already about the new layout is not user friendly. All of our staff in my office agrees as well.We would rather have the old layout than the new one."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Jagan Medicharla",
          "Nb_Reviews": 3,
          "Date": "2023-11-04T06:08:40.000Z",
          "Titre": "Need to educate to them how to verify reports.",
          "Contenu": "Recently they reviewed my credit report and given as income discrepancy without seeing my paystubs/bank statement. Mentioned my employer not picked the call. Really are you guys are lifting call immediately. Having 18k auto loan for that mentioned too high. Really I feel very bad and never see such a worst report."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Bart Adriaens",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T10:31:18.000Z",
          "Titre": "As a business that is relying on…",
          "Contenu": "As a business that is relying on complete postcode data in the UK we are using their software.Contacting them about missing information in their data got me a short answer that it will be updated at the end of the month. And now, in the new month, it is still now corrected, and no replies anymore about the issue."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Stephen",
          "Nb_Reviews": 5,
          "Date": "2023-09-26T04:53:06.000Z",
          "Titre": "Support Service Failure",
          "Contenu": "I have been using VaultRE since its morphing from My Desktop and subsequent sale to MRI Software. Please do not depend on their support service. It is non existent and at best, takes several days to get any response at all with an actual solution even longer.  Consistently a fail with many major issues never resolved. Disappointing"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Keith A Thomas-Owen",
          "Nb_Reviews": 6,
          "Date": "2023-08-29T16:29:10.000Z",
          "Titre": "its a 1 star at the moment",
          "Contenu": "its a 1 star at the moment, in recent months customer service has been impossible to contact, I'm sat here with no credits for my system texts, been on the phone at No 1 position for over 2 hours. when it works it works, when it doesn't we suffer. Doran Kennedy Sales Limited."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Marit",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T15:46:10.000Z",
          "Titre": "If I could give 0 stars I would",
          "Contenu": "If I could give 0 stars I would. What a shambles of a company, making promises, not keeping them, then sending the wrong invoice 100 times, me always correcting them and then hearing nothing in return. Asking a simple address change that took 9 months to complete. Absolute embarrassment especially by Gareth who made it out on a formal complaint meeting that he was going to 'fix it all' for us. One year later, no further."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "mFlex",
          "Nb_Reviews": 21,
          "Date": "2023-08-24T11:25:26.000Z",
          "Titre": "They never answer their phones!",
          "Contenu": "My company uses them unfortunately!Calling their support - no one answers their phones! It's been 25 minutes now and I'm still number 2 on the line and now pushed back to number 3! It's always over 30mins before someone bothers to call!UK based!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amy Fleming",
          "Nb_Reviews": 2,
          "Date": "2023-07-03T22:11:20.000Z",
          "Titre": "If you have time to waste, this is the company for you",
          "Contenu": "I spent the entire day being passed around from department to department being told no this department handles this.. to no that was the department to handle this. I got a lot of i'll follow-up with this (that never happened) I'm so beyond frustrated that I wasted a whole day being passed around with no ownership of the situation being taken or lied about being taken and that my problem which is the biggest reason we use MRI software isn't fixed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "H. James",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T17:05:50.000Z",
          "Titre": "Support tickets, communication, follow-thru lacking",
          "Contenu": "Support tickets are not completed timely.  Urgent tickets are not responded to as an urgent matter. Communication is severely lacking. You, the customer, have to repeatedly follow up or ask about tickets or questions you have. I had a ticket in for a problem only to be told to put in a ticket for the same problem referencing the ticket she was closing. It has been a complete waste of time and energy switching to this company. I feel like my company is fixing more of the issues with the software internally than the company does itself."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "MS",
          "Nb_Reviews": 1,
          "Date": "2022-12-05T20:52:51.000Z",
          "Titre": "I have been trying to get my password…",
          "Contenu": "I have been trying to get my password sort out for weeks, nobody calls me, nobody emails me, no communication and I have to wait and wait for hours on line to get someone to talk to.My advise if you are going to call them grab a comfy chair as you will wait and wait."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amy Fleming",
          "Nb_Reviews": 2,
          "Date": "2023-06-08T13:25:28.000Z",
          "Titre": "I was given wrong information to begin…",
          "Contenu": "I was given wrong information to begin with, then upgraded our license based off that wrong information, now i'm locked out of the software because i've exceeded my licensed lease count. it's been 4 days and no resolution to this yet."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "sjean andrews",
          "Nb_Reviews": 2,
          "Date": "2023-06-15T05:27:19.000Z",
          "Titre": "Company charged me for using credit…",
          "Contenu": "Company charged me for using credit card for YEARS.  Never told me I could use a check for no fee.  Total rip off.  Not given any service fees back.  And now none of the agents speak English...guess they fired all the Americans for Asians a month ago"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nicole P",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T17:39:54.000Z",
          "Titre": "Boston Post is awful",
          "Contenu": "They can update the software. None of the reports work. It's awful."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William Vissing",
          "Nb_Reviews": 2,
          "Date": "2023-03-25T18:22:46.000Z",
          "Titre": "No return call like I asked no training…",
          "Contenu": "No return call like I asked no training for physical inventory.  This is why I called im in my third time and still not correct"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "nadar",
          "Nb_Reviews": 2,
          "Date": "2022-09-26T08:53:02.000Z",
          "Titre": "After 10 years with FSI (MRI) now I can…",
          "Contenu": "After 10 years with FSI (MRI) now I can tell for sure that this Company is a \"cowboy company\". They don't care about clients, only about how much they can pull out from the clients. Good ideas but very bad practice and management."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Craig Sewell",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T02:07:52.000Z",
          "Titre": "No response to my question"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Marit",
          "Nb_Reviews": 2,
          "Date": "2022-07-13T18:28:40.000Z",
          "Titre": "Literally the most useless service",
          "Contenu": "Literally the most useless service I have ever come across. 6 months of communication and no further then where I was 4 months ago because David Young can't deal with the simple request of changing the business name on the contract. Tell David to please contact me and then maybe we can put an end to this ridiculous saga."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andrea",
          "Nb_Reviews": 3,
          "Date": "2019-05-21T22:16:02.000Z",
          "Titre": "So painful to work with",
          "Contenu": "So painful to work with. I practically have a personal relationship with their poor, overloaded support employees. Starting and cancelling service is a huge chore invovling certified mail. Then, they don't believe you, even after all the certified amil and scanning and reminding and proving. The only reason I use this software is becauase I have no other options. They patch a whole in my current set-up becuae ym company insists on using the oldest functioning software."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Siragusa",
          "Nb_Reviews": 1,
          "Date": "2021-02-18T17:23:18.000Z",
          "Titre": "We are not able to write checks",
          "Contenu": "We are not able to write checks, we opened a case 6 days ago and it is not resolved yet. This is a serious issue because we have past due bill and upcoming bills with late fess that can exceed $15,000 if not paid."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thomas Fowler, CPA",
          "Nb_Reviews": 1,
          "Date": "2021-07-08T11:50:38.000Z",
          "Titre": "MRI has not been straight forward with HAB users.",
          "Contenu": "MRI has not been straight forward with HAB users since the beginning.  Over the course of three years, their support for HAB has decreased, while their fee for support has increased."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Andrew Blenkinsopp",
          "Nb_Reviews": 1,
          "Date": "2022-03-15T09:07:01.000Z",
          "Titre": "Since MRI have taken over rest the…",
          "Contenu": "Since MRI have taken over rest the quality of chat has reduced further. It's understandable that the original rest technicians on chat had extensive experience in dealing with situations as they worked closely with the technicians. But these days the only solution seems to be a callback. It's not service in real estate. It's poor time management. Some companies have trust account specialists that can sit by the phone all day waiting. Many smaller companies with skilled rest employees don't have time for pampered service. They need solutions. In chat. It's ok to say something is not possible. It's cumbersome to use follow up calls for to lack of knowledge in an attempt to resurrect the chat assistance rest was famous for. Ready is far superior to property tree. It's just that the chat customer service people really don't know the program anymore. Probably cause it's MRI not Rockend. Urging boss to dump MRI is rest is stopped. Property tree is no comparison to rest with someone that understands computers...."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Nathan Newmarch",
          "Nb_Reviews": 6,
          "Date": "2021-12-15T04:07:16.000Z",
          "Titre": "Avoid at all costs if you want any kind of after sales support",
          "Contenu": "We have been a customer of Strata Master for many years and it has been a good product with good support when things go wrong.  Since MRI bought the company the product has improved a bit, but the customer service and support is basically none-existent.  You call through to support, wait on hold for over 25 minutes to then get through to the \"support receptionist\" who tells you that all the support advisors are busy on other calls and you will have to wait for a call back. God know when that will come!  Too many times we have contacted them for support and they don't know how to fix it or you wait so long for the return call you end up fixing it yourself.  they need to hire more support staff, get back to customers quicker or better yet deal with the issue and provide a resolution in the first call.  the product is ok for what it does, the company is terrible and the customer support is none-existent.  Also don't complain to your account manager as he just shrugs it off most of the time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian Dewbre",
          "Nb_Reviews": 1,
          "Date": "2021-04-15T14:51:03.000Z",
          "Titre": "Not sure why it is so difficult to get…",
          "Contenu": "Not sure why it is so difficult to get in touch with someone to turn on a part of the software that we already pay for..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Diana Cazaudumec",
          "Nb_Reviews": 2,
          "Date": "2022-02-24T19:20:18.000Z",
          "Titre": "We have been a client of MRI for over 5…",
          "Contenu": "Update #4: 2/24/22 another email or two saying still being reviewed but no resolution a month after they said they would resolve it. They have no interest in customer service at all.Update #3: Still waiting 2/14/22…,Update#2: After being promised resolution by 1/21/22 it is now 2/6/22 and still no resolution only an email saying “has been sent to finance”…Too bad I can’t give zero stars….We have been a client of MRI for over 5 years. We have had billing issues for over a year now that they just can’t seem to get resolved. We have been emailing them for months and months and the follow up on their end has been poor. Their customer service people just don’t seem to know how to resolve issues at all. Even elevating the issue to a management level has not helped. At this point we are just going to invoice them for the billing overcharges to see if that does anything to move the process along.Update: Even though MRI promised in their reply that they would have it resolved by the end of this week (1/21/2022) I have now been advised that “legal is giving me pushback” according to our account manager. It has been over a year of duplicate Billings and two different accounts managers that have said they would get it resolved. Not much else to say except they have proven my point. Someone over at MRI should be ashamed of themselves."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Catherine Lambert",
          "Nb_Reviews": 1,
          "Date": "2021-06-23T14:21:59.000Z",
          "Titre": "As a client",
          "Contenu": "As a client, I know this is a small thing, but you could at least spell my name right.  SMH"
        },
        {
          "Note": 2,
          "Lieu": "IT",
          "Pseudo": "Marc Peltenburg",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T11:21:03.000Z",
          "Titre": "MRI uses old software to upgrade to in…",
          "Contenu": "MRI uses old software to upgrade to in their version 10.3.6. It is using SQL 2016 which will go out of support soon. Version 2019 is the latest version and is there since 2019. It is not logical to upgrade from 2014 to 2016 when 2019 is already there since a long time. This forces us to go to the MRI cloud and we are not ready for this at this time. That is the reason why we upgrade to v10.3.6"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Christina Yarmul",
          "Nb_Reviews": 1,
          "Date": "2023-04-25T19:59:58.000Z",
          "Titre": "I don't feel like CTM is easy to…",
          "Contenu": "I don't feel like CTM is easy to navigate.  I feel the dashboard is antiquated.  It needs to be simplified starting at the home page.  The way the clients are listed to being able to find past contracts, it isn't easy to navigate.  There is new contract software that is much more user friendly, less expensive that also allows Sellers, Buyers, Title Companies and Lenders to be added to the transaction."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Art DeBrito",
          "Nb_Reviews": 2,
          "Date": "2023-09-14T14:45:47.000Z",
          "Titre": "Written like spaghetti.",
          "Contenu": "Support is improving. The code is written to an old paradigm. There appears to be a million fixes as the program has evolved. As an example: this time. A second offer came in from the same buyer. It notified me there was a new contract. I shared the docs with the Buyer. Now I have two sets of disclosures and cannot tell which ones to delete. On top of that the new contract did not show up. (this is a typical example.) I will probably change to transaction desk by the end of the year."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Jessica Walmsley",
          "Nb_Reviews": 2,
          "Date": "2023-06-21T21:31:04.000Z",
          "Titre": "Needs improvement",
          "Contenu": "The telephone waiting time is now too long. The support team cannot help on all matters and have to refer you onto another team who you cannot speak to. Our account manager is not as responsive as we would expect."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "AA",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T06:56:04.000Z",
          "Titre": "Adding signatures to docs",
          "Contenu": "1. CTM eContracts and MRI have different labels for signatures when we receive notice via email that clients have signed the docs using MRI.  You cannot filter MRI signatures by address with this problem.  Makes it very tedious for a transaction coordinator to filter important docs.2. MRI signatures are difficult to add buyers for signatures for multiple offers in docs management for the relo teams. Meaning, you have to unlock, add buyers, then delete buyers and again add buyers each time you have a separate set of buyers.  Hard to explain!"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Margaret",
          "Nb_Reviews": 4,
          "Date": "2022-11-29T18:44:56.000Z",
          "Titre": "SORT OUT YOUR CALL WAITING TIME - PLEEEEEEEZE and save my sanity",
          "Contenu": "Its the same all the time - the call waiting time is absolutely awful, I feel this really does need to be addressed.  Again I will say, the software is amazing and when we do get through to a support member, they are knowledgeable and helpful - PLEASE PLEASE address your telephone wait time (I am begging you, its soul destroying)"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Terry L Clark",
          "Nb_Reviews": 2,
          "Date": "2023-06-17T18:23:02.000Z",
          "Titre": "I don't like that I can't pause my…",
          "Contenu": "I don't like that I can't pause my subscription. I was given wrong information on my first inquiry saying that I could only to be told by support that I could not."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Donna Carlton",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T23:09:59.000Z",
          "Titre": "Incorrect Accounting Entries - System Generated",
          "Contenu": "I have multiple recurring issues that impact the accounting component of the application that have been outstanding for years, with no focus being given to have these issues resolved.eg Incorrect proration of AP invoices, credit apply batches that don't equal zero.As an accounting application I would expect that ensuring correct accounting entries would be a priority.  Being advised that the issue could be related to how a user tabs/uses the screens could be valid, however improvements to the stored proc to validate the entries being treated, and a try catch logic being introduced should go some way to preventing these incorrect entries, and reduce the workload that it creates me to correct the issue after the fact."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Alexandra Arcus",
          "Nb_Reviews": 1,
          "Date": "2022-10-11T12:58:48.000Z",
          "Titre": "Slow response/resolution times on support ticket 04974880",
          "Contenu": "I raised a ticket on 3 October which has still not been investigated/resolved (04974880).The only response I have had is a mail to say it is assigned to a support analyst on the 3 October.I have chased on 7 & 10 October."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Anita F.",
          "Nb_Reviews": 3,
          "Date": "2022-05-03T14:02:19.000Z",
          "Titre": "Since becoming MRI everything takes…",
          "Contenu": "Since becoming MRI everything takes longer and the employees are no longer as helpful as they used to be, everyone is ready to push the ticket to the next department. As the client I have to remind them how the program works in order for the help to be sufficient. MRI Customer Service is garbage compared to the level of customer service  and job knowledge Tenmast used to give."
        },
        {
          "Note": 2,
          "Lieu": "MX",
          "Pseudo": "Samuel Lopez",
          "Nb_Reviews": 1,
          "Date": "2021-10-14T15:05:10.000Z",
          "Titre": "Not scalable",
          "Contenu": "Too many errors when a release came up or old issues not resolved.No adaptable for business rules in Mexico, an guess nor for south america.No handle customization level or layers, all must do a copy from original or prior customization.For information extraction not to stable, when try to communicate between DB your own, to square to get access rights."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kimball Herfurt",
          "Nb_Reviews": 1,
          "Date": "2021-08-10T12:14:34.000Z",
          "Titre": "The software is Not providing the…",
          "Contenu": "The software is Not providing the utility that we are paying for. I spent from approximately 8 am until noon with four tech support agents, the last being a supervisor, to finally get the software to do what it has been doing for years. This is not a beta test environment. Clients expect results, not fumbling around with software to get a listing agreement prepared."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Cristian Cortes",
          "Nb_Reviews": 1,
          "Date": "2021-10-01T03:30:46.000Z",
          "Titre": "Property Tree is a fantastic trust…",
          "Contenu": "Property Tree is a fantastic trust system, however, for property management tasks, the system has a lot to work on, for example, and just to name a few:Ma renewals is a very laborious process, the system should automatically flag to you the MA coming up once you set the perimeters, this can be done by an email or a task notification that pops up as a reminder.Lease renewals, whilst it is great that it has auto correspondence, you can not pick which tenant/owner get it or not, it is either all or noneThere are so many tasks processes that PT does not have which makes the process of day-to-day management laborious and inefficient."
        },
        {
          "Note": 2,
          "Lieu": "ZA",
          "Pseudo": "Patrick Kelly",
          "Nb_Reviews": 1,
          "Date": "2021-07-02T12:08:08.000Z",
          "Titre": "Residential Property Reports - Apartments",
          "Contenu": "It would be great if there could be a \"Unit Quantity\" amount rather than \"Square Meters\" in the reports for use of residential properties."
        },
        {
          "Note": 2,
          "Lieu": "ZA",
          "Pseudo": "Gareth",
          "Nb_Reviews": 1,
          "Date": "2021-07-02T14:06:34.000Z",
          "Titre": "Residential",
          "Contenu": "Please cater more for residential portfolios by adding a number of apartments option instead of square meterage option to your reports."
        },
        {
          "Note": 2,
          "Lieu": "ZA",
          "Pseudo": "Tinashe Kaitano",
          "Nb_Reviews": 1,
          "Date": "2021-07-05T06:06:34.000Z",
          "Titre": "Please cater for residential portfolios…",
          "Contenu": "Please cater for residential portfolios and add number of apartments instead of square meterage to your reports."
        },
        {
          "Note": 2,
          "Lieu": "ZA",
          "Pseudo": "Joos Engelbrecht",
          "Nb_Reviews": 1,
          "Date": "2021-07-02T11:54:27.000Z",
          "Titre": "Taking care of your clients.",
          "Contenu": "Please cater for residential portfolios and add number of apartments instead of square meterage to your reports."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Richard Foerster",
          "Nb_Reviews": 2,
          "Date": "2022-09-16T15:07:19.000Z",
          "Titre": "I don't find ctme smart contract very…",
          "Contenu": "I don't find ctme smart contract very user friendly"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Daniel Proulx",
          "Nb_Reviews": 1,
          "Date": "2021-10-15T12:00:47.000Z",
          "Titre": "We are based in Montreal Canada",
          "Contenu": "We are based in Montreal Canada. Back in 2019 we were looking for a software that would simplify and accommodate our accounting needs for on-line payments, credit card purchases, commercial management. During the evaluation period the sales representative (Blake Strozyk) indicated that all our needs would be met. And back then it made sense as we were buying a recent software and we had no reason to doubt what the software could offer us. When we went through the presentations of the software, it was very visually appealing and we liked the adaptability of the reporting.The software has not lived up to our expectations and we have been forced to adapt to it so far. We know that the software is adaptable as many reports have been developed for us by Saboy Solutions, but there are basic software components which should be inherent in the software which would be so fantastic.I have been in contact with our Canadian Representative Jayson Young in your British Columbia branch and have provided him with our wish list of what we would like to see in the software. Our requests are truly reasonable basic accounting needs which most accountants would like to have in the accounting software.I would welcome a constructive conversation to hopefully be able to implement some (if not all) of our recommendations.Sincere regards."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robyn Lee",
          "Nb_Reviews": 1,
          "Date": "2021-03-02T19:41:45.000Z",
          "Titre": "It is taking entirely too long to get a…",
          "Contenu": "It is taking entirely too long to get a support response and help when we need it"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "andy lai",
          "Nb_Reviews": 1,
          "Date": "2021-08-24T05:23:08.000Z",
          "Titre": "slow support",
          "Contenu": "slow support.  no email replies, no call backs. have to keep chasing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Elsie Hargrove",
          "Nb_Reviews": 1,
          "Date": "2022-06-03T13:57:36.000Z",
          "Titre": "Hard to naviigate"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pamela La Pointe",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T18:35:28.000Z",
          "Titre": "Not So User Friendly",
          "Contenu": "CTME contracts are easy to use and make corrections.  MRI Smart Contracts cannot work without a parent contract within the name of the file.Many times to e-sign adding a signature will not share or transfer to the other agent to see like CTME does.More time to go back in or not forget you did not send the MRI document after it is signed."
        },
        {
          "Note": 3,
          "Lieu": "ZA",
          "Pseudo": "Alec Davis",
          "Nb_Reviews": 2,
          "Date": "2022-11-24T15:18:53.000Z",
          "Titre": "Not yet a solid 4/5 but definitely…",
          "Contenu": "Not yet a solid 4/5 but definitely 3.5/5Service levels are generally good, but could be better and it largely dependent on the skill of the MRI resource. There is good commitment from senior MRI to support and resolve MRI issues.Some of the formal MRI processes are cumbersome and could improveMy bug bear which results in this low rating is the slow turnaround in providing fixes to IR's which often takes several years. This needs to improve ahead of just adding new features."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dennis Barrett",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T17:24:54.000Z",
          "Titre": "It is not easy to navigate",
          "Contenu": "It is not easy to navigate, and other than watching full videos or a long list of FAQ, there is little online help"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Vicki",
          "Nb_Reviews": 3,
          "Date": "2022-11-23T17:01:19.000Z",
          "Titre": "Eliminate your “Smart Contracts”   Far…",
          "Contenu": "Eliminate your “Smart Contracts”   Far too many steps to put a document together.  And … if one small step is overlooked or forgotten it creates a real mess to get repaired.  Time waster!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Grove",
          "Nb_Reviews": 1,
          "Date": "2023-06-17T15:08:00.000Z",
          "Titre": "Do not like dealing with overseas…",
          "Contenu": "Do not like dealing with overseas contacts, hard to understand. Perfect example of corporate mentality of going to the \"cheap\" side and providing less. Another company will come along soon and obtain your market share by providing better service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JG",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T14:55:40.000Z",
          "Titre": "The transition from Angus to MRI has…",
          "Contenu": "The transition from Angus to MRI has been arduous. Service requests have been slower to complete and they now charge for things that were previous included. Charging 4 hours to change a background picture is incredulous."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Heidi Scanlon",
          "Nb_Reviews": 3,
          "Date": "2023-01-20T15:03:33.000Z",
          "Titre": "Overall opinion of MRI",
          "Contenu": "The customer service by the Tenmast team and JD consulting is excellent. The MRI customer service appears to be slower and more cumbersome to use. I do not care for the portal system for adding cases. For a software company, the portal is a poor representation of your services. There are issues with lack of improvement to the existing products with Tenmast and the conversion process is expensive and premature."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JennKr",
          "Nb_Reviews": 2,
          "Date": "2023-06-02T15:59:10.000Z",
          "Titre": "It's beyond difficult to get someone on…",
          "Contenu": "It's beyond difficult to get someone on the phone from MRI Rental History Reports for help.For HAB related issues, always get very professional service, get someone on the phone-no problem, and very helpful."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sheree Pinner",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T14:22:53.000Z",
          "Titre": "Over the past year y'all seem to have…",
          "Contenu": "Over the past year y'all seem to have more glitches and snags than in the prior yrs.Things such as:-lag time for the email screen to come up and the share document drop down box takes an exceedingly long time to load- software completely down for the day-slow and lag especially on Monday morning - difficulty emailing large files (I have to break them down prior to emailing)**never had to do that before last year- I cannot email all the HOA docs in 1 email any longer **was able to do this from 2019 thru 2022Y'all have done something with the software that has hindered agents work instead of making it easier.Used to be that ALL agents used CTM exclusively. Now more are starting to be non CTM users.Sad.I am TC for quite a number of agents and I listen to their complaints about CTM regularly. All their complaints are the same or very similar to the few I have listed here.But thru all this,  I still like the system and will not change from using it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Glen Greenlee",
          "Nb_Reviews": 1,
          "Date": "2023-02-26T13:05:19.000Z",
          "Titre": "Manufactured home contract (lot lease)…",
          "Contenu": "Manufactured home contract (lot lease) is ridiculous to try and put together. Can'tdo it without calling support. Needs to be a regular contractnot a smart contract."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Heidi Scanlon",
          "Nb_Reviews": 3,
          "Date": "2023-08-09T14:35:54.000Z",
          "Titre": "Needs improvement.",
          "Contenu": "I like the responsiveness of the MRI technicians, and I like the speed of the software. I don't like some of the limitations, cannot edit the vendor's name on an active, open invoice; cannot add more than one allocation per line to the journal entries like you can for invoices; cannot report identified trial balance accounts like the GL report can; the export feature from Tenmast to MRI is not fully developed and vetted; and the charge for hourly services from toolkit is too high."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marisol Orozco",
          "Nb_Reviews": 2,
          "Date": "2023-10-20T19:54:14.000Z",
          "Titre": "MRI is not intuitive",
          "Contenu": "MRI is not intuitive, and module reports often do not match GL accounts balances."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chad Penner",
          "Nb_Reviews": 1,
          "Date": "2023-02-17T17:24:04.000Z",
          "Titre": "Last issue for which I called in",
          "Contenu": "Last issue for which I called in, I spoke with a representative that seemed to have a language barrier. Explaining a situation to him seemed difficult. My communication of the issue may have been part to blame. Nevertheless, I perceived a language barrier with the communication in the conversation and I ended up calling in again to speak with a different rep."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jennifer Mentz",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T13:11:14.000Z",
          "Titre": "The helpdesk teams are great; still don't recommend.",
          "Contenu": "The helpdesk teams are great, but the software itself is not as user friendly as Yardi or OneSite. I've used all 3 for years and still have trouble with MRI."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stephen Meyer",
          "Nb_Reviews": 2,
          "Date": "2023-06-30T16:06:21.000Z",
          "Titre": "Not doing incremental price increases…",
          "Contenu": "Not doing incremental price increases each year or two and hitting us all at once with a 42% increase is not good especially in the current market and economy."
        },
        {
          "Note": 3,
          "Lieu": "ZA",
          "Pseudo": "Rina Gerber",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T13:51:36.000Z",
          "Titre": "Getting better slowly but surely",
          "Contenu": "We had a rough start with MCI, but a lot of improvements have been done or is in process."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stephanie Elmore",
          "Nb_Reviews": 2,
          "Date": "2022-10-28T15:34:03.000Z",
          "Titre": "Experience",
          "Contenu": "The customer service was very good, but the wait time for someone answering the phone was poor."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Greg Whisler",
          "Nb_Reviews": 1,
          "Date": "2023-01-26T17:18:05.000Z",
          "Titre": "Yesterday's Tech",
          "Contenu": "While convenient for writing contracts, listing docs and disclosures, the layout, set up and functionality are decidedly \"old school\", not intuitive and not user friendly."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "John Sachs",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T00:27:48.000Z",
          "Titre": "you need to improve the support…",
          "Contenu": "you need to improve the support response time.previously advised"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Barbara",
          "Nb_Reviews": 1,
          "Date": "2023-01-19T11:30:51.000Z",
          "Titre": "Great experience but long waiting time. the waiting time was very long but the…",
          "Contenu": "the waiting time was very long but the agent helped a lot with my issue"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pamela Maloney",
          "Nb_Reviews": 1,
          "Date": "2022-08-19T16:14:46.000Z",
          "Titre": "Not User Friendly",
          "Contenu": "MRI software (CTM) is not user friendly.  It is challenging to use and often requires a call to support for help.  The layout is convoluted.  It all looks the same and redundant.  It seems old and antiquated like something that was developed in the 90s and hadn't been updated since.  I wish it were looked clean and straight forward so you didn't have to be a software expert to utilize the system.  I am grateful for the customer support staff, without them, it would be a loss."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pat Moorman",
          "Nb_Reviews": 1,
          "Date": "2022-08-03T18:32:31.000Z",
          "Titre": "Had overage problems with the deposits…",
          "Contenu": "Had overage problems with the deposits and taken approx 2 months on the first one. Current one in process since May 31.2022 rent increase have not be updated to our files. Not sure what happened, but I think it is now being worked on my Jason.  Sure do need it completed.Needing an address changed in our letterhead and it seems to be a major item."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Circa Retail Shopping Centre (Therese Galbraith)",
          "Nb_Reviews": 2,
          "Date": "2022-10-06T22:19:44.000Z",
          "Titre": "Support is taking too long to action…",
          "Contenu": "Support is taking too long to action items and IR's are not being solved quick enough.It seems that new products are taking over from actually fixing existing product"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sally Tucker",
          "Nb_Reviews": 1,
          "Date": "2022-06-25T16:05:28.000Z",
          "Titre": "It has become so complicated it's…",
          "Contenu": "It has become so complicated it's difficult to use any more.  I was a user from day one and loved the changes but without a TC it's just too complicated! The listing agent chose to write a second contract.  I put both in a different file. I watched the video. Without your wonderful IT person I wouldnt have known how to get rid of first folder.  I made a mistake not knowing and thought they had withdrawn both contracts."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Valerie",
          "Nb_Reviews": 5,
          "Date": "2022-08-16T10:18:21.000Z",
          "Titre": "Disappointing service since being taken over by MRI",
          "Contenu": "Overall I am pleased with the system but we have had some issues lately and the response to those has been exceptionally poor.  One issue was reported about four months ago and it took ages for first response and then the \"fix\" did not work and we received a further \"fix\" last week which again did not work and even required us to go into each of our 500 properties to perform a task to complete the fix.  I have found my own way round the issue in the end as I have given up waiting for MRI to help.  Not what I am used to, having been used to the service that QUBE provided before it was taken over by MRI."
        },
        {
          "Note": 3,
          "Lieu": "ZA",
          "Pseudo": "Rafael Zabow",
          "Nb_Reviews": 1,
          "Date": "2022-06-09T10:15:04.000Z",
          "Titre": "Could be excellent",
          "Contenu": "The Software is amazing. The support is where you fall short. Response via email only is at times insufficient. there is no distinction between the urgency of some matters. support members  at times do not know the system better than the users.Cases are automatically closed once a solution has been suggested and before confirming the solution is satisfactory (this one particularly drives me up the wall)"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert Noah",
          "Nb_Reviews": 1,
          "Date": "2022-06-08T13:42:07.000Z",
          "Titre": "Pick up the phone!",
          "Contenu": "When you log a ticket, you get an immediate response email that someone is looking into your issue.  But then you may not hear from anyone for quite some time.  Then it begins back and forth emails, when a phone call would probably handle everything in one call and save time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Edward Laxton",
          "Nb_Reviews": 1,
          "Date": "2022-06-02T14:06:54.000Z",
          "Titre": "MRI, a Global Leader? Seriously?",
          "Contenu": "MRI Support system is definitely not \"Global Leader...\" caliber as touted by the company.  Phone calls to support take far too long to get answered. Logging a case is a joke because it can be days before someone provides any meaningful answer/solution. For a commercial software company, the developers clearly do not understand the recoveries business well. MRI wants to charge for changes that are normal business practices. For example, Expense Recoveries with a percentage CAP on Controllable expenses requires a custom formula with a price quote of over $4K USD."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Stephen Fitzsimon",
          "Nb_Reviews": 2,
          "Date": "2022-08-19T08:50:07.000Z",
          "Titre": "Just another provider",
          "Contenu": "Just another provider - not the be all solutionThanks for the reply. Looking forward to the chat. Still waiting on a response from my query made. Let’s see which department is more responsive."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Linda Lagace",
          "Nb_Reviews": 1,
          "Date": "2021-10-26T12:58:55.000Z",
          "Titre": "Teh latest updates in AWS has wreaked…",
          "Contenu": "Teh latest updates in AWS has wreaked havoc in our company - problems logging on, long wait times to log on, etc.  The Happy updates have eliminated an easy \"Find\" feature, which was accessible with Cntrl F.  Now you have to click Find 2 times to access the appropriate screen.  May not seem like much to  you, but a big time saver for all users."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Shabbir Alidina",
          "Nb_Reviews": 1,
          "Date": "2022-04-12T13:05:33.000Z",
          "Titre": "Although MRI works reasonably well",
          "Contenu": "Although MRI works reasonably well. The issue I have is that the response time once a case has been created is very slow. Sometimes when there is a deadline and when there is a case pending it becomes very difficult for us to balance this"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lee Chesapeake Property Management",
          "Nb_Reviews": 2,
          "Date": "2021-07-01T17:47:34.000Z",
          "Titre": "We have been experiencing many lags…",
          "Contenu": "We have been experiencing many lags with reports populating to the communication center, reports that return no data the first time we run and then return a populated report when no data points have been changed in the report parameters.  Additionally, CM batches not posting the first time as well.  Often times the report takes many minutes (more than 5) to generate which we feel affects our productivity.  Not sure what the issue has been but we are hoping that it improves soon."
        },
        {
          "Note": 3,
          "Lieu": "ZA",
          "Pseudo": "Alec Davis",
          "Nb_Reviews": 2,
          "Date": "2021-04-28T14:36:47.000Z",
          "Titre": "Software is finally working as we…",
          "Contenu": "Software is finally working as we wanted it to, it has taken 9 months to get to this point after going live. The response to our queries has not always been as prompt as we would have wanted, and it has often required me to escalate matters to senior management at MRI to get matter resolved and worked on. There seems to be a lack of management of resource at MRI as they often do not respond as quickly as one would expect them to do to issues that have become critical."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Diane Able",
          "Nb_Reviews": 1,
          "Date": "2023-01-27T14:50:16.000Z",
          "Titre": "Fire Leo",
          "Contenu": "Fire Leo - Everytime I call in ... It is a pain in the butt to get to a person."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Virginia Conrad",
          "Nb_Reviews": 1,
          "Date": "2022-03-18T13:34:06.000Z",
          "Titre": "i do not like the web version at all",
          "Contenu": "i do not like the web version at all. I always go back to the windows version.The view a report is not in the web version only in the bubble. I loose a lot of time with that so i use the windows version I would give that version a 5"
        },
        {
          "Note": 3,
          "Lieu": "ZA",
          "Pseudo": "Olev Taim",
          "Nb_Reviews": 1,
          "Date": "2022-10-13T09:28:14.000Z",
          "Titre": "review of call logged",
          "Contenu": "Logged call to adjust report writer. Could not proceed further as columns cannot be adjusted on reports"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DIANNA",
          "Nb_Reviews": 3,
          "Date": "2021-03-24T14:53:14.000Z",
          "Titre": "Overall",
          "Contenu": "Overall, I am pleased with the software and I like the direction MRI is taking the housing platform in. I am not satisfied with the response time of my account manager. Since Tenmast has been under MRI, I find that anything you need done, requires a Statement of Work, and more money."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Cat",
          "Nb_Reviews": 3,
          "Date": "2022-03-07T10:39:18.000Z",
          "Titre": "Whenever updates happen... it is very painful",
          "Contenu": "We were forced to update Qube to a newer OS last week. Even though we have advised them there are issues when the software was tested, the upgrade went ahead. Now the speed of the system is very slow when running reports, the transfer to nominal is not happening, some of the overnight reports are not ran.The Support Desk is very helpful and now their waiting time have decreased. They get 4.5 stars.The update team though.... they get 1 star. Every update has been problematic. Even though the team may have changed.... the same issues occur. I understand there are a lot of points to cover when an upgrade occurs, it feels we were not listened to when we mentioned the reports are a priority."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Peggy Wiles",
          "Nb_Reviews": 1,
          "Date": "2021-08-11T13:43:25.000Z",
          "Titre": "The technical support response to my…",
          "Contenu": "The technical support response to my ticket was better this time, but there have been too many times to count that I put high alert on my ticket and it can take days to get a response. Time will tell if the technical support response time becomes better."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Alison Wilson",
          "Nb_Reviews": 5,
          "Date": "2022-02-14T23:09:22.000Z",
          "Titre": "We have been waiting to be contacted…",
          "Contenu": "We have been waiting to be contacted regarding property tree and changing from Rest professional . We have also tried to find out when Holiday rentals will be added to property tree or wether they will not be"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tammy Prigge",
          "Nb_Reviews": 1,
          "Date": "2021-03-23T19:39:51.000Z",
          "Titre": "We have been waiting for over a year to…",
          "Contenu": "We have been waiting for over a year to update our rent reasonable date in HP.  Now the data is old and will now need to be updated again.  Staff is having to go outside HP to find comparable units and adds to their work time.  This is very frustrating when before it would take maybe two weeks to update.  Christina was going to develop us a tool so we could just update it each year.  We are also not happy that the AC website has not been updated to add a secondary contact to that we could increase the use.  The other request was for us to be able to upload paperwork when families are moving and not on their recert date."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joey Albert",
          "Nb_Reviews": 1,
          "Date": "2022-08-02T00:33:26.000Z",
          "Titre": "MRI is still quirky",
          "Contenu": "MRI is still quirky. We moved over to 2FA and, many many times, users don't get their texts, system is unavailable and strange errors persist."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Debra Butler",
          "Nb_Reviews": 2,
          "Date": "2021-08-31T12:10:17.000Z",
          "Titre": "The system is slow and breaks down…",
          "Contenu": "The system is slow and breaks down often.  I call the helpdesk it seems, at least once a month if not more.  There are pop-ups for upgrades that I cannot perform.  It's a nuisance, because it is constant."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steven Fitch",
          "Nb_Reviews": 1,
          "Date": "2021-02-18T22:14:25.000Z",
          "Titre": "When errors are reported it’s taking…",
          "Contenu": "When errors are reported it’s taking two sometimes three contacts before we get a reply.  For example we submitted a ticket in January that still isn’t resolved.  However we had to make contact just to see if it was received"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Jenelle Carey",
          "Nb_Reviews": 1,
          "Date": "2021-07-05T01:18:29.000Z",
          "Titre": "Items Needing Improvement",
          "Contenu": "The software is very good at managing our day to day jobs however most days it has periods of very slow response. Online help sometimes shows an attitude of it is in the knowledge base so don't chat."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "P.Vern",
          "Nb_Reviews": 1,
          "Date": "2021-07-22T12:35:53.000Z",
          "Titre": "The Time it took to get results should…",
          "Contenu": "The Time it took to get results should be shorter.  Also we should be able to email in our problems and questions with backup supporting information instead of just calling in to get a support staff."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "William Vissing",
          "Nb_Reviews": 2,
          "Date": "2021-10-04T12:19:50.000Z",
          "Titre": "All I need is a little advise",
          "Contenu": "I have called Sales 4 times left messages with no return callsit is very hard to get to talk to someone about problems,  i need to add a barcode scan system to MRI but have recieved no help"
        },
        {
          "Note": 3,
          "Lieu": "ZA",
          "Pseudo": "Zipho Mkize",
          "Nb_Reviews": 1,
          "Date": "2021-07-06T17:41:32.000Z",
          "Titre": "Please cater for residential property portfolios",
          "Contenu": "Great software. Moving forward it would be amazing to see you catering for residential portfolios and adding the number of apartments instead of the square meterage to your reports. Thanks."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marilyn Zengotita",
          "Nb_Reviews": 1,
          "Date": "2021-02-19T01:04:53.000Z",
          "Titre": "The wait time for your customer service…",
          "Contenu": "The wait time for your customer service is no less than 2 hours. We have been with MRI since 2003 and is unacceptable. Although once you do it through the problems get resolved."
        },
        {
          "Note": 3,
          "Lieu": "ZA",
          "Pseudo": "Liani Engelbrecht",
          "Nb_Reviews": 1,
          "Date": "2021-07-05T06:26:14.000Z",
          "Titre": "Please can you make provisions for the…",
          "Contenu": "Please can you make provisions for the following: Add the option for residential portfolios, add number for apartments instead of square meterage to your reports."
        },
        {
          "Note": 3,
          "Lieu": "ZA",
          "Pseudo": "LESLY THOKA",
          "Nb_Reviews": 1,
          "Date": "2021-07-06T17:02:34.000Z",
          "Titre": "It would be nice if you can add the…",
          "Contenu": "It would be nice if you can add the number of apartments instead of square meterage to your reports, that will perfectly cater for the residential portfolios."
        },
        {
          "Note": 3,
          "Lieu": "ZA",
          "Pseudo": "Chad Webb",
          "Nb_Reviews": 1,
          "Date": "2021-07-02T16:05:55.000Z",
          "Titre": "Total Occupancy to Vacancy",
          "Contenu": "As we are a large residential portfolio, it would be great too see the exact number of vacant apartments to occupied apartments as opposed to square meters."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jodi Kinney",
          "Nb_Reviews": 1,
          "Date": "2021-03-24T15:23:45.000Z",
          "Titre": "Lately (over the last year) I have had…",
          "Contenu": "Lately (over the last year) I have had trouble logging in (errors out) or get odd errors while trying to input information."
        },
        {
          "Note": 3,
          "Lieu": "BW",
          "Pseudo": "Tshepiso Mmolai",
          "Nb_Reviews": 1,
          "Date": "2021-04-27T07:45:09.000Z",
          "Titre": "Great Services! Area of improvement - more Analytical reports",
          "Contenu": "The Service received was good. Area of improvement - More analysis reports and visual charts, less data providing reports."
        },
        {
          "Note": 3,
          "Lieu": "ZA",
          "Pseudo": "Sonali Woompath",
          "Nb_Reviews": 1,
          "Date": "2021-07-05T07:21:47.000Z",
          "Titre": "It would be great to see the vacant and…",
          "Contenu": "It would be great to see the vacant and current apartments for the residential porfolio as apposed to the square meters"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2022-01-26T22:11:25.000Z",
          "Titre": "Very courteous staff",
          "Contenu": "Very courteous staff helping but the matter wasn't resolved fully but at least we can move forward."
        },
        {
          "Note": 3,
          "Lieu": "ZA",
          "Pseudo": "Thabang Ramashala",
          "Nb_Reviews": 1,
          "Date": "2021-07-07T06:24:35.000Z",
          "Titre": "Please cater for residential portfolios…",
          "Contenu": "Please cater for residential portfolios and add number of apartments instead of square meterage to your reports."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Pierino",
          "Nb_Reviews": 3,
          "Date": "2022-02-05T09:09:10.000Z",
          "Titre": "Software great",
          "Contenu": "Software great, support people amazing, just a bit slow to respond ?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bob Foster",
          "Nb_Reviews": 1,
          "Date": "2021-07-09T13:52:32.000Z",
          "Titre": "Very difficult to reach technical…",
          "Contenu": "Very difficult to reach technical support without lengthy hold time"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Hettrick",
          "Nb_Reviews": 1,
          "Date": "2021-09-04T12:52:45.000Z",
          "Titre": "Look and feel are outdated and not at…",
          "Contenu": "Look and feel are outdated and not at all intuitive"
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Brett Nadel",
          "Nb_Reviews": 4,
          "Date": "2023-12-19T20:05:46.000Z",
          "Titre": "You have recently introduced interest…",
          "Contenu": "You have recently introduced interest on deposits, but you don't have a report that shows one how much interest is earned per month. Only a total."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris Plant",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:25:44.000Z",
          "Titre": "Good Experience",
          "Contenu": "Overall, MRI does a great job and is very responsive to issue and questions when they come up. One thing I would recommend is an update to their UI. It really hasn't changed in years."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amanda Hopkins",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T19:31:32.000Z",
          "Titre": "The long journey is almost over and another is beginning",
          "Contenu": "Tanya Muldrow and John Robert have been wonderful guides on our journey to converting our software to MRI. While we have had a few hiccups due to delays and staff capacity on both ends of the process, the experience has been good overall, and we are eager to make our MRI environment exactly what we need as we become familiar and fill in gaps in the data that was available to migrate."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Taylor Drouault",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T15:16:56.000Z",
          "Titre": "Everyone is always very helpful and…",
          "Contenu": "Everyone is always very helpful and responsive. The reason I give 4 instead of 5 stars is because it took a day to get a response."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Pierino",
          "Nb_Reviews": 3,
          "Date": "2023-11-25T12:23:42.000Z",
          "Titre": "Sometimes the Support is pure amazing",
          "Contenu": "Sometimes the Support is pure amazing, like you'd expect to be billed, its that good. They get what you are after, they take a complicated request and understand it quickly and articulate a really clever answer. On the flip side, occasionally you wish you had not bothered. But the plus do outweigh the minus. Do think some Services like SQL Workbench should be free for the user, as the Ecstract language the user is locked into is oh so complicated. Most of my support calls are around Ecstract, which would be avoided if I had SQL Workbench. SQL reporting is available in MRI Sales and Lettings, it should be available in MRI Property Management"
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "JACKIE JENKIN",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T11:10:28.000Z",
          "Titre": "Complex but useful",
          "Contenu": "MRI can sometimes seem like a complex system, especially when still learning how the system works, but once we get to know it, it does get easier, as does any system."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Penny lasnetski",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T15:30:46.000Z",
          "Titre": "Unborn children in a HOME unit",
          "Contenu": "The only complaint that I have is that it takes awhile to get the adjustments done.  Otherwise the Technician was very good at communicating the status of the case.I wish BP could be \"fixed\" to permanently count an unborn child towards the income limits on the TIC instead of always needing a data fix."
        },
        {
          "Note": 4,
          "Lieu": "NA",
          "Pseudo": "Dawie Herbert",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T12:01:54.000Z",
          "Titre": "Satisfied",
          "Contenu": "In all the areas we are using MDA I am happy. When there is a problem, you always assist to solve it as soon as possible."
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Yishai Mark",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T12:08:52.000Z",
          "Titre": "Great property software",
          "Contenu": "Great software, specifically geared towards property companies. The drawback is on the accounting side, which can get quite complicated and confusing, especially when comparing to other off the shelf accounting systems. Despite the learning curve, the system is powerful. The move towards an online cloud based system is promising."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Debra Yund",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T16:00:26.000Z",
          "Titre": "Very Good Support Staff!",
          "Contenu": "Although having a really good support staff, the contracts date tracking is totally awesome. Being able to print one calendar with all the active contract dates with the appropriate titles saves me so much time! I have it taped to the top of one of my three monitors so I can easily flip it over to review quickly. And let's not forget having the historical value of previous deals!!!  Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JennKr",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T17:04:39.000Z",
          "Titre": "HAB staff very helpful",
          "Contenu": "HAB staff very helpful, knowledgeable & follow through with customers."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Pierino",
          "Nb_Reviews": 3,
          "Date": "2023-05-04T11:10:31.000Z",
          "Titre": "Software Best of Breed",
          "Contenu": "Software Best of Breed. Highly configurable, highly customisable. Support can be Amazing, its not always like that, feels like it depends on their workloads and who gets your Ticket, MRI Software have better insight. Frustrating that you cannot get an SQL access to your SQL data (like every other SQL software supplier does) without paying through the nose. New prospects should read this and heed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mary Frances Weir",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T15:13:33.000Z",
          "Titre": "Your service people are 5 stars! Software not so much....",
          "Contenu": "Your service people are 5stars!!  Kind, understanding and patient. I only wish I did not have to call so much because the software so not user friendly. Your main screens, ways to connect documents and general 'ease of use' is a 1star. Thank goodness for your people in service, otherwise I would have been out of my mind trying to use it. Please update your software pages--to make it easy. I am begging!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rockey Colborn",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T00:40:19.000Z",
          "Titre": "Case # 05600774",
          "Contenu": "Case # 05600774.  It seemed like it took a while for an effort to be made to resolve.  It seems a reasonable work around has been reached.  IR 122831 has been created to try to fix the problem.  I will no more when I hear back from IRS to see if test file I sent them was acceptable.  In general, we are 94% happy with MRI for windows software.   I have said before and will say again, I hope we are never forced to use MRI for Web as I found it cumbersome in the demos."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "John Loughran",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T10:36:38.000Z",
          "Titre": "Genuinely excellent product",
          "Contenu": "Genuinely excellent product, trainers know their stuff and the help desk respond promptly and timely with solutions.  However it would be helpful if the drop down help menus worked and provided the information as required"
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "Shirley Ng",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T02:05:06.000Z",
          "Titre": "Rachel assisting in prompt assisting…",
          "Contenu": "Rachel assisting in prompt assisting that assist us in time from delaying ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carol High",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T00:27:43.000Z",
          "Titre": "There are so many details in this…",
          "Contenu": "There are so many details in this program that it is difficult to use it unless you do so frequently.  I do not so appreciate the gracious help the staff gives.  Any way to simplify the program would be great but know that would be difficullt.  Thanks."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Andrew Athanasiades",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T11:14:41.000Z",
          "Titre": "First time resolution",
          "Contenu": "I usually get first time resolution of any issues/queries I raise with the support team.  Only thing stopping the 5 stars is the waiting time has increased recently when attempting to get through to support.  Once through the team are great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lori",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T20:45:19.000Z",
          "Titre": "Rough start with good ending",
          "Contenu": "It was challenging to get to the correct person now that CTM is with a larger company.  Once I reached the correct person, she did a great job with customer service and promptly fixed my concern."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stacy Greer",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T21:22:59.000Z",
          "Titre": "Evolving software with great staff…",
          "Contenu": "Evolving software with great staff behind the scenes to support. We are working through some kinks here and there with the software, but it has allowed us to provide input and feedback in how we want the system to work which has been great!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kevin Wampler",
          "Nb_Reviews": 2,
          "Date": "2022-12-07T19:50:02.000Z",
          "Titre": "MRI software works great for other people",
          "Contenu": "MRI software works great for our landlord manager. We, as a Non-Profit, cannot afford the greater luxury of the newer, better, MRI software portals and upgrades, which I've heard would solve a lot of the issues we have with the software, so I reserve judgement in most areas. We have been developing other solutions since we don't have the full functionality of MRI."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Isabel Rodriguez-Mendoza",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T17:10:52.000Z",
          "Titre": "The support team did a great job of…",
          "Contenu": "The support team did a great job of assisting me with my request on how to issue an additional 1099 that was needed.  I am very pleased with the assistance of the tax team; they are very attentive and helpful.  I am glad to hear that we have a support team instead of just one person assigned to our company for concierge service!!"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Patti Turnham",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T05:00:42.000Z",
          "Titre": "Help Desk",
          "Contenu": "Your help desk is exceptional 99% of the time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lance Davis",
          "Nb_Reviews": 1,
          "Date": "2023-02-27T15:59:27.000Z",
          "Titre": "The reason for the call into support… CM batches not closing, therefore unable to close CM period",
          "Contenu": "The reason for the call into support was to determine why several CM batches were open and would not close. This error has happened four times in the past two years. It would appear to be a software issue with SQL databases. It is best to address the root cause of the error."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Phillips",
          "Nb_Reviews": 2,
          "Date": "2023-05-06T15:28:51.000Z",
          "Titre": "I don’t know if it’s Colorado or your…",
          "Contenu": "I don’t know if it’s Colorado or your contracts but it would streamline things if a counter offer option was included at the bottom of an offer to purchase. A box to check if offer is accepted as written or a counter offer box with a line for price and any changes."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lee Ung",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T17:57:19.000Z",
          "Titre": "Incorrect journal posted in current period and MRI service agent was unable to move the batch to future period.",
          "Contenu": "I am just a new user of this software product and have not fully expose to all the features in this produce and unable to give my full assessment of this software."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Terri Eastland",
          "Nb_Reviews": 2,
          "Date": "2023-02-08T15:23:39.000Z",
          "Titre": "MRI is a wonderful software however…",
          "Contenu": "MRI is a wonderful software however there are a few flaws in the software user interface or the reporting.  Things that are just basic in all other software on the market.  The thing that bothers me is the customers have to pay for customizations to applications or reports to get what really should be out of the box functionality."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Funmilayo Olarewaju",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T14:09:54.000Z",
          "Titre": "Improved service",
          "Contenu": "I had been frustrated with the time it took to get a response from MRI, but lately have seen some improvements.  They were not immune to the national shortage of workers crisis.  When you do get a response, staff is very knowledgeable.  I hope they keep it up."
        },
        {
          "Note": 4,
          "Lieu": "IE",
          "Pseudo": "Emma Stapleton",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T11:05:43.000Z",
          "Titre": "With so many new starters the support…",
          "Contenu": "With so many new starters the support team are always quick to hand to get them set up or reset passwords for those who forget to update."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Johnathan Barthelme",
          "Nb_Reviews": 1,
          "Date": "2022-11-26T15:55:49.000Z",
          "Titre": "I had a difficult time, when I started, remembering the subtle differences in the exact steps that need to be followed to complete a check run between databases.",
          "Contenu": "Works well but can be difficult to remember which exact steps need to be completed for processes between where the database is hosted. More consistency between all databases would be a welcomed improvement."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Martha Hernandez de la Garza",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T18:13:33.000Z",
          "Titre": "Good but not great",
          "Contenu": "The customer service personnel knows about the product. The only thing, in my case, was they did not ask the right questions. I had to ask amongst my colleagues to have my issue resolved."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Rob Corner",
          "Nb_Reviews": 3,
          "Date": "2023-06-08T11:33:41.000Z",
          "Titre": "Great support!",
          "Contenu": "The support team were unrelenting until they solved the issue to my satisfaction. Thank you. OnLocation is a great product that helps our organisation to keep our staff and visitors safe."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephanie Elmore",
          "Nb_Reviews": 2,
          "Date": "2023-09-01T14:49:51.000Z",
          "Titre": "Finance Director",
          "Contenu": "Got a response back within approximately 5 hours, so better response time, I think our version of Tenmast is just so old, we would love to hear about your new more update software version."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Megan",
          "Nb_Reviews": 6,
          "Date": "2023-10-24T00:15:02.000Z",
          "Titre": "Ervine is great",
          "Contenu": "Ervine is great.  He has been very helpful when I put cases on the board.  There is always back and forth on checking and testing which is helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carmen Martinez",
          "Nb_Reviews": 2,
          "Date": "2023-01-11T19:31:01.000Z",
          "Titre": "Sometimes they take long time to…respond to cases, run reports, MRI freezes often.",
          "Contenu": "Sometimes they take long time to respond to cases.MRI system is getting slower, takes a long time to run reports and it freezes constantly. This is a continuous issue."
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Nothando Nkala",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T13:01:09.000Z",
          "Titre": "The support staff is awesome",
          "Contenu": "The support staff is awesome. I learned something new about functions that I wasn't really utilizing.Support staff is patient and very kind."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Chris Sercombe",
          "Nb_Reviews": 2,
          "Date": "2023-03-17T00:02:39.000Z",
          "Titre": "MRI staff are responding to our calls…",
          "Contenu": "MRI staff are responding to our calls and fixing our problem promptly. Your staff know how to respond to with the knowledge of the system with have and solve the problem."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ernest Carrizales",
          "Nb_Reviews": 2,
          "Date": "2023-04-18T18:17:04.000Z",
          "Titre": "Folliow up",
          "Contenu": "Appointment was done as expected. I did not receive a detailed explanation of what was done and what we need to do to prevent this from happening again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shaun Shahmardian",
          "Nb_Reviews": 2,
          "Date": "2023-06-14T19:47:59.000Z",
          "Titre": "The product is excellent, with a few minor tweaks",
          "Contenu": "The product is excellent, but needs a bit more features. I think that having control over the sequence of signatures, as well as the assurance that the signor is definitely the intended person is critical."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TH",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T14:14:07.000Z",
          "Titre": "Not understanding from Accounting Standpoint",
          "Contenu": "All good they initially had an issue but they were VERY proactive in resolving it for us after the inital hiccup."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jasmen Der Hovanesian - Main C",
          "Nb_Reviews": 1,
          "Date": "2022-10-31T17:19:54.000Z",
          "Titre": "knowledgeable associates",
          "Contenu": "being with MRI since their \"dos\" then \"window\" to web base, in different companies,MRI proved they are worthy of being the leader."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Melissa Hoefer",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T15:19:51.000Z",
          "Titre": "the issue was resolved promptly and I…",
          "Contenu": "the issue was resolved promptly and I was able to get right back to work."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Martin",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T08:24:18.000Z",
          "Titre": "The Project team is doing a great job",
          "Contenu": "The Project team is doing a great job. We feel very well supported especially from the project lead."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "customer Jeff",
          "Nb_Reviews": 3,
          "Date": "2022-12-12T00:12:24.000Z",
          "Titre": "Impressive response time",
          "Contenu": "Needed help in setting up the strata hub.  The MRI assistant responded to my query within a very short time and then set me on the right course of action.  Too easy."
        },
        {
          "Note": 4,
          "Lieu": "LS",
          "Pseudo": "Lerato Likhomo",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T11:47:30.000Z",
          "Titre": "Service support personnel are up on…",
          "Contenu": "Service support personnel are up on their toes always. Very quick to respond and assist."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Julia Harman",
          "Nb_Reviews": 2,
          "Date": "2023-02-07T23:20:34.000Z",
          "Titre": "I had an urgent ticket I needed…",
          "Contenu": "I had an urgent ticket I needed completed and it was done the next day.  The representative was courteous and professional and completed my ticket in a timely manner."
        },
        {
          "Note": 4,
          "Lieu": "JE",
          "Pseudo": "Kate Warren",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T11:30:16.000Z",
          "Titre": "Support is great and staff are patient"
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Mfundo Mabuza",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T13:54:36.000Z",
          "Titre": "Great Customer Support",
          "Contenu": "All our queries are being attended to quickly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Foerster",
          "Nb_Reviews": 2,
          "Date": "2023-08-19T17:07:34.000Z",
          "Titre": "Phone rep stayed very calm and was…",
          "Contenu": "Phone rep stayed very calm and was knowledgably of the software.  The software smart contracts is not user friendly.  When I use it, ( 9 times out of 10 I have to call for help."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Janice Herbert",
          "Nb_Reviews": 1,
          "Date": "2022-10-25T16:38:34.000Z",
          "Titre": "When the representative finally was…",
          "Contenu": "When the representative finally was able to take of the problem, as far as I can see it is fix."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Bronwyn",
          "Nb_Reviews": 5,
          "Date": "2023-03-31T02:31:57.000Z",
          "Titre": "All going well",
          "Contenu": "All going well. A bit of back and forth getting the contract correct to sign up with Property Tree"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Barbara Tunnicliffe",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T17:09:18.000Z",
          "Titre": "My question was answered and I was…",
          "Contenu": "My question was answered and I was walked through the necessary steps to fix my issue."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vicki",
          "Nb_Reviews": 3,
          "Date": "2023-09-15T14:14:40.000Z",
          "Titre": "She was the most knowledgeable help…",
          "Contenu": "She was the most knowledgeable help however she could not resolve my issue of integrating an outside providers document."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel Percefull",
          "Nb_Reviews": 2,
          "Date": "2023-05-29T13:54:59.000Z",
          "Titre": "Why should we have to call to make…",
          "Contenu": "Why should we have to call to make common revisions like signature additions to the contract."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Adriana Gomez",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T14:31:50.000Z",
          "Titre": "The representative got the error",
          "Contenu": "The representative got the error in my JE, and send me a way to solve it. Thanks"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "John Baylouni",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T06:31:24.000Z",
          "Titre": "Reputable Company",
          "Contenu": "Support staff are fantastic and always eager to help."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cheri Bomar",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T14:09:58.000Z",
          "Titre": "I had a question regarding budgeting…",
          "Contenu": "I had a question regarding budgeting and forecasting module.  The responder was prompt and helpful."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Kate Johnstone",
          "Nb_Reviews": 1,
          "Date": "2023-02-13T09:39:00.000Z",
          "Titre": "Templates for Agendas",
          "Contenu": "The answer I had to my question was helpful but currently not achievable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Maritza Gonzalez-Ortiz",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T18:17:43.000Z",
          "Titre": "CRM Platform for Condo Sales",
          "Contenu": "Being able to access accurate project information under one platform, which is user friendly and easy to understand facilitates the work for our team."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tina McMullen",
          "Nb_Reviews": 2,
          "Date": "2023-06-09T15:11:09.000Z",
          "Titre": "response time was WAY SHORTER then in past support cases..TIMELY-PROMPT",
          "Contenu": "response time was WAY SHORTER then in past support cases."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Pamela Heywood",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T12:16:57.000Z",
          "Titre": "The team on the phone were helpful",
          "Contenu": "The team on the phone were helpful and the issue got sorted out quickly."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Hong Truong",
          "Nb_Reviews": 2,
          "Date": "2022-12-02T01:03:09.000Z",
          "Titre": "Very professional to deal with",
          "Contenu": "The support agents are very friendly and very professional to deal with"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marisol Orozco",
          "Nb_Reviews": 2,
          "Date": "2023-07-11T17:40:59.000Z",
          "Titre": "Help with Corporate AR",
          "Contenu": "Got to someone to help me in a relatively short time"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Linda Heckendorf",
          "Nb_Reviews": 2,
          "Date": "2023-11-19T03:15:03.000Z",
          "Titre": "Great help with anything I have trouble…",
          "Contenu": "Great help with anything I have trouble with!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Flora Cardenas",
          "Nb_Reviews": 3,
          "Date": "2023-04-05T16:10:15.000Z",
          "Titre": "Personalized service and not put out…",
          "Contenu": "Personalized service and not put out attitude.Enjoys and creates a good experience, understands that the process can be overwhelming. Interacts with genuine interest and understanding."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Laura Cook",
          "Nb_Reviews": 2,
          "Date": "2023-07-06T14:03:49.000Z",
          "Titre": "Response time is getting much better."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Alrick Fung",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T16:46:56.000Z",
          "Titre": "You got everything you need for an real…",
          "Contenu": "You got everything you need for an real estate business."
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Ibrahim Saheb",
          "Nb_Reviews": 1,
          "Date": "2022-10-20T11:04:24.000Z",
          "Titre": "Keep up the good work",
          "Contenu": "I have recently created a good number of cases to have APIs applied to client's environments. The MRI support team has always answered my questions within no time at all and has my work a lot easier."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Morvarid",
          "Nb_Reviews": 2,
          "Date": "2023-06-28T12:18:46.000Z",
          "Titre": "Friendly and Efficient",
          "Contenu": "Friendly and Efficient, quick solution was supplied"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gary Rawls",
          "Nb_Reviews": 1,
          "Date": "2023-04-22T15:29:31.000Z",
          "Titre": "The support help was very nice and…",
          "Contenu": "The support help was very nice and professional."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jay Powers",
          "Nb_Reviews": 10,
          "Date": "2023-03-29T17:27:05.000Z",
          "Titre": "strong support always resolve our needs"
        },
        {
          "Note": 4,
          "Lieu": "PR",
          "Pseudo": "Ann Margaret Bernard",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T19:04:20.000Z",
          "Titre": "Documentation, very important and not easy to find in MRI"
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Brett Nadel",
          "Nb_Reviews": 4,
          "Date": "2022-10-12T11:38:57.000Z",
          "Titre": "I just think that the suggestions put…",
          "Contenu": "I just think that the suggestions put forward on the portal channel are not really taken into account. i realise that you guys have thousands of clients, but that should not make a difference."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Manu Augustine",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T16:26:24.000Z",
          "Titre": "Good support and relationship management, reliable platform",
          "Contenu": "Good support and relationship management, invests in keeping in step with new advances and functionality, very reliable platform"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shawna Deshazo",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T18:18:45.000Z",
          "Titre": "It went very well it did not take them…",
          "Contenu": "It went very well it did not take them long at all ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Elizabeth Sullivan",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T14:24:37.000Z",
          "Titre": "Finding past contracts",
          "Contenu": "The staff are always so helpful. The software not so."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shauna H.",
          "Nb_Reviews": 3,
          "Date": "2023-11-01T12:41:54.000Z",
          "Titre": "The quick response."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike Isherwood",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T18:57:04.000Z",
          "Titre": "Great experience with Partner Connect…",
          "Contenu": "Great experience with Partner Connect related to integrating Northspyre with MRI.  Timely and extremely competent."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lillian Lively",
          "Nb_Reviews": 6,
          "Date": "2023-06-21T19:01:33.000Z",
          "Titre": "I always find support quickly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephanie Goodenough",
          "Nb_Reviews": 2,
          "Date": "2023-09-30T15:25:05.000Z",
          "Titre": "Your customer service is quick and…",
          "Contenu": "Your customer service is quick and reliable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JANET MITCHELL",
          "Nb_Reviews": 5,
          "Date": "2022-10-05T17:29:24.000Z",
          "Titre": "Manufactured Home Contract to Buy and Sell",
          "Contenu": "The regular real estate contracts and use are fabulous.I sell mobile homes in rental parks and I tried last year and just yesterday to use the Manufactured Home Contract to Buy and Sell and since it is in SMART it is almost impossible to use. I spent about 5 hours trying to use it and I just gave up. I have my own contract for mobile homes and I just used it instead it was much easier. If you are going to put the contract in CTMe, it has to be user friendly like the real estate contracts. I will never use your MH Contract to B and S unless it is like the real estae contracts.Please note, that Damian Cox, lawyer, used my Mobile Home Contract to Buy and Sell which the Real Estate Commission used to prepare the Manufacture Home Contract to Buy and Sell. I have been selling real estate and mobile homes for over 48 years."
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Mfundo Mabuza",
          "Nb_Reviews": 2,
          "Date": "2023-04-11T14:08:30.000Z",
          "Titre": "Great service",
          "Contenu": "Great service and quick responses."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anne Marie Bryan",
          "Nb_Reviews": 1,
          "Date": "2022-07-19T15:18:44.000Z",
          "Titre": "TECH GREAT; AUTOMATED GREETER WAS DIFFICULT",
          "Contenu": "To get to a person to help was the most difficult part of my call.  Some things asked I was not sure about and it doesn't give you the option of saying \"I don't know\".  That was getting me perturbed.  When I got a live person, things went very smoothly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MN Real Estate Guy",
          "Nb_Reviews": 1,
          "Date": "2022-08-26T17:27:41.000Z",
          "Titre": "The software is great! But support can be challenging",
          "Contenu": "MRI has been a staple in real estate accounting for years. The new SaaS system is nice but the implementation was a bit rocky. It comes down to MRI not capturing all of the prerequisite information properly in the initial bid and legacy product review components. Still a 4 star because they have a good product, would have been 5 if the account manager was more available and helpful. They eventually made good on most issues. Due to this dragging over six weeks and the lack of correspondence from our main rep, I will stick with a 4 star review. It would be nice if MRI employees used phone numbers in their contact information but they do not so that they can stay semi-elusive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Barry M. Miller",
          "Nb_Reviews": 2,
          "Date": "2023-06-24T15:17:15.000Z",
          "Titre": "Good service but too high a price for…",
          "Contenu": "Good service but too high a price for what we get."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lynn Spring",
          "Nb_Reviews": 1,
          "Date": "2022-05-26T17:31:46.000Z",
          "Titre": "HUD has created new VMS fields for EHV",
          "Contenu": "HUD has created new VMS fields for EHV, Mainstream, etc.  I've asked questions but seem not to be able to get a response regarding the issue (ticket # is 04810825).  This particular reason is symptomatic of why I can't rate 5 stars.  Typically, I'm very happy with support."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Yolanda Lawson",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T16:59:08.000Z",
          "Titre": "Helpful with solving my issue",
          "Contenu": "Technician was knowledgeable about my issue.  Polite and helpful."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Experienced User",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T11:39:18.000Z",
          "Titre": "Quick response and problem resolved."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jane Ellison",
          "Nb_Reviews": 4,
          "Date": "2022-03-03T21:23:40.000Z",
          "Titre": "Upside Down World",
          "Contenu": "For the most part, I'm pretty pleased with how things are working.  Sometimes it seems like it takes forever to close a case and that is frustrating.  Yet.....I'm not blaming the support team as much as I blame the upside down world we find ourselves in.  We are all challenged these days.  Thanks for all you do,  Jane"
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Nadine Emdin",
          "Nb_Reviews": 1,
          "Date": "2022-07-15T10:16:15.000Z",
          "Titre": "Overall a decent software program",
          "Contenu": "No system is without it's issues, nor can it ever be 100% effective to what we want/need. But overall a good system. My only recommendation would be to make the Knowledge Base help feature a bit more user friendly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe Martinez",
          "Nb_Reviews": 3,
          "Date": "2023-03-21T20:26:02.000Z",
          "Titre": "Knowledge of the subject"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michelle Baker",
          "Nb_Reviews": 2,
          "Date": "2022-02-09T13:50:52.000Z",
          "Titre": "We have been having issues with certain…",
          "Contenu": "We have been having issues with certain processes that have been taking months upon months to resolve.  There is an issue with having a contact for issues that are outside of 9AM EST.  Many of our users are in the application by 7AM EST and when down, unable to contact anyone at MRI RAM."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Howard John Wann",
          "Nb_Reviews": 2,
          "Date": "2021-09-22T14:28:07.000Z",
          "Titre": "Ever since Covid started it's been…",
          "Contenu": "Ever since Covid started it's been pretty challenging to get phone support. Of course I'm spoiled because I never used to have to wait longer than a couple of minutes to get in touch with someone. It is getting better, but I'm assuming that you are still short on staffing? The help I got was good, but it was interesting to note the known bug in the software."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Jason Swift",
          "Nb_Reviews": 1,
          "Date": "2021-10-14T20:09:57.000Z",
          "Titre": "QUBE PROPERTY MANAGEMENT",
          "Contenu": "I have used this system for more years than I care to admit to!  It is a testament to the quality and usability of system that it continues to be relevant and an advantage to users and businesses alike.  I think for me what pitches it ahead of other systems is the speed of data entry; most actions are instantaneous and the majority of the system can be used through the keyboard rather than clicking around with a mouse and waiting for something to happen.  Keep up the good work!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "A Willits",
          "Nb_Reviews": 1,
          "Date": "2021-08-25T11:29:30.000Z",
          "Titre": "Overall, very happy with the tech assigned.",
          "Contenu": "Once I was able to speak with a tech, Mr. Riser, everything was great. He fixed a major issue that I \"inherited\" in a matter of minutes. He was quick, knowledgeable, and very friendly.   The only issue was the wait time on how long it took for me to be contacted back once a ticket was created.  Also, when I called to check the status of the ticket two times, it was long hold times, which is hard for me in my office with the workload, and call volume that we get."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Thomas",
          "Nb_Reviews": 1,
          "Date": "2021-05-12T11:44:13.000Z",
          "Titre": "Good Valuation Software",
          "Contenu": "As someone who uses valuation systems in my day job this is better than some products on the market. Overall it is a good valuation software product. However it has it's quirks and is still not perfect but MRI have been quick to address area's of improvement and guide through certain specific problems. With the right training and regular use it's a suitable product."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Helen",
          "Nb_Reviews": 1,
          "Date": "2021-04-23T12:08:25.000Z",
          "Titre": "First time user of the Housing Jigsaw…",
          "Contenu": "First time user of the Housing Jigsaw software it has been great! Simple to navigate through and really straightforward to use and easy case management - I always know where the teams cases are, ensures we stay compliant with H-CLIC.   Its the ease of use for homeless case management that really wins this for me!Support team are always helpful although I do have persistent error with some of the reports."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kimora White",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T20:51:15.000Z",
          "Titre": "Love the software just a little hard on…",
          "Contenu": "Love the software just a little hard on the eyes lol"
        },
        {
          "Note": 4,
          "Lieu": "JM",
          "Pseudo": "Karen Chung",
          "Nb_Reviews": 6,
          "Date": "2021-04-08T15:10:35.000Z",
          "Titre": "The support centre is good and always…",
          "Contenu": "The support centre is good and always supportive, helpful and easy to understand.The product itself is easy to use and understand. However from time to time we have glitches in the system that is happy to solve.The product helps my business very well and I am looking forward for other product that we can use to enhance the business.Great job so far MRI"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Pam Whitney",
          "Nb_Reviews": 1,
          "Date": "2022-10-08T00:36:42.000Z",
          "Titre": "Budget",
          "Contenu": "I needed to change the Budget date for the prior year. Using TeamViewer the support person was able to help me."
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Elizabeth Matesa",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T11:10:42.000Z",
          "Titre": "My query was dealt with promptly and prpfessionally…",
          "Contenu": "My query was dealt with promptly and professionally,The problem was dealt with via Team View and I could see exactly what was happening.The Problem was dealt with successfully  within a short space of time,The consultant Robert Joubert was extremely helpful and professional."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Margaret",
          "Nb_Reviews": 4,
          "Date": "2023-12-13T12:01:32.000Z",
          "Titre": "Getting through by telephone for…",
          "Contenu": "Getting through by telephone for support has dramatically changed, this can only be positive.  Support has always been good once we got through on the telephone but used to have to wait a life time for someone to answer"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pam Olson",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T03:43:14.000Z",
          "Titre": "My customer service person was kind and…",
          "Contenu": "My customer service person was kind and knowledgeable.  He fixed my problem and took the time to teach me how I could address it myself in the future if needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amy Hammock",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T15:07:42.000Z",
          "Titre": "Fast and helpful support",
          "Contenu": "Fast and helpful support.  My problem was quickly identified and resolved,"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Attianese",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:12:35.000Z",
          "Titre": "I was very happy with the service i…",
          "Contenu": "I was very happy with the service i received.  They told me what needed to be done and took care of everything."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cindy",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T16:45:31.000Z",
          "Titre": "Gad is a Rock Star",
          "Contenu": "Gad was super helpful, as they spent many hours reconciling a tenant ledger to cycle off 1 cent."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Beth Hale",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T11:18:20.000Z",
          "Titre": "Customer support is amazing",
          "Contenu": "Customer support is amazing! Always answer the phone quickly and are able to resolve queries straight away, and they stay on the line while I go through the guidance given to make sure it works. Can't fault them!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Stella Cowen",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T02:57:45.000Z",
          "Titre": "The staff are always helpful & professional!",
          "Contenu": "The staff are always helpful, professional, quick to respond and knowledgeable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laura Church",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T16:34:32.000Z",
          "Titre": "Our voucher has several errors that we…",
          "Contenu": "Our voucher has several errors that we could not fix,we sent the reconciliation to Marcia Guzman, she took control of my computer for quite awhile and fixed the certifications!! It was cleared that day.Thank you Marcia!"
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "Michelle Clement",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T14:22:33.000Z",
          "Titre": "Great Software and Company",
          "Contenu": "We have worked with MRI software for a few years. I have used the software to fulfil many useful functions related to leasing and business activities. Support is great, when I was unable to log in, I received help from the support staff."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christine Brodeur",
          "Nb_Reviews": 3,
          "Date": "2023-10-27T16:05:13.000Z",
          "Titre": "Knowledgeable, Friendly Customer Reps",
          "Contenu": "One of the customer reps, Marcia, has been a great contact for all issues that come up, big or small.  She follows through 100% and checks back often to see if I've made progress.  She was a huge help in a recent change that was being implemented within my property."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Suzanne Gautier",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T18:27:54.000Z",
          "Titre": "I contacted Technical Support and spoke…",
          "Contenu": "I contacted Technical Support and spoke to Mr. Jobi Mundaniohl and explained the 2 errors that were listing on the \"Overdue Tasks\" & \"interact Score\".  He opened a ticket and worked to resolve the problems that I was having.  I am extremely happy with the results.  I appreciate his work ethic."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Walid Rifai",
          "Nb_Reviews": 3,
          "Date": "2023-11-30T15:49:39.000Z",
          "Titre": "Keep the good work",
          "Contenu": "Excellent and quick response to my questions, Greate account manger who always ready to help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Onea Jewel Miller",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T20:26:36.000Z",
          "Titre": "I was working with the nicest and most…",
          "Contenu": "I was working with the nicest and most pleasant lady that you could imagine.Thank youOnea Jewel MillerMerry Christmas"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Judy Hill-Dade",
          "Nb_Reviews": 4,
          "Date": "2023-09-27T16:41:23.000Z",
          "Titre": "Helpful, Informative and Patience",
          "Contenu": "The Support Agents are helpful and informative about the product and how to navigate. I had never heard of Boston Post(1st time using this product), before working for this management co. plus there was no formal training to use the product from this co. I've made some mistakes and I can always rely on the Support Agent to provide a \"crash course\" for what I need, they don't just fix the problem they show you what to do to avoid that happening again. Sandy and Chris are especially great with their tutorial approach showing what to do, so you learn the product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jane Ellison",
          "Nb_Reviews": 4,
          "Date": "2023-09-27T19:36:59.000Z",
          "Titre": "MRI Support",
          "Contenu": "We have a number of minor support issues and some updating kind of changes happening lately.  I'm very  pleased with the timely and informed responses we are receiving from the MRI teams.  Bobbie Tate is our new rep.  I'm so pleased to meet her and look forward to working together.Thanks MRI"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Pete Bellis",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T11:13:29.000Z",
          "Titre": "In preparing for a sysGreat support from the client support teamtem upgrade and…",
          "Contenu": "In preparing for a system upgrade and move to SAAS, I've had a lot of interaction with the client support team (setting up / changing user names, password resets etc). They have been very responsive and provided a great service. Particular shout out here for Bharath but thanks to all the team.."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jorge Ovalle",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T15:28:06.000Z",
          "Titre": "The staff handled the issue quickly",
          "Contenu": "The staff handled the issue quickly, efficiently and without a lot of gruff.We made an error that we make on occassion that requires your expertise. We appreciate your patience as we train new staff and go through these \"growing pains.\""
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Dershree Reddy",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T11:09:33.000Z",
          "Titre": "Muhammad was very helpful and he was…",
          "Contenu": "Muhammad was very helpful and he was quick to respond and made me feel at ease . I know going forward it will be a great experience working with him as he is always on the ball"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard B.",
          "Nb_Reviews": 2,
          "Date": "2023-10-02T17:10:48.000Z",
          "Titre": "MRI SOFTWARE - MOVING IN THE RIGHT DIRECTION",
          "Contenu": "MRI and SHA have a number of things in process to take advantage of MRI software.  Our account rep, Matt Grimes, has been very helpful to inform us of MRI options we can pursue that will enhance our current environment.  He has connected us to the GPS team who are implementing the plans to migrate.  SHA is now working through this migration process with good results.  We have another software migration in the wings.MRI and the Support team have been wonderful to work with as we resolve some software issues.  Their response time has been good and they continue to follow up to see if the fix or suggestion for the fix has resulted in the problem being resolved.  Support has been very attentive.Overall MRI has been doing a good job.  We look forward to the next roll out of software enhancements for our Public Housing and Housing Choice Voucher programs.  MRI is keeping us informed as they make progress with the roll out."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "NGMIII",
          "Nb_Reviews": 4,
          "Date": "2023-12-03T16:28:10.000Z",
          "Titre": "My broker change request was overlooked…",
          "Contenu": "My broker change request was overlooked some how, but they found it and fixed it right away."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kimberly Beck",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T14:33:30.000Z",
          "Titre": "The instructors are very patient",
          "Contenu": "The instructors are very patient, they help correct the issue and teach you how to correct it yourself in the future.  They also understand when you are frustrated and when to jump in and help. : )"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joy Sousa",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T13:46:54.000Z",
          "Titre": "The representative who helped",
          "Contenu": "The representative who helped me. Just kind nice and went above and beyond to make sure my problem was resolved. He had a wonderful demeanor. It’s always nice when you get people who just want to help. We need more nice people like this in our world. Thank you and keep up the wonderful work!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Tom Reich",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T11:53:28.000Z",
          "Titre": "So responsive when we really needed it",
          "Contenu": "So responsive when we really needed it.  A seamless great customer experience from management to account manager to technician support.  Following through on your verbal commitment is sadly a rare thing these days.  Well done MRI team!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JoAnn Sheridan",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T14:31:23.000Z",
          "Titre": "Sandy was extremely helpful and most…",
          "Contenu": "Sandy was extremely helpful and most pleasant during our phone call."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jo Pellegrino, CRS, ABR, GRI,",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T15:26:28.000Z",
          "Titre": "Tech Support",
          "Contenu": "I’ve had the call tech support several times recently because of receiving an offer from an agent that didn’t use CTM or Docusign.  Tech support was wonderful at walking me through the process of converting the contract and adding signature functionality. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jacob Marshall",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T15:38:02.000Z",
          "Titre": "My experience has been great",
          "Contenu": "My experience has been great! Though, I will say, my most recent support call was about switching email addresses. The issue was resolved from what I can tell, contracts are being sent to the proper email. But this survey was still sent to the old email address? I don’t think there needs to be another ticket open for this, but it is a little odd that everything was changed yesterday and today I’m getting an email to the old email."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Crystal Ivy",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T15:15:29.000Z",
          "Titre": "MRI Staff are AWESOME!",
          "Contenu": "Everyone that I speak with are always polite and professional. They answer my questions or they provide the resources I need to assist me with my task. Pretty amazing crew."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keri Conklin",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T16:27:38.000Z",
          "Titre": "Their level of knowledge is excellent",
          "Contenu": "Their level of knowledge is excellent.  If they don't know the answers they get back to you right away.  I actually enjoy calling them and learning new ways to help my buisness."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keith McDougal",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T16:06:31.000Z",
          "Titre": "The help desk was very helpful and…",
          "Contenu": "The help desk was very helpful and knowledgeable.  However, I'm disappointed that the MRI software, can not accommodate my question/inquiry... when the buyer submits an offer outside of the system, the buying agent can't be integrated, and subsequent documents can not be shared."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Chris D'Antonio",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T23:23:42.000Z",
          "Titre": "Very quick to respond & easy…",
          "Contenu": "Very quick to respond & easy instructions to rectify the issue."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Alina",
          "Nb_Reviews": 2,
          "Date": "2023-10-18T11:22:55.000Z",
          "Titre": "Amazing support Team",
          "Contenu": "I recently had the pleasure of experiencing exceptional support from Amanda and Andrew at MRI Software. Their kindness, efficiency, and expertise made all the difference.Amanda and Andrew were incredibly responsive, addressing my queries with patience and clarity. They went above and beyond to ensure my issues were resolved promptly. Their guidance not only fixed immediate concerns but also improved my overall software experience.What sets Amanda and Andrew apart is their genuine care for customers. They took the time to understand our needs and offered tailored solutions. Their support is a rare combination of professionalism and kindness.I can't recommend Amanda, Andrew, and the MRI Software support team enough. Thank you, Amanda and Andrew!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniele Jeffery",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T16:16:07.000Z",
          "Titre": "Everyone is is so helpful and patient"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Moger",
          "Nb_Reviews": 3,
          "Date": "2023-08-22T18:24:52.000Z",
          "Titre": "Had an issue with email to contacts and…",
          "Contenu": "Had an issue with email to contacts and called for help.  I didn't have time to go through the troubleshooting problem in the moment, but gave the details to the tech.  He worked on it after the call and updated me that he completed the work and solved the problem the following day.  Wonderful.  Very, very good service."
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Tertius Van Niekerk",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T11:49:56.000Z",
          "Titre": "You're company is doing phenomenal…",
          "Contenu": "You're company is doing phenomenal work.Please keep on providing this World-Class Performance Thank You All!Tertius van Niekerk// Exemplar Reitail Ltd: Debt Acc Admin"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Craig",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T14:00:44.000Z",
          "Titre": "Brillaint software with great support",
          "Contenu": "Brillaint software with great supportif you are an estate agent looking for functional and powerful estate agency CRM software, this is the product to choose"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Roanna Rego",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T15:20:21.000Z",
          "Titre": "Tenant Login Issue",
          "Contenu": "Alex was fast and effective to resolve the issue that our tenant was having creating their login credentials."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janine Kahler",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T17:28:39.000Z",
          "Titre": "Service representative was very helpful…",
          "Contenu": "Service representative was very helpful and even showed me a few extra tips."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Taylor Green",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T17:07:09.000Z",
          "Titre": "Great",
          "Contenu": "Great, always easy and fast working with yall and getting help!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larry Bennett",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T17:08:47.000Z",
          "Titre": "Check Number replacement",
          "Contenu": "Justin diagnosed the problem was provided a solution which was fast and worked. He told me what I needed to do and what he would do once I completed my part."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank Shoptaugh",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T12:41:33.000Z",
          "Titre": "The lady that helped me was fantastic",
          "Contenu": "The lady that helped me was fantastic, helped me with everything I needed, courteous, kind, knowledgeable, and very kind and professional."
        },
        {
          "Note": 5,
          "Lieu": "JM",
          "Pseudo": "Karen Chung",
          "Nb_Reviews": 6,
          "Date": "2023-11-15T16:30:17.000Z",
          "Titre": "The product itself is effective and…",
          "Contenu": "The product itself is effective and easy to use.  The support staff is professional and efficient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Aughenbaugh",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T04:36:24.000Z",
          "Titre": "Technicians are readily available",
          "Contenu": "Technicians are readily available; patient and knowledgeable."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Michael Millar",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T11:18:27.000Z",
          "Titre": "Great system, fantastic support team",
          "Contenu": "Great system, very user friendly and support from the team where complex issues are present. Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carina Roman",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T16:32:54.000Z",
          "Titre": "I appreciate that the rep was able to…",
          "Contenu": "I appreciate that the rep was able to identify the issue  quickly and let me know needed to be done."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Colleen Kroell",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T13:38:03.000Z",
          "Titre": "It is very easy to open a support case",
          "Contenu": "It is very easy to open a support case. I got an email immediately that the was received by MRI and is being assigned. The issue was resolved very quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Josh R.",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T14:20:36.000Z",
          "Titre": "Fast & Efficient",
          "Contenu": "They were all on top of the responses - barely had to wait. Walked us through everything needed to make sure everyone understood what was happening."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "K. Reid",
          "Nb_Reviews": 2,
          "Date": "2023-10-24T07:33:19.000Z",
          "Titre": "We have been using Rest Professional very happily for quite some years.",
          "Contenu": "We have been using Rest Professional for quite some years & have found the support & technical assistance of the highest standard."
        },
        {
          "Note": 5,
          "Lieu": "DO",
          "Pseudo": "Nitza Rodriguez",
          "Nb_Reviews": 2,
          "Date": "2023-11-23T15:13:14.000Z",
          "Titre": "Always greatful with the results the…",
          "Contenu": "Always greatful with the results the help and patience"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ken Levinson",
          "Nb_Reviews": 4,
          "Date": "2023-09-13T15:44:26.000Z",
          "Titre": "I have answered all the reviews…",
          "Contenu": "I have answered all the reviews regarding experience with an individual Tech.All have been good.This is one to many reviews!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Christopher",
          "Nb_Reviews": 3,
          "Date": "2023-11-28T15:51:56.000Z",
          "Titre": "My request was handled quickly…",
          "Contenu": "My request was handled quickly accurately."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Liz Hale",
          "Nb_Reviews": 2,
          "Date": "2023-10-12T13:13:41.000Z",
          "Titre": "Above and beyond",
          "Contenu": "Issue was resolved quickly and she was very helpful with the trouble I was having.  She went above and beyond to have me back up and running."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Finger",
          "Nb_Reviews": 3,
          "Date": "2023-11-11T19:34:10.000Z",
          "Titre": "Extremely professional",
          "Contenu": "Extremely professional. Really took the time to explain to me what to do."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob Longgrear",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T21:30:32.000Z",
          "Titre": "You are always there & 99.99% of the…",
          "Contenu": "You are always there & 99.99% of the time have the right answer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debra Shea",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T17:11:18.000Z",
          "Titre": "Although it took me a while to get to…",
          "Contenu": "Although it took me a while to get to the right place on the internet and get some feedback, once I contacted the correct person/place - I was helped perfectly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephanie Lynch",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T15:15:59.000Z",
          "Titre": "ALWAYS THE VERY BEST CUSTOMER SERVICE!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Schill",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T16:30:37.000Z",
          "Titre": "I appreciate that the MRI person I was…",
          "Contenu": "I appreciate that the MRI person I was talking to stayed on the phone with me through the whole process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patrick Logue",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T18:21:14.000Z",
          "Titre": "customer service rep was very helpful…",
          "Contenu": "customer service rep was very helpful and knowledable"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zayne Wiest",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T20:56:20.000Z",
          "Titre": "My files had disappeared from the…",
          "Contenu": "My files had disappeared from the location they were in and CTM helped me to get them back to where they needed to be!"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Roelof Van Der Westhuizen",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T11:17:14.000Z",
          "Titre": "Prompt service and professional",
          "Contenu": "Prompt service and quickly resolved my system problem. Roxanne Manwaring was very professional and patient in resolving my MDA issue. Thank you for assisting."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Brunswick",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T08:03:03.000Z",
          "Titre": "What makes your software so amazing.",
          "Contenu": "What makes your software so amazing, is that you continue to update and improve it all the time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ashanti West",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T16:05:53.000Z",
          "Titre": "Nathan was extremely knowledgeable",
          "Contenu": "Nathan was extremely knowledgeable, help, and a pleasure to speak with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ami Dunkley",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T23:29:22.000Z",
          "Titre": "Fast and Friendly Service",
          "Contenu": "Friendly customer service agent. She was able to resolve my issue immediately."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patti DeClark",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T21:45:14.000Z",
          "Titre": "I'm always very pleased with the…",
          "Contenu": "I'm always very pleased with the service I receive from MRI."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Kevin Purtell",
          "Nb_Reviews": 3,
          "Date": "2023-11-04T00:55:13.000Z",
          "Titre": "Pauline was very professional in…",
          "Contenu": "Pauline was very professional in helping me solve the problem I had in balancing my trust account"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michelle Borchers",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T14:53:47.000Z",
          "Titre": "Customer service was amazing",
          "Contenu": "Customer service was amazing! She was patient and kind, and walked me through everything! The programs are very helpful as well, and easy to use!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim Thoeming",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T22:26:17.000Z",
          "Titre": "Your phone reps always make the problem…",
          "Contenu": "Your phone reps always make the problem go away w/simple strp by step instructions"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "PT",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T12:05:23.000Z",
          "Titre": "we had a good experience with MRI…",
          "Contenu": "we had a good experience with MRI support in resolving the issue"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Peter Smith",
          "Nb_Reviews": 3,
          "Date": "2023-08-30T12:34:59.000Z",
          "Titre": "Comforting knowledge",
          "Contenu": "The ability to have very knowledgeable staff to deal with problems in a quick efficient manner makes it very comforting to know that the service provided by MRI support is available."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sharon Kissick",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T15:00:43.000Z",
          "Titre": "Listening to what my issue was",
          "Contenu": "Listening to what my issue was, understanding what to do and fixing it quickly so I could get my work done."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Claire Keating Moore",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T17:01:05.000Z",
          "Titre": "I always get professional and effective…",
          "Contenu": "I always get professional and effective support from CTM.  Love it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Team Gena Ryder",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T14:53:16.000Z",
          "Titre": "They answered my questions so quickly…",
          "Contenu": "They answered my questions so quickly when I called"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tamara Camalick",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T16:48:04.000Z",
          "Titre": "The representative was very helpful…",
          "Contenu": "The representative was very helpful with a linking issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Valente",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T17:10:51.000Z",
          "Titre": "good support"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kaycie Crider",
          "Nb_Reviews": 2,
          "Date": "2023-09-29T17:33:48.000Z",
          "Titre": "I always get the help and clarification…",
          "Contenu": "I always get the help and clarification that I need when I call support and I can trust that the answers I receive are accurate!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laura Springer",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T15:43:46.000Z",
          "Titre": "Always helpful and quick",
          "Contenu": "Always helpful and quick! Love this software and the customer support."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Michael Grice",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T01:07:22.000Z",
          "Titre": "Good support experience",
          "Contenu": "Amy was patient and thorough in helping to resolve our problem."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Fiona Kittikhoun",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T01:27:07.000Z",
          "Titre": "Excellent Service",
          "Contenu": "My questions were answered in a matter of minutes. Answers provided were very straightforward!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alan Young",
          "Nb_Reviews": 2,
          "Date": "2023-10-02T02:16:38.000Z",
          "Titre": "The staff was knowledgeable and…",
          "Contenu": "The staff was knowledgeable and explained everything as well went through the process"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa McCarthy",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T23:27:11.000Z",
          "Titre": "Rob was knowledgeable",
          "Contenu": "Rob was knowledgeable. Great customer service!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Margarita Huerta",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T03:48:04.000Z",
          "Titre": "Quick response.Kind and diligent…",
          "Contenu": "Quick response.Kind and diligent support. Accuracy in solving the problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff Erickson",
          "Nb_Reviews": 2,
          "Date": "2023-10-07T14:19:03.000Z",
          "Titre": "Exemplary technician!",
          "Contenu": "The technician was courteous and knowledgeable and was able to fix my problem promptly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas Stianche",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T16:05:53.000Z",
          "Titre": "Quick reply to cases submitted",
          "Contenu": "Quick reply to cases submitted.  Kim is quick, and courteous."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin Willis",
          "Nb_Reviews": 2,
          "Date": "2023-09-14T15:24:28.000Z",
          "Titre": "Making my job easy...",
          "Contenu": "The software does amazing things helping me to do my job quicker and easier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Henry Lustig",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T18:25:53.000Z",
          "Titre": "as always you guys fix the problem for…",
          "Contenu": "as always you guys fix the problem for me quickly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Evon Chaney",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T17:41:00.000Z",
          "Titre": "Everyone is always very helpful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anita",
          "Nb_Reviews": 2,
          "Date": "2023-12-03T21:59:59.000Z",
          "Titre": "Quick response time and resolution of…",
          "Contenu": "Quick response time and resolution of issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ann Mills",
          "Nb_Reviews": 7,
          "Date": "2023-09-22T17:36:44.000Z",
          "Titre": "Prompt and Professional",
          "Contenu": "Response to my phone call was quick and help was professional.  Tech was pleasant and kind."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gloria Carter",
          "Nb_Reviews": 2,
          "Date": "2023-09-13T18:12:06.000Z",
          "Titre": "MRI support is great",
          "Contenu": "the fact that the agent helping me was very helpful, patient & knowledgeable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laura Lopez",
          "Nb_Reviews": 3,
          "Date": "2023-10-13T00:27:28.000Z",
          "Titre": "The customer service rep that assisted…",
          "Contenu": "The customer service rep that assisted me gets a 5 star!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Natalie Austin",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T03:49:47.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "Took the time and care to make sure my problems were addressed in a timely manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas Martin",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T19:38:22.000Z",
          "Titre": "Phone support is Great!",
          "Contenu": "Very easy to get on the phone and they will give great directions to help me with questions that I have."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Philip",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T15:45:33.000Z",
          "Titre": "Great Customer Service!",
          "Contenu": "Every customer service rep was very nice and very helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "sm",
          "Nb_Reviews": 2,
          "Date": "2023-08-24T14:07:58.000Z",
          "Titre": "Excellent",
          "Contenu": "Currently each and every time I have called, I have received the most help anyone could ask for."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arlene Burgess",
          "Nb_Reviews": 3,
          "Date": "2023-09-14T19:40:34.000Z",
          "Titre": "Great employees",
          "Contenu": "The associates are very helpful and try hard to solve your issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lexi Forrest",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T16:25:33.000Z",
          "Titre": "Agent was extremely helpful"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Joanne Dellit",
          "Nb_Reviews": 2,
          "Date": "2023-10-06T21:17:16.000Z",
          "Titre": "Customer service is spot on",
          "Contenu": "Customer service is spot on. Friendly staff who are ready to help out and put you at ease."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-11T17:03:38.000Z",
          "Titre": "Courteous and knowledgeable assistance",
          "Contenu": "Courteous and knowledgeable assistance from the help desk."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Beverly T.",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T21:24:52.000Z",
          "Titre": "Tech support was professional",
          "Contenu": "Tech support was professional, very helpful and pleasant to deal with.  Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jo Ann Mayhew",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T22:49:40.000Z",
          "Titre": "Support is helpful and quick to respond!"
        }
      ]
    }
  ]
}