{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.airoasis.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kelley Miller",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T17:03:09.000Z",
          "Titre": "Both of the items I ordered have quit…",
          "Contenu": "Both of the items I ordered have quit worked. One quit very early on, I emailed your company and the person told me what to do and that it should start working again. It isn’t. Now the other one isn’t working either."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Darlene Koegler",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T15:11:08.000Z",
          "Titre": "No correspondence on order time for…",
          "Contenu": "No correspondence on order time for delivery. I checked once said delivered. Not true. Checked again and now it’s mid December. If I don’t receive by then I will cancel order and get the refund. Poor service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Bendick",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T20:01:54.000Z",
          "Titre": "Shipping times very slow/ no tracking…",
          "Contenu": "Shipping times very slow/ no tracking or ETA provided at all"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Krutarth Mehta",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T20:05:03.000Z",
          "Titre": "I never even got my product yet!!",
          "Contenu": "I never even got my product yet!!! Been waiting over a week. Where the hell ish product!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Aaron James",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T14:44:54.000Z",
          "Titre": "Do not buy!  The pop-up ads never stop!",
          "Contenu": "Ordered an overpriced air purifier for my mennonite friend who doesn't have internet access and now i can't watch a single YouTube video for more than 5 minutes without your stupid pop-up ads interrupting. I will never order from this company again because of your horribly annoying advertising tactics. When will you learn that everyone hates you for that?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Debra Seidman",
          "Nb_Reviews": 2,
          "Date": "2023-02-01T17:36:36.000Z",
          "Titre": "I used the humidifier once and then it…",
          "Contenu": "I used the humidifier once and then it stopped working.  I looked up the owners manual online and found it useless.  I tried to get customer support and thus far have not had luck.  I am very disappointed and would like to know why the machine stopped working right away, after one day of use, and I would like help in fixing the problem"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "LAURA SCHMIDT",
          "Nb_Reviews": 2,
          "Date": "2023-04-28T20:06:09.000Z",
          "Titre": "My shipment was received damaged",
          "Contenu": "My shipment was received damaged. There was some kind of noxious liquid all over the box and inside the box. It burned my skin. The box was placed inside a FedEx box. The filters weren't in separate boxes like they usually are when I order them. I don't want to put these in my air purifier because it might contaminate my rooms and my air purifier. I spent $350 for something I will have to throw in the trash."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Judy Brown",
          "Nb_Reviews": 2,
          "Date": "2023-04-07T16:10:46.000Z",
          "Titre": "I just called Customer Service and they…",
          "Contenu": "I just called Customer Service and they had stated they have no such order of mine and I am very troubled by it. I’ve had the hardest time ordering this product and getting answers. I’ve got three different phone numbers and I am interested in clarifying this situation and finding out if you’ve got my order, and if it’s been sent out because the young man said, he sees no such order of mine, with my information that I gave them."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Marianne Auger",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T21:05:45.000Z",
          "Titre": "Surprise fees to receive item from Canada Post",
          "Contenu": "It isn't appreciated that I receive the shipment with a charge of $15.47 for Canada Post. Why isn't that covered in the initial payment to Oasis?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brittany A",
          "Nb_Reviews": 1,
          "Date": "2022-12-29T13:47:24.000Z",
          "Titre": "Humidifiers broke within a week :(",
          "Contenu": "I wanted to love this product! The design is so sleek and beautiful. But both of my humidifiers have become broken within a week or two of purchasing. I only used distilled water in my humidifiers, with no essential oils. I would let the humidifiers run for 2-4 hours at a time. After ONE use, the left valve on the first humidifier stopped releasing steam. By the second use, both valves stopped, and now it’s completely useless.The second humidifier lasted for about 2 weeks. And again- first one valve stopped working, then both valves.So now I have 2 night lights lol. I’m about to contact the company for a refund, and hopefully they have good customer support!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stephen Fredeking",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T01:14:50.000Z",
          "Titre": "I tried to put in the discount code…",
          "Contenu": "I tried to put in the discount code from my doctor for a particular illness, and the system didn’t catch it. So I contacted customer service and asked them to correct it the same day. They pretty much told me to go pound sand twice and that the system wasn’t gonna allow me to do that so I canceled my order and re-ordered it and put the discount code in and it took it so the customer service rep lied to me twice and that gives me zero confidence in their ability we will see how the product turns out as I have two of its competitors ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lynne Liebling",
          "Nb_Reviews": 1,
          "Date": "2023-02-07T02:49:28.000Z",
          "Titre": "Poor customer service",
          "Contenu": "There is a loud grating sound when I turn the purifier on now that I have installed the replacement part.  The structure of my purifier looks slightly different than the picture in the video instructions.  Perhaps the purifier was re engineered since I purchased mine over 5 years ago.  I sent an email to the representative a week ago, and tried to call but have received no response."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Charles Couvillion",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T23:25:56.000Z",
          "Titre": "The bulb burned out after only 2 days…",
          "Contenu": "The bulb burned out after only 2 days of use. This happened 3 years ago when I bought the last bulb. The replacement process is very difficult so I’m buying another brand."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cheryl Glodowski",
          "Nb_Reviews": 9,
          "Date": "2022-12-12T06:04:03.000Z",
          "Titre": "Terrible Customer Service.",
          "Contenu": "I have no complaints about my purchase per se, however, when a couple of weeks later, the price was cut, I sent a message asking if I could possibly receive the difference since I am on a very tight income and am paying for the one I purchased over time.  My Nurse Practitioner highly recommended your company as the best.  However, I am extremely disappointed in your company.  I have not had ANY response whatsoever.  My request has been completely ignored.  I will NEVER order from your company again, will let my NP know about your lack of customer service, and will tell everyone I know not to order from you.  This is not the way to run a business."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "david strange",
          "Nb_Reviews": 2,
          "Date": "2022-10-28T18:48:11.000Z",
          "Titre": "No ability to test units???",
          "Contenu": "Stopped by the home office to ask about replacement parts.  Since my unit was only 1 year old, I was told no replacement parts were necessary.I then inquired about testing my unit to see if it was working properly.Was informed there was no ability to see if it was working properly, but that they had incredible quality standards and I could be assured it was fine.No ability to test to see if it was working properly, very disappointed to hear.How do they know when they test a unit??Not impressed with customer service at this point."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Patricia Hildebrandt",
          "Nb_Reviews": 1,
          "Date": "2023-09-17T19:19:51.000Z",
          "Titre": "It was awful",
          "Contenu": "It was awful.  I ordered the only item on your website that looked like the cell in my air purifier.  It was the wrong one.  How do I order the correct on if it does not appear on your website?  How do I return this wrong cell?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Deborah Garrison",
          "Nb_Reviews": 1,
          "Date": "2022-12-21T00:50:39.000Z",
          "Titre": "It broke the third night we used it",
          "Contenu": "It broke the third night we used it. Just stopped working. No way to address what was wrong because the online instructions don’t have a FAQ of any real consequence. Also those stupid LED lights came on randomly throughout the night, startling as heck. Bad product, zero stars"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Seth",
          "Nb_Reviews": 2,
          "Date": "2023-06-02T05:05:21.000Z",
          "Titre": "Just a crappy site, with lots of useless garbage",
          "Contenu": "Registration for your site is clunky… Instead providing me a tracking number with purchase confirmation I receive an asinine survey..  Next time follow these easy steps.  1) make registering before we purchase easier  2) after our purchase is confirmed with the tracking number maybe send a email to an email account for the manager of customer service so they can stop issues from becoming problems  3) Wait too release any stupid self serving survey: Ask a review only after the customer has received their order and they are satisfied Sending a stupid self serving survey an expecting to be told how wonderful? Fat chance..My expedited order is a day late.  I paid extra and while I can swam with 1 day having no way to track means I am up a creek with no paddle or i going up be faced with a wasting more time contacting your company trying to find where the companies brain trust sent my package"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Patricia",
          "Nb_Reviews": 2,
          "Date": "2022-10-25T01:56:50.000Z",
          "Titre": "Wi-Fi doesn’t work snd system doesn’t work either",
          "Contenu": "Wi-Fi doesn’t work. Talked with technician who was suggested by Supervisor. He could get Wi-Fi to work. Sensors don’t work. Tech even had me spray aerosol near vent and machine never changed setting."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Meredith W.",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T01:18:42.000Z",
          "Titre": "Terrible customer service",
          "Contenu": "Terrible customer service. Took over s month to receive when after I purchased the air filter, it said it’s take 5-10 business days. No one reached out to me. After a month went by, I had to reach out and they gave so many excuses. Today, after I emailed many times for an update, and they finally shipped it. I asked to be compensated after a MONTH of no answer or product in mind hands. All they gave me was a coupon for a free filter. Let’s hope the product was worth the long wait."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mamakin",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T21:27:25.000Z",
          "Titre": "On website it said turn around in 1-3…",
          "Contenu": "On website it said turn around in 1-3 days. nothing- no emails. i called after 7 days and CS told me it was shipping out in 3 more days. Full of excuses about the volume of labor day sale. I canceled and purchased on amazon- it arrived the second day."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Matt S.",
          "Nb_Reviews": 1,
          "Date": "2023-05-13T21:11:31.000Z",
          "Titre": "Sizing claims are misleading/support could be better",
          "Contenu": "Sizing claims are misleading (only 2 ACH).   Poor communication from support.5/13/23 update: I confirmed today that the refund was credited to my credit card on 5/11. A seven day turnaround isn't terrible, but some communication along the way would've been reassuring."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sarah Case",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T17:47:06.000Z",
          "Titre": "I a shipping delay notification four…",
          "Contenu": "I a shipping delay notification four days ago and have received zero updates or customer support since. Not a good look for a first purchase of a very expensive air purifier"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "LUCAS WRIGHT",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T20:25:27.000Z",
          "Titre": "Respond to emails at customer service",
          "Contenu": "Respond to emails at customer service. Send a reliable product that isn’t broken.  When you spend this much on an air purifier it should work. Fan stuck on."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alan Jones",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T19:59:24.000Z",
          "Titre": "Avoid this product",
          "Contenu": "Avoid this product.  Our unit worked fine for about a year, then we replaced the $150 bulb/cell, and after a couple months, it started giving off a burning smell ... bad enough that my wife unplugged it for fear that it would catch fire.  Bulb just out of warranty, so that was a bunch of money wasted."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gary Carter",
          "Nb_Reviews": 2,
          "Date": "2023-06-17T00:42:59.000Z",
          "Titre": "was delivered to some other house",
          "Contenu": "was delivered to some other house, Sat outside for days in the bad weather. The filters that cost me big dollars did not need this"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kristina",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T00:43:05.000Z",
          "Titre": "Terrible product/service",
          "Contenu": "Wifi automatically enabled is not healthy.  I am not out $350 as return shipping is not covered so I have to try and sell it on craigslist.  Terrible service!  Do not recommend."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeffrey Wisz",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T22:48:30.000Z",
          "Titre": "I paid a fortune for shipping",
          "Contenu": "I paid a fortune for shipping.  Get serious.  You could have mailed us from a drop box faster and I paid extra for this to show up a week later.  Come on. Seriously."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shawn  G.",
          "Nb_Reviews": 4,
          "Date": "2023-01-23T22:27:15.000Z",
          "Titre": "The humidifier arrived fairly promptly",
          "Contenu": "The humidifier arrived fairly promptly, however, the OCR link to the operating instructions did not work. I contacted AirOasis for help and help was rendered awkwardly and in a manner that was time consuming and not remotely helpful.  Quite simply, the unit is poorly designed in that the output of humidity sabotages its operating this ruining the unit.  I returned the unit and purchased another brand which had detailed instructions, worked perfectly immediately, and has functioned optimally ever since."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert McBrayer",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T18:00:07.000Z",
          "Titre": "You have not yet shipped my order",
          "Contenu": "You have not yet shipped my order, but you changed me for it 2 weeks ago."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "unhappy customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T22:43:36.000Z",
          "Titre": "Great product - HORRIBLE CUSTOMER SERVICE",
          "Contenu": "Great product; HORRIBLE customer service.  Have spoken with two \"managers\" since December and followed through with their request to send a follow up email.... HAVE NOT GOTTEN ANY ACTION OR EVEN THE COURTESY OF A RESPONSE SINCE DECEMBER.  My small unit cracked and should be replaced.  They charged me full price on a small and large unit and the very next day they both went on buy one get one - they refuse to even put any credit on my account towards replacement filters or honor anything I was told.  HORRIBLE follow up.  HORRIBLE communication.  Too bad - GREAT products but this company will not survive it they continue to treat all of their customers only as the source of their cash flow,.The response from their customer service team (below) is not only untruthful but ridiculous. There were calls made AND emails sent… I was asked to send an email specifically with the pictures because the product was faulty…and broke when moved.   Aside from that I should’ve received, at very least, an email response back from Bryson your manager… Or the manager before him …who was equally as unhelpful and did not follow through. At very least some sort of goodwill gesture should have been extended for replacement filters given all the circumstances around this file… Of which only very few have been detailed in the above review - I stuck to the main points.  In addition, it is untruthful that I was told the product wouldn’t be under warranty… If that was the case why was I asked specifically to send pictures? Very irresponsible, no regard for customers, zero follow-through, terrible customer service and appreciation for your customers… As seen by other reviews with similar experiences  to mine"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Terry",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T15:04:47.000Z",
          "Titre": "BAD HUMIDIFIER",
          "Contenu": "Bought humidifier very low amount cool mist comes out on any setting. Very disappointed. Low quality"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lesley J. Sieren",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T22:58:33.000Z",
          "Titre": "Don't know",
          "Contenu": "Don't know!  I ordered it on Sept 25 and have not received it yet. Today is Oct. 11.  Never took this long before."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Matthias Eckert c/o Lignotrend",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T08:31:13.000Z",
          "Titre": "Miserable support",
          "Contenu": "Miserable support. I asked already 4 times for a proper invoice."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Case",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T17:53:41.000Z",
          "Titre": "You never responded to my email."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Mark LeGassick",
          "Nb_Reviews": 3,
          "Date": "2022-03-30T13:56:19.000Z",
          "Titre": "International buyers beware!",
          "Contenu": "International buyers beware!The filter works fine for a couple of years but then you need to replace the cell is around $170 CAD but shipping internationally even though it’s the size of a spark plug is $120. So buy this filter you have a bi-annual maintenance cost of just over $300.  Completely ridiculous.  Throwing it out and buying a local brand"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Page Binkley",
          "Nb_Reviews": 1,
          "Date": "2022-04-27T04:28:13.804Z",
          "Titre": "I purchased a unit expecting it to be…",
          "Contenu": "I purchased a unit expecting it to be shipped with in a day and delivered with in 7 to 10 days. It was not shipped after two weeks I called and was told it might be in inventory in 10 days I called and found the unit will be in the middle of May. I'm sorry to have to write this email in this manner."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "craig zimpel",
          "Nb_Reviews": 1,
          "Date": "2022-04-12T13:47:37.000Z",
          "Titre": "i have not received my unit",
          "Contenu": "i have not received my unit, going on two weeks since purchase. sent email asking when to expect, they emailed me the next day with no answer, but to say sometime this month. I would strongly suggest not charging customer until product is shipped, as it stands now. it's paid for and i have nothing. 4/12/2022"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kay",
          "Nb_Reviews": 1,
          "Date": "2022-01-22T13:24:24.000Z",
          "Titre": "SCAM! Never shipped.",
          "Contenu": "I placed an order about 3 months ago and the order has still not shipped. I have tried contacting the company several times but have gotten no response. I am at a loss for what to do as I just spent 300 dollars and am now without any sort of information on where my product is. These are not inexpensive products! I truly just want my product or a refund and am at a loss as what to do next."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Melissa Coleman",
          "Nb_Reviews": 1,
          "Date": "2022-04-18T21:34:27.000Z",
          "Titre": "I installed the new UV cell I ordered…",
          "Contenu": "I installed the new UV cell I ordered and my purifiers is still beeping continuously.  I sent a Facebook message in messenger to your company and never heard back.  So currently, my air purifier with my brand new $120 uv cell is a paper weight on my dining room table!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ibrahim Rahman",
          "Nb_Reviews": 1,
          "Date": "2022-07-27T19:39:51.000Z",
          "Titre": "The newer design AO3000XG3 with the…",
          "Contenu": "The newer design AO3000XG3 with the reset switch are a poor design. After two years and then replacing the expensive lamps they would not reset. Had no problem with the older design with the fuse."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mary-Elizabeth Briscoe",
          "Nb_Reviews": 1,
          "Date": "2022-01-28T13:55:56.000Z",
          "Titre": "The customer service was less than…customer service",
          "Contenu": "The customer service was less than ideal when I needed to make a return. The online form did not work and after several attempts and several emails and calls I finally was able to do a chat with someone that offered gift card. That took a week. Very disappointing because otherwise I love the products."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "N. O.",
          "Nb_Reviews": 1,
          "Date": "2021-08-16T22:58:10.000Z",
          "Titre": "I was super excited for this air…",
          "Contenu": "I was super excited for this air purifier and read all instructions about how to most efficiently use. My issue is not with the device so far, but with the app. In order to run it in smart mode and use it as it states is it’s intention and most efficiently you must set up the app. The app has constant errors and has not allowed me to register my “place or new device”"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joy Butler",
          "Nb_Reviews": 4,
          "Date": "2021-07-29T18:06:37.000Z",
          "Titre": "Untrustworthy customer service.",
          "Contenu": "This company does not treat their customers with care.  They make promises and then find excuses not to keep them.  I have been a customer with Air Oasis for a long time.  Currently, dealing with them was awful as promises were not kept regarding a discount for a very expensive order.  It seems that they have not learned the importance of keeping their customers feeling good about dealing with them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "J R Lowder",
          "Nb_Reviews": 1,
          "Date": "2021-09-03T15:47:59.000Z",
          "Titre": "Unfortunately",
          "Contenu": "Unfortunately, the new tube was installed by a technical party, but it still does not work, even though the fan willwork when plugged in.Careful instructions were followed from installation instructions printed out.So it does not look good at this time, unless the bulb proves to be defective.  What do you suggest?Jack Lowder"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "W Wyk",
          "Nb_Reviews": 4,
          "Date": "2021-11-27T18:50:27.000Z",
          "Titre": "All 3 Units are broken after 2 years of…",
          "Contenu": "All 3 Units are broken after 2 years of use. The filters are overly priced and never arrives on time. Always delayed by months. The systems will turn on and off consistently. Bought the Mela Air for all my rooms and wow. What a difference. Took these expensive units to the garbage. Never again!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eli wheeler",
          "Nb_Reviews": 3,
          "Date": "2021-05-05T20:28:25.000Z",
          "Titre": "I do not recommend",
          "Contenu": "I do not recommend. I just ordered the adapt air. I meant to order two, and upon realizing my mistake, within hours, I tried to correct my order but they refused and will only offer me another unit at full price ( they offered a 10% discount you can get elsewhere). Now instead of bragging to everyone how well it works, I'll be making sure everyone I know steers clear from the company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Tuttle",
          "Nb_Reviews": 1,
          "Date": "2021-05-03T22:01:52.000Z",
          "Titre": "I couldn't  get  your system to…",
          "Contenu": "I couldn't  get  your system to work--it wouldn't  take my credit card number. Your system did allow me to send a message--which I won't  repeat. Got your phone number and placed an order with a very nice lady. Got the product. All is well that ends well."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cherry Freiwald",
          "Nb_Reviews": 1,
          "Date": "2022-02-23T20:31:50.000Z",
          "Titre": "I have yet to review the replacement…",
          "Contenu": "I have yet to review the replacement filters I ordered at the end of January and have not received any shipping updates. It’s been over 3 weeks and I would hope for more information by now. ThanksCherry Freiwald"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Harriet McCoy",
          "Nb_Reviews": 6,
          "Date": "2021-09-09T16:30:24.000Z",
          "Titre": "Just bought a new filter and installed…",
          "Contenu": "Just bought a new filter and installed it, but it keeps showing it needs a new filter.  I also can't shut off the constant running on high, even though all the other filters show there is no air pollution, including the identical match."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MM",
          "Nb_Reviews": 1,
          "Date": "2021-09-23T20:30:35.000Z",
          "Titre": "tldr: they sold a bulb that will not work in my filter",
          "Contenu": "Have an older air filter. Asked what product I needed to replace it. I purchased the recommended product. Tried to install. It did not work. Followed directions and tried again. Did not work. Emailed Cust Service. They gave me the same instruction and told me to try again. Didn't work.  Emailed a final time, restating all the same info, including the serial number, they responded my air filter cannot get a replacement bulb. Why didn't they tell me this when I originally contacted them (or the many times after that). Annoying and frustrating. Now I have a bulb I need to return (more time and energy wasted) and an air filter that doesn't work (not sure why they won't sell a replacement bulb)"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nicole Beebe",
          "Nb_Reviews": 1,
          "Date": "2022-10-28T00:25:31.000Z",
          "Titre": "The larger more expensive air filter…",
          "Contenu": "The larger more expensive air filter isnt working"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joseph Margolis Sr.",
          "Nb_Reviews": 1,
          "Date": "2022-04-13T20:02:14.000Z",
          "Titre": "As an independent Rep",
          "Contenu": "As an independent Rep, we were all thrown under the bus. Lied to. I would never have anything to do with this company again. Can't stand the Vice President of Air Oasis."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lee",
          "Nb_Reviews": 1,
          "Date": "2022-07-06T06:53:18.000Z",
          "Titre": "Not what i was hoping for",
          "Contenu": "Unit arrived fairly quickly. I was excited to use it. After setting it up in my room and letting in run for an hr or so i came back to notice that it had been putting off a fairly distinct toxic, slight burning smell. I found this to be fairly irritating to my system. I turned it off and left it for a while thinking maybe it was just the fan burning a little bit of off gassing, but even later when i turned it on within second the same smell was produced and again i found it irritating to my lungs. Even though they are a hard sell on having no Ozone it is not zero. So perhaps in this case there is something happening here that is causing this reaction, this smell. I can't say exactly what. Either it is off-gassing, producing ozone, electrical burning smell from the fan or something else i'm not aware of. All this to say i was quite disappointed and am now very skeptical to the Polar-ionization technology being as clean as they mention"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MountainTime",
          "Nb_Reviews": 4,
          "Date": "2021-09-09T20:27:41.000Z",
          "Titre": "I have five Air Oasis machines",
          "Contenu": "I have five Air Oasis machines. They only make the replacement parts for two of them. This is a distinct lack of integrity. Their suggestion? Buy new ones!! Yeah, I don't think so."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Glen March",
          "Nb_Reviews": 1,
          "Date": "2021-12-11T20:42:04.000Z",
          "Titre": "So the unit’s air quality is second to…",
          "Contenu": "So the unit’s air quality is second to none.  The build quality is just poor and flimsy.  The unit is narrow and tall, the base itself to give it stability is about twice the footprint, held to the main tower with very small screws into feeble plastic.  Under the slightest of torque the plastic will break (as mine has) and they will not cover it under warranty (trust me I have tried). Please note I have a strong mold allergy and have tried many air purifiers.  For example this has better air quality than the Allen pure units but my Allen pure units are like a sherman tank, they have a strong firm base and do not break at the slightest twist on the base.  I would expect for around $600 for the unit to have a MUCH sturdier build.I say do NOT buy this unit, wait for version 2.0 where they hopefully have built the same purifying tech into a much sturdier container."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "KEVIN KELLEY",
          "Nb_Reviews": 1,
          "Date": "2021-05-26T19:11:25.000Z",
          "Titre": "Too expensive for the replacement…",
          "Contenu": "Too expensive for the replacement filter, $99.  Then we got our credit card number was stolen, either by the website, or by someone at Air Oasis."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Lorelei Boyce",
          "Nb_Reviews": 1,
          "Date": "2022-07-12T21:55:20.000Z",
          "Titre": "cheapest shipping option was…",
          "Contenu": "cheapest shipping option was $195.00!!!! Would not recommend your air filtration simply because of this"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "George Hallman",
          "Nb_Reviews": 1,
          "Date": "2022-08-24T00:50:20.000Z",
          "Titre": "Haven’t received product yet",
          "Contenu": "Haven’t received product yet.  I did however get this review?George Hallman"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lora",
          "Nb_Reviews": 1,
          "Date": "2022-02-17T20:24:46.000Z",
          "Titre": "Replacement cell seems to be defective…",
          "Contenu": "Replacement cell seems to be defective and attempts to contact support have gone unanswered."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "T Dau",
          "Nb_Reviews": 1,
          "Date": "2022-01-30T19:22:41.000Z",
          "Titre": "Order has not shipped",
          "Contenu": "This item was ordered on 1/20/22 and still has not shipped.Order #WEB-44125"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Larry Gering",
          "Nb_Reviews": 1,
          "Date": "2021-10-22T12:24:59.000Z",
          "Titre": "Your products ridiculously priced",
          "Contenu": "Your products are ridiculously priced. No need to reply to me with some BS excuse"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Frank Fava",
          "Nb_Reviews": 1,
          "Date": "2021-08-03T01:45:16.000Z",
          "Titre": "I didn’t receive my filter yet",
          "Contenu": "I didn’t receive my filter yet. So until I receive it I’ll give you a one star"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Matt DiDonato",
          "Nb_Reviews": 2,
          "Date": "2022-07-12T23:58:46.000Z",
          "Titre": "Replaced the cell as instructed and…",
          "Contenu": "Replaced the cell as instructed and still does not work"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sandra Bubb",
          "Nb_Reviews": 1,
          "Date": "2021-07-14T12:22:35.000Z",
          "Titre": "Cute but not usable",
          "Contenu": "Cute but not usable. Fan is not powerful enough.  Don't bother buying."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "M Hart",
          "Nb_Reviews": 1,
          "Date": "2022-04-27T11:55:42.000Z",
          "Titre": "Many shortfalls",
          "Contenu": "The unit has very limited control. It operates when it wants to and there is no ability for the user to override the automatic features. It should allow the user to simply turn the unit on or off and set a desired fan speed. It does not allow thus fundamental feature. The app is completely useless. It does not provide real-time status of the unit so when you're travelling you cannot tell what mode it is operating in or that it is operating at all. The child lock is also useless. You can activate the child lock at bedtime, but sometime during the night, the lock will always turn itself off. The control panel will then illuminate your bedroom and change fan speeds depending on what it appears to sense in the air even though the app says air quality is at its best. So the relatively quiet, low speed fan becomes a louder medium to high speed fan. This madenling misfunction does not make for a good night's sleep. There needs to be a bedtime mode or manual mode where the fan speed will never go above low. Lastly, the scheduler function is inadequate. You can set multiple periods for the unit to operate, but typically the unit may turn on at the scheduled time (most of the time), but it hardly ever shuts off when scheduled. Even when it does shut off, it often will turn itself back on at a time for which it is not scheduled to operate. This and the other deficiencies already mentioned essentially eliminates all user flexibility for controlling the operation of the unit. So the bottom line is that the unit probably does a decent job at cleaning indoor air, but do not expect any ability to manually control the unit in any substantial way. I understand changes are in development, but frankly this system is not ready for distribution and should not have been sold in its current limited capacity."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sandy Green",
          "Nb_Reviews": 1,
          "Date": "2022-01-01T15:00:23.000Z",
          "Titre": "I can tell zero difference in the air…",
          "Contenu": "I can tell zero difference in the air quality in my home"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William COOPER",
          "Nb_Reviews": 1,
          "Date": "2023-07-15T15:12:34.000Z",
          "Titre": "Customer service never responded"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "OLU A",
          "Nb_Reviews": 3,
          "Date": "2022-02-11T21:54:26.000Z",
          "Titre": "After sale support is non existent"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Wendy Bysha",
          "Nb_Reviews": 2,
          "Date": "2022-06-05T01:07:15.000Z",
          "Titre": "Do your research",
          "Contenu": "do your research"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dan Bredeweg",
          "Nb_Reviews": 1,
          "Date": "2021-09-06T22:00:48.000Z",
          "Titre": "Have not received it yet"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "S Hutten",
          "Nb_Reviews": 1,
          "Date": "2022-01-28T23:35:03.000Z",
          "Titre": "Never arrived"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Sean Doherty",
          "Nb_Reviews": 1,
          "Date": "2022-02-24T13:44:53.000Z",
          "Titre": "Useless $hit"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "steve gerke",
          "Nb_Reviews": 1,
          "Date": "2021-12-25T23:44:50.000Z",
          "Titre": "Does nothing!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert Seibel",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T03:41:59.000Z",
          "Titre": "Products good, website really bad",
          "Contenu": "The website displayed jumbled pages on both Firefox and Chrome. Adding an address through My Account was impossible due to display problems.A few days after completing an order (confirmed and shipped), when selecting another item to purchase all the previously purchased items were still in the cart. PayPal was not offered as a payment method."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gary Peterson",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T21:41:42.000Z",
          "Titre": "I ordered the wrong replacement filter",
          "Contenu": "I ordered the wrong replacement filter.  Replacement filters are not labeled by product number or anything so you have no real clue whether your getting the right filter or not.  I emailed Air Oasis two day ago about returning the wrong filter and still haven't heard back!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "rebecca foster",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T22:28:33.000Z",
          "Titre": "I had to phone two times to get someone…",
          "Contenu": "I had to phone two times to get someone to help me.  Also, some of us are used to replacing AIR FILTERS, the term: CELL can be confusing to those of us in America who have Learning Different Styles."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Heather Andersen",
          "Nb_Reviews": 3,
          "Date": "2023-05-12T15:06:12.000Z",
          "Titre": "Don't know if it cleans the air but don't expect to connect to wifi",
          "Contenu": "I can't speak to how well it cleans the air yet, but connecting to wifi and customer have been terrible so far.  Followed all instructions to connect and nothing. Customer service hours are 8 - 4 central M - Th and 8 - 2 F.  The response to my email asking if there are different instructions because I can't connect using what they provided was \"sorry to hear that. We told IT and hope they'll fix it soon.\""
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ReviewerKing",
          "Nb_Reviews": 2,
          "Date": "2023-01-04T09:38:33.000Z",
          "Titre": "Unreliable",
          "Contenu": "Products unreliable, and when offered a credit over the phone due to defect they have stated they won't honor it unless I can find proof even though the products have a lifetime warranty. How's that work. Clearly shady.Won't provide basic DC adapter information for a product I already own; such as voltage, amperage, and pin polarity which is always listed on the ac/DC wall adapter. Support, warranty,  and products are unreliable. Support is rude at minimum in my opinion as well. How can you trust a company like that?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kay",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T16:15:16.000Z",
          "Titre": "Disappointed",
          "Contenu": "I have air oasis connected to my AC SYSTEM in another home. Works amazing. So I felt confident in buying a floor model for my apartment.  Disappointed that it does not remove cooking odors and doesn’t seem to notice impact of VOCs from lots of new furniture and rugs. Was an expensive unit."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Tad Boniecki",
          "Nb_Reviews": 4,
          "Date": "2023-09-21T14:17:47.000Z",
          "Titre": "I bought a replacement bulb",
          "Contenu": "I bought a replacement bulb. The problem was that the website gave no information about the item. What I wanted is to be told which units the globe is suitable for, its size and some specifications."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robbe Billeri",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T16:19:01.000Z",
          "Titre": "Need to ship sooner",
          "Contenu": "I was able to make the order just fine, but getting the merchandise seems to be a problem. I ordered last Tuesday, the 5th and I am told it will be the middle to late next week before I get the order. I have been ill and need it as soon as possible. I have had to leave my house and wish the order didn’t take over 2 weeks to get here."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mimi",
          "Nb_Reviews": 1,
          "Date": "2022-08-25T22:07:12.000Z",
          "Titre": "A stopgap measure - though quick delivery",
          "Contenu": "I ended up buying replacement filters for 3 of the 5 iAdaptAir units I own. I only got replacement filters for the small units because I discovered that the iAdaptAir units are too wimpy (CADR) for our needs. And I can't afford to replace all of the units at once with higher CADR/quality units. Thus, these small units are an okay fit for bathrooms and the laundry room. The replacement filters arrived fairly quickly. I was able to follow the delivery with tracking and Shopify."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Benjamin Bradburn",
          "Nb_Reviews": 3,
          "Date": "2023-01-09T23:33:29.000Z",
          "Titre": "Not impressed with the quality and…",
          "Contenu": "Not impressed with the quality and particularly durability of these products. If a fan is going to break down within a couple years of purchase then there should be a way to replace just that fan. Instead I have to buy a whole new appliance. I have been a big advocate of your products but can no longer do so in good faith."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 6,
          "Date": "2022-09-06T23:16:54.000Z",
          "Titre": "Plastic and smell lingers - not for chemically sensitive",
          "Contenu": "This is not a filter for you if you have chemical sensitivities - it is all plastic and takes a long time to outgas the exterior. And then the filter has a chemical smell for months and then after that it has an intolerable smell on every setting except plain filter. So not very useful and can only be run when room not in use."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jennie Aguirre-Nodarse",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T18:02:12.000Z",
          "Titre": "Took forever to shipped",
          "Contenu": "Took forever to shipped. It has been a week since ordered and i just requested updates today and it seems u guys had forgotten my order. Order just shipped today after my message."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kb",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T21:46:19.000Z",
          "Titre": "Warranty issue",
          "Contenu": "Warranty issue and was put thru the ringer. Unit was less then 6Months and quit working. We were treated like crooks. Took 2 weeks for the warranty to be issued. I have never been treated like this before. Even after jumpimg thru all their hoops getting The item ordered took 2 more days and i cant tell u how many emails and calls. Unreal"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Concerned consumer",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T18:13:22.000Z",
          "Titre": "People need to be aware of the total…",
          "Contenu": "People need to be aware of the total cost of ownership. Filters are extremely expensive and lights need to be changed on an annual basis"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jm",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T23:21:02.000Z",
          "Titre": "Poor instructions",
          "Contenu": "There was nothing on the filter replacement instructions to hold the button down to make the filter light turn off"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "CT Noreaster",
          "Nb_Reviews": 7,
          "Date": "2023-07-14T18:53:43.000Z",
          "Titre": "Order confirmed 7/4",
          "Contenu": "Order confirmed 7/4. Order shipment notification sent to FedEx 7/12. Was informed by Air Oasis that it would be delivered by 7/14.Delivered 7/14."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sally J",
          "Nb_Reviews": 2,
          "Date": "2022-12-28T22:33:59.000Z",
          "Titre": "The power cord is still warm when…",
          "Contenu": "The power cord is still warm when plugged in. I was sent a replacement cord and then a replacement unit but the power cord is still warm. I don't feel comfortable having it plugged in."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Phil Lockwood",
          "Nb_Reviews": 5,
          "Date": "2022-09-22T14:56:54.000Z",
          "Titre": "Ongoing issues hoping to get resolved",
          "Contenu": "Unfortunately I have several issues with my medium Medium Air Oasis Air Purifiers (1) both units have shut off by themselves (2) smart mode shuts off by itself and settings change also on both units, this happens periodically, I have a running dialogue with Bryson Watkins and he is referring the case to his manager and production team, we will see how this turns out, (to be continued) Personally I do not think they have a clue and my faith in Air Oasis is dwindling; I hope I am wrong. These issues have been occurring since I purchased the units mid April 20229/22/2022  I spoke with Christeen today and we rebooted both air Purifiers hoping this will resolve my issues however she assured me if the issues still persist that they will replace both units. I hope things are resolved, I am thankful for Christeen reaching out and my confidence in Air Oasis is restored"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joseph P. S",
          "Nb_Reviews": 2,
          "Date": "2022-12-13T02:44:34.000Z",
          "Titre": "No wifi",
          "Contenu": "Product seems fine, but can't connect the device via wifi to use the app with my Google phone"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Josh Herr",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T17:30:55.000Z",
          "Titre": "No notice on ship date",
          "Contenu": "No notice on ship date, had to wait multiple weeks"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sherry DILLINGER",
          "Nb_Reviews": 3,
          "Date": "2021-12-26T16:32:43.000Z",
          "Titre": "Doesn't compare to my IQAir",
          "Contenu": "The unit is quiet and lightweight, but it lacks power. I've done a direct comparison to my IQAir, and it is unable to remove odors and clean the air as efficiently. Also don't like that the base unit doesn't have wheels, meaning you have to pick it up every time you want to move it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 6,
          "Date": "2021-12-14T11:05:11.000Z",
          "Titre": "You should consider people with…",
          "Contenu": "You should consider people with multiple chemical sensitivities and the harmful chemicals that your filter off gasses. I almost returned it because the smell that made me sick for about three weeks. If my mold specialist hadn’t referred this I wouldn’t have tried that long. Now I fear any replacements filters will cause the same problem. It seems inconsistent with an air filter company’s mission to cause its own voc problem. Please make a filter without this problem. And dimmable lights since they light the room at night."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Paulette Bjorneboe",
          "Nb_Reviews": 1,
          "Date": "2022-05-11T20:14:40.000Z",
          "Titre": "Hi there Im still waiting on medium…",
          "Contenu": "Hi there Im still waiting on medium relacement cartridges ordered last year I got the small and large but no medium. I was notified they were in but no cartridges. Please get them shipped to me asap.  Thank you, Paulette"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "AT",
          "Nb_Reviews": 1,
          "Date": "2021-08-30T21:48:17.000Z",
          "Titre": "I bought the large size iAdapt Air at…",
          "Contenu": "I bought the large size iAdapt Air at the end of 2019 (less than 2 years ago) and purchased a second one this week (Aug 2021). I put the two purifiers side by side and the newest purifiers use cheaper materials. The grated vents going down the entire front of the purifier are of cheap quality along with some of the inside parts.  I am so happy with the original and have to admit was disappointed to open the box and see Air Oasis has downgraded with cheaper materials for the same product at the same price.  At least lower the price."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Patricia Frank",
          "Nb_Reviews": 1,
          "Date": "2021-10-12T22:46:16.000Z",
          "Titre": "My doctor recommended this.",
          "Contenu": "My doctor recommended this air purifier. However, the smell it puts out is offensive & I can't use it much. If I use it I turn it on when I go out, then burn an odor removing candle when I get home.  I'm disappointed."
        },
        {
          "Note": 2,
          "Lieu": "CN",
          "Pseudo": "Olga Acosta Haberland",
          "Nb_Reviews": 2,
          "Date": "2022-01-06T22:04:20.000Z",
          "Titre": "They were nice and responsive but not a positive outcome",
          "Contenu": "They were nice and responsive , I have two nano systems in my house , they seem to work well . I was unaware of how expensive the parts that need to be replaced every two years are . I bought two last week and a few days later received a 30% Promotional email. I asked if it could be applied to my purchase over $400 , they said not possible only a credit for future purchases (which I won’t do for two years ) otherwise I would have to return , pay for return , wait 14 days and then purchase again before tomorrow to take advantage of the promo.  It just doesn’t seem right , frankly I will Be exploring other systems. The customer service person was polite and responsive , unfortunately not the right outcome"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert Bright",
          "Nb_Reviews": 4,
          "Date": "2021-09-15T19:08:02.000Z",
          "Titre": "The product is superior",
          "Contenu": "The product is superior! I love AirOasis and trust them completely. I was very unhappy with choice of FedEx to deliver this fourth order of mine. I paid full price for the service and was contacted by FEDEX that it would be delivered not latter than a thursday at 430pm. I sat outside waiting for them for two hours and gave up. No notice was sent until latter that the order was delayed.The next day was questionable when it would arrive, I called Fedex to arrange that they call me from a note I left on the door, or asked them to leave the package. They claimed no delivery without a signature. I think if the customer asks whoever the delivery company is the people I brought the product from should make concessions.Again, I love the seven large air cleaners and trust Air Oasis completely. I think a new deliver option should be arranged next time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Adarion Mahone",
          "Nb_Reviews": 1,
          "Date": "2021-10-09T05:56:48.000Z",
          "Titre": "It literally doing nothing",
          "Contenu": "It literally doing nothing. Nothing has changed. Maybe if you can afford to buy multiple. I don’t see the point."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ryan Carpenter",
          "Nb_Reviews": 1,
          "Date": "2021-08-20T19:06:28.000Z",
          "Titre": "Replacement part may be fine , but",
          "Contenu": "Replacement part may be fine , but , no way to tell . Directions say to hit reset button once installed . Even has 3 nice pics showing reset button locations for various models and the time frames they were built.  Mine has no reset button anywhere . One this gets resolved , or otherwise , I can update this review . I don’t think it will take much to get it to a 5-star review , time will tell ,…    Well , it’s update time .   The unit is too old to be covered under warranty and the replacement parts won’t work on this “older model” , but good news,…  all units are on sale this month !!!!  😏 I don’t know if these things are worth every penny or not worth a bent nickel as far as doing the job they claim to do , but I do know they are very expensive . When it comes to replacement parts needed at $120 ea. ever 2 years , I feel they are closer to the bent nickel value . I’ve been trying to repair these again , (been about 2 years since last time) for friends. Kinda stinks to go through all the haste only to find out that it’s nothing more than a terrible boat anchor . The costumer service is pretty good , fast actually , and pleasant as well . The product durability/lifespan is weak .  Not a fan for the long haul of these ."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Uhno",
          "Nb_Reviews": 1,
          "Date": "2022-08-02T01:44:15.000Z",
          "Titre": "Does not offer replacement parts",
          "Contenu": "Does not offer replacement parts.  Refused to help."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dalia Torres",
          "Nb_Reviews": 1,
          "Date": "2021-06-20T16:00:10.000Z",
          "Titre": "Honestly not worth the price..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Karol Josef de la Cerna",
          "Nb_Reviews": 1,
          "Date": "2021-09-07T16:13:42.000Z",
          "Titre": "Wifi not working"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Till",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T02:52:33.000Z",
          "Titre": "Your system never gave me a 10%…",
          "Contenu": "Your system was going to give me a 10% coupon signed up with my email and it never did, so I had to go online and find one to get the discount. I wasn’t too happy about taking all the time to get it. Otherwise, the filter order experience was OK"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert Hammond",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T16:20:44.000Z",
          "Titre": "Delivery of a medium sized filter has…",
          "Contenu": "Delivery of a medium sized filter has been a problem and the app for controlling a small unit we got does not seem to work."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tanya",
          "Nb_Reviews": 2,
          "Date": "2023-11-02T19:01:31.000Z",
          "Titre": "I love the way my diffuser looks",
          "Contenu": "I love the way my diffuser looks, however,, I am disappointed at the amount of aroma it dispenses. I expected it with the size of the diffuser for it to put out mor of a strong scent. I had to put more oil in my water, which made me go through my oil in no time. I went to another oil that wasn’t Oasis brand and that helped some. I give it a ⭐️⭐️⭐️. Sincerely, Tanya Plepla"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 6,
          "Date": "2023-10-07T00:22:10.000Z",
          "Titre": "Needs a pre-filter",
          "Contenu": "The filters need to be changed much more frequently than other similar air purifiers I have. I think one reason is they do not use even the most basic pre-filter and the intake is directly to the HEPA. This makes it fill up with just household dust rapidly. A pre-filter would save a lot of money like it does on every other machine I have and seen no matter how inexpensive the machine. It seems the only reason is to sell more filters? Also if you are chemically sensitive (one reason for a filter) the materials used to manufacture the filters outgas and have VOC's so they require 5-14 days of detoxing before I can even be in the same room as the filter. Why not use safe non-voc etc for a filter that is to clean the air?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jerry Davis",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T17:59:30.000Z",
          "Titre": "Ordered filters Sunday 6/18",
          "Contenu": "Ordered filters Sunday 6/18.  Monday was holiday.  Got confirmation email re: ready for shipment 6/26.  Your website states orders are usually shipped in three business days.I like the unit a lot.  Found waiting for response re: order excessive."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert Diehl",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T02:45:19.000Z",
          "Titre": "I've just felt as though I'm out of the loop.",
          "Contenu": "Looked at your products for months.  Wanted something that didn't need filters.  This one does need parts ( light ) replaced every couple years.  Clean air is important to me. The purifier being used currently is a Honeywell with uv and an electrostatic charged set of filters I just vacuum to clean. Hoping your product performs well.After placing my order there was no communication from you until this email to rate my shopping experience.  I am not aware if my product has shipped.  Have not received an expected date or tracking number.  I just am not in the loop.   Sorry."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 6,
          "Date": "2023-04-06T00:12:05.000Z",
          "Titre": "Extremely slow processing and shipping",
          "Contenu": "Shopping was fairly easy however, processing and shipping are exceedingly slow as it's been four days since purchase and the order hasn't even shipped. This is not standard in the current market and very poor service especially for such a high priced item."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "sally creswell",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T04:37:51.000Z",
          "Titre": "Customer service fine - on line web no!!",
          "Contenu": "Customer service was very good. I did rate him a plus.  The web site was the problem , three weeks ago , and I put off contacting , calling , on memorial weekend , as thought you would be closed. I had sent several messages to customer service  via e mail during that time. It was about your ad with 59 percent discount, no longer Valid. He gave me a 10 %. But that was all he could do. I have a flood problem with mold and fungus and really needed something. ."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joseph Rocco",
          "Nb_Reviews": 3,
          "Date": "2022-08-30T07:07:04.000Z",
          "Titre": "Been doing business with this company…",
          "Contenu": "Been doing business with this company for years, past few years they keep changing their web site, virtually impossible to log in as a contractor after change up. Virtually impossible to speak to anyone however when you do the seem to be able to rectify the situation. Just a major inconvenience when your trying to run a business, takes hours if not days to correspond with them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carol",
          "Nb_Reviews": 1,
          "Date": "2022-12-23T19:50:41.000Z",
          "Titre": "Air Oasis Filter Prices",
          "Contenu": "My dislike concerning air oasis is the machines are expensive and honestly worth the money; although, the filters are \"very\" expensive. It would be nice if you would lower the price of the filters, without compromising the quality.Thank you,Carol / Michigan"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "carol king",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T22:14:25.000Z",
          "Titre": "Even on sale they are way too pricey",
          "Contenu": "I haven't replaced my filter for years because you guys price them so ridiculously high! Even on sale I could barely afford to get 2 of them.  It's just completely unnecessary to overcharge that much cause I know that you're cost in having those maids got to be less than 5 or $10 at most.  Price gouging your own customers just hurts your sales because I would have bought 6 or 7 having by now for as long as I've hadthisunit but I've Only  purchased 2.   Do the math!!  If they were 20 bucks each still giving you nice profit, i would have spent 140 with you.  Instead i spent 60 for 2 of them on sale.   Lets say your cost is $7. Your profit at a reasonable 20 would have been $91.  As it turns out, your profit from my purchases was only $46.   you're better off pricing them reasonably in having your customers by them more often.   Why doesn't anybody do the math anymore!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Teresa Rusaw",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T15:52:37.000Z",
          "Titre": "There is no instruction Manuel or…",
          "Contenu": "There is no instruction Manuel or paper. Not sure if it's working/doing as stated.Requested this info, no response. Wanted to buy another, larger unit, but not sure if this is the right one for my family"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "GREGORY SALWEI",
          "Nb_Reviews": 1,
          "Date": "2023-02-17T00:18:22.000Z",
          "Titre": "Replacement cartridge not working",
          "Contenu": "This would have been the second replacement cartridge for my unit.  Had no problem with the first replacement, but when I installed this one, the unit would start to beep until I had to turn it off.  customer service said that my circuit board was not putting out enough power even though the new cartridge was identical to the old one and when I put the old one back in it worked.  Customer service said they would issue a refund for the cartridge but that I would need to order a new purifier.  Doesn't make sense that the new cartridge was the exact. replacement for the one I had in the unit, and the new one didn't work but the old one still does.  Shouldn't have to spend the money on a new unit."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "RODDA, MICHAEL",
          "Nb_Reviews": 2,
          "Date": "2023-11-09T22:41:42.000Z",
          "Titre": "Difficult to find the right replacement…",
          "Contenu": "Difficult to find the right replacement filter.  Absense of part numbers."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Clyde Morris",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T19:19:14.000Z",
          "Titre": "I sent an email concerning the right…",
          "Contenu": "I sent an email concerning the right bulb for my 2017 Air Oasis 3000 sq ft . No one answered me. I installed the bulb sent to me and my Air Oasis unit appears to be operational."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Daniel Andrews",
          "Nb_Reviews": 2,
          "Date": "2023-01-10T00:12:54.000Z",
          "Titre": "not a happy camper",
          "Contenu": "Your product description was very lacking. I had to purchase plugs and cables for it to even work. Not easy product to use and instruction manual on the net did not function for almost 3 weeks --- bad link!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Donald  Kocina",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T16:57:48.000Z",
          "Titre": "Received replacement filter was not…",
          "Contenu": "Received replacement filter was not aware that there was tape on bottom causing unit to not work should have been marked or been aware to remove before installing very happy with unit otherwise works very well"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Wesley Wilson",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T20:37:37.000Z",
          "Titre": "I wish there was better communication…",
          "Contenu": "I wish there was better communication on buying more than one filter at a time, would like to have a new filter here instead of waiting."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Verified user",
          "Nb_Reviews": 1,
          "Date": "2022-09-09T14:05:56.000Z",
          "Titre": "I use to own a same model of AO and it…",
          "Contenu": "I use to own a same model of AO and it was working better than this new one that I just bought.  Quite a disappointment in the quality of the newer unit."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michelle Mott",
          "Nb_Reviews": 2,
          "Date": "2023-07-25T05:03:21.000Z",
          "Titre": "Great product but slow delivery",
          "Contenu": "Love the product but it takes weeks to receive the replacement air filters"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patricia Scott-Albrecht",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T22:44:58.000Z",
          "Titre": "A little tricky to start.I think…",
          "Contenu": "A little tricky to start.I think because I had to reestablish myself.I wanted to delete my old address, it wouldn’t."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Ryan Florica",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T01:28:35.000Z",
          "Titre": "I’m having lots of problems with it so…",
          "Contenu": "I’m having lots of problems with it so far . Unfortunately doesn’t clean the air the way I thought it would"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rudolph Stephan",
          "Nb_Reviews": 2,
          "Date": "2023-08-03T00:20:05.000Z",
          "Titre": "Time from order placed to shipment took…",
          "Contenu": "Time from order placed to shipment took longer than expected."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Caroline",
          "Nb_Reviews": 4,
          "Date": "2023-11-29T17:23:18.000Z",
          "Titre": "Filters are too expensive"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carey Weihmiller",
          "Nb_Reviews": 2,
          "Date": "2023-04-06T22:10:21.000Z",
          "Titre": "The products work well but the…",
          "Contenu": "The products work well but the replacements bulbs are very expensive!  I try to get when on sale"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Laura Steinbach",
          "Nb_Reviews": 1,
          "Date": "2023-02-13T20:05:43.000Z",
          "Titre": "Delivery",
          "Contenu": "Shipping was slow with few updates."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tom Watson",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T01:18:18.000Z",
          "Titre": "Replacement Filters",
          "Contenu": "Hard to find detailed information on replacement filters."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Linda Wider",
          "Nb_Reviews": 3,
          "Date": "2022-08-11T05:16:24.000Z",
          "Titre": "I like the air filter....would be great…",
          "Contenu": "I like the air filter....would be great if it were quieter...and if there was a night option w no lights and whisper sound.I think the users manual could have more detail in relation the the various settings. Other wise good product."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sarah  Myers",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T02:36:21.000Z",
          "Titre": "Sales but slow shipping",
          "Contenu": "Good sales but slow to get the order out to ship"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rick Contreras, USA",
          "Nb_Reviews": 3,
          "Date": "2021-09-21T17:10:29.000Z",
          "Titre": "Cleaned Air Tomorrow?",
          "Contenu": "While I'm generally satisfied with my iAdaptAir® HEPA Purifier, waiting for filters is getting me down.  I realize that AirOasis contracts out for delivery services.  This time out, FedEx was chosen.  My filters were supposed to be delivered last Friday.  It's Tuesday morning now and I'm still waiting.  Maybe FedEx wasn't the first best choice.............?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Veta Richardson",
          "Nb_Reviews": 2,
          "Date": "2021-11-06T18:18:37.000Z",
          "Titre": "Good customer service",
          "Contenu": "I needed to replace the pack of Air Oasis filters that I bought as they were the wrong size. Had to use the warranty feature and was able to do an exchange for the correct size. But the size I bought (L) was more expensive than the size I needed (M). Air Oasis did an exchange but did not refund the price difference."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marie Campbell",
          "Nb_Reviews": 1,
          "Date": "2021-08-27T16:40:32.000Z",
          "Titre": "I like the machine in all ways",
          "Contenu": "I like the machine in all ways, but we had a friend visiting in our house for the first time and she said she could smell the mustiness. That is what we are hoping to get rid of. This is caused by too much mold in the air. So we are still having too much mold in the air I think it will take more time, and I don't know how much time that might be."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jachan",
          "Nb_Reviews": 1,
          "Date": "2021-10-12T21:49:30.000Z",
          "Titre": "Having to turn them on and redo EMF settings after power loss",
          "Contenu": "I bought the mini and medium sizes of the i Adapt air. They seem to do a good job cleaning the air, and the price was reasonable, both of which I am grateful for!  But they are kindof noisy. The reason I dropped them from 4 stars to 3 is that: 1) you have to (remember to) turn them back on after a power loss, and, 2) each time you turn it back on, you have (remember to) to reset the setting if you want to turn off the wireless radiation. Also, the way to turn off the wireless could be a lot more straightforward."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bill Hoy",
          "Nb_Reviews": 1,
          "Date": "2021-05-13T22:50:10.000Z",
          "Titre": "The UV light shines bright in the room",
          "Contenu": "The UV light shines bright in the room, I wish it was covered better, darkness is critical to good sleep. It is too bright. But a concern I have is I bought the unit for $399.00 and 4 days later it went on sale for $299.00 I called to see if they would HONOR the sale price and they said NO. Not satisfied bout that. TY"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "KD",
          "Nb_Reviews": 1,
          "Date": "2021-10-12T21:42:10.000Z",
          "Titre": "Air Oasis",
          "Contenu": "I purchased the Air Oasis hoping it would help reduce allergy symptoms from ragweed, dust, and dander. It has made a moderate impact and I would recommend the unit. I think it would be more effective if I had a unit that would also work throughout the house instead of one room."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "The Smith’s",
          "Nb_Reviews": 2,
          "Date": "2022-01-26T19:55:29.000Z",
          "Titre": "I received the product as described and…",
          "Contenu": "I received the product as described and in only a few days. My issue is that the smart app does not have the ability to show progress in cleaning the air. Now we need to find a monitor to confirm the unit is doing more than just blowing air."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stacy",
          "Nb_Reviews": 1,
          "Date": "2021-12-09T18:15:35.000Z",
          "Titre": "I like the product but I haven’t been…",
          "Contenu": "I like the product but I haven’t been able to get any customer service. I can’t get the app to work. I downloaded it and tried to activate. I never received the email with the actIvation code so I can’t complete it he process."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Harriet McCoy",
          "Nb_Reviews": 6,
          "Date": "2022-07-14T16:10:50.000Z",
          "Titre": "The air purifiers are the best",
          "Contenu": "The air purifiers are the best, but they go through replacement filters fast, and the filters are VERY expensive.  So the total operating costs are very high."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Elizabeth",
          "Nb_Reviews": 1,
          "Date": "2022-05-03T14:18:44.000Z",
          "Titre": "It took over a month to receive the…",
          "Contenu": "It took over a month to receive the purifiers, and if I hadn't asked why, I don't think anyone would have told me. The purifiers are fine. They run quietly and efficiently."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "bsq",
          "Nb_Reviews": 1,
          "Date": "2021-10-07T01:36:19.000Z",
          "Titre": "system is pretty expensive  cor the…",
          "Contenu": "system is pretty expensive  cor the size of the unit,  not the best resource for a commercial business.  The  UV lighting seems to be dimly lit and the relaacement bulbs were not available at time  of purchase."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MR",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T18:10:48.000Z",
          "Titre": "took over a month to arrive"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ben Cimmino",
          "Nb_Reviews": 1,
          "Date": "2021-11-27T15:56:51.000Z",
          "Titre": "Seems to be working well enough",
          "Contenu": "Seems to be working well enough. Can’t discern a noticeable difference in my opinion. Also the app is not functional for IOS. Not Wi-Fi settings work."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sergio Olmos",
          "Nb_Reviews": 1,
          "Date": "2021-12-23T23:31:01.000Z",
          "Titre": "The cell was poorly packed",
          "Contenu": "The cell was poorly packed, it had like 6 pieces of packing popcorn. I'm sure it bounced around in shipping and probably shorten the lifespan."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 2,
          "Date": "2022-07-12T22:04:11.000Z",
          "Titre": "It’s too early to give a review on it…",
          "Contenu": "It’s too early to give a review on it and I’ve only had it working for a week.So far so good"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jean",
          "Nb_Reviews": 1,
          "Date": "2021-12-03T17:13:53.000Z",
          "Titre": "The Quick Guide was not clear -- I…",
          "Contenu": "The Quick Guide was not clear -- I followed the instructions there, but it did not give me the answer I was looking for.  The manual was not included so I called them and they said I had to download it -- very inconvenient as I would have liked to get it when I got the unit. So I printed it out and the diagrams were very small and in gray!  Why put info that is not clear so customers have to struggle to have the info they need.  The marketing dept needs to be updated. The customer service person who talked to me was very accommodating and answered all my questions, so she stopped me from returning the unit.As far as the machine-- it seems to work, but the noise level is too high which almost makes me want to return it, especially at night when I am sleeping so I have to turn it off to go to sleep.  It would have been nice if it was quiet enough so I could keep it on all night if needed. I got this on sale so the price was good, but I am not completely happy with it, but will keep it because of the UV feature which I wanted and it's not common to have it in a purifier."
        },
        {
          "Note": 3,
          "Lieu": "PH",
          "Pseudo": "Royce",
          "Nb_Reviews": 1,
          "Date": "2022-02-14T22:51:58.000Z",
          "Titre": "Amazing customer service",
          "Contenu": "Amazing customer service! 10/10 Would recommend"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charles Dobrovolny",
          "Nb_Reviews": 4,
          "Date": "2022-04-27T00:46:45.894Z",
          "Titre": "Love the product, hate the delays",
          "Contenu": "Love the product, hate the product delays."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Juan Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2022-04-12T13:37:48.000Z",
          "Titre": "The product is talking too long to ship"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kenneth Kafka",
          "Nb_Reviews": 1,
          "Date": "2021-12-16T18:29:16.000Z",
          "Titre": "Great product",
          "Contenu": "Great productNo one answers the phone"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Zinnia Cheetham",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T17:27:20.000Z",
          "Titre": "Could be better",
          "Contenu": "This product was recommended to me by my doctor and I like the compact size but overall I’d like it more with a few changes. I have two and one is set up to blow air at me while at my desk. The downside of this is that the air comes out the side and that’s where the plug is. It’s a bit of a weird design and not that attractive. The other one is in my bedroom. That one unfortunately always has a lot of bright lights so I had to stick something on top of the machine since I don’t like bright lights in my bedroom at night. I also placed it in the same spot as my old air purifier I replaced and I’ve noticed that this one is less effective at removing smells from the litter box. I think it may be from where the air is coming in and it’s placement, but it is a bit disappointing that I have it running and it often still smells. The old one was taller and seemed more effective. I hope these are working as well as they say they do but based on how it’s handling smells I imagine it’s not clearing out all the viruses in the air (Covid just went through the house despite having this running constantly and others in other rooms) and mold that effectively either then. Unfortunately I have limited outlets and a small space so I can’t move it to see if another spot would work better at this time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Martha Southwick",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T21:12:55.000Z",
          "Titre": "Shopping is easy",
          "Contenu": "Shopping is easy. This time of year there are lots of codes for discounts that get mixed up. It would be nice if the filters are on better sells. Those add up quickly when you have several devices."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "D Gibson",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T00:46:15.000Z",
          "Titre": "The webite was user friendly",
          "Contenu": "The webite was user friendly, the quick turn around for the order to be shipped was amazing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Priscilla Ramsey",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T14:33:51.000Z",
          "Titre": "Easy to make an order.  Shipping notification.",
          "Contenu": "Could place an order when business is closed."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Cathy Budd",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T22:59:58.000Z",
          "Titre": "I had some trouble figuring out for…",
          "Contenu": "I had some trouble figuring out for sure what size of filter I needed. Couldn’t find a part # that matched my air oasis, I eventually figured it out.  The rest was good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joseph Rocco",
          "Nb_Reviews": 3,
          "Date": "2023-10-31T07:16:21.000Z",
          "Titre": "Been doing business with Air Oasis for…",
          "Contenu": "Been doing business with Air Oasis for quite some time, unfortunately it is virtually impossible as a contractor to be at all possible profitable replacing parts. Items are no longer discounted at the contractor level, the consumer can purchase at the same cost. It is no longer possible to be profitable selling their products. Very disappointing!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jennifer Koch",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T15:18:10.000Z",
          "Titre": "The coupon was attached to the product…",
          "Contenu": "The coupon was attached to the product making it very simple. But, I was willing to spend another $200 to get the next model size up, but was unable to b/c the coupon was restricted to a specific model and was not just a coupon credit. Which I understand for warranty, but just a thought if people are willing to spend more."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michele Barnes",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T04:57:16.000Z",
          "Titre": "The site was mostly easy to navigate",
          "Contenu": "The site was mostly easy to navigate. I would have liked to gotten back to where I was previously without beginning again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Timothy",
          "Nb_Reviews": 2,
          "Date": "2023-10-09T19:36:46.000Z",
          "Titre": "I was shipped the wrong size…",
          "Contenu": "I was shipped the wrong size replacement part. Once I explained the problem to customer service and after a series of email exchanges I was given the return label and the correct part was shipped shortly after that.I'm not sure how I got the wrong part but I am happy with the final result of the process."
        },
        {
          "Note": 4,
          "Lieu": "HK",
          "Pseudo": "Erick Dizon",
          "Nb_Reviews": 3,
          "Date": "2023-05-03T19:08:10.000Z",
          "Titre": "Seamless online shopping experience",
          "Contenu": "Love that it converts the price real time according to your location. Love that it’s simple and straightforward. Although, viewing some webpages of products are not compatible with my iPhone screen viewing, there could be challenges, so I just make the effort to view it nicely. Otherwise, a great shopping experience. Sometimes it just flows by without any comment because it goes the way it’s supposed to go and this is that. 🙌🏼"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michelle R",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T01:52:59.000Z",
          "Titre": "Please provide the dimensions for each iAdapt Air unit",
          "Contenu": "Lots of educational information, the sharing of standards and practices, technical and contextual information - very helpful! However, the fact that I could not locate and download user guides, and I could not find the product dimensions anywhere, is disappointing. On the upside, I emailed Support and they got back to me in less than 24 hours with everything I asked for. That was fantastic! Last item to note, you do not call out the fact that the devices are Wi-Fi enabled and connect to your Wi-Fi app. This should be called out on your website and materials."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dylan Oakes",
          "Nb_Reviews": 2,
          "Date": "2023-01-11T10:09:44.000Z",
          "Titre": "a bit expensive for replacements as…",
          "Contenu": "a bit expensive for replacements as they made me buy two because otherwise shipping for the little thing would be $50!the fan blows sideways so it’s hard to use as a fan and an air filter if that makes sense. but i like the quality, the proper ionizer that doesn’t produce ozone, and the UV system, overall top notch 10/10 would recommend. but i would recommend getting a size up from what you would expect."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve Rose",
          "Nb_Reviews": 3,
          "Date": "2023-01-09T21:18:53.000Z",
          "Titre": "Affordable cost",
          "Contenu": "Affordable cost, compact size, shipped and delivered quickly, easy to startup.  Like that I was able to purchase a small size for a very small bedroom. Waiting to see how long the filter lasts before it needs changing and how long the electronics last before purchasing more of these for other rooms in home. Had some concern about ozone concentrations generated from the UV module, but my extremely sensitive PPT nose has not been able to detect any ozone smell."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alessandro Acosta",
          "Nb_Reviews": 1,
          "Date": "2023-07-23T15:11:30.000Z",
          "Titre": "Ordering, OK; part received not good.",
          "Contenu": "Doing the ordering and having the product delivered was simple. The problem was the product I received was not functional. Now I’m trying for remediation but this is not as simple as purchasing a replacement part. So far I’ve waited 2 days and no response."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Angie Poellinger",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T22:02:34.000Z",
          "Titre": "Be nice if you would have a sale on…",
          "Contenu": "Be nice if you would have a sale on filter!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Susie",
          "Nb_Reviews": 1,
          "Date": "2023-01-03T04:09:12.000Z",
          "Titre": "Satisfied with the Air Oasis",
          "Contenu": "We bought our Air Oasis on Black Friday and got an amazing discount. It arrived in a timely manner. The only issue we are having is getting it connected to the app to control it from our phones which is not really necessary. So, it hasn't been an issue and we have not reached out to the company to resolve it yet. So, I cannot speak about or review the customer service of the company. We were recommended this specific product by a physician and have been happy with it! We are hoping it is \"cleaning our air\" well!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sarah",
          "Nb_Reviews": 1,
          "Date": "2023-01-16T19:36:14.000Z",
          "Titre": "I'm happy with my Air Oasis purifier but...",
          "Contenu": "I'm happy with my Air Oasis purifier and their service was quick. I'm disappointed that they went on sale for $100. off a few days after I placed my order and before I'd received it. Yet, they wouldn't give me the lower price without me placing a new order and returning the one that hadn't arrived yet. I had to return one of their purifiers a few years ago and it was an ordeal with a lot of unusual specifics as to how to do it in order to get a refund. It also had a high cost to ship it back. If they could get this aspect worked out. It'd be 5 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marc Gordon",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T21:39:17.000Z",
          "Titre": "Good customer service; Company needs to improve environmental awareness",
          "Contenu": "I called AirOasis to confirm the model of the replacement cell I needed.  The agent was knowledgeable and helpful, and even found a discount code to use on my order which saved me a few dollars.  I would have given 5 stars except that AirOasis does not provide a return shipping label to return the used cell, nor does it offer any guidance about safe disposal. The cells contain environmentally harmful materials and should be recycled or disposed of properly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nick",
          "Nb_Reviews": 2,
          "Date": "2023-07-12T17:07:45.000Z",
          "Titre": "Second time order…",
          "Contenu": "This is the second time I have ordered from Air Oasis this time for 40% off on supplies. Their filters work great, the only negative is the time to get the item from order to delivery it took a little over a week."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Good Shepherds Regenerative",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T06:12:33.000Z",
          "Titre": "wifi and light display",
          "Contenu": "I’ve had the units for a couple weeks, so keep that in mind. So far, I dislike that I have to deactivate the wifi every time I turn it on because the power source turns off as well. The one in our room in a house isn’t a problem but our power source in our rv for our pre-firefighting efforts as shepherds turns off every time. I also really dislike the light display that puts a really ugly unnatural light into the room, especially at night. I haven’t found out how to dim or turn it off yet, maybe I’ll put a red film over it, would recommend less white and blue lights that cramp my circadian rhythms, but currently I put a book on it. I do like the feeling of having the quality air, and I’m grateful for the thoughtful combo of air treatments and how quiet it runs without any noticeable electrical hum. I would have appreciated an additional discount having bought 4 units: 2 small, 1 medium, one large and filters for most of them, and happy that the shipping was covered and there was a discount good % off for Father’s Day and for wildfire smoke effected folks, and I bet the folks that need it the most are still priced out…but that’s a whole different rabbit hole."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Melanie",
          "Nb_Reviews": 4,
          "Date": "2023-08-30T22:18:11.000Z",
          "Titre": "Referred by a friend and HVAC…",
          "Contenu": "Referred by a friend and HVAC installer.  Problem with mildew and mold growing in mini split units. Creating a musty smell."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Lewis",
          "Nb_Reviews": 1,
          "Date": "2023-05-07T12:08:28.000Z",
          "Titre": "Customer Care was extremely helpful…",
          "Contenu": "Customer Care was extremely helpful when assisting me in selecting the correct part need for my NIND9 power supply. Bryson Watkins also provided technical support that was VERY helpful for installation. Great Customer support!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mada",
          "Nb_Reviews": 2,
          "Date": "2023-04-06T01:26:29.000Z",
          "Titre": "Smart Integration Removed",
          "Contenu": "Buying a replacement filter was straightforward.However, we are missing the Alexa integration that’s been removed a while ago. Hope you’ll bring it back for the ones that purchased this filter for the smart integration capabilities."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-08-15T15:10:10.000Z",
          "Titre": "The links in the email didn’t work",
          "Contenu": "The links in the email didn’t work.  I had to lookup the website.  Not convenient.  Ordering process there was good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sister Jean Graffweg",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T20:30:12.000Z",
          "Titre": "The Filter replacements took a little…",
          "Contenu": "The Filter replacements took a little while to arrive BUT we are pleased Q"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gman",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T19:34:35.000Z",
          "Titre": "Easy order process",
          "Contenu": "Easy order process. Unfortunately first UV replacement bulb came broken but was able to quickly reorder."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Julie",
          "Nb_Reviews": 2,
          "Date": "2023-06-02T01:48:35.000Z",
          "Titre": "It was easy to buy a new filter but I…",
          "Contenu": "It was easy to buy a new filter but I have tried multiple times to down load the app to my phone and have never been successful.  Is it even possible to use the app??"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "PERNELL ALLEN",
          "Nb_Reviews": 4,
          "Date": "2023-04-05T13:34:55.000Z",
          "Titre": "Purchase of Filters Only.",
          "Contenu": "It's been my experience that getting to the place for the purchase of the filters only. Is not as efficient as I feel it could be!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amber Kerr",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T00:25:53.000Z",
          "Titre": "Great products",
          "Contenu": "I’ve enjoyed my medium-size air purifier, carbon filters. My work involves a lot of organic solvents, and it does an excellent job at clearing the air in my studio."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "CT",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T19:56:09.000Z",
          "Titre": "The air oasis arrived promptly",
          "Contenu": "The air oasis arrived promptly. It is quiet and works well. I wish the instructions were a bit more clear as to why and and when I would use the different features. I also wish their chat support was more timely."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "PERNELL ALLEN",
          "Nb_Reviews": 4,
          "Date": "2022-11-14T21:31:18.000Z",
          "Titre": "It has not been easy to order…",
          "Contenu": "It has not been easy to order additional filters on line and the cost seems to be in the higher range."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Comegno",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T22:50:04.000Z",
          "Titre": "Not hard to order.You know in two years…",
          "Contenu": "Not hard to order.You know in two years you have to replace the part so let’s hope the price doesn’t go up to much"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ruth Evans",
          "Nb_Reviews": 2,
          "Date": "2023-01-17T03:07:34.000Z",
          "Titre": "Item is smaller than expected and has…",
          "Contenu": "Item is smaller than expected and has no water fill line. But it works great and arrived early."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul Pagnato",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T18:54:42.000Z",
          "Titre": "Quick delivery",
          "Contenu": "Quick delivery Product easy to useNegative is AppUnable to useEither fix or remove"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rhonda",
          "Nb_Reviews": 2,
          "Date": "2022-12-13T20:52:17.000Z",
          "Titre": "I love my new air purifier",
          "Contenu": "I love my new air purifier! How ever, the filters are so big and how do you recycle them?? they don't last very long either!!! It seems like a big waste of plastic and paper!! and they are so big to get rid of in the trash!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike Campbell",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T02:50:46.000Z",
          "Titre": "If you ever respondome team there at…",
          "Contenu": "If you ever respond some team there at air Oasis.Like doing business with them."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Michael Kozij",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T02:35:36.000Z",
          "Titre": "Full Warranty Honored",
          "Contenu": "I was impressed with the company in their honoring of a full warranty!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sean Polacik",
          "Nb_Reviews": 1,
          "Date": "2023-05-28T19:39:49.000Z",
          "Titre": "Seem to be working but slow....",
          "Contenu": "I recently bought two of the Ionic air models to assist in VOC and mold neutralization left over from remediation activities. I set them up around 8pm, one in my office for the evening and one in the living area. House is a single floor with basement furnace return air, fan set to on for constant circulation in the house.These units are very small with low flow rates and are not meant to be whole house treatment devices, only room specific for most commonly occupied areas.As of 8:30 pm the tvoc meter in my office was reading 1.239 mg/m3, current reading as of 2:01am is 1.07 mg/m3. No ventilation to the outside. Only natural aspiration via dryer/bathroom vent or air leaks.House is 1035 sqft so take that x2 ( for the open basement space all return air goes into ) then x8 for typical residential ceiling height = 16560 cuft (468.93 m3). The fans in these units are Noctua fans rated for 53.3 m3/hr. To treat the entire volume of my house once requires ~8.8 hrs using a single unit. Current spec is for max 660 sqft ( 5280 ft3 or 2.8 hr for 1 air change per space at unit flow rate ) and minimum of 100 sqft well ventilated for ozone safety ( 800 ft3 or 26min for 1 air change per space at unit flow rate )So real world use case: With that in mind, if you want to neutralize VOCs like say what Karen D left in her prior comment ( Acetone in nail polish remover for instance), using a few cotton swabs, the surface area of a nail, maybe a few tissues too that further add to surface area you're allowing said solvent to diffuse from, don't expect the purifier to magically cut the odor in a small time frame. Be realistic here.... it's not designed for that kind of fast removal activity. You would need a huge amount of catalyst surface area and airflow to keep up with the diffusion rate of such substances.Much more practical solution would be employing adequate mechanical negative ventilation to the outside in said affected space than trying to rely on an air purifier to do the job of fresh air replacement. Things like these are more of a final polish device that will pick up anything you haven't captured via another HEPA, carbon capture, germicidal UV sterilization or mechanical ventilation. So when buying these have realistic expectations to where and on what you are using it for.For me, they are doing what I need them to do at a slow rate but that's fine as it will meet target when I need it to based on the meter reading.For anyone worried about the negligible amount of ozone generated by these I setup a test using a calibrated Eco Sensors Model C-30Z Ozone monitor placed 18 inches from the unit on the end table in my office. Turned off my HVAC system for the night at 8:30 pm and closed the door. The room size is 9ft x 8.7 ft or 78.3 sq ft, well under their minimum room size and certainly not well ventilated with the door shut.Left it in this state until my morning alarm at 7am. The ozone monitor hadn't moved from the bottom indicator of the range which would be .02 ppm. However I could certainly smell it in the space.The human olfactory sensitivity is 0.003 – 0.015 ppm depending on your particular biology. So you will likely smell it before any monitoring device indicates elevated exposure levels above the normal 0.01 ppm natural background levels you would expect to find out in the country side away from industrial areas and citys. EPA current exposure limits for ground-level ozone is 0.070 ppm, averaged over an 8-hour period. AQI Value | Ozone Level (ppm)Good 0-50 | 0.000-0.054Moderate  51-100 | 0.055-0.070Unhealthy for sensitives\t                   101-150 | 0.071-0.085Unhealthy   151-200 | 0.086-0.105Hazardous  201-300 | 0.106-0.200The breakpoint for “good” air quality is 0.054, which converts to about 0.106 mg/m³, about the same as the WHO’s recommended limit of 0.1 mg/m³.But based on the simple real world check above, do I think it will increase the ozone in my house to dangerous levels...not likely...but you can take that how you want. Every home's outdoor air exchange rates are different so if you have a very tight home....maybe...but it's going to take a long time to do it. Want to know for sure, buy your own monitor. Alot of other equipment in your house also generates Ozone (TVs, hair dryers, etc)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel Andrews",
          "Nb_Reviews": 2,
          "Date": "2023-08-18T00:25:58.000Z",
          "Titre": "product was difficult to find on website..",
          "Contenu": "product was difficult to find on website."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rick Contreras, USA",
          "Nb_Reviews": 3,
          "Date": "2023-02-08T22:45:28.000Z",
          "Titre": "It's a great product at a HIGH price…",
          "Contenu": "It's a great product at a HIGH price point.  Replacement filters are PRICEY as well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jerry Barber",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T00:09:56.000Z",
          "Titre": "Personally helped telephone and chat…",
          "Contenu": "Personally helped telephone and chat real people"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joan",
          "Nb_Reviews": 3,
          "Date": "2022-08-16T00:14:53.000Z",
          "Titre": "Finally, I can breathe!",
          "Contenu": "I love to have the fresh air blowing on me as I sleep. I missed the instructions to only run it for a short time so ran it continually for a couple months. If it is supposed to be turned off after a few hours, why is running continually an option?!Also, the lights of the controls are bright and I have to cover them or they light up my room."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nwm",
          "Nb_Reviews": 1,
          "Date": "2022-07-12T23:44:16.000Z",
          "Titre": "Clean air",
          "Contenu": "The units work great.  I’m disappointed in the app.   We tried everything to Connect them and we were not successful.  We have them at our Lakehouse and would like to be able to control when we are not down there.  It’s been Very frustrating."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Barbara DuVal",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T21:28:08.000Z",
          "Titre": "The ordering process was easy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CT",
          "Nb_Reviews": 1,
          "Date": "2021-12-16T18:55:44.000Z",
          "Titre": "Excellent air purifier but terrible WIFI function",
          "Contenu": "This air purifier works amazingly well, and we noticed a difference almost immediately in our breathing and air clarity.  We love it overall and are glad we purchased it.  However, the WIFI function does not work at all.  No matter what we have tried, Air Oasis does not recognize our SmartPhone.  We downloaded and followed the manual instructions, and still the WIFI connection will not work.  Suggestions would be appreciated."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wystan Simons",
          "Nb_Reviews": 3,
          "Date": "2021-12-04T18:22:30.000Z",
          "Titre": "I love these air purifiers",
          "Contenu": "I love these air purifiers! The only thing I would change is a tighter connection inside the main body, so that when you move the cord or the unit it doesn't disconnect the power from the unit. It's easy to fix but it would be better if it didn't happen .But as far as cleaning the air we do a fantastic job and I have been a lifesaver to me and my family"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrea H",
          "Nb_Reviews": 1,
          "Date": "2021-12-13T03:57:09.000Z",
          "Titre": "I recommend",
          "Contenu": "I bought two of these (a small one for the bedroom and a medium for the living room) after battling months of allergies. A little over a month has passed and I can tell the difference in the air. Con: overall design - Trying to find a good place to put it in the living room was tricky since the air is sucked in through the front and blows out of the side of the machine. After spending an hour trying to troubleshoot getting the AirOasis wi-fi to link up, I gave up."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "S Hutten",
          "Nb_Reviews": 1,
          "Date": "2021-09-01T20:02:44.000Z",
          "Titre": "Will have to see how this does",
          "Contenu": "Will have to see how this does.  Have several of the G3 series which (with the exception of 1 which stopped working) have been good. This is my first IAdaptAir and was purchased for a very contaminated room which had mold issues.  A little concerned as when plugged in it indicated great air quality which is impossible, but hopefully it will be able to help."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ken G",
          "Nb_Reviews": 3,
          "Date": "2021-09-15T16:35:38.000Z",
          "Titre": "Great Customer Service though product not for us",
          "Contenu": "While disappointed that the product did not work for our application, Air Oasis was a great company to work with from a client service perspective.  They answered all of our questions, both before and after the purchase, and were immediately responsive to our request for a return.  Regarding the product (G3 air purifier), it was of high quality and worked as indicated.  Unfortunately, the ozone odor produced by the unit was more than we were willing to live with."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Robert Gerow",
          "Nb_Reviews": 1,
          "Date": "2022-03-25T14:40:49.000Z",
          "Titre": "Works great for1 year though a bit…",
          "Contenu": "Works great for1 year though a bit noisy. Would not generate above 1L so returned under waranty. Was returned after 6 weeks and worked perfectly plus the compressor noise was greatly reduced. Was not happy about the return shipping charges from Canada."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Peter",
          "Nb_Reviews": 6,
          "Date": "2021-07-13T17:18:12.000Z",
          "Titre": "Works well - very quiet",
          "Contenu": "The units work well, and are really quiet particularly on low setting.The WiFi connected app is a bit flaky and needs updated as does its documentation. Easy to get answers for simple questions via \"chat\" but follow up on more tricky questions is hit and miss. Be prepared to experiment!Filters last about 6 months as advetised and are easy to order and install."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sandra Ellington",
          "Nb_Reviews": 4,
          "Date": "2021-10-17T20:15:38.000Z",
          "Titre": "Replacement bulb",
          "Contenu": "I had no problem finding and ordering the part my air cleaner needed. It came sooner than I expected. It was easy to install and seems to be working perfectly. It lost a star because it didn’t match any of the 3 directions shown. I was very concerned because the new bulb didn’t have a little red button or switch reset that was  described in the directions. Apparently, this is a newer version that doesn’t have to be reset. I’m very happy with my Air Oasis. I have 6 cats and 2 parrots so cleaning the air is very important."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Magalis",
          "Nb_Reviews": 1,
          "Date": "2021-09-09T15:44:04.000Z",
          "Titre": "I have bought 3 of the sir purifiers…",
          "Contenu": "I have bought 3 of the sir purifiers and rate your company 5 stars in general. I just took one away this time because you had a $100 off sale immediately after I placed this order. Seems like if an item has not been shipped or delivered yet the sale price should be provided."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "PG",
          "Nb_Reviews": 1,
          "Date": "2021-09-09T20:36:28.000Z",
          "Titre": "The air quality in my basement seems to…",
          "Contenu": "The air quality in my basement seems to be much better.  There wasn't any setup required.  The unit is very quiet.  There is only a short sheet of information which I do not know yet if it is adequate or not; I will find out whenever I need to clean the unit."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrew Reppert",
          "Nb_Reviews": 1,
          "Date": "2021-09-07T21:11:57.000Z",
          "Titre": "Makes A Difference, But...",
          "Contenu": "The Air Oasis G3 Series UV Ionic Air Purifier I recently purchased for my new apartment (to eliminate smoke odor) does a decent job of making the air MUCH better, but yet it does not live up to the expectations I had from reading all the other reviews and descriptions...not just on their website but elsewhere.  Maybe I just have a very problematic scenario, who knows. What I do know is: while this G3 Series unit I purchased makes a MARKED difference in improvement of air quality, from what I read online it should be doing more than that. I will be buying another air purifier in the near future..."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Roberta Miggiani",
          "Nb_Reviews": 1,
          "Date": "2022-04-12T19:24:14.000Z",
          "Titre": "Great product but …",
          "Contenu": "Great product but …heads up if you’re in Canada hey will charge you 150% over the cost of a filter to send a 2lb package over the border…. Annoying.  Otherwise good product quiet and fairly efficient:)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Puglia",
          "Nb_Reviews": 4,
          "Date": "2023-01-13T23:20:26.000Z",
          "Titre": "Easy to order easy today replace",
          "Contenu": "Easy to order easy to replace"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CHAUNCEY GRANT",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T02:49:05.000Z",
          "Titre": "I wish shipping was faster"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rageoverrun",
          "Nb_Reviews": 4,
          "Date": "2022-01-14T21:35:12.000Z",
          "Titre": "Not bad at all, room for improvement",
          "Contenu": "I got 2 of the large models and strategically put them next to the cat litter boxes in my house.  They were easy to setup, run quietly, even on the highest settings, and has been smooth sailing thus far in terms of operation.  The app leaves a lot to be desired.  When I connected both devices, the app gets confused and if I change the settings on one, it changes both.  Not sure how it gets it's wires crosses, but it does.  The only complaint I have about the actual function of the purifier, is that the odor removal does not work well.  I have left it running on high for 2 weeks and have not noticed any decrease in the cat litter smells.  Hopefully the VOC functionality can increase in these units in the future."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TIM",
          "Nb_Reviews": 2,
          "Date": "2023-09-11T00:46:11.000Z",
          "Titre": "I ordered and received the product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jean-Luc G.",
          "Nb_Reviews": 1,
          "Date": "2021-09-08T18:07:13.000Z",
          "Titre": "No More Sneezing",
          "Contenu": "Con: The air that is produced by this machine is absolutely revolting to my sense of smell. I cannot explain what it smells like, but if I were less of a man I would gag. This is the only reason I am not giving this 5 stars. I use a separate, non-related fan to move the air around to dissipate the odor. Pros: The Air Oasis accomplishes its mission and purifies the air. I used to sneeze several times throughout the day, even after cleaning the house. Now with this machine, I rarely sneeze in my house. Thank you for making a product that is ready to go out of the box and making a product that works. Because of my positive experience, I hope God blesses this company and the people working for it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kate",
          "Nb_Reviews": 1,
          "Date": "2021-08-27T02:21:48.000Z",
          "Titre": "Product is great",
          "Contenu": "Product is great.  Customer service could use some help.  Was asking why the discount code wasn't working for my order and sent an inquiry because the error code said \"discount code not valid\" or something like that.  It did not say, \"can't combine offers\" or something else that would have let me know why it wasn't working.  Also asked in reply if they would honor my 10% code since I was ordering in bulk (4) (and have spent thousands in air oasis products and $1,800 on this order alone).  Got an unnamed response with bad grammar.  Why doesn't anyone sign their name anymore?\"The sale that we are having now is greater than any of the discount codes. Your saving $400.00  and Air Oasis will pay the shipping.Have a great day!Regards, \""
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Trini Perez",
          "Nb_Reviews": 1,
          "Date": "2022-02-12T13:26:10.000Z",
          "Titre": "Air smells fresh.",
          "Contenu": "So far so good. Setting up was easy. I still cant figure how to connect to app but still trying. I do feel air is cleaner and smells fresh in the room we have it in."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Orin Hutchings",
          "Nb_Reviews": 3,
          "Date": "2022-04-27T00:42:28.091Z",
          "Titre": "It seems to work great so far",
          "Contenu": "It seems to work great so far. It was delayed and took a long time to get here, but I am happy I have it now."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ralph A Lambert",
          "Nb_Reviews": 7,
          "Date": "2021-10-26T19:39:33.000Z",
          "Titre": "Good on delivery and shipping info",
          "Contenu": "Good on delivery and shipping info.  Jury still out on performance of the device in delivering some of the claims."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kieu",
          "Nb_Reviews": 10,
          "Date": "2021-09-07T04:54:27.000Z",
          "Titre": "Works very well",
          "Contenu": "I just wish the smell of the ionized cell is less strong. Got rid of cooking odor very well. Thanks."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kimberly Tostenson",
          "Nb_Reviews": 1,
          "Date": "2021-10-07T00:07:13.000Z",
          "Titre": "Easy online ordering",
          "Contenu": "Easy online ordering, fast delivery...only complaint is high cost of filters."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Feuling",
          "Nb_Reviews": 1,
          "Date": "2022-01-13T17:42:51.000Z",
          "Titre": "Product is excellent",
          "Contenu": "Product is excellent. Documentation should be made accessible."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Emilia",
          "Nb_Reviews": 1,
          "Date": "2021-04-17T09:17:58.000Z",
          "Titre": "Good experience",
          "Contenu": "It was a good experience dealing with them. Staff were friendly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Noeule",
          "Nb_Reviews": 3,
          "Date": "2021-09-02T02:23:10.000Z",
          "Titre": "Good but expensive",
          "Contenu": "Good but expensive. Connection to Internet is difficult."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ron S",
          "Nb_Reviews": 4,
          "Date": "2021-12-09T18:11:43.000Z",
          "Titre": "App does not work properly"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gregory Fulghum",
          "Nb_Reviews": 1,
          "Date": "2021-05-05T23:07:19.000Z",
          "Titre": "I enjoyed the fast delivery."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jerry squires",
          "Nb_Reviews": 3,
          "Date": "2022-05-01T13:58:16.000Z",
          "Titre": "Price is high"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rob Costello",
          "Nb_Reviews": 1,
          "Date": "2022-05-03T17:10:06.000Z",
          "Titre": "Decent Air Purifiers, Fair Warranty Process",
          "Contenu": "** UPDATE: 5/3/2022 **Within hours after posting our initial review, AirOasis reached out and offered to send replacement UV-C bulbs at no cost to us.  In fact, the bulbs arrived only a few days after our review posted.  The bulbs were easy to install and restored our air purifiers to perfect working condition.  Two representatives followed-up with us to make sure our concerns were fully addressed; they greatly appreciated us taking the time to share our feedback and they acted promptly to make things right.  Given that the company responded promptly and took such good care to remedy our problem, we recommend AirOasis and their iAdaptAir purifiers; the units are making a noticeable difference in our air quality in our home.  We know the company stands behind their products and wants to please their customers before *and* after the sale.--- Original Review ---Our family is a little disappointed in our experience with Air Oasis.  The iAdaptAir purifiers have respectable technology built-in, however, after only a few months of using two of their \"large\" units, we experienced problems with three UV-C lamps burning out (one lamp on the one unit, two lamps on the other).  The customer service reps were extremely friendly and courteous to deal with, however, the warranty policy is not as customer-centric as we had hoped.  Instead of shipping out replacement UV-C lamps (or potentially whole new units) upfront, the company makes you first ship the two large purifiers back to them at the CUSTOMER'S expense (quite costly as these are a few feet tall and rather heavy), then wait for a \"credit\" to be applied to your Air Oasis account (once the company receives the tracking #s for the original units being sent back).  The customer can then purchase brand new units to be shipped using the \"credit\" applied to the account by Air Oasis.Our biggest issue with this process is having to absorb the large expense and hassle of shipping the \"faulty\" units back, along with the delay time  turning everything around; we have a frustrating mold problem in our home we're trying to get ahead of and these filters have mitigated our allergies to a certain degree.  We don't want to be without (partially) functioning units for an extended period as we wait for the replacement units.  Also, we disposed of the original shipping/product boxes months ago; finding boxes and packing materials to ship these rather odd-shaped machines back is a challenge.  Additionally only the UV-C lamps were problematic, the rest of the units were fine... why be forced to return both of the purifiers themselves?  The company should design the machines for easy swap-out of the UV-C bulbs by the customer as they need to be replaced periodically anyway.We feel Air Oasis should send replacement units to the customer upfront, along with pre-paid labels to have the defective units sent back.  This allows the customer to keep the partially functioning filters running as they wait for the replacements, then the customer can slip the defective units into the new boxes from the replacement units afterward.  If customer fails to send the original units back, Air Oasis can reserve the right to charge customer for the replacement units (via a credit card on file).  Better still, simply send out inexpensive replacement UV-C bulbs for the customer to replace at their convenience.  This makes for a much better warranty process overall.  It also demonstrates Air Oasis' commitment to the customer and their willingness to stand behind their products, especially \"high end\" models like these.Lastly, these air purifiers are NOT inexpensive... these are the company's \"flagship\" home air purifiers and the large models we purchased were around $600 per unit with replacement filters costing just under $100.  The company should make any warranty claims easier and less expensive for customers who shell out this much money upfront for a quality, state-of-the-art product.  Having UV-C bulbs last much longer than a few months on two different units, would be a bonus as well.We hope this review helps others make informed decisions about doing business with Air Oasis.  We will continue to use these partially-functioning units for awhile (with diminished UV-C purification) and look to other companies in the future for alternative air purifier purchases."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Heather Seals",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T18:48:20.000Z",
          "Titre": "Fantastic Customer Service",
          "Contenu": "We had an issue with one part on an AirOasis iAdaptAir, and the company immediately fulfilled the warranty and sent out another. We are so pleased. Great customer service!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T00:48:45.000Z",
          "Titre": "Easy shopping and informative web site.",
          "Contenu": "Easy shopping and informative web site on products.  Fast shipping and delivery.  All products are competitively priced.  I got free shipping and a free gift! The products look good and work great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Margaret Kelley",
          "Nb_Reviews": 7,
          "Date": "2023-12-20T21:43:37.000Z",
          "Titre": "Courteous and knowledgeable!",
          "Contenu": "The chat function was excellent.  The representative quickly understood my situation and came up with the solution.  Polite and knowledgeable.  What could be better?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen Hill",
          "Nb_Reviews": 4,
          "Date": "2023-12-15T01:08:44.000Z",
          "Titre": "Prompt",
          "Contenu": "Very prompt order processing and shipping... would like to be able to group my order for the quantity discount while still sending to 2 different addresses... You don't offer many discounts on the filters and I wanted to take advantage of what you did offer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "sheryl l hammond",
          "Nb_Reviews": 7,
          "Date": "2023-12-18T00:46:32.000Z",
          "Titre": "Prompt service and quick delivery",
          "Contenu": "Prompt service and quick delivery. It was a gift 🎁 for my daughter, I will wait until after Christmas, and she uses it before any further reviews."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Till",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T01:26:57.000Z",
          "Titre": "AO customer service is great!",
          "Contenu": "My med size unit failed and AO customer service replaced it within 2-3 days. A new one is being shipped out now. They were great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Craig Bryant",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T17:05:48.000Z",
          "Titre": "I enjoyed my shopping experience do…",
          "Contenu": "I enjoyed my shopping experience do mainly through the gentleman that handled it named bryce. He was courteous and professional. I I'm not fond however of your tracking method called shop. It is unnecessary to get outside the lines of conventional tracking."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carol Smith",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T18:32:41.000Z",
          "Titre": "Very good experience",
          "Contenu": "The sales staff were very courteous and efficient.  Your product description is well written and comprehensive.  It is also good to see that the product is at least assembled in the USA, even though it may use parts and/or components from other countries.  We try to buy American whenever possible."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shari Mcmahon",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T08:02:24.000Z",
          "Titre": "Super simple to select product",
          "Contenu": "Super simple to select product, best input of required info - great pricing!!! Can’t say enough about this product !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "D. Winger",
          "Nb_Reviews": 6,
          "Date": "2023-12-21T17:31:26.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "Excellent customer service.  Thanks! Air Oasis helped me with a defective unit replacement."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Attley Bachman",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T00:22:25.000Z",
          "Titre": "Easy",
          "Contenu": "Pretty straight forward and easy, filter is simple to replace. Been very pleased overall with this product in many aspects."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Deb Schellenberger",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T04:24:35.000Z",
          "Titre": "Outstanding service",
          "Contenu": "Was able to send an email outlining my problem with my original oasis.  Very quick response addressing my concern and recommending the solution.  I easily placed the order using the provided link.  Easy site to use.  Quick confirmation and an email indicating shipping.  Easy peasy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Butler",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T02:55:03.000Z",
          "Titre": "No Problems",
          "Contenu": "Great sale price and free shipping.  Easy to order online.  Shipped and delivered promptly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tonya",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T21:17:57.000Z",
          "Titre": "A+ customer service",
          "Contenu": "Emailed the company regarding our failing purifier and they started the warranty work and had a new one coming within 24 hours!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JUDIE LIVINGSTON",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T14:20:44.000Z",
          "Titre": "Thank you for asking how my shopping…",
          "Contenu": "Thank you for asking how my shopping experience was. I was happy with my shopping but when I checkouted is where I experienced trouble.  Thecode missing or time expired for the code.  I appliedthe code it did not work. Good news when I was leaving Air Oasis a statement saying my order was still in the cart.   My order was placed every went great.   Looks like I will keep doing business with Air Oasis.   Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valerie",
          "Nb_Reviews": 4,
          "Date": "2023-12-01T13:53:55.000Z",
          "Titre": "Great customer service!",
          "Contenu": "Their customer service was quick to respond to my questions and concerns. They took care of my issue immediately,  quicker than any other company I've ever had contact with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joy",
          "Nb_Reviews": 3,
          "Date": "2023-11-28T15:53:57.000Z",
          "Titre": "Black Friday shopping and I got a BOGO",
          "Contenu": "Black Friday shopping and I got BOGO!  I’m so excited!  Oasis Air Purifiers.  Quiet, easy to use, look sleek and does not feel out of place in any environment!  Bravo!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Theresa",
          "Nb_Reviews": 3,
          "Date": "2023-11-21T23:42:54.000Z",
          "Titre": "Have a breath of fresh clean air!",
          "Contenu": "It’s been very helpful to have 3 Ionic Air purifiers, G3’s, and just ordered 3 replacement bulbs. Recently I purchased 1 iAdapt large and I love these products and the customer service is excellent. I do have Asthma and this has really been helpful to have in my home. Thank you for so many Great products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Danny Rhoads",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T04:09:09.000Z",
          "Titre": "Your price",
          "Contenu": "Your price, free shipping and not bad processing time for being around Christmas:)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wes Gordon",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T15:53:45.000Z",
          "Titre": "Great product",
          "Contenu": "Great product, fast and timely delivery."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T19:25:39.000Z",
          "Titre": "Why I ordered,",
          "Contenu": "Why I ordered,I ordered on line after researching and recommendation by Enhanced Wellness Ridgeland, MS. they have your units through out their office.I had 3 Blueair units which had negative ions only & had to sell due to an ozone issue. I ordered your small bi-polar unit for my HVAC & that made a noticeable difference in air quality.I need more air quality in the bedroom & family room so I got the iAdapt Air unit."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "June M Amerson",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T20:40:03.000Z",
          "Titre": "Easy site to navigate"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Margaret Crockett",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T01:12:06.000Z",
          "Titre": "ordering replacement filters was quick…",
          "Contenu": "ordering replacement filters was quick and easy"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Nelson",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T14:00:19.000Z",
          "Titre": "I had an issue with a unit and the…",
          "Contenu": "I had an issue with a unit and the unlike many companies today that make it easy to purchase but difficult to receive service, Air Oasis was timely, attentive and quick to take care of the issue.  Every bit as easy as making the purchase.  Kudos"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ángela Brown",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T07:31:51.000Z",
          "Titre": "Just following my Doctor's orders",
          "Contenu": "This is my first time ordering Air Oasis !! My Chiropractor told me to order. I love her and her practice and Air Oasis filled my wildest dream of caring and concern for my wellness to the 10th degree!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rebecca",
          "Nb_Reviews": 2,
          "Date": "2023-11-11T01:31:23.000Z",
          "Titre": "Great product.",
          "Contenu": "Website had all the information I needed to make my decision on which product met my needs. I received it super fast. It is really quiet and really works to purify the air in my apt. When I move to a bigger place I will definitely order another."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "lene christos",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T01:25:05.000Z",
          "Titre": "stellar customer service and product",
          "Contenu": "wonderful, attentive and prompt customer service. thank you so much"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deborah",
          "Nb_Reviews": 3,
          "Date": "2023-11-30T23:31:03.000Z",
          "Titre": "Website easy to use",
          "Contenu": "Website easy to use. Nice to be notified me of high traffic and that there might be a delay in shipment but my order was shipped the next day."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Rice",
          "Nb_Reviews": 3,
          "Date": "2023-11-17T16:11:07.000Z",
          "Titre": "Appreciate the excellent service and…",
          "Contenu": "Appreciate the excellent service and was very happy with the trouble shooting and subsequent resolution to an issue with one of my air filters. Thanks! Richard Rice"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jo",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T04:19:18.000Z",
          "Titre": "Great purchase",
          "Contenu": "The diffuser looks and works great. It's easy to use and clean. It fills the the room nicely with the scent of essential oils, and it works very quietly."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "James Slupsky",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T20:23:20.000Z",
          "Titre": "Information on website was complete and…",
          "Contenu": "Information on website was complete and provided a good overview of products"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kameka Britton",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T23:48:53.000Z",
          "Titre": "customer service was awesome",
          "Contenu": "customer service was awesome! Just waiting on the item, thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "A. Yoder",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T23:13:32.000Z",
          "Titre": "I couldn’t believe how quickly my air…",
          "Contenu": "I couldn’t believe how quickly my air purifier arrived!  And then set up was a breeze!  The sound level is great, not too loud.  Overall very satisfied customer!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Swavik Ricoski",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T00:44:16.000Z",
          "Titre": "Great customer service and quality of…",
          "Contenu": "Great customer service and quality of air purifiers! I ordered medium I-adapt air purifier and was upgraded to a large for no extra charge due to back order. Customer service contacted me immediately, apologized for the inconvenience and asked me if I would like to upgrade for no charge. Fantastic company! Five stars all around!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph I",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T05:01:37.000Z",
          "Titre": "Helped my sons asthma tremendously"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary A",
          "Nb_Reviews": 3,
          "Date": "2023-09-16T22:12:13.000Z",
          "Titre": "Love everything about the Air Oasis",
          "Contenu": "I've ordered several sizes of the Air Oasis air purifiers and recently, replacement filters. Each experience was easy and the products came quickly and well packaged. Our family loves the Air Oasis! It's very quiet and there's a noticeable improvement in the air quality as far as reduced dust and allergens. I'm convinced they worked to keep the rest of the family from getting COVID-19 when one family member had it last November. Whether the ultraviolet light or the HEPA filter or both, the rest of us managed to stay well even though the sick person didn't realize at first it was Covid and had yet to isolate themselves. One of the best investments I've made for our home."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonna Hilzer-Dickie",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T18:12:38.000Z",
          "Titre": "It was really easy to order",
          "Contenu": "It was really easy to order, and the educational references for the selection really helped for my needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roseanne C",
          "Nb_Reviews": 3,
          "Date": "2023-11-30T04:47:48.000Z",
          "Titre": "tristan your employees extremely helpful",
          "Contenu": "tristan was very helpful.  provided vidios on how tochange out fan air oasis filter."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laura Hewitt",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T01:12:32.000Z",
          "Titre": "Easy ordering",
          "Contenu": "Easy ordering, liked being able to see the rating of the product,  well explained"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elaine  Martin",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T16:42:56.000Z",
          "Titre": "Great product",
          "Contenu": "Great product! This is the second air purifier I have purchased for my home. I live in CA & the air purifier has made a huge difference in the air quality in my home especially with wildfire smoke. I really appreciate the sale during these tough economic times. Fast delivery as well. Thank you for providing such a great product!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nadia Bryan Neal",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T01:53:35.000Z",
          "Titre": "Easy ordering",
          "Contenu": "Once to the site, ordering was easy and went through without issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ron and Evie Rand",
          "Nb_Reviews": 8,
          "Date": "2023-09-01T00:30:29.000Z",
          "Titre": "Relief from unhealthy air and Release of Pure Air",
          "Contenu": "Oasis was recommended to us by internationally recognized Dr. Don Colbert of Divine Health.  My wife was diagnosed with a mold allergy. We ordered the large sized air purifier and it has remarkably helped her with this unit.  The order was promptly received with a most excellent guide to its usage.  Both my wife and I have experienced a refreshment of purified air!  Also, the staff at Oasis is always available to help in a most friendly and professional manner.  We have gladly recommended to our friends and neighbors Oasis.  Ron Ft. Myers, FL"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Megan Mix",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T00:42:37.000Z",
          "Titre": "Supervisor Bryson honored + adjusted…",
          "Contenu": "Supervisor Bryson honored + adjusted retro active sale price from labor day when I adapt of unit was out of stock...very much appreciated! Otherwise couldn't purchase. Awesome free shipping! Thx"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Joseph",
          "Nb_Reviews": 8,
          "Date": "2023-11-01T03:47:09.000Z",
          "Titre": "As always, Bryson is outstanding in every respect",
          "Contenu": "As always, Bryson is fantastic That said, PLEASE BRING BACK THOSE AIR FILTERS THAT HAVE A GREEN AND BLUE LIGHT WARNING BEFORE THE RED LIGHT APPEARS OUT OF NOWHERE"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Faith Beam",
          "Nb_Reviews": 5,
          "Date": "2023-08-31T00:11:12.000Z",
          "Titre": "Love these air purifiers",
          "Contenu": "Love these air purifiers. They do a fantastic job of cleaning the air. If I could stay in my house with my Air Oasis air, I would never need my inhaler or asthma medication ... they are that good. My house always smells good even with multiple dogs using washable pee pads and two cat litterboxes all in the same area. These are game changers for anyone with pets or breathing issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Victoria Zupancic",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T23:47:07.000Z",
          "Titre": "The UV bulb burnt out after 3 years(It…",
          "Contenu": "The UV bulb burnt out after 3 years(It normally needs to be replaced after 2 years). So, I ordered another bulb but upon installing it the UV light indicator kept flashing, which means the unit was not working properly. When I called support, they troubleshooter the problem over the phone and to my surprise, they ended up sending me a brand new unit!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathleen Beyer",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T23:42:11.000Z",
          "Titre": "Seems like good products",
          "Contenu": "Seems like good products, quick and friendly customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Clark",
          "Nb_Reviews": 5,
          "Date": "2023-12-15T03:00:01.000Z",
          "Titre": "Very easy",
          "Contenu": "Very easy to order from the website."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "T.A.",
          "Nb_Reviews": 3,
          "Date": "2023-10-03T00:49:47.000Z",
          "Titre": "After extensive research",
          "Contenu": "After extensive research, your company provided  in depth and comprehensive information.  Your unit meets all of the criteria that I was looking for in an air purifier, and without ozone!  Your unit stood out among all that I reviewed before I invested.  The warranty is undeniably the best I've seen as well.  Looking forward to experiencing the quality and efficiency!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DEBORAH MALENOCK",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T20:56:14.000Z",
          "Titre": "Wonderful Company and Products",
          "Contenu": "Not only are these air purifiers the best you can buy from the standpoint of quality, but the unit has the ability to capture such small particles that others cannot do.   The customer service is top notch and even though the units are a bit pricy, they come with life time warranties!  I have had 4 units in one home and in my larger residence 6 units.  All have been great except one.  After about 1 1/2 yrs, I experienced problems and contacting them was easy on the warranty and they ended up replacing it!  More than satisfied with the company.  All my air purifiers will always be Air Oasis!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dana Balaban",
          "Nb_Reviews": 2,
          "Date": "2023-10-19T21:47:47.000Z",
          "Titre": "Long time customer",
          "Contenu": "I have been a customer of Air Oasis for at least 15 years. You guys always (not sometimes) always have fabulous customer service. You stand by your products. One of my units was not working properly and you guys took the time to trouble shoot with me and then replace the unit. Amazing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CHRIS GIANNINI",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T18:28:53.000Z",
          "Titre": "Great products",
          "Contenu": "Coupon from my friend who has a bunch of them and the air in her home is always so clear and clean."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stacy Brown",
          "Nb_Reviews": 4,
          "Date": "2023-10-09T22:24:09.000Z",
          "Titre": "A+ CUSTOMER SERVICE",
          "Contenu": "I called after I had ordered my filter because it went on sale shortly after I had ordered it. I was issued a refund for the price difference. The operator was very friendly and efficient! A great experience from start to finish!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bradley Robinson",
          "Nb_Reviews": 5,
          "Date": "2023-08-21T03:01:15.000Z",
          "Titre": "Air Oasis is simply FIRST RATE!!!",
          "Contenu": "Air Oasis is simply a first rate company. The web page is easy to navigate, the products are superb, delivery is swift, and the customer service is top notch. Very friendly and professional folks. They deserve SIX stars out of a possible five!!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "cynthia",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T17:17:09.000Z",
          "Titre": "Quick to respond to my issue i was…",
          "Contenu": "Quick to respond to my issue i was happening, great and fast customer support and resolved issue . Easy to work with"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "queenofmiles",
          "Nb_Reviews": 4,
          "Date": "2023-10-02T18:20:41.000Z",
          "Titre": "Sleek design, quiet operation",
          "Contenu": "Although I would prefer a stainless/ brushed nickel color, white is fine.The design, size and quiet operation did not disappoint. I would buy from this company again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Brown",
          "Nb_Reviews": 2,
          "Date": "2023-09-12T00:51:37.000Z",
          "Titre": "Team member took care of everything and…did it quickly",
          "Contenu": "Team member took care of everything and put my order in que for all filters could be sent at one time. Very efficient and friendly. Nice to give a live human to answer questions and quickly fulfill my request"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shark tooth hunter",
          "Nb_Reviews": 5,
          "Date": "2023-11-06T23:38:26.000Z",
          "Titre": "I know Air Oasis and it's the best...",
          "Contenu": "I know Air Oasis from my years at Johnstone Supply and it's my favorite. This new unit is insane. Cleared the air within hours, and I live in a large house."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christine",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T18:27:10.000Z",
          "Titre": "Bundling Discounts a Huge Plus",
          "Contenu": "I appreciate that discounts are offered for purchasing multiple quantities.  Be sure to place the order using the bundling option though.  The discount is not calculated just by adding multiples into the cart.  Nonetheless, a 30% discount was pretty awesome!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debbie Jackson",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T01:38:20.000Z",
          "Titre": "Love the products and service AirOasis…",
          "Contenu": "Love the products and service AirOasis provides!!  We love the air we breathe in our home and offices!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dennis Kee",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T20:27:18.000Z",
          "Titre": "Quick",
          "Contenu": "By submitting this review, you confirm it’s based on a genuine experience and you haven’t received an incentive to write it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "sandra giesler",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T00:23:50.000Z",
          "Titre": "wonderful company and product!!!",
          "Contenu": "First, you're product is soooo fantastic, I can't believe it.  Second, you're site for purchasing is so well organized - you sure don't find that to be true out there anymore.  GREAT JOB TO ALL OF YOU!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Teresa Asam Jensen",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T19:42:19.000Z",
          "Titre": "Easily navigable website",
          "Contenu": "Easily navigable website. All the details I was looking for were available for review. Shipping was prompt!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "joshua najjar",
          "Nb_Reviews": 2,
          "Date": "2023-10-26T19:45:37.000Z",
          "Titre": "Very upset that my air filter broke…",
          "Contenu": "Very upset that my air filter broke after only 4 years, but I was happy I was given a decent price to replace it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TheGrip",
          "Nb_Reviews": 3,
          "Date": "2023-09-19T02:57:17.000Z",
          "Titre": "Good shopping experience",
          "Contenu": "I went on line ,found my product and bought it. Then followed up with a phone call and the Representative sent me an email with installation instructions. Very satisfied."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lia Keller",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T21:44:53.000Z",
          "Titre": "excellent customer care",
          "Contenu": "The representative at Air Oasis was very helpful and was able to resolve my problem promptly.  He sent me a few emails in a very timely manner and was very detailed in his replies."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ann",
          "Nb_Reviews": 4,
          "Date": "2023-09-20T22:32:24.000Z",
          "Titre": "Air Oasis is the best in product and service!",
          "Contenu": "I ordered an incorrect cell for my air purifier and was immediately helped in getting the correct cell and return shipping label. I love my IonicAir UV air purifiers. They are the best! Customer Service was awesome!!! Thank you, Air Oasis!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Russell Craddock",
          "Nb_Reviews": 2,
          "Date": "2023-10-20T03:18:11.000Z",
          "Titre": "Quite refreshing",
          "Contenu": "Listened to my situation. Sent me a replacement unit which made noises not like it was supposed to. So I contacted AO and told what had happened. They asked me to return the unit which I did and a new unit came today and so far is working as it is supposed to. The sales people were so easy to talk to and very trustworthy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julie",
          "Nb_Reviews": 8,
          "Date": "2023-10-22T01:26:06.000Z",
          "Titre": "We love our Air Oasis!",
          "Contenu": "We really like our three Air Oasis machines. They are easy to move and also quite quiet even on the high setting. Customer service was great. I had a lot of questions that Bryson patiently answered."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Louis Smith",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T14:12:26.000Z",
          "Titre": "I reported an issue with my unit and it was sucessfully rectified.",
          "Contenu": "I reported an issue with my unit and was offered two great options to rectify it even though the unit was outside its warranty period.  Also timeliness in getting back with me was great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anne French Taylor",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T23:28:49.000Z",
          "Titre": "Looking forward to getting it!",
          "Contenu": "The website was very easy to navigate."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Faith Beam",
          "Nb_Reviews": 5,
          "Date": "2023-08-29T16:22:28.000Z",
          "Titre": "Customer service was fast and excellent…",
          "Contenu": "Customer service was fast and excellent sending me the link for the correct replacement part for my air purifiers! I got them ordered and know that they were the correct filters. That is priceless!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terry Toth",
          "Nb_Reviews": 3,
          "Date": "2023-09-18T17:47:13.000Z",
          "Titre": "You all are so responsive",
          "Contenu": "You all are so responsive.  I emailed when my package came and I thought that I had only one replacement filter, but they were packed together.  I got a very quick response to check the package."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "M. Miller",
          "Nb_Reviews": 6,
          "Date": "2023-12-02T20:30:06.000Z",
          "Titre": "Company has a 5 star product BUT a dime…",
          "Contenu": "Company has a 5 star product BUT a dime store electric cord."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JOANNE JOHNSON",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T16:48:19.000Z",
          "Titre": "I called to ask about an existing Air…",
          "Contenu": "I called to ask about an existing Air Oasis that I own. I had no idea what part to order for it. I gave them the info and ordered a second Air Oasis to put in a separate area of the house. The products came quicker than anticipated."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alexandra",
          "Nb_Reviews": 5,
          "Date": "2023-09-17T14:47:22.000Z",
          "Titre": "I am always happy with AirOasis",
          "Contenu": "I am always happy with AirOasis.  We have a filter in each room and use the bulk discounts to replace filters and bulbs, which arrive promptly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Dodson",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T01:01:20.000Z",
          "Titre": "Glad to be able to order the NANO replacement cell",
          "Contenu": "Being able to order the nano replacement cell was a blessing as they have stopped production of the NANO in duct air purifier .I just hope they will still have cells available in 2 more years as the only other induct air purifier is the Reme Halo and so far after installing 3 of these I have not seen the results that I've been getting from the air oasis and the Reme company does not warranty their product to a home owner."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Carl M",
          "Nb_Reviews": 2,
          "Date": "2023-11-09T22:57:18.000Z",
          "Titre": "Website was fast and intuitive",
          "Contenu": "Website was fast and intuitive, super-fast shipping. This is the third iAdaptAir we've purchased. They are fantastic!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "victoria flores",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T21:32:06.000Z",
          "Titre": "Air Oasis website is so user friendly",
          "Contenu": "Air Oasis website is so user friendly. I am very happy with the product. Also that the replacement filter are always available.  Thank you Air Oasis."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jaime Hinman",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T11:57:02.000Z",
          "Titre": "Great product!",
          "Contenu": "My shopping experience was great! Easy to find and order. My only issue is the wait for my product.  I ordered back in June,  it is now August and my product is just being shipped.  I'm hoping this is because so many people are ordering and they are backed up and this is not a regular thing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "joshua najjar",
          "Nb_Reviews": 2,
          "Date": "2023-10-23T22:02:22.000Z",
          "Titre": "My air filter broke after 4 years",
          "Contenu": "My air filter broke after 4 years, which I wasn't happy about, but at least you gave me a great discount on buying a new one.Thanks !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Miller DMD",
          "Nb_Reviews": 4,
          "Date": "2023-09-08T18:37:01.000Z",
          "Titre": "CLEAN AIR FOR HEALTH WITH TOP SHELF COMPANY",
          "Contenu": "They are a top-notch company, OR top shelf (for some people), with an easy-to-use website, fast service, and great follow-up."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CINDY",
          "Nb_Reviews": 4,
          "Date": "2023-10-10T00:05:45.000Z",
          "Titre": "Easy to find the right product",
          "Contenu": "It was so easy to choose the right product online. There was good information and then a simple purchase and quick delivery."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2023-09-24T12:58:19.000Z",
          "Titre": "I was impressed by the rapid response…",
          "Contenu": "I was impressed by the rapid response from Air Oasis.The company honors its warranty, without any fuss."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jerry Roy",
          "Nb_Reviews": 2,
          "Date": "2023-09-08T15:26:11.000Z",
          "Titre": "Fast response in solving a warranty…",
          "Contenu": "Fast response in solving a warranty claim.  Just a couple of email exchanges and my issue was resolved in a favorable way,"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maria",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T00:03:39.000Z",
          "Titre": "Very pleased with our purchase",
          "Contenu": "Very pleased with our purchase. And really appreciate their customer service / they helped confirm which settings to run on our machines."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary Anne",
          "Nb_Reviews": 2,
          "Date": "2023-10-05T23:50:47.000Z",
          "Titre": "Honestly and kindness",
          "Contenu": "The rep I spoke with answered all of my questions honestly and was kind and patient in response to my special circumstances."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MarShondra Lawrence",
          "Nb_Reviews": 4,
          "Date": "2023-08-13T17:42:46.000Z",
          "Titre": "The Best Thing (Other Than The Purifiers Themselves)",
          "Contenu": "What I loved most about shopping with AirOasis is the information that is available about each and every item. I knew and could trust what I was buying."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "S Asher",
          "Nb_Reviews": 5,
          "Date": "2023-10-17T05:31:43.000Z",
          "Titre": "Excellent product",
          "Contenu": "Excellent product. We have used the large air purifier for few years, I just ordered a small one too"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melvin Hess",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T02:11:23.000Z",
          "Titre": "Easy  fast ordering and they were…",
          "Contenu": "Easy  fast ordering and they were delivered in a very timely matter.  They work very good!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim",
          "Nb_Reviews": 12,
          "Date": "2023-10-10T17:41:43.000Z",
          "Titre": "Great Products!",
          "Contenu": "Easy site to navigate…and the products are terrific and perform just as promoted…if not better!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wendy Black",
          "Nb_Reviews": 2,
          "Date": "2023-10-07T23:47:14.000Z",
          "Titre": "I wasn't sure what model I wanted",
          "Contenu": "I wasn't sure what model I wanted. The one I was looking at covered 600 sq ft, but I have almost 900. I called & the rep was really helpful. She explained how it was a simple plug in & could be moved from room to room as needed. It works great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Arsenault",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T16:48:27.000Z",
          "Titre": "A great company to deal with",
          "Contenu": "A great company to deal with. Customer support is great.Their products are welll worth purchasing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angelina",
          "Nb_Reviews": 4,
          "Date": "2023-09-21T00:46:10.000Z",
          "Titre": "Everyone I spoke to were professional…",
          "Contenu": "Everyone I spoke to were professional and resolved my problem fast.  Jasmine was exceptional.  I would reccomend AirOasis to every one."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leila Irwin",
          "Nb_Reviews": 2,
          "Date": "2023-09-28T21:38:24.000Z",
          "Titre": "Super easy to order what I needed &…",
          "Contenu": "Super easy to order what I needed & great follow up confirmation for my order was immediate.  Love Air Oasis!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bradley Robinson",
          "Nb_Reviews": 5,
          "Date": "2023-08-25T13:15:23.000Z",
          "Titre": "Air Oasis-ALWAYS 5 Stars!!",
          "Contenu": "I always enjoy doing business with Air Oasis. They are an excellent company in every way!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter",
          "Nb_Reviews": 6,
          "Date": "2023-10-31T00:50:44.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to see what was needed and then to order the filters and UV lights required."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chip",
          "Nb_Reviews": 2,
          "Date": "2023-11-21T02:11:33.000Z",
          "Titre": "Great experience and info",
          "Contenu": "Great information on the website and an extremely easy purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jan Smith",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T23:09:40.000Z",
          "Titre": "I received it promptly without any…",
          "Contenu": "I received it promptly without any problems. It was easy to order as well. I look forward to using it and having   great air quality."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jackie B.",
          "Nb_Reviews": 3,
          "Date": "2023-11-29T03:50:37.000Z",
          "Titre": "I had a question and they were so quick…",
          "Contenu": "I had a question and they were so quick to respond!"
        }
      ]
    }
  ]
}