{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.officetimeline.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "FI",
          "Pseudo": "Leena Balac",
          "Nb_Reviews": 1,
          "Date": "2022-12-19T10:50:51.000Z",
          "Titre": "It is impossible to use",
          "Contenu": "It is impossible to use. No understanding how to create new time lines etc. Dates are not working. If I add today  until next month, the whole ppt is a mess and it continuously changes my date to 2021 or so.... I have watch few films but mine is a catastrophe..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Aach",
          "Nb_Reviews": 1,
          "Date": "2022-10-12T18:59:40.000Z",
          "Titre": "bought the pilot version a year ago",
          "Contenu": "bought the pilot version a year ago, never used it, now have been billed almost $500, trying to get a refund but no one responds... very dissapointing"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kelly Cullen",
          "Nb_Reviews": 1,
          "Date": "2022-08-24T04:22:21.000Z",
          "Titre": "\"Free\" is a Lie and Waste of Time",
          "Contenu": "Why have a free version?  If one wanted to determine whether this is the program they wanted they would want to test the actual capabilities of the program.  If the free version doesn't allow one to alter a timeline in any way they wouldn't already be able to do so in Powerpoint or Excel, then how is one able to accurately assess whether they should be 100 bucks to use the service.  In short, I'm sure its a fine service... but if they want to offer a free test version, perhaps it should have ANY features that can tell one if it is useful.  If they do not want to offer a free test version, fine.  They can rely on their brand name.  But, they should not do an in-between version where they pretend to offer a free test that does not at all test the service (because you cannot do anything at all to edit a timeline--the whole point of the service).In any event, I'm sure they have plenty of corporate accounts and need not concern themselves with small-timers who would like to assure the product works for them before blowing a hundred dollars per subscription.In sum, waste of time if you are not absolutely sure before testing the product that this is absolutely what you need (I am positive they allow their corporate clients to test it before committing)."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Dishevld",
          "Nb_Reviews": 1,
          "Date": "2022-01-03T18:38:07.000Z",
          "Titre": "Support is non-existent",
          "Contenu": "Support is non-existent. I've been emailing the 'feedback (at) officetimeline (dot) com' multiple times since November and never received one reply. The product doesn't support Mac which isn't clear on the website so I'm looking for the 'offered' refund according to the site. The support phone number is not toll free so they don't really care about international customers apparently. I'm at a complete loss as to how to engage with this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "KPG",
          "Nb_Reviews": 6,
          "Date": "2021-10-22T19:30:31.000Z",
          "Titre": "Website unclear. Have an IOS Apple. Can't get anyone on the phone for a refund.",
          "Contenu": "I can't say I don't like the product - but when I bought it, it was unclear it was not for an Apple Computer (iMac). The website was not clear to me. So i have been trying to find out how to get a refund, or more importantly switch downloads, but can't tell if it comes in Mac form anyway."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cindy Baker",
          "Nb_Reviews": 1,
          "Date": "2021-04-28T01:23:04.000Z",
          "Titre": "Not able to adapt to large amounts of info",
          "Contenu": "This application was not user friendly and does not adapt to large amounts of information. I thought it was fantastic at first, but after I purchased it for a year and kept using it for about a week, it was not useful for me at all. I am pretty upset and wish I could get a refund."
        },
        {
          "Note": 1,
          "Lieu": "SG",
          "Pseudo": "Phil",
          "Nb_Reviews": 1,
          "Date": "2021-05-06T07:16:23.000Z",
          "Titre": "I have subscribed for a few years at…",
          "Contenu": "I have subscribed to Office Timeline Pro for a few years at $59 and used the routines a few times with reasonable output.  In May 2021 after trying to increase the price to $99 and then $149 for the Pro plus, I have decided that this \"add on\" is way too expensive. $150 a year for some routines used once or twice a year.  That’s more than I pay for a full windows package. $100 extra for some fancy swim lanes for Pro+ based on my current legacy rate of $59. You must be joking.Bye,  I will not be renewing,  will just go back to doing it in Excel and Powerpoint"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Todd Reifschneider",
          "Nb_Reviews": 1,
          "Date": "2020-03-06T15:11:42.000Z",
          "Titre": "Just an OK Product - I Wouldn't Spend $100 on the Pro Version",
          "Contenu": "It makes decent looking Gantt charts, but once you create one, you can't go back and edit it.  Its locked as a picture forever.  You're required go build a completely new one from scratch every time you need to reflect an update or change of any kind.  It's honestly easier just to go find someone who created a Gantt chart template in Excel, use that, and paste it into PowerPoint.  You'll save yourself $100 and a lot of frustration."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sheri Phillips",
          "Nb_Reviews": 1,
          "Date": "2020-09-16T00:59:43.000Z",
          "Titre": "It sucks!",
          "Contenu": "It sucks. I've yet to use it and I'm three days in. The templates did not load. I purchased the pro version. It's blank. Click on new nothing loads, the pop up is blank. The import from Smartsheet is messy. The Style pane panel doesn't load, and not compatibility mode doesn't help.  Running dual monitors shouldn't matter but even with one - doesn't work.  I'm running update to date office 365 extremely disappointed. Contact support 3 times to no avail. Time for a refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Derek Welton",
          "Nb_Reviews": 1,
          "Date": "2020-03-06T20:25:16.000Z",
          "Titre": "This is not an adequate timeline…",
          "Contenu": "This is not an adequate timeline solution for Mac users.  You can only do this online, and not in the app, if you're a Mac user.  The on-line app has serious limitations, including that if you need more than a page, it becomes dysfunctional.If you want to use Timeline on the PC side, as far as I can determine, you can only do this through Parallels.  If you use VMWare on that side for PC, you're out of luck.I have abandoned it.  Disappointed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "francesca fieni",
          "Nb_Reviews": 1,
          "Date": "2019-10-02T00:45:06.000Z",
          "Titre": "Horrible experience",
          "Contenu": "Horrible experience. Cannot keep settings,  cannot exchange with a colleague without losing previous settings (even if the colleague has installed it as well).Did they buy ALL of those previous reviews???? This is the least efficient, totally useless application I have ever purchased.You are better off by just drawing your own timeline from scratch if you dont want to lose precious material and time."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Richard B",
          "Nb_Reviews": 1,
          "Date": "2019-06-26T11:26:30.000Z",
          "Titre": "The worst software product I have used…",
          "Contenu": "The worst software product I have used in a long time.  It is loaded with bugs, and I am sorry I bought it.  Even calling it \"Office\" Timeline is deceiving.  It is a PowerPoint bolt-on, not part of MS Office. I have wasted many hours trying to get timelines derived from a table able to format, and as a consultant, this time spent is money lost."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Alan Pat",
          "Nb_Reviews": 1,
          "Date": "2019-04-08T11:03:23.000Z",
          "Titre": "Beware of yearly renewal of $49 !!",
          "Contenu": "I bought the software about a year ago thinking that this was a permanent license. It looks like you have to pay each year...really - each year ??For starters, I bought the entire MS Office for $99 last year from Best Buy. I can use it as long as I want...with upgrades.Compare that to the cost of $49 I am paying for Office Timeline every year.  This is a big ripoff. I was going to recommend the software for our Mid-Size business but will look elsewhere.Thanks"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "AY AJ",
          "Nb_Reviews": 1,
          "Date": "2018-08-27T15:07:41.000Z",
          "Titre": "Non-client centric approach!",
          "Contenu": "Non-client centric, un-ethical approach by changing the business model without informing the customer through out the process and post business model change. Atleast some offer or support to be provided to the old customer who supported them when they started officetimeline and offered single license. Cancelling all services to the one who purchased earlier business model is completely un-ethical and breaking the trust of loyal customer. Such a sham and disrespectful!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Roofeh",
          "Nb_Reviews": 1,
          "Date": "2016-08-27T18:09:28.000Z",
          "Titre": "Very disappointed.",
          "Contenu": "I was expecting a marked increase in functionality when paying for office timeline. Very disappointed. I instead discovered: 1. Payment would be yearly, rather than a one time payment2. There was no improvement in the functionality with payment3. I had to do most of the timeline from my recent presentation by hand because the product just couldn't do what I needed. Very disappointed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hal",
          "Nb_Reviews": 2,
          "Date": "2021-11-03T21:52:51.000Z",
          "Titre": "I can’t get multiple tasks going",
          "Contenu": "I can’t get multiple tasks going, and “help” doesn’t help. I’d change my rating if I had some instruction or a manual. Let me know how to solve this, make a useable time line, and I’ll give you five stars."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marat Safir",
          "Nb_Reviews": 1,
          "Date": "2016-06-17T01:53:02.000Z",
          "Titre": "No Customer Service Period!",
          "Contenu": "Tried to download it, had success on one computer but had to install on my new laptop.  Continued to get an error & could not install the Plus Edition I purchased.  Tried to call for support & nobody answers, ever!  Very frustrating...sounds like an old answering machine.  Left a message & tried to email for support.  Once again, NOTHING.  Very disappointing that as a paying customer, I could not get any assistance.  Hooked me in & dropped me like a bad habit.  Terrible customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Luis Alberto Perez Teran",
          "Nb_Reviews": 1,
          "Date": "2019-08-08T18:53:45.000Z",
          "Titre": "Quite honestly",
          "Contenu": "Quite honestly, I found the software to be a bit useless and regret having engaged with it. Please accept my apologies for the critical feedback but it just did nit work for me. Nevertheless, it might very well be that I need additional training.Best Regards,"
        },
        {
          "Note": 1,
          "Lieu": "DO",
          "Pseudo": "Fernando Cardenas",
          "Nb_Reviews": 2,
          "Date": "2018-11-14T15:35:27.000Z",
          "Titre": "Double license payment",
          "Contenu": "Good MorningOn this occasion my experience with you was terrible. I had scheduled the automatic update and deactivated it days before expiration this was the license number: 92LC-UXD7-R1R4-593W-UQR9-NQDK-024E-UN9Z.After I deactivate it, I bought a new number license: DMWY-EQJG-EL74-59U0-KK94-2TMF-TYJP-AAUZ.Now that I am reviewing my credit card statement, I see that the two licenses were charged on August 6 and the other on August 12, both for the same PC and one more expensive than the other.For this reason, I request the return of the value of a license.Attentively,Fernando Cardenas"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Markus",
          "Nb_Reviews": 1,
          "Date": "2016-03-29T10:08:33.000Z",
          "Titre": "I feel ripped of.",
          "Contenu": "On the website it looked like I would purchase the software (my understanding of purchasing is that I own what I have purchased).\rIn contrast, the receipt states \"one year abbonement\".\r--> I feel ripped off by \"office timeline\"."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John O'Day Jr",
          "Nb_Reviews": 1,
          "Date": "2016-09-07T20:30:15.000Z",
          "Titre": "Does not work as advertised",
          "Contenu": "Office Timeline does NOT integrate with Wrike as advertised. There also is no \"technical\" support, I get directed to a search page to lookup my issue, I have no way to submit a problem ticket or get further help.  Not worth the $49."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sandra Ralston",
          "Nb_Reviews": 1,
          "Date": "2017-03-27T20:29:25.000Z",
          "Titre": "DO NOT DOWNLOAD THE UPGRADE TO TIMELINE!",
          "Contenu": "the old program was a little clunky and took longer than it should have but it as still useful.  After the download of the \"upgrade\" it totally screwed up my existing timeline slides.  Big problem."
        },
        {
          "Note": 1,
          "Lieu": "SA",
          "Pseudo": "Dominic Carrera",
          "Nb_Reviews": 1,
          "Date": "2016-05-17T09:09:07.000Z",
          "Titre": "Timeline stopped working at a critical reporting time.",
          "Contenu": "I am having to redirect my reporting because timeline stopped working.  IN fact it does not even show up on the powerpoint presentation I was using.  BAD!!!!!!!!!!!!!!!!!!!!!!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "HK",
          "Pseudo": "Dinesh Kumar Panjwani",
          "Nb_Reviews": 3,
          "Date": "2019-05-10T08:03:30.000Z",
          "Titre": "Its one of the worst software i had…",
          "Contenu": "Its one of the worst software i had worked with. It is very slow , unstable , no flexibility. I wish i could have done some research before buying this. thanks"
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Claire",
          "Nb_Reviews": 1,
          "Date": "2020-02-17T09:49:19.000Z",
          "Titre": "so disappointed by the premium…",
          "Contenu": "so disappointed by the premium version... the only chart I was willing to use cannot import directly source data... so far it has been useless for me"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Sarah Brinkmann",
          "Nb_Reviews": 1,
          "Date": "2016-06-20T00:29:40.000Z",
          "Titre": "Installation Drama",
          "Contenu": "I have yet to be able to install the program on my computer. I have tried all strategies suggested by your support desk with nil success."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Simon Anderson",
          "Nb_Reviews": 1,
          "Date": "2020-11-09T08:13:58.000Z",
          "Titre": "Smartsheet import is not working…",
          "Contenu": "Smartsheet import is not working anymore - tried everything the chatbot is suggesting, cannot reach support. worthless."
        },
        {
          "Note": 1,
          "Lieu": "SA",
          "Pseudo": "Abdulrahman Bahashwan",
          "Nb_Reviews": 1,
          "Date": "2021-02-09T08:12:51.000Z",
          "Titre": "No full support",
          "Contenu": "No Mac support?!No write-to-left language support?! It’s very expensive for a web-only tool."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Aseem Pandey",
          "Nb_Reviews": 1,
          "Date": "2022-07-13T19:16:39.000Z",
          "Titre": "This is the worst product ever."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jason L.",
          "Nb_Reviews": 2,
          "Date": "2017-11-27T20:00:54.000Z",
          "Titre": "Proven to be unstable and unintuitive",
          "Contenu": "Updating from 2 stars to 1 star!Initial impressions were great at work for project timelines and purchased for home for planning a vacation.  1. Both (Plus) Editions have frozen at least half the time out of 20 or so uses.  2. I've even been getting Microsoft error messages saying the Add-on is unstable and asking if I'd like to disable it.3. Import wizard is not intuitive and does not recognize columns like Start Time and End Time; 4. changes to settings made during the import wizard are not reflected unless you close PowerPoint and reopen, etc.  I’ve also experienced freezes in this area as well. I’m using a ssd i5 HP so this should not be behaving this way.  5. Looking at their support section of their web site, it's very limited and no avenue to report bugs or issues.  *Just found the support email buried on the Contact Us page and not on the Support page. 6. This product, while a great concept, has proven to be unstable and offers little support for the many issues I’ve experienced.  Using this application has been extremely frustrating and a waste of time and money!  This is completely unacceptable!  I would NOT recommend Office Timeline for professional or personal use."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Barbara Messing",
          "Nb_Reviews": 1,
          "Date": "2016-05-09T18:31:13.000Z",
          "Titre": "bad product",
          "Contenu": "I hated this product and would not recommend anyone purchase it.\rit is inflexible and limited."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Rafael Valetov",
          "Nb_Reviews": 1,
          "Date": "2017-07-18T22:57:00.000Z",
          "Titre": "Support is non existent",
          "Contenu": "Support is non existent.  System enables auto charge for renewal without asking the user."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Alain",
          "Nb_Reviews": 1,
          "Date": "2019-08-26T12:46:19.000Z",
          "Titre": "No version retro-compatibility",
          "Contenu": "No version retro-compatibilityVery expensive for the added valueI prefer Mermaid"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "K. Junker",
          "Nb_Reviews": 1,
          "Date": "2016-06-13T14:54:26.000Z",
          "Titre": "Limited Options",
          "Contenu": "Updated Review June 13Upon giving my honest opinion of the Office Timeline software, an email conversation was had where I gave more details about my experience with the software. I rated the software a 3 as it was functional but not mind blowing. After this email conversation I received a separate email notifying me of a canceled subscription and refund. I did not ask for this, as I stated, the software is functional and I purchased it to have said functionality. If they were willing to offer a refund to an unhappy customer, fine, offer me that option, but don't unilaterally make a decision without talking to me, the customer. My opinion of the customer service team and or customer policy's are a negative 5 stars, but that is not an option in this rating system.Original Review: While functional, I was surprised by how limited the options were once downloading the full version of Office Timeline. Not sure I think it's worth the money. The software also seems to try to outsmart the user and change things in one area when you only want them changed in another area. I know what I'm doing, I don't need the software to try to 'correct' me. Bottom line, gets the job done, but if you plan to use this for a variety of things, you will probably find the lack of templates and options very limiting."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "GTR",
          "Nb_Reviews": 1,
          "Date": "2017-12-13T15:01:00.000Z",
          "Titre": "found it useless",
          "Contenu": "found it useless. dependencies and interface to MS Project never worked as expected."
        },
        {
          "Note": 1,
          "Lieu": "SA",
          "Pseudo": "Sarah",
          "Nb_Reviews": 1,
          "Date": "2018-04-05T19:09:00.000Z",
          "Titre": "Great Experience",
          "Contenu": "5 stars: Great -I found it very easy to use and simple and it made my job easier."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "no",
          "Nb_Reviews": 1,
          "Date": "2021-07-22T13:30:14.000Z",
          "Titre": "Spam sent",
          "Contenu": "Do not give reviews when requested to do so."
        },
        {
          "Note": 1,
          "Lieu": "AE",
          "Pseudo": "Mrwilliamc",
          "Nb_Reviews": 4,
          "Date": "2017-06-08T14:17:08.000Z",
          "Titre": "Not worth the money..",
          "Contenu": "Not worth the money... should be free."
        },
        {
          "Note": 1,
          "Lieu": "LA",
          "Pseudo": "Cliff Massey",
          "Nb_Reviews": 1,
          "Date": "2020-07-15T06:53:39.000Z",
          "Titre": "Its functionality is poor."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "UnderFit Customer",
          "Nb_Reviews": 2,
          "Date": "2023-08-02T19:17:38.000Z",
          "Titre": "Subscription model and must get pro+ to…",
          "Contenu": "Subscription model and must get pro+ to have any functionality."
        },
        {
          "Note": 2,
          "Lieu": "AT",
          "Pseudo": "Martin Zelewitz",
          "Nb_Reviews": 2,
          "Date": "2023-07-04T14:04:53.000Z",
          "Titre": "get the product fixed and get their…",
          "Contenu": "get the product fixed and get their support fixed:office timeline does not save the license key. so EACH time I start powerpoint powerpoint asks for the key.tried to sort it out with the support but did not work.With no other software do I have problems wiht license keys."
        },
        {
          "Note": 2,
          "Lieu": "DK",
          "Pseudo": "Emil",
          "Nb_Reviews": 1,
          "Date": "2023-02-02T10:56:25.000Z",
          "Titre": "Upgrade and you're stuck forever",
          "Contenu": "Good product, but once you upgrade to Timeline Pro+, you can never downgrade. This is because any timelines you make cannot be edited with the regular Timeline Pro, even if they are missing the + features. Crooked behaviour."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Judith L",
          "Nb_Reviews": 1,
          "Date": "2022-08-24T02:15:25.000Z",
          "Titre": "Power point plug in is poor",
          "Contenu": "My complaint is that the office timeline pro as used in power point, does not have many features that are available on the online version.  However, the online version has the water mark unless you update to pro+.  I do not want to make jpegs from online app.  I would like the same functionality in the plug in.  Otherwise, your plug in is useless.  What company is going to allow online repository of sensitive information.  I regret buying the plug in as it has been a total pain to use"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Paige M",
          "Nb_Reviews": 1,
          "Date": "2022-08-04T19:50:53.000Z",
          "Titre": "The tool is inconsistent with exporting…",
          "Contenu": "The tool is inconsistent with exporting from Smartsheet. I have been working very closely with Office Timeline Support, all of which have been very responsive and helpful. Unfortunately, the tool does not work the way I had hoped and  wish that the issue can be fixed. Overall, I really like Office Timeline Pro and what it can offer. Unfortunately, it has not been working successfully in my experience."
        },
        {
          "Note": 2,
          "Lieu": "SA",
          "Pseudo": "Liaqath Ali",
          "Nb_Reviews": 1,
          "Date": "2022-07-12T07:44:59.000Z",
          "Titre": "This tool is like 10 years old product…",
          "Contenu": "This tool is like 10 years old product design.I raised support ticket and like any other legacy product support team response I'm being told that its design issue or end user issue."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Smith",
          "Nb_Reviews": 1,
          "Date": "2022-08-12T16:14:23.000Z",
          "Titre": "Really needed a few features that…",
          "Contenu": "Really needed a few features that Office Timeline Pro + could not provide me. The main issue I have with this add-in is I was unable to display Q1, Q2, Q3, and Q4 along the timeline bar at the top when the time range was ~5-7 years. It would condense the scale and only display Q1 and Q3, with no option to display at H1 and H1. Only displaying Q1 and Q3 renders the scale unusable for presentation purposes."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Jesse Hurford",
          "Nb_Reviews": 1,
          "Date": "2022-11-10T12:34:43.000Z",
          "Titre": "Way too expensive for what it does",
          "Contenu": "Way too expensive for what it does, unless you're having to pump out 10 new timelines a day, it's just not worth the cost...and it's an annual fee!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Heerema",
          "Nb_Reviews": 2,
          "Date": "2022-12-16T19:17:57.000Z",
          "Titre": "I keep getting asked to enter my…",
          "Contenu": "I keep getting asked to enter my product key for office timeline when I log into PowerPoint."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2020-11-04T17:48:44.000Z",
          "Titre": "The tool has good features but it doesn't provide compatibility with PPT feature",
          "Contenu": "The tool has good features but its time consuming and doesn't provide enough documentation or tooltips wrt how to use the tool.OT doesn't provide enough compatibilities with PPT features, for instance when I make changes into the chart I created in OT and then modify it in PPT, OT doesn't keep all the changes and mess up my chart when I open the chart in OT."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kirk Emmons",
          "Nb_Reviews": 2,
          "Date": "2021-08-07T12:55:10.000Z",
          "Titre": "The timeline add in did not help me…",
          "Contenu": "The timeline add in did not help me with my work. I was trying to create a timeline that began in 1000BC and showed historical events.   The sales language was vague enough that I did not consider non standard (historical) time periods would not be supported…"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "AJ",
          "Nb_Reviews": 1,
          "Date": "2019-01-22T23:02:47.000Z",
          "Titre": "I liked the user interface but",
          "Contenu": "I liked the user interface and relatively intuitive add-on interfaces. The output did not render well. specially if most of my milestones were grouped or bunched up together at two ends of the timeline. I wanted to have the ability to spread the text or labels of a milestone or timeline after it was produced by the add-on. this was not allowed in PPT. I had to use Visio to import the objects and then play around with them."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rob Buckles",
          "Nb_Reviews": 1,
          "Date": "2022-02-08T20:35:46.000Z",
          "Titre": "If you need a pro level timeline… sorry",
          "Contenu": "I was a huge fan until I had to use the online version, not nearly as functional.  Unfortunately my company's IT security disabled Office-365 for non-corporate computers.  While Office Timeline's support were nice enough to convert my remaining license to the online version, I soon discovered it's nothing more than a single slide builder.  Each slide you build has to be separately exported, then copy/pasted into Powerpoint each time.  Not at all what I expected given the PowerPoint look and feel of the slide-builder, and the way it seems to be marketed, maybe just my opinion.  Anyway, I cannot recommend this product."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tara",
          "Nb_Reviews": 1,
          "Date": "2017-08-28T17:39:59.000Z",
          "Titre": "Previous version was great not so much anymore",
          "Contenu": "Previous version was great, new version won't install. Every time I open PPT I have to \"reactivate\" the version I bought. So annoying and causes lots of problems with decks that I have used Office timeline on, because it creates duplicate slides with the paid version and the free version . Please fix. Also they move from a onetime fee to a yearly cost. Really really annoying."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeffrey  Lee",
          "Nb_Reviews": 1,
          "Date": "2018-03-10T16:37:48.000Z",
          "Titre": "Overall it makes creating timelines and…",
          "Contenu": "Overall it makes creating timelines and Gantt charts easier. However , I am disappointed with my purchase because the lack of function that I need didn’t allow me to use this product for the reason of my intended purchase.  Not able to put milestones other than on the timeline. Also difficult to manually move items."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert Kapaska",
          "Nb_Reviews": 1,
          "Date": "2016-06-22T18:44:37.000Z",
          "Titre": "Office Timeline Productivity in Realtime",
          "Contenu": "Office Timeline is an effective tool on small project schedules. It is less effective on project schedules that are a couple thousand lines or more. It will take up to 2 hours for an import. If you want to import another set of tasks for a different slide, but the same schedule, you're importing all over gain waiting 1 or 2 hours."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ukoid",
          "Nb_Reviews": 1,
          "Date": "2019-05-01T16:48:06.000Z",
          "Titre": "Filter content",
          "Contenu": "So far, I have not found a way to filter content I want displayed. I typically import MS Project files that go out for a year, but I want Office Timeline to focus on 3 months. I cannot figure out a way to do that on Office Timeline. So, right now, I feel like asking for my money back."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Megan Kelly",
          "Nb_Reviews": 1,
          "Date": "2018-07-03T03:46:44.000Z",
          "Titre": "too many restrictions on how to set…",
          "Contenu": "too many restrictions on how to set this up.  Everytime i edit the data, I have to reformat to the changes I need.  Not flexible enough.  I want something that snaps to a timeline and allows dragging and dropping and changes without opening the data.  I need to visualize"
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "Alison Evans",
          "Nb_Reviews": 2,
          "Date": "2017-09-01T03:34:03.000Z",
          "Titre": "Its the most frustrating program I have …",
          "Contenu": "Its the most frustrating program I have ever used. NOT user friendly, you just get all the positions right,add another in and it all goes pear shaped!!The help section is not able to filter down to specific issues and solutions, just points you to a general overview of the section.I have to complete a timeline, and to be honest I shudder every time I have go to and edit it - afraid it will mess up everything I have done so far. I have emailed your help staff only to be pointed back to the [unhelpful] help section/videos again!  Needs a serious overhaul."
        },
        {
          "Note": 2,
          "Lieu": "HK",
          "Pseudo": "Frankie Ho",
          "Nb_Reviews": 1,
          "Date": "2019-11-29T13:43:40.000Z",
          "Titre": "I think you separated two pricing…",
          "Contenu": "I think you separated two pricing options is a bad move. Cheap version going to be too feature minimal while the expensive going too expensive. At the end, customer will go. If I were you, I will just focus to deliver the best and charge one price."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Deborah",
          "Nb_Reviews": 3,
          "Date": "2021-04-11T19:50:44.000Z",
          "Titre": "An expensive addin that uses old…",
          "Contenu": "An expensive addin that uses old technology - for example you cant cut and paste or drag and drop items, dates etc.  Clunky is the best word - but it does get the job done re creating timelines - just not elegantly"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Phillip Oladuji",
          "Nb_Reviews": 1,
          "Date": "2017-10-18T08:57:19.000Z",
          "Titre": "Application is easy to work it and not fully automated. Requires a lot of time formatting",
          "Contenu": "Application is not as robust as expected. It does not autofit the time bars on the screen when tasks are added in, perhaps a warning of some sort that some bars will feature out of the screen would be helpful.Secondly, the milestone timeline view overlaps with text description and is very hard to read. A LOT of time is then spent formatting and get it to work not to talk of looking good. Very disappointed as this is not a free software and for a product that costs half a thousand dollars, I definitely expect it to 'work' and add value by creating automated POAPs that is presentable."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "iw",
          "Nb_Reviews": 1,
          "Date": "2016-09-08T18:18:07.000Z",
          "Titre": "OK functionality WAAAAAY overpriced",
          "Contenu": "Reasonable functionality and makes nice slides but pricing is so far off base.$49 for a plugin? Enterprise pricing models that offer no price breaks for quantities?If you are going after volume adoption - You are shooting yourselves in the foot"
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "Monique",
          "Nb_Reviews": 1,
          "Date": "2019-04-24T17:50:25.000Z",
          "Titre": "No project management",
          "Contenu": "Nice for gantt chart, but not for project management.For project management it is to basic.No tasks and sub tasks, no resources, no status tracking.It’s more a powerpoint template. But that’s not enough for the price paid."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Meh",
          "Nb_Reviews": 1,
          "Date": "2020-03-27T20:49:55.000Z",
          "Titre": "Certain features are difficult to use",
          "Contenu": "Certain features are difficult to work with. You can't easily transfer between the online version and local versions. The local download was only available for Windows so I had to buy parallels, then buy a Windows license, then buy another subscription for Office, then buy another license for OfficeTimeline, then redo all the work I had done in the online version because there was no way to import the slide plus formatting correctly. I also have trouble with the timeline displaying the dates for milestones correctly. The time shows up as 12:00 pm but the date is hidden. I dropped the time from the data input screen but then I had to go through and manually change each milestone for a slide with 40 entries."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Anon",
          "Nb_Reviews": 1,
          "Date": "2017-05-24T21:13:42.000Z",
          "Titre": "Baffled as to how to use/setup my …",
          "Contenu": "Baffled as to how to use/setup my projects. I manage many projects and wanted an alternative to ms project for presenting a Gantt - this seemed attractive but the learning curve was beyond the time I had to spend on it."
        },
        {
          "Note": 2,
          "Lieu": "CN",
          "Pseudo": "Alexius Tn",
          "Nb_Reviews": 1,
          "Date": "2017-04-24T15:04:11.000Z",
          "Titre": "Product expiry bad experience",
          "Contenu": "Your product after expiry period creates a mess of my ppt when the add-ins is not removed. Every slides I viewed it added my last cut-and-paste of the timeline diagrams. I will switch to other ways to draw my timeline."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Massimo Savazzi",
          "Nb_Reviews": 1,
          "Date": "2017-07-10T14:19:06.000Z",
          "Titre": "Bad experience, bugs and no answer",
          "Contenu": "Critical functionalities missing:1) import does not manages image/color/above - belowCritical bug:2) error in redefining the time base manuallylack and no response from support---- In answer to your message:1) not correct. You have to put a standard way of importing those info as are crucial for a timeline. Color you can decide if to have a numer (1 black, 2red, 3 ...) or RGB format.The same is for the icons: 1 star, 2 heart, etc...The above below is simply a boolean and can be 1/0.Your justification is not valid. You have a partial import not allowing to import all the key data on the timeline.This creates a lot of manual work and re work!on 2) waiting for the update."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chanelle Clark",
          "Nb_Reviews": 1,
          "Date": "2021-12-30T17:00:03.000Z",
          "Titre": "Allows limited data to be imported at a…",
          "Contenu": "Allows limited data to be imported at a time.  For the cost, the Basic feature is extremely basic with very limited functionality."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Samantha",
          "Nb_Reviews": 1,
          "Date": "2017-08-21T18:26:34.000Z",
          "Titre": "the layout options are very nice",
          "Contenu": "the layout options are very nice, but was hard to use. wasn't able to get my full timeline in as i wanted so i ended up using excel instead"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeff Courtney",
          "Nb_Reviews": 1,
          "Date": "2017-12-18T12:37:17.000Z",
          "Titre": "I spent a lot of time entering data",
          "Contenu": "I spent a lot of time entering data. Once I realized I was not able to spread it out over several slides I used something else."
        },
        {
          "Note": 2,
          "Lieu": "FR",
          "Pseudo": "Akkouche Samantha",
          "Nb_Reviews": 2,
          "Date": "2022-04-05T20:34:57.000Z",
          "Titre": "Good tool but to slow when adding…",
          "Contenu": "Good tool but to slow when adding several tasks The tasks are not aligned once  timeline"
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "Werner Holzmann",
          "Nb_Reviews": 1,
          "Date": "2020-01-30T21:01:03.000Z",
          "Titre": "Making or changing the timeline is way too labourous",
          "Contenu": "Making or changing the timeline is way to laborious. Switching between templates messes things up significantly."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Deanna",
          "Nb_Reviews": 1,
          "Date": "2020-11-30T17:16:36.000Z",
          "Titre": "OK product",
          "Contenu": "OK product. Support is completely non-existent so don't bother contacting them as they never respond."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Parveen Singh",
          "Nb_Reviews": 1,
          "Date": "2017-03-09T19:29:48.000Z",
          "Titre": "Too much restriction",
          "Contenu": "It doesn't provide enough features to customize the view based on client requirements. Very disappointed"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Claudia Baird",
          "Nb_Reviews": 1,
          "Date": "2021-03-16T22:04:54.000Z",
          "Titre": "Needs to be user friendly",
          "Contenu": "Need to be stream lined for less computer literate people. Hard to customize. The time line."
        },
        {
          "Note": 2,
          "Lieu": "CH",
          "Pseudo": "Peter",
          "Nb_Reviews": 1,
          "Date": "2021-11-15T07:42:33.000Z",
          "Titre": "Office Timeline is okay, but...",
          "Contenu": "Office Timeline is generally a good and useful software. Nevertheless, I don't recommend it. What I don't like at all is its pricing model. In my opinion it's brazen. I can't understand, why such a relatively small Office-add-on, which is only used from time to time, shall cost nearly as much as the main program – and, on top of it, it's only offered as a subscription model. (The offered Freemium model is bit of a joke. It's limited to just ten items, which is far too little to make something useful).The pricey subscription model is a deal breaker for me. I don't see how the (time-)cost that one may save with this software, which is only used from time to time, could justify the high expenses. In terms of usability, I also see potential for improvement. It would be nice to consider general settings - also for date formats. Having to change the date format again and again is not fun. Same thing for removing the dates. It has to be done separately through a rather cumbersome menu structure, which takes too much time due to the many clicks.Also, creating bigger, more complex timelines (to be copied into Word reports) in Power-Point with the Office Timeline Add-on, can be quite a mission. Especially, if the Power Point slide is smaller than the timeline. As a consequence, Power Point sometimes switches unintentionally and annoyingly to the next slide. The only way out is to reduce the picture size in order to see the whole (Power Point-)picture. But then everything is so small that it is difficult to recognize something, let alone work efficiently."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Obi",
          "Nb_Reviews": 1,
          "Date": "2022-01-12T17:23:28.000Z",
          "Titre": "Really not very easy to use and not…",
          "Contenu": "Really not very easy to use and not professional looking."
        },
        {
          "Note": 2,
          "Lieu": "CH",
          "Pseudo": "Service Communication",
          "Nb_Reviews": 1,
          "Date": "2018-01-03T09:45:19.000Z",
          "Titre": "Very complicated to use",
          "Contenu": "Very complicated to use, not intuitiv...i'm very disappointed."
        },
        {
          "Note": 2,
          "Lieu": "PL",
          "Pseudo": "Alexander",
          "Nb_Reviews": 1,
          "Date": "2018-04-15T23:07:00.000Z",
          "Titre": "I cannot get from Office Timeline what…",
          "Contenu": "I cannot get from Office Timeline what I want."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rosana",
          "Nb_Reviews": 2,
          "Date": "2020-04-30T18:13:01.000Z",
          "Titre": "Big disappointment infunctionality and cprice",
          "Contenu": "1.\tEditing is not simple. The changes you make revert back if you make one more change. If you make a manual change, that's even worse because if you then, for example, edit the timelime after making a manual change, the whole thing reverts back to the template's default making you lose all edits made. 2.\tIt's not easy to move task bars up and down and keep them that way. It would be nice if at least it could behave similarly to the SmartArts feature, where you can at least convert it to text or shapes and go on to make manual changes. 3.\tThe other thing that doesn't work well if you import a list of tasks and dates. It doesn't do anything close to what it should be and it always turns out it's more efficient to enter dates manually and individually. Which ends up taking too much time. 4.\tAlso, if I delete a timeline bar, for example, once I make any other update, the timeline comes back. In essence, the button called \"Accept Changes\" simply doesn't work... Ever. If I like a specific template, there's no way I can move a timeline from the bottom to the top. 5.\tIf I change the colors of the task bars, again, once I edit tasks, the original colors come back…6.\tUnder the \"New\" button, I don't see the point of having the 2 options (\"new timeline\" and \"templates\") if both behave the same. The same goes for the \"import\" option that appears twice but do the same thing. The only reason I'm giving it 2 stars instead of 1 is because I actually do use some of it. I like the concept for Office Timeline Pro, but it just didn't deliver for me. It's definitely NOT worth the cost because it has way too much improvement to be made overall. The items listed above have a big negative impact on the experience of the tool for the users. When I purchased it, I was under the impression it was far more efficient, but there were times when I was in a hurry that it was much faster to create something complete manually using shapes and texts instead of using this expensive tool. Will definitely not purchase again nor would recommend."
        },
        {
          "Note": 3,
          "Lieu": "KW",
          "Pseudo": "Lucian Botezatu",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T06:50:24.000Z",
          "Titre": "The final is looking good but the way…",
          "Contenu": "The final is looking good but the way to the final is quite difficult. Need improvements on dates format, sizing of bars and text, relationships and more. Anyway, is a good and useful tool which I hope my company will buy it soon!"
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "Abderrahmen Chtourou",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T15:59:37.000Z",
          "Titre": "Save time",
          "Contenu": "With this Add-in we can save time by updating automatically visual of our projects Timeline.Sometimes, refresh function doesn't work properly when we make some change in excel file.Also formatting functionalities should be improved."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Benjamin Leipzig",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T19:30:13.000Z",
          "Titre": "Attractive Timeline, Less Manual Integration Would be Helpful",
          "Contenu": "I really like the way that the plugin makes an attractive timeline, but would love to have a more seamless integration with MS Project. For example:  Referencing MS Project task hierarchies for swim lane generation would be more useful than creating swim lane columns in project task lists."
        },
        {
          "Note": 3,
          "Lieu": "BE",
          "Pseudo": "Olivier Galard",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T10:07:29.000Z",
          "Titre": "Huge help but...",
          "Contenu": "Huge step forward to draw up project timelines and gantt chart like feature in a way that is integrated in a presentation. That is especially helpful for roles that have to keep it high level with higher management functions. Probably less for true project managers that need to use this to mange project on a daily baisis. Myself need to get over the first stage of intial timelines in a project charter and finding a way to sue it as a tool to report progress/monitoring progress.  That seems to be a hurdle for now.   The way new changes reset earlier changes made is a bit of nuisance. Disappointed that some features such as sub-swimlanes are still subject to an additional upgrade."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "RaiW",
          "Nb_Reviews": 2,
          "Date": "2023-08-03T21:01:25.000Z",
          "Titre": "Timeline template edits need help.",
          "Contenu": "Timeline is an effective product; however, improvements are needed to template usage.1. When words do not fit inside blocks when using center justification, the words get moved to the side and are still the color of the text if it is inside the block. Suggestion is to either default the text color to auto or to auto increase the depth of the box to fit the text.2. When using a template and editing the layout to accommodate the slide space, if you edit the data, the slide will revert to its original look and feel. Suggestion is to maintain the edited look and feel.3. When using template and import, if the page doesn't fit on the slide, you must edit to accommodate slide space and brings us back to problem 2 above. Suggestion is to have an AUTO SUGGEST to fit slide"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sushil",
          "Nb_Reviews": 1,
          "Date": "2023-01-23T19:32:40.000Z",
          "Titre": "Good tool, can get better",
          "Contenu": "I think the tool is great. It has helped me communicate timelines more effectively.Different security tools treat this tool differently, some will cause it to get blocked and Powerpoint to frequently crash. There may be something the tool can improve to make security tools trust it. I wish there were floating licenses for larger teams or organizations so the licenses are purchased and managed based on need and utilization. Node-locked licenses are not efficient and companies will block such licenses during cost-cutting times."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rudy Garcia",
          "Nb_Reviews": 1,
          "Date": "2022-10-14T13:48:19.000Z",
          "Titre": "Good but not great!",
          "Contenu": "This software is one of two other software that can create well designed PowerPoint slides, but the only one that works with PowerPoint on your machine and not online. However it is very basic currently and can not do the following:1.\tThe ability Show dependencies between tasks/milestones.2.\tThe ability to zoom in on a schedule so that you can focus on a particular window of time instead of having to show your whole 2 yr. Schedule 3.\tThe ability to multi select tasks/milestones in the “Edit Data” window so that a user can move multiple tasks in/out of swim lanes/Sub-swim lanes.4.    The ability to show slippage based on your baselineall very important if you truly want to present a informative schedule."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Furea Shirai",
          "Nb_Reviews": 1,
          "Date": "2022-05-26T16:27:31.000Z",
          "Titre": "I do like the automated features based…",
          "Contenu": "I do like the automated features based on the data. However, it doesn't do a good job of making it fit on a slide with a lot of information. I can see how some lanes can join on the same line (non-Gant chart like) but it doesn't do that and it causes to have so many lines and in the end, the information doesn't fit in a slide"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Samira Kerbachi",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T19:59:01.000Z",
          "Titre": "I purchased the Pro version and I am disappointed that It doesn't offer online access",
          "Contenu": "I purchased the Pro version and I would expect to have also access to the online version. Usually we get the entire suite of experience when we purchase the most expensive product. Next year I won't renew the pro version."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Sam Leclair",
          "Nb_Reviews": 1,
          "Date": "2023-01-13T19:41:12.000Z",
          "Titre": "Mac not supported",
          "Contenu": "The tool is great for embedding timelines with dependencies directly into my presentation decks. The issue is I use a Mac and the tool is not supported! I have to use a VDI to remote into a Windows machine to update my timeline. Please add Mac support."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Mark Harvie",
          "Nb_Reviews": 5,
          "Date": "2022-11-10T19:44:15.000Z",
          "Titre": "Idea excellent..... product limited",
          "Contenu": "The concept and intent is excellent, as it bridges the gap between MPP/Excel/Other with the kind of visuals that Execs still seem to like.Basic functionality is good, but it's missing a whole bunch of things which are currently a cause of frustration. I have loads, but a few which frustrate me most are:- Formatting bigger plans across multiple PPT pages doesn't exist. A lot of manual fidgeting to do this.- V limited 'column' options to include in timeline view- Limited compatibility with macOS is a crime.... SaaS functionality should be the same as native app.I really want to like this more, but currently I can only use it to capture a limited amount of info at a very high level (I've used both browser-based and native versions, and they both leave a lot to be desired).As a consultant I produce slide ware like it's going out of fashion..... Make the product richer and more-user friendly and you'll have a friend for life.Sorry. But you did ask for feedback...."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nick Kozlowski",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T00:17:07.000Z",
          "Titre": "My biggest issue is that timeline…",
          "Contenu": "My biggest issue is that timeline graphics formatting gets messed up every time a date changes, causing all graphics to have to be repositioned each time there is a change to a data field."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeremie Pernet",
          "Nb_Reviews": 1,
          "Date": "2022-06-29T20:30:39.000Z",
          "Titre": "useful with some bugs",
          "Contenu": "this tool is very needed, and useful, however some issues managing several timeline in the same slide deck, with information copied over from one to the next.needs improvement!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tony Moy",
          "Nb_Reviews": 1,
          "Date": "2022-08-17T22:01:34.000Z",
          "Titre": "Custom Timeline Position Getting Reset",
          "Contenu": "In general, it's ok. Key issue I'm facing right now is that the custom Timeline Position I'm setting keeps getting reset. Can you fix that?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Fernanda Bordin",
          "Nb_Reviews": 1,
          "Date": "2022-07-14T19:55:18.000Z",
          "Titre": "My biggest challenge is not being able…",
          "Contenu": "My biggest challenge is not being able to add responsible to each task (at least not on the timeline formats I use). I miss having a cleaner timeline, all of them look very busy. And I can't pinpoint it exactly, but the system could be more user-friendly. I am willing to have someone from your team watch as I build a timeline if you feel that would help make it more friendly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John T.",
          "Nb_Reviews": 4,
          "Date": "2022-12-15T21:33:14.000Z",
          "Titre": "Start Up",
          "Contenu": "The concept to create charts for MS Project is very usfull.  The use Power Point is a bit combersome.  Would be easier to have a stand alone app that reads the MSP data.Your real time support is lacking.  I struggled with creating reports for my NASA Program.   Called several times for support to no avail.  The 15 minute web training is to fast and not of to much help."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Takeshi Takata",
          "Nb_Reviews": 1,
          "Date": "2022-07-14T02:53:42.000Z",
          "Titre": "Positive and negative",
          "Contenu": "Positive: 1 year after using Pro version, purchased Pro+ but Pro annual contract was automatically renewed and fee was charged. Request refund as no use Pro anymore then immediately respond (refunded). Customer oriented attitude is positiveNegative: When create Gantt Chart, the default appearance is not so good looking so manually adjusted. Then when update the data the appearance was retuned so every time, I need to modify the appearance. Any way to lock the appearance?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Erica Fleming",
          "Nb_Reviews": 2,
          "Date": "2023-04-07T21:01:47.000Z",
          "Titre": "Critical Path and Dependencies",
          "Contenu": "I purchased the pro plus license because I really wanted to use the Critical Path and Dependencies, but I find it hard to use and a little clunky, even after a live session with a representative. It's not very intuitive, and the import doesn't allow you to define dependencies, which would be very helpful."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Tim Stuart",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T02:55:34.000Z",
          "Titre": "its quick and easy to adapt a schedule…",
          "Contenu": "its quick and easy to adapt a schedule but to update a schedule is very manual we mainly use it to quote and when refreshing you have to  go through and manually change all the start date it take a lot of time"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Andrea",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T19:37:11.000Z",
          "Titre": "The app is buggy and some changes when…",
          "Contenu": "The app is buggy and some changes when you edit data don't stick unless you delete the line and add a new line. There's a lot of promise and I do want to use it. But some features need a bit more work."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Abla Alaoui",
          "Nb_Reviews": 1,
          "Date": "2022-11-10T19:21:40.000Z",
          "Titre": "Good but Difficult and Time Consuming.",
          "Contenu": "I like the look of it once the timeline is complete but it takes FOREVER to get to the final piece.  I dont like that you can't change the height or spacing manually without it changing the DATE range."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Irene Ali",
          "Nb_Reviews": 1,
          "Date": "2022-11-26T02:59:32.000Z",
          "Titre": "It was hard to create a slide",
          "Contenu": "It was hard to create a slide from my timeline. It took me about 4 hours to manually move them around to fit the aludea. This was my 1st time using it. Also I wish I would have know about the online license before I purchased the desktop version. Now I have 2 licenses."
        },
        {
          "Note": 3,
          "Lieu": "NO",
          "Pseudo": "Linda",
          "Nb_Reviews": 3,
          "Date": "2022-10-26T08:51:56.000Z",
          "Titre": "Its hard to adjust the timeline (more…",
          "Contenu": "Its hard to adjust the timeline (more than one place to do it and something can change in THATa place and another thing can change in THATb place . I often want to change date, what shows, how it shows, move ... but it is hard to do"
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "Jose Santos",
          "Nb_Reviews": 1,
          "Date": "2023-05-13T21:05:34.000Z",
          "Titre": "Perfroamnce and usage",
          "Contenu": "hi the performance with Timeline is very slow It's difficult to aligne objets task by task"
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "Philippe Minski",
          "Nb_Reviews": 1,
          "Date": "2023-04-24T19:50:19.000Z",
          "Titre": "Price increase of +50$ in a year",
          "Contenu": "Price increase of +50$ in a year. +50.51% and no more feature.This new price point is definitely a game changer for me.After 3 years , i will not buy your product anymore."
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "Eleonore",
          "Nb_Reviews": 3,
          "Date": "2023-07-27T19:21:34.000Z",
          "Titre": "Quite expensive for the features offered"
        },
        {
          "Note": 3,
          "Lieu": "SA",
          "Pseudo": "Yasser Badr",
          "Nb_Reviews": 1,
          "Date": "2022-06-29T19:20:51.000Z",
          "Titre": "Hello;",
          "Contenu": "Hello;There are some problems regarding the working and calendars days calculations.."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "contributor",
          "Nb_Reviews": 1,
          "Date": "2022-05-09T20:58:40.000Z",
          "Titre": "I love how nice the product looks",
          "Contenu": "I love how nice the product looks - there are two things that could be improved:1- I'm unable to add all the months when is it's beyond 1 year timeline. I understand it might be two much for a 2 year timeline but 13-18 months, could be nice to have all the months. 2- I make changes with ppt. (because of the above) and every time, I go back to timelinepro, my changes are gone. This is a lot of redo work."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MK",
          "Nb_Reviews": 1,
          "Date": "2021-11-02T18:25:09.000Z",
          "Titre": "It's so ugly",
          "Contenu": "It's so ugly? I appreciate how easy it is to use, but my god, on the basic subscription the colors and overall design looks extremely dated--I'm almost embarrassed to show stuff to clients. For what this is, it's too expensive. I dropped so much money on the subscription, I feel like I have to keep using it but likely wont subscribe again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jenifer Queen",
          "Nb_Reviews": 1,
          "Date": "2021-11-12T14:10:28.000Z",
          "Titre": "Switching OS is not the same experience",
          "Contenu": "Using the sw on windows machine was fantastic. Had the options I needed. When I switched to Mac or web version was mission the options and felt limited. I’m also struggling to implement in Google docs and may resort to converting to pdf. This was so flexible on windows and I am missing the options in other os."
        },
        {
          "Note": 3,
          "Lieu": "JP",
          "Pseudo": "hayashi Boo",
          "Nb_Reviews": 1,
          "Date": "2021-08-15T03:03:00.000Z",
          "Titre": "Questions about the template",
          "Contenu": "I have tired to connect to support but no one replied.1.Does the ppt template support company' master one which should be included logo,deligated font format etc?2.Can the created file be reconfigured some values like tasks name etc by others who does not install your add-on?3.What will happen to created files after licence expired?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tim",
          "Nb_Reviews": 4,
          "Date": "2021-04-23T19:45:51.000Z",
          "Titre": "It works ok for simple things and looks…",
          "Contenu": "It works ok for simple things and looks ok. But it presents too big when you have a number of tasks selected. and that is odd too. it only shows a few of the tasks and milestones I need. so I always need to do a subset of what I need and use multiple pages and plans. I may not know how to use it to its fullest potential but the basics really don't do what I need well. options are limited on how I can present it."
        },
        {
          "Note": 3,
          "Lieu": "IL",
          "Pseudo": "Vered",
          "Nb_Reviews": 1,
          "Date": "2021-02-01T06:29:38.000Z",
          "Titre": "some basic features are missing",
          "Contenu": "some basic features are missing, for example, if I would like to increase the visual size of all the durations of the tasks, and to align the writing next to it to be written in 1 line in automatic button - I don't have that option. today I have to do it manually, one task at a time. also - if I make a change in the Gantt it will not automatically be displayed in the power point - i have to recreate my chart all over againthanks"
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Da_Jockl",
          "Nb_Reviews": 2,
          "Date": "2022-01-19T07:30:42.000Z",
          "Titre": "The tool is great but the pricing is over the top",
          "Contenu": "The tool is great but the pricing is way over the top. I can get a full subscription for Microsoft365 that I can install on 5 computers at the same price like the subscription fee of this tool.Yes it saves me time but the price is just out of balance"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "J Clark",
          "Nb_Reviews": 1,
          "Date": "2021-07-22T18:20:51.000Z",
          "Titre": "I would give a 5 but...",
          "Contenu": "I absolutely love this tool. My only issue is that I use a Mac and can only use the online version which is to basic for my needs.   So I have to move to PC to do any work using the tool. It's too cumbersome.  I really need a Pro version for Mac ASAP please :-). Then I can give you a 5 star!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Taeko Hosaka",
          "Nb_Reviews": 1,
          "Date": "2021-08-16T04:38:42.000Z",
          "Titre": "Development areas",
          "Contenu": "It's great if you add functions like:- Adjust gantt chart period not only longer than data imported but also shorter- Keep format once it's settled even when another dataset imported, that would be very useful for monthly update (i.e. to import original data monthly)"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JD",
          "Nb_Reviews": 1,
          "Date": "2020-03-12T15:41:09.000Z",
          "Titre": "Great presentation but ease of use can be improved",
          "Contenu": "For presentation purposes - I *love* this tool. Customers find its presentation clean and very useful. However, editing data in the Powerpoint application is difficult. If I want to shift all dates, it must be done manually. To circumvent this I export to Excel and write formulas and then reupload. To take this to the next level, I'd focus on ease-of-use from this type of lens."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Sutanuka Bhattacharya",
          "Nb_Reviews": 1,
          "Date": "2020-06-10T22:54:37.000Z",
          "Titre": "Pretty pictures with further improvement opportunities",
          "Contenu": "The tool does impressive timeline diagrams. Few improvements I would like to see are:- Sequential tasks can be arranged automatically in a single row/line instead of having separate row for each of the tasks. This would present a better view of the dependent (sequential) tasks and also save space (real estate). Currently I find this very limiting for my use.- More flexibility in task width (custom doesn't work consistently) and other custom fields."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Mark Etheridge",
          "Nb_Reviews": 1,
          "Date": "2021-11-01T17:22:47.000Z",
          "Titre": "I find it to be useful minimizing…but have to make sync work consistently",
          "Contenu": "I find it to be useful minimizing manual steps in syncing with MS Project. However, the sync does not work many times and have to close down applications and reopen for the sync to work.  This makes me NOT trust when things do sync up (always retesting)_."
        },
        {
          "Note": 3,
          "Lieu": "TW",
          "Pseudo": "Tim",
          "Nb_Reviews": 1,
          "Date": "2020-04-05T12:34:51.000Z",
          "Titre": "I'm using the online app and it is…",
          "Contenu": "I'm using the online app and it is fairly limited in the way it can present things. Not having swimlanes feature on the online app is also an issue. There doesn't seem to be a clear way to upgrade the online app purchase to a PPT plug-in which would be something I would do at this point considering all the additional features that are available."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "nate",
          "Nb_Reviews": 1,
          "Date": "2019-08-04T14:45:08.000Z",
          "Titre": "to each his own",
          "Contenu": "The office timeline is not very user-friendly.  Every time I add a timeline and then make a change to it, it constantly pushes my timeline off the slide then I had to readjust everything all over again.    And the accept manual changes button is pointless as it does nothing.  At the end of the day, I am better off making my own timeline by just adding the shapes to the slide myself."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Aaron London",
          "Nb_Reviews": 1,
          "Date": "2019-06-14T16:09:43.000Z",
          "Titre": "Please fix your program!",
          "Contenu": "Overall, the program is useful, BUT... there are many bugs that combined with the latest Office 365 make this program difficult to use.  It crashes quite often which causes me to reboot the program which shuts down all Powerpoint windows.  There are too many bugs to list here, but needless to say, please fix them!  Your program has much promise but the implementation is frustrating.  I am one of many at my company who also feel the same."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jessica Choe",
          "Nb_Reviews": 1,
          "Date": "2019-09-11T05:14:56.000Z",
          "Titre": "The tool really is wonderful and totally worth the low cost...",
          "Contenu": "The tool really is wonderful and totally worth the cost. But I can't give it more than 3 stars because (a) it's pretty slow, so if you want to make a lot of changes, you end up doing a lot of waiting for either the input screen to load or the updated timeline to \"paint\" on the screen. And (b) there are limitations with formatting that I find disappointing. Nothing that I can't live with, but there's lots of room for improvement."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dorene Maccoy",
          "Nb_Reviews": 1,
          "Date": "2021-02-26T18:13:39.000Z",
          "Titre": "The timeline is not intuitive",
          "Contenu": "The timeline is not intuitive. It is kind of clunky in how to manipulate the timeline once you have selected a template. I have only just downloaded the app and used it a few times. I took the online tutorial but still having trouble loving it. Maybe if I work with it a little more."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sue Taylor",
          "Nb_Reviews": 1,
          "Date": "2021-02-08T18:20:16.000Z",
          "Titre": "We really have not used it yet",
          "Contenu": "We really have not used it yet, but looks like the type of solution we need. We will be using it primarily for grant applications and funder reporting because of the ability to create a graphic representation of a timeline instead of creating a workaround in Excel, Publisher, or Word."
        },
        {
          "Note": 3,
          "Lieu": "CH",
          "Pseudo": "Christoph Zumbühl",
          "Nb_Reviews": 1,
          "Date": "2018-12-04T07:18:37.000Z",
          "Titre": "Importing | Copy-Pasting from Excel to…",
          "Contenu": "Importing | Copy-Pasting from Excel to OTL does not reflect all line-items. Usually milestones do not get acknowledged. For me the amount of manual work is too extended for initial timeline. Maintenance thereafter is fine. - Idea worth spreading: If OTL would offer integration of SwimLanes for planning would help a lot. And the option to view Planning as KANBAN would be impressive. - Thanks for your work."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James Roberts",
          "Nb_Reviews": 1,
          "Date": "2019-06-13T01:00:47.000Z",
          "Titre": "A few tweaks to go from good to great are needed",
          "Contenu": "I think OT would be phenomenal if it worked like it should, but when i add a new task/milestone it shifts everything around way too much. It also doesn't do a good job on the front end with spacing out the dates. You have to format too much. You should have an option to choose a paper size (8.5x11, 11x17, etc.) and it should fill up that space."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "HGG3",
          "Nb_Reviews": 3,
          "Date": "2018-10-02T20:15:49.000Z",
          "Titre": "I really like the current functionality, but need Mac OS functionality for MS Project.",
          "Contenu": "I really like the current functionality of Office Timeline and it provides a good selection of default Timeline themes to select from.  Two of the lacking features/functionalities that I hope to see in an upcoming release is the ability to pull additional tasks from MS Project.  The current release has a limitation.  The most important functionality that is needed is the ability to work with Mac OS."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chris W.",
          "Nb_Reviews": 1,
          "Date": "2019-01-16T22:01:31.000Z",
          "Titre": "I like the product",
          "Contenu": "I like the product, but two issues:  (1) it's often buggy when trying to upload data; (2) the process of selecting a template, and then having that template actually populate into the presentation is difficult and is not intuitive. In fact, I haven't figured it out yet. But, with that being said, for turning excel data into a timeline--works great."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Programme Director",
          "Nb_Reviews": 1,
          "Date": "2018-01-20T15:11:37.000Z",
          "Titre": "OK for small projects and not as intuitive as it could be.",
          "Contenu": "This product is good is you have a simple and small project. Very difficult to add bigger programme on to one page and the tool is not intelligent enough to try and condense the visuals.Also if you make any manual layout changes to the plan the changes revert back to the default layout if you make updates. The tool does not remember and save your previous saved manual layout."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Andreas",
          "Nb_Reviews": 1,
          "Date": "2018-01-05T07:30:16.000Z",
          "Titre": "Very good Idea and very helpful ...",
          "Contenu": "Very good Idea and very helpful ......but with the newest Win10, Office365 ClickToRun, full screen and a multi monitor environment some setup windows open in a hidden space and are therefore not usable. Current workaround ... make the PowerPoint window really small, open the setup window, pick the small peace of the setup windows that shows up and move it to be fully displayed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sue",
          "Nb_Reviews": 1,
          "Date": "2018-01-03T11:44:25.000Z",
          "Titre": "Should not need to repurchase to get upgrade",
          "Contenu": "I love office timeline....I did not like, though, that I had to repurchase it in order to get the upgrade.UPDATE: Now that I have read the reason for needing to repurchase, I am not very happy. I have been an Office Timeline user for years. Those of us that purchased the product years ago (and supported development with the purchase) should have been grandfathered into the new subscription model...or at least offered a discount."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jennifer Long Maxwell",
          "Nb_Reviews": 1,
          "Date": "2017-06-13T19:58:17.000Z",
          "Titre": "Nice tool, but didn't work for me.",
          "Contenu": "Timeline seems to be created with a specific set of use cases.  I was hoping to be able to retrofit a 4 year schedule that currently lives as PPT graphics into something more automated, but I was unable to find a way to get timeline to split up into 4 separate timelines and still neatly display all milestones on one page.  The tool was overall easy to use, just didn't work for my use case."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Scott Good",
          "Nb_Reviews": 1,
          "Date": "2017-11-08T18:58:39.000Z",
          "Titre": "I like it ... and there is a potential for me to love it!",
          "Contenu": "I really like the product, and it has the potential to be very, very helpful. Like with most things, repeat use is the key to seamless integration.  A menu-driven functionality would make it easier for me because my issue is that I may only use the Timeline once every six weeks.  After six weeks of non-use, I am almost starting over on the learning curve.  A more menu-driven feature may help reduce barriers to more high-powered use."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alicia",
          "Nb_Reviews": 2,
          "Date": "2018-06-15T19:18:20.000Z",
          "Titre": "Overall useful to have in my project…",
          "Contenu": "Overall useful to have in my project management planning and communications. It's still a bit clunky and can use some work to give the end user more opportunities to customize to fit needs. I'd like it to better fit with Microsofts color pallet and be able to move objects around without taking everything apart piece by piece."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dawn Charnin",
          "Nb_Reviews": 1,
          "Date": "2019-11-25T17:34:41.000Z",
          "Titre": "I wish it could the changes made to PPT…",
          "Contenu": "I wish it could the changes made to PPT to push online and push to PPT would have the ability to change in PPT.  Also, it would be nice to create folders structure. Allow for people who are shared can make copy of an timeline for a new version. Sharing requires an extra step of accepting though email."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Scott Whitman",
          "Nb_Reviews": 1,
          "Date": "2019-12-06T15:20:52.000Z",
          "Titre": "This is a good product that saves me a…",
          "Contenu": "This is a good product that saves me a lot of time. The only reason I gave it three stars is that it occasionally locks up while editing an existing file and \"beeps\" every time you try change something. When that happens the only way out is to cancel powerepoint which results in lost work."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Reuven Mizrahi",
          "Nb_Reviews": 1,
          "Date": "2018-11-02T04:33:38.000Z",
          "Titre": "Very good product",
          "Contenu": "Very good product, but careful when editing timelines... things can move around a little on you after the initial setup.  The formatting is superb, but can get a little out of whack if you try to tweak it by hand.  That stated, this is BY FAR the best product of its type I was able to find.  Keep up the great work!"
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "Etienne",
          "Nb_Reviews": 1,
          "Date": "2017-12-27T18:53:46.000Z",
          "Titre": "Decent tool, but a lot of room for improvement",
          "Contenu": "Big issue with color management. If you have to follow graphic guidelines, you will have to enter the RGB values each and every time you will need to apply them to any object.On a more global level, it would be nice to have a WYSIWYG tool rather than a wizard which computes data after your enter it.Last thing : it would be nice to be able to create a task tree. The only way to make a task appear as a child to another one is to use graphic tools, but it is uneasy."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "George  Pereppadan",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T19:41:57.000Z",
          "Titre": "The add in slows the process when…",
          "Contenu": "The add in slows the process when trying to open or work with PPT files. This makes for a cumbersome experience. Also, I can think of numerous features that can be added that would go a long way in making this a complete tool for project managenent... If that is your goal. Having said that.. the tool has it's uses but can be developed further. Otherwise it may become redundant given the fast paced changes that we are seeing in terms of tools and technology these days ."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Matt",
          "Nb_Reviews": 8,
          "Date": "2019-04-13T17:58:43.000Z",
          "Titre": "A great start - much more work to do!",
          "Contenu": "I need to be able to colloborate with others, ideally without them having to also subscribe.Data needs to integrate with other sources, O365 Excel spreadsheets, etc, Microsoft Flow integration would be awesome.Alternative visualizations, charts, etc all driven from data sources I can easily extract data to."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kelly Kerstetter",
          "Nb_Reviews": 1,
          "Date": "2022-04-19T15:27:37.294Z",
          "Titre": "I really like the template option",
          "Contenu": "I really like the template option. However, one of the drawbacks is that any text or items moved in the slide revert back to their original positions when using the edit features in the plug in."
        },
        {
          "Note": 3,
          "Lieu": "BE",
          "Pseudo": "Koen",
          "Nb_Reviews": 1,
          "Date": "2017-11-30T21:17:26.000Z",
          "Titre": "No introduction or directions how to …",
          "Contenu": "No introduction or directions how to use the application.As soon as I started to use it first time, updates and commercial offers (e.g. for specific additional ?? templates) were being pushed.  Everytime this happens, it blocks my computer and I need to call IT support as we have no administrator rights for our company computers."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pilar Prentiss",
          "Nb_Reviews": 1,
          "Date": "2018-11-12T17:52:29.000Z",
          "Titre": "Difficult to customize",
          "Contenu": "I find MS Office Timeline to be the program of choice when preparing project timelines for clear presentation and planning. However, I find it extremely frustrating that if you make any manual changes or formatting to the timeline and then need to update a date, that all your formatting is lost and must be redone."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Boris",
          "Nb_Reviews": 1,
          "Date": "2017-10-25T22:12:48.000Z",
          "Titre": "This application imports MS Project …",
          "Contenu": "This application imports MS Project into PowerPoint. It saves substantial time that it would take manually. The S/W still has relatively few choices for how to display Project Data in  PowerPoint. For example, all manipulations with the Timeline and the Milestones can only be done in the original Timeline position. If the Timeline is moved from the original position then every manipulation of the milestones and tasks will make the timeline jump back to the original position."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul Oates",
          "Nb_Reviews": 2,
          "Date": "2017-08-03T18:18:40.000Z",
          "Titre": "I use PowerPoint once a week to report TIMELINE IS FRUSTRATING",
          "Contenu": "I use PowerPoint once a week to report project status instead of pdf's from Microsoft Project, and though it let me update timeline dates initially, it won't allow me to update the dates anymore and task(s) come in early, or are delivered late.Frustrating to have to log in (I think) to get the product to work.Once I purchase, it should be as easy to use as originally, AND become a stable and available part of my copy of PPT until it expires or something like that."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tania Jimenez",
          "Nb_Reviews": 1,
          "Date": "2020-04-01T17:55:26.000Z",
          "Titre": "A lot of upgrades needed",
          "Contenu": "It takes a lot of time to update the timeline after changesAny changes outside the app are not savedThere are not plenty of color, fonts, text position optionsIt would be great to be able to hide whole swim lanes, not only individual tasksMore expert training should be developed"
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "Amir Rashid",
          "Nb_Reviews": 1,
          "Date": "2017-07-01T21:28:17.000Z",
          "Titre": "•\tAccepting manual changes use to …",
          "Contenu": "•\tAccepting manual changes use to change all settings done on the page. Have to redo things again and again. •\tCouldn't find all templates when intended to change from change icon. Only typical options were available. •\tIts good add in, still needs a lot of improvement and pricing also needs reviewing. •\tPer year subscription is expansive, considering price tag the expectations were much higher. More functionalities is needed to add. Compare to office suite per year subscription is very high."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Debra Mueggenberg,",
          "Nb_Reviews": 1,
          "Date": "2017-06-23T18:16:36.000Z",
          "Titre": "If you just need the basic function …",
          "Contenu": "If you just need the basic function that the add-in talks about then this is the tool for you.  I liked it, I would recommend this to a co-worker but I would include some discussion around the software limitations. Overall great software but they have room for development to make it an extremely powerful tool."
        },
        {
          "Note": 3,
          "Lieu": "FI",
          "Pseudo": "JS",
          "Nb_Reviews": 1,
          "Date": "2017-09-25T07:12:18.000Z",
          "Titre": "Good tool in general.",
          "Contenu": "Good tool in general.I would like to see a possibility to add some extra information as an option to timeline. Like just free text or possibility to add own field like classification or something like that. Based on classification it would be nice to have same colors in timeline for same classes. Thanks."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Timo Motejat",
          "Nb_Reviews": 1,
          "Date": "2020-12-14T17:52:28.000Z",
          "Titre": "Good but more visual features needed",
          "Contenu": "I think the tool is very helpful but I would like to have some more visual timelines/roadmaps without real time goals and more like steps or rows of actions to visualize projects or actions list in more high level and with more “management acceptance”"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeanine Haymond",
          "Nb_Reviews": 1,
          "Date": "2019-09-30T11:52:12.000Z",
          "Titre": "The concept is excellent, however",
          "Contenu": "The concept is excellent.  However, I like/need to do custom formatting in PowerPoint, ie moving things, spacing, font sizing, etc, but each time I make a change in editing, it resets the formatting and I have to redo my customized formatting.  It can be time consuming."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stephen",
          "Nb_Reviews": 4,
          "Date": "2018-11-08T23:52:59.000Z",
          "Titre": "The results are fairly easy to get to…",
          "Contenu": "The results are fairly easy to get to and Timeline's Powerpoint slides look really nice.  There isn't as much room on a slide for the tasks we'd like to show, so consolidation was necessary.  We'd purchase the product again and indeed, we'd pay for an upgrade."
        },
        {
          "Note": 3,
          "Lieu": "BE",
          "Pseudo": "Johan Wouters",
          "Nb_Reviews": 3,
          "Date": "2018-03-18T22:06:59.000Z",
          "Titre": "To much money for what you get",
          "Contenu": "To much money for what you get. The idea is good, but I cant find to much on the internet to learn about all the possibilities. Maybe I looked at the wrong places ? If I change the start date will all other milestones dates shift to ?How dynamic can I make it ? Or is it only static ?"
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "Antonio",
          "Nb_Reviews": 1,
          "Date": "2017-06-20T18:44:49.000Z",
          "Titre": "The main weakness of the current …",
          "Contenu": "The main weakness of the current version is that there are no dependencies between tasks. If you change one date you need to change all the others that are associated manually. This is time consuming and has a high probability of errors.In addition to that, it is possible to change the format of a single text box, but it is not possible to keep the desired format/position of the single task boxes. So at each refresh all the customizations are lost. More flexibility and few improvements will help to have a more user friendly product."
        },
        {
          "Note": 3,
          "Lieu": "NZ",
          "Pseudo": "Greg Ferguson",
          "Nb_Reviews": 1,
          "Date": "2020-09-08T19:14:19.000Z",
          "Titre": "Not a bad tool for conveying timelines…",
          "Contenu": "Not a bad tool for conveying timelines for projects at a high level.  The tool is easy to use and intuitive but is certainly not able to convey project elements in any detail as it struggles when it comes to displaying larger numbers of line items."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Manal Fournier",
          "Nb_Reviews": 1,
          "Date": "2019-07-08T12:51:30.000Z",
          "Titre": "Office Timeline enhancement",
          "Contenu": "The timeline creation is nice, but I need to edit the timeline to  effectively communicate our needs. Every time I do, it timeline reverts back to the original format, which limits my use of it.  It would be helpful to ask users if they want to keep their edits."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "mdspitler",
          "Nb_Reviews": 1,
          "Date": "2018-11-26T14:54:39.000Z",
          "Titre": "the timeline is very nice",
          "Contenu": "the timeline is very nice, could use a few more customization options, but overall nice. The major drawback is that it hangs a lot when opening slides with timelines on them. Opening and editing the data often takes 10 seconds or more. Saving changes is likewise slow."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Andrea Sanchez",
          "Nb_Reviews": 1,
          "Date": "2019-06-19T15:46:47.000Z",
          "Titre": "The software is bit buggy",
          "Contenu": "The software is bit buggy. I had issues with the installation and at first half the options weren't available to me. I had to uninstall and re-install. It works better now but every time I open powerpoint I have to go to my add-on manager and push it enable."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Davide Cadore",
          "Nb_Reviews": 1,
          "Date": "2019-05-24T12:33:57.000Z",
          "Titre": "timeline is a very good plan",
          "Contenu": "timeline is a very good plan, where execution lacks of the same powerIt's helpful in making order when you're handling so many dates and milestones. Unfortunately software seems to be a little bit stiff, not always  flexible enough for typical .ppt business purposes (i.e. when the time lapse is more 1Y and project is plenty of milestones/events grahic choices appear poor and limited). I deem it still remain a good idea, and potentially very useful even if in much more limited range of cases than you expected. It's just a little bit too expensive for what you can do through it"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2021-07-01T16:54:12.000Z",
          "Titre": "Solid product but has it's frustrations",
          "Contenu": "Solid product to help reduce the pain of visualizing timelines.  However, timeline management screen is very buggy when on a two monitor setup.  Also takes multiple hoops to compact or redesign layouts to better fit slides.  Ideally I would be able to download/upload large changes into the same chart... any upload creates a new slide, which means having to repeat all the formatting edits all over again - which can be significant!   Does it save me time? absolutely and a decent bit.  It is frustrating to use?  Yes, there are sufficient bugs/oversights that make it a very middle of the road product that just tips the scale on benefits v. cons.  This review is against BUILD number 5.01"
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "No Name",
          "Nb_Reviews": 1,
          "Date": "2021-12-30T12:13:23.000Z",
          "Titre": "Office Timeline Templates",
          "Contenu": "Hi, this is a great tool, but it is not a user friendly as it should be, in my opinion, specially for the creation of the templates and the templates which are already defined.Have a nice day"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Douglas Findley",
          "Nb_Reviews": 4,
          "Date": "2019-09-30T10:29:04.000Z",
          "Titre": "I am confused by the subscription…",
          "Contenu": "I am confused by the subscription emails.  I want to use the application but do not understand if I am using a lesser application or a pro application.  I will not go through this process to renew next year, there are other tools I'll use."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Mayers",
          "Nb_Reviews": 1,
          "Date": "2021-06-23T17:33:11.000Z",
          "Titre": "ITs not intuitive",
          "Contenu": "ITs not intuitive, whenever I customize a timeline, it gets messed up, I spend too much time making the timelines presentable. I really need some support to be able to adjust the timelines to look presentable."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jenaj",
          "Nb_Reviews": 1,
          "Date": "2021-05-23T03:43:33.000Z",
          "Titre": "I love the timeline concept but there are so…",
          "Contenu": "I love the timeline but there are so many fundamental issues when changing the timeline...and it's really a lot to type. If someone would like to call me to receive the information, I'm happy to do that."
        },
        {
          "Note": 3,
          "Lieu": "SE",
          "Pseudo": "Helena Engström",
          "Nb_Reviews": 1,
          "Date": "2017-12-11T08:12:52.000Z",
          "Titre": "Suggested approvements",
          "Contenu": "The product and the idea is great. It is a very simple way to create new timelines and I think the product has great potential. However, the product needs to develop. Here are a few issues:- If you change the dateformat in a timeline, it will not follow when you create new tasks to the timeline.- I miss a possiblility to set my own settings in terms of layout and dateformats, that I always want to be default.- If I want to split the tasks in the timeline for some reason, (example that the upper tasks belong to one project and the lower another) I would like to have the possibility to mark or divide tasks."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bree",
          "Nb_Reviews": 1,
          "Date": "2018-11-30T19:04:07.000Z",
          "Titre": "Useful product but requires patience",
          "Contenu": "I really like office timeline, I have found it to be super useful when we need a quick visual of project plans. However, when I make changes to the timeline or shift things around, it causes long delays and powerpoint doesn't always respond"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kathy O'neal",
          "Nb_Reviews": 1,
          "Date": "2019-09-20T20:34:33.000Z",
          "Titre": "The concept is great",
          "Contenu": "The concept is great - would like to see the cosmetics worked out a bit more.  Specifically where you have parent activities and sub tasks.  But overall find it is a very useful tool in providing clean professional timelines via ppt."
        },
        {
          "Note": 3,
          "Lieu": "BE",
          "Pseudo": "Laura Ingles",
          "Nb_Reviews": 1,
          "Date": "2018-03-14T09:57:39.000Z",
          "Titre": "It's a nice basic timeline with some flaws",
          "Contenu": "It's a nice basic timeline, but there are 2 significant issues that bother me (I) I copied a PowerPoint slide to copy the timeline format, updated all the tasks and related details to the new project. However, when I made an adjustment later it added back all the information from the original timeline - annoying(ii) when I manually move details, heading/dates/milestones on the timeline and click the Green Check Arrow to confirm my changes, then changes don't stickThe result is when it works it does what it says on the tin, but when it doesn't I wish I'd just made it our of shapes from PowerPoint instead"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lars Wood",
          "Nb_Reviews": 1,
          "Date": "2020-10-16T17:19:51.000Z",
          "Titre": "Good product but I would like to see…",
          "Contenu": "Good product but I would like to see changes to dates ripple through following tasks. This is a huge problem. Much less important to have lines with arrows option to connect critical path tasks elsewhere on the chart."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeff Su",
          "Nb_Reviews": 1,
          "Date": "2018-01-11T03:09:22.000Z",
          "Titre": "The time date setted always go back to …",
          "Contenu": "The time date setted always go back to the beginning of each month. E.g The activity start from Jan, 15 end at Jan, 28. then we open this timeline file again, the start date automatically back to Jan, 01.  I don't know why?RegardJeff"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "C. Jones",
          "Nb_Reviews": 1,
          "Date": "2020-07-19T13:09:28.000Z",
          "Titre": "Office Timeline works as advertised but…",
          "Contenu": "Office Timeline works as advertised but it is a narrow band of value-add. Would be attractive to a broader group of users if it supported more uses. Examples: more dynamic powerpoint presentations, interface with Visio,"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Todd Lewis",
          "Nb_Reviews": 1,
          "Date": "2018-01-08T18:54:05.000Z",
          "Titre": "This program shows promise but is lacking right now",
          "Contenu": "This program shows promise, but it really doesn't deliver the functions I needed, so far as I can tell. I am looking for a timeline that is built of historical events (not a future to-do list sort of timeline), which can accommodate potentially hundreds of individual data points, and which one can then zoom in on a smaller sub-set of those points. Several data points are only minutes or seconds apart, so once they are piled on the screen the user can not distinguish the various points. Maybe this is not the functionality you're aiming for, in which case it would be nice to overtly describe that it doesn't do these things."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "PM Morgan",
          "Nb_Reviews": 1,
          "Date": "2018-03-27T04:01:54.000Z",
          "Titre": "Normally great, but the last rev, not as good as the last",
          "Contenu": "Hi - Last version was awesome! This version I am getting more imports into PPT that are not a Timeline object which is a bummer. Prior to the last upgrade, I consider this my secret PM ninja tool. I know you guys will figure this out!"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Nick",
          "Nb_Reviews": 1,
          "Date": "2019-07-14T01:49:29.000Z",
          "Titre": "Office Timeline Cloud Version OK but not Great, Desktop version Great",
          "Contenu": "While 3 Stars it really is close to a 5 when compared to the competition.I had previously used the Office Timeline Desktop Version for the past couple of years and found it great for quick project updates.The cloud version slow and some features are missing.Licensing it would of been worth an extra few $'s if the license provided cloud and desktop client as a single license plus the ability to purchase lifetime updates.Enhancements intergration to Viso and Excel Timelines rather than just PowerPoint would be fantastic.If you are looking for an easy to use tool to present quick timeline this is a must but check both demos to get the version that suites you."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jo Johnson",
          "Nb_Reviews": 1,
          "Date": "2017-07-06T20:54:25.000Z",
          "Titre": "- I think a video of each template with …",
          "Contenu": "- I think a video of each template with how-to's would be helpful.  I had to really manipulate the slides to get them to be presentable. - I wasn't happy with my final result - I like the fact that mspp can be uploaded"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bryan Nicholson",
          "Nb_Reviews": 1,
          "Date": "2019-12-04T22:18:09.000Z",
          "Titre": "I'm brand new to Office Timeline",
          "Contenu": "I'm brand new to Office Timeline.  My experience is limited but, so far, I really, really, really like it.  I really, really, really don't like that it costs so much more just to get the Swim Lanes feature."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "R Hicks",
          "Nb_Reviews": 1,
          "Date": "2018-04-23T09:56:48.000Z",
          "Titre": "I like office timeline a lot but it…",
          "Contenu": "I like office timeline a lot but it still needs some tweaking. My Gantt Chart is long and as a result it will move out of the boundary on the power point slide. I wish that could be fixed. Also my milestone dates are close together and sometimes the text will collide with another milestone's line. If I move to timeline up a little, the timeline and gantt chart are completely disorganized from that point on. I can not make any significant design changes because the text and pictures will overlap each other. This being said online timeline offer a much better solution to designing timelines than Microsoft project. I hope these issues can be fixed in subsequent builds."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Requeted Reviewer",
          "Nb_Reviews": 1,
          "Date": "2017-08-24T18:27:37.000Z",
          "Titre": "Office Timeline Review",
          "Contenu": "It helps you automate the making of nice charts. The outcomes are fantastic. There is some learning curve and it is easy to make fatal mistakes that force you to start over. I expect it will get better with future updates."
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "Massimo Zanotti",
          "Nb_Reviews": 1,
          "Date": "2020-02-23T08:59:05.000Z",
          "Titre": "It is useful only if utilized by…",
          "Contenu": "It is useful only if utilized by copying data from other apps like Wrike or project.The import from project works only partially as swim lanes are not supported. That was the best feature to have available."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike Strickler",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T22:22:57.000Z",
          "Titre": "Feature",
          "Contenu": "Hello - Just an idea on features.  Date format for Tasks - Please add an option for only displaying the month.  Meaning \"Nov\" Only option includes the year \"Nov 2024\"  The year is obvious in the timescale bar.  So repeating the year on the task is redundant takes up valuable Slide Real Estate."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Meghan",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T15:42:43.000Z",
          "Titre": "Amazing tool!",
          "Contenu": "This is a really great tool! As a program manager, I rely on timelines really heavily! I the abilities that timeline allows that other tools don't or don't allow as intuitively. One suggestion is that sometimes the formats get too large for slides. It would be great if there were more options to fit the visual to the slides differently."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alberta",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T07:20:09.000Z",
          "Titre": "Great tool for executive presentation",
          "Contenu": "I like that I have multiple templates to choose from.  Officetimeline has been my go-to tool for executive presentations since I learned about it about 5 years ago.  I only wish you could add dependencies in the online version."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Aashish Bhatia",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T02:23:28.000Z",
          "Titre": "Saves soooo much time",
          "Contenu": "Saves soooo much time creating timeline presentations from MS project schedule"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephanie Hidalgo",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T20:48:25.000Z",
          "Titre": "Could have been 5 stars but ...",
          "Contenu": "Could have been 5 stars but ...Every time I open Powerpoint, I had to enter the license in order for the features to be available. Export function should retain configuration of each task/milestone (shape and color at a minimum) so when Uploaded again, there are less cosmetic changes need to be made. I also keep hitting some Upload issues where some rows can't be ported over. Providing reasons why would help.Overall, though your app has made my life better. This app has reduced my work time by 50%. I believe I can get 75% time reduction if the Upload function is improved."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ilker Uyanik",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T23:21:58.000Z",
          "Titre": "It is a well designed and intuitive…",
          "Contenu": "It is a well designed and intuitive add-on. I use it with Smartsheet. The search is a bit slow, when you choose the sheet using search. Also when the program putsThe labels on the bars, it ignores the boundaries of the chart or the object and writes over bars or spills outside of the chart area. Not minor and I fix it manually. (I like the manual change option provided)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Luis Cifuentes",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T19:27:31.000Z",
          "Titre": "Great",
          "Contenu": "Great. could be even better if you improve basic things such as being able to adjust the horizontal positioning of the timeline. or better yet do it similar to Thinkcell where the user defines the position and size of the object by clicking and dragging."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Project manager",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T20:01:31.000Z",
          "Titre": "In verry limited tim you can create all",
          "Contenu": "In verry limited tim you can create allSorts of timelines. Using this tool the effort goes into actual planning instead of deciding on what form to use and draw this out."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Bellovin",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T20:57:55.000Z",
          "Titre": "Timeline works great",
          "Contenu": "Timeline works great.  It's a fairly seamless solution for building and managing timelines for our organization.This is actually the third time I've purchased it for my organization, and every time other people see it at work, and they want a license, as well. The only issue I have run into is that it keeps losing the current license, meaning I need to look up the license and re-enter it to use Timeline."
        },
        {
          "Note": 4,
          "Lieu": "TR",
          "Pseudo": "Halil Sefa Gerdan",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T23:42:03.000Z",
          "Titre": "İ belive that some functionality such…",
          "Contenu": "İ belive that some functionality such as baseline vs plan compare and visualizing that will be good. Baseline 1,2,3 and plan start/finish etc.Using project calendar or resource calendarEven project desktop, also microsoft project for web or project online integration that will be so good.additional templates to inspire and automation.So many company use jira datacenter or some other tools if the system provide rest api json call to gathering data that will be usefull. Actually there are a lot of things but good job guys. İ use it, love it. Almost 5-6 years ago i use it free version and also i suggest you to a lot of company in Turkey."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Virginia Roberts",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T09:10:26.000Z",
          "Titre": "Love that I can export from Smartsheet",
          "Contenu": "Love that I can export from Smartsheet. This is a great way to create a presentation based on Project milestones and/or key deliverables. It would be wonderful if multiple PowerPoint pages are required to display the Office Timeline presentation that this was more automated. Editing is a little arduous. That said, Office Timeline is a fabulous tool to help present Exec Project Summaries from the detailed plan.The Office Timeline Team are delightful and so very helpful and knowledgeable in their introduction session for new users."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michelle Hunter",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T20:58:40.000Z",
          "Titre": "Great timeline tool",
          "Contenu": "Pros1. Great templates2. Easy to import dataCons1. Editing data for previously create timeline is more manual than expected. 2. Would be nice to have flexibility to add additional % field to show percentage progression."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel Russ",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T18:04:01.000Z",
          "Titre": "There are two features I would like to…",
          "Contenu": "There are two features I would like to see:1.  Option to \"fix\" the vertical and horizontal margins of the chart so as to eliminate having to adjust these margins after updating data.2.  Option to automatically update data from source spreadsheet upon opening the PPT file.  Currently, one needs to click on update data to accomplish this."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott Wagner",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T19:27:40.000Z",
          "Titre": "Amazing Timeline Tool",
          "Contenu": "This tool makes creating my timelines so much easier and faster.  I love that I can update it by simply change a date.  I've been using the free version for several years and recently update to the Pro version due to my projects becoming more complex.  I love the swim lanes feature but was disappointed when I discovered adding levels to a swimlane required yet another upgrade."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JS",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T20:09:50.000Z",
          "Titre": "Great product, minor nits",
          "Contenu": "This is a great product and nothing comes close for options, professional results, and ease of use. I do feel I have to deduct one star because it constantly pops up with: Style Pane, and offers for consulting work with the company. I know Style Pane can be disabled, and probably the ad as well, but man, I bought the full package I don't want to hear about other services every time I use it as a default. Secondly, sometimes it lays out longer task names oddly, but pretty easy to fix by hand. Again highly recommend overall and great money spent for any professional."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott Cloud",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T20:27:33.000Z",
          "Titre": "Easy to use and great visuals",
          "Contenu": "Easy to use and great visuals! The only reason I gave 4 instead of 5 stars is that I wish there were some easier ways/tools to make changes to the final visuals... text size, fonts, etc. The latest version did address some of this, but I find myself getting the format how I want on the slide, then going back and updating a date or two and having to re-do the formatting again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Simons",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T19:53:21.000Z",
          "Titre": "I've just started using this",
          "Contenu": "I've just started using this, so I don't know much yet. What I'm hoping it will provide is a good middle ground between MS Project which is cumbersome and more detailed than I need for most projects, and writing out a schedule in an email."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Keith Cramer",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T20:09:03.000Z",
          "Titre": "Mac functionality would be good",
          "Contenu": "Mac functionality would be good – and control over how the time scale is broken up. Very helpful when I’ve emailed with questions. Excellent product. Great visuals."
        },
        {
          "Note": 4,
          "Lieu": "AE",
          "Pseudo": "Mark Quince",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T07:57:53.000Z",
          "Titre": "Office timeline is relatively easy to learn and use",
          "Contenu": "Office timeline is relatively easy to use and intuitive. The learning curve is short in terms of getting straight out of the box results.There is one annoying bug which essentially resets your character and object position changes when the user opens and closes the timeline menus."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Angela S",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T21:21:18.000Z",
          "Titre": "Intuitive and easy to use.",
          "Contenu": "The tool was intuitive and easy to use. It works great for shorter timelines, but my first timeline was a 5-year project with more than 50 tasks, which seemed to push the tools graphical limits. The tool gave me a great starting point, but eventually, I did have to disable the auto-update feature to manually adjust text orientation and make it fit within the space I had available. I will definitely use this tool again and hope to make the graphics without so much customization."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William LaRue",
          "Nb_Reviews": 7,
          "Date": "2023-04-22T00:23:21.000Z",
          "Titre": "Great App to make boring Gantt Charts Exciting!",
          "Contenu": "I have used the Office Timeline app to create \"swimlane\" work breakdown structures for presentation to Stakeholders. They appreciate the breakout of responsibilities on our projects. I found the app somewhat confusing at first, especially in dealing with data, but soon learned how to make things work out. I have yet to use all the templates.."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sue Grinius-Hill",
          "Nb_Reviews": 1,
          "Date": "2023-01-10T19:29:11.000Z",
          "Titre": "It's an intuitive and easy to use tool",
          "Contenu": "It's an intuitive and easy to use tool.   I've used it to create many charts for nice looking presentations over the past several years.   I gave it 4 instead of 5 stars because, as with any software, there are things I want to make it do that it's not designed to.  Specific custom additions added to a diagram, etc.  for that I can use other tools."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alan Ruskin",
          "Nb_Reviews": 1,
          "Date": "2022-10-06T19:47:51.000Z",
          "Titre": "Office Timeline has been a great help…",
          "Contenu": "Office Timeline has been a great help to us in presenting project schedules in a more visually appealing way.  GANTT charts a too cumbersome for a management presentation and Office Timeline has helped quite a bit.An area for improvement though would be the addition of baseline v actual.  This is what senior managers and executives want to see."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott Straka",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T20:22:53.000Z",
          "Titre": "Good integration with PowerPoint and Smartsheets",
          "Contenu": "Product has evolved over the past few years.  Best way to show a schedule in PowerPoint to senior mgmt w/o making it an eye chart exam.  Integration with Smartsheet.com makes for a very low effort workflow to share updates."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bhanu Jagasia",
          "Nb_Reviews": 4,
          "Date": "2022-06-12T16:18:39.000Z",
          "Titre": "Almost perfect",
          "Contenu": "Almost perfect. Great service and application however some nuances which make it frustrating to use:- When using the desktop application, if you try to fit the timeline in a custom slide, it's one of the most challenging things to do- still doesn't have dependencies logic built in like smartsheet. makes adjusting timelines a nightmare if already imported into Office Timeline- No option for timeline to show every monthThose are the major challenges we have with Office Timeline -- there are some other quirks which are annoyances but the those are the top three. Regardless, if you know your way around applications and design, you can still make the necessary adjustments requirements."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JT",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T17:07:32.000Z",
          "Titre": "Office Timeline Pro+ & Smartsheet timelines",
          "Contenu": "I use Office Timeline Pro+ pull data in from Smartsheet to build timelines.  The timelines are great and save a lot of time when producing presentations for the executive team.  I have built a few customized templates, which are finicky and a little glitchy.  Overall I am happy with the product; looking forward to the day (hopefully soon) that they have the glitches smoothed out."
        },
        {
          "Note": 4,
          "Lieu": "KR",
          "Pseudo": "Joey",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T04:26:15.000Z",
          "Titre": "Easily can create a great looking &…",
          "Contenu": "Easily can create a great looking & well-organized timeline. The best thing I like is importing data from Project file. One other great thing is creating own template, can create a master template for a company, and apply for many projects."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Bryony Harrop",
          "Nb_Reviews": 1,
          "Date": "2022-08-30T08:50:47.000Z",
          "Titre": "Product is having a positive impact",
          "Contenu": "I love the product and it is having a real impact on how we are working – the whole company is now working from aligned plans rather than there being multiple slidesets floating around with slightly misaligned assumptions.It is a little fiddly, but I find the effort is worth it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alex DelGiorno",
          "Nb_Reviews": 1,
          "Date": "2022-05-25T19:32:40.000Z",
          "Titre": "This is my go-to tool",
          "Contenu": "This is my go-to tool above several others because of the import and control options with some of the most modern feel. I was happy to see the update for more swimlane functions. I would love to see the feature support Mac as that is my preferred system. Also, an improved import from Smartsheet would be extremely valuable in the future."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RaiW",
          "Nb_Reviews": 2,
          "Date": "2022-07-27T19:38:35.000Z",
          "Titre": "Improvement over visio and excel",
          "Contenu": "I have been using visio and excel to create roadmaps and timelines, office timeline pro makes it a lot easier to manage and my management team loves the format. The only gripe i have is there does not seem to be a way to import a template without importing the bogus data in the template. It would be great to just import the design format. Easy to clean up but a hassle none-the-less."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ak",
          "Nb_Reviews": 1,
          "Date": "2023-04-02T04:23:57.000Z",
          "Titre": "Great",
          "Contenu": "Great! Very helpful. Except the content should auto-size for big projects with multiple activities and phases. But the most important issue is pro edition is very expensive. Please offer lower prices."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "H Schmidt",
          "Nb_Reviews": 1,
          "Date": "2022-10-26T19:35:10.000Z",
          "Titre": "Using office timeline in pharma",
          "Contenu": "Office timeline allows me to use powerpoint features together with keeping track of timeline dates. It is very convenient for those proficient in ppt. The free version was not good to test the program, but office timeline pro works very well for me"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ashley Hall",
          "Nb_Reviews": 1,
          "Date": "2022-05-24T22:40:18.000Z",
          "Titre": "UPDATED: The tool errors out when trying to add…",
          "Contenu": "The tool errors out when trying to add a custom color.Edited as I can't reply to the reply:The issue I'm having is when I'm in \"Edit Data\" view. When I click on the task or milestone color --> custom color --> then click on one, the edit task/milestone box abruptly closes. I believe this is a software glitch and not an issue with clicking \"accept changes\" or clicking \"okay.\""
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tim Jackelen",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T20:39:10.000Z",
          "Titre": "Love the product",
          "Contenu": "Love the product.  I keep using from client to client.  I have a problem though because I have to use a different user ID with each client, so it involves a new license.  That gets expensive, plus of course the price is up to $150 now.The price though is still a very good value."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Justin Miller",
          "Nb_Reviews": 1,
          "Date": "2022-12-19T16:08:18.000Z",
          "Titre": "Office Timeline is solid",
          "Contenu": "Office Timeline is solid!  It is easier than Project or Excel for internally managing a changing schedule, and it creates customer-ready visuals for free.I'm not an expert user, but it did not seem to support task dependencies and so each task's date range had to be managed individually."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff Brewer",
          "Nb_Reviews": 1,
          "Date": "2022-08-26T19:24:19.000Z",
          "Titre": "Life Changing (sic)",
          "Contenu": "The product literally saves hours of effort - especially when edits must be made. I used to use Excel for the same purpose - it's a night and day comparison. It has some rough edges that could be improved, but it's a solid tool for the purpose."
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Thomas Weedman",
          "Nb_Reviews": 1,
          "Date": "2022-06-02T08:33:13.000Z",
          "Titre": "Good Day - my concerns area to fix/investigate",
          "Contenu": "Good Day, i really enjoy your product and have used it for 2 years, however there are some issues!1) i could not find a way to upgrade from the basic to pro without paying full price again, eg: the basic is 60 dollars and the pro is 100, but if i buy basic and then want pro i need to pay the full 100, there should be the option to upgrade for the outstanding 40.2) if someone starts a timeline in basic and is sent to me for approval and i make a change using pro then then it can no longer be edited buy a basic user, this seems like a money making \"scam\" to force people to upgrade (again with a full price).Both these examples happened to me and is costly for small companies."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Goekhan Eris",
          "Nb_Reviews": 1,
          "Date": "2022-09-27T09:04:35.000Z",
          "Titre": "The tool is really powerful and helps a…",
          "Contenu": "The tool is really powerful and helps a lot, to save time for presenting complex timelines. However, the import functionality from MS Project needs to improved. I tryied it several times now, but came to the conclusion, that is for an unfortunate not presenting the chart as per my wishes - means it takes to much effort to rework the imported chart in timeline - therefore its always faster, to create the same chart from the scratch. Further, the dependency functionality is not given like in MS Project. It would be a great add to have the functionality of predecessor of a Task/Milestone in it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "M. Abrams",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T20:21:27.000Z",
          "Titre": "Fast, Easy, Powerful Communications Tool",
          "Contenu": "This is a great product. I started with the free trial version a number of years ago and worked my way up to the Pro+. It is a fast and simple way to create a powerful scheduling tool without the challenge of using  complex MS Project type tools."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian Nahodyl",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T20:40:10.000Z",
          "Titre": "Easy to Use and Manipulate Visually",
          "Contenu": "Easy to use and manipulate the data and chart organization. This is a simpler tool than something like P6 or Project to create a timeline vs an in-depth Gantt chart. I would put this in the category of a representative/visual tool useful for providing a high level representation."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Victoria Rivard",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T19:27:50.000Z",
          "Titre": "Center Gantt on Slide",
          "Contenu": "Center Gantt on SlideIt would be great to have an option to center the gantt chart on the slide. I always have to center everything after any adjustments are made. Hourly gantt chart for planned shutdowns."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Keith Baker",
          "Nb_Reviews": 1,
          "Date": "2022-07-11T16:10:00.000Z",
          "Titre": "Solid Tool with Room to Grow",
          "Contenu": "Office Timeline automated a previously manual process.  Its fairly easy to use the tools within Office Timeline.  There are some areas of opportunity for customization and has some oddities in how it populates the items within the roadmap, but overall this is a solid product."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Ali Murrell",
          "Nb_Reviews": 1,
          "Date": "2022-06-29T10:16:16.000Z",
          "Titre": "Nice Excel / Powerpoint GANTT solution",
          "Contenu": "Needed a simple excel based solution to building GANTT charts and this nailed it. My only ask would be that the pricing was changed or made a little more clear as in the end I had to keep upgrading to get the functionality I needed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Stella",
          "Nb_Reviews": 1,
          "Date": "2022-12-30T16:08:35.000Z",
          "Titre": "In general it's fairly easy to set up",
          "Contenu": "In general it's fairly easy to set up.  However, if you want to shrink the entire timeline to fit a slide for example, that seems to be fairly difficult.  I am also having trouble with the linking of tasks.  I want to be able to change one date and have all the rest update.  But I can't seem to figure that our as well.  This is probably my issue.  But what I really like about the program is that I use it for clients - it's visually simple and I love having everything live in PowerPoint.  So that's super convienient."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Maria Byrnes",
          "Nb_Reviews": 1,
          "Date": "2023-01-15T06:24:04.000Z",
          "Titre": "I liked using this website as a study…",
          "Contenu": "I liked using this website as a study tool. The time was slightly difficult to navigate, but maybe I just cannot figure out how to set a time period frame. Overall great and super easy to use"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matthew Sandoz",
          "Nb_Reviews": 1,
          "Date": "2022-11-12T17:20:18.000Z",
          "Titre": "This product is great for creating professional timeline graphics",
          "Contenu": "This product is great for creating executive presentations of timelines. It has a few quirks and is not cheap but the product does what it says and the results are very professional"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mojgan Payombar",
          "Nb_Reviews": 1,
          "Date": "2022-09-29T19:21:12.000Z",
          "Titre": "Format changes",
          "Contenu": "One the biggest issue with Timeline is that every time I make a change to a date/descirpiotn, etc. the entire formatting that I created to match our company brand will go away and I have to redo them all."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Schut",
          "Nb_Reviews": 1,
          "Date": "2022-08-31T15:01:54.000Z",
          "Titre": "For high level gantt charts",
          "Contenu": "For high level gantt charts - this works great.  For highly detailed charts that require multiple levels - it does not work as well for me.  I do not have the advanced subscription - so that may remedy the situation - but really don't want to have to pay more."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "King",
          "Nb_Reviews": 2,
          "Date": "2022-08-13T19:47:14.000Z",
          "Titre": "A better, more user friendly experience …",
          "Contenu": "I am always in search of a better simpler way to build gatt charts. This fits that bill. I like the interface and the simplicity.There are a few upgrades I would suggest, but I am very pleased  with with your current phase. I’d be happy to speak with someone to give feedback but I am excited about where you are heading."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Patrick Temperli",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T16:36:11.000Z",
          "Titre": "Very useful and easy to work with",
          "Contenu": "Office Timeline is a very useful tool and easy to work with. It allows me to create clear and structured roadmaps in an easy way without losing a lot of time."
        },
        {
          "Note": 4,
          "Lieu": "GR",
          "Pseudo": "Evaggelinos Mariatos",
          "Nb_Reviews": 1,
          "Date": "2022-12-22T15:57:25.000Z",
          "Titre": "Tool is very easy to use and install.",
          "Contenu": "Tool is very easy to use and install.People in my team are using it extensively.Only improvement to suggest is if we could import from MS Project files."
        },
        {
          "Note": 4,
          "Lieu": "IL",
          "Pseudo": "Oren Arad",
          "Nb_Reviews": 1,
          "Date": "2022-06-27T13:25:51.000Z",
          "Titre": "Good product for putting together a simple Gantt",
          "Contenu": "Good product for putting together a simple Gantt chart.Still missing some tools that you can expect in project management SW"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": ".Steve",
          "Nb_Reviews": 25,
          "Date": "2022-12-08T09:48:58.000Z",
          "Titre": "Easy to develop timelines",
          "Contenu": "Easy to develop timelines, and update when requires I have used it few times in work, everyone was impressed. I need to do more in-depth time lines to give it a 5"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Marco Mariani",
          "Nb_Reviews": 1,
          "Date": "2022-11-16T23:54:39.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use. The size of the page cannot be extended so when you export large gannts the are not very nice. I’m using the online version because I’m on MacOS."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paola Lanza",
          "Nb_Reviews": 1,
          "Date": "2022-09-16T19:24:37.000Z",
          "Titre": "I find the program very useful",
          "Contenu": "I find the program very useful, however, there are some features that are not so easy to be utilized.Perhaps a detailed tutorial would be helpful."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Lorenzo",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T12:41:09.000Z",
          "Titre": "Feedback",
          "Contenu": "Easy to use, good integration with excel and MS project. However it would be nice to have more flexibility to select the items to visualize from an imported file."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Rose Robinson",
          "Nb_Reviews": 1,
          "Date": "2022-10-04T20:27:49.000Z",
          "Titre": "I found the product very useful and…",
          "Contenu": "I found the product very useful and effective, there are a few suggestions that can offer.It was quite a large complex timeline for my first one, I did really enjoy the software and will continue to use it..  There were a few things I would recommend for improvements:•\tBe able to show every year on the timeline instead of every two years.. I did find a work around and added some text boxes for the years that were missing but they have to go on at the very end as they will disappear.•\tWhen exporting,  the duration shows in days..  my project spans over 15 years, so it would be better if the default duration could be changed from days to months or even years.•\tWould be nice to be able to connect two tasks that are in different swim lanes, I know you can do this if all the text is all the way to the left….  But why not be able to do this regardless of where the text is.Of course these are just improvement suggestions and I am overall pleased with the software capabilities."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Dario Paolozzi",
          "Nb_Reviews": 1,
          "Date": "2022-06-07T08:44:19.000Z",
          "Titre": "I wanted to explore a new Campus…",
          "Contenu": "I wanted to explore a new Campus license model with Jodie, which is common for the fundamental research area. Office Timeline was agreed on such a topic."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eric Heise",
          "Nb_Reviews": 1,
          "Date": "2022-07-01T19:28:40.000Z",
          "Titre": "Great product",
          "Contenu": "Great product! I am able to spin up a high level timeline in minutes and edit on the fly! Would be really cool to get more templates and even import a project plan into it to automatically create timelines."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Kenton Smith",
          "Nb_Reviews": 1,
          "Date": "2022-10-26T00:08:07.000Z",
          "Titre": "This is a great plugin that works well",
          "Contenu": "This is a great plugin that works well. Sure you could probably make the timelines on your own, but this saves so much time that you don’t have to spend fiddling with PowerPoint or Excel."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Juan Espinoza",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T19:25:16.000Z",
          "Titre": "Great add-on to PowerPoint",
          "Contenu": "I am able to create roadmaps a lot easier with this product in PowerPoint. Very flexible in terms of presentation."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Rolf von Roessing",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T10:58:41.000Z",
          "Titre": "Useful and Intuitive",
          "Contenu": "Generally a good tool to use, and fairly quick to understand. No training required, just go ahead and set up those timelines."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Ciaran",
          "Nb_Reviews": 1,
          "Date": "2022-08-05T00:10:33.000Z",
          "Titre": "Great Product",
          "Contenu": "This product is great, easy to use and produces high quality visuals. Saves a lot of time on formatting and re-aligning of graphics that used to be how I did this."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Hallelujah Zeru",
          "Nb_Reviews": 1,
          "Date": "2022-08-22T17:39:13.000Z",
          "Titre": "A very easy and effective tool to use",
          "Contenu": "A very easy and effective tool to use. The only con I see is some of the features could be a bit limited and editing could be difficult or hard to make stick."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "experienced user",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T19:26:38.000Z",
          "Titre": "the features and functions in office…",
          "Contenu": "the features and functions in office timeline are great.  i think it is a bit overpriced and i would like a MAC version"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jason Keenan",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T20:20:49.000Z",
          "Titre": "OfficeTimeline Improves Alignment of Project Schedules and is easy to use",
          "Contenu": "OfficeTimeline is easy to use and allowed us to keep our detailed project schedules and plans-on-page in sync."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott Carrico",
          "Nb_Reviews": 1,
          "Date": "2022-07-01T20:08:54.000Z",
          "Titre": "Easy to Make A Schedule for a Meeting",
          "Contenu": "I am a scheduler for construction projects throughout the US and Office Timeline allows me to summarize my schedules so easily. Great presentation tool!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ash",
          "Nb_Reviews": 2,
          "Date": "2022-11-17T19:37:56.000Z",
          "Titre": "Great visual tool with easy integration",
          "Contenu": "The tool provides good visual, an easy intergration with Excel and Smartsheets. Integration with Powerpoint (firmatting) can be better though"
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "Tiago Freitas",
          "Nb_Reviews": 2,
          "Date": "2023-09-16T03:16:08.000Z",
          "Titre": "I like the software...",
          "Contenu": "I like the software. I've been using it for three years. I think the desktop version should just have a version with all the tools for $150."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lyne Butler",
          "Nb_Reviews": 3,
          "Date": "2022-10-26T00:00:43.000Z",
          "Titre": "Professional results",
          "Contenu": "I like the look of the resulting timelines but would need to spend more time on how to tailor a template."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Sante Galiazzo",
          "Nb_Reviews": 1,
          "Date": "2022-08-28T19:57:15.000Z",
          "Titre": "Nice/fast way to design/plan process",
          "Contenu": "Nice to design/plan processI wish a features not available: the possibility to format characters and to define position freerly"
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Johan Matthee",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T08:39:21.000Z",
          "Titre": "Ease of use",
          "Contenu": "The ease to put together a high level timeline, actions and progress for management to understand the status of the project."
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "Yves",
          "Nb_Reviews": 3,
          "Date": "2022-11-26T12:13:53.000Z",
          "Titre": "Good application",
          "Contenu": "Good application. Makes what it's meant for.There is still room for improvment."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Andrew Dixon",
          "Nb_Reviews": 1,
          "Date": "2022-12-08T16:33:41.000Z",
          "Titre": "Great!",
          "Contenu": "Helps sketching of ideas & different scenarios, and presentations that speak to a broader audience. Anxious for the roll out task relationships capability, as this will accelerate the schedule building process"
        },
        {
          "Note": 4,
          "Lieu": "IE",
          "Pseudo": "Veronica Lewis",
          "Nb_Reviews": 1,
          "Date": "2022-07-14T19:21:30.000Z",
          "Titre": "Great",
          "Contenu": "Great, only wish sometime I wish I could add more information in one timeline."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Roland Sonder",
          "Nb_Reviews": 1,
          "Date": "2022-05-23T21:04:00.000Z",
          "Titre": "Great tool for fast and easy project plans",
          "Contenu": "This is a great tool to fast and easy create a real appealing project plan."
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "Glenn Bosmans",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T09:03:41.000Z",
          "Titre": "easy and fast to use for beautifull…",
          "Contenu": "easy and fast to use for beautifull presentation charts"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Evdemon",
          "Nb_Reviews": 1,
          "Date": "2022-07-01T19:55:05.000Z",
          "Titre": "Fast, easy tool for creating timelines",
          "Contenu": "Very nice tool for rapidly creating polished timelines in your PowerPoint presentations."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ash",
          "Nb_Reviews": 2,
          "Date": "2023-05-22T20:14:17.000Z",
          "Titre": "Looks good and is effective",
          "Contenu": "Looks pretty good, is effective and helps maintain consistency."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Star",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T21:24:46.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use. Wonderful timelines that make impactful presentations."
        },
        {
          "Note": 4,
          "Lieu": "MY",
          "Pseudo": "Kho Yang",
          "Nb_Reviews": 1,
          "Date": "2022-10-27T02:45:01.000Z",
          "Titre": "User friendly and presentable format",
          "Contenu": "User FriendlyEasy to useClear and presentable formatEasy to edit from PPTCompatible to use in other PC"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Aspen Admin",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T19:39:36.000Z",
          "Titre": "Office Timeline integrates well with…",
          "Contenu": "Office Timeline integrates well with PowerPoint and saves me significant time generating and maintaining Gantt chart slides."
        },
        {
          "Note": 4,
          "Lieu": "PE",
          "Pseudo": "Cristian Ortega",
          "Nb_Reviews": 1,
          "Date": "2022-12-27T19:21:43.000Z",
          "Titre": "I really like the tool",
          "Contenu": "I really like the tool, it is flexible and easy to implement"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jill Yuhasz",
          "Nb_Reviews": 1,
          "Date": "2023-01-16T22:07:10.000Z",
          "Titre": "Its a great product but still a few…",
          "Contenu": "Its a great product but still a few bugs - can be fragile. Helping me with what I need."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas Scholl",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T19:19:14.000Z",
          "Titre": "It would be great if the app built…",
          "Contenu": "It would be great if the app built multiple slides from the data entered."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Ben Thompson",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T14:18:47.000Z",
          "Titre": "Love the simplicity!"
        },
        {
          "Note": 4,
          "Lieu": "HK",
          "Pseudo": "Mingbo Tian",
          "Nb_Reviews": 1,
          "Date": "2022-08-30T02:42:13.000Z",
          "Titre": "add a summary bar in your timeline…",
          "Contenu": "add a summary bar in your timeline would be better"
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Rodrigo Salinas",
          "Nb_Reviews": 1,
          "Date": "2022-05-18T19:25:54.000Z",
          "Titre": "I really like it",
          "Contenu": "I really like it, but there is one thing that can be improved, when you want to put the date or the name of the task above it, it only allows you tu put it in the lft side, it will be awesome if you could put it , in the middle, in the right or in the left, as per you needs.I think with that feature you can save a lot of  space in your timeline"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anna Garcia",
          "Nb_Reviews": 1,
          "Date": "2022-05-18T17:49:51.000Z",
          "Titre": "A gem and a must-have for anyone who…",
          "Contenu": "A gem and a must-have for anyone who needs to present timelines. Super easy to use, flexible and versatile, lots of nice templates available. The only con I see is that you have to choose between PowerPoint add-in or online version for the Pro level. It would be nice to have both in one, to enable collaboration with others."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jennifer",
          "Nb_Reviews": 1,
          "Date": "2022-05-20T19:20:38.000Z",
          "Titre": "This is a great tool for creating…",
          "Contenu": "This is a great tool for creating timelines. There are some small updates that would be great like making the dates link. Ex:  Date Ends:  12/1 Next Mile stone would be 12/2.  A little more flexibility with editing the timeline on the top.  Along with editing the entire timeline if the items don't fit on the page."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rodrigo GL",
          "Nb_Reviews": 1,
          "Date": "2022-04-26T01:25:36.254Z",
          "Titre": "Great add to your presentations!!!",
          "Contenu": "Tool is great! It need a lot of work to manipulate and grouping milestones to fit the space you would like to but at the end the effort is worth it.Still a little confuse when trying to work with a table and perform the changes at the table so it can be reflected at the presentation but I believe this is my fault (lack of time to learn more about the tool). So I always prefer to adjust data from PowerPoint tool bar."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Ingo Wübbels",
          "Nb_Reviews": 1,
          "Date": "2022-04-25T10:58:58.507Z",
          "Titre": "Office timeline experience",
          "Contenu": "I like to work with office timeline and develop timeline overviews in a good presentation format easy to read. Overall I am satisfied with the tool.I am looking forward to the next releases with hopefully more flexible time band (self choice what shall be shown) and with the possibility to show relations.In addition I would like to have the \"hide button\" also for the Task title even I understood why it wasn't implemented."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Kathy",
          "Nb_Reviews": 1,
          "Date": "2022-05-17T05:42:08.000Z",
          "Titre": "A simple and clear way to present a project plan",
          "Contenu": "Office Timeline a much better and clear way to present a project plan. There are some bugs in the software e.g. always default back to the original timescale settings or date/time format after each update. I would have given it a 5 stars if those bugs are fixed. Nevertheless, it's still an excellent tool."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vince Preising",
          "Nb_Reviews": 3,
          "Date": "2022-03-18T17:29:18.000Z",
          "Titre": "Love this tool for visualization",
          "Contenu": "Love this tool for visualization.  I use it for my program management.However, I was forced to move from Windows PC to Macbook Pro and I find the online tool a little cumbersome. Additionally, while I prefer Powerpoint, my company now uses the GSuite tools so the tool Google Slides is now my default.  If you can create a tool for Mac and GSuite, you'd have a huge growth opportunity"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Chris Simmons",
          "Nb_Reviews": 2,
          "Date": "2022-04-04T08:18:26.000Z",
          "Titre": "Easy to use visualisation",
          "Contenu": "Previously tried several different Gant visualisation methods to assist my teams in understanding end to end project timings. Office Timeline has received universal praise from my cross functional partners in it's clarity and for me, it takes minutes to pull together visuals for presentations, project meetings, specific workstreams."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jennifer Pierquet",
          "Nb_Reviews": 1,
          "Date": "2022-03-11T19:29:15.000Z",
          "Titre": "This is a great tool",
          "Contenu": "This is a great tool, but users should be aware of how much they can fit onto the timeline. I had to go to a 50,000ft view vs. a 10,000 ft view because I could not get the timeline to expand to include more information. I would love it if we could have the timeline go over two slides so we could add more detail when needed. No matter what this is a great tool for visualizing work and schedule."
        },
        {
          "Note": 4,
          "Lieu": "OM",
          "Pseudo": "Al Balushi",
          "Nb_Reviews": 1,
          "Date": "2022-03-13T05:03:32.000Z",
          "Titre": "Advantages & Area of Improvement",
          "Contenu": "It makes work easy with simple timelines that can be presented to clients and management and can show the detailed information with more simpler language . maybe needs more conclusive data to be shown like the total percentage of  completed tasks and percentage of time completed up to 'today' referenced.There is % completion when you edit data, but it is not accurate and doesn't show the actual number for some reason."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JB",
          "Nb_Reviews": 1,
          "Date": "2022-04-01T19:07:04.000Z",
          "Titre": "I think Office Timeline is a great…",
          "Contenu": "I think Office Timeline is a great alternative to using an MPP. It provides clients the ability to understand the high level milestones within their project without the need to study an entire project plan. So, far this tool has been very useful in assisting me with explaining the task requirements of my clients."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Joshua",
          "Nb_Reviews": 1,
          "Date": "2022-03-17T17:59:06.000Z",
          "Titre": "The charts look nice",
          "Contenu": "The charts look great, but the labels/headings for each item should be able to format to smaller pages. Often if the tasking or label is too long, it overlaps the bars and makes it much harder to read.There should be an ability to generate actual timelines, the more traditional ones with main or important dates listed along one single line. Would also be interesting to create an option for a timeline or gantt chart that is less linear. Something that reflects the iterative nature of work."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "CTA",
          "Nb_Reviews": 1,
          "Date": "2022-02-04T16:01:26.000Z",
          "Titre": "Comments:",
          "Contenu": "Comments:- I would be interested to reduce the size of the Chart in order that it could fit a powerpoint slide. At the moment the slide is (too) fast filled, it exceed the slide.I don't know how to proceed.- To align milestone I do it from the \"edit timeline\". Is there a way to do it with the \"style panel\". I did not find it and I do not know if it is linked to the chart style I selected at the beginning."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Philip HARRINGTON",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T12:12:14.000Z",
          "Titre": "As a contract project manager I use…",
          "Contenu": "As a contract project manager I use OfficeTimeline online version. Being in to cloud it can  follows me from client to client. Easy to use, seamlessly produces beautiful  PowerPoint presentations of my projects timeline that I can present to management. Something ms project desktop should do but does not. As a pm I do t have time to mess around in word or excel,  power point to produce a timeline diagram.  This app is awesome."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Reem Alzubeidi",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T20:10:09.000Z",
          "Titre": "Storytelling at your fingertips",
          "Contenu": "This product makes summarizing project timelines and milestones a breeze. It’s customization is completely unique and allows you to really tell a story to both members of a project team as well as C Suite execs or stakeholders. I love it so much I bought it with my own money and use it every single day."
        },
        {
          "Note": 5,
          "Lieu": "SK",
          "Pseudo": "Pavel Kravarik",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T11:48:13.000Z",
          "Titre": "Helping a lot with PMO update timeline",
          "Contenu": "Helping a lot with PMO timeline scheduling and updates to the teams."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sara Butler",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T23:00:04.000Z",
          "Titre": "Office Timeline is awesome.",
          "Contenu": "I love Office Timeline so much. As a program manager, this is a super helpful tool when I am making company facing, easily digestible timelines. 2 suggestions: 1. In a swimlane, it would be really helpful to be able to be able to have milestones or events NEXT to each other, just like how you can up top with the little milestone flags. It would help me use the swimlane space more efficiently, instead of having each milestone be on its own \"line\"2. Enable dependencies so that if I move milestone A out 3 months, the downstream milestones also move out 3 months, and i dont have to go through manually and do this. Y'all rock!! Keep up the good work."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "John D",
          "Nb_Reviews": 3,
          "Date": "2023-12-16T22:38:51.000Z",
          "Titre": "Great app",
          "Contenu": "Great app, have used for years. Continuously improving"
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "Adam Ginsburg",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T19:17:31.000Z",
          "Titre": "Using this tool for years through…",
          "Contenu": "Using this tool for years through various companies. Best solution for timelines"
        },
        {
          "Note": 5,
          "Lieu": "KR",
          "Pseudo": "Hyeun Jin Seo",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T02:26:04.000Z",
          "Titre": "development timeline maker",
          "Contenu": "development timeline maker - master plan timeline to present the timeline to the authority It would be  helpful if I could use various function more easily."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Anshu Guleria",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T02:14:33.000Z",
          "Titre": "Great tool",
          "Contenu": "I had a great experience using Office Timeline. The software made it easy to transition information from Microsoft Project and create timelines quickly. The software is priced competitively and is a great value for the money.Overall, I would highly recommend Office Timeline to anyone who needs a powerful project management tool and work quickly and efficiently"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sharon Reynolds",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T17:15:54.000Z",
          "Titre": "I really like using Office Timeline",
          "Contenu": "I really like using Office Timeline! I am a visual person and so it is helpful to view the Project's progress and definitely helps to identify bottlenecks slowing down progress. To be able to take an entire Schedule and view it in one powerpoint slide is groundbreaking. The fact that you can import your excel spreadsheet and don't have to type everything all over again in powerpoint is truly what makes this Powerpoint add-on a game changer. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Pip Crowder",
          "Nb_Reviews": 5,
          "Date": "2023-11-30T00:32:35.000Z",
          "Titre": "A great tool for condensing facts for…",
          "Contenu": "A great tool for condensing facts for the C suite who don't have time for detailed plans. Please keep working on the dependencies between swim lanes."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Jasin Doyle",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T00:34:51.000Z",
          "Titre": "Fantastic Project Timeline Tool",
          "Contenu": "Great tool for creating meaningful plans to present at all levels of the project organisation to quickly convey key messages....Great for executive level articulation of timelines and plan-on-a-page for busy project teams to give clarity of timelines. A go to for all my projects."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hamid Noorian",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T20:13:10.000Z",
          "Titre": "I generally use the office timeline to generate executive presentations",
          "Contenu": "I generally use the office timeline to generate weekly/monthly executive status reports.  I am able to download Microsoft project plans into the Officetimeline and generate high level timelines that can be inserted into Microsoft PowerPoint presentations."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Lyman",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T20:15:34.000Z",
          "Titre": "Office Timeline Rocks!",
          "Contenu": "Office timeline turns an otherwise tedious task of planning and communicating timelines into a quick, seamless experience.  The results are always impressive, and making any updates are very quick.  Thank you for a great product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elizabeth Elliott",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T19:26:13.000Z",
          "Titre": "Worth the price!",
          "Contenu": "Huge time savings instead of mapping the timeline out myself. Functionality available to make formatting go faster.  The biggest value-add was the training session with the expert!"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Nicolas B.",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T19:20:16.000Z",
          "Titre": "Great to bring nice timelines",
          "Contenu": "I'm using it since many years, it's really helpfull to bring nice and clear timelines to ppt presentation for top management"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carter B.",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T20:13:55.000Z",
          "Titre": "Consultant",
          "Contenu": "If you're doubting to get this tool, just get it. It makes super easy to use gantt charts and timelines, it's easy to change the template and edit it right in PowerPoint. In consulting where our timelines change frequently, it is very easy to keep our clients up-to-date on project progress and illustrate dependencies."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mike Bradburn",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T19:53:51.000Z",
          "Titre": "Well implemented and extremely useful",
          "Contenu": "Easy to use, easy to configure. Whenever I thought “I wish it could do this…” I found that they’d already thought of that…Perfect for creating summary slides from complex MS Project files."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Wishon",
          "Nb_Reviews": 3,
          "Date": "2023-12-07T19:22:34.000Z",
          "Titre": "Absolutely a great product that made my…",
          "Contenu": "Absolutely a great product that made my life 10x easier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Hayes",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T20:29:30.000Z",
          "Titre": "Easy to integrate with my existing…",
          "Contenu": "Easy to integrate with my existing Microsoft Project tool to enable various levels of visual detail based on stakeholder needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Faverman",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T20:23:28.000Z",
          "Titre": "This is the best tool I have found to…",
          "Contenu": "This is the best tool I have found to easily create timelines for executive summaries. hands down."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Misty Schmidt",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T15:01:41.000Z",
          "Titre": "It makes creating and editing detailed…",
          "Contenu": "It makes creating and editing detailed visually appealing timelines easy. Using OfficeTimeline also saves me a LOT of time that would be required to create something similar manually."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anne Shoemaker",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T13:16:05.000Z",
          "Titre": "Timeline is a handy visual tool",
          "Contenu": "Timeline is a handy visual tool. I started using Timeline in 2019 and have been a loyal user ever since. I have used it in several capacities, from demonstrating due diligence timelines for $50M commercial real estate development deals to helping coaching clients plan for and track their professional development progress over time to communicating project scope and timelines to consulting clients engaging in data migration and digital transformation. Timeline is easy to use and accessible. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harsha Devappa",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T12:02:01.000Z",
          "Titre": "The 'Officetimeline' tool is almost…",
          "Contenu": "The 'Officetimeline' tool is almost replacing the Microsoft project plan tool. I really enjoy the flexibility in making changes and easy user friendly tool. I use this tool almost everyday and train others to use"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Amit Roy Choudhary",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T19:20:14.000Z",
          "Titre": "The best tool available to create professional looking Gantt charts",
          "Contenu": "I have been using Office Timeline pro for many years now and can easily say that this is the best tool I have used that can very quickly help create extremely professional looking Gantt charts. It is simple to use and over the years they have kept adding new features."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "DQ",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T19:34:55.000Z",
          "Titre": "An intuitive product that will save you hours when making Gantt charts…",
          "Contenu": "I've spent hours upon hours making project Gantt charts in Excel or Project. They take forever and look like trash in a presentation or Word doc. Office Timeline is very intuitive and gives a visually clear work product with minimal work. The free package can satisfy the needs for many people. I upgraded to the next version and am very pleased."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gonz Roman",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T19:24:55.000Z",
          "Titre": "This is an excellent product",
          "Contenu": "This is an excellent product. I use it almost daily for executive reporting on project status."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Gajendra Khera",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T13:33:48.000Z",
          "Titre": "An Outstanding Addin Functionality for Presentations",
          "Contenu": "An excellent add-in feature enabled me - To present in well designed format (- To reduce cost in having multple application - To design and present in my own custome way"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brett McGillivary",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T12:50:34.000Z",
          "Titre": "Terrific Office Add-in that I highly recommend",
          "Contenu": "While the cost of the Office Timeline is weighty, I find that I use it all the time.  It is a really handy add-in to use with Powerpoint and I hope they come up with a Mac version.  It is a terrific add-in and works just as advertised.  It comes with some terrific pre-formatted timelines, however, I noticed that the online version has different ones that I wish you could access without having to pay for another subscription.  If anything since both require separate subscriptions at leat give them both access to the same default timelines."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Whitesheep",
          "Nb_Reviews": 12,
          "Date": "2022-09-22T00:58:52.000Z",
          "Titre": "Office Timeline Pro:  Simple & Effective",
          "Contenu": "Office Timeline Pro is an excellent project timeline visualization tool (Gantt charts) when you need a high level view without all the tools provided by solutions like MS Project or Asana.  This makes OTP much easier to use and update.  We use OTP to provide our clients with a one page status report so they can quickly identify challenges before they become problems."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Xavier Leynaud",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T11:08:22.000Z",
          "Titre": "Quick and Easy",
          "Contenu": "Very good looking timeline in no time using Excel Export.Just missing the copy-paste functionality in the data sheet table to get faster, even if the Excel export/import is already useful.Worth its money, surely."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Shaun Guthrie",
          "Nb_Reviews": 4,
          "Date": "2023-03-05T21:56:08.000Z",
          "Titre": "Perfect Gantt Chart add-in for PowerPoint",
          "Contenu": "I've been using Office Time for a couple years now and really enjoy how easy it is to use and incorporate into PowerPoint.  It's perfect when conveying timelines, as I do at an exec level.  It keeps me away from some of those more extensive and expensive gant chart software that is overkill for what I need."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julie",
          "Nb_Reviews": 1,
          "Date": "2023-02-17T14:10:34.000Z",
          "Titre": "Great Product - Time saver",
          "Contenu": "Such a time saver!!    No more painstaking updates in excel coloring boxes :)   I just need to remember to click the \"Accept Changes\" button before I edit dates again (if I make a formatting change on the timeline)Their customer service replied to my question promptly too.  They were very happy to tell me how to fix my issue.  (It was a feature already built in that I didn't know existed)   It's rare for a SW company to be so helpful - much appreciated!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Sheila",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T14:43:27.000Z",
          "Titre": "Leadership loves the visual!",
          "Contenu": "I started using this to help Leadership understand high level timelines for our tech projects and they love it! I haven't yet explored all the ways to use it, but it was beneficial from day 1."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stefanie",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T19:26:05.000Z",
          "Titre": "Freedom for PMs",
          "Contenu": "Office timeline gives me a lot of freedom as a PM. A lot of times in the beginning of a project you don't have the timeline nailed down or you want to see scenarios and high level over views of what the timeline looks like Office timeline has come in key for this. I love being able to import from project and giving clients and executives an easy to read 8 week look ahead of projects. I've only barely touched the surface of the product but thus far I have no complaints."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Titcombe",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T16:47:23.000Z",
          "Titre": "Great augmentation to the regular Gantt…",
          "Contenu": "Great augmentation to the regular Gantt charts that come with MS Project. As a recommendation, please retain any custom formatting on \"Refresh Data\" ie I may add a custom color with a drop shadow to a timeline bar, but when I refresh the data, that formatting reverts back to default Look forward to future features"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave Dixon",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T21:17:58.000Z",
          "Titre": "Game changer",
          "Contenu": "Office Timeline is a game changer for me. We are planning a relocation to a new facility and doing timelines this way is about 1/3 of the time from doing excel versions. And much more flexible. And if you are a die hard Project person they work with that as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Girish Srinivasan",
          "Nb_Reviews": 1,
          "Date": "2022-10-21T23:57:13.000Z",
          "Titre": "Great tool for GANTT Chart",
          "Contenu": "I have used several program management tools, but I prefer to use Office Timeline for GANTT charts. It's easy to create GANTT charts by just entering the dates and milestones. You can select from several display options. Most of the program management tools have GANTT charts, but they are not visually appealing. If have to present to my leadership (VP/CxO), I prefer Offline Timeline. The basic package is worth the $99 annual fee."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Earl Lagmay",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T20:59:44.000Z",
          "Titre": "Efficient Way to Create and Update Project Timelines",
          "Contenu": "Efficient Way to Create and Update Project TimelinesThe biggest advantage of this add-on is its ability to connect timelines outlined from either MS Excel or MS Office and translate them into a visual timeline generated into MS PowerPoint. Therefore, any changes made into the MS Excel / MS Project timelines can be easily reflected into the visual PowerPoint timeline within the click of a button (the ‘Refresh Data’ button). This program has made it easy for me to present and communicate changing timelines quickly and efficiently. The program also allows a variety of visual customizations for timelines generated on PowerPoint. This program has been very beneficial for me as a project manager."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Fayek Kalaouze",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T19:55:22.000Z",
          "Titre": "product works very well",
          "Contenu": "product works very well, great when doing an update to MSproject file and see the modifications displayed in the timeline."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Chambliss",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T22:02:04.000Z",
          "Titre": "Great Time-Savings!",
          "Contenu": "This is an easy and quick way to create and maintain a project timeline.  I use a PPM tool for project tracking, and I am now using Office Timeline to create visual timelines for my customers.Great time savings!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Mathew Alvaro",
          "Nb_Reviews": 1,
          "Date": "2022-10-20T01:49:26.000Z",
          "Titre": "This is one of the best and easiest products!",
          "Contenu": "This is one of the best and easiest tools I have used to create simple and informative gantt charts and timelines. You don't need to be a project manager to understand how to use this product. It's very intuitive and simple, unlike other products like MS Project. Also, it is very visually appealing. I keep getting asked, \"how did I do that\" and end up needing to buy another license because others love how easy it is and how good it looks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Klay Jones",
          "Nb_Reviews": 1,
          "Date": "2022-09-27T21:03:41.000Z",
          "Titre": "This is an amazing plugin",
          "Contenu": "This is an amazing plugin. Super intuitive. It's both great for a polished view as well as \"whiteboarding\" timelines with the visual view. You can drag milestones and tasks around in relation to one another and dates will autocalculate on the fly. I was able to scramble an entire portfolio of deployment dates and have a clean output in real time. It's getting a little pricey but still reasonable for a corporate user."
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Bjorn Andrew Chua",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T11:22:25.000Z",
          "Titre": "Great automation for project roadmapping and other timetable visualizations",
          "Contenu": "This is a great tool for automating creation of project roadmaps and other timetable visualizations. The built in templates also have a nice selection of design elements and scenarios to choose from. Making changes and updates is also quite intuitive. Overall, this has helped create consistency in the outputs within the team I am a part of, who all use this as well. This also makes our work more efficient as opposed to the tediousness of shifting, resizing, etc of chevrons or shapes if done manually."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Geoff",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T13:23:48.000Z",
          "Titre": "Office Timeline is awesome!",
          "Contenu": "I have worked with Office Timeline for 6 years now.  The simple interface keeps on evolving and offering even more benefits.  Such a great communication tool for client briefings, as well as day to day project use to simplify the complex data we PMs work with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trevor Gyles",
          "Nb_Reviews": 1,
          "Date": "2023-01-13T20:49:45.000Z",
          "Titre": "One of the best tools in my project…",
          "Contenu": "One of the best tools in my project management toolbox.  The ability to sync quickly with MS Project and provide various views on the timeline within PowerPoint creates an extremely efficient and powerful communication tool.  Surprised that Microsoft hasn’t scooped these guys up!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ahmad Torjaman",
          "Nb_Reviews": 1,
          "Date": "2022-11-18T17:43:04.000Z",
          "Titre": "Office Timeline is simply a must-have…",
          "Contenu": "Office Timeline is simply a must-have tool for any project manager. It creates powerful Gantt charts that convey the message to the stakeholders very clearly in a slide that can be further edited. I used it for my programs on a weekly basis and I don't believe I can replicate what the tool does manually."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Chris L.",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T15:16:46.000Z",
          "Titre": "Best project manager tool ever",
          "Contenu": "This tool is a must have for any Project Manager. With its intuitive design and user experience, it's very easy to build any type of timeline. Plus, their responsive customer service is the icing on the cake. Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick Whitten",
          "Nb_Reviews": 1,
          "Date": "2022-10-03T19:36:21.000Z",
          "Titre": "Professional looking and easy to use",
          "Contenu": "Part of my job is Technical Writing and I use the timelines to insert into my documents. It's super easy to use and looks really professional. The options of usable timelines is also impressive. I recommend this product to anyone who needs a professional looking timeline for a powerpoint or document! Our Project Managers also use this tool and love it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ronnette Russell",
          "Nb_Reviews": 1,
          "Date": "2022-11-04T20:31:05.000Z",
          "Titre": "Office Timeline is a PMO Leader's best…",
          "Contenu": "Office Timeline is a PMO Leader's best friend.  It brings life to every schedule and enables a presentation that can be easily understood by both project teams and executive leadership with very little effort.  Love it."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "John Tebbitt",
          "Nb_Reviews": 2,
          "Date": "2023-01-27T09:45:34.000Z",
          "Titre": "Continuing Development and Improvement make this software a good choice",
          "Contenu": "I have been using Office Timeline Pro for around 2 years now and am pleased with its functions and features. One of the good things about this software is the maintenance and support. Software improvements come out on a regular basis and if I have any questions they are answered quickly and to my satisfaction. I am pleased to endorse Officetimeline Pro, and use it for all my project presentations to demonstrate Project Gannt charts that are accurate and easy to design and present."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Brian Moran",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T09:50:05.000Z",
          "Titre": "Timeline is a game changing addition",
          "Contenu": "I love timeline! As a planner I find it is an essential piece of software. I use it to present critical and often complex tasks in a reader friendly manor they is easy to understand. I find the user interface easy and intuitive. It has never left me down."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jamie Cope",
          "Nb_Reviews": 2,
          "Date": "2022-12-21T23:13:24.000Z",
          "Titre": "Questions, feedback, instant thorough response and an update!",
          "Contenu": "Had some questions and feedback - received prompt realtime feedback and advice from not only a developer but then the founder, Eddy! I identified a glitch and it was fixed in the next release. How could anyone ask for anything more! Love this software, and it's only going to get better with this team in charge."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicole Laustalot",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T21:11:54.000Z",
          "Titre": "OfficeTimeline has given me more time…",
          "Contenu": "OfficeTimeline has given me more time every week. I no longer spend hours tediously updating colored boxes in Excel or moving graphics on PPT slides.  I can update a single source then sync the changes.  It's a game changer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Kuykendall",
          "Nb_Reviews": 1,
          "Date": "2022-09-30T19:47:09.000Z",
          "Titre": "Simple and easy to use- even for a PM",
          "Contenu": "As a project manager it is important to be able to convey timline information quickly so that the business can digest it comfortably.  Office Timeline is easy to use and edit.  I use it on all planning and roadmapping sessions to show our features we delivered and our plans for the future.  Very happy with my purchase."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Rui Carvalho",
          "Nb_Reviews": 2,
          "Date": "2022-12-09T07:30:38.000Z",
          "Titre": "Great tool, perfect for reporting",
          "Contenu": "Perfect tool to show roadmaps. The designs are so easy to customize. It really improved my overall reporting.It also features \"predecessors\"and other dependencies, where changing the duration of a wp by x changes another by that amount!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Proximian",
          "Nb_Reviews": 2,
          "Date": "2022-09-01T19:18:49.000Z",
          "Titre": "Office Timeline is simple to use",
          "Contenu": "Office Timeline is simple to use, gives you lots of flexibility, and looks great. Not all my customers can understand complex Gantt charts, but they all love simple-to-read timelines. The swimlanes allow you to add more information while keeping it easy to understand."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eduardo Rayner",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T19:23:44.000Z",
          "Titre": "Great and Powerful Tool",
          "Contenu": "Great and Powerful ToolIt's not as user friendly as I prefer but it's a great tool once one figures how to maneuver though it.  I like the fact that I can import an MS Project file to create a timeline for presentation purposes and make it look professional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rizwan Jagani",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T21:57:48.000Z",
          "Titre": "Great tool and a significant time…",
          "Contenu": "Great tool and a significant time saver!  It is well-designed and versatile  for almost any type of work.  I began to appreciate it the more I get into using it creatively.  Will review again after a couple months of use. :)"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Gary Davies",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T09:47:06.000Z",
          "Titre": "This turns a simple list into timeline picture",
          "Contenu": "This turns a simple list of activities into a decent looking timeline I can refer to when talking my clients through my projects, I love it.Saves me a tonne of time and is super easy to use"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "NAH-E",
          "Nb_Reviews": 3,
          "Date": "2022-09-13T19:30:46.000Z",
          "Titre": "Professional visualisations - no complexity",
          "Contenu": "Professional visualisations that stand out, perfect for senior stakeholders. Timeline takes away complexity away from gantt or other formats. Easy on the eye and simple to use!  I won't be without it since I began using it in 2020"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Antonio Luis",
          "Nb_Reviews": 3,
          "Date": "2023-08-20T17:49:12.000Z",
          "Titre": "The office timeline was key for my career development...",
          "Contenu": "The office timeline transformed my life when I moved from technical to Program/Product Manager.The simple way to create different fantastic roadmaps targeting different audiences is amazing.The regular improvements to help users are greatly appreciated.The license costs should fair to guarantee adoption.Antonio Luis"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edward Bass",
          "Nb_Reviews": 1,
          "Date": "2022-09-22T19:24:21.000Z",
          "Titre": "Using timeline",
          "Contenu": "Excellent program to provide visual presentation of key activities.  Use office timeline almost every day and with every power point presentation.  I am not very proficient with creating the spreadsheet tables to upload.  Something that a good tutorial would help and some extra time to master"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason Petras",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T21:52:13.000Z",
          "Titre": "Fantastic tool for bridging internal…",
          "Contenu": "Fantastic tool for bridging internal planning tools (excel, Smartsheets) with a clean presentation to our clients. Great work Team Office Timeline!"
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Gaspard Jouandon",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T19:32:15.000Z",
          "Titre": "Ease day to day reporting",
          "Contenu": "Simplify Gantt chart creation; great design; frequent additional feature; customer service responsiveness; Office tools collaboration.The only missing option that I've been awaiting is to be able to add specific png instead of the offered icons in tasks (such as country flag to represent a launch plan).And perhaps to have an OfficeTimeline Mac version to pleased some of my colleagues which are jealous so far."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Danny Buie",
          "Nb_Reviews": 1,
          "Date": "2022-12-19T20:24:21.000Z",
          "Titre": "Efficient and Visually Effective Tool",
          "Contenu": "I've been able to quickly build timeline visuals for leadership and team members that keep everyone on the same page.  The tool also makes it quick and easy to update these timelines as things frequently change."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TN",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T02:30:30.000Z",
          "Titre": "Time Saver. Helpful Tool",
          "Contenu": "This add on has really saved me a lot of time and make my timelines look so professional. It really helps to convey messages well to leaders and decision makers."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Lainey",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T22:48:56.000Z",
          "Titre": "Gamechanger!",
          "Contenu": "Took my work back content to next-level design that is translatable to co-workers who just don't 'get' Excel. If this is your team, get Office Timeline and have everyone on the same page."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joel Brown",
          "Nb_Reviews": 1,
          "Date": "2022-08-24T20:09:30.000Z",
          "Titre": "My colleague uses Office Timeline…",
          "Contenu": "My colleague uses Office Timeline extensively.  I needed to create a detailed summary timeline for a project to mimic my colleagues.  I purchased Office Timeline and within 45 minutes I was able to integrate and summarize the Gantt chart effectively.  Great Product!"
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "R. P.",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T19:49:49.000Z",
          "Titre": "Must have project management tool",
          "Contenu": "Using the plugin for 5 years already. Favourite way to make timelines for PowerPoint slides, compatible also with plans made in Excel, Smartsheet, Microsoft Project."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joel Brown",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T19:22:05.000Z",
          "Titre": "OfficeTimeline is essential tool for PowerPoint",
          "Contenu": "OfficeTimeline is an essential tool for creating Gantt Charts in PowerPoint. I have utilized OfficeTimeline in various enterprises for different projects and presentations, and the software's adaptability and MS Project integration has helped me save countless hours that would otherwise be spent manipulating spreadsheets or PowerPoint tables. Eddy and his team have undoubtedly done an excellent job with this software!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dorit",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T15:53:38.000Z",
          "Titre": "Excellent Tool for Gantt Chart and Timeline Creation",
          "Contenu": "The ease of use and the ability to import and sync data from MS Project and Smartsheet make Office Timeline a great tool!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Antoine",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T23:09:25.000Z",
          "Titre": "Great experience with Pro version.",
          "Contenu": "Great experience with Pro version.I quickly understood I miss functionalities available only with Pro+ version.I should have bought Pro+ as Pro has too many limitations compared to price difference Pro/Pro+"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kim Penepacker",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T19:33:47.000Z",
          "Titre": "Fantastic customer support and the…",
          "Contenu": "Fantastic customer support and the plugin works great so far. We've been using it for a month or two now without issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gail Johnson",
          "Nb_Reviews": 1,
          "Date": "2022-10-27T14:12:34.000Z",
          "Titre": "Easy to renew and 2 ERs",
          "Contenu": "easy to renew and updateSuggestions:1. Integrate with Oracle Primavera Cloud scheduling tool2. Be able to lock/unlock a layout - annoying when I compress and have to re-do it every time I update the timeline"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Feldmeyer",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T17:33:38.000Z",
          "Titre": "Powerful add-on for communicating with clients.",
          "Contenu": "Office Timeline is a simple to use tool that provides excellent visuals to communicate with our clients. I highly recommend it and I use it on a weekly basis at a minimum."
        },
        {
          "Note": 5,
          "Lieu": "DK",
          "Pseudo": "Nick Sørensen",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T08:22:02.000Z",
          "Titre": "10/10 would recommend🎐",
          "Contenu": "Its very pricey bit also just sooo easy to use.It really takes a long and cumbersome process and boils it down to a few easy and manageable steps.Long time happy user and will continue to be so ☯️10/10 would recommend 🎐"
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Laura C.",
          "Nb_Reviews": 1,
          "Date": "2022-10-25T10:24:49.000Z",
          "Titre": "Very helpful tool, easy to use",
          "Contenu": "To me, this is a must-have tool, very useful for PowerPoint presentations. When I need a timeline, a Gantt chart, or a roadmap to make the information easily digestible to everyone, this is the perfect tool to do any of them. The roadmaps and timelines are clear and crisp, looking stunning at the same time. I particularly like the swimlanes, that help group the information in a relevant way, and the drag-and-drop functionality that makes all the work really simple and intuitive. Also, data import and the copy-paste feature save me a lot of time when it comes to getting my data into the timeline. Not to mention the load of templates that come with the add-in. I particularly find templates helpful because sometimes I'm just not inspired on how I want my timeline to look, so I find a lot of ideas there. Plus, I don't have to work hard to build something from scratch. Many times, for me it's just 2-3 clicks to customize, wham-bam, ready to go! Thank you, Office Timeline!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Gary",
          "Nb_Reviews": 2,
          "Date": "2023-01-20T01:16:35.000Z",
          "Titre": "Elegant professional looking project…",
          "Contenu": "Elegant professional looking project plans. Invest the short time needed to learn it to save hours and hours messing about with the native power point tools"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kboat",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T16:27:49.000Z",
          "Titre": "Great Experience",
          "Contenu": "I have been using this for a few years and love it!  easy to use and makes my project timelines look fantastic.  I can put a lot of detail on a slide and have it be easily understood by my audience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MMS",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T21:27:44.000Z",
          "Titre": "Great - yet some items need improvement.",
          "Contenu": "I have been using the software for about 30 days and I really like it.  It is giving me really sharp looking graphs/charts that I can use in PPT, or I have exported these images to use in my academic scientific papers as figures in Word docs.  The two challenges I have is 1) sometimes the file saving aspect does not work and without notice the file converts back to some earlier version.  I have followed the suggested ideas but this is just very challenging when working toward deadlines.  I SAVE my file and start a new one each day so I have the previous days work saved to convert back to.  I do this with Word files for my academic writing so I am used to that but for a software to corrupt itself like this - its a challenge.  2) For sizing we are stuck using PPT sizing formats; I know how to set this up for posters etc for academic research but resizing for different outputs using this software is also challenging.  Not everything I do with a schedule is for PPT presentation.  I tried to just do an 8.5 x 11 paper size and again it didn't like it and reverted my file back to some earlier version.  In fairness to Office Timeline they may have some workarounds for these that I have not fully explored but I am a power user of Office PPT and these things should just not happen IMO.  I am still giving it 5 stars in-spite of this feedback so that should tell you something as well.  I do recommend it, yet be prepared for some modest learning curves.  Good luck!"
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "Zohar Eshed",
          "Nb_Reviews": 1,
          "Date": "2022-12-21T10:49:33.000Z",
          "Titre": "recommended to everyone in my company",
          "Contenu": "amazing and easy to use product.didnt like that there are so many levels, all features are basic, I use the PRO version and am not willing to pay more for upgrades.i think they are basic and need to be in the PRO version.MAC users UI is very immature and that's too bad."
        },
        {
          "Note": 5,
          "Lieu": "CL",
          "Pseudo": "Alexander Cepeda",
          "Nb_Reviews": 1,
          "Date": "2023-01-24T22:02:53.000Z",
          "Titre": "Great Project Mngmt Addins for PowerPoint",
          "Contenu": "Microsoft Project Gantt chart are usually ugly and not suitable for a presentations.   Office Timeline Pro has been an excellent and easy configurable solution to show my projects in clearly way and beautiful designed layouts."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carolyn Paralegal",
          "Nb_Reviews": 1,
          "Date": "2022-09-15T20:08:39.000Z",
          "Titre": "Love it!",
          "Contenu": "This timeline add-in for PowerPoint is easy to use and has a lot of great features.  Customer service is very prompt and responsive, too.  They offer lots of training resources as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Enid James",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T21:19:34.000Z",
          "Titre": "there was nothing that made this…",
          "Contenu": "there was nothing that made this product positive.  It was difficult to use and could not get a human to assist.  Will not recommend to businesses and co-workers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Chriscoe",
          "Nb_Reviews": 1,
          "Date": "2022-12-21T20:33:35.000Z",
          "Titre": "I use office timeline to make great looking charts",
          "Contenu": "I use office timeline regularly to build visually appealing Gantt charts and project plans. The ability to produce this in PowerPoint is a game changer for me. It’s easy to use too!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark J",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T20:49:28.000Z",
          "Titre": "Great solution for presentations!",
          "Contenu": "This is a great solution for creating timelines to use in presentations.  Very convenient and easy to use and edit.  Definitely recommend!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Michel Girton",
          "Nb_Reviews": 1,
          "Date": "2022-10-04T23:16:16.000Z",
          "Titre": "I needed something that required no…",
          "Contenu": "I needed something that required no learning curve and could help me present to Management in a succinct manner. And I came across Office Timeline...Nice Work keep it up. Got the result I was looking for using you timeline in my Plan on a Page."
        },
        {
          "Note": 5,
          "Lieu": "CO",
          "Pseudo": "Carlos B Ramirez",
          "Nb_Reviews": 2,
          "Date": "2023-03-09T06:40:46.000Z",
          "Titre": "Stable and very versatile tool for creating beautiful timelines in PowerPoint.",
          "Contenu": "Office Timeline is a stable and very versatile tool for creating beautiful timelines in PowerPoint. The purchase process is easy, the available templates with timeline ideas are very useful and the plugin integrates easily into PowerPoint making it easy to use.The timelines created in this software are beautiful, professional and will make a difference in your presentations."
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "David S",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T10:30:04.000Z",
          "Titre": "Saves hours!",
          "Contenu": "I love how simple it is to create timelines with Office Timeline. The feature I like the most is the swimlanes. This tool saved me hours of PowerPoint empirical search.One thing they could add is flat icons design for the tasks and milestones."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Damien Rosney",
          "Nb_Reviews": 1,
          "Date": "2022-12-06T19:29:20.000Z",
          "Titre": "The software is fantastic, saves so much time & editing is so easy.",
          "Contenu": "The software is really user friendly and has so many great features and options / templates. I used to create these charts from scratch before and it took a lot of time and edits were not eaasy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob Lowe",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T19:43:21.000Z",
          "Titre": "Team is helpful & it's Easy to use",
          "Contenu": "Team was very helpful and it was easy getting started.  As I start to do more and more they have been helpful in keeping me on track and avoiding frustrations."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Nicolas",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T01:55:29.000Z",
          "Titre": "Excellent Tool",
          "Contenu": "Excellent Tool. Makes life a lot easier to build visually appealing charts in minutes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Harrap",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T06:13:45.000Z",
          "Titre": "Genuine support and after sales service…",
          "Contenu": "Genuine support and after sales service to help me using the software.  I've used this for 4-5 presentations already, it is easy to use and gives a great result."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gary",
          "Nb_Reviews": 5,
          "Date": "2023-02-22T21:35:05.000Z",
          "Titre": "This is a unique product",
          "Contenu": "This is a unique product, and helps us quickly communicate project timeline with milestones much better than any other product, commercial, open-source or home-grown."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Slobodan Vukic",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T08:58:29.000Z",
          "Titre": "Excellent visualization of time plans!",
          "Contenu": "Excellent visualization of time plans! No need to convert Gant chart to ppt, done straight away!"
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Endava Uk Limited",
          "Nb_Reviews": 1,
          "Date": "2022-11-14T11:55:33.000Z",
          "Titre": "This is what I need and it helps me…",
          "Contenu": "This is what I need and it helps me creating good visuals for the  HL Roadmaps on our programmes. Helps me with the key stakeholders that are often C level."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Steve Austin Programme Manager",
          "Nb_Reviews": 1,
          "Date": "2022-09-08T23:33:23.000Z",
          "Titre": "No more dodgy hand crafting plans in Excel!",
          "Contenu": "This is the perfect solution for a plan on a page, brilliant product! Has helped me impress many a customer with a colourful concise and professional summary plan"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Connell",
          "Nb_Reviews": 2,
          "Date": "2022-11-30T00:10:09.000Z",
          "Titre": "The templates for timelines were very user-friendly and provided great optics.",
          "Contenu": "The templates for timelines were very user-friendly and provided me with fantastic optics!  I look forward to my continual use of this product!"
        },
        {
          "Note": 5,
          "Lieu": "TW",
          "Pseudo": "Issy Liu",
          "Nb_Reviews": 1,
          "Date": "2022-10-19T03:34:51.000Z",
          "Titre": "Nice application",
          "Contenu": "Nice application, if there is dependency feature like microsoft project will be much help to create the items.  looking for more template for product development."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Breisch",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T13:25:36.000Z",
          "Titre": "Easy to use & produces beautiful timelines",
          "Contenu": "Love it. Tool makes it easy to create timelines and to make changes to the appearance of your bubbles."
        }
      ]
    }
  ]
}