{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.solentro.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jay Rozzi",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T14:09:22.000Z",
          "Titre": "I was fully charged upon order",
          "Contenu": "I was fully charged upon order, but never received the book I ordered on 11/21/23, nor have I gotten any update on status.  Prior to reconciling the statement, I plan to dispute the charger."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Angie DeMarco",
          "Nb_Reviews": 5,
          "Date": "2023-12-10T15:12:51.000Z",
          "Titre": "Tracking #786963315130 a concern.",
          "Contenu": "Tracking #786963315130 a concern.Package has been somewhere in Memphis Tennessee since Oct. 26th.  Original delivery date to Midhurst, Ontario Canada was December 1st.  They cannot find the package.I spoke with an agent at FedEx on Thursday, Dec. 7th and they specified that Solentro was to email them with a picture of the package and description of the contents, (3 photo books).  I relayed that info to info@Solentro that same day and I have heard nothing back.  I resent the FedEx request particulars again yesterday and still have not heard back.  Please assist to bring this delivery challenge to a close.Angie DeMarco"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris LaCommare",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T00:08:47.000Z",
          "Titre": "I hope to revisit this review and give…",
          "Contenu": "I hope to revisit this review and give a higher rating. My package was lost by the shipper and it never arrived. I've emailed Solentro customer service and have not received a reply yet.This was a book my son created and we were hoping to have them by Christmas."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Leigh Clark",
          "Nb_Reviews": 3,
          "Date": "2023-05-10T13:01:03.000Z",
          "Titre": "I have yet to receive my order",
          "Contenu": "I have yet to receive my order. As far as I can tell this is a problem with the shipping company trusted to deliver my books but so far I have not gotten any answers from the shipper or Solentro as to whether or not I will ever get what I paid quite a bit to have printed. I was waiting to write a review, hoping, but so far I can get no answers so here is my review: I got nothing."
        },
        {
          "Note": 1,
          "Lieu": "PR",
          "Pseudo": "Carolina Carrero",
          "Nb_Reviews": 1,
          "Date": "2023-07-15T05:27:05.000Z",
          "Titre": "Seems my order got lost and I still haven’t gotten a replacement",
          "Contenu": "I reached out, as soon as I made the order, to fix my address. Someone contact me from their team, before shipping, to let me know that they requested the change. Apparently it did not went through. One month later, with a lot of emails from both parties; the shipment went back and I still haven’t gotten my package."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Philip Natale",
          "Nb_Reviews": 1,
          "Date": "2022-01-14T15:08:43.000Z",
          "Titre": "Product ROCKS :) ... Service DROPPED :(",
          "Contenu": "I was pretty disappointed by the customer service this time around. I placed the order in late December (23rd), and had minimal communication leading up to the Jan 7 delivery. I had to email the staff twice to actually find out. One, I never got a follow up email explaining my order was being tended two. Two, I never got an email explaining my order had been shipped/showing me a tracking #. Finally, it took over 2-weeks start to finish, and I feel last year it didn't take that long. I also felt the packaging was too loose. The books seriously moved around and incurred slight bending on the edges, despite the plastic packaging. Just pretty disappointed compared to last year's order. This is especially true when I'm paying an arm and a leg for shipping. It's frustrating when shipping is 25% of the order cost, and the delivery is poor/not communicated well."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rebel Smith",
          "Nb_Reviews": 1,
          "Date": "2022-12-24T19:38:56.000Z",
          "Titre": "I have tried to communicate with this…",
          "Contenu": "I have tried to communicate with this website and NOT one response to try to purchase a gift certificate for a Christmas present. There is no option to be able to do this on the site itself. Very pathetic!! I don't recommend this business!"
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Rolf Busman",
          "Nb_Reviews": 1,
          "Date": "2022-01-23T07:52:17.000Z",
          "Titre": "Crap",
          "Contenu": "Crap, I have emailed them about 5 times and ZERO reaction. They only emailed me about money (where it is). Still waiting on my order. Placed my order Januari 1, 2022. Don't expect it to arrive anymore, because of this crappy kind of customer care."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2022-06-16T14:55:32.000Z",
          "Titre": "Book was lost for weeks with no…",
          "Contenu": "Book was lost for weeks with no resolution. Missed gift opportunity for an important occasion with plenty of time planned up front for delivery."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Susan  Bartlett",
          "Nb_Reviews": 2,
          "Date": "2021-12-22T00:31:03.000Z",
          "Titre": "It’s four days til Christmas",
          "Contenu": "It’s four days til Christmas. I put my order in 3 weeks ago - haven’t gotten the bound book yet, so holding opinion for now"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeanne Lawton",
          "Nb_Reviews": 1,
          "Date": "2022-02-02T18:21:40.000Z",
          "Titre": "I am waiting for a response twice now…",
          "Contenu": "I am waiting for a response twice now from them.  Having questions of how people add to a book that I am making.  No response.  I am concerned this will not work.."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rachel/Malachi Margolis",
          "Nb_Reviews": 1,
          "Date": "2021-10-03T21:34:10.000Z",
          "Titre": "Package was supposed to be delivered…",
          "Contenu": "Package was supposed to be delivered last week and i still have not received it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gardiner Jones",
          "Nb_Reviews": 5,
          "Date": "2020-08-13T02:07:37.000Z",
          "Titre": "Entices you but the prices are through the roof!",
          "Contenu": "Their interface works but is clunky. You can't set up a page header, and you can't carry font family and size from one page to the other. The worst part is their prices are through the roof! I set up what I thought was going to be a simple silly book with a quote from an individual on each page. The price quote for 78 pages was $109 PER COPY. Yeah, that ain't happening."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Heather McKendry",
          "Nb_Reviews": 1,
          "Date": "2020-09-12T18:51:18.000Z",
          "Titre": "Ordered a book mid July, still not here two months later",
          "Contenu": "Ordered a book mid July. Checked in late August because it still hadn’t arrived. They said they’d check with the shipping company. It’s September 12, two months after I’ve ordered and still no book. They won’t send a replacement until they can prove it’s lost. How long do I have to wait???"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Annie Burton",
          "Nb_Reviews": 1,
          "Date": "2017-01-11T21:40:48.000Z",
          "Titre": "not good experience",
          "Contenu": "I never received my books.  I didn't realize the company was out of the country until I had placed the order.  When I emailed them, the tracking they gave me didn't work.  They had my address wrong, and told me it was my fault and that I would have to wait for the shipment to be returned before they would ship it out again.  So the special surprise gift for Christmas didn't happen.  Very disappointed.  They should have shipped another one out immediately and looked to take care of their customers."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Terrence McTier",
          "Nb_Reviews": 2,
          "Date": "2015-10-12T01:31:38.000Z",
          "Titre": "Horrible",
          "Contenu": "I've put my order in a month ago and was told 3 weeks from time of purchase I have yet to recieve my item. Furthermore, I was not provided with a tracking number although it was considered  \"priority\" mailing. Im highly disappointed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carol Diephuis",
          "Nb_Reviews": 2,
          "Date": "2017-01-09T19:02:48.000Z",
          "Titre": "Slow delivery, challenging communication, and so-so quality",
          "Contenu": "I was exceptionally disappointed to receive a book I ordered on Dec. 6 many days late.  I had received a promotional email from Solentro saying they would be turning books around quickly in time for Christmas, but I didn't receive mine in time to sign it and ship it to the ultimate recipient without paying for next day air service.  I tried twice to find out the status and was told (after some time) that it would be fine, but it wasn't.  There should be a way to see your status online.  After this experience, I will stick with Shutterfly, which has a higher quality product and quick turnaround plus exceptional customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Renee Moore",
          "Nb_Reviews": 1,
          "Date": "2020-12-23T22:13:24.000Z",
          "Titre": "FALSE CHRISTMAS 'ORDER BY' DATES",
          "Contenu": "I specifically checked shipping times before paying $65 for a SINGLE book to be printed. Their site said (shipping within the US) which leads you to believe they are a US based company. Their site also specified that if you ordered before the 16th of December (8pm PST) you would receive your product before Christmas... well here we are the 22nd and my order is still in SWEDEN!!! My order was placed the 14th.  Very frustrated to say the least...DO NOT promise something on your website when you know that it cannot be delivered by that date. That is false advertisement and leads people to make orders with you that you cannot fulfill on your end in the promised time frame.You can search Google and see that this is something your company offers every year it seems."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nancy",
          "Nb_Reviews": 1,
          "Date": "2016-12-20T20:32:23.000Z",
          "Titre": "Customer service rude",
          "Contenu": "I will not be using Solentro again. Customer service was rude and not helpful."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joseph Winkelbauer",
          "Nb_Reviews": 3,
          "Date": "2023-01-16T12:37:39.000Z",
          "Titre": "Delivery was not on time",
          "Contenu": "Delivery was not on time, but your website and service is interesting.This site doesn't allow for a reply to a company reply so here's my follow up.I did not see your shipping information on the website, that's my fault.  I placed the order before Christmas and I don't expect it to be there on Christmas.  I also placed the order late in the night thinking that day one would start the next business day.  What is misleading is when the product is being shipped by FedEx saying that it will be delivered on 12/29 and it arrives later on 1/4.  Fix the way you work with FedEx so they don't provide misleading information or state to a consumer that they should not trust the FedEx delivery date."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Justin Stout",
          "Nb_Reviews": 1,
          "Date": "2021-11-30T19:01:08.000Z",
          "Titre": "Pretty disappointed",
          "Contenu": "Pretty disappointed.   I was hoping to have this book ready in time for leading into my proposal, but there has been no notification on getting it shipped and estimated delivery date.   I get that it is the holidays but it would be nice to know when I should expect it by.   I took the risk and it did not pay off well"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lena",
          "Nb_Reviews": 1,
          "Date": "2021-05-25T22:19:37.000Z",
          "Titre": "Original Price is deceiving",
          "Contenu": "I started to write a book and spent several hours copy and pasting each page in. (It only takes a few minutes if you've already typed it all out on one document.) I had 44 pages done and was curious how much that was going to cost me. I was floored to see it was already over $100 and I was only half done. Deleted everything and am on to better things.  When they list book prices I have no idea where they come up with those low prices; that is VERY deceiving."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jonathan Drollinger",
          "Nb_Reviews": 1,
          "Date": "2021-06-03T16:12:40.000Z",
          "Titre": "Please hurry and ship",
          "Contenu": "The website was fine. It would be nice if you had a mobile option that works fluently. The trouble I’m having is it’s already been two days and no contact about anything being shipped. How long does it take to print this and put it in a binder? Hoping that this gets shipped soon for my wife’s birthday!"
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Rich",
          "Nb_Reviews": 1,
          "Date": "2020-08-09T07:53:04.000Z",
          "Titre": "Don’t get your hopes up!",
          "Contenu": "I ordered my product on July 15th and it is now August 9th and I have yet to receive it. The tracking was terrible on my product, after it left Sweden I received no further updates. Their customer service number doesn’t offer English support. And they rarely respond to customer complaint emails. One of the worst purchases I’ve ever made."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Katie Elizabeth",
          "Nb_Reviews": 2,
          "Date": "2020-11-18T03:49:40.000Z",
          "Titre": "I honestly was dissapointed in the…",
          "Contenu": "I honestly was dissapointed in the quality and look of the book I made. I felt a little bit ripped off and that I could have made something similar on my own for a lot less money. I paid nearly 60 USD for one softcover book. I added a star for the fast and secure shipping. I did appreciate that."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "veronica clark",
          "Nb_Reviews": 1,
          "Date": "2017-05-17T16:26:56.000Z",
          "Titre": "Too $$$$$$",
          "Contenu": "I Love the book and it was easy. I gave it a 2 because your price was very misleading and never showed as far as the price  pre pages or group of pages. The price was still the same regardless  if it was 1 page or 32 cost me $80 too much​, if you read this review advise you to try someone else but if money is No Object help your self"
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "annemarie Groenendijk",
          "Nb_Reviews": 2,
          "Date": "2020-11-09T19:35:10.000Z",
          "Titre": "Way too expensive for a just photo book"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Trudy Wilkes Thomson",
          "Nb_Reviews": 1,
          "Date": "2022-03-14T18:39:25.000Z",
          "Titre": "Help from Solentro needed!",
          "Contenu": "Hi Solentro,I have sent an email to you today and not heard back, I have also ordered the book, noticed that the money has gone through but have still not had any feedback or confirmation via email that my book is being processed.Please could you reply to my email.....Trudy Wilkes"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carol Briggs",
          "Nb_Reviews": 1,
          "Date": "2022-03-13T15:42:56.000Z",
          "Titre": "Mixed feelings",
          "Contenu": "This was my first attempt at publishing a book.  The pictures came out amazingly clear, as they were all over 50 years old.  I was very impressed with the quality. I was not impressed with the editing powers of your software.  I wish we could have purchased one copy so we could see it in print and edit it it. Having to buy 10 made us just buy 20 as we would only pay shipping once. When we got it and started reading it, it was filled with errors that had not come up on your editing screen.  I put the copy in Google doc and it caught over 50 changes in both spelling and editing.  We switched to another medium and ordered one and caught another 50 mistakes. We had spent $200 on books that at first glance looked amazing, but we’re riddled with errors.  You should have a disclaimer that states your editing program is weak.  Also in allowing us to purchase one copy we could have seen the finished product, fixed it and then ordered the number we required. It would have resulted in a much happier customer."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ann Kittredge",
          "Nb_Reviews": 3,
          "Date": "2022-01-05T17:28:43.000Z",
          "Titre": "Wish the platform worked better",
          "Contenu": "I love the final product, but getting there is a bit torturous. While adding images throughout the book, the platform would, for no obvious reason, periodically delete pages. I had to constantly re-submit info. It was so incredibly frustrating. In the end one of the pages came out wrong. I can only surmise it was because after multiple times of having to redo pages, I missed fixing this one for the nth time because I wasn’t aware it had been affected. Ah well.  Also, I used this platform back in 2016 and was surprised that today it functioned pretty much the exact same way, no advancements in functionality."
        },
        {
          "Note": 3,
          "Lieu": "PH",
          "Pseudo": "Denise",
          "Nb_Reviews": 1,
          "Date": "2022-02-14T21:45:35.000Z",
          "Titre": "Customer services was excellent even…",
          "Contenu": "Customer services was excellent even during the holidays."
        },
        {
          "Note": 3,
          "Lieu": "MM",
          "Pseudo": "You are b o o t i f u l",
          "Nb_Reviews": 1,
          "Date": "2021-05-17T04:02:11.000Z",
          "Titre": "Would recommend checking the countries they ship to before writing.",
          "Contenu": "I was really excited to order this book and was really passionate about it. But unfortunately I couldn't order it because of my country, since my country was not on the list of countries they shipped to. I have now given up on this website and on writing as now I know how silly I was to think this was actually going to work out. I'm not even mad as I'm extremely used to this because my country is not a very popular country. I don't want to try a new website as I had already written so much on this website, so I will just have to give up."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Catherine W Sims",
          "Nb_Reviews": 2,
          "Date": "2020-12-31T16:42:44.000Z",
          "Titre": "Mixed Review, Positive Outcome",
          "Contenu": "We give Five Stars for the quality of the books and for the speed, especially ahead of the holidays, that they were delivered.  Truly amazing!We would give Two Stars for the formatting process, because the templates were so hard to work with.  My husband solved this by creating images of our pictures and text, and then pasting them onto your single photo template.  Once this was figured out, it went smoothly.  We would happily send our work to you all again.  Thank you!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "A. L. Walden",
          "Nb_Reviews": 3,
          "Date": "2019-05-02T18:18:00.000Z",
          "Titre": "Expensive but quick way to create a…",
          "Contenu": "Expensive but quick way to create a vanity book project for a few books. Turnaround time is extremely fast. Difficult to really edit book on your own.What you see and how you edit are radically different. I wanted to eliminate some pages and it was a lengthy, convoluted process. The final product was sleek looking. Limited styles to choose from for covers. If you want a small, personal project done it is an acceptable method."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Courtney",
          "Nb_Reviews": 1,
          "Date": "2018-03-30T18:32:02.000Z",
          "Titre": "Nice, but way overpriced!",
          "Contenu": "The book I had made is a great quality, but certainly not worth $95 US!!! I only paid that because I was under a time constraint & ran out of options, but would never use this company again due to it's extremely over priced products. It could have at least been leather bound or something to justify that kind of money!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jessica Agulló",
          "Nb_Reviews": 8,
          "Date": "2017-01-09T22:05:32.000Z",
          "Titre": "Print quality and software is great but images not centered on pages",
          "Contenu": "The book format in hard cover and quality of printing is excellent however the images and type are not centered on the page although they are set up centered on the book creating software. (A full page image prints with a white bar on the outer edge of the page.  It seems that the software does not consider bleed in the internal spine of the pages."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Janet Bogusat",
          "Nb_Reviews": 2,
          "Date": "2016-01-28T15:44:23.292Z",
          "Titre": "Cover sheet confusing",
          "Contenu": "I found the text pages easy to use, however I must agree with another reviewer who said that creating the cover for the book was confusing. The cover sheet that I typed my title on had a design on half the page yet I now think that the cover of my book will be all blank on top with the tile below the middle which will look very awkward. I thought this design would be on the cover since the other text pages were blank. I'll just have to wait and see."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chad M Liddick",
          "Nb_Reviews": 1,
          "Date": "2017-06-12T21:41:57.000Z",
          "Titre": "The website was fairly straightforward …",
          "Contenu": "The website was fairly straightforward to navigate but could have been more user friendly. Overall the simplicity of formatting was a positive for me. Payment was a little tricky, but my bank halted payment initially. It would also be nice if there were separate entries for billing address and shipping address. Shipment was miraculously fast, and I am deeply appreciative of how quickly my order was processed once payment was figured out. I was also very pleased with the look and feel of the book once I received it."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Doris",
          "Nb_Reviews": 3,
          "Date": "2018-01-22T20:36:46.000Z",
          "Titre": "My Poem book for 93 year old mother",
          "Contenu": "I finally got my book completed but felt the site could have been more user friendly. It would also be nice if an inserted picture could be screened back to be a true background without having to change colors of font. The choices for picking a style of book could have been more diverse. I was making a poem book for my 93 year old mom and wanted a book with a flower theme but none to chose from. Even your designers had nothing for a book. Only invitations, etc. My mom loves her book! It took me over 40 hours to create.The quality is very good. Thought the price was high."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Adam Wright",
          "Nb_Reviews": 1,
          "Date": "2018-01-26T21:01:21.000Z",
          "Titre": "The product is nice, but costly",
          "Contenu": "The product is nice, and they got it to me very quickly, but it cost way more than I was expecting. The prices are very vague, and I have no idea how mine came to total $80 for a 100 page book that was black and white (except for the cover)"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nechama Bar-Chaim",
          "Nb_Reviews": 1,
          "Date": "2017-05-28T01:30:38.000Z",
          "Titre": "High Pricing",
          "Contenu": "The prices are very high in comparison to competitors, and with paperbacks, you can only buy ten books at a time. Otherwise, the website is easy to use and the shipping is quite fast. Overall an OK experience using Solentro."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dennis",
          "Nb_Reviews": 4,
          "Date": "2021-01-11T21:36:36.000Z",
          "Titre": "Very slow shipping.",
          "Contenu": "They were quick to print and get the order out but getting to the United States took forever. I think next time around I will find a printer in this country."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jason Brown",
          "Nb_Reviews": 1,
          "Date": "2015-07-27T00:27:26.000Z",
          "Titre": "My first book.",
          "Contenu": "I thought the editing options were limited.  The compounds were separated on two line instead of moving the entire word to the next line.\r Not very cost effective for one book."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JLeonard",
          "Nb_Reviews": 1,
          "Date": "2018-01-05T00:45:20.000Z",
          "Titre": "I was unable to complete my purchase",
          "Contenu": "I was unable to complete my purchase.  Tip to US citizens: clear it with your credit csrd before trying to purchase from this site; mine blocked the purchase."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "P. Lang",
          "Nb_Reviews": 2,
          "Date": "2015-10-22T13:51:32.439Z",
          "Titre": "Poetry Book",
          "Contenu": "The final product was satisfactory, in particular the reproductions of the photos selected for the book.   I was somwhat disappointed about the first and final pages, as it was not clear to me how they would appear behind the clear front and back covers chosen. Had I realized this, I would have chosen a photo to be on the front page.   I also could not tell when typing into the pages that the type would be as large as it was, and could have gotten some poems on one page rather than two.  However, the quality of the printing and the paper was very good.  I found the entry of information a bit awkward as I had to go the the revew each time I wanted to see how it actually laid out on the page, which was time consuming, as it did not display the same way when entering it.  I would have like to be able to move the pages around, but found that in order to revise the order of the pages, I had to delete and add a page and retype all over again in order to place it in a different order."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stephanie Coffman",
          "Nb_Reviews": 1,
          "Date": "2016-02-09T15:44:12.000Z",
          "Titre": "Slow production, unable to view or track order status",
          "Contenu": "The Solentro site was user friendly and all was good until production. I needed this for a birthday gift and shipping to the US. The site says 1-2 weeks, but I did not know if that included ship time. The site does not give any details about shipment method or shipment time, so I asked customer service. They could not give me that information either. (?) I asked if I could pay extra for expedited production and/or shipment. They do not offer that and said they would mark my order as \"pressing\". It was produced in the normal timeframe. There is no visibility online regarding production progress, ship date or ship method (thus no way to calculate arrival date), but, thankfully, they did provide tracking information upon request. I now appreciate even more the US companies that are able to produce and ship in a matter of a few days, plus I can see online exactly when/how my package has been shipped and will be delivered. Solentro produces a nice product, but the production and shipping information and timeframe could be improved."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Somewhat satisfied customer",
          "Nb_Reviews": 1,
          "Date": "2016-01-19T22:55:15.000Z",
          "Titre": "Don't charge to promote yourself",
          "Contenu": "Shouldn't charge to take Solentro promotional messages off of the book."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Maria Mendoza",
          "Nb_Reviews": 2,
          "Date": "2018-10-25T01:57:55.000Z",
          "Titre": "It's okay.",
          "Contenu": "I bought a hardcover/gloss Maxi panorama book with 50 pages in full color for $110 USD.Cons:The pages feel a bit thin and rough for gloss, I did double check to make sure they were gloss and not matte, I suppose I just expected them to be a bit thicker. The book itself is quite thin, a little over a centimeter in thickness with the hardcover included.I experienced some technical issues whilst making the book in that pictures would randomly shift onto different pages or be removed entirely, even after having saved them to pages in particular, which meant I had to go through every page after each time I'd adjusted the pictures.The site could have some more default background images provided.I would have liked for there to have been a text background option to increase readability within the text on a colored background.Pros:The colors are vibrant and beautiful.I did have to contact customer support and received an answer very shortly after that helped me resolve some issues I was having in creating the book.The book was safely packaged in tight plastic wrap and then packaged in a sturdy box.Overall:I like the book as it is. It's a 60th birthday present for my mother and I'm glad I was able to customize it as I did and it gave it that much more meaning. The process of building the book itself was a bit tedious and did become an annoyance at times, but there's great customer support. The quality of the pages themselves are not what I expected, and the book is overpriced, in my opinion. If I were to have the need to order another book I would be hesitant about ordering through Solentro again. The quality is good and the colors are vibrant, it's just... Not what I expected."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Vicki Underwood",
          "Nb_Reviews": 4,
          "Date": "2019-11-26T04:19:40.000Z",
          "Titre": "Started out good ..",
          "Contenu": "Started out good ... ended up bad..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jerome Concepcion",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T19:27:36.000Z",
          "Titre": "Book came out much better than I…",
          "Contenu": "Book came out much better than I expected. Looks very good and shipping via fedex was fast. My only issue is the website needs getting used to and there is no undo button. If you delete pages by mistake, there is no undo button and you have to write the deleted pages all over again. Still, satisfied with how the book looked."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Venus",
          "Nb_Reviews": 4,
          "Date": "2023-02-14T22:07:21.000Z",
          "Titre": "I had a good experience",
          "Contenu": "I found the Solentro experience of making my own, personal photo book a positive one. The site could have had a little better functionality but as far as sites go, it was relatively easy to navigate. I appreciated the templates and the fact that I could easily import my own photos. The cost was a bit high but after receiving the book, I felt the quality was worth the expense."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Abi Green",
          "Nb_Reviews": 2,
          "Date": "2022-09-02T08:07:01.000Z",
          "Titre": "NOTE FOR UK CUSTOMERS",
          "Contenu": "UK CUSTOMERS: When the book is delivered you may get a batch of slightly confusing paperwork relating to import tax. I was a bit freaked out by this as I’ve had to pay a lot for other deliveries from Europe since Brexit. Thanks to Solentro for sorting this out and reassuring me- it’s safe to ignore.As far as the product is concerned, it’s very nice. A few contributors seemed to find it tricky to upload photos as well as their messages, also it would be worth telling people not to use emojis as the text section can’t accept them. Overall we have a very nice memento and the recipient is delighted with it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Laura Damore",
          "Nb_Reviews": 1,
          "Date": "2022-09-28T19:59:59.000Z",
          "Titre": "I created a lovely book of poetry with…",
          "Contenu": "I created a lovely book of poetry with vibrant colors.  The book is high quality and beautiful.  I will definitely use Solentro for all my projects.  The only issue I had, was that it was some what difficult to correct any page errors that I made. It is not easy to access tech support. However, after much persistence and patience it was all perfect.  Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Erika Lindberg",
          "Nb_Reviews": 3,
          "Date": "2021-06-05T12:13:11.000Z",
          "Titre": "Expensive and Time Consuming  but Great Final Product",
          "Contenu": "I chose Solentro because it was the only company I could find that allowed text and photos. Creating the book was very time consuming because you can't edit a page once you've chosen the format which means starting the page all over. The book was also significantly more expensive (and smaller) than any photo book I've made with other photo book companies but I am happy with the end result."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sheila",
          "Nb_Reviews": 1,
          "Date": "2022-11-07T17:41:24.000Z",
          "Titre": "Birthday Book for mom/grandma",
          "Contenu": "The only reason I gave it 4 instead of 5 stars is the lack of customer service. Other people said the same thing on their review but that the end product was great, so I crossed my fingers & went with it. You're on your own, but if you can figure it out it's worth it. Our project was a birthday book for our 85 year old mother/grandmother, but not a picture book/photo album so this company fills a niche no other company seems to fill. Fun backgrounds, colorful pages & fonts. I like that I could preview the book while working on it.  Turns out the company is out of Sweden so that might explain the lack of customer service, but the book made it to me ok and shipping cost was not out of line."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Diane Zavod",
          "Nb_Reviews": 1,
          "Date": "2022-04-26T21:18:03.918Z",
          "Titre": "Pricing is confusing",
          "Contenu": "Pricing is confusing.  The amount of the purchase was one price, the invoice was more than double what I expected. Impossible to get anyone to talk to me. Emails are often disjointed from the questions I had.  Although I love creating books, I can’t afford its pricing ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeffrey McDonald",
          "Nb_Reviews": 2,
          "Date": "2022-12-19T21:28:24.000Z",
          "Titre": "The product was very good",
          "Contenu": "The product was very good, better than expected. The price was a little high, and the breakdown for buying more copies isn't very good either. If I could get a better price I would buy more, sadly I only purchased a few because of the price."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Natalie Jensen",
          "Nb_Reviews": 1,
          "Date": "2022-01-05T16:08:30.000Z",
          "Titre": "I was very pleased with the quality of…",
          "Contenu": "I was very pleased with the quality of the books and how easy they were to create. With that said, I wasn't pleased with the $50.00 shipping cost or the lack of communication along the way. I made them 2 weeks before Christmas, and although I knew they may not be delivered in time, I had no way to track the books. There was no follow-up email with a receipt, order confirmation, or any additional information allowing me to know when/if my order went through. An email supplying me with a link to track my package would have also been appreciated."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Judy Kersten",
          "Nb_Reviews": 4,
          "Date": "2021-09-26T21:18:24.000Z",
          "Titre": "I love the book.",
          "Contenu": "I love the book, and this being my second, I was more facile with the software. The finished product is terrific and the ability to preview the book exactly how it will appear is great. The only weakness is that there is a lot of trial and error involved in constructing page templates and fitting in text and pictures in the way you want. But the end product is definitely worth it!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "NC Dino guy",
          "Nb_Reviews": 5,
          "Date": "2021-12-04T00:08:56.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "Excellent, excellent customer service. And I was a difficult case. I believe part of the issue was the 11 year old MacBook  Pro with a Word program not supported since 2016. A lot of manual manipulation to deal with hidden formatting from the cut and paste from Word. The eraser tool in the Solentro software did not seem to work with this old of a Mac computer. However, there was a manual,  time consuming work around. Bottom line my second book  was successfully completed. Based on my experience, I believe it would benefit users of the Solentro software to know what makes and models of computers pc and Mac) and operating systems work well with the Solentro software and result in the best user experience. The Solentro software meets the 80/20 principle. 80% good core/20% customizable. Looking forward to doing my next book on a newer MacBook Pro computer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Miki Celmer",
          "Nb_Reviews": 2,
          "Date": "2021-12-31T16:30:18.000Z",
          "Titre": "I liked the product and the format",
          "Contenu": "I liked the product and the format.  It was fairly easy to load my info but did take a bit of time.  My order was processed quickly.  However, it was estimated to be delivered by December 15, plenty of time for the holiday.  It got stuck in FedEx France for over 2 weeks.   It didn't arrive until December 28.  Also, I had some trouble with the pictures.  Apparently, it wants good quality pictures but I was using older photos and it didn't like it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kendall Peterson",
          "Nb_Reviews": 1,
          "Date": "2021-12-30T15:29:47.000Z",
          "Titre": "I have never made a book before",
          "Contenu": "I have never made a book before, and I’m not very tech savvy, but Solentro made it very easy. I actually took a story that my husband wrote when he was in grade school and turned it into a children’s book. It turned out very well and is great quality and their customer service was great and they were quick to respond to my emails. The only reason I didn’t give five stars was it did not get here in time for Christmas. I think it was more FedEx‘s fault than Solentro‘s. Solentro sent it out in plenty of time but it was super delayed from FedEx.  That part was disappointing, but I will definitely use Solentro in the future to make any kind of book as the process was very simple and the quality was great"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eric V.",
          "Nb_Reviews": 1,
          "Date": "2021-12-27T22:34:40.000Z",
          "Titre": "The site worked well for my book…",
          "Contenu": "The site worked well for my book project. I liked the flexibility to create custom page layouts. The only improvement I would like to see is the ability to adjust line spacing in text blocks. It defaults to single spacing. Spacing of 1.15 and 1.5 lines would allow me to open the look of the text up."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Roumi Jepson",
          "Nb_Reviews": 2,
          "Date": "2021-06-05T00:07:25.000Z",
          "Titre": "Great Platform for a Custom Book…",
          "Contenu": "Used Solentro to design a custom book for the 50th birthday of a friend. The entire user experience was very pleasant. Overall, the process was intuitive and simple. It might help to have the structure of the book preset before beginning the actual layout in the template, as editing at times is cumbersome and requires repeating some steps. By far, the most versatile platform for this kind of project. The weakest link is delivery time. Getting the book took forever even though I ordered it 3 weeks in advance and it was shipped via Fedex. Regrettably, the gift didn't make it in time; when my friend did finally get it, she loved the execution. I was tracking the shipment and noticed that it was stuck in a warehouse in Belgium for 8 days. Unacceptable. So if you are going to use this service for a specific event, design your book way in advance. I would use the service again and would recommend it to others as there are different format options and price points to meet different people's needs."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James C. Samans",
          "Nb_Reviews": 4,
          "Date": "2023-01-09T07:13:55.000Z",
          "Titre": "Great way to make a book, with a few quirks.",
          "Contenu": "I used Solentro to create a hardcover book for my daughter chronicling an imaginary world we created over three years as part of a bedtime routine.  Solentro let me pull in photos and illustrations, lay out text in various ways, and use color.  The interface does have a few limitations, which is why I've rated Solentro four stars instead of five.  One is that layouts are modified and applied independently of where they are filled in, so it's tricky to make small changes to a layout to correct problems in spacing you see as you're filling it.  You need to go back to the layout screen; create a new, derivative layout; make the changes; apply that layout to the book, which in turn adds a page and pushes everything forward; drag each content element from the old page to the new one; and finally delete the old page.  I went through this numerous times.  I also wish page numbers were easier to add and customize, that there was an assisted function to create an index, and that multi-page images were more predictable in terms of center binding.Despite these limitations, I enjoyed the way that Solentro helped me bring my vision into reality.  The finished book came out quite well, and my daughter and I were both delighted with the quality of the printing.  I did encounter some glue breaking between the very first page and cover and again with the very last page and cover.  I fixed these by running a strip from a Crafter's Tape gluerunner down the inner edge of both pages.  I found no other issues.A note of caution: Solentro is a way to print something special, not to make something for sale.  The book I made was an 8x6 hardcover spanning about 50 pages in full color, and the price was a little over $100.  For a special gift, this was just fine. It wouldn't be viable to use this system to create books at a saleable price."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gabrielle Couch",
          "Nb_Reviews": 1,
          "Date": "2022-05-24T20:20:05.000Z",
          "Titre": "Book turned out great but I didn’t…",
          "Contenu": "Book turned out great but I didn’t receive any shipping emails so I had no idea when it was gonna come in. Book adhesive also started to melt under hot temps"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Laird Dr. David Beebe",
          "Nb_Reviews": 3,
          "Date": "2022-08-27T16:41:27.000Z",
          "Titre": "While compiling my work was fairly…",
          "Contenu": "Whhile compiling my work was fairly easy, it was frustrating to not be able to enlarge the pages for review as i put it together."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donna",
          "Nb_Reviews": 1,
          "Date": "2022-05-28T17:49:11.000Z",
          "Titre": "It was a great way to get my…",
          "Contenu": "It was a great way to get my autobiography published for my family. My only complaint is there is no spell check. If there is, I didn't see it. It bothers me that my book has typos. But I would do it again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donald Brown",
          "Nb_Reviews": 3,
          "Date": "2023-03-18T14:55:07.000Z",
          "Titre": "Shipping is slow but they did well",
          "Contenu": "They processed and shipped my order quickly"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rick Ward",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T00:36:47.000Z",
          "Titre": "Good product. On time. Totally satisfied",
          "Contenu": "Good Product. Delivered at the time promised. Would recommend the service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Book maker",
          "Nb_Reviews": 1,
          "Date": "2022-06-04T22:19:12.000Z",
          "Titre": "I would have liked updates on the books…",
          "Contenu": "I would have liked updates on the books completion and information about when it was shipped and delivered."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Colby Haugen",
          "Nb_Reviews": 2,
          "Date": "2021-11-22T22:38:15.000Z",
          "Titre": "Super Easy",
          "Contenu": "This company was amazing. I was able to write my book in about three months and it turned out great! The only problem was that the colored book are really expensive."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Mme BAUGE",
          "Nb_Reviews": 2,
          "Date": "2021-12-20T15:13:37.000Z",
          "Titre": "I received my order after three weeks",
          "Contenu": "I received my order after three weeks, and as I waited the customer service was very responsive to informing me about the shipment updates."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Yoder",
          "Nb_Reviews": 3,
          "Date": "2021-12-28T03:00:32.000Z",
          "Titre": "We wold like for the thumbnails to be a…",
          "Contenu": "We wold like for the thumbnails to be a bit larger, and a bit easier to edit texts.  Books are very nice.  Excellent work"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Colby Haugen",
          "Nb_Reviews": 2,
          "Date": "2021-09-10T15:54:18.000Z",
          "Titre": "Super Easy to Make!",
          "Contenu": "My book was awsome when I finished it! It turned out great and it was so easy to make!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Payne",
          "Nb_Reviews": 1,
          "Date": "2020-12-23T12:06:41.000Z",
          "Titre": "The final product and the quality of…",
          "Contenu": "The final product and the quality of the reproduced pictures were excellent as was the speed of delivery following the order. A user should definitely complete writing their text and proofread before inserting it due to the lack of a spell check feature and the very small size of the print in the review tab. Creation of a Table of Contents is difficult because what you see is not what prints as page numbers end up on the next line down."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Happy Mom",
          "Nb_Reviews": 1,
          "Date": "2020-12-28T16:56:31.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use. Happy with the quality. Used to create a book for my son's short stories. Copy pasted text from Google docs easily. Adding pictures was not so easy. If the story took up almost  three pages, and you wanted to drop a picture in the extra space at the bottom of the 3rd page- you had to change templates and retype that section if the story. I would have been easier to add an image box- size it then drop picture in. Otherwise loved it. Will use again when there is a sale."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeremy",
          "Nb_Reviews": 3,
          "Date": "2021-03-20T07:51:35.000Z",
          "Titre": "Great job!",
          "Contenu": "I enjoyed the ability to put this book project together that Solentro was able to help me with. It was easy to figure out along with the tutorials. I do wish there were more options for certain parts, but I can't complain because they allowed me to create exactly what I wanted."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Forlkc",
          "Nb_Reviews": 2,
          "Date": "2020-09-15T19:27:42.000Z",
          "Titre": "I put together a 20 page book and it…",
          "Contenu": "I put together a 20 page book and it was generally user-friendly and I was delighted with the result.  I liked the way text automatically moved to successive pages.  One area of improvement relates to templates.  It would be easier if I could change the size allocated to text/photos by adjusting the size right on the page through dragging rather than having to create a new template each time I wanted to revise.  There was a lot of trial and error, especially with photos, to get the right proportions."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cayce Chalk",
          "Nb_Reviews": 4,
          "Date": "2019-01-06T00:39:03.000Z",
          "Titre": "I  had the opportunity to order from…",
          "Contenu": "I  had the opportunity to order from three different book companies.  I like the finished product from Solentro, but it was not the easiest book project application to use. Also I felt the templates for pictures were limited and the quality was less. Granted I couldn't figure out how to customize templates, which is an option. Also it was one of the more expensive for a non hardback option."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Linda McClendon",
          "Nb_Reviews": 3,
          "Date": "2018-12-30T17:41:37.000Z",
          "Titre": "Great site to create your book",
          "Contenu": "Great site to create your book. Very helpful customer service. After losing about 60 pages of my typing one night, I emailed them and they responded promptly and recovered it by the next morning. The only reason for four stars is they are a little expensive when you get ready to print the book. I have had to put off my printing for now. But would definitely use them again."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Shadow Black",
          "Nb_Reviews": 2,
          "Date": "2020-04-25T18:36:21.000Z",
          "Titre": "I love my books everything was way better",
          "Contenu": "I love my books, everything was way better than I expected. Great covers, the glossy thick pages. the color was fantastic, and my books arrived much faster than I expected.  I did find however, the App is not really user friendly, and took some figuring out (I am  techno Challanged), but once i figured it all out, then it was really easy to do.  I am impressed with the work and speed at which I got my books in these troubled times.  The Covid-19 is giving most a hard time so THANK YOU for all you are doing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "R. Hale",
          "Nb_Reviews": 1,
          "Date": "2019-01-07T21:51:32.000Z",
          "Titre": "Great Company",
          "Contenu": "I have used Solentro twice for self-published books.  They are a little pricey, but the results are beautiful and delivery is quick.  The only drawback is getting used to the format and editing features, adding photos or making sure your text is on the page correctly.  They also have a feature for adding an ISBN number if you want your work copyrighted."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nate Olson",
          "Nb_Reviews": 1,
          "Date": "2018-08-18T01:32:43.000Z",
          "Titre": "Quality was great",
          "Contenu": "Quality was great!  Price got out of control - I paid more than double than what I expected -Every time someone was looking at my photo book - I jokingly would say: this only cost $75 -- Then watch person's face go WOW!! & proceed to turn pages more' gently -- ha Really happy with my book BUT unsure if I would do it again"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stacy W James",
          "Nb_Reviews": 1,
          "Date": "2019-08-13T12:13:39.000Z",
          "Titre": "Easy to make, beautiful work but pricey",
          "Contenu": "Found Solentro while looking for book publishers. It took me a about 15 mins to figure out how to use their system to create a book, but once I did it smooth. Once my creation was complete, and I went to have it priced, it was straight forward. Pricing was a little high, but I went ahead and made the purchase to see how the books would turn out. Received the book in about a week and half and it was amazing! Still a little pricey but it turned out greats. So the pricing is the only reason for my 4 rating."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Barbara Forrest",
          "Nb_Reviews": 1,
          "Date": "2018-12-13T21:52:50.000Z",
          "Titre": "I was very pleased with the final…",
          "Contenu": "I was very pleased with the final product.  It was very easy to download pictures and type subtext for the pictures.  It was a little frustrating to copy and paste the text from my Word document and then find errors on the print preview. I would just caution users to read every word of the text.  My only issue is I don't like that hyphenated words get spilt onto different lines; it didn't show that it was going to do that on the print preview.  Overall, I would recommend this program highly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JAMES HANUS",
          "Nb_Reviews": 3,
          "Date": "2022-05-15T23:09:31.000Z",
          "Titre": "The product is very good",
          "Contenu": "The product is very good, but I think the price is a little high.6 books at $77 each."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ashira",
          "Nb_Reviews": 1,
          "Date": "2021-03-02T21:34:04.000Z",
          "Titre": "Good experience",
          "Contenu": "Pretty easy to use, high quality product, fast shipping. It's probably not possible, but one improvement would be the ability to resize photo templates on custom pages without creating a whole new page. Otherwise, quite happy with the experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "G.W.",
          "Nb_Reviews": 1,
          "Date": "2016-11-27T19:05:23.000Z",
          "Titre": "Timely guidance",
          "Contenu": "Solentro worked beautifully to make a personalized picture and word book.  The best thing about it was the fact that if I had questions or didn't understand something, they were right there to guide me through.  Some of my pictures were not the greatest resolution, but they did a beautiful job making them as resolute as they could be."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brendan",
          "Nb_Reviews": 1,
          "Date": "2016-01-28T23:40:19.000Z",
          "Titre": "Great product",
          "Contenu": "I wrote a storybook for my young child. Overall I'm incredibly satisfied with the finished product.  The website was easy to navigate and the templates were simple to use. However, I did find that I disliked the templates as provided- the picture sizes were odd and cropping was difficult. Additionally, spacing the text on the page was not ideal. In the end though, the quality of product I received was great and I am very happy with the final book."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "steve j.",
          "Nb_Reviews": 2,
          "Date": "2020-04-24T20:59:23.000Z",
          "Titre": "I found it to be an excellent value",
          "Contenu": "I found it to be an excellent value. The speed of delivery was also excellent.I had a little difficulty getting my input to the pages, but was able to do whatever I needed.I am planning on a second edition soon. The book was well received by the friends who reviewed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jason Blair",
          "Nb_Reviews": 3,
          "Date": "2020-01-26T21:54:11.000Z",
          "Titre": "Great UX and finished product, but at a cost",
          "Contenu": "Solentro’s UI is easy to use and helped me write a text heavy book with some digitally enhanced photos from WWII. The results came out great, but the costs are very high for printing and shipping. So absolutely no knocks on the quality of the finished product, but pricey."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rachel",
          "Nb_Reviews": 1,
          "Date": "2017-09-04T22:00:22.000Z",
          "Titre": "Great finished product",
          "Contenu": "Great finished product. Arrived really fast. Nice to be able to include both text and photos in a way that fit my needs. Once I figured it out, was really easy to create my book. Only challenge was creating my own template, which took a lot of tries to figure out. Will definitely use again in the future."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amy",
          "Nb_Reviews": 1,
          "Date": "2019-03-06T15:20:12.000Z",
          "Titre": "I made a book for my daughter's 30th…",
          "Contenu": "I made a book for my daughter's 30th birthday. Making it personal with all her favorites in the 1st year of her birth year along with events and price of things that happened that year. #1 songs each year top movie, tv..  put pictures in of every year of her life. It came out so great! I was really impressed. Ship when they said it would arrive. My only complaint was it was not user friendly. When you change font size kept adding pages. Trouble getting it back threw off picture templets when changing to writing. But it was worth it! Loved it!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ralph",
          "Nb_Reviews": 4,
          "Date": "2019-01-12T00:07:52.000Z",
          "Titre": "The final product is extremely well…",
          "Contenu": "The final product is extremely well done and the company is very professional.  The program to create the book is a little hard to use, not user friendly, but once you work with it you can figure out the best way to modify things.  Would definitely use them again for my next project."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Judith P",
          "Nb_Reviews": 3,
          "Date": "2015-12-24T20:33:48.265Z",
          "Titre": "Our little book",
          "Contenu": "We thought the quality of the spiral was good. We had wished for more latitude regarding getting hardback quality with fewer pages than what is required since it is a children's book. That and the price per copy were a bit prohibitive. Shipping was quick and the book arrived in very good condition."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "The Gravells",
          "Nb_Reviews": 2,
          "Date": "2020-05-30T23:36:37.000Z",
          "Titre": "Our book is beautiful",
          "Contenu": "Our book is beautiful. And we are starting to write another one. It's a great program and the customer service is outstanding. Our only suggestion is to incorporate spell (and possibly grammar) check into the text to support the proofing process."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Diana Fuller",
          "Nb_Reviews": 1,
          "Date": "2019-06-06T16:16:06.000Z",
          "Titre": "happy customer",
          "Contenu": "My experiences have been very satisfactory. I “lost” my draft a couple of times but the support staff was swift to help me. Since I started using your service, prices have continued to climb. Understandable. I will check other sources before I produce another book."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ellen Tarver",
          "Nb_Reviews": 3,
          "Date": "2020-05-01T12:40:15.000Z",
          "Titre": "The end product was fantastic",
          "Contenu": "The end product was fantastic! And I got it in a week, which is unheard of! I was enormously pleased with the books I received. The only reason I'm not giving 5 stars is because the program to enter the book isn't as easy as I wish it could be. I had to learn as I went and start over several times because I didn't know how to undo things when I made a mistake. I didn't know how to delete a single page (they are added in pairs), so I had a couple of blank pages in the book. But I want to say again that the speed of arrival and the quality of the books was 5 stars. 10 if I could give them! Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Renee Morton",
          "Nb_Reviews": 3,
          "Date": "2015-11-16T17:45:30.836Z",
          "Titre": "Great until they put it in the mail",
          "Contenu": "I love the site (although it took a little getting used to) and the book is beautiful, exactly as I'd created it.  I realize that it was coming from Sweden, but it took one month from the order date to the arrival date, which seemed rather slow. That would have been okay if I could have tracked the package but their tracking link listed only the mailing date and nothing else. I got a little nervous.  They were prompt in responding to my inquiry, but gave no ETA or any other information. It finally arrived, though, and we're very happy with the results."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paolo De Mestrio",
          "Nb_Reviews": 1,
          "Date": "2015-12-11T15:51:37.859Z",
          "Titre": "Solentro Experiance",
          "Contenu": "I tried using many different companies, but Solentro was the easiest and with no down loads.  I received my books faster than stated and I am very happy with the end result.  \rThe only drew back I have is the cost.  But to be honest I have used another company which was just a little bit cheaper, but not worth the trouble.\rAlong with the help of Solentro, we have made a wish of mine which was 50 years in the making come to print.  \rI hope to be writing more in the future and will be using Solentro for my book.\rIt was just very easy for me and with great end results."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DenaT",
          "Nb_Reviews": 1,
          "Date": "2015-06-18T14:33:48.022Z",
          "Titre": "Enjoyed the process.",
          "Contenu": "I liked how my books turned out. Customer service in terms of reaching them could have been easier and I would have liked to know that my books were being shipped from Europe earlier in the process. Still, all in all it was a good experience and I'd use them again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Judy Gross",
          "Nb_Reviews": 1,
          "Date": "2018-06-16T02:23:13.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience, quick response time from customer service, rapid turnaround, quality product. My only disappointment was that the coupon presented at the beginning of the process ended up being less than what I expected.I would use Solentro again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jason Blair",
          "Nb_Reviews": 3,
          "Date": "2017-12-23T15:58:36.000Z",
          "Titre": "Solentro books are professional quality …",
          "Contenu": "Solentro books are professional quality printing and binding materials. The UI and text and photo editing tools are easy and intuitive to use, enabling you to create a quality book. It’s a touch on the expensive side, but you get what you pay for."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Peyton",
          "Nb_Reviews": 1,
          "Date": "2016-06-01T14:46:16.000Z",
          "Titre": "Quality product--took a long time to get",
          "Contenu": "I had a hard time with my bank and allowing money transfer, but once I was able to pay for the product, it came fairly quickly and was high quality. The website is easy to use and they deliver what is promised. I will definitely be using them again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vikki",
          "Nb_Reviews": 1,
          "Date": "2015-06-18T19:48:49.577Z",
          "Titre": "The tool was relatively easy to use but could use more options.",
          "Contenu": "The platform was relatively easy to use. I would've liked a few more options to manipulate photos and adjust fonts.\r I experienced problems paying, so I'd recommend a few more options for people in the United States...perhaps PayPal."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hallie",
          "Nb_Reviews": 2,
          "Date": "2017-05-08T22:59:43.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience! Couldn't believe how fast the shipping process was. Wish it was a little more user friendly/intuitive like other photo book websites. The book we created will be treasured forever. We will be returning customers!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DeMarco",
          "Nb_Reviews": 1,
          "Date": "2017-06-01T20:59:30.000Z",
          "Titre": "Amazing!!",
          "Contenu": "Amazing!!! Came supper fast and it's wonderful quality. I wasn't aware we had to call our credit card company before ordering so that took some time to clear up but other wise I will definitely be using the again!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Garcia",
          "Nb_Reviews": 1,
          "Date": "2020-03-01T17:43:35.000Z",
          "Titre": "Great book!",
          "Contenu": "What a great product with great customer service. My only issue was with the website. I didn’t find it totally user friendly. It took some time to figure out the formatting, but once I did, it was okay."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike Scheuerman",
          "Nb_Reviews": 2,
          "Date": "2017-05-01T03:26:30.000Z",
          "Titre": "The Solentro site is quite good and …",
          "Contenu": "The Solentro site is quite good and easy to work with for the most part.  There are a couple of improvements that could be made to make the site easier, however they're fairly minor and overall it works quite well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wanda Chatmon",
          "Nb_Reviews": 2,
          "Date": "2020-10-07T20:09:08.000Z",
          "Titre": "Overall Satisfied",
          "Contenu": "The book came in record time. I was a little disappointed in the quality of the book. Its not that its cheaply done but for  $100+ I expected a better quality in the paper and the book itself."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Petrocelli",
          "Nb_Reviews": 3,
          "Date": "2018-08-23T00:41:21.000Z",
          "Titre": "I have used Solentro twice",
          "Contenu": "I have used Solentro twice. Both times I have been very satisfied but there needs to be better HELp section with live or close to immediate service to questions.  The site works a little slowly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patricia Puskar",
          "Nb_Reviews": 1,
          "Date": "2017-01-16T08:56:18.000Z",
          "Titre": "Very Pleased",
          "Contenu": "I am very pleased with my printed book. It exceeds my expectations. It was  more expensive than I thought it would be. However, to share memories with my family it was well worth the price."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Deronte Craig",
          "Nb_Reviews": 2,
          "Date": "2019-05-30T10:51:57.000Z",
          "Titre": "I was absolutely delighted with your…",
          "Contenu": "I was absolutely delighted with your service and the quality of the product! The site was very user friendly and I look forward to using your company again in the future. I provided 4 stars, for what I normally would consider a 5 star review. I attribute this to the fact, I wasn't permitted to obtain the discount for ordering two books.I had to send the books to, two different addresses. I sent an email prior to ordering, inquiring where on the order could the second address be listed. I received a timely response, informing the order would need to be placed separately. There was no mention that in doing so, I could not obtain the discount. I only learned this in placement of my order.As, stated before, the experience was excellent, and I will use again, but I was disappointed not to obtain the two for discount price."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Coup",
          "Nb_Reviews": 1,
          "Date": "2019-12-12T15:41:10.000Z",
          "Titre": "Great Product - weak editing abilitiy",
          "Contenu": "I was looking for a site that would allow narrative with some pictures.  Many sites are geared for making photo books.  I was very pleased when I found Solentro! I did not find the site easy to navigate -- the editing tools are very basic.  The help screens are not helpful at all, but the customer support (via email) was helpful in the times that I emailed them. I got the job done, but they really need to increase the site's ability to edit text and to have more template layouts.  You can create your own page layouts but once made, I could find no way to edit them (resizing pictures, changing the layout of text, etc).  I was very pleased with the completed project and what I saw on the screen is what was produced (and in quality form).  I would use them again, but would really like more editing capability and the ability to adjust photos and text."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Pete Ryan",
          "Nb_Reviews": 16,
          "Date": "2020-04-03T15:46:39.000Z",
          "Titre": "Formatting Ease",
          "Contenu": "All round the easiest formatting I've come across. The quality is good, as is the communication. Just a bit expensive, certainly as soon as one wants colour."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kat T.",
          "Nb_Reviews": 1,
          "Date": "2019-01-23T14:24:18.000Z",
          "Titre": "Excellent quality.",
          "Contenu": "Excellent quality.  My books are beautiful.  It would be five star, but they are on the expensive side.  However, the quality is fantastic so the price is worth it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "B R",
          "Nb_Reviews": 1,
          "Date": "2015-11-13T20:31:51.280Z",
          "Titre": "Excellent Company - read shipping FAQ before order",
          "Contenu": "I used Solentro to make an anniversary gift book for my sister. The interface of the program was incredibly easy to use so that I could customize to my exact needs. The finished product is beautiful and professional. \r My only caveat is that because of the company's location all purchasers should read the FAQ about shipping BEFORE beginning their project. I didn't. The three week shipping time had me sweating furiously about whether or not the book would arrive in time for their anniversary.\r However, to turn a negative into a positive: when I got too anxious, I emailed the company to ask about shipping details and tracking information and the VERY NEXT MORNING got a personal reply with all the reassurance I needed. \r In short: excellent software, excellent product, excellent customer service. Just make sure the timetable works for you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jean Freeman",
          "Nb_Reviews": 1,
          "Date": "2019-01-01T19:04:18.000Z",
          "Titre": "Overall a very good experience -- I plan to do it again",
          "Contenu": "I was very pleased with my Solentro experience, and I plan to use it again.  I had no previous experience with self-publishing, but I was able to create the book I wanted.  I'm a moderately skilled computer user, and with only one or two hiccups was able to navigate Solentro's templates to get my desired outcome.  The finished book was exactly as promised, and it arrived surprisingly quickly.  I had such a good time with the whole experience that I'm already planning other projects I can create on Solentro.I wish the site offered more options in book sizes and page templates.  When it wasn't clear to me how to do what I wanted, I would have appreciated a chat function to streamline figuring out the answer, instead of going through FAQs and experimenting on my own.  Still, these are fairly minor quibbles; and in the end, I was delighted with the book that resulted."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Mauriello",
          "Nb_Reviews": 1,
          "Date": "2018-02-14T22:36:28.000Z",
          "Titre": "Easy to use, quick turnaround",
          "Contenu": "I had a positive experience with Solentro. It was easy to navigate and I received my book on a timely basis. The only thing I wish they had was spell check."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrew Schwalb",
          "Nb_Reviews": 1,
          "Date": "2019-01-22T16:16:53.000Z",
          "Titre": "Good value and high quality",
          "Contenu": "Good value and high quality.  Tool is a bit clunky but very usable.  Shipping was slow and we missed Christmas by a week, so that was disappointing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kashia Campbell",
          "Nb_Reviews": 2,
          "Date": "2020-11-07T00:13:55.000Z",
          "Titre": "Ease with which I was able to navigate",
          "Contenu": "Ease with which I was able to navigate. Would have love a better process to have pictures automatically resize and fit to document/sheet."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Martha B.",
          "Nb_Reviews": 1,
          "Date": "2020-12-20T21:14:25.000Z",
          "Titre": "Easy to use",
          "Contenu": "The site was very easy to use, and the finished product pretty impressive for an amateur publication. We used a lot of colored photographs which were crisp and clear, including those that were flagged for possible problems. The facility with which I could add or subtract pages and upload photographs made the whole project much easier.There were a couple of things that I'd like to see. One is a better HELP function with questions and answers. Sometimes I had to read a whole page through before I figured out what I needed to do. Also, (and I don't know how you'd fix this), I ended up using a larger font and therefore editing text (sometimes pretty severely) because I couldn't figure out how the font size would translate to the printed page. Using the preview function really didn't help with that dilemma. Everything turned out fine in the  end, but I didn't really need to spend the time editing that I did. More text and size 8 or size 10 font would have been fine."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paige",
          "Nb_Reviews": 1,
          "Date": "2020-05-29T23:32:13.000Z",
          "Titre": "Great quality and timely shipping",
          "Contenu": "Great quality and timely shipping. Website difficult to navigate on mobile phone/iPad, but very pleased with how the product was printed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tiffany",
          "Nb_Reviews": 5,
          "Date": "2019-05-15T02:32:06.000Z",
          "Titre": "It was a bit expensive but the final…",
          "Contenu": "It was a bit expensive but the final product looked very nice. I do wish the that proofreading and text layout tools were a bit more robust."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Krupa Patel",
          "Nb_Reviews": 1,
          "Date": "2016-03-17T03:05:08.000Z",
          "Titre": "Good",
          "Contenu": "It was a good purchase. I like the color print, but the font placement was weird and it was hard to correct on the website. Overall, I enjoyed it"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephanie West",
          "Nb_Reviews": 1,
          "Date": "2016-08-18T05:57:10.147Z",
          "Titre": "Easy to use, great finished product",
          "Contenu": "Once I got the hang of it, it was easy to use. It was inexpensive and shipped within a week. I would use Solentro again!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Evy Pålson",
          "Nb_Reviews": 1,
          "Date": "2019-02-24T19:23:06.000Z",
          "Titre": "I LOVED THE BOOK",
          "Contenu": "I LOVED THE BOOK, AND SO DID MY FRIENDS. THE TEXT AND PICTURES LOOKS GREAT.  GOOD JOB !FUN BOOK TO HAVE"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kristoffer Grimsley",
          "Nb_Reviews": 1,
          "Date": "2021-01-18T04:22:11.000Z",
          "Titre": "Fantastic quality and the site itself…",
          "Contenu": "Fantastic quality and the site itself was easy to use. My only problem was with how pricy it was"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Julie Klebe",
          "Nb_Reviews": 1,
          "Date": "2017-01-03T19:31:28.000Z",
          "Titre": "Excellent finished product! Big learning curve!",
          "Contenu": "Yes, I would definitely use Solentro again as the final product was just as I'd hoped! However, I will say I didn't find the website overly intuitive. I wish they would post instructional videos on how to use the site, as I felt instruction was lacking (or else I didn't know where to look!). I think the biggest complaint I had was there is no 'word' or 'character' count when typing text. One has no idea when you've run out of space in a particular text box until you're finished typing and go to view the page and see you've run out of space. But it doesn't tell you at what point that happened. So with much trial and error, I finally figured out a system that worked for me. Once I got it down, then it went much smoother. I will say though, for every question I fired at them through email, they were very prompt in responding!  I wish they'd set up live chat sessions however. Many times I was working on the book and I'd have a question, and I'd have to wait until they responded via email as to how to solve the problem. More real time assistance would be wonderful! That said, the final product is exactly what I'd hoped it would be and will definitely use Solentro again!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eileen P",
          "Nb_Reviews": 2,
          "Date": "2016-04-06T14:33:11.000Z",
          "Titre": "overall excellent experience",
          "Contenu": "Overall the site was easy to use, and I LOVED that everything was saved as I went. No worries about losing anything if not saved. \rIt was pretty easy to figure out the basics of how to create the book.\rThe template I used did not offer any option to be creative with using angled placement of text or photos, which would have really added to the final product. Not sure if there are other templates where this could be done. On the plus side, custom templates for pages were pretty easy to make. \rI was surprised when I placed the order and had both of my credit cards rejected without explanation. I eventually realized that, being a European company, a chip card was required. It would have been nice to know up front, or at least to have an explanation when my cards were rejected. The USA is unfortunately WAY behind Europe in using this technology, and many people don't yet have chip cards. I ended up having my brother pay, and coincidentally, 2 weeks later my new chip card arrived in the mail. \rOne final little issue is that the book covers (I ordered 10 copies) are all warping a bit unless they have weight on top of them. \rOverall though, it was a great website to use. I'd recommend it to others, but would love to see these little issues addressed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gerry Druenn",
          "Nb_Reviews": 1,
          "Date": "2016-03-03T13:12:42.072Z",
          "Titre": "Terrific!",
          "Contenu": "-Would be good to have an added  ISBN  option and otherwise a bit high cost-wise...\r=]"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dan Hamilton",
          "Nb_Reviews": 1,
          "Date": "2019-03-03T16:53:44.000Z",
          "Titre": "Generally liked Solentro",
          "Contenu": "Generally liked Solentro.  Publishing cost surprised me, higher than I expected."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alejandro Padilla",
          "Nb_Reviews": 1,
          "Date": "2018-11-06T21:25:58.000Z",
          "Titre": "Excellent quality book",
          "Contenu": "Excellent quality book, website easy to use. A little bit on the expensive side."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Lorenzo",
          "Nb_Reviews": 2,
          "Date": "2017-02-23T21:15:26.000Z",
          "Titre": "For the time being all right",
          "Contenu": "I wanted to know how do I get information on the dispatch of my two books. Thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "mary cobb",
          "Nb_Reviews": 1,
          "Date": "2018-10-31T18:27:50.000Z",
          "Titre": "thank you",
          "Contenu": "thank you.but book was to small and I do not want other one thank you.mary cobb"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Edward Harris",
          "Nb_Reviews": 1,
          "Date": "2020-07-01T20:35:11.000Z",
          "Titre": "I guess?",
          "Contenu": "well I haven't tried it yet ,but I think it's very very good"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jackson Carson",
          "Nb_Reviews": 1,
          "Date": "2018-10-30T16:38:52.000Z",
          "Titre": "Fantastic quality, but typical business aspect",
          "Contenu": "Fantastic quality. Unimpressed with the $15-no-watermark condition."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bob",
          "Nb_Reviews": 3,
          "Date": "2019-06-11T16:39:18.000Z",
          "Titre": "The book turned out great",
          "Contenu": "The book turned out great.  I made a journal of when my son was born premature and in the NICU for 107 days.  The book was a good mix of text that I had written previously interlaced with images as he progressed in the hospital.  I knew I had a lot of text to copy and past into the book and Solentro met my needs.  The final quality of the gloss hardback book was great.4 Stars because:1)  The word/image template layouts are limited.  It's great you can customize your own, but some guides to placement would help.  Also would like a good choice of page layout/backgrounds as well as including stickers/captions/labels and free-text options2)  Some images will not be the right resolution in which case it get's a \"warning\" triangle.  The preview available for such types of images won't show you what you actually will get if you read the Solentro disclaimer.  Luckily my images turned out as expected but this feature made me nervous3) Previewing a page is tedious.  You have to open up the text and then select preview.  Otherwise you have to preview starting from page 1 and selecting the page number you want to go to.  There should be a button on the book preview where you can select a page and preview right from there4) Being a U.S. customer, I didn't realize this was a company in Sweden until I was ready to place an order hoping to get it in time for Mother's day.  I was hoping for more transparent shipping details, like estimate time for arrival upon placing my order.  Not until I received a fedEx tracking number did I know I'd be getting the book 2 weeks later"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Elaine Young",
          "Nb_Reviews": 1,
          "Date": "2016-02-05T18:50:44.006Z",
          "Titre": "love my books!",
          "Contenu": "glad you ship overseas as we have returned to USA"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "J&M Manufacturing",
          "Nb_Reviews": 1,
          "Date": "2021-01-22T15:29:55.000Z",
          "Titre": "Great quality and quick shipping"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian G.",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T14:39:00.000Z",
          "Titre": "Children's Book",
          "Contenu": "My 10 year old granddaughter has quite an imagination. Over the last year, she had been making up short stories about one of her stuffed animals. For a surprise Christmas gift, I collated the stories and added pictures. Solentros' website was very user friendly. The book was completed and received within 2 weeks. The hardbound cover, colors are very well made with heavy paper for the pages. I will be using Solentro again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donna Meistrich",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T22:07:17.000Z",
          "Titre": "I loved how easy it was to use",
          "Contenu": "I loved how easy it was to use. It shipped fast and was printed well. I thought it was crazy expensive making it impossible to publish. That was the only bummer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gunilla",
          "Nb_Reviews": 5,
          "Date": "2023-12-12T15:31:54.000Z",
          "Titre": "Always a GREAT fun project when making…",
          "Contenu": "Always a GREAT fun project when making a Solentro keepsake! This time books for our grandsons. Added more pictures/memories than I had planned and the books look fabulous! The soft cover square books will be great for little hands."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karyssa Cutsail",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T17:51:00.000Z",
          "Titre": "Very good",
          "Contenu": "They changed my shipping info and delivered it before I expected with great quality"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sharon Paulson",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T16:57:23.000Z",
          "Titre": "Lovely end product!!!!",
          "Contenu": "Ended up with a beautiful book, after undergoing a fairly steep learning curve. Will use Solentro again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Miyuki Elumeze",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T18:53:53.000Z",
          "Titre": "Very good software",
          "Contenu": "It was quickly done. Quality was great!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathy S",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T15:30:02.000Z",
          "Titre": "Exceptional customer service",
          "Contenu": "Exceptional customer service (quick response time, friendly, accommodating) You get exactly what they advertise, and better. The end product looks like it was done from A-Z by a professional, when a mere amateur like me was able to design the whole thing with the help of their excellent online software. Shipping was timely and painless.  I can't recommend them enough...A+++!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rhonda Q",
          "Nb_Reviews": 1,
          "Date": "2023-03-08T16:16:58.000Z",
          "Titre": "Fantastic product, fantastic experience!",
          "Contenu": "Fast turn around time. All 22 copies arrived in perfect shape. Paper quality & thickness, photos, text, binding, everything perfect - even better than I expected. Impressive speed of completion once I hit submit. Timely responses to questions. I do wish the pagination button prompted me for a final yes/no just before hitting submit. Website took a bit to get used to - not as intuitive as I would have liked. That said, once I was familiar with it, it was easy to use. I will be using Solentro again & highly recommend them to you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathy S.",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T16:30:30.000Z",
          "Titre": "Five stars is putting it mildly....",
          "Contenu": "The only reason I tried this site was because of the hundreds of great reviews.  I created a cookbook for my daughter which took me several months to complete and, in my humble opinion, the end product is spectacular....I know she will treasure it.  I had issues in the interim which were resolved immediately and more than satisfactorily.  The shipping time was quicker than anticipated.  I cannot say enough good things about my experience.  I would highly recommend Solentro to anyone...once you get the hang of how to use all the features you will not be disappointed that you chose them for your project.  I look forward to using them again. Thank you SOLENTRO!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gunilla",
          "Nb_Reviews": 5,
          "Date": "2021-09-30T18:13:45.000Z",
          "Titre": "Fabulous!",
          "Contenu": "I ordered 2 separate books from our beautiful July wedding - a larger (Maxi Panorama) for ourselves and our adult kids and a smaller (square) copy for a few close friends. With 500+ awesome pictures to chose from I knew I had a big project on my hands but I enjoyed a fun, rainy week-end being creative and they arrived from Sweden to the US remarkably fast! And the books are fabulous! High quality, color-sharp and a pure delight to hold & see. I would highly recommend Solentro for any photo book project."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 2,
          "Date": "2023-08-11T22:27:29.000Z",
          "Titre": "Great company, beautiful book",
          "Contenu": "It took me some time to figure out how to get the text and pictures arranged exactly as I wanted but there was always a way to do it.  After I became fluent with the process, it was actually quite fun.  There are ways put photos and text in a premade format or personalized formats can be created.  I really liked that flexibility.  When I realized the company was not in the US I figured it would take some time to receive the finished product but I was so wrong!  Within a few days of submitting the book it was finished and shipped out. I received notification and tracking information from FedEx immediately and was notified every day detailing where the book was. I received it within a week which was totally unexpected.  The book is beautiful and I will certainly create more projects with them in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janice Hutton",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T20:09:18.000Z",
          "Titre": "Beautifully done",
          "Contenu": "Beautifully done, delivery surprisingly fast and very reasonably priced.  I could not be happier with the final product. Thanks so much!  It was exactly what I wanted."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marcy Sanders",
          "Nb_Reviews": 1,
          "Date": "2022-09-02T04:35:44.000Z",
          "Titre": "Professional Product and Good Service",
          "Contenu": "The book is beautiful, quality, professional and a fantastic glossy look. It came very fast and packaged well.The learning curve was a bit steep for me, not having done anything like this before, but I see that new learning tools have been added since then.Customer service was very helpful. I love that everything is saved automatically.I'm happy I chose Solentro."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "P ATWELL",
          "Nb_Reviews": 2,
          "Date": "2023-05-17T22:04:25.000Z",
          "Titre": "Beautiful Book",
          "Contenu": "I created a beautiful book using Solentro.  The pictures were true in color to the ones submitted and that was very important to me.  I found Solentro very easy to use.  I have made several children's books previously.  The latest book was 92 pages of my nature photos and text.   I was extremely happy with the results.  I will always use Solentro when creating a book."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deb",
          "Nb_Reviews": 6,
          "Date": "2023-11-17T14:48:47.000Z",
          "Titre": "Great Quality",
          "Contenu": "I've done several books on Solentro and love their service. Easy to use and great quality."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brandon Vazquez",
          "Nb_Reviews": 1,
          "Date": "2022-05-05T00:03:34.000Z",
          "Titre": "Amazing book quality",
          "Contenu": "Had a great time writing a cute little novelty gift for my girlfriend. Shipping was an absolute nightmare and the website user interface could most definitely use an upgrade both on desktop and mobile but man the book quality came out amazing. Definitely will be coming back to make another small book for my mom very soon."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christina",
          "Nb_Reviews": 2,
          "Date": "2022-12-31T16:41:28.000Z",
          "Titre": "Solentro has been a pleasure…",
          "Contenu": "Working a Solentro has been a pleasure from beginning to end. The software is top notch - easy yet more powerful and flexible than any other I found. There were no unexpected charges for the voluminous pictures I uploaded and included. The final product arrived more quickly than I would have ever expected considering it was shipped from the other side of the world. And it is beautiful. Fully met and even exceeded my expectations for quality. I would happy recommend and use this company again. Thank you Solentro for a great experience and a memory book my son will forever cherish."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ann G Montgomery",
          "Nb_Reviews": 4,
          "Date": "2021-11-30T13:43:42.000Z",
          "Titre": "I was very pleased",
          "Contenu": "I was very pleased! While putting my book together, Solentro staff answered my questions and offered support in a timely way.  I LOVED the finished product.  My little book actually arrived slightly damaged from the shipping process.  Solentro very promptly sent me another book which arrived in perfect condition!  I highly recommend Solentro!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eri Moore",
          "Nb_Reviews": 2,
          "Date": "2023-03-30T22:32:55.000Z",
          "Titre": "Great service, great company!",
          "Contenu": "I’m updating my review. Solentro has top notch customer service! Wow! I’m impressed with this alone. My book is on its way and I’m so excited to see it. The digital copy looks fantastic! I recommend this company to everyone. The experience of making the book was delightful. I cannot wait to use Solentro again to make another book. I’m hooked!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Windahl",
          "Nb_Reviews": 2,
          "Date": "2022-06-20T14:31:14.000Z",
          "Titre": "Quick Quality",
          "Contenu": "I needed a way to create a text-only book with a photo cover. Solentro allowed me to do that easily with professional results. Unbelievable, the 2 books I ordered did arrive within 1-2 weeks. One had loose pages. When I brought this to Solentro's attention, I got an immediate reply and they shipped me not one but two books, again in only 1-2 weeks. I give Solentro high marks for quality of service, quality of product and quick turnaround."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gunilla",
          "Nb_Reviews": 5,
          "Date": "2023-03-09T13:42:28.000Z",
          "Titre": "Wonderful Disney Memories",
          "Contenu": "I made Disney picture books for myself as well as for my sons and their families after our fabulous February week at Disney World. The books returned to me in United State in a week and we are all delighted with both the picture quality as well as the sturdy quality of the books, perfect even for our young grandson's lil' fingers to turn the pages in to remember our wonderful Disney days, bringing endless smiles. High quality, fast delivery and all-around fabulous books! And even though the books were 84 pages I wish I would have added even more pictures!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adam Estes",
          "Nb_Reviews": 2,
          "Date": "2022-07-07T23:08:28.000Z",
          "Titre": "Easy to build",
          "Contenu": "Easy to build, and order.  Came faster than I anticipated.  Maybe an estimate on how quickly assembly and shipping may be?  Not that fast service is a bad thing - it's good.  Trying to think of something constructive besides just positive feedback."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trisha",
          "Nb_Reviews": 1,
          "Date": "2022-07-12T07:46:33.000Z",
          "Titre": "This book was simply amazing for our high school graduate!",
          "Contenu": "This book was simply amazing for our daughter's graduation gift. Friends and family wrote well wishes and sent photos to me via email. I then placed those writings and photos into this book.  Now when our daughter is at college missing friends and family, she can read all about how much they love her and remember the fun memories that go along with each person that played such an important role in her life. It was a joy to make! The site is easy to navigate, and fun to create. I only wish the writing automatically went onto the next page if there are photos involved."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda Bobbitt",
          "Nb_Reviews": 1,
          "Date": "2023-02-04T20:46:41.000Z",
          "Titre": "Beautiful, flexible and fast",
          "Contenu": "We created an album with photos and stories from my mother for her 80th birthday. The software took a minute to learn but was very flexible. We put in photos with captions along with pages of text/stories in various layouts including many custom page arrangements. That flexibility is why we chose this product. It took us 3 months of off and on work, but each time we returned it was there safe and sound.Once we ordered it was made and delivered shockingly fast. The books are beautiful and professional.  I love that I also got a PDF."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Natalie Romano Cinelli",
          "Nb_Reviews": 2,
          "Date": "2022-06-30T18:34:47.000Z",
          "Titre": "Excellent Quality",
          "Contenu": "I have published two books with Solentro. I am so pleased with my latest book. The finished product looks amazing. The creative process was easy to navigate, adding pictures, texts, etc. After I placed the order, my book was expeditiously delivered in a short period of time. I will definitely be going back to Solentro for my next project."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kimberly Matthew",
          "Nb_Reviews": 1,
          "Date": "2022-01-12T21:27:20.000Z",
          "Titre": "Outstanding work",
          "Contenu": "Outstanding work! Quick! Answered any questions I had! Would recommend and use again! This was an amazing Christmas gift for my grandsons parents! A keepsake the will be treasured forever! My grandson was so surprised by the stories being in a book! He is already interested in doing another book maybe a story this time he says!Great confidence booster! So pleased!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer Foster",
          "Nb_Reviews": 3,
          "Date": "2023-03-31T02:16:47.000Z",
          "Titre": "Great personalized book experience…",
          "Contenu": "I enjoyed creating my book on the Solentro site and it was an easy process. There are many options to personalize the project; from book size to the layout of photos and text. The finished book arrived quickly and the quality is amazing! I liked that my work was automatically saved every time I worked on it. I greatly appreciated that even though it took me over nine months to complete my book (not my intent when I started) it was never deleted. Even when I didn't log in for months as I worked on it. Thank you. I will be returning with another project!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "NC Dino guy",
          "Nb_Reviews": 5,
          "Date": "2021-06-01T16:52:59.000Z",
          "Titre": "Software was intuitive",
          "Contenu": "Software was intuitive. A stripped down Word, containing the basics needed in a text tool. Short learning curve. Templates were customizable which shows someone was thinking in designing the product. I found the software in line with the 80/20 principle. A good core program (80%) and the ability to customize (20%). I could have never completed my book project without the useful tool Solentro provided. Nice choices in book format, especially considering my 88 year old mother chooses not to own a computer. Having a choice of hardcover book formats was essential for my situation. I would not hesitate to recommend Solentro to anyone who wants to self publish a book. The customer service was above my expectations too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "k.a.m.",
          "Nb_Reviews": 7,
          "Date": "2023-05-12T15:21:18.000Z",
          "Titre": "Exceptional Product, Great Service and Price",
          "Contenu": "I had never used Solentro before but based on the exceptional reviews, I created a book of photography with prose. The program was user friendly and the final result is wonderful! I only ordered one book just to make sure I would like the final product. I LOVE it. I just ordered five more books to use as gifts. I'm already planning on another book. Thank you, Solentro, for quality and great service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "H.C.",
          "Nb_Reviews": 3,
          "Date": "2022-10-17T14:30:13.000Z",
          "Titre": "Dad said it’s the best gift I’ve ever given!",
          "Contenu": "My Grandmother was very happy with her memoir book. This company is fast and efficient. They will allow upload of photos that gave smaller pixels whereas other companies require you to fix that which is harder to do with older photos. I would use them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alberta Britschgi",
          "Nb_Reviews": 1,
          "Date": "2022-11-02T15:38:10.000Z",
          "Titre": "Surprisingly enjoyable experience.                         Not only was the experience quite easy",
          "Contenu": "Not only was the experience quite easy, but was extremely enjoyable.  It took me months to finish my book because it was the first time I ever attempted anything like this. Each time I went in to add or subtract something, I learned more and more.  The final book is stunning and I intend to order more copies."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Desiree",
          "Nb_Reviews": 5,
          "Date": "2022-07-16T18:27:20.000Z",
          "Titre": "Book Building Made Easy",
          "Contenu": "This was my first time putting a book together and I can’t believe how easy it was. The steps were clear, there were numerous templates to choose from, an easy process to build your own templates, and the few times that I still had a specific question, I received a response the same day. I definitely suggest Solentro for your book producing and publishing needs!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Olszewski",
          "Nb_Reviews": 1,
          "Date": "2022-05-22T23:52:15.000Z",
          "Titre": "Mom’s Poem Books",
          "Contenu": "Exceeded my expectations in all areas. Web sight is easy to understand and navigate. Product description is good but actual product was amazing. Product preview is accurate in size, font and color. The most impressive part was the delivery time, four days, wow. I thought it was a little pricey, but when I had the books in my hand I was definitely ok with it. More font choices would be nice."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erika Bunnin",
          "Nb_Reviews": 2,
          "Date": "2021-12-21T18:12:48.000Z",
          "Titre": "Wonderful response ~",
          "Contenu": "There was an unexpected problem with the book I created and ordered, simply due to human error . . . I got a prompt response to my inquiry about it, that was gracious and kind, and my book was replaced at no cost. I am beyond thrilled with this special book that documents the life of my beloved niece, who just turned 18. She will treasure this gift for a lifetime . . ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kelly B",
          "Nb_Reviews": 1,
          "Date": "2022-01-06T18:26:25.000Z",
          "Titre": "Thank you Solentro!",
          "Contenu": "We created a yearbook for our team to celebrate the laughs and great memories over this past year. It was a wonderful surprise, and we will do this yearly moving forward. The quality and print was perfect! We were thrilled with the books upon receipt, and cannot wait to create our next project!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sarah K",
          "Nb_Reviews": 1,
          "Date": "2023-02-04T02:18:17.000Z",
          "Titre": "Great customer service",
          "Contenu": "The books arrived soon after I ordered them. Three of the four were perfect. One had some binding defects. I contacted Solentro, sent pictures of the damaged book, and they quickly sent a replacement. Great customer service, easy to communicate with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Myra Meyers",
          "Nb_Reviews": 1,
          "Date": "2022-04-25T14:57:38.905Z",
          "Titre": "I'm EXTREMELY happy with both books…",
          "Contenu": "I'm EXTREMELY happy with both books that I worked on and ordered from Solentro. I was looking for a way to create a book that allowed both longer passages of type AND options for pictures/photos with/without captions. The directions and any changes were easy to make. I was especially impressed with the vibrant, clarity of photos on cover and pages of books. Thank you, Solento.  I'm a very pleased customer!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CJT",
          "Nb_Reviews": 3,
          "Date": "2022-04-15T14:08:30.000Z",
          "Titre": "Where do I start?",
          "Contenu": "Where do I start?  I can't say enough positive things about my experience with Solentro!  My book - a 260-page book of memories - is beautiful!  I am so happy with the cover, and the quality of the pages is amazing.  Most of the photographs included are very old, some more than 70 years, but the end result works.  My two email contacts with Customer Service were answered promptly with responses that were helpful.  I am located in the United States, and my books still arrived in less than two weeks.  I am a 77-year-old woman.  If I can navigate the Solentro website with no problems, it should be a breeze for those that are younger with more computer expertise."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Madison Roths",
          "Nb_Reviews": 1,
          "Date": "2021-09-09T23:09:52.000Z",
          "Titre": "THEY WERE AMAZING",
          "Contenu": "THEY WERE AMAZING. The website functioned EXACTLY the way I wanted it to, it was intuitive and creative and I loved the ease of functionality. The prices are incredible for such a QUALITY product. I was SO excited to see how amazing it turned out, I honestly wasn't expecting it to be as nicely finished and beautiful as it was! 10/10 would work with Solentro again. Fast shipping, great service. Seriously I'm still astonished at how nice my little book turned out."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alxe",
          "Nb_Reviews": 3,
          "Date": "2022-11-18T22:30:10.000Z",
          "Titre": "Reasonably easy interface to figure…",
          "Contenu": "Reasonably easy interface to figure out, and the printed quality was good. Glossy cover option was nice, too. Product arrived in about 10 days though shipped from overseas--give yourself lots of lead time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lizzie GBA",
          "Nb_Reviews": 2,
          "Date": "2021-06-05T12:37:03.000Z",
          "Titre": "Excellent.",
          "Contenu": "Excellent..  Printing sharp.  My only suggestion is that it would be nice to be able to print my mini book more to the margins of the page.  The size is limited and somewhat small.  They responded immediately but unfortunately that cannot be done for this book.  They suggested a larger book but I want the actual book to be smaller.  There is quite a bit of free margin space around the text portion."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Judyth Austin White",
          "Nb_Reviews": 3,
          "Date": "2021-06-01T11:37:58.000Z",
          "Titre": "The People at Solentro and My Book",
          "Contenu": "The people at Solentro were always quick to respond to my questions.  Since this was my first time to make a book, there were many. They were always helpful in straightening out my mistakes and telling me how to proceed when I felt stuck. Their suggestions were stated clearly.Contacting them was as convenient as asking the person in the next room.Solentro made putting my stories together for my grandchildren exciting. I  am thoroughly pleased with my experience with them.My book is beautiful. The paper feels very nice. All the print is totally crisp.Judyth WhiteGreensboro, North CarolinaUSA"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike S",
          "Nb_Reviews": 1,
          "Date": "2022-03-28T19:15:10.000Z",
          "Titre": "Great experience / User Friendly / High Quality Results",
          "Contenu": "My overall experience was really great.  While I have made various photo albums with well recognized websites, this is the first time I used Solentro to develop a \"book\" with photos.  Solentro was user friendly and took only a short period of time to get familiar with the editing and creative tools.  The end product was absolutely fantastic!  I recommend their website for other users and I look forward to using it again myself."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jane Casler",
          "Nb_Reviews": 1,
          "Date": "2021-07-12T19:33:32.000Z",
          "Titre": "I was blown away when I received my…",
          "Contenu": "I was blown away when I received my book. It is absolutely beautiful. The type is crisp, the colors vibrant, and the glossy paper stock I chose is top quality. When I sent the project to Solentro, I was concerned about some of the photos I used. The resolution was iffy. To my amazement, all of the photos turned out great! Customer service was excellent, too. I emailed a couple of questions and received wonderful feedback in record time. This company deserves much more than five stars!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Heather Kerrigan",
          "Nb_Reviews": 2,
          "Date": "2021-12-29T14:55:03.000Z",
          "Titre": "The books turned out super cute",
          "Contenu": "The books turned out super cute! Got one hung up in the mail but it was the Holiday and out of there hands as it was sent via FedEx. I was skeptical of using this company simply because so many scams around but I am glad I did and I will use it again for any future book creations I need."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rhonda D.",
          "Nb_Reviews": 3,
          "Date": "2022-12-05T22:27:04.000Z",
          "Titre": "This was a really fun way to create a…",
          "Contenu": "This was a really fun way to create a meaningful gift for both my daughter and daughter in law that included advice from friends and family!  The final product was high quality and something we all eagerly display for others to browse.  Using the website to put together the book had all the tools needed, with pre-formatted page templates and lots of additional options.  I had a couple questions during the process, and customer service was quick to reply.  While my order was delayed by the delivery service for several days, the books eventually made it in time for the baby shower I wanted to present it at, and it was very well received.  I'd highly recommend Solentro to others!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Courtney Davis",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T20:40:56.000Z",
          "Titre": "A great service for a personalized book!",
          "Contenu": "I made a little book of \"Dad quotes\" with pictures for my Dad's 80th birthday and it turned out so great! The book looked exactly as it appeared in the \"Preview\" on the site. It took me a little bit to get used to how to work the site, but once I figured it out, it was pretty user friendly and perfect for what I needed to create. The book arrived pretty fast considering it was coming from overseas to the US. I would use them again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jamie Pedersen",
          "Nb_Reviews": 1,
          "Date": "2021-12-31T03:14:15.000Z",
          "Titre": "I used Solentro to create 2 short story…",
          "Contenu": "I used Solentro to create 2 short story books my children wrote as Christmas presents. The quality of the books was so much better than expected. It took a little bit to get the formatting down, but they came together beautifully.  I would highly recommend and will be using Solentro again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mrrockwell30",
          "Nb_Reviews": 5,
          "Date": "2023-08-26T01:52:55.000Z",
          "Titre": "They gave me exactly what I wanted",
          "Contenu": "They gave me exactly what I wanted. I will admit, they are more expensive than other companies that create books but I get what I paid for."
        },
        {
          "Note": 5,
          "Lieu": "DK",
          "Pseudo": "Bjørn Jacobsen",
          "Nb_Reviews": 33,
          "Date": "2021-12-14T11:58:17.000Z",
          "Titre": "My fifth order now",
          "Contenu": "My fifth order now, not a single issue.Some stuff went bad with the courier (but that is a courier issue), and Solentro delivered instantly and with proper customer service it all worked out.Always been super happy with the results of everything I ordered and its always been delivered on time. 10/10 will order again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan Klett",
          "Nb_Reviews": 1,
          "Date": "2021-12-17T22:47:35.000Z",
          "Titre": "Our Adoption Journey chronicled for our daughter.",
          "Contenu": "I found the site easy to navigate and I was able to download the text and pictures without difficulty.  We got the final product and we are very happy.  We chronicled the process my wife and I went though to adopt our daughter 18 years ago and now that she is 20 we can't wait to give her this gift for Christmas!  Thgank you for creating this site for anyone to make their own book!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Colter Snoozy",
          "Nb_Reviews": 1,
          "Date": "2022-01-27T20:55:32.000Z",
          "Titre": "Blown away!",
          "Contenu": "Blown away by the quality of the product. Looks and feels great. Photos and text are very clear and the product looks heavy duty. I wish there was a little bit more communication between purchase and delivery, like a tracking number or something, but I'm definitely happy with my purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "D R",
          "Nb_Reviews": 3,
          "Date": "2022-01-06T15:33:13.000Z",
          "Titre": "I very much enjoyed the ease of…",
          "Contenu": "I very much enjoyed the ease of creating my book on Solentro. The process was fairly smooth and user friendly. I will definitely use again. The only challenge I had is that the website continued to freeze which necessitated my having to exist and log in numerous times."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jill Collaro",
          "Nb_Reviews": 2,
          "Date": "2022-01-03T18:55:31.000Z",
          "Titre": "Amazing Platform",
          "Contenu": "Amazing Platform.  I am 60 years of age and very technically challenged.  I found the learning of how to make a book for my children of their fathers life a very pleasurable experience.I have shared this with my friends and hope to possibly do another.Thank you so much for making it super enjoyable for a old gal like me!Jill"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JULIE MCNEILL",
          "Nb_Reviews": 2,
          "Date": "2022-10-31T15:05:04.000Z",
          "Titre": "Book quality was excellent & on time",
          "Contenu": "Quality was excellent. You responded to my questions before placing my order altho it took 24-48 hrs. Delivery arrived on the day I requested as it was a birthday gift. Thank you! Gift was very much appreciated. I would use Solentro again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jodi Lea Stewart",
          "Nb_Reviews": 6,
          "Date": "2022-04-25T20:29:54.560Z",
          "Titre": "This website is awesome!",
          "Contenu": "This website is awesome! I used it to create a photo/diary book of the first three years of a granddaughter's life. It took me more than four months to finish this project *70 pages total*, and Solentro kept all my photos and my narrative perfectly safe and just like I left them each time. Because it lets you design templates as you desire, YOU are in complete charge of each page's design. It never failed me. I don't know how long they store these creations, but I hope it is for a long time so that I can order more of the books and also make changes as I desire. All in all, this was a five-out-of-five-star experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Natalie Smith",
          "Nb_Reviews": 2,
          "Date": "2022-12-29T02:25:04.000Z",
          "Titre": "I am totally blown away at Solentro",
          "Contenu": "I am totally blown away at Solentro.  The workmanship they put in the book I made was amazing, but what amazed me more was the care they took when they sent the book back to me.  The turn around time was incredibly fast.  The book had to travel across 4 countries (Sweden, Denmark, Germany and the US) plus cross the Atlantic Ocean.  When the book arrived at my residence, it was in perfect condition.  I would highly recommend Solentro to everyone.  I will be using them again in the future.  I also did not find their prices to be that high, considering the beautiful work they do.   Thank you Solentro."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Irene",
          "Nb_Reviews": 3,
          "Date": "2021-09-28T13:43:15.000Z",
          "Titre": "I made a book for my great…",
          "Contenu": "I made a book for my great granddaughter whose 5 years old, so she will have something to remember her Great Mammaw & Pappaw by, when she's older and we're no longer living. It turned out absolutely beautiful! The pictures so sharp and everything just as I had ordered. I plan on doing this for each of my great grandchildren when they reach the age of 5 because I keep them during the day while their parents work and want them to have memories of our times together. Also, this shipped out quickly and was delivered with a week. What a blessing! I couldn't recommend Solentro more highly! Great Company!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim Sadowski",
          "Nb_Reviews": 1,
          "Date": "2023-01-22T17:52:42.000Z",
          "Titre": "50th Anniversary",
          "Contenu": "I designed a \"memory book\" to give to my wife on our 50th Anniversary.  I couldn't be more pleased with how it turned out.  I was concerned that while I am in the USA and Solentro is in Sweden that it would be a problem.  It was not.  They were very responsive in answering my emails when I had questions.  And shipping, once the book was completed, arrived in less than two weeks via FedEx.I struggled a bit using the design templates but that was due to lack of familiarity.  After a couple weeks, I had no problems and truly found the design experience to be fun.  Print and paper quality was excellent. The final product arrived and it looked spectacular.  Exactly the way I viewed the book online in \"preview\" mode.  Pricing was very fair and reasonable.  Overall, I couldn't be happier with the final product and do not hesitate to recommend Solentro to anybody."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Judy Kersten",
          "Nb_Reviews": 4,
          "Date": "2021-06-12T04:41:34.000Z",
          "Titre": "Awesome experience",
          "Contenu": "Awesome experience! My book turned out terrific. The website was easy to use and the preview feature displayed the end product very accurately.  I was very satisfied with the quality of the paper and the look of my book. The shipping and production time were very reasonable. I will definitely use Solentro again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Topete",
          "Nb_Reviews": 1,
          "Date": "2022-01-02T03:34:34.000Z",
          "Titre": "Don’t judge a book by its cover",
          "Contenu": "The ability to put together a custom book is amazing. The website was easy to use for the most part. I’m not sure what happened but the cover of my book was upside down and on the back page but other than that, a great experience. Maybe I missed a note about the cover but that might be an area to improve on if others have made the same mistake."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laura Shelley",
          "Nb_Reviews": 1,
          "Date": "2022-05-22T22:26:38.000Z",
          "Titre": "This book turned out amazing!!",
          "Contenu": "This book turned out amazing! We created a “new baby” book for a coworker that was filled with quotes, what to do/not to do, best/worst memories, advice etc. from the team. The website is not the most user friendly site there is, but for the quality of the book… it was great!!! I also reached out to their customer service for help getting it expedited. Solentro’s customer service was extremely responsive and did all they could to expedite the book, without asking for additional $$. I would highly recommend Solentro - just give yourself time to work through their site. But the outcome is MORE than worth the time navigating their site. I would definitely purchase from them again!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DeeAnna",
          "Nb_Reviews": 1,
          "Date": "2021-12-01T22:39:01.000Z",
          "Titre": "Easy to use and great quality!",
          "Contenu": "I tried several other publishing companies and Solentro was by far the easiest to use. When my order arrived I was very impressed. The quality of the book was fantastic! I will be using them again and I have already told a friend who just made her first order."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kate",
          "Nb_Reviews": 1,
          "Date": "2022-01-01T15:52:28.000Z",
          "Titre": "Awesome Awesome Awesome",
          "Contenu": "The book that I received was INCREDIBLE!! I will recommend this company to anyone and everyone. We created a book of letter that’s we wrote to my grandma and it included pictures that turned out so beautiful inside the book! Use this company, they really do a great job bringing books to life!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2021-06-06T19:41:16.000Z",
          "Titre": "Amazing!",
          "Contenu": "The overall process of making the book was really easy and allowed for the double checking and editing to be done easily. I gave the book as a gift to a friend and they really were impressed and enjoyed it a whole lot!! I would recommend to anyone wanting to easily print a book that they've always wanted to print."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jen",
          "Nb_Reviews": 1,
          "Date": "2022-12-27T03:09:24.000Z",
          "Titre": "The book came out amazing!",
          "Contenu": "The book came out amazing including the quality of all the pictures. The website was also easy to use and did not take long to figure out how it works. The shipping also took two weeks which was exactly what was expected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gabrielle Fraunfelder",
          "Nb_Reviews": 1,
          "Date": "2022-06-04T02:59:41.000Z",
          "Titre": "Happy Customer",
          "Contenu": "I could not be more happy with Solentro! I made a book for my son for his HS graduation. I had been compiling birthday letters over the years that I had written to him and wanted to find a service that allowed me to turn all my letters into a book, along with pictures. I had never heard of this company, nor known anyone to use them, so I was taking a big gamble with spending hours upon hours making the book. I was so happy with the completed project. My son loves it and is still making his way through it. I will definitely use them again for both of my daughter's graduation books!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Doug",
          "Nb_Reviews": 4,
          "Date": "2022-08-22T00:10:11.000Z",
          "Titre": "Great service when you need a custom book made and when quality counts.",
          "Contenu": "The book I had made was a very important remembrance of a dear family member who passed.  The book is totally professional and will last for years. The one thing that wasn't clear to me when I started this process is that the book was going to be made in sweden. Well that isn't a problem the shipping details after the book was completed were a little challenging to follow. I worried that I was not going to get this book in time however in the end it arrived on day 15 after my order was placed. So honestly the 7 to 14 day time period hat is stated is about as accurate as you can get. In the end I was extremely satisfied."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tamiko L Harris",
          "Nb_Reviews": 1,
          "Date": "2022-06-08T03:10:10.000Z",
          "Titre": "I am super pleased with the final…",
          "Contenu": "I am super pleased with the final product. My book was a personalized collection for my daughter's high school graduation. She and I both love our copies and they will be priceless memories for us and generations to come."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nancy Milosevich",
          "Nb_Reviews": 1,
          "Date": "2022-11-05T04:13:48.000Z",
          "Titre": "Wonderful experience",
          "Contenu": "Putting together my book using Solentro.com Is one of the best experiences I’ve ever had. My finished book is beautiful, the quality of the paper and print and color is exceptional. I plan to do another book soon."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael L. Dellger",
          "Nb_Reviews": 1,
          "Date": "2022-12-22T15:36:26.000Z",
          "Titre": "My experience with Solentro was most…positive!",
          "Contenu": "My experience with Solentro was most positive. Their customer service (thank you, Emy) was excellent! I had several questions regarding the creation of my book, and she patiently and courteously answered them all. The respect she demonstrated gives me the incentive to use Solentro for my next project."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Becky Klein",
          "Nb_Reviews": 4,
          "Date": "2021-09-27T23:20:04.000Z",
          "Titre": "Super Satisfied",
          "Contenu": "I have written two books, one for each of my grandsons. So, my opinion is not built on sales. I will visit Solentro one more time to write a story for my granddaughter. I have enjoyed both projects and have been very pleased with the books that were printed. I hope my grandchildren will enjoy them even more as they grow older! Solentro certainly has surpassed my expectations."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Katie",
          "Nb_Reviews": 2,
          "Date": "2021-06-07T18:36:54.000Z",
          "Titre": "Cute gift for new parents",
          "Contenu": "Easy to use. Responsive customer service. Quick turnaround considering my location in the United States. This will be such a special gift for our best friends who are new parents!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gena Turner",
          "Nb_Reviews": 1,
          "Date": "2021-11-02T20:48:56.000Z",
          "Titre": "Creative Freedom",
          "Contenu": "I've made two books with Solentro.com. I love the many customization options and creative freedom I have to decorate my book! I'd like to possibly make an 11x 14 book someday on your site! Great website!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "john white",
          "Nb_Reviews": 1,
          "Date": "2021-07-27T17:29:56.000Z",
          "Titre": "Honestly",
          "Contenu": "Honestly, I did not now the book was coming from Sweden until I paid. I was worried I wouldn't get it in time for the wedding I was officiating. Reading the reviews about poor customer service and shipping has be worried as well. First hand experience, the customer service team was very responsive. I sent about 9 emails in a row asking if my book is ready and they kept me informed all the way. Ask for Ebba, hands down best service ever, wish I could talk to her but everything is via email. Get that lady a promotion, for real. Fed Ex now has my package and it should arrive on time pending any Fed Ex delays. I hope it comes in time. Great stuff Solentro, appreciate the quick responses. Again, PROMOTE EBBA!!!! Rich Catalano"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Gavin Ayling",
          "Nb_Reviews": 7,
          "Date": "2022-04-20T14:35:44.262Z",
          "Titre": "Though the site looks a little…",
          "Contenu": "Though the site looks a little old-fashioned, once one learns how to use it, it's a very efficient system and, ultimately, produces professional-looking, and high-quality books. Because the site hasn't changed in over five years, it also allowed me to make a book that looked very similar to one I had made five years ago which, for a fifth and tenth anniversary present, made things very helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dejay Sackman",
          "Nb_Reviews": 1,
          "Date": "2022-01-25T01:54:06.000Z",
          "Titre": "Cannot be more happy!  HIGH QUALITY product",
          "Contenu": "I had a 12 page color staple-bound booklet made.  it's even better than I expected, in all ways!  I did take a chance by producing mine a little unconventional.  I already had a 12 page PDF format design, with a nice layout of text and pictures.  So I simply took a screen-shot on my MAC computer of each page, then uploaded each imaged (JPG) page into the template.  Thus, I simply uploaded 12 images, which consisted of my pre-populated text and images!  Bingo!  it worked perfect:  crystal clear images and clear, readable font.  Solentro should inform the user that this is an option, or Solentro should have a simple PDF upload ability that can be converted to the draft for submittal.  But my attempted as described worked soo perfect.  The paper quality is also very nice.  I went with the glossy cover which is great.  the inside pages are also of high quality, heavier stock, mat finish.  Lastly, I submitted my order on 1/8/22 and got my product on 1/24/22, here in Seattle!  I cannot be happier!  And prices are nice."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KS",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T15:26:07.000Z",
          "Titre": "Brilliant Product & Service for College gift",
          "Contenu": "Made book of quotes and photos for college bound kid. Terrifically easy, outstanding speed and finished product was brilliant"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "anna Basilashvili",
          "Nb_Reviews": 4,
          "Date": "2023-10-11T18:15:18.000Z",
          "Titre": "User friendly interface- quick and easy…",
          "Contenu": "User friendly interface- quick and easy order and shipping process. Great quality of product"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Taylor",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T02:59:56.000Z",
          "Titre": "If I could give them more than 5 stars I would",
          "Contenu": "I created a poetry book for my uncle for Christmas this year, probably one of the most heartfelt gifts I have ever made for anyone. I ordered my books about a little over a week ago and received them today (I live in the US). They were ABSOLUTELY PERFECT, they were more beautiful than I had even imagined and I could not be happier. I was so worried I had ordered them too late and because of holiday shipping delays they wouldn’t get here by Christmas, but they got here so fast I was amazed. This book is so special to me I almost hugged the FedEx guy who delivered them. Thank you Solentro and FedEx for all your hard work, you are going to make this a very special Christmas for my family. I will 10000% be using this company again and I absolutely recommend it everyone. It is absolutely worth the money. THANK YOU!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William M",
          "Nb_Reviews": 1,
          "Date": "2022-08-26T09:16:41.000Z",
          "Titre": "Family Book",
          "Contenu": "I decided to publish a book that was very personal to my family and I.  It dealt with the passing of my mother just over a year ago.  Solentro made the process easy and the book turned out fantastic!  I ordered 2 extra books to give to my family for Christmas.  I’m grateful that a company like this exists."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Horn",
          "Nb_Reviews": 2,
          "Date": "2023-02-10T22:01:44.000Z",
          "Titre": "Price was reasonable",
          "Contenu": "Price was reasonable. Product was good. Emails informed me that they got the information I submitted, and when the product was shipped. Some of my pictures were old, scanned numerous times, but I was very happy with the results in my book."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Betty Stallings Huber",
          "Nb_Reviews": 1,
          "Date": "2021-12-09T13:17:22.000Z",
          "Titre": "I am delighted with the finished book!",
          "Contenu": "I am delighted with the finished book. My husband passed away on August 9, 2021 and I wanted to share his writings and photos with family and friends. I wanted it to be a quality publication and that is what I got with Solentro. I am so happy. Everyone who has received one so far is so impressed. Thank you for preserving our memories."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tyler Gerace",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T01:32:53.000Z",
          "Titre": "I love the quality of the book and how…",
          "Contenu": "I love the quality of the book and how much it truly means to me AND to my daughter. The book was to speak to my little one in a way that could built respect and appreciation to herself with how her peers treat her. She reads it (The Violet Heart) every day"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Devin Errett",
          "Nb_Reviews": 3,
          "Date": "2022-08-16T02:19:38.000Z",
          "Titre": "Beautiful, professional looking book",
          "Contenu": "We ordered a 120 page book.  Very impressed!  Professional looking, just like a real book.  Pictures and colors turned out beautifully. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Reina",
          "Nb_Reviews": 2,
          "Date": "2021-09-17T15:23:30.000Z",
          "Titre": "I thoroughly enjoyed creating my book \"Close Your Eyes... Breathe... Listen\"",
          "Contenu": "I thoroughly enjoyed creating my book on Solentro. The site is easy to navigate and provides a lot of templates from which to choose. Solentro is user friendly and is a wonderful website to use to create and personalize a book."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chelsea",
          "Nb_Reviews": 1,
          "Date": "2021-11-23T22:10:21.000Z",
          "Titre": "Professional quality book",
          "Contenu": "Loved this service. I used it to create a custom hard cover book, with photos and text, and it turned out beautifully. It looks professional and I plan to purchase another custom project from Solentro in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessica Halliar",
          "Nb_Reviews": 2,
          "Date": "2021-06-03T16:30:53.000Z",
          "Titre": "This book was a Mother's Day gift to my…",
          "Contenu": "This book was a Mother's Day gift to my mom. They were all the letters written by her parents to each other during World War II. She absolutely adored the book. Thank you for making that possible for her."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer Henriksen",
          "Nb_Reviews": 1,
          "Date": "2021-11-03T20:07:02.000Z",
          "Titre": "Awesome",
          "Contenu": "This was an easy, great experience. I created a book of poetry for my almost 90 year old dad. Shipping was crazy fast, especially considering it came from Europe to the US. The book looks great. Kinda pricey, but worth every penny!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda K  Zebrowski",
          "Nb_Reviews": 1,
          "Date": "2021-12-28T00:48:52.000Z",
          "Titre": "I have ordered several personalized…",
          "Contenu": "I have ordered several personalized book from Solentro over the last several years and each and every one is simply beautiful and awesome quality.  I highly recommend Solentro to anyone who would love to make a personalized book whether it’s a recipe book or a special heirloom book of your family or grand babies. ♥️ Solentro are a very reputable company and will be there constantly throughout your book journey with any help you may need. 📕💕"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay Laramie",
          "Nb_Reviews": 1,
          "Date": "2021-05-24T17:48:14.000Z",
          "Titre": "Excellent",
          "Contenu": "Excellent, easy to use.  Send links to people for their submission, a simple click and easy to follow instructions where you can add a note and upload photos.  Great product/service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fred Geurkink",
          "Nb_Reviews": 4,
          "Date": "2021-06-04T22:31:05.000Z",
          "Titre": "Our Best II",
          "Contenu": "Been very happy with getting my books through Solentro.  This is the 6th book I’ve done through them.  Always order a back up on my singles, yet found one of them to be a little darker on the photos then the other.  I edit my pictures for brightness, contrast, exposure, saturation, blackpoint, etc.  Some did not seem to come back to me the way I put them in.  Not sure if I need to change from glossy to matte, or what is best for picture books.  Still very satisfied with overall product.  I will be changing from jpeg to raw, and will be able to do a much better editing job for the next book.  Fred"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tori R",
          "Nb_Reviews": 1,
          "Date": "2022-10-09T23:43:16.000Z",
          "Titre": "I really love the book I created",
          "Contenu": "I really love the book I created. It looks very professional. A bit pricey and the website is a bit of a learning curve but I will recommend Solentro to others who want to create a custom book."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Evelyn Rivera",
          "Nb_Reviews": 1,
          "Date": "2021-06-02T10:16:51.000Z",
          "Titre": "I was very pleased with the book",
          "Contenu": "I was very pleased with the book. Absolutely beautiful look all around. I will be making another one as soon as I put it all together. Awesome work! Highly recommend it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Beth",
          "Nb_Reviews": 2,
          "Date": "2022-06-16T00:43:24.000Z",
          "Titre": "I am not a tech savvy person so I…",
          "Contenu": "I am not a tech savvy person so I appreciated the fairly straightforward and easy software program allowing me to create a book of poems with some pictures.  I would definitely use the company again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jackie Hazzard",
          "Nb_Reviews": 1,
          "Date": "2022-11-12T03:09:16.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience, was able to track my order thru the whole process. Shipping was within a reasonable time frame. Book turned out beautifully."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Naomi Blankenship",
          "Nb_Reviews": 3,
          "Date": "2021-12-08T16:21:17.000Z",
          "Titre": "I wrote of book of poems and pictures…",
          "Contenu": "I wrote of book of poems and pictures for my 4 month granddaughter. I have stage four cancer and I wanted something personal for her to remember me by. Although it took a bit for the book to arrive it was well worth the wait! I ordered the hard back, white book and it was everything I wanted it to be. There were two mistakes in the book, my doing, not Solentro's, two poems were  published back to back. And a mistprint in one of the poems. But with that being said. The book is awesome. I did have an inquiry and Solentro was very quick to respond.All in all I would recommend Solentro to anyone who wants a professionaly looking end product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jan Tolman",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T04:09:15.000Z",
          "Titre": "Solentro delivers",
          "Contenu": "Solentro allowed me to create the book that I wanted with all the flexibleness that I needed. The website was very user friendly and the book came quickly. I was very pleased with my experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laura Arnold",
          "Nb_Reviews": 3,
          "Date": "2023-03-29T21:35:37.000Z",
          "Titre": "The quality of the books from Solentro…",
          "Contenu": "The quality of the books from Solentro are top notch! I have made 4 books and each one turned out excellent, especially picture quality."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Claudia Topping",
          "Nb_Reviews": 1,
          "Date": "2022-06-14T22:21:54.000Z",
          "Titre": "I created a small book of Bible verses…",
          "Contenu": "I created a small book of Bible verses to share with my friends and family, and was very pleased with the results! The website was easy to use and the order was easy to place and I received the books in a very timely manner. I highly recommend this company!"
        }
      ]
    }
  ]
}