{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.inkydeals.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Green Pixel",
          "Nb_Reviews": 4,
          "Date": "2023-06-01T12:50:49.000Z",
          "Titre": "Not responsive in communicating",
          "Contenu": "I have never had any issues so far. I purchased \"Focus 4 Software,\" which was not what I had expected and had requested a return with a full refund. Wrote an email, no response."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "jose Luis Cuendia Palacios",
          "Nb_Reviews": 1,
          "Date": "2022-12-04T15:21:04.000Z",
          "Titre": "On 25-11-2022 I was charged 19,39 Euros…",
          "Contenu": "On 25-11-2022 I was charged 19,39 Euros in my account for the amount of the Bundle Order VFX Bundle #987373. The instructions for downloading the package indicate that introduction of my email and the serial code that will be received after the purchase is completed. The purchase has been made and collected, and the serial code has not been sent to me. I've claimed it from InkyDeals four times and never answered my mails. It's not the first purchase I make at InkyDeals and it's always worked well, this time it's been a mess. I preside an association of over 1300 photographers and if this is not resolved I am free to make the misbehavior public in this association.AtentmentJosé Luis Cuendia “Guendy”"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "E. Olsen",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T03:40:04.000Z",
          "Titre": "Poor Customer Service",
          "Contenu": "The product is fine, it was the customer service that was not good. I wrote 2 times saying it was not customer friendly in using the 50% code and I was not able to put the code in to get a discount. No one ever got back with me which was very disappointing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "A happy customer",
          "Nb_Reviews": 5,
          "Date": "2023-05-04T05:11:24.000Z",
          "Titre": "I never received my ink."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kento",
          "Nb_Reviews": 5,
          "Date": "2023-07-21T19:00:50.000Z",
          "Titre": "Good Deal; Bad Communication!",
          "Contenu": "The deal was good, plus I got numerous freebies, but …I’ve contacted support about this several times: I never got an email saying that my deal went through, even though it’s now been over a month! In fact, this review-related email is the first indication that it was finalized! When I go to my “Orders,” it STILL shows “Processing!”There’s never been a response to any of my “Contact” messages from a month ago! The only indication of anything happening at all: a few weeks ago, I discovered that my “Downloads” include what I ordered. So, nice to have them there, but it would have been nice to have been given a heads up several weeks earlier!So, the experience was frustrating, but it looks as though I still ended up with the downloads for which I’d payed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "George",
          "Nb_Reviews": 9,
          "Date": "2022-12-02T02:06:32.000Z",
          "Titre": "Good selection and a fast transaction.",
          "Contenu": "Good selection and a fast transaction.Unfortunately I had to ask for a refund and the communication link fell through.  I still do not know if and how a refund was issued.#987029"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Todd Hilton",
          "Nb_Reviews": 3,
          "Date": "2023-09-04T04:51:39.000Z",
          "Titre": "Get Inspired!!",
          "Contenu": "I’ve been using InkyDeals for over a year, and I just love searching their products for my next creation. If it’s inspiration you’re looking for, InkyDeals is your one-stop shop!"
        },
        {
          "Note": 4,
          "Lieu": "TW",
          "Pseudo": "Julian",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T17:09:40.000Z",
          "Titre": "This bundle is cheap and practical",
          "Contenu": "This bundle is cheap and practical, and brings a lot of convenience in design.I like it ."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "manuelit",
          "Nb_Reviews": 3,
          "Date": "2023-08-20T20:01:57.000Z",
          "Titre": "I have been using InkyDeals for a few…",
          "Contenu": "I have been using InkyDeals for a few years. I always find interesting little things at a modest price"
        },
        {
          "Note": 4,
          "Lieu": "BD",
          "Pseudo": "XTreme Ahmed",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T19:06:23.000Z",
          "Titre": "Excellent Experience with Inkydeals!",
          "Contenu": "Excellent Experience with Inkydeals!Dear Inkydeals Team,I hope this message finds you well. I wanted to take a moment to express my utmost satisfaction and gratitude for the exceptional experience I had with Inkydeals.From start to finish, every aspect of my interaction with your company was nothing short of outstanding. The website's user-friendly interface made it effortless to navigate through the vast selection of deals and products. The quality of the products I purchased exceeded my expectations, and the prices were incredibly competitive.What truly set Inkydeals apart, however, was the level of customer service I received. Your team was prompt, professional, and went above and beyond to address any inquiries or concerns I had. Their friendly and knowledgeable approach made me feel valued as a customer, and I greatly appreciate their efforts in ensuring my complete satisfaction.Furthermore, the delivery process was seamless"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "diamond shop",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T19:37:35.000Z",
          "Titre": "Fast response and action to refund my…",
          "Contenu": "Fast response and action to refund my money on a disappointing package."
        },
        {
          "Note": 4,
          "Lieu": "MO",
          "Pseudo": "filipe",
          "Nb_Reviews": 2,
          "Date": "2023-05-19T01:39:47.000Z",
          "Titre": "good resources"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anne Hall",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T20:32:14.000Z",
          "Titre": "So much to choose from",
          "Contenu": "Love the options and the collections.  Glad for the test run because I found a package of filters that had 160 options in it.  I literally only used 4.  Only for my own artistic use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ann Albers",
          "Nb_Reviews": 7,
          "Date": "2023-11-28T03:22:04.000Z",
          "Titre": "Awesome resources!",
          "Contenu": "I have purchased from inkdeals several ties and they do not disappoint! The bundles, photoshop actions, brushes, etc., all availble for non-compete commercial use are high quality and an incredible deal! I'll be back!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Anna Maria ZAMBITO",
          "Nb_Reviews": 5,
          "Date": "2023-11-26T06:12:46.000Z",
          "Titre": "InkyDeals always has a good selection…",
          "Contenu": "InkyDeals always has a good selection of deals available on their site.  And I find that they also have a good selection of freebies available for download.  I would definitely recommend the site to anyone who deals in photography."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gladys Herron",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T15:09:20.000Z",
          "Titre": "I made my first purchase yesterday  of…",
          "Contenu": "I made my first purchase yesterday of over 3000 overlays.  I especially like the way the many files are sorted and easy to find different categories.  I tried a few last night and they were easy to use and will make my hobby more enjoyable."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Tetiana Radkevych",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T04:01:47.000Z",
          "Titre": "InkyDeals always gives great products",
          "Contenu": "InkyDeals always gives great products. I've always had a good time dealing with them. And I plan to keep choosing them in the future."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Paul RG",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T00:47:11.000Z",
          "Titre": "Inky always has good deals and I love…",
          "Contenu": "Inky always has good deals and I love the freebies. Always good quality stock."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ms. S. O'dell",
          "Nb_Reviews": 2,
          "Date": "2023-08-04T16:51:38.000Z",
          "Titre": "Awesome company and customer service",
          "Contenu": "Awesome company and customer service. I have often not realized that packages and bundles were made for apple products, or other adobe software that I don't have and InkyDeals has no problem honoring their 30-day no questions asked return policy so I can grab something that I can use. I will definitely continue to use this company. (I do wish they would make it more obvious which software  is compatible - I see a section on some pages, but not others, but putting it right up front would help people like me skip right over the incompatible products."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Paras Khicher",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T04:31:26.000Z",
          "Titre": "Good description of the products",
          "Contenu": "Good description of the productsGood description of the products, reasonable prices and a nice selection of items that will fit most needs.A few more vector items would be useful and a warning if \"oil paint filter\" or OpenGL graphics are required."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "edwin d sigurdson",
          "Nb_Reviews": 2,
          "Date": "2023-07-31T19:27:25.000Z",
          "Titre": "INKY Reflections",
          "Contenu": "INKY is delightfully helpful in providing new and updated creative resources at very reasonable prices.I have purchased many items over the years for home and hobby -- not being a skilled artist, but wanting to provide artful illustrations for ideas I like to share."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George",
          "Nb_Reviews": 9,
          "Date": "2023-05-03T02:54:46.000Z",
          "Titre": "Good description of the products",
          "Contenu": "Good description of the products, reasonable prices and a nice selection of items that will fit most needs.A few more vector items would be useful and a warning if \"oil paint filter\" or OpenGL graphics are required."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "CJ",
          "Nb_Reviews": 2,
          "Date": "2023-05-01T00:18:47.000Z",
          "Titre": "Luv InkyDeals products!",
          "Contenu": "I’ve been buying products from InkyDeals for quite a few years now – and find that their website is well-designed and easy to navigate, making it simple to find and purchase the products I need and want! Also, InkyDeals products are high-quality and sold at a competitive price – again making easy to choose the best!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Helen A",
          "Nb_Reviews": 2,
          "Date": "2023-08-04T01:01:56.000Z",
          "Titre": "A great selection of fonts",
          "Contenu": "A great selection of fonts. Easy to navigate and the purchasing process is seamless. Would love to see more templates for flyers and Facebook events for Social Group activities etc."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Dee",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T01:25:17.000Z",
          "Titre": "Great deals they offer.",
          "Contenu": "What truly sets Inky Deals apart is their affordability. As a freelance designer, I'm always conscious of my budget, and Inky Deals' pricing is incredibly reasonable considering the value they offer. The bundles and deals they put together are a great price, often providing me with a collection of resources that would cost me significantly more if purchased individually."
        },
        {
          "Note": 5,
          "Lieu": "BD",
          "Pseudo": "Md Al Mamun",
          "Nb_Reviews": 2,
          "Date": "2023-04-05T20:05:30.000Z",
          "Titre": "I highly recommend InkyDeals to any…",
          "Contenu": "I highly recommend InkyDeals to any graphic designer looking to expand their design toolkit. With a wide range of high-quality items at great prices, it's an excellent resource for any designer looking to take their work to the next level."
        },
        {
          "Note": 5,
          "Lieu": "BD",
          "Pseudo": "jubair haider",
          "Nb_Reviews": 4,
          "Date": "2023-03-27T11:39:29.000Z",
          "Titre": "I recently used this design site for a…",
          "Contenu": "I recently used this design site for a project and was thoroughly impressed with the quality of their work. The team was easy to work with, responsive to my requests, and delivered an outstanding final product. The design exceeded my expectations and I received numerous compliments on it. I appreciated their attention to detail and their willingness to make revisions until I was completely satisfied with the result. The process was smooth and hassle-free, and I would highly recommend this design site to anyone looking for top-notch design services. Thank you for a job well done!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 2,
          "Date": "2023-04-19T15:06:02.000Z",
          "Titre": "InkyDeals is a great webiste for all of…",
          "Contenu": "InkyDeals is a great webiste for all of your photo editing needs. They have such an amazing selection of products - Their customer service is great as well if you have any questions."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Kevin Connell",
          "Nb_Reviews": 6,
          "Date": "2023-08-07T20:21:19.000Z",
          "Titre": "Have purchased from this company for a…",
          "Contenu": "Have purchased from this company for a number of years and have always found them to be of good value and service, any queries have been quickly dealt with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brenda",
          "Nb_Reviews": 9,
          "Date": "2023-08-10T03:35:48.000Z",
          "Titre": "Always a positive buying experience",
          "Contenu": "Every purchase from InkyDeals since my first one in 2019 has been a positive experience. They source an incredible variety of graphics and other digital assets for creatives, and always at reasonable prices. Plus, they offer a generous selection of \"freebies\" for download as well."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Jennifer",
          "Nb_Reviews": 4,
          "Date": "2023-01-01T04:35:58.000Z",
          "Titre": "InkyDeals never fails to amaze me.",
          "Contenu": "InkyDeals has been my go-to place for years now and I am never disappointed with the quality of their programmes. I love it. This is not hype, it is merely an explanation as to why I buy from InkyDeals and will continue to do so. Love the latest Transparant Images Club - bought it a week ago, and I'm still playing with it. Awesome fun. -  Jenn"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer McVey, Cht",
          "Nb_Reviews": 1,
          "Date": "2022-12-10T20:09:16.000Z",
          "Titre": "I love InkyDeals!",
          "Contenu": "I love inky deals. It’s my go to place anytime I’m feeling creative or want to start a new project. And, every time I’m perusing, I  always something that I need! lol  They have a great selection of large packages and bundles and for super good prices. I’ve only had to use customer service a couple times and they were great. Try them- if you’re nervous, download a couple freebies to see how the work. I highly recommend them."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Janice O'Connor",
          "Nb_Reviews": 9,
          "Date": "2022-11-02T17:40:56.000Z",
          "Titre": "An excellent resource for digital artists",
          "Contenu": "Inky deals provide excellent quality resource deals at very reasonable prices for digital artists, designers and digital marketers. Images files are high res, pngs are well cut out, Photshop actions always work and the overall product selection is very good. The simple to understand TOU are very welcome for personal, hobyist and commercial."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "M. Blakely",
          "Nb_Reviews": 4,
          "Date": "2023-08-07T17:29:26.000Z",
          "Titre": "It is always easy to order",
          "Contenu": "It is always easy to order. Easy to navigate their site. There are always lots of freebies to find when you order. And the products are always available and easy to download. Simple, easy peasy. And everything works the way it is advertised. I love it."
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "alif graphic",
          "Nb_Reviews": 2,
          "Date": "2023-07-18T19:41:52.000Z",
          "Titre": "Thanks for your collaboration with us.",
          "Contenu": "Thanks for your collaboration with us.hopefully for the future, pixelo will be more advanced, and customers will be satisfied with the selected designs offered"
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "Owlking project",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T14:38:02.000Z",
          "Titre": "This bundle is very helpful on projects…",
          "Contenu": "This bundle is very helpful on projects our team is working on, lots of style and options to explore, and very easy to help our clients needs...thanks Pixelo"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "William Kam",
          "Nb_Reviews": 2,
          "Date": "2023-03-20T13:47:41.000Z",
          "Titre": "30 Days refund guarantee",
          "Contenu": "Bought a program but later found out it's a bit outdated and difficult to use. Granted a full refund within 4 days upon request."
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Mona Ceron",
          "Nb_Reviews": 7,
          "Date": "2023-06-01T15:55:07.000Z",
          "Titre": "Quick and good service",
          "Contenu": "Inky Deals helped me out very quickly with an earlier order that didn't work anymore. Got a new link and everything worked again. They also did a folow up to ensure the problem was solved."
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Marie",
          "Nb_Reviews": 3,
          "Date": "2023-08-06T01:47:33.000Z",
          "Titre": "Graphic designs for creatives",
          "Contenu": "Easy to find what you need for your next projects. So many graphic designs and font to choose from. Always get the newest offers in my inbox.Great and fast support when you need it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kurt Schmucker",
          "Nb_Reviews": 6,
          "Date": "2023-05-17T19:41:43.000Z",
          "Titre": "Excellent products",
          "Contenu": "Excellent products, fast download, fair prices. I have purchased many times from InkyDeals and will continue to do so."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Monique Robichaud",
          "Nb_Reviews": 3,
          "Date": "2023-11-08T02:44:38.000Z",
          "Titre": "Easy and fast …",
          "Contenu": "Easy and fast … received what I purchased without any hang ups!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Bhushan Bhalerao",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T16:41:39.000Z",
          "Titre": "Very good experience at inkydeals this…",
          "Contenu": "Very good experience at inkydeals this is my 4th order. Waiting for more digital graphics."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "P Nolan",
          "Nb_Reviews": 2,
          "Date": "2023-07-30T09:12:57.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use, gave me exactly what I searched for and I was able to use it right away. Can't wait to explore some more ideas I have, thank you and Keep it coming."
        },
        {
          "Note": 5,
          "Lieu": "CL",
          "Pseudo": "Valerie Pinsent",
          "Nb_Reviews": 2,
          "Date": "2023-05-18T21:44:05.000Z",
          "Titre": "great package with lots of variety",
          "Contenu": "awesome package of textures, covers many instances needed,really worth while. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mick Martin",
          "Nb_Reviews": 9,
          "Date": "2023-02-04T20:51:19.000Z",
          "Titre": "Fantastic products that were provided free of charge.",
          "Contenu": "Considering that the 2 items I downloaded were FREE products, there was no questioning or pressure to purchase goods.The service was exceptional."
        },
        {
          "Note": 5,
          "Lieu": "BD",
          "Pseudo": "Tech and Gadgets",
          "Nb_Reviews": 1,
          "Date": "2023-04-30T07:31:08.000Z",
          "Titre": "As a seller",
          "Contenu": "As a seller, we at Anproductions are thrilled to be one of the bundle suppliers for inkydeals. Our experience has been exceptional, and we highly recommend this excellent website."
        },
        {
          "Note": 5,
          "Lieu": "VN",
          "Pseudo": "Nguyen Toan",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T15:15:58.000Z",
          "Titre": "Outstanding Professionalism & Work Style!",
          "Contenu": "Working with Inkydeals was a delight! Their professionalism and work style were exceptional. They paid attention to every detail, communicated promptly, and delivered high-quality results within the agreed timeframe. I highly recommend Inkydeals for their outstanding work. Looking forward to future collaborations!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "MANJEET JADEJA",
          "Nb_Reviews": 3,
          "Date": "2023-04-27T15:53:18.000Z",
          "Titre": "Good quality assets at an affordable…",
          "Contenu": "Good quality assets at an affordable price,with fair licensing terms, good variety"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Walt Jedziniak",
          "Nb_Reviews": 3,
          "Date": "2023-03-31T23:45:28.000Z",
          "Titre": "Just purchased a set of overlays",
          "Contenu": "Just purchased a set of overlays.  They look great and I can't wait to use them! I've purchased from InkyDeals before and have always loved the products!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Teresa Monholland",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T22:50:49.000Z",
          "Titre": "It was so easy to use.",
          "Contenu": "It was so easy to use.I found the image that I wanted, added it to the cart and checked out and downloaded it. The best beast s it was already an SVG and I don’t have to convert it - which made me very happy 😊 Thank you Teresa"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zoey F",
          "Nb_Reviews": 2,
          "Date": "2023-05-10T04:30:36.000Z",
          "Titre": "The lowest discount price for software",
          "Contenu": "Inkydeals is a trusted deal site where I always can find the lowest deal price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer Kinder",
          "Nb_Reviews": 3,
          "Date": "2022-10-28T14:17:06.000Z",
          "Titre": "I love using InkyDeals",
          "Contenu": "I love using InkyDeals. I find great deals with extra useful tools and graphics every time!!!"
        },
        {
          "Note": 5,
          "Lieu": "BG",
          "Pseudo": "Stephan Yankov",
          "Nb_Reviews": 16,
          "Date": "2023-03-31T12:59:00.000Z",
          "Titre": "Interesting deals and good support",
          "Contenu": "Very interesting deals and good customer support. Fair refund policy when some product doesn't meet the expectations. Reliable."
        },
        {
          "Note": 5,
          "Lieu": "KE",
          "Pseudo": "Erick Agutu",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T10:46:50.000Z",
          "Titre": "I found the website straighjt foerard…",
          "Contenu": "I found the website straighjt foerard and even got free fonts"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Klaus Dornhofen",
          "Nb_Reviews": 2,
          "Date": "2023-03-27T13:26:00.000Z",
          "Titre": "Great Deals for Graphic Designers",
          "Contenu": "Modern Website with a bunch of interesting Products for photographers, image-Editors, Webmasters and Graphic-Designers. Always worth to take a look for new deals."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LONG LE",
          "Nb_Reviews": 2,
          "Date": "2023-07-29T20:33:55.000Z",
          "Titre": "Great products",
          "Contenu": "I really got what I wanted for a long time.Pictures are great for background and overlaying.Thanks."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Loof Lirpa",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T04:47:19.000Z",
          "Titre": "An excellent product and the purchase…",
          "Contenu": "An excellent product and the purchase process was straightforward and easy to follow."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim Ellis",
          "Nb_Reviews": 2,
          "Date": "2023-09-06T22:36:23.000Z",
          "Titre": "Outstanding service!",
          "Contenu": "Their representative, Dheeraj, was attentive in resolving my issue quickly and efficiently. InkyDeals customer service is topnotch!"
        },
        {
          "Note": 5,
          "Lieu": "BD",
          "Pseudo": "MD JAHIDUL",
          "Nb_Reviews": 2,
          "Date": "2023-09-24T18:21:12.000Z",
          "Titre": "This market is really great and I'm so…",
          "Contenu": "This market is really great and I'm so glad to be working with it. Thanks a lot"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Thayer",
          "Nb_Reviews": 8,
          "Date": "2023-10-04T21:23:54.000Z",
          "Titre": "Beautiful products that work easily"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "MANJEET JADEJA",
          "Nb_Reviews": 3,
          "Date": "2023-06-27T19:21:57.000Z",
          "Titre": "Huge variety at an affordable price"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Rod",
          "Nb_Reviews": 2,
          "Date": "2023-10-28T12:34:02.000Z",
          "Titre": "Just great overlays"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Neil McCall",
          "Nb_Reviews": 3,
          "Date": "2023-07-18T12:39:31.000Z",
          "Titre": "Straight forward great company"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adam",
          "Nb_Reviews": 1,
          "Date": "2023-07-29T20:15:54.000Z",
          "Titre": "Great quality assets at affordable…",
          "Contenu": "Great quality assets at affordable prices!"
        },
        {
          "Note": 5,
          "Lieu": "BD",
          "Pseudo": "jubair haider",
          "Nb_Reviews": 4,
          "Date": "2023-04-05T12:16:45.000Z",
          "Titre": "Great website for graphic tools"
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Sorin Bara",
          "Nb_Reviews": 2,
          "Date": "2022-11-01T18:09:50.000Z",
          "Titre": "I like shopping at inkydeals",
          "Contenu": "I like shopping at inkydeals, great products, prices and easy to use! Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charlene Reeves",
          "Nb_Reviews": 5,
          "Date": "2023-08-04T19:52:45.000Z",
          "Titre": "Very nice and helpful"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Ashlynn",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T09:31:15.000Z",
          "Titre": "Inkydeals is pure joy 😊"
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Itsme",
          "Nb_Reviews": 2,
          "Date": "2023-06-04T00:23:34.000Z",
          "Titre": "perfect …",
          "Contenu": "– sleek and easy to shop. great products for a good price."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Christophe Nguyen",
          "Nb_Reviews": 2,
          "Date": "2023-10-01T09:52:52.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use. Lot of choices."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T11:43:07.000Z",
          "Titre": "I like very much these deals"
        }
      ]
    }
  ]
}