{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.cleanfreak.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MISE",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T18:41:34.000Z",
          "Titre": "I've only received one of the items so…",
          "Contenu": "I've only received one of the items so far and I haven't had any updates to my existing order."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T18:35:55.000Z",
          "Titre": "Matt was good",
          "Contenu": "Matt was good. Nobody knows the product or what is being sold."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "CCC",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T19:59:45.000Z",
          "Titre": "Don’t buy if you need different quick release ends.",
          "Contenu": "The extractor hose quick release needed to have a quick release changed to fit my equipment, no big deal. When I tried to get it off, it took me, vise grips, and table vise, a heat gun, and 2 hours of work to get the thing off. I don’t know how they got that quick release on there so tight but I nearly stripped off the bolt end staying on the hose to get the quick release off."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tom Markosian",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T17:54:07.000Z",
          "Titre": "Beware of higher dollar purchases.  Poor customer service.",
          "Contenu": "Order historyOrder\tPayment\tFulfillment\tTotalCF510104554 - 16 Aug, 2023\tPaid\tFulfilled\t$1,225.20500068311 - 04 Aug, 2021\tPaid\tFulfilled\t$882.05500064999 - 29 Apr, 2021\tPaid\tFulfilled\t$929.39500051580 - 30 Apr, 2020\tPaid\tFulfilled\t$922.36500044017 - 01 Aug, 2019\tPaid\tFulfilled\t$943.19Above is my order history.  Last order was a defective floor machine.  Ask them to send me a new one and I will send defective back to them.  They said no.  They want me to ship back to them and would contact me for shipping instructions.  Still have not heard back from them.  Frustrating process.  I will probably spend my dollars elsewhere and look for a company that wants to solve problems for their customers.  Not create new ones."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ROBERT AROYAN",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T14:17:52.000Z",
          "Titre": "i bought something that was missing an…",
          "Contenu": "i bought something that was missing an attachment and when i asked about it i was told it doesn't come with it even though the picture clearly showed it and it didnt say it didnt come with it. They responded that they would look into it and that was a week ago with no return call whatsoever."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 3,
          "Date": "2023-08-19T19:03:22.000Z",
          "Titre": "Didn’t receive all my order and called…",
          "Contenu": "Didn’t receive all my order and called to find out information on it and still have zero answer. I’ve been ordering for years and then this happened. Wish they can find my order or just resend it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ANNAMARIA CINA",
          "Nb_Reviews": 2,
          "Date": "2023-06-13T00:21:16.000Z",
          "Titre": "THE CLEAR BAGS I ORDERED 2000 ARE VERY…",
          "Contenu": "THE CLEAR BAGS I ORDERED 2000 ARE VERY WEAK & BREAK TOO FAST ! It's the SAK-IT 12-16 Gal SKU: SAK 243306N,....Forgive me I overreacted I know maybe there might have been a much stronger type of clear bags that you have ,But my 1st experience will provide me with a better understanding as to which strength I will order next time...Thank you."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tony S",
          "Nb_Reviews": 2,
          "Date": "2022-05-24T22:08:09.000Z",
          "Titre": "Poor information at time of purchase",
          "Contenu": "I found out the Product I purchased was a special order, and shipping was going to be longer, but nowhere did it say that until two days after purchase date. Customer service was less than helpful and arrogant. Pretty sure I’m done with clean freak after using them in the past, sorry, but you guys blew it!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William Kephart",
          "Nb_Reviews": 2,
          "Date": "2023-04-27T13:27:59.000Z",
          "Titre": "Machine came with the metal wand…",
          "Contenu": "Machine came with the metal wand creased but we still ysed it then after one carpet the pimp oes out so I order another one install and it works until after the next carpet it stops again. Have to check it out and see what is wrong now. Really is a defective unit."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "CHRISTOPHER MIMS",
          "Nb_Reviews": 2,
          "Date": "2023-06-06T16:11:07.000Z",
          "Titre": "betrayal",
          "Contenu": "i purchased a product that says its in stock but it was out of stock. paid for the items and then fought tooth and for inaccurate data of a non functioning product. then they offered a cheaper product and still will will not replace their non functioning product. i have sent pictures of the products for over a month. it is sad to say i have been betrayed by vendor that i love more any other vendor i use. ihave have bought over 90 percent of all my janitorial equipment from cleanfreak and to be betrayed hurts my core."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amanda Jones",
          "Nb_Reviews": 1,
          "Date": "2022-09-22T15:39:35.000Z",
          "Titre": "Dropped the ball",
          "Contenu": "The machine seems fine.  The shipper lost our shipment and instead of Clean Freak trying to locate it, or arranging a replacement, I had to make all of the phone calls between R&L and Clean Freak and I still had to pay for the freight.  No apology, no assistance."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Evelyn Medina Vazquez",
          "Nb_Reviews": 1,
          "Date": "2022-05-26T04:24:00.000Z",
          "Titre": "I purchased a 4 gallon buffer swing…",
          "Contenu": "I purchased a 4 gallon buffer swing machine bucket and I didn’t received it I call your customer service and they told me that they were not responsible for what happened because they had shipped it in wrong lot. The lot number I originally set it was “lot184” and they shipped it to “lot18” I had not seeing the email of dropped off confirmation and when I noticed i called immediately two weeks later I had to go over to lot18 and asked if they had received my package and they had it in the trash can ready to throw it away.If it wasn’t because that trash doesn’t get picked til Friday my package would of been gone"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kenja Ragland",
          "Nb_Reviews": 1,
          "Date": "2022-10-25T17:51:49.000Z",
          "Titre": "Usually happy, but not this time.",
          "Contenu": "Hi, I don’t want to sound too negative but I was not happy with my previous purchase.The outer brushes were too course and ruined my clients carpet. Also I have an extremely hard time just removing the brush from the machine."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Patricia Marcel",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T20:40:05.000Z",
          "Titre": "We received a defective piece of…equipment",
          "Contenu": "We received a defective piece of equipment upon delivery. I had to take pictures, speak to other people other than the representative I called. Wait days to ship the product back as the people who were supposed to send me the BOL and shipping info were out \"sick\", wait another almost 2 weeks for a replacement to arrive at Clean Freak, and now I am going to have to coordinate another dro[p off with the shipping company. All for something that wasn't even our issue.  So, overall, it has taken nearly 2 months since the day I ordered my product and as of today, I still do not have it.  They gave me a 15% discount that wasn't even offered to me, I had to ask for it, wait, while approval from a manager took place. Meanwhile, the job we needed this for has already happened, I had to rent a machine, and I still don't have the one I ordered. And there were so many questions, so many steps, so many approvals, so many things I had to do myself. Like truly?  It was broken when you delivered it, give me a new one asap, and you deal with all the minute details....bottom line, period."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brandon Murphy",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T18:51:05.000Z",
          "Titre": "Got the wrong unit first and was…",
          "Contenu": "Got the wrong unit first and was treated like I was a criminal if I have any choice I will never do business there again, I told everybody involved that multiple times."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ernest Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T21:22:56.000Z",
          "Titre": "They’re supposed to be processing a…",
          "Contenu": "They’re supposed to be processing a refund for me and here we are a week later and I have not heard anything from them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian LeClair",
          "Nb_Reviews": 1,
          "Date": "2022-09-13T15:31:38.000Z",
          "Titre": "I purchased a vacuum for our school…",
          "Contenu": "I purchased a vacuum for our school facilities department but when it came in there was no hose. I have contacted two more times and still have not received a date in which the hose will be delivered."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Maurice Christopher",
          "Nb_Reviews": 1,
          "Date": "2022-06-14T17:33:07.000Z",
          "Titre": "I did not receive a complete order…",
          "Contenu": "I did not receive a complete order still waiting on parts so I can use the carpet extractor. Called numerous of times. I should not have to wait to use machine because it was shipped out with missing parts."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lloyd Brushwein",
          "Nb_Reviews": 4,
          "Date": "2022-03-25T12:31:14.000Z",
          "Titre": "if you can wait a mo or so",
          "Contenu": "placed order,had to have payment right ten,paid then only after i paid and waited 2 weeks and emails i got answer it was going to ship in a mo or so."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sam",
          "Nb_Reviews": 1,
          "Date": "2022-04-21T20:50:20.000Z",
          "Titre": "I bought a product",
          "Contenu": "Don’t ask for a review if you can’t supply the product. I am not looking to leave a bad review but you are asking me to supply one by emailing me. I bought a product. It does not say it’s not available for 4 months. Information  is given that you might take a little longer but most items are shipped with in ten business days.  It cost me thousands of dollars that I did not receive the product I ordered. It was fully refunded after I called. It said nothing about not being available for four months. I got refunded but I had to turn down jobs because I didn’t have the machine. I ended up ordering it on amazon but I lost many jobs because of it. If you can’t ship the product don’t offer it. Certainly don’t charge a credit card if they won’t have it available for months."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jamie",
          "Nb_Reviews": 1,
          "Date": "2022-05-31T23:14:12.000Z",
          "Titre": "Vacuum still missing parts",
          "Contenu": "I ordered a large vacuum. It did not come with the necessary parts. I have called twice about finding the status of receiving the parts and nobody has gotten back to me with this information. This has been a huge waste of money!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bruce Silvia",
          "Nb_Reviews": 3,
          "Date": "2023-04-07T11:44:43.000Z",
          "Titre": "only got half of my order",
          "Contenu": "only got half of my order. i am still waiting on the rest that cost me over $500.00 dollars. figures they would steal my money. i am calling the better business bureau."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "too much pation",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T23:27:11.000Z",
          "Titre": "very bad experience",
          "Contenu": "very bad experience, the machine supposed to come all adjusted ,  came in with squeegee non adjustable I had to learn from you tube video to adjust the squeegee instead finish the job I was in ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jovon Briggs",
          "Nb_Reviews": 1,
          "Date": "2022-09-07T06:43:03.000Z",
          "Titre": "Not a good place to order from price to…",
          "Contenu": "Not a good place to order from price to high not a good company brought a mechanic thought them and had to throw away 1800 dollars because I could not get what I need from this company will never recommend any one"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "david snowden",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T16:11:47.000Z",
          "Titre": "Hand sanitizer refills",
          "Contenu": "Hand sanitizer refiles have not been delivered as I know of."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "john renn",
          "Nb_Reviews": 1,
          "Date": "2023-01-01T23:48:46.000Z",
          "Titre": "Still have not received my order",
          "Contenu": "Still have not received my order. Please cancel order since now the job is done and I had to go elsewhere to get the supplies I needed.John RennThe Cleaning Solution"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joseph Foreman",
          "Nb_Reviews": 3,
          "Date": "2022-06-08T05:54:26.000Z",
          "Titre": "You call and they tell you that they…poor service",
          "Contenu": "You call and they tell you that they will call you back later or I have to talk with my manager and no call back and no help. They also send the wrong item and won’t send the correct one you need. They ignore you when trying to get the correct item"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "L Str",
          "Nb_Reviews": 1,
          "Date": "2022-09-14T03:28:17.000Z",
          "Titre": "Look elsewhere…",
          "Contenu": "I ordered 2 floor machines a few weeks ago, and I have no idea what the status of the order is.  Terrible customer service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tom DeFazio",
          "Nb_Reviews": 3,
          "Date": "2022-08-25T13:12:59.000Z",
          "Titre": "YIU ASKED",
          "Contenu": "My delivery took weeks to get here. I tracked it and it first went to Texas. I had to order from your competitor same price but it took 4 days."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William Cope",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T01:32:49.000Z",
          "Titre": "Horrible service on a part for a 5…",
          "Contenu": "Horrible service on a part for a 5 month old machine.  Ridiculous"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Demetrius Golddee Belcher",
          "Nb_Reviews": 3,
          "Date": "2022-04-27T14:09:27.418Z",
          "Titre": "Broken wand damaged cleaning solution…",
          "Contenu": "Broken wand damaged cleaning solution no replacement no call back doesn't answer phone"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Troy Koch",
          "Nb_Reviews": 2,
          "Date": "2022-06-29T06:02:42.000Z",
          "Titre": "Make sure this is exactly what you want before you order. 20% restocking fee!!",
          "Contenu": "I ordered a $3600 floor scrubber online which was a big risk and my fault for making that decision.  I assumed, since this product was being ordered online, that there had to be some sort of reasonable return policy as I could not see it in person or try it out.  Unfortunately, the instant I opened the box I realized I needed the battery powered version instead of the plug version.  I contacted Cleanfreaks.com and they were helpful but informed me that not only would I have to pay to ship it back, I would be charged a 20% restocking fee.  This information is on their website so I admit that they didn't really do anything shady.  That being said,  I also discovered it would cost me $500-600 to ship it back.  Just to be clear, I never used the product or took it out of the box.  I found myself standing over the box, staring at this floor scrubber that I knew was not what I wanted.  Nevertheless I had just paid $1300 to discover this.I guess I would just say the only person who should be ordering a floor scrubber or any other cleaning machine through cleanfreaks.com is someone who has already used the product and knows exactly what they want.  But make sure you don't screw up the order or you'll be out about $1300 before you even open the box and discover the mistake you've made.  Why wouldn't you go to a local cleaning supply store and ask them to order it for you?  They might still charge you a restocking fee if you end up not liking it.   But they might have a rental you could try out at home before you take the dive on such an expensive product.  They also might have a used version you could try (presumably someone who sold them back the product they didn't want at the cost of a restocking fee).   At the very least you'll save yourself $500 in shipping even if you have to pay a restocking fee.  By the way, I have since checked with a few local stores and the price they are quoting me is about what Cleanfreaks.com sold it to me for minus the $500 shipping fee.  Don't expect to get a better deal online for this.  It just doesn't make sense to buy a product like this from Cleanfreaks.com or or any other online vendor for that matter."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Zion Lutheran Church",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T16:22:27.000Z",
          "Titre": "shipper was rude beyond belief."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Denise Lyday",
          "Nb_Reviews": 1,
          "Date": "2022-09-23T04:29:08.000Z",
          "Titre": "I have not received my 30 inch wide…",
          "Contenu": "I have not received my 30 inch wide vacuum yet!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "chase hoagland",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T15:39:23.000Z",
          "Titre": "still waiting on product to arrive"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Leangelo  Wilkerson",
          "Nb_Reviews": 1,
          "Date": "2022-12-01T02:53:50.000Z",
          "Titre": "They won't even send me a return letter"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2022-02-06T21:50:26.000Z",
          "Titre": "Clean freak sweeper, Not that impressed",
          "Contenu": "I purchased the Clean freak sweeper to sweep the dirt out of my shop that gets brought in on farm equipment. Concrete is very smooth so I thought it would do a good job but it takes 3 or 4 passed to pick everything up. Stirs up dust because it doesn't have much suction and leaves a line of dirt between the two brushes. Very disappointed in this purchase."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dominick Giannone",
          "Nb_Reviews": 21,
          "Date": "2021-12-13T15:19:46.000Z",
          "Titre": "These people just suck I don't…",
          "Contenu": "These people just suck I don't understand how a company that has such great equipment can suck so bad I just called there and the lady was the most ignorant thing I've ever talked to at least people could go jump in a Lake I'm never giving them any more of my money I need a question answered and yet I got to be talked to like I'm a piece of crap"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Muhsana Lee",
          "Nb_Reviews": 1,
          "Date": "2021-11-14T17:58:41.000Z",
          "Titre": "CleanFreak® Large Area Dry Strip…",
          "Contenu": "CleanFreak® Large Area Dry Strip Oscillating Floor Machine (14\" x 28\" Head) Machine worked great until it didn't. We've  owned this machine for less than a year and its broken down twice. First time was the oscillators(normal) Quick fix. Second time has been a complete system failure the pad driver bearings have broken along with the metal around it. Parts aren't sold on the website and the company wont honor protection plan. Dont buy from these people!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Randall Swaney",
          "Nb_Reviews": 4,
          "Date": "2021-08-14T01:01:07.000Z",
          "Titre": "Ordered my items for our small  family…",
          "Contenu": "Ordered my items for our small  family business. The items that were in house came quickly and even the items shipped from other companies came at a reasonable time frame, but the free items have not come and it's been ordered for months. Will be glad to give update if ever the situation is corrected, have made contact and weeks ago they said it was on its way, will keep  you posted."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Javon Wesley Carter",
          "Nb_Reviews": 3,
          "Date": "2021-07-21T20:15:41.000Z",
          "Titre": "Unacceptable Service",
          "Contenu": "I don’t know if it’s because the company is moving to another state, but I’ve orders carpet solutions for my extractor around June 28, 2021And have yet to receive anything it is now July  22, 2021 when I called to check on the order I was told all of my items was on back order, I was never notified not even Via Email I just believe this is unacceptable at this point"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dishmann",
          "Nb_Reviews": 2,
          "Date": "2021-07-07T22:13:56.000Z",
          "Titre": "Too many requests for reviews.",
          "Contenu": "Too many requests for reviews.At first I gave this company five stars. Until I learned that most everything is drop shipped and what I paid in shipping was just horrible. And now every other day I get a request for them to review me. I asked them to stop but they don't. so today I am reviewing them at one star. Let's see if they'll go for zero"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Buchanan",
          "Nb_Reviews": 1,
          "Date": "2021-04-10T04:59:02.000Z",
          "Titre": "I spent 2k on a autoscrubber and was…",
          "Contenu": "I spent 2k on a autoscrubber and was told it was in stock and would ship next day ..got shipped almost 1 week later .once it was dropped off and opened the elbow at the bottom of the fill tank was snapped off and I tried a few times to contact with no avail. Now weeks later we just decided to fix it. Your customer service is the worst.Posting this on Google as well.Robert Buchanan Armored Cleaning Solutions"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vicki Guthrie",
          "Nb_Reviews": 1,
          "Date": "2021-07-21T15:38:30.000Z",
          "Titre": "Ordered June 15th and still waiting for…",
          "Contenu": "Ordered June 15th and still waiting for shipping information or even delivery.  Many emails from me are going unanswered. 3 weeks after ordering I did get a response. Now a week after that estimated delivery date no item and emails are going unanswered again. Now July 21st. Very poor communication. Very slow shipping."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Peter Meloling",
          "Nb_Reviews": 1,
          "Date": "2021-03-13T03:56:16.000Z",
          "Titre": "We ordered scrubbing and buffing pads…",
          "Contenu": "We ordered scrubbing and buffing pads and a new scrubber/buffer. The pads came very fast we had them in 4-5 days. The order was on Feb 20th. There was nothing said about this being out of stock. I was told 7-15 days for delivery. It is now Mar 12th. I told today that it should ship by the 19th. We needed it to do the clubhouse floors before most of the help goes back north. It looks like I will be doing the floors by myself."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Glen  Kelly",
          "Nb_Reviews": 1,
          "Date": "2021-07-28T23:48:46.000Z",
          "Titre": "Ordered heated portable on July 2nd…",
          "Contenu": "Ordered heated portable on July 2nd called 2 weeks later they said it should arrive by July 29th get a call on the 28th saying it won’t arrive til august 29th so I ask for a refund they only refund me for the portable and don’t refund taxes and shipping which add up to 206$ tell me where this makes any sense"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jose J.  Gijon",
          "Nb_Reviews": 1,
          "Date": "2021-01-18T23:24:35.000Z",
          "Titre": "Sending damaged equipment is not a good…",
          "Contenu": "Sending damaged equipment is not a good business for anyone, one day after my son notified cleanfreak co. of a Brocken valve the company answered 10 day later telling us to send back the machine to check it and give us an estimate of the cost to repairs , by then we already had lost days of work and then we would have to pay. We will not do business with you anymore"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jordan Gwin",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T21:50:27.000Z",
          "Titre": "it was broke",
          "Contenu": "it was broke. I don't have a box to send it back in and I loss money on jobs"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jimmy the Greek",
          "Nb_Reviews": 1,
          "Date": "2021-03-20T17:29:43.000Z",
          "Titre": "My order was forgotten on their Loading…",
          "Contenu": "My order was forgotten on their Loading Dock for 17 days!! How disappointing. Only after I called did they realize that.They do not like to answer emails on their customer service portal.Overall I would say, the purchasing experience had been a complete disappointment. I wonder now, if their products are equally dissapointing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John m Bosworth",
          "Nb_Reviews": 1,
          "Date": "2021-03-01T18:17:50.000Z",
          "Titre": "I received 2 broken machines from them…",
          "Contenu": "I received 2 broken machines from them and it was not a pleasant time trying to get my money back the customer service was pretty bad until I got intouch with rocketindustials Manger and it was fixed within 2 min after speaking with here I would recomend shopping elsewhere unless your not in any rush to receive your product and check all parts to make sure it works properly because the two supposedly brand new machines I received looked like they were thrown off a roof"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "holly lehman",
          "Nb_Reviews": 2,
          "Date": "2020-08-11T21:26:15.000Z",
          "Titre": "i have tried to get my pronto 100CH…",
          "Contenu": "i have tried to get my pronto 100CH steam cleaner sent back  it does not worki have contacted the company numerous times and no response.  i was referred to reliable that is the company that sent it to me thru the clean freak web site and was told that they would get me the information.  this never came and i tried to get clean freak to help.  no response.  will never order from them again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "jeff",
          "Nb_Reviews": 7,
          "Date": "2021-07-19T22:41:29.000Z",
          "Titre": "Still haven't received full order…",
          "Contenu": "Still haven't received full order 500065897Defoamer received half order only. Received message from CleanFreak.com saying was damaged in transit. And it would be on the way. This is over a month ago.  Im not getting through to customer service. No return messages now. What's up?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Varouj",
          "Nb_Reviews": 1,
          "Date": "2020-10-15T19:07:41.000Z",
          "Titre": "This is a horrible site",
          "Contenu": "This is a horrible site. I place an order online, it shows it's in stock, next day the order gets cancelled telling me that the item is no longer available. This is the second time this is happening and the last time I placed an order it was about 4 weeks ago. So this site is messed up. False advertising. Last time I am visiting this site."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "kevin kinney",
          "Nb_Reviews": 3,
          "Date": "2020-06-03T22:17:52.000Z",
          "Titre": "You have not shipped my order as it…",
          "Contenu": "You have not shipped my order as it still shows \"processiing\" and when I asked for an update I have not had a response but you sent me this email asking how you did? I have liked purchasing products from you in the past and hope you can get this order out to me in short order as I have a job for the items next week and time is running thin,"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sheri Brennan-Scheurer",
          "Nb_Reviews": 2,
          "Date": "2020-06-19T13:58:51.000Z",
          "Titre": "do not order replacement parts thru them!",
          "Contenu": "Always ask when you are ordering parts, what the cost of shipping will be.  We ordered an 8 in black hose replacement for our hand tool.  Quoted us a price of $38.00.  We got the invoice, and were charged $61.48... $20 freight charge for an 8 in rubber hose?  you have got to be kidding me.  Will never order replacement parts thru them again!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lari Wilsey",
          "Nb_Reviews": 1,
          "Date": "2020-04-01T14:07:06.000Z",
          "Titre": "Backorder - No notification",
          "Contenu": "When I placed my order, website said all was in stock, but when I called check on my order approximately a week later, the product wasn't in stock, and is supposed to ship approximately 3-weeks later.  Haven't see the order yet.  No notification from them explaining the delay.  I had to contact them, and the on-line help person was not very pleasant."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Karen Paris",
          "Nb_Reviews": 10,
          "Date": "2020-01-07T00:05:09.000Z",
          "Titre": "I never received an email showing my…",
          "Contenu": "I never received an email showing my order had shipped.  It had shipped within 3 day of my placing the order.  However, everytime I went into my account on their website it showed the order was processing, so I was in limbo.  I finally called them to see what was holding the order up, and I was told it had shipped.  I asked them why it still showed pending and they didn't know why."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "SATISH GABHAWALA",
          "Nb_Reviews": 2,
          "Date": "2023-09-26T19:38:42.000Z",
          "Titre": "Air freshener is not good"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Disappointed",
          "Nb_Reviews": 1,
          "Date": "2020-11-01T17:04:27.000Z",
          "Titre": "Communication is Key",
          "Contenu": "This my my husband and I third time ordering with Clean Freak. We have had the same issue each time. The product does not arrive on time and they lack communication with the customer. I ordered a piece almost a month ago. Originally, they told me the piece was on back order. A week later, I reach out and then they tell me the piece is on back order until the end of the month and it will ship when it come in. We’re now at the end of the month, still no contact, yet you want a review. So, here we are."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dannette Wassenich",
          "Nb_Reviews": 1,
          "Date": "2019-10-17T20:22:53.000Z",
          "Titre": "Order",
          "Contenu": "I placed my order. Received email that my card was charged. Waited for shipping information. Never received anything.  Logged into help chat to get info on shipping.  I was told that the item was on back order.  Never once did I receive anything telling me my order was delayed.  Terrible service!!  My credit card should never have been charged without being notified that the item was not available."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "R. Gregory",
          "Nb_Reviews": 1,
          "Date": "2020-04-12T07:03:00.000Z",
          "Titre": "Item was available when order was…",
          "Contenu": "Item was available when order was placed and 2-3 days later the order was cancelled.  I was very polite when I called but the customer service representative was condescending when I called in to find out what happened.  Safe to say, you have lost a potential large customer as a result of having a jerk in your customer service department."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bowstring Shores Resort",
          "Nb_Reviews": 1,
          "Date": "2020-03-21T18:23:22.000Z",
          "Titre": "BAD online inventory",
          "Contenu": "I ordered lysol disinfectant for my resort and it showed that it was in stock. They charged my card, then, days later, refunded my card and said that it was out of stock. They need to keep track of their stock. By the time that I realized they didn't have any, the whole country was out and I had to close my doors early for the season."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Unsatisfied Customer",
          "Nb_Reviews": 1,
          "Date": "2020-03-31T14:03:48.000Z",
          "Titre": "Was told should receive shipment by…",
          "Contenu": "Was told should receive shipment by Friday 27th. Called CS and now they're saying zero in stock and new shipment mid-April...should maybe see my package before May. 1/10 would definitely not do business with them again. 0 stars. How do you go from you should be receiving your package to we have none available....huge difference."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Roger Carroll",
          "Nb_Reviews": 3,
          "Date": "2023-04-06T20:45:18.000Z",
          "Titre": "Had to pay to have a wrong order…",
          "Contenu": "Had to pay to have a wrong order shipped back to you."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sergio",
          "Nb_Reviews": 1,
          "Date": "2020-04-06T16:57:48.000Z",
          "Titre": "In stock items ship within 24 hours…",
          "Contenu": "In stock items ship within 24 hours from the date of purchase CleanFreak.com  Policy.  still waiting to ship out order over 2 weeks ago. Then they send this to me.  Thank you for your recent purchase from CleanFreak.comHow did we do? One star that's how you did!  CleanFreak needs work on their customer service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ANN LAWSON",
          "Nb_Reviews": 2,
          "Date": "2020-08-23T17:16:01.000Z",
          "Titre": "I ordered a filter back 5-6 weeks ago",
          "Contenu": "I ordered a filter back 5-6 weeks ago for something and I needed it pretty quick but it is August 23 and I have not received it yet. I did not get any email of confirmation of my order nor did they communicate any delay in me receiving it. I contacted the company and all they said was it was on backorder. I never got a communication informing me that it was on backorder. They cashed my payment immediately and did not wait until the item came in to get their money. I believe this is a very crooked company to deal with."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jerral Ingle",
          "Nb_Reviews": 1,
          "Date": "2019-12-29T14:35:20.000Z",
          "Titre": "I ordered squeegee’s for my wet/dry vac…",
          "Contenu": "I ordered squeegee’s for my wet/dry vac over 2 weeks ago. I am a business owner and when I order stuff for my business, I need it with a week or so. The squeegee’s have not been shipped to Clean Freaks yet and will be another 2 weeks. If your going to be a retail business have inventory or direct ship from supplier!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Cooley",
          "Nb_Reviews": 3,
          "Date": "2020-03-21T18:23:06.000Z",
          "Titre": "You cancelled my order saying that none…",
          "Contenu": "You cancelled my order saying that none of the products I ordered were available when they showed available on line. I understand the issues with cleaning products during the Covid19 outbreak, but I told my customers I had products coming to service them. Due to ordering from your site I had not tried to purchase from anyone else, resulting in everyone being out of stock and I could not provide service my customer. Ultimately looking like I was not able or capable to provide service and loosing business."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Philip Bornstein",
          "Nb_Reviews": 1,
          "Date": "2022-02-28T01:11:54.000Z",
          "Titre": "Buyer beware",
          "Contenu": "Buyer beware, they take your money and then don't deliver the product. They don't return/answer calls.  I had to go through my credit card company and still don't have credit for products not received."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rodney Stewart",
          "Nb_Reviews": 1,
          "Date": "2020-07-19T17:37:57.000Z",
          "Titre": "Ordered over a month ago",
          "Contenu": "Ordered over a month ago. Still have not received my items. I ordered a 500 psi portable extractor. Shipping should have been 7-12 days but I was not notified that the equipment was on back order until after I spent almost 3k. Huge hold up and slow down on my larger jobs. I need my equipment!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian  Buchanon",
          "Nb_Reviews": 1,
          "Date": "2021-08-09T19:44:11.000Z",
          "Titre": "Taking forever to get my stuff and they…",
          "Contenu": "Taking forever to get my stuff and they sending stuff with out a tracking number which no professional cause I’m not home during the day so what if somebody steals it I wouldn’t know because I didn’t even know it was otw just poor business"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Harriett  Norwood",
          "Nb_Reviews": 1,
          "Date": "2020-03-26T18:56:36.000Z",
          "Titre": "Your company charged the college credit…",
          "Contenu": "Your company charged the college credit card for back ordered items that you knew would be and then did not alert us to that fact.  Then I had to speak to 3 separate people before receiving a credit for the charge just this morning.  Very unprofessional during this health crisis."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mikey",
          "Nb_Reviews": 1,
          "Date": "2020-06-03T23:50:41.000Z",
          "Titre": "Would not recommend, lies about shipping times.",
          "Contenu": "Would not recommend! They lied about shipping time repeatedly. I was told that it would be 5 days until my order shipped, a week passed and I called and they said it would be another 2 weeks until I receive my items. Canceled the order and will not order from them again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Matt Barnes",
          "Nb_Reviews": 5,
          "Date": "2021-01-31T14:36:32.000Z",
          "Titre": "Less focus on reviews - more on customer support",
          "Contenu": "I cannot get a response from their support team on the status of one of my back ordered items.     Their “review” team is working overtime though.  Since inquiring about the backordered item I’ve received two review requests.  Well, here ya go."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bonnie Smith",
          "Nb_Reviews": 3,
          "Date": "2020-08-10T00:54:24.000Z",
          "Titre": "No Shipping Conformation!",
          "Contenu": "I did not receive a shipping confirmation. We had a job and had to drive 1:30 round trip to buy a box of pads. Next day when we were getting ready to leave our package arrived. Had I had the confirmation and tracking could have saved 30.00! Bonnie Smith"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "CHAD F",
          "Nb_Reviews": 1,
          "Date": "2021-08-13T00:23:01.000Z",
          "Titre": "It’s been a couple weeks now since…",
          "Contenu": "It’s been a couple weeks now since we’ve place the order.... I called last week to check on the order... I was told should ship out this week and yet nothing.... I get that sometimes things take a bit longer to get but most suppliers we use at least keep us in the loop with our order...but I get a chance to review prior to receiving the package...so far I got nothing to review other than this email I received today hoping it was a tracking update or shipment but instead a review email... you might want to give it a chance for the customer to get the package before they can give a review. So until then it will stay a 1 star until I get something substantial to review."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Aaron Moore",
          "Nb_Reviews": 1,
          "Date": "2021-05-19T17:16:51.000Z",
          "Titre": "I’m still waiting to her back in…",
          "Contenu": "I’m still waiting to her back in regards to the product I ordered.  It does not link to my current box extractor and need some info on either shipping product back or getting an adaptor part so this product will work.  Please advise"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "CINIA ORTEGA",
          "Nb_Reviews": 1,
          "Date": "2020-03-29T22:04:27.000Z",
          "Titre": "Honestly I been waiting for my…",
          "Contenu": "Honestly I been waiting for my purchased and is been a month. Not receive it yetI was expecting when a client purchased an item to receive it. Not get charge and we wait until us available. In fact the worse customer services ever. Extremely disappointed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Peter Ayala",
          "Nb_Reviews": 1,
          "Date": "2020-03-13T16:15:02.000Z",
          "Titre": "Great Website, Not So Good Customer Service",
          "Contenu": "Five stars on the website, its easy to navigate through. Unfortunately, I can't say the same about the customer service that I received. The gentleman I spoke to was sarcastic and patronizing. I called about my phone number being attached to my address and if it could please be removed. He didn't understand what I was asking him to do. His response was a bit sarcastic, he said that they don't deliver to phone numbers, which is not what I asked. I ended the call after he made a few more sarcastic comments. I feel bad for the gentleman, he must be very unhappy with his career choice."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ethan Felts",
          "Nb_Reviews": 1,
          "Date": "2019-04-11T15:41:25.000Z",
          "Titre": "Would leave 0 star but got lied too…",
          "Contenu": "Would leave 0 star but got lied too about a 175rpm floor machine they took my payment but lied and didn't have it in stock so truck was coming in friday and then it would be 7 to 10 days before arrival. It would take a huge discount to continue doing business!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "brian stevens",
          "Nb_Reviews": 1,
          "Date": "2020-10-23T01:52:03.000Z",
          "Titre": "Charged me for full order",
          "Contenu": "Charged me for full order, sent the cheap item and told me the other ia back ordered. No mention of item not being in stock when I ordered it pr I would have  ordered from different supplier. Go elsewhere and don’t waste your time!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shana mosley",
          "Nb_Reviews": 2,
          "Date": "2018-11-07T20:37:26.000Z",
          "Titre": "Poor communication and poor customer…",
          "Contenu": "Poor communication and poor customer service. Placed an order a month ago for pads, 10 cases total. To date, only received 7 cases. Missing 3 cases. Called about it weeks ago and the gentleman said they would be shipped. Still no pads and still no response."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gaudencio Francisco",
          "Nb_Reviews": 1,
          "Date": "2020-07-29T20:30:08.000Z",
          "Titre": "I bought a vacuum cleaner and it's been…",
          "Contenu": "I bought a vacuum cleaner and it's been over a month and they don't know what happened to the order. I have spoken and they have not been able to solve the problem! They are irresponsible, I am very upset with this situation."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "OG",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T00:01:16.000Z",
          "Titre": "Cleaning nozzle broke first week."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jason  Viera",
          "Nb_Reviews": 1,
          "Date": "2018-08-11T16:08:56.000Z",
          "Titre": "Terrible online purchasing experience",
          "Contenu": "Terrible online purchasing experience. Did not find out till many days later that my products I ordered where not in stock. Customer service response : we can’t carry every single item in our warehouse. Will never make a purchase from this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William Files",
          "Nb_Reviews": 1,
          "Date": "2021-02-03T17:25:26.000Z",
          "Titre": "Lack of follow through, feeling ripped off",
          "Contenu": "I still haven’t received the rest of the product that I ordered. The original order was placed about 6 weeks ago. Horrible horrible experience. I would not recommend this company to anyone under any circumstances."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stephen Van Dam Stephen Van Dam",
          "Nb_Reviews": 1,
          "Date": "2020-03-24T22:17:43.000Z",
          "Titre": "Very poor service",
          "Contenu": "I ordered TP and cleaning supplies.  At the time I ordered, everything was showing in stock.  A week later I did a live chat to ask about me order and I was told nothing was in stock.  Very disappointing and horrible service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Todd Kaufman",
          "Nb_Reviews": 1,
          "Date": "2020-05-18T17:48:12.000Z",
          "Titre": "Waste of my time",
          "Contenu": "Waste of my time.  I set up account, purchased soap dispenser and paid on my CC.  Many days later they said we don't carry those anymore...If their website was updated I would not have gone through all of the hassle."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pedro Urincho",
          "Nb_Reviews": 1,
          "Date": "2020-09-25T20:58:13.000Z",
          "Titre": "I would never buy a product here again",
          "Contenu": "I would never buy a product here again.  I bought a wet / Dry Vaccum and the factory arrived defective.  I tried to respect the guarantee and no one from the CleanFreak team helps me 😡😡"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 1,
          "Date": "2020-09-30T17:07:40.000Z",
          "Titre": "I bought a vacuum it took a long time…",
          "Contenu": "I bought a vacuum it took a long time for them to ship it out to me so I bought one in person at a local store. I sent an email the day before they shipped it out saying I wanted to cancel my order. The next day they sent out an email saying my order was shipped. When it arrived I called letting them know I wanted to return it, they refused to allow the return even though I had an email saying I wanted to cancel it before it was shipped.Customer service was late and not helpful at all I called the first time and a whole week went by until I had to call again to remind them I needed help. Will not buy from this website again because a no return policy on an item that wasn’t used but for 10 mins is more important than me being a returning customer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Karis Seltzer",
          "Nb_Reviews": 6,
          "Date": "2020-10-10T00:36:22.000Z",
          "Titre": "This has been a nightmare",
          "Contenu": "This has been a nightmare. The company shipped my products to a neighbor's address where they sat for who knows how long.  The items just arrived 2 days ago.  The project is long finished."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jan",
          "Nb_Reviews": 2,
          "Date": "2020-06-20T03:53:55.000Z",
          "Titre": "Still waiting on my order!",
          "Contenu": "Still waiting on my order to be completed and shipped to me. It has been over a month.  I have been asked twice for a review but I haven’t received my order so I can’t really give a good review."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Travis James",
          "Nb_Reviews": 1,
          "Date": "2021-06-15T18:50:29.000Z",
          "Titre": "I’ll called twice",
          "Contenu": "I’ll called twice  . I left a message and have never heard back from them . Ordered a shampooer 5/7 and they took the money out of my account . Still haven’t seen the shampooer ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Trevor Fray",
          "Nb_Reviews": 2,
          "Date": "2021-08-13T17:50:35.000Z",
          "Titre": "I order a 13\" brush",
          "Contenu": "I order a 13\" brush, got a 11\" brush. The picture order shows the locking unit. This one has none. Working with Jennifer to resolve the problem. Hopefully fix soon."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Fernando Villegas",
          "Nb_Reviews": 1,
          "Date": "2021-08-18T14:48:28.000Z",
          "Titre": "Clean Freak is not letting me know…",
          "Contenu": "Clean Freak is not letting me know nothing about My package and this is where I am confused and frustrated, is being over a month and still haven't got nothing"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jennifer Deep",
          "Nb_Reviews": 1,
          "Date": "2020-03-25T19:52:59.000Z",
          "Titre": "Two days ago I was emailed that my…",
          "Contenu": "Two days ago I was emailed that my order will be canceled and now I’m waiting for my return money. It’s been two days and I will call to find out about my money in 3 more day."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard Schauf",
          "Nb_Reviews": 1,
          "Date": "2020-07-29T15:16:55.000Z",
          "Titre": "We ordered hand sanitizer from you",
          "Contenu": "We ordered hand sanitizer from you. Later found out it was manufactured in a facility that also manufactured methanol. We were told then the sanitizer wasn’t safe to use."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 3,
          "Date": "2020-04-02T21:12:53.000Z",
          "Titre": "Item was available when I ordered it",
          "Contenu": "Item was available when I ordered it , all of a sudden the next day the product isn’t made anymore. Sounds like BS to me. Why is it even for sale if it’s not made anymore."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2020-05-06T19:03:28.000Z",
          "Titre": "Might consider another company",
          "Contenu": "Might consider another company. Customer service was rude. Product was on back order not a problem. Had a big issue with 2 different addresses for billing and shipping."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anita Auxer",
          "Nb_Reviews": 2,
          "Date": "2021-07-17T10:20:06.000Z",
          "Titre": "I ordered almost a month ago",
          "Contenu": "I ordered almost a month ago. Was charged for my order, have not received it yet and have had no communication from them since the day I placed my order."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ron",
          "Nb_Reviews": 2,
          "Date": "2023-06-27T07:46:11.000Z",
          "Titre": "Buyer beware",
          "Contenu": "I ordered this machine and the parts they sent for the hose is not a good fit it comes off the machine when you go to pull the hose out from and then it sucks in air and now I have to wait for the new parts to use the machine so buyers beware"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Roger Carroll",
          "Nb_Reviews": 3,
          "Date": "2023-04-25T18:41:41.000Z",
          "Titre": "Had to pay for my return",
          "Contenu": "Had to pay for my return. Ordered a buffer with pads. Pads were to big for the unit. Also, waited forever for the buffer so I had to cancel and order elsewhere. That other company did a good job of getting me the buffer. Much better then YOU!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brenda Sayers",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T13:36:35.000Z",
          "Titre": "Ordering was easy",
          "Contenu": "Ordering was easy, shipment was quick, BUT I ordered 80grit and 150grit and got 2 boxes of 60grit.  My bad, I did not check what I received until the weekend I was using them.  Played havoc on my project."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dexter Jones",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T18:08:02.000Z",
          "Titre": "Slightly larger than what I need",
          "Contenu": "Slightly larger than what I need. Had to cut down to size  needed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mark Katsolis",
          "Nb_Reviews": 1,
          "Date": "2022-11-24T03:24:28.000Z",
          "Titre": "These sanding discs are not effective on epoxy",
          "Contenu": "The sanding mesh screens I received were inadequate for epoxy. My time is money. Whatever brand you supplied were cheap!!! I went to another vendor and bought 10 sheets of Norton durite sheets 60 grit. What a difference cuts long lasting+ you can rinse again and sand again. Same price you charged me. But much better product."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Purchaser",
          "Nb_Reviews": 1,
          "Date": "2022-04-04T02:03:41.000Z",
          "Titre": "We haven't received our order from 7…",
          "Contenu": "We haven't received our order from 7 weeks ago, yet you have sent several requests for us to review our purchase."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James Thomas",
          "Nb_Reviews": 1,
          "Date": "2022-10-16T02:29:04.000Z",
          "Titre": "To long for delivery past expectation!",
          "Contenu": "Still waiting in delivery I was told would come and never did."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mike R.",
          "Nb_Reviews": 1,
          "Date": "2022-06-08T18:46:01.000Z",
          "Titre": "The machine I bought did not have the…",
          "Contenu": "The machine I bought did not have the drive I was told it had and did not clean the floors as we wanted.  Then I was charged a 20% restocking fee."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James Goode",
          "Nb_Reviews": 1,
          "Date": "2022-09-14T04:40:22.000Z",
          "Titre": "Just ok smell not very pleaseing"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Garrison Reekers",
          "Nb_Reviews": 1,
          "Date": "2021-07-25T21:54:17.000Z",
          "Titre": "Submitted order 3 weeks ago for about…",
          "Contenu": "Submitted order 3 weeks ago for about $1400 and got one item that came directly from another company that was $286.  Called to check on order twice and 2nd time they were to call me back and never did.  The email for the review is the first email contact that has been made since I ordered other than the order confirmation and payment.This is the 3rd time I've purchased from Clean Freak and may have to elsewhere for needed supplies."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "TC",
          "Nb_Reviews": 3,
          "Date": "2021-06-17T21:06:30.000Z",
          "Titre": "Product showed to be in stock now over…",
          "Contenu": "Product showed to be in stock now over a week later I'm told it's not and now won't get for over a month if then. Haven't even been asked weather I would like to cancel the order or wait, even though the website says if items are back ordered you will be given that choice. So they have my money and I have no product and no option"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gary St.Onge",
          "Nb_Reviews": 1,
          "Date": "2020-06-23T19:43:56.000Z",
          "Titre": "Still Waiting",
          "Contenu": "I ordered 3 items on 6/2/20.  Two of the items arrived in about 2 weeks, which was a little longer than I would like, but was okay.  The last item (which was the main one I wanted) has still not arrived as of 6/23/20.  I called yesterday and was told an \"order is being put together\" for the supplier.  I'm not even sure what that means.  I assume that I will eventually get the item, but am unlikely to order from them again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Erickson",
          "Nb_Reviews": 1,
          "Date": "2020-01-11T22:54:39.000Z",
          "Titre": "I placed my order on 12/31/19 and 2…",
          "Contenu": "I placed my order on 12/31/19 and 2 days later before my order was processed you reduced the price of my buffer and I did not receive that discount. I was not told that I would have a back orderon some of the items I purchased, now my project will have to be delayed until all items are finally delivered. I also seen that the Tampico brush that I ordered was offered at a discount, which I did not receive.John"
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "Kit Chi Monita Leung",
          "Nb_Reviews": 2,
          "Date": "2020-02-07T02:59:25.000Z",
          "Titre": "I am disappointed the order was…",
          "Contenu": "I am disappointed the order was canceled by Clean Freak. Your web site did not indicate you did not have stock. You accepted the order and I paid.  That caused me a lot of trouble to search for new supplier.  You mentioned in your site there will be new stock on 1st March.  Why didn't you ask me if I want to wait for the next available stock but cancelled my order?  Could you give me the priority while you have the stock again?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Luis Melgar",
          "Nb_Reviews": 2,
          "Date": "2020-04-13T18:10:12.000Z",
          "Titre": "Email said 7-12 business days to ship…",
          "Contenu": "Email said 7-12 business days to ship and after a month I finally reached out to them and they told me that it would take another 2-4 weeks so I just asked for a refund. Only reason it isn't 1 star is because they still refunded me. Very poor communication though and did not set proper expectations. Will not be using them again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2021-08-16T20:21:41.000Z",
          "Titre": "Item not Fulfilled",
          "Contenu": "Item not FulfilledI tried to order a mop wringer and never received an email that it was getting shipped. I called CleanFreak 3 weeks after my order date with my order number to check in on it, but I had to leave a message. They quickly returned my call saying they would check the warehouse and then called me the next day to say it had shipped only to call me the following day to say that they couldn't source the product and that they would refund my order. It would've been great if they had tracked my order a little closer from the beginning and didn't need me to keep tabs on them."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Duc Truong",
          "Nb_Reviews": 1,
          "Date": "2019-03-01T15:56:50.000Z",
          "Titre": "I don’t like about shipping",
          "Contenu": "I don’t like about shipping, the day they came to delivery was rain day,so my wife told the shipper put the stuff inside the house, he left the outside and walk away then jump on the truck drove away, that is not how to do service, i would rather to figh the shipper, do business can not except that employee, i do like everything from Clean Freak,only one i don’t like is shipping service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kenneth Sanders",
          "Nb_Reviews": 1,
          "Date": "2019-02-25T21:08:46.000Z",
          "Titre": "There are a lot of machines that I…",
          "Contenu": "There are a lot of machines that I would like to buy from this company. but price comparison I've always found something the same for less, most companies give free shipping. But with this company you pay for shipping also and you don't have a choice of who brings it. The scheduled delivery is always change at least twice. You never really know when your product is coming"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James Bobo",
          "Nb_Reviews": 3,
          "Date": "2018-10-03T17:45:06.000Z",
          "Titre": "I thought I was getting a squeegee I…",
          "Contenu": "I thought I was getting a squeegee I could use. With a handle. Thr picture showed a handle. But it was just an insert to use if you already have the handle. And they can't sell you a handle, not a regular one, just a swivel style handle that I did not want in the first place. So my windows are still dirty and I am back shopping for a simple, large window squeegee. Not a simple thing to find, but who knew?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeff Beal",
          "Nb_Reviews": 1,
          "Date": "2019-04-02T22:25:30.000Z",
          "Titre": "Revealing my email address is not acceptable!",
          "Contenu": "I was unable to make an online purchase without revealing my email address. This is totally unacceptable. If clean freak wants any more of my business they need to fix the problem. The fact that I received an unsolicited email from Trustpilot illustrates the very reason I do not wish to give out my email address. Please do not reveal my email address to any one else. Please do not send me emails regarding any sales or promotions or for any other reason!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Josh Heath",
          "Nb_Reviews": 1,
          "Date": "2020-06-25T13:44:28.000Z",
          "Titre": "I am very disappointed with Clean…",
          "Contenu": "I am very disappointed with Clean Freak.  I ordered the square scrubber weeks ago.  I was initially told the product was in stock and now it is still not available and I am told july 10th.  This is the third time the date has been moved.  That is about all I can offer.  It is very disappointing..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 1,
          "Date": "2019-04-12T21:52:05.000Z",
          "Titre": "Delivery debacle",
          "Contenu": "I have no issue with the product. There’s a 7 hour window for delivery. Which is ridiculous. I requested them to call me an hour out from delivery. Which they agreed to. They called when they pulled up to the house. No one was there to receive the package. I’ve never experienced a delivery with as many shortcomings. Dissapointing"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jon Lorbacher",
          "Nb_Reviews": 1,
          "Date": "2019-10-30T21:45:45.000Z",
          "Titre": "Are Complete Orders Not a Thing Here",
          "Contenu": "It seems that there is consistently a problem in being able to get a full order of product in. This last time, I ordered 6 cases of Nyco OM1 Bath cleaner. I received part of 1 case, with the others on back order. The time before that, I also ordered 6 cases and it took several weeks to get my full order. And before that. It seems that I can never get the quantity I order in one shot, which is making it difficult to keep my teams supplied. This is particularly frustrating as you were the dealer recommended by Nyco."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rick Irwin",
          "Nb_Reviews": 1,
          "Date": "2019-08-08T22:38:33.000Z",
          "Titre": "Thank you for the free shipping on the…",
          "Contenu": "Thank you for the free shipping on the $400 vacuum, but charging $19.65 for shipping for $14.56 worth of vacuum bags is not acceptable. When I questioned you company about the shipping, I got the run around. I am not shopping with you again.Rick IrwinMaintenance DirectorMancos School District"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Julian Martin",
          "Nb_Reviews": 1,
          "Date": "2019-02-04T19:28:57.000Z",
          "Titre": "Your products are good quality but",
          "Contenu": "Your products are good quality, therefore I would not mind the high price as bad if it was not for the poor service. It seemed evident that The woman who helped me was not happy to help.  The product did not get here for several weeks.  I had not been informed that they needed to make the product yet."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Don Smith",
          "Nb_Reviews": 1,
          "Date": "2018-09-11T01:21:14.000Z",
          "Titre": "i ordered a new broom and there was…",
          "Contenu": "i ordered a new broom and there was nothing in the description stating it took a special handle.  I got the broom and my handle would not work.  I called and asked if they would pick up the fright on the handle as i was forced to order from them because i could not find one anywhere locally.   I was very politely told I would have to pay the freight.  So i paid the freight ($13.18) which was just a little less then the cost of the handle.  Oh well I like the broom and the handle just don't like the customer service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Scott Bryan",
          "Nb_Reviews": 1,
          "Date": "2019-09-02T17:34:05.000Z",
          "Titre": "I value full disclosure and they failed",
          "Contenu": "Very irritating to order this item, assuming since there was no indication it was not in stock/on back order, that it was in stock. Only to get an e mail a couple days later that it would arrive at their location in a week and be shipped at that time.  Will not use them again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "christopher weller",
          "Nb_Reviews": 2,
          "Date": "2018-06-01T18:06:41.000Z",
          "Titre": "The buffing machines/ high speed…",
          "Contenu": "The buffing machines/ high speed burnishers or the parts for the machines are made over seas.Had to wait 2 separate times, from the first date that they told me when the unit would be shipped. 1st time were out of motors, next time rubber bumper pad. Not real pleased with cleanfreaks."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dave Evans",
          "Nb_Reviews": 1,
          "Date": "2018-09-21T14:07:46.000Z",
          "Titre": "Don't expect quick delivery as promised",
          "Contenu": "When I ordered the unit, the salesperson said I would get it within a couple days. I called 3 days later to get update, Matt at CleanFreak said it wouldn't ship until 6 days after I ordered. He said they don't tell people \"a couple days for delivery.\""
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James Cooley",
          "Nb_Reviews": 3,
          "Date": "2020-08-14T09:54:48.000Z",
          "Titre": "It seems like lately every time I make…",
          "Contenu": "It seems like lately every time I make an order it is cancelled or items not sent. On my recent order I was shorted a 60\" dust mop frame but was sent the dust mop. Three weeks later I am still waiting for the dust mop frame to be sent."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Annoyed.",
          "Nb_Reviews": 1,
          "Date": "2018-06-01T16:40:20.000Z",
          "Titre": "3 days after ordering later received an…",
          "Contenu": "3 days after ordering later received an email that the product was back-ordered for several weeks. This should be easily tracked and managed so customers aren't finding out after purchase and especially 3 days after purchase."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bobby Phillips",
          "Nb_Reviews": 1,
          "Date": "2020-08-19T21:13:30.000Z",
          "Titre": "Very disappointed in the delivery",
          "Contenu": "Very disappointed in the delivery. I was lied to several times about the dates of delivery and my wand was missing from my order. Very bad service for the money I spent. They definitely need to do better."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kari Riley",
          "Nb_Reviews": 1,
          "Date": "2020-07-30T12:07:13.000Z",
          "Titre": "Customer Service not friendly",
          "Contenu": "Customer Service not friendly. We purchased a floor scrubbing buffer and it was delivered damaged. It was either a problem with the packaging or the shipping. We sent the damaged buffer back and received a new one in good condition. We also ordered a white tank for this machine and it has been on back order for over 2 months. I found one on Amazon and ordered it and received it the next day, so I cancelled the back order. Every time I called and spoke with Matt on the issues with my order he was very rude and not friendly. Matt did not know much about the products we purchased. It would have been nice to get an update on my back order item, I had to call each time to get an update and was spoke to very rudely each time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Steven Vilardi",
          "Nb_Reviews": 1,
          "Date": "2020-05-11T20:35:24.000Z",
          "Titre": "In mid april i placed an order of items…",
          "Contenu": "In mid april i placed an order of items with every item being listed as \"in stock\".  I have STILL not recieved the bulk of my order, and have had NO notification that the items were backordered as the website said it would do. The only way i found out my items were backordered was that i called to ask where my items were. I was then told the items were backordered until mid may, which i am also skeptical about. If the items were listed as \"out of stock\" like they should have been, i wouldnt have ordered them if i was going to have to wait 8 weeks to get them. Or if i had been notified that they were out of stock like your website said it would do, i would havent been expecting the items in a timely manner"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sherry Price",
          "Nb_Reviews": 1,
          "Date": "2020-05-06T12:43:32.000Z",
          "Titre": "Good product, but wrong sizes sent",
          "Contenu": "The products were great (boots for stripping floors), but I ordered 2 pair of medium and 1 pair of small.  Instead, I got 3 mediums.  Currently contacting CF to figure out return/replacement option."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "jeff",
          "Nb_Reviews": 7,
          "Date": "2018-06-04T04:08:50.000Z",
          "Titre": "I have had many problems with the…",
          "Contenu": "I have had many problems with the website. Especially if you forget your password and don't try to buy as a guest. And sometimes taking weeks to arrive. After paying 25. To 30$ in shipping"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "William  M. Webster, NY",
          "Nb_Reviews": 1,
          "Date": "2022-01-27T20:18:42.000Z",
          "Titre": "More than 2 weeks and still waiting.",
          "Contenu": "My order was placed on January 10th. It is now January 27th and the majority of my order has not shipped yet. Where's my stuff?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Zerkie",
          "Nb_Reviews": 3,
          "Date": "2020-11-27T18:46:21.000Z",
          "Titre": "First purchase  good price",
          "Contenu": "First purchase  good price. Was not told item was not available for 30 days. Had to purchase another item locally  to be able to continue cleaning.  jz."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "neal jones",
          "Nb_Reviews": 1,
          "Date": "2018-09-18T16:58:46.000Z",
          "Titre": "Still waiting for order",
          "Contenu": "Still waiting for order. Have no idea where it is or what's going on with it. I can tell it's going to be a hassle to get what I ordered. 😠"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 3,
          "Date": "2020-04-09T20:27:50.000Z",
          "Titre": "I ordered a boom head and 2 piece…",
          "Contenu": "I ordered a boom head and 2 piece handle. You shipped the handle and back ordered the broom head. What do I do with a handle without a broom head?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jodi Gorgas",
          "Nb_Reviews": 3,
          "Date": "2020-06-24T22:51:58.000Z",
          "Titre": "Orders came quick",
          "Contenu": "Orders came quick. Autoscrubber did not work. Had to send it to a small engine repair shop and have them fix it. Not very happy"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JOHN",
          "Nb_Reviews": 1,
          "Date": "2018-06-02T16:44:13.000Z",
          "Titre": "YOU DID NOT HAVE THE PRODUCT I NEEDED",
          "Contenu": "YOU DID NOT HAVE THE PRODUCT I NEEDED. ORIGINAL, UNSCENTED, FANTASIK CLEANING SPRAY. THE PURCHASE WAS REVERSED AND REFUND PROVIDED."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jose Ramirez",
          "Nb_Reviews": 1,
          "Date": "2019-08-13T22:32:59.000Z",
          "Titre": "The battery lasts only 40 minutes and…",
          "Contenu": "The battery lasts only 40 minutes and when I bought the vacuum they told me it lasted 76 more mutes and it is a big difference"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chris Clark",
          "Nb_Reviews": 1,
          "Date": "2020-04-22T01:31:31.000Z",
          "Titre": "Dissapointed",
          "Contenu": "I ordered a clean freak extractor on 3/16/2020. It came in about a week later & I was immediately disappointed in its quality. However, I told myself to give it an honest try...after using it a few times...I had multiple struggles with it. The sprayer tip had to be removed on day1 and readjusted...still not quite right but better than how the factory sent it out. The latch to secure the tanks together is just a poor pitiful design. The stainless tool is very bulky & uncomfortable to use compared to my previous Mytee Lite extractor. The suction/cleaning power just isn't adequate for me. So, in the past week I have called, left messages & sent an email attempting to return this item. NO RESPONSES BACK.....i cant fathom why a company of this size is operated so poorly. Customer service goes a long way & unfortunately this has been bad on both ends...Product&Service. The ONLY good thing about this whole experience, is the sweet young lady who helped me place my order via phone...she was very polite & accommodating. Order#: 500049498"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Paul Brown",
          "Nb_Reviews": 1,
          "Date": "2020-09-03T19:20:55.000Z",
          "Titre": "I was told the product was in stock and…",
          "Contenu": "I was told the product was in stock and then a week later I was told they couldnt get any stock. So I am not impressed!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Carolyn  Bolton",
          "Nb_Reviews": 1,
          "Date": "2018-09-13T15:13:22.000Z",
          "Titre": "I ordered a $1500 carpet extractor…",
          "Contenu": "I ordered a $1500 carpet extractor online on 9/4/2018. My order confirmation email indicated that the shipment would drop ship possibly taking 7-12 days to arrive. On 9/13/2018, I called CleanFreak to inquire about the status of that order. Speaking with customer service rep Matt (who was very polite), I found that our order would not ship until around 10/7/2018 (more than a month after order/payment) - because the manufacturer, Viper, was building the extractor AFTER order/payment and was waiting on parts. Our order will drop directly from Viper in Michigan once our unit has been built. I kindly let Matt know that better customer service would involve communicating with us (rather than me having to call him) to let us know that the promised terms of delivery weren't even remotely accurate. He apologized. But ... I've been in management ... and I know the problem is not Matt's but CleanFreak's. This ain't customer service folks. Sitting on our money for over a month with no communications and no order delivery. Very disappointed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeremy",
          "Nb_Reviews": 1,
          "Date": "2018-06-01T17:38:06.000Z",
          "Titre": "If your item is back ordered, good luck.",
          "Contenu": "5 weeks after my order and my item is still not here, and will not be here for at least three more weeks. I called them at the three week point and was told “that item is back ordered, and someone was supposed to reach out to you, but they didn’t.” It wasn’t until yesterday that I finally got the email stating the product was back ordered and they passed the buck onto their manufacturer. Super classy.No mention of stock status is anywhere on the website. Seems to me that in-stock status has been a part of most retail sites for a very long time. Had I known this particular item would be back ordered I wouldn’t have completed the order in the first place.Their phone agents are at least pleasant, but not service oriented. There was no apology, and no offer of further discounting or any other means of customer retention in the face of a severe delay that could have easily been solved with a few lines of code on the site, and/or an employee contact shortly after the order was placed.I had one previous order with them which was hassle free, but after this order they’ve lost me forever."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "DS",
          "Nb_Reviews": 1,
          "Date": "2020-10-15T18:53:23.000Z",
          "Titre": "Communication is key to good customer service.",
          "Contenu": "Communication is key to good customer service. I was first told 7-10 business days for shipping on my item. My $700+ item, by the way. After 15 business days, they said it would ship on 10/11, which is a Sunday. I inquired and then was told it would ship the week of 10/11, but rest assured I would get tracking numbers for my my item, which shipped in three separate boxes due to its size and weight. Out of the blue, I received a box. It was one of the three, but only one. I never received any emails or contact letting me know my order had shipped. I asked again, could they provide the tracking numbers for me? And they sent me the tracking number of the items I had already gotten. I can’t imagine this is difficult, (because it’s not) just to send along information once you know something is on a way to a customer who had just spent almost $1,000 in your site.. but it was. I sent a strongly worded email and suddenly I was provided with the other two tracking numbers. I’m still waiting for my items. I will never order from Clean Freak again. I hope my items work, because if ordering is this hard I can’t fathom how hard a return or exchange would be!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Armando W",
          "Nb_Reviews": 1,
          "Date": "2020-10-26T20:06:02.000Z",
          "Titre": "Call before you order",
          "Contenu": "As a first time purchaser. I think the website should notify you to call before you place your order. I had to call customer service twice to get my order shipped out. The first time I was told that my autoscrubber comes directly from the manufacturer with the pad driver that I ordered. I told the rep that my tracking details only showed the pad driver arriving. I was reassured that they come together and not to worry. When I received my package it was just the pad driver as the shipping details showed. I called customer service a second time and spoke to a different rep who looked into it. I was told I would be called back once they figure it out and that in the future I should call before placing an order to make sure nothing is back ordered. An hour after speaking to the rep I receive an email with shipping details for the auto scrubber with no estimated shipping date. I had to wait for the shipping company to call and schedule the delivery to figure out when I would receive my order. Also, orders can be shipped between 5-12 business days. Meaning it can take 3 weeks to ship and then another week to receive your package. Moral of the story? Call before you place an order every time!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "brad",
          "Nb_Reviews": 1,
          "Date": "2018-07-09T20:53:30.000Z",
          "Titre": "Damaged parts",
          "Contenu": "Damaged partsMissing partsNo instruction on assembly or cleaningFor the cost very disappointing"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Christopher Durham",
          "Nb_Reviews": 2,
          "Date": "2020-06-03T05:18:48.000Z",
          "Titre": "Shipment took too long to leave your…",
          "Contenu": "Shipment took too long to leave your facility and was in transit too long."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Concrete Cowboy",
          "Nb_Reviews": 1,
          "Date": "2020-03-05T23:22:35.000Z",
          "Titre": "The web store is extremely glitchy",
          "Contenu": "The web store is extremely glitchy. Quantities are always wrong."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ken Wilcox",
          "Nb_Reviews": 1,
          "Date": "2018-11-21T16:42:39.000Z",
          "Titre": "Ordered equipment 10/31/18 scheduled…",
          "Contenu": "Ordered equipment 10/31/18 scheduled delivery 11/28/18 REALLY?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Patrick",
          "Nb_Reviews": 2,
          "Date": "2022-03-02T12:09:01.000Z",
          "Titre": "Little information on Back Order"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": ":vvvvvvvbbbbbbbvvv",
          "Nb_Reviews": 1,
          "Date": "2018-07-05T02:35:27.000Z",
          "Titre": "Sale products and you don't have."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Troy Olson",
          "Nb_Reviews": 1,
          "Date": "2020-04-10T22:15:52.000Z",
          "Titre": "Still do not have the product"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Julian Willis III",
          "Nb_Reviews": 1,
          "Date": "2020-05-20T15:32:58.000Z",
          "Titre": "High shipping costs"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ohio",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T01:42:44.000Z",
          "Titre": "Product shipped in a timely manner",
          "Contenu": "Product shipped in a timely manner, but communication was not existent. Never received a response back about tax exemption and had to initiate communication with XPO to arrange delivery/pickup."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Melvin Mendoza",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T13:36:28.000Z",
          "Titre": "I give it three stars because they did…",
          "Contenu": "I give it three stars because they did not send me the product I requested on time and I had to wait too long."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T03:23:04.000Z",
          "Titre": "3gal non heated plastic vacuum head",
          "Contenu": "ordered new handle for non heated 3g extractor and it came with a small 8in hose attached 🤷🏻 makes no sense. Took my old one apart to try to interchange but its so damn cheap plastic broke🤬💥 Company reached out about this which shows me they care and with their help i have a different style hose and metal head ordered..thx guys and a shout out to Tim for his assistance"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dennis Fellows",
          "Nb_Reviews": 2,
          "Date": "2022-09-23T02:36:05.000Z",
          "Titre": "Feeling deceived after I spent a week looking at a floor…",
          "Contenu": "I spent a week looking at a floor scrubber. After pulling the trigger on the $1500 purchase I was notified it was back ordered for 1-3 weeks. Never saw this in the purchase process. Then after three weeks of waiting I initiated the conversation and they tell me another month. Now a total of 7 weeks out. Not real happy with this transaction and feel deceived."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dear Customer",
          "Nb_Reviews": 2,
          "Date": "2022-06-08T18:32:07.000Z",
          "Titre": "Not a very well experience so far with…",
          "Contenu": "Not a very well experience so far with CF. I received my unit about a month ago with an item missing. I've contacted customer service multiple times and no one can tell me where the missing is or when item will arrive. I had to purchase the item I need from a local retail store."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Martins",
          "Nb_Reviews": 1,
          "Date": "2023-06-24T13:56:06.000Z",
          "Titre": "The problem is I ordered a 17 inch…",
          "Contenu": "The problem is I ordered a 17 inch buffer carpet scrubbing brush with carpet glide on March 13th 2023 and received the item the first week in June 2023. It took almost three months to get. Other than that, the product works great"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Roy Rose",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T22:53:44.000Z",
          "Titre": "Ordered 3",
          "Contenu": "Ordered 3 - 10 Pack of Screens to sand hardwood floors, ordered 80, 120 and 150 grit. Received 60, 80 and 120 (I Think).I have hickory hardwood floors, very hard, therefore I’m going to used what I received and see what happens"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Timothy",
          "Nb_Reviews": 4,
          "Date": "2022-10-12T14:53:05.000Z",
          "Titre": "It seems as if no one at Clean Freak…",
          "Contenu": "It seems as if no one at Clean Freak fits the right size parts to the machines or parts that are ordered or a history of orders. I have to keep spending money to get the right parts that fit right on the machines I have purchased. I have parts sent to me that fit nothing and I paid for these parts because Clean Freak said they fit, yet they DO NOT. Not sure how much longer I am willing to do this."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tyrone Bowman",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T15:22:41.000Z",
          "Titre": "Communication was poor still waiting…",
          "Contenu": "Communication was poor still waiting for for the item I ordered"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "stephen",
          "Nb_Reviews": 4,
          "Date": "2022-04-02T14:50:59.000Z",
          "Titre": "Really good machine",
          "Contenu": "Really good machine, wand was cheaply made, spray trigger was VERY,VERY cheap and flimsy, will need upgrade. Strong extraction motors."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Team Kleen LLC",
          "Nb_Reviews": 3,
          "Date": "2022-12-04T03:42:10.000Z",
          "Titre": "I have some understanding about the…",
          "Contenu": "I have some understanding about the supply chain, it took 3 months to receive 1 piece of my order not so thrilled about this. It did all work out."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ana Zavala",
          "Nb_Reviews": 1,
          "Date": "2023-02-04T03:10:07.000Z",
          "Titre": "It was ok time wise only thing i didnt…",
          "Contenu": "It was ok time wise only thing i didnt like was my order was delivered in sections. Its been a week and i still have not received the vacumm."
        },
        {
          "Note": 3,
          "Lieu": "GT",
          "Pseudo": "Jorge Castaneda",
          "Nb_Reviews": 1,
          "Date": "2022-09-13T23:30:46.000Z",
          "Titre": "Product ship it do not was like the…",
          "Contenu": "Product ship it do not was like the picture in the adds,  was different and no good quality.sorry by that"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Otis Brock",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T15:48:21.000Z",
          "Titre": "Got 2 of the 3 switches I ordered",
          "Contenu": "Got 2 of the 3 switches I ordered. Still haven't gotten last one. It's been a month now."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "LINDA johnson",
          "Nb_Reviews": 1,
          "Date": "2022-02-22T12:07:17.000Z",
          "Titre": "Will continue to purchase from Clean Freak My order was placed on January 10th. It is now January 27th&713--234--6857 company line for a refund Will continue to purchase from Clean Freak. Will continu",
          "Contenu": "Will continue to purchase from Clean Freak.Will continue to purchase from Clean Freak. My order was placed on January 10th. It is now January 27th and the majority of my order has not shipped yet. Where's my stuff?he was quick to respond, knowledgeable about the content, and was able to make the necessary adjustment to make me a satisfied customer."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Wayne Avery",
          "Nb_Reviews": 1,
          "Date": "2020-11-16T19:53:14.000Z",
          "Titre": "Poor communication by customer service",
          "Contenu": "I ordered a piece of equipment from CleanFreak, a month later I’m still waiting… $2000 and I can’t use it because the order wasn’t properly filled. They’ve never contacted me with updates. When I call they tell me it’s coming in next week and it never does.Update: I change the one star to three. The customer service manager has tried to make things right. I appreciate that very much."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Derek Clotfelter",
          "Nb_Reviews": 1,
          "Date": "2021-07-20T22:01:26.000Z",
          "Titre": "You sold a product you didn't have in…",
          "Contenu": "You sold a product you didn't have in stock and after I paid, you let me know it will take 3-4 weeks... it was a real surprise! I called and you told me you didn't have stock of the product and the manufacturer would take that amount of time on shipping it. Very bad surprise."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rebecca Vitale",
          "Nb_Reviews": 1,
          "Date": "2020-09-10T20:59:58.000Z",
          "Titre": "We bought 2 buffer machines",
          "Contenu": "We bought 2 buffer machines, First they messed up the shipping address and sent it to Seattle, WA instead of Memphis, TN.  This put another week delay on the shipment.  Then when we unboxed one of the machines, the handle was completely broken in two.They did help us get a new part shipped out to us,and they credit back the shipping charge since they made the mistake.  Hence the 3 stars.The buffer is a beast though, and so far cleans our floors well."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steve P",
          "Nb_Reviews": 2,
          "Date": "2020-07-21T22:30:24.000Z",
          "Titre": "Shipping costs are too high.",
          "Contenu": "Shipping costs are too high.I bought a walk behind floor scrubber package. Also, the 17 inch floor buffer package. Their package deals are ok compared to others companies. However, the cost to ship their products to you is outrageous.  I ordered a Viper Shovel nose from another company and the cost was a lot less. $75 versus $180 or $213. If they get the Shipping cost down. They would get a 5 star. So far no issue with my purchase but it's only been a couple months."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jamie Brooks",
          "Nb_Reviews": 1,
          "Date": "2019-10-23T15:03:55.000Z",
          "Titre": "Delivery date not clear",
          "Contenu": "Delivery date not clear, vacuum was free shipping but was charged for shipping vacuum bags ordered on same order - Why not ship those together and have no charge for shipping?  When I called in for assistance on ETA for delivery, the gentleman on the phone was not particularly warm or customer service oriented.  Not saying that I wouldn’t order from you again, but I am saying that I was not necessarily impressed with the buying experience"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Daisy Alvarado",
          "Nb_Reviews": 1,
          "Date": "2018-10-22T16:59:24.000Z",
          "Titre": "I called on friday 10/18 to purchase a…",
          "Contenu": "I called on friday 10/18 to purchase a couple of machines, the guy on the other line seemed annoyed with his life to assist me with some questions and concerns. Though i was confused about exactly a machine i needed he didn't seem to want to help and i just felt stupid asking him anything. I will look for better customer service elsewhere from a vendor who is excited to take my money."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Spencer",
          "Nb_Reviews": 2,
          "Date": "2018-09-13T21:37:56.000Z",
          "Titre": "I ordered two products got one",
          "Contenu": "I ordered two products got one tracking number and assumed both items were shipping together. I found out the second never shipped when I revived the 1st. I called they asked for contact info and some time to figure it out; got back to me within an hour and they have since send out the missing item. Also the One item I did revive was broken on arrival but that seems to be manufacture problem not that of CleanFreak.com"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kevin Lee",
          "Nb_Reviews": 1,
          "Date": "2018-08-31T18:59:03.000Z",
          "Titre": "I had to call three times to get my…",
          "Contenu": "I had to call three times to get my password set up for an account so I could place an order. I don't understand why I couldn't have  the order placed over the phone to save some time instead of waiting 10- 15 min each time waiting on an email to setup an account to order, especially when I had 10 other orders to place with other vendors. My complaint time sensitive."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Parille",
          "Nb_Reviews": 1,
          "Date": "2018-07-29T15:02:57.000Z",
          "Titre": "For my first order I wanted to speak…",
          "Contenu": "For my first order I wanted to speak with a representative. Call it old school but I like to know who I’m spending money with.  For future purchases I would have used the online order form.  However the representative seemed irritated that I called rather than using the online option. In fact I had to explain myself why I wasn’t ordering online, which he wasn’t any less frustratied"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Julie Zett",
          "Nb_Reviews": 1,
          "Date": "2018-08-08T00:47:40.000Z",
          "Titre": "I spoke with their customer service…",
          "Contenu": "I spoke with their customer service representative to place my order and asked if I could receive my order in 3 days. She told me yes but it didn't happen. I had to drive to Fort Atkinson to pick-up my order after spending $110 on shipping. If I had known, I would have driven to Appleton to pick it up and saved myself the shipping charge. Doubt I will shop with them again unless I am desperate.Julie's Carpet Cleaning LLC."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anthony Burton",
          "Nb_Reviews": 2,
          "Date": "2019-01-12T19:41:31.000Z",
          "Titre": "Full Payment Received for a Partial Order!",
          "Contenu": "I recently discovered the CleanFreak corporation and placed a order, which was partially delivered. I currently have left a message and haven’t received any feedback.There is no indication that the remaining items were shipped separately, and I’m in limbo at this point. My plans to do the job was foiled. I’ll have to see what happens with this organization moving forward. Hopefully there will be some type of reasonable explanation for what happened to my remaining order."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Sickels",
          "Nb_Reviews": 2,
          "Date": "2018-09-27T14:10:50.000Z",
          "Titre": "Unhappy with communications, delivery timeframe.",
          "Contenu": "I ordered a replacement hose for a carpet extractor that I purchased from you a number of years ago.  I ordered the hose on the 19th.  It is the 27th and I just learned that the hose was not in stock and it is coming from the manufacturer.  I am now being promised a 7-12 day delivery.  Keep in mind, that Clean Freak's confirmation e-mail states that if a delay is going to occur, a customer support specialist will contact the customer.  I received no such contact."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tana Davis",
          "Nb_Reviews": 5,
          "Date": "2018-08-16T22:14:19.000Z",
          "Titre": "Unsure how to rate yet",
          "Contenu": "Not sure how to rate yet. Yesterday when ordering, I was told they had 36 in stock and would be shipped yesterday, and 3-4 days for delivery. As of now, I have no verification that it has shipped. But later yesterday got an email stating it could take much longer. If told that, I would never have ordered from them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Kettling",
          "Nb_Reviews": 1,
          "Date": "2018-10-14T04:50:29.000Z",
          "Titre": "Product ordered was fabulous",
          "Contenu": "Product ordered was fabulous, perfect fit to my machine. Website was not good to work with. Wouldn't recognize my shipping address no matter how many times I tried to get it in. So I left item in cart, called cust svc, they took order but also had difficulty with shipping address, related problems. Then I started getting item left in cart notices, nobody bothered to clear it when they took order on phone. Somebody needs to fix address lines in software. I've been in this house 4 yrs, should not be rejected."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Walt Stubblefield / Joe Bullard Ford",
          "Nb_Reviews": 1,
          "Date": "2019-03-29T18:03:12.000Z",
          "Titre": "Ordered our machine first of March and…",
          "Contenu": "Ordered our machine first of March and haven’t received it yet. Was tol 7-10 business days. I’m in the customer service business and understand back orders. The problem I have is that no one ever contacted me to let me know the progress of my order, I had to initiate the call each time"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "WilliamH",
          "Nb_Reviews": 1,
          "Date": "2020-10-01T00:25:48.000Z",
          "Titre": "Ordered 3 fans",
          "Contenu": "Ordered 3 fans , got 2 right away. Third took three weeks to get and had to make multiple calls to find out where it was. Would have been better if the would have called ME to let me know there was a delay an how long it was going to take."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Erica Hunt",
          "Nb_Reviews": 2,
          "Date": "2021-06-07T13:13:55.000Z",
          "Titre": "Love the Shatter'd 99 product",
          "Contenu": "Love the Shatter'd 99 product.  Usually order 2 cases at a time.   And never seem to get both delivered.  One is always \"lost.\"    Any possibility of banding/taping 2 boxes together for shipping??!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "charles f ankrom",
          "Nb_Reviews": 2,
          "Date": "2022-01-12T02:05:29.000Z",
          "Titre": "took over a month to get here and when…",
          "Contenu": "took over a month to get here and when i asked when will my order get here i was told it was a non stock item when i knew it was a stocking item because i bought it many times before !"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Andre Remmers",
          "Nb_Reviews": 1,
          "Date": "2020-04-22T13:35:11.000Z",
          "Titre": "Your products and equipment are good…",
          "Contenu": "Your products and equipment are good but whomever I spoke with on the phone  twice made sure that I won't ever order from you again.Just trying to get some information about pieces of equipment that hadn't arrived with the shipment I received but was told someone at my place should have checked everything before signing the packaging slip.Who assembles all of their equipment when a driver is waiting,  no one does and when i called i got a friendly lady on the phone but than was transferred to the most unprofessional and rude individual I ever met. I had to buy two items again and I would not recommend this company to anyone and would think twice before buying equipment from them"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Karen Conrad",
          "Nb_Reviews": 1,
          "Date": "2020-07-23T15:56:31.000Z",
          "Titre": "I'd rate my experience higher",
          "Contenu": "I'd rate my experience higher, but the trigger sprayers were backordered and when the expected arrival time had passed I emailed CleanFreak. That was more than a week ago and I haven't heard back."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bryan Wade",
          "Nb_Reviews": 2,
          "Date": "2020-06-28T02:26:04.000Z",
          "Titre": "Ordering and delivery was great",
          "Contenu": "Ordering and delivery was great, five minutes after we started using it one of the plastic levers on the handle broke, we have left messages with the manufacturer but we haven’t heard anything yet."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "jeff",
          "Nb_Reviews": 7,
          "Date": "2018-06-19T22:27:48.000Z",
          "Titre": "There search engine seems to just go on…",
          "Contenu": "There search engine seems to just go on a wild goose chase, I've been in the cleaning business for 30yrs. I know what I'm asking for. And they have most everything if you can find it!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jenna  Clos",
          "Nb_Reviews": 1,
          "Date": "2022-03-23T17:18:51.000Z",
          "Titre": "Not as sturdy as I was expecting and…",
          "Contenu": "Not as sturdy as I was expecting and one came in broken. I emailed and didn't hear back so I had to call. Still waiting on a replacement."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "M. Mc",
          "Nb_Reviews": 2,
          "Date": "2022-03-23T03:27:03.000Z",
          "Titre": "The heater came broken",
          "Contenu": "The heater came broken so I am still waiting on a part to be shipped. I hope to change the three star to a five star once I get it working."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "R. HAINES",
          "Nb_Reviews": 1,
          "Date": "2020-03-24T22:24:49.000Z",
          "Titre": "The product for sale wasn't available",
          "Contenu": "The product for sale wasn't available, or marked as such. I placed the order only to find this out. The payment was refunded quickly ,which is appreciated."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cheryl Lockhart",
          "Nb_Reviews": 2,
          "Date": "2020-05-22T19:20:58.000Z",
          "Titre": "The towlets are not very moist",
          "Contenu": "The towlets are not very moist. You might be able to do something if you use several towelets to disinfect one thing. You can definitely smell the alcohol."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bill L",
          "Nb_Reviews": 2,
          "Date": "2019-05-13T13:43:14.000Z",
          "Titre": "Mixed emotions",
          "Contenu": "The ordering was great. I got the package relatively quickly, but the part seems like it won’t work. I’m aftaid to give it to my customer"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Andrew",
          "Nb_Reviews": 2,
          "Date": "2020-10-22T16:07:26.000Z",
          "Titre": "Good prices and value on name brand…",
          "Contenu": "Good prices and value on name brand items.  Long ship times however, with no communication as to why, until I reached out to ask."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "caroline yuen",
          "Nb_Reviews": 1,
          "Date": "2020-04-21T23:07:32.000Z",
          "Titre": "my problem is it took a long time to be…",
          "Contenu": "my problem is it took a long time to be delivered to me otherwise it is a good product to use .and they always answer to my emails."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "jeff",
          "Nb_Reviews": 7,
          "Date": "2019-10-31T22:36:13.000Z",
          "Titre": "I ordered the aqua 27in",
          "Contenu": "I ordered the aqua 27in Pads and they will leave blue marks on high spots. No other brands have done this to me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Simmons",
          "Nb_Reviews": 1,
          "Date": "2020-12-15T17:30:52.000Z",
          "Titre": "This machine works good I had a rug…",
          "Contenu": "This machine works good I had a rug doctor before this one and I think it picked up a little bit better"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chung Liang Shen",
          "Nb_Reviews": 1,
          "Date": "2020-05-28T20:09:57.000Z",
          "Titre": "Poor customer service.",
          "Contenu": "I wrote an email to the customer service on May 21st, and yet I don't get any response till now."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Elbachir Fannane",
          "Nb_Reviews": 1,
          "Date": "2020-07-05T04:03:58.000Z",
          "Titre": "Low quality product",
          "Contenu": "Low quality product, machine not good for tiles, did work for carpet , but the brush worn out fast."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "jeff",
          "Nb_Reviews": 7,
          "Date": "2020-11-21T00:21:12.000Z",
          "Titre": "They always send half the order at a…",
          "Contenu": "They always send half the order at a time, and I wait another week or so to get entire order"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 2,
          "Date": "2019-10-25T01:36:14.000Z",
          "Titre": "shipping time for a small part  toke…",
          "Contenu": "shipping time for a small part  toke two weeks--  plus on shipping opinions"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cathy Riske",
          "Nb_Reviews": 1,
          "Date": "2020-05-01T04:24:03.000Z",
          "Titre": "The bathroom tissue has arrived",
          "Contenu": "The bathroom tissue has arrived,  but still waiting for the paper towels."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "willie hogan",
          "Nb_Reviews": 1,
          "Date": "2021-05-19T14:57:17.000Z",
          "Titre": "i still haven't recived the floor…",
          "Contenu": "i still haven't recived the floor scrubbing pads box of 5"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brian Zortman",
          "Nb_Reviews": 1,
          "Date": "2019-12-31T14:43:25.000Z",
          "Titre": "Took 4 days to ship a single item",
          "Contenu": "Took 4 days to ship a single item. That's pretty pathetic."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stedmon  Grayson",
          "Nb_Reviews": 1,
          "Date": "2020-03-27T21:40:24.000Z",
          "Titre": "Jus hate I order a machine and can’t…",
          "Contenu": "Jus hate I order a machine and can’t make it to a heated one"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dan Billingham",
          "Nb_Reviews": 1,
          "Date": "2019-12-03T17:18:21.000Z",
          "Titre": "My name is Daniel Dillingham",
          "Contenu": "My name is Daniel Dillingham, how do you think you did?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kenneth Henry",
          "Nb_Reviews": 1,
          "Date": "2020-03-23T21:12:50.000Z",
          "Titre": "heb took my delivery slot away while I…",
          "Contenu": "heb took my delivery slot away while I was shopping..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rick Milner",
          "Nb_Reviews": 1,
          "Date": "2018-08-06T14:20:15.000Z",
          "Titre": "CUSTOMER SERVICE FOR QUESTIONS AND…",
          "Contenu": "CUSTOMER SERVICE FOR QUESTIONS AND ORDERING NOT STRONG"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anthony Funkhouser",
          "Nb_Reviews": 2,
          "Date": "2020-07-11T20:46:09.000Z",
          "Titre": "Fast shipping but products are very…",
          "Contenu": "Fast shipping but products are very expensive!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Luke Marano Jr",
          "Nb_Reviews": 1,
          "Date": "2020-02-27T11:21:53.000Z",
          "Titre": "Product not available."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michelle Cooper",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T21:45:21.000Z",
          "Titre": "Good Machine",
          "Contenu": "Our old machine died and the tech department was helpful, however the machine was not fixable.  Customer service was helpful in getting us a new one."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T03:32:25.000Z",
          "Titre": "Offer is shipped on time and received…",
          "Contenu": "Offer is shipped on time and received in good condition, but have not used it yet."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dr. T",
          "Nb_Reviews": 2,
          "Date": "2023-04-27T02:21:40.000Z",
          "Titre": "2,800 CFM fan NOT 2,800 CFM",
          "Contenu": "I ordered a fan that was advertised as doing 2,800 CFM.  When I measured the air flow I got about 1,000 CFM.  I don't think it was their problem.  I think it was the labeling by the fan manufacturer.  Anyway, I contacted them and they agreed to a full refund including shipping. Based on their professionalism and customer orientation, I give them 4 stars.  I would go back to them again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Danny Pena",
          "Nb_Reviews": 3,
          "Date": "2023-03-22T16:04:13.000Z",
          "Titre": "Our scrubber came in on time we were… yes it did was the wrong one in fact came a day early",
          "Contenu": "Our scrubber came in on time we were all excited, when we open the box our excitement turned in to disappointment when we saw the cord we ordered a battery. We got on the phone with customer services. She looked up the order saw the mistake, was so understanding and apologizing and started the return process. That machine was picked up now we wait for our battery scrubber."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ryan Of Maryland",
          "Nb_Reviews": 1,
          "Date": "2022-04-05T16:43:44.000Z",
          "Titre": "Great machine, junk accessories",
          "Contenu": "So, the machine works great. Great heat, great general functionality. The accessories are a disaster. The cheap pressure hose literally came loose of the fitting in its first ten minutes of use. The wand is equally cheap, essentially the lowest quality wand available and not very functional. So be prepared to shell out another $500 to get a proper hose and usable upholstery tool.The reality is, everybody is going to send you fairly garbage accessories, so I’m still pretty happy with the value and function of the purchase, but it’s good to be aware of what’s coming."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Raymond Bowleg",
          "Nb_Reviews": 1,
          "Date": "2023-02-07T18:39:32.000Z",
          "Titre": "Hey Guys",
          "Contenu": "Hey Guys, Ray here, I wanted to say thank you for your quick response taking care of my purchase and for your professionalism. The machine does as advertised, No complaints, used your product once and have nothing to mention yet. Looking forward to trying more products from Clean Freak in the future. Thanks again and have a good day."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "GEORGE WADE",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T02:19:09.000Z",
          "Titre": "2 issues otherwise okay",
          "Contenu": "I purchased a solution tank for my rotary floor machine.  The solution delivery mechanism is too tight to deliver the solution and then shut off. This causes all the water in the tank to run out onto the floor. A big problem. I also bought a small extractor which came with a hand tool.  The opening of the hand tool is a series of small holes. These trap hair and fibers in the opening.  I have to disassemble the tool (6 screws) to clean it after each use.  Again, another problem. Any suggestions?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "George Laredo",
          "Nb_Reviews": 2,
          "Date": "2023-05-15T22:44:32.000Z",
          "Titre": "Little expensive shipping",
          "Contenu": "Everything good just shipping sometimes is expensive I bought 2 gallons of extractor care for $$45 dlls but the shipping is almost 30 dlls more almost same value as product :("
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alfred Parker",
          "Nb_Reviews": 1,
          "Date": "2022-08-09T20:21:10.000Z",
          "Titre": "My first experience was great package…",
          "Contenu": "My first experience was great package ordered actually arrived ahead of schedule. Everything was just what I thought it would be. I will definitely keep ordering thru you guys. Thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Teresa",
          "Nb_Reviews": 1,
          "Date": "2022-10-10T22:50:31.000Z",
          "Titre": "Better than what I expected for…",
          "Contenu": "Better than what I expected for stripping floors...I purchased the \"Trusted Clean 'Quench' Wet Push Vacuum-18 gal\" and was skeptical because there weren't enough pictures when I checked it out online.I honestly don't know what the struggle was when putting it together since another coworker did that for me.The reason why I gave it 4 stars instead of 5 was because the instructions weren't that great. The one I found said what to do but what good was that when I didn't know the terms of each part. I just did a quick youtube video on one that was similar, and it was easy after that.I will say it's a little hard to kick up the front squeegee part but it's no big deal. It was very easy to empty. I detached the back hose and ran water in the machine to make sure everything was all cleared out."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lansdale Lucas",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T22:10:39.000Z",
          "Titre": "Great Service/Great Products/High Shipping Cost",
          "Contenu": "Shipping cost was high in my opinion. Others vendors offer free shipping beyond a certain price point but other than that my experience was great!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas Bauer",
          "Nb_Reviews": 3,
          "Date": "2022-08-11T00:36:54.000Z",
          "Titre": "The order took longer than expected",
          "Contenu": "The order took longer than expected, however communication on delivery time was excellent. With that said, the wait was worth it. Took 3 years to find a source for the product that I ordered"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Schialdone",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T21:13:53.000Z",
          "Titre": "I did a lot of research on this unit…",
          "Contenu": "I did a lot of research on this unit and found it to be the best price I got. The extra 5% paid for the shipping. I was a little disappointed in the size of the extractors handle. It would be nice if there was a mini to get in the smaller places. I did the carpeting on a GMC terrain and found I couldn't get into the tighter places. The seats worked well.\\ Overall I think the unit will be fine."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe Abell",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T01:23:43.000Z",
          "Titre": "Product arrived in good condition",
          "Contenu": "Can’t wait to use the buffer, burnisher and wet vac on our floors. We have a school that uses our church and we need these items. They will soon be out for Christmas break and we can give the floors the attention they need. The items arrived in great condition and look great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Aaron Cunningham",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T20:33:08.000Z",
          "Titre": "Fast shipping and great customer service.",
          "Contenu": "The vacuum we ordered arrived quickly. Unfortunately, it was damaged when it arrived, but the customer service was excellent and we got the new parts we needed to get the vacuum up and running."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Iva Pfeifer",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T19:01:47.000Z",
          "Titre": "Economical and Expedient",
          "Contenu": "Thank you for providing an economical option for purchasing equipment for my small janitorial business. The delivery to my driveway is appreciated especially when you are not charging me extra for delivery!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Debra Roethemeyer",
          "Nb_Reviews": 1,
          "Date": "2022-08-05T15:47:33.000Z",
          "Titre": "Needs weights for dry stripping",
          "Contenu": "The machine is quite heavy, it needs weights for dry stripping, it is hard to control when the stripper in on the floor and the solution sprays out the sides onto the wall. I am very happy with the machine though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 3,
          "Date": "2022-04-05T22:05:37.000Z",
          "Titre": "This scrubber was delivered timely and…",
          "Contenu": "This scrubber was delivered timely and easy to setup and use. Works great in my farm shop getting the dust off the floor. Cord was not troublesome during use just worked away from the outlet and it was never really in the way"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff Anderson",
          "Nb_Reviews": 2,
          "Date": "2023-02-17T23:29:33.000Z",
          "Titre": "There was a little confusion on one Of…",
          "Contenu": "There was a little confusion on one Of the parts I ordered but we managed to get everything correct and all the parts are now installed and working great for me. Thanks for your help"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donald Lercher",
          "Nb_Reviews": 1,
          "Date": "2022-03-30T16:17:34.000Z",
          "Titre": "Customer service was great to the time…",
          "Contenu": "Customer service was great to the time to answer my questions before I made a purchase of their products! Will be doing more business with them in the future!Thank you,Don"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Yolanda T.",
          "Nb_Reviews": 1,
          "Date": "2022-08-16T00:54:36.000Z",
          "Titre": "The products were shipped in great…",
          "Contenu": "The products were shipped in great timing and were packaged very well for there being so many on a pallet. The pricing was fair. Have yet to use any so can’t rate quality of machine or products at this time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Logan Weaver",
          "Nb_Reviews": 1,
          "Date": "2022-03-25T22:03:43.000Z",
          "Titre": "COVID Strikes Again - Happy Ending Though!",
          "Contenu": "I ordered 3 times from CleanFreak.com for my carpet cleaning business.My first order was placed with items missing when I checked out which would've resulted in me paying extra shipping. Jessica was very helpful and was able to quickly process my refund so I could submit the correct order.My second order was placed correctly, however the vendor was VERY delayed on the manufacture of their machines. This lead to communication issues between the manufacturer and CleanFreak which made it difficult to communicate to me the ETA of the delivery. I ended up having to cancel my order 8 weeks later so I could place an order for an in stock machine.This lead to issues in processing the refund for the items that were not shipped. The refund was processed quickly but incorrectly. Despite this, a quick email to explain I was missing part of the refund, and the remainder was refunded to me.The third order was for a buffer only to hopefully accomplish what the previous two orders should have. I can not say enough how awesome this order went. I ordered the buffer for a good price, paid a little higher on shipping than I wanted, however the shipping was VERY fast and the machine was delivered best freight the next week (roughly 4 business days). Despite the intial trouble, I am so pleased with the final order as I heard this is how its supposed to go from other CleanFreak customers. I am very happy with the service and assistance throughout the entire process, and will order from CleanFreak again when I need to restock my supplies.Big thanks to Jessica and Kathryn for their patience, responsiveness, and excellent assistance through the process."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Frank Hanig",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T00:36:58.000Z",
          "Titre": "The service after the sale made it a…",
          "Contenu": "The service after the sale made it a stress free experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Keonta Wallace",
          "Nb_Reviews": 1,
          "Date": "2022-11-01T17:12:49.000Z",
          "Titre": "Great deals and customer service",
          "Contenu": "Great deals and customer service. Products are of the highest quality as well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Derek Hansen",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T00:41:58.000Z",
          "Titre": "Delivery took 3 weeks from date of…",
          "Contenu": "Delivery took 3 weeks from date of purchase. Which seems like a long time"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike Micek",
          "Nb_Reviews": 1,
          "Date": "2023-05-06T15:46:12.000Z",
          "Titre": "Great Product",
          "Contenu": "Product came as advertised and works great"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Silberman",
          "Nb_Reviews": 1,
          "Date": "2022-08-11T05:19:02.000Z",
          "Titre": "I like the product",
          "Contenu": "I like the product. If You don’t hear from me that means I’m a happy customer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "kyle",
          "Nb_Reviews": 1,
          "Date": "2022-01-17T21:21:15.000Z",
          "Titre": "We bought a automatic floor scrubber…",
          "Contenu": "We bought a automatic floor scrubber package , after we finally got the unit ordered everything went well, tried it for the first time today it works nice . I wish instructions for set up were better , thanks to YouTube we got it figured out . The only other thing we had to send other info to get tax exempt status . But when we saw the shipping papers tax was still applied . Hoping for many good years of service . Thanks !"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "BRUCE MCNEIL",
          "Nb_Reviews": 1,
          "Date": "2020-09-24T15:20:43.000Z",
          "Titre": "Pleased that i purchased this upright vacuum",
          "Contenu": "So far so good. Competent working upright. Works much better than off the shelf vacuums found in department stores. Necessity improvements needed: much longer stretch hose, improved suction at side edges of vacuum head, some type of lighting at front and sides of vacuum head. Pleased that i bought this unit. Lets give it 9 months then elaborate again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Danny Beeler",
          "Nb_Reviews": 1,
          "Date": "2020-02-25T13:19:55.000Z",
          "Titre": "I have used Clean Freak for over 10…",
          "Contenu": "I have used Clean Freak for over 10 years and do like your product and services as well.. however, you keep sending my supplies to my former address even though my current address shows on the original order.. I had to drive to my former home and pick up my supplies again..  I pay to have it delivered to My house ...Thank you Danny Beeler"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Holloman",
          "Nb_Reviews": 1,
          "Date": "2020-02-20T13:48:14.000Z",
          "Titre": "The Viper floor scrubber machine was…",
          "Contenu": "The Viper floor scrubber machine was easy to use and did a great job cleaning our indoor pickleball courts.  We have concrete base with 9 layers of rubber and 3-4 layers of acrylic paint on top. The vacuum system component did  a great job sucking up the water. Very impressed with the unit. Richard Hollloman 910-352-1658 cell"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MJ",
          "Nb_Reviews": 1,
          "Date": "2021-09-08T03:46:21.000Z",
          "Titre": "The machine was very well packed in a…",
          "Contenu": "The machine was very well packed in a wooden crate.  The supplies which came with it suffered along the trip.  Most of them were missing.  The ones which did ship, arrived in damaged boxes.  All were okay except one gallon of cleaner which leaked on all the other boxes.  When calling the CleanFreak number on the BOL, I reached the private cell phone of an employee.  He was a little surprised by how I got his number but was very helpful in getting the remainder of the products to us and replacing the one which was damaged. He took care of it very quickly and remained in contact throughout the process."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TC",
          "Nb_Reviews": 3,
          "Date": "2021-07-31T01:55:09.000Z",
          "Titre": "Sent me someone else's order but after…",
          "Contenu": "Sent me someone else's order but after a couple days of emails and calls got it taken care of. This was only the second time ordering from them. First time they said item was in stock but then as soon as I pay it's not. They never email when your order ships like they tell you they will so you never know when to expect your order. I got my orders over a month ago and in my account with them they still say preparing so 1 ⭐ for communication. I give them 4 ⭐ over all because they did resolve the receiving The wrong order situation pretty quick at no additional cost or hassle to me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Crumb's LLC",
          "Nb_Reviews": 1,
          "Date": "2019-06-05T01:45:13.000Z",
          "Titre": "Would have given a 5 star had there…",
          "Contenu": "Would have given a 5 star had there been more communication during the shipping process. I received the freight quickly at a superior savings and thoroughly enjoyed my dealings with clean freak. However because they are a distribution network or third party they are missing the element of communication to the customer. Overall, I highly recommend"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kimberly  Epperson",
          "Nb_Reviews": 1,
          "Date": "2019-09-24T18:12:09.000Z",
          "Titre": "Door pod and refills, hand soap, & microfiber towels",
          "Contenu": "I like the door pod, but the smell hasn’t lasted a month. I haven’t tried the eco friendly smell yet, just the other smell. For my hand soap I ordered some kind of sweet sounding flavor, well the name sounded like it smelled sweet. The name of the hand soap doesn’t match the actual smell of the hand soap. I would have purchased a good smelling hand soap instead, however, the price was a good deal for the quantity.  I like the size and price of the microfiber towels also."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Honest Abe",
          "Nb_Reviews": 1,
          "Date": "2020-02-15T19:21:46.000Z",
          "Titre": "Great products",
          "Contenu": "Great products. Prices are ok, but when you have to pay for shipping and taxes, the price shifts into the higher end a bit. I think you should put more thought into your superstar customers, as opposed to just offering generic coupons/discounts. The free gift is a nice gesture, but I’d rather receive a 25% off my next item, free shipping on all items, or something along those lines for spending thousands dollars with CleanFreak. Again, love the site and products, I don’t love the rewards program."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrew Olsen",
          "Nb_Reviews": 4,
          "Date": "2019-09-24T17:41:45.000Z",
          "Titre": "Received  product fast",
          "Contenu": "Received  product fast, the 24 inch sweeper. It works fine but not the best at getting fine dust picked up. The vibrator that automatically goes off to remove dust from the filter, does it at random and makes a mess on the floor while using, but overall does nice job on bigger debris picking it up."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Garith Smith",
          "Nb_Reviews": 1,
          "Date": "2020-02-11T19:08:30.000Z",
          "Titre": "This machine is awesome",
          "Contenu": "This machine is awesome! very user friendly, gets the job done. The only thing that I would improve on is the method of draining the  reservoir tank. It does not completely empty the dirty water out. When you start up for another cleaning task, you get an odor for the first 10-15 seconds."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sue Etienne",
          "Nb_Reviews": 1,
          "Date": "2019-11-27T21:24:39.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "The order process was easy for the item i wanted, but for some reason FedEx decided to return the product to sender without an explanation.  Once I advised CleanFreak, they went to the vendor and had the item shipped immediately and it was received in good time.  Thank you for your help."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sal Ukani",
          "Nb_Reviews": 1,
          "Date": "2019-12-17T16:27:15.000Z",
          "Titre": "Overall positive experience",
          "Contenu": "Overall positive experience. I would've given 5 stars, however, I deducted a star because I didn't get a confirmation email, or any info on shipping of my order. It seems that's only available if you sign up with the site and didn't check out as a guest."
        },
        {
          "Note": 4,
          "Lieu": "PK",
          "Pseudo": "Yaser Ranjha",
          "Nb_Reviews": 6,
          "Date": "2021-04-12T09:54:54.000Z",
          "Titre": "It was really successful when I…",
          "Contenu": "It was really successful when I discovered this online service. I was very impressed with that, but because of its low quality favours, I'm going to buy from here and never use any service, but if quality goods are available here."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kevin  Crist",
          "Nb_Reviews": 1,
          "Date": "2019-12-25T19:30:57.000Z",
          "Titre": "We ordered a 17\" commercial size floor…",
          "Contenu": "We ordered a 17\" commercial size floor buffer for our home based Cattery business. We used it on our carpet, tile and hardwood floors. I must say, it does an outstanding job. It takes a bit of finesse to control the buffer. But once you have that, it's easy and let it do its job. The only complaint I have of the machine is. When you fill the external tank full of cleaning solution. Changing the buffer pad out is a 2 person job. There is no lid on the tank, therefore, when you lay it down to change the buffer pad. YOU will make a mess. Other than that issue, it's a 5-star product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anthony Clay",
          "Nb_Reviews": 1,
          "Date": "2018-10-22T18:06:27.000Z",
          "Titre": "New Receptionist (?)",
          "Contenu": "Once I receive product I might upgrade to 5 stars. But the customer service was like trying to peel a mushy avacado! Couldn’t really get a conversation started with the man that answered the phone!  So I’m hoping the product is more lively than he was! JS!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Crispin Aragon",
          "Nb_Reviews": 1,
          "Date": "2021-03-18T19:28:59.000Z",
          "Titre": "how satisfied I was with my purchase .",
          "Contenu": "the machine I ordered was the right size that I was looking for not too big or to small and seems to be working ok . so far I'm satisfied with my purchased.ordering it was very difficult to do it did not want to except my mailing address the web sight has some issues. also from the time they took my money out of my account it took a very long time to ship my machine and products to me .They also chose a different carrier than the one I chose i chose ups but they shipped it by R&L Carriers .But when my order finally was delivered to me it was package really great and the delivery person was very friendly and new his job well.so I'm very satisfied with my purchase ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ron Berry Ron Berry",
          "Nb_Reviews": 2,
          "Date": "2018-09-14T17:08:44.000Z",
          "Titre": "The company was great real quick to…",
          "Contenu": "The company was great real quick to process the order and get it delivered. I had to use the chat feature to ask questions and very easy to use and courteous. I am not sure the quality of the product just yet as I started using it"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gerardo Mora",
          "Nb_Reviews": 1,
          "Date": "2019-07-30T19:24:30.000Z",
          "Titre": "Delivery",
          "Contenu": "Only issue I has was with delivery. Once the driver brought my carpet extractor to my building he wanted to charge me $50 to use his lift gate. My ticket says Freight terms are prepaid so not sure why he wanted another 50."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Bannister",
          "Nb_Reviews": 1,
          "Date": "2019-07-08T16:02:52.000Z",
          "Titre": "Very easy purchase",
          "Contenu": "Very easy purchase, great selection, and a rep reached out to me in regards to my purchase. I do wish the machine had an arm to lift the brush in instances where I would just like to use the squeegee portion."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Albert Valdez",
          "Nb_Reviews": 2,
          "Date": "2021-05-11T21:10:50.000Z",
          "Titre": "The item I purchased was supposed to…",
          "Contenu": "The item I purchased was supposed to come assembled. I was told that the only thing I would need to attach is the pad driver. Not true at all.  Further, when I notified the company about this via email, they didn't respond. (Update: They did respond after I posted this review). Please note, the above was my original response. Since that time, the company contacted me and explained that this item used to come assembled, but now comes with the handle detached. And for the inconvenience, they offered me a $100 refund or $100 worth of products. Great deal. They also directed me to a video which explains assembly. Additionally, they directed me to the nearest store in order for someone to help with the assembling. They did their part to resolve this issue, and I commend them for that."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe Cox",
          "Nb_Reviews": 1,
          "Date": "2020-05-18T21:13:48.000Z",
          "Titre": "Good so far",
          "Contenu": "Good so far. Been using the machine full time for a few weeks and is showing no signs of letting up. Nervous about the quality of plastic used for some of the components but so far, no complaints."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kendall Cummins",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T20:17:29.000Z",
          "Titre": "It went well",
          "Contenu": "It went well, no problems"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shaunna Lewis",
          "Nb_Reviews": 1,
          "Date": "2019-08-06T18:38:18.000Z",
          "Titre": "Taylor was a big help on this last…",
          "Contenu": "Taylor was a big help on this last order.  However, Matt came across as a little snarky on the phone.  The products are good and we will continue to use clean freak for our floor care needs."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gary  Elson",
          "Nb_Reviews": 1,
          "Date": "2020-04-07T20:07:07.000Z",
          "Titre": "You did what I expected I knew your…toilet paper order",
          "Contenu": "You did what I expected I knew your shipment was going to take awhile when I ordered it but you kept In touch answered all my questions.  It arrived like you said it would thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Greggory Donohoo",
          "Nb_Reviews": 1,
          "Date": "2019-02-21T16:26:32.000Z",
          "Titre": "would like a little more detail for a…",
          "Contenu": "would like a little more detail for a hyperlink for shipment tracking, also an estimated ship date when you place the order would be more competitive in the online marketplace."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brittany Twisters",
          "Nb_Reviews": 1,
          "Date": "2021-09-02T23:12:17.000Z",
          "Titre": "I was recommended an item from…",
          "Contenu": "I was recommended an item from CleanFreak for our commercial bathrooms and ended up purchasing a few different items. The items seem to be working and smell great but there seems to be an issue internally. I originally never received a confirmation order and placed an order on July 29th. I called on August 18th to check on my order since nothing had been shipped or confirmed. I called to check in and they had my order in process and realized half of the order was shipping direct from the manufacturer and some things were out of stock. I finally received half my order about a week after speaking to someone in customer service on the 18th and then finally received the rest of the order on September 2nd. I know this is sort of out of the company's control but I was in limbo for a while without any information. At this time I will continue to purchase products from CleanFreak because they seem like they are working well for what we need."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2019-03-07T02:47:28.000Z",
          "Titre": "They didn't actually stock the item and…",
          "Contenu": "They didn't actually stock the item and had to have it shipped from another supplier, so it took a little extra time but the product was just what we needed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Demetrius Golddee Belcher",
          "Nb_Reviews": 3,
          "Date": "2022-06-04T02:07:57.000Z",
          "Titre": "Nice",
          "Contenu": "Service is good"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ROBERT HALL",
          "Nb_Reviews": 2,
          "Date": "2021-07-02T01:08:12.000Z",
          "Titre": "Frustrated a little",
          "Contenu": "No one has contacted me about my square sander and I have been very patient even while losing money cause I dont have my equipment."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel Richard",
          "Nb_Reviews": 5,
          "Date": "2019-08-19T22:15:09.000Z",
          "Titre": "Other than some back ordered bonnets",
          "Contenu": "Other than some back ordered bonnets, we have been very, very happy with all things ordered from Clean Freak...great products....great prices!!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "3C’s, llc",
          "Nb_Reviews": 1,
          "Date": "2020-04-12T18:54:35.000Z",
          "Titre": "Great product",
          "Contenu": "Purchased 4 gallons of wax and worked beautifully on hardwood floors.  Very happy with product would have given 5 stars if free shipping."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Bramble",
          "Nb_Reviews": 1,
          "Date": "2020-01-07T00:58:25.000Z",
          "Titre": "Very fast delivery of floor machine I…",
          "Contenu": "Very fast delivery of floor machine I ordered. Driver notified me when he would be at my location and helped me with unloading it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kip Dugal",
          "Nb_Reviews": 4,
          "Date": "2022-01-29T15:24:07.000Z",
          "Titre": "Shopping and shipping experience was…",
          "Contenu": "Shopping and shipping experience was great. I wish the pricing could do better, or subsidize the shipping."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sebastian Forero",
          "Nb_Reviews": 1,
          "Date": "2021-05-24T19:47:02.000Z",
          "Titre": "Works pretty good",
          "Contenu": "Works pretty good! The only thing I would change is the way you empty the dirty water, but it’s a great extractor."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jose Duran",
          "Nb_Reviews": 1,
          "Date": "2018-08-30T12:36:57.000Z",
          "Titre": "thank you it was great.",
          "Contenu": "thank you it was great.the only thing is that I did not find one part for a single jet wand I was lokinfor. the sprayer end."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael DiAntonio",
          "Nb_Reviews": 1,
          "Date": "2019-08-13T16:36:29.000Z",
          "Titre": "Everything went great",
          "Contenu": "Everything went great.  Just keep getting emails about emptying my shopping cart after my purchase was completed and sent."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dawn H",
          "Nb_Reviews": 2,
          "Date": "2020-07-29T17:56:14.000Z",
          "Titre": "Everything great",
          "Contenu": "Everything arrived in tact, in less than a week.  No defective products.  All cans were good to go."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul Bisbee",
          "Nb_Reviews": 1,
          "Date": "2019-01-25T23:09:44.000Z",
          "Titre": "so far its been great i just started…",
          "Contenu": "so far its been great. I just started working with you guys I am looking forward to a long partnership."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Peter Smith",
          "Nb_Reviews": 1,
          "Date": "2020-05-20T19:35:18.000Z",
          "Titre": "I would give a 5 star just the timing…",
          "Contenu": "I would give a 5 star just the timing in which I received the product, the product itself is great!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ShaunieC",
          "Nb_Reviews": 5,
          "Date": "2020-06-13T19:03:37.000Z",
          "Titre": "My shopping experience was online",
          "Contenu": "My shopping experience was online. And the website wasn't at all to hard to navigate through."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "EHorton",
          "Nb_Reviews": 4,
          "Date": "2018-09-26T20:46:08.000Z",
          "Titre": "I don't have anything to say negative…",
          "Contenu": "I don't have anything to say negative about this product, but I can say that I do enjoy using it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dale Montgomery",
          "Nb_Reviews": 2,
          "Date": "2019-11-13T18:18:15.000Z",
          "Titre": "My equipment was shipped and delivered…",
          "Contenu": "My equipment was shipped and delivered as promised. I have not yet opened or tested for quality."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "william breslin",
          "Nb_Reviews": 1,
          "Date": "2022-03-01T16:20:15.000Z",
          "Titre": "shipped on time time good price and…",
          "Contenu": "shipped on time time good price and works just like it's supposed too..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 2,
          "Date": "2019-11-20T17:01:29.000Z",
          "Titre": "Like the product plenty",
          "Contenu": "Like the product plenty - manufacturing and delivery took more than 6 weeks.  Still satisfied"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bruce Warner",
          "Nb_Reviews": 1,
          "Date": "2019-11-05T17:08:49.000Z",
          "Titre": "pRODUCT PERFORMED AS I EXPECTED",
          "Contenu": "pRODUCT PERFORMED AS I EXPECTED. GOOD SELECTION OF CLEANING EQUIPMENT. VERY SATISFIED."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "chris",
          "Nb_Reviews": 6,
          "Date": "2022-05-03T21:06:44.000Z",
          "Titre": "really liked the pads i bought here"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "St John Catholic Church",
          "Nb_Reviews": 1,
          "Date": "2019-07-02T11:34:33.000Z",
          "Titre": "While the website was easy to use",
          "Contenu": "While the website was easy to use, the tax exempt form and billing were not updated."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amy Hess",
          "Nb_Reviews": 1,
          "Date": "2020-05-18T19:10:05.000Z",
          "Titre": "It was easy to get tax exempt status…",
          "Contenu": "It was easy to get tax exempt status and the product was here in just a few days."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert McClatchey",
          "Nb_Reviews": 1,
          "Date": "2020-04-15T12:49:53.000Z",
          "Titre": "Product was delivered in a timely…",
          "Contenu": "Product was delivered in a timely manner considering we're in pandemic mode."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kate McNally",
          "Nb_Reviews": 1,
          "Date": "2022-09-01T23:22:12.000Z",
          "Titre": "Great value",
          "Contenu": "Great value. Short turn around time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Felmar Trinidad",
          "Nb_Reviews": 1,
          "Date": "2019-11-16T17:26:07.000Z",
          "Titre": "Satisfied with my order",
          "Contenu": "Satisfied with my order. Have not tried it yet but delivery was fast. Thanks!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Howard Harbo",
          "Nb_Reviews": 2,
          "Date": "2018-06-14T15:57:46.000Z",
          "Titre": "I had a great experience",
          "Contenu": "I had a great experience and would've give 5 stars except for the sales tax"
        },
        {
          "Note": 4,
          "Lieu": "BS",
          "Pseudo": "Anthony  Smith",
          "Nb_Reviews": 1,
          "Date": "2019-11-21T19:42:33.000Z",
          "Titre": "The reception was very professional and…",
          "Contenu": "The reception was very professional and Taylor Crain was very efficient"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Larry Moore",
          "Nb_Reviews": 4,
          "Date": "2020-09-04T23:25:21.000Z",
          "Titre": "products were useful and price…",
          "Contenu": "products were useful and price affordable. shipping time was great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Crystal Lewis",
          "Nb_Reviews": 1,
          "Date": "2020-08-28T17:37:40.000Z",
          "Titre": "it came in a timely manner i wish the…",
          "Contenu": "it came in a timely manner i wish the spray nozzles were included."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nick Lenzini",
          "Nb_Reviews": 1,
          "Date": "2019-03-07T20:13:12.000Z",
          "Titre": "Just took too long to get the product",
          "Contenu": "Just took too long to get the product, other than that it was great"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Josh Davis",
          "Nb_Reviews": 1,
          "Date": "2019-05-02T20:45:45.000Z",
          "Titre": "Good customer service and right on the…",
          "Contenu": "Good customer service and right on the shipping time for arrival"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joseph Dobrowski",
          "Nb_Reviews": 2,
          "Date": "2020-12-09T14:59:25.000Z",
          "Titre": "Thanks for carring Dominator pads they…",
          "Contenu": "Thanks for carring Dominator pads they are hard to find"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Allan Salko",
          "Nb_Reviews": 1,
          "Date": "2019-03-15T16:33:04.000Z",
          "Titre": "website was easy to navigate",
          "Contenu": "website was easy to navigate. Ordering was a snap. Thanks!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lucilla",
          "Nb_Reviews": 2,
          "Date": "2021-02-17T03:34:19.000Z",
          "Titre": "I felt as if they could of been fast…",
          "Contenu": "I felt as if they could of been fast sending products"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Zgombic",
          "Nb_Reviews": 2,
          "Date": "2020-01-22T19:39:47.000Z",
          "Titre": "Everything was great other than items…",
          "Contenu": "Everything was great other than items being backordered."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nathan Gaffney",
          "Nb_Reviews": 1,
          "Date": "2019-03-18T16:54:33.000Z",
          "Titre": "great customer service",
          "Contenu": "great customer service. 10/10 would work with them again!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "George Allred",
          "Nb_Reviews": 2,
          "Date": "2020-03-17T19:12:12.000Z",
          "Titre": "CleanFreak a reliable  company",
          "Contenu": "CleanFreak provides good value for its customers."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "bracken r.",
          "Nb_Reviews": 2,
          "Date": "2020-06-19T18:06:09.000Z",
          "Titre": "easy to order from and good customer…",
          "Contenu": "easy to order from and good customer service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Francisco Gonzalez",
          "Nb_Reviews": 1,
          "Date": "2019-01-22T20:38:26.000Z",
          "Titre": "Speedy delivery and good costumer…",
          "Contenu": "Speedy delivery and good costumer service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joseph Foreman",
          "Nb_Reviews": 3,
          "Date": "2018-08-31T22:41:21.000Z",
          "Titre": "Tried to help with order and got it done"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pedro Gonzalez",
          "Nb_Reviews": 2,
          "Date": "2018-08-03T02:23:44.000Z",
          "Titre": "All I can say is clean freak is awesome."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marlin Weisenburger",
          "Nb_Reviews": 1,
          "Date": "2020-05-30T03:43:24.000Z",
          "Titre": "Having problems with the sprayer"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Travis Lee",
          "Nb_Reviews": 4,
          "Date": "2018-08-14T14:04:49.000Z",
          "Titre": "CleanFreak.com had the best price!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tom Brooks",
          "Nb_Reviews": 1,
          "Date": "2020-05-07T18:22:50.000Z",
          "Titre": "good helpful site and personnel"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sharmeen Mcmullen",
          "Nb_Reviews": 2,
          "Date": "2019-08-14T00:33:25.000Z",
          "Titre": "So far do good the machine is"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Felix Declet",
          "Nb_Reviews": 1,
          "Date": "2019-02-20T17:49:49.000Z",
          "Titre": "Fast shipping..love it.Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lee Robbins",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T18:46:39.000Z",
          "Titre": "Excellent unit, great customer service !",
          "Contenu": "The salesman walked us through everything .. made great recommendations .. was very knowledgeable about the product"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Orlando",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T06:00:46.000Z",
          "Titre": "I am very pleased with this product it…",
          "Contenu": "I am very pleased with this product it cleans my windows realy good an it arrived within one week"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Turcott",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T23:49:11.000Z",
          "Titre": "I accidentally stumbled on clean freak and ...",
          "Contenu": "I accidentally stumbled on cleanfreak.com looking for 20' burnishing pads for a high speed burnishing machine. We didn't have the correct pads where I work. So I ordered a case of 5 for a little over 30 dollars which is an incredible price! Clean freak is my new go to site for cleaning supplies!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Carriere",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T16:57:31.000Z",
          "Titre": "I have only received the Defoamer 2.5…",
          "Contenu": "I have only received the Defoamer 2.5 gal.  I had a call from the shipping company explaining they had accidentally destroyed my shipment and would report the lost to Clean Freak for replacement!  Still waiting for the Cleaner.   Thank you   Mike Carriere"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rodney Dunlap",
          "Nb_Reviews": 4,
          "Date": "2023-12-11T18:46:32.000Z",
          "Titre": "The ordering process was fast and…",
          "Contenu": "The ordering process was fast and informative as well as the quick response shipping. Great Job 👏"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas T.",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T17:01:20.000Z",
          "Titre": "Just DIY homeowner",
          "Contenu": "First, I am not a professional floor cleaning person. I am a regular DIY homeowner who is working to save his new flooring from his builder's carelessness. I was treated with respect and helped to find the right product. I got my brush and it needed a smaller clutch plate so they found the one I needed and then shipped it free of charge due to my hassles. What a GREAT company and Great products!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greg P",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T17:03:00.000Z",
          "Titre": "As advertised",
          "Contenu": "Ordered, shipped fast worked as advertised Reviews were very helpful We have some smaller areas to get in to, the smaller size is what we were looking for but yet large enough to do large areas Cord gets in the way when turning a lot so takes a little planning Did pay EV price"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "rashid ansari",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T15:33:24.000Z",
          "Titre": "Best service",
          "Contenu": "Best service. Sales person very helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony Tillman",
          "Nb_Reviews": 2,
          "Date": "2023-10-10T04:33:03.000Z",
          "Titre": "Excellent Product, Price and Service",
          "Contenu": "You have the bags available for our Hoover Cordless Backpack Vacuum that are not readily available, elsewhere.  Order was shipped quickly and price was reasonable.  We plan to use CleanFreak (great name by the way) more and more for our cleaning supplies and equipment needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Neal Levy",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T17:29:18.000Z",
          "Titre": "Great place to buy the items I have had…",
          "Contenu": "Great place to buy the items I have had a hard time finding elsewhere. All the specs and information on the website made me confident I was purchasing the right product for my needs.Only suggestion is to fix the glitch in the website that charges massive shipping when increasing quantity to meet discount pricing. I'm better off placing 2 separate orders than ordering the correct quantity."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mr. John Marshall",
          "Nb_Reviews": 2,
          "Date": "2023-10-30T15:50:25.000Z",
          "Titre": "Your representative understood what I…",
          "Contenu": "Your representative understood what I was looking for in a buffer and soft bristle brush to polish waxed wood floors.  He quickly identify the part number so I was able to quickly order what I needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joy Janssen",
          "Nb_Reviews": 2,
          "Date": "2023-09-14T18:53:22.000Z",
          "Titre": "Top notch products",
          "Contenu": "Top notch products!  I come back again and again because the results can't be matched with cheaper solutions.  Nyco OM1 is a favorite of ours since the fragrance is light and pleasant with an incredibly effective solution - whichever variety you select! Customer service is fast and friendly if they are needed. 5 stars!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T16:40:24.000Z",
          "Titre": "Good customer service followed up by quick delivery",
          "Contenu": "When asked about a product that I was going to use, they made a great alternative recommendation that would work better for the project I needed to do.  Thanks for the insight."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dawn",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T15:09:46.000Z",
          "Titre": "Lucas was great",
          "Contenu": "Lucas was great. He answered my numerous questions during my initial call. He was prompt and courteous and placed my order for me on a subsequent call. And even though the Clarke 17” buffer was listed on back order, his assurance that the machine would most likely be available before then was right on target. My machine arrived yesterday. I finally have a machine that can tackle the tough job of paste waxing and buffing my old, unsealed hardwood floors. My experience with Clean Freak—from my initial contact to delivery—was stellar."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Doug",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T01:32:20.000Z",
          "Titre": "Super fast shipping",
          "Contenu": "Super fast shipping, way faster than expected. Also, really great products as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gatlinburg Brewing Company",
          "Nb_Reviews": 3,
          "Date": "2023-08-22T18:33:18.000Z",
          "Titre": "Quick and easy!",
          "Contenu": "Called to place an order because I had questions that wouldn't be answered ordering online.Super friendly and ironically less than 5 miles away. They got my order ready late afternoon on a Friday and even loaded it. I'll definitely buy from them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gary Cudney",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T18:25:36.000Z",
          "Titre": "Very pleasedOur scrubber arrived quickly and in…",
          "Contenu": "Our scrubber arrived quickly and in very good shape. Upon first use I discovered it does not glide along effortlessly like I hoped but much easier than hand mopping. The machine  is fantastic my concrete floor looks like new. Very much a time saver and would highly recommend this product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dalton",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T16:27:49.000Z",
          "Titre": "A good cleaning machine.",
          "Contenu": "The machine received was exactly as shown on the website. Ordering was quick and easy and the delivery was prompt. So far the Dura17-C with the brush has done a very good job cleaning the shop floor that had caked on water soluble cutting fluid and oil dry."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lauren  Hulsey",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T03:47:41.000Z",
          "Titre": "We really love our service from Clean…",
          "Contenu": "We really love our service from Clean Freak! The products have been great, and the delivery so smooth (which is difficult to find sometimes with larger orders for janitorial supplies). Very thankful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Randolph Zepp",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T19:03:50.000Z",
          "Titre": "Faith Presbyterian Church, Tallahassee, FL",
          "Contenu": "We had our equipment being delivered to an address in North Carolina due to an old address that had been used several years ago by another company.  The old saying that you are measured by how you react under adversity verses when everything goes right.  The issue was corrected and we received everything in a very timely manor.  Thank you for your Professionalism."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jack Kruger",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T05:42:09.000Z",
          "Titre": "Helpful friendly tech reps.",
          "Contenu": "Helpful friendly tech reps.Product as advertised. Only complaint on unit is its clumsy in corners. Having to pull it back from wall so squeegee could be retracted and then turned is more than a moderate workout .Thanks and God bless you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zachary Storrud",
          "Nb_Reviews": 2,
          "Date": "2023-07-25T23:27:41.000Z",
          "Titre": "Great company and Product",
          "Contenu": "Great company, sent all equipment in a very timely manner.  After I received the machine and products, I had a few question. I wrote the company and had a reply in a very quick time.  Just started cleaning carpets for real state companies as a side hustle and am doing well so far.   The only down side is if you have to move the trusted clean box extractor up and down stairs bring some one to help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jerami Harris",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T16:49:59.000Z",
          "Titre": "Leander ISD Pressure Mower",
          "Contenu": "Product works great, the pressure mower does exactly what its suppose to do.   Can cover a lot of surface in very short time.  Having the wand option on the rig itself is a great idea, so that you don't multiple pieces of equipment on the job site.  The only down side was the my pressure mower was damaged in shipping, front wheel was damaged.  Had to make some adjustments so that it could role around with out any issues.  Other than that I am extremely happy with the product that the Clean Freaks build."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stanice Services",
          "Nb_Reviews": 2,
          "Date": "2023-02-12T18:46:26.000Z",
          "Titre": "I've purchased most of my equipment and…",
          "Contenu": "I've purchased most of my equipment and chemicals to start my commercial cleaning business several years ago. I still use all the equipment and haven't had any problems with any of the equipment. I bought the 20 in. High speed burnisher and used it this weekend, it did an amazing job. I will be purchasing another one soon. I really like the fact the they offered financing which made it easier to start my cleaning business. Thank you Clean Freak. Stan from Stanice Services."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "steve wallace",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T15:09:54.000Z",
          "Titre": "High Marks!",
          "Contenu": "Easy access to details about equipment and online order processing.  Prompt communication on order status and delivery dates.  We are very happy with the product and the overall experience!  5 stars!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Timothy Churchill",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T00:54:01.000Z",
          "Titre": "Wonderful!!!",
          "Contenu": "Wonderful!!!We purchased a brush for our floor cleaner, based on feedback from customer service, and it is amazing!!  It works extremely well on the textured concrete garage floors!Great product, outstanding customer service!  We’ll be back for more parts/supplies and I would definitely recommend to others!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Schlander",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T18:42:32.000Z",
          "Titre": "Very quick and easy",
          "Contenu": "This was an easy transaction, the cleaner arrived on time and was packaged to minimize shipping concerns. Easy setup with instructions that were provided on-line. Carpet cleaning made an immediate improvement to our common areas in our condos."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jermaine Wright",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T18:00:51.000Z",
          "Titre": "Great pads at a superb value.",
          "Contenu": "Great pads. They work exactly as advertised. The green pads will remove a layer of floor finish. I used one of them with some neutral cleaner to perform a scrub and recoat on my church's vct tile floor, with fantastic results. The red pads are ideal for light duty scrubbing of hard floors (removes debris and scuff marks without harming the floor finish). Very pleased with my purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nester Chevrolet",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T13:38:33.000Z",
          "Titre": "Been servicing the same floor scrubbing…",
          "Contenu": "Been servicing the same floor scrubbing machine only due to these guys and ladies. Always helpful on the phone and always delivers me the right parts. Excellent team."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anita Raynor",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T20:31:35.000Z",
          "Titre": "When I had an issue with my product",
          "Contenu": "When I had an issue with my product, Clean Freak was timely in their response, and they also connected me with their technician. He was able to troubleshoot my problem over the phone and rectified the situation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen Joseph",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T23:34:04.000Z",
          "Titre": "Thank you guys",
          "Contenu": "Thank you guys, so much, I was going crazy looking for a spare parts, but you guys were awesome with helping me find what I needed"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "chastain stitts",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T12:19:48.000Z",
          "Titre": "The Job",
          "Contenu": "The sales representative was very helpful and patient. My experience with CleanFreak was a GREAT one.Thank you,Chastain Pitts"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "craig pulling",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T15:24:43.000Z",
          "Titre": "Friendly and helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christian DiCamillo",
          "Nb_Reviews": 2,
          "Date": "2023-05-31T01:40:12.000Z",
          "Titre": "Our original order was lost and only…",
          "Contenu": "Our original order was lost and only one case out of 5 arrived.  I emailed customer service and I had 4 additional boxes in 48 hours.  Always great to do business with clean freak."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "iSchneggs",
          "Nb_Reviews": 3,
          "Date": "2023-03-29T17:14:27.000Z",
          "Titre": "A+! Floor Cleaner, Pads, and Instructions!",
          "Contenu": "Our company purchased a floor cleaner, but never had time to assemble nor use it. After assembly, I purchased buffing pads and solution. All in all, my experience has been very good! And the buffer's assembly and instruction manual was very good!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stacy Voorheis",
          "Nb_Reviews": 1,
          "Date": "2023-04-18T18:03:16.000Z",
          "Titre": "Showed up in a couple of day after…",
          "Contenu": "Showed up in a couple of day after ordered. I have a 4000 sq ft shop and this machine makes cleaning very easy. Floor gets cleaned way more often now and way cleaner than mopping. Machine works great, no complaints. I would definitely recommend. Mopping sucks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AM",
          "Nb_Reviews": 2,
          "Date": "2023-08-07T19:01:43.000Z",
          "Titre": "Web was easy to navigate",
          "Contenu": "Web was easy to navigate. I had tax exempt status and they and they gave easy, helpful steps to go this step. The woman that called was very nice, polite and gave instructions on delivery. Delivery was on time and easy!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jon King",
          "Nb_Reviews": 2,
          "Date": "2023-04-06T20:28:23.000Z",
          "Titre": "Unbeatable Value Every Time",
          "Contenu": "As an operations manager for a cleaning company I often find myself searching for the best price for cleaning equipment.All my searches ussually end with shopping at CLEANFREAK.Great Equipment - Great Prices!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karl Sykes",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T04:12:54.000Z",
          "Titre": "Easy ordering quick delivery everyone around the board was so nice even the delivery driver",
          "Contenu": "I called a few times for assistance and questions and spoke to very nice pleasant informational , people quite a pleasure to talk to somebody and not a machine please keep up the good work"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laci Worth",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T04:23:48.000Z",
          "Titre": "Amaizing customer service",
          "Contenu": "Great customer service. They got back to me quickly and gave me my options, the price and everything! I appreciate all the time and effort they spent to satisfy their customers. I  will definitely recommend CleanFreak to others"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jan  Cochran",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T20:15:49.000Z",
          "Titre": "I truly believe the cleaning product I…worked great",
          "Contenu": "I truly believe the cleaning product I purchased from cleanfreak has helped my situation. I have been using it to clean up pet stains, mostly to soak in and then to try and get the smell out. Very happy"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bonnie Stellenwerf",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T14:52:33.000Z",
          "Titre": "I had an issue with delivery",
          "Contenu": "I had an issue with delivery, not their fault package never arrived, but they didn’t hesitate to take care of it. Awesome customer service, good people to deal with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tracey Ingle",
          "Nb_Reviews": 3,
          "Date": "2023-05-08T19:35:26.000Z",
          "Titre": "Product availability",
          "Contenu": "The item(s) we needed to purchase were in stock. We had the option to have them delivered, but chose to pick them up in person. Customer service representatives were friendly and helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larry Poe",
          "Nb_Reviews": 3,
          "Date": "2023-02-16T19:00:33.000Z",
          "Titre": "As a state contractor I buy lots of products …",
          "Contenu": "As a state contractor I do a lot of business with Clean Freak. I'm a little disappointed in the longevity of their brand is oscillating square scrubber,  but every other item I have purchased through them has exceeded my expectations."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JOHN DUGAN",
          "Nb_Reviews": 3,
          "Date": "2023-11-21T20:40:08.000Z",
          "Titre": "I worked with a tech about an issue",
          "Contenu": "I worked with a tech about an issue. He was very knowledgeable. My problem was solved."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brenda Ritchie",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T06:18:23.000Z",
          "Titre": "I was amazed how helpful the sales…",
          "Contenu": "I was amazed how helpful the sales manager was and so kind and knew exactly what I was wanting on a dry stripping machine. I needed it desperately for a floor job. I ordered it on a Tuesday and received it that Friday.  Clean Freak is definitely my kind of company I want to buy all supplies from! I rate them above 5 stars!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Craig Burton",
          "Nb_Reviews": 6,
          "Date": "2023-11-02T00:32:50.000Z",
          "Titre": "100% Satisfied!",
          "Contenu": "I’ve made several purchases from Clean Freak. I’m satisfied with each and every one!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Working Mom",
          "Nb_Reviews": 1,
          "Date": "2023-03-08T04:29:31.000Z",
          "Titre": "Very satisfied!",
          "Contenu": "Bigger than what I expected, but definitely gets the job done! I work full time but clean houses on the side and it was a great add on to my business. The lady’s house I cleaned, had carpets they were destroyed from their 5 cats and 1 dogs and it brought them back to life. Looked brand new! And the cleaning solution helped get all the hard stains out the carpet. Can’t wait to order more attachments!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lloyd Mcgallion",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T13:02:57.000Z",
          "Titre": "Had a very wonderful experience with…",
          "Contenu": "Had a very wonderful experience with staff.  Friendly helpful and efficient.  Received my shipment in perfect condition and complete.  The sander/buffer is a great product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tracey Ingle",
          "Nb_Reviews": 3,
          "Date": "2023-03-21T02:15:22.000Z",
          "Titre": "This was our 5th purchase of a floor…",
          "Contenu": "This was our 5th purchase of a floor scrubber so the sales rep was able to look at our account and see everything that we needed. She was friendly and made all the arrangements so that I could pick the items up in person on the same day."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul R",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T18:02:14.000Z",
          "Titre": "A very solid experience.",
          "Contenu": "Product was great, customer service was tops from the first call to the final delivery. Great experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angela Gideons",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T02:26:19.000Z",
          "Titre": "Clean freak was easy to work with",
          "Contenu": "Clean freak was easy to work with. I had a few questions about the floor machine we ordered which were quickly answered through chat. The machine arrived quickly. It has worked well for our needs. Very pleased with the overall experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tyler Wallace",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T02:14:38.000Z",
          "Titre": "The people was great 👍.",
          "Contenu": "The people was great 👍.. The product works great and the carpet extractor does what it is suppose to do.. I'm a satisfied customer"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Campbell",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T15:25:52.000Z",
          "Titre": "Worked as recommended"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Iris Rivera",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T19:13:26.000Z",
          "Titre": "I love me vacuum madera my job more…",
          "Contenu": "I love me vacuum madera my job more easy i receive me order Quit thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "frances brophy",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T17:29:45.000Z",
          "Titre": "The people I spoke to are very nice and…",
          "Contenu": "The people I spoke to are very nice and informative and answered all my questions"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan Lamont",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T02:18:11.000Z",
          "Titre": "I was able to find the replacement part…",
          "Contenu": "I was able to find the replacement part I needed for my extractor quick and easy. The shipping was sooner than expected, amazing!!  Thank you so much!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mario",
          "Nb_Reviews": 2,
          "Date": "2023-02-10T23:52:09.000Z",
          "Titre": "Great customer service did miss one…",
          "Contenu": "Great customer service did miss one thing on my order that I noticed it did not come with but other than that it was a smooth steady process deff recommend them for your cleaning needs"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GEORGE NAVA",
          "Nb_Reviews": 6,
          "Date": "2023-08-16T01:56:27.000Z",
          "Titre": "They have all the janitorial equipmen…",
          "Contenu": "They have all the janitorial equipment needed if you are looking to replace old equipment or add more."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hannah Baird",
          "Nb_Reviews": 5,
          "Date": "2023-10-23T23:55:02.000Z",
          "Titre": "Fast and Proficient",
          "Contenu": "Product was fast getting to the door and will most likely do business in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Schlueter",
          "Nb_Reviews": 1,
          "Date": "2023-04-26T23:46:57.000Z",
          "Titre": "The communication and ability to…",
          "Contenu": "The communication and ability to finance made this a great experience! The product works well and customer service is helpful! The information is conveniently located and the directs are easy to follow! I would highly recommend ordering with Clean Freak!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joshua Seidler",
          "Nb_Reviews": 2,
          "Date": "2023-07-18T00:16:20.000Z",
          "Titre": "Quick delivery with strong finish",
          "Contenu": "Quick delivery with a strong finish by the driver.  He actually wheeled it to my garage.  Thumbs up from Jean Clean LLC."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay B",
          "Nb_Reviews": 3,
          "Date": "2023-03-09T15:22:58.000Z",
          "Titre": "Received part with no issues",
          "Contenu": "Correct part showed up in a timely manner and had no issues with ordering. Thank you! Will order again from this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George Laredo",
          "Nb_Reviews": 2,
          "Date": "2023-03-07T01:49:00.000Z",
          "Titre": "Really good I was thinking my order…",
          "Contenu": "Really good I was thinking my order gonna during like 3 weeks to arrive but it came in 9 days  AMazing service thankssss"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sheldon Byfield",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T18:24:02.000Z",
          "Titre": "Great customer service and fast…",
          "Contenu": "Great customer service and fast delivery. Got my kaivac univac in 4 days"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George Tsuladze",
          "Nb_Reviews": 2,
          "Date": "2023-11-24T16:41:18.000Z",
          "Titre": "Quick shipping",
          "Contenu": "Quick shipping. Great service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christian DiCamillo",
          "Nb_Reviews": 2,
          "Date": "2023-10-26T14:45:20.000Z",
          "Titre": "Fast delivery",
          "Contenu": "Fast delivery, reasonable prices. My go to company for supplies."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Lofton",
          "Nb_Reviews": 2,
          "Date": "2023-02-02T20:12:22.000Z",
          "Titre": "I placed the order over the weekend and…",
          "Contenu": "I placed the order over the weekend and received the shipment within days.  I thought I'd have to wait about thirty days.  I had it up and running by the next weekend and was able to clean my floors.  Not happy with the floor cleaner. It lacks punch."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Orien LeBlanc",
          "Nb_Reviews": 1,
          "Date": "2023-06-11T15:10:43.000Z",
          "Titre": "The person I spoke to new the product…",
          "Contenu": "The person I spoke to new the product very well and was able to answer my question without hesitation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MIKE HYDRICK",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T02:43:11.000Z",
          "Titre": "Got my order correctly and quickly.",
          "Contenu": "Got my order in timely. It was exactly as presented to me. No problems. Recommend this Company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joy Janssen",
          "Nb_Reviews": 2,
          "Date": "2023-06-29T00:01:11.000Z",
          "Titre": "Excellent product",
          "Contenu": "Excellent product, fair price and clear communication about the time line.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brent Galloro",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T18:13:40.000Z",
          "Titre": "It's nice e to talk and text a live…",
          "Contenu": "It's nice e to talk and text a live person easy to order my parts.and getting emails. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Burton Nichols",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T01:11:38.000Z",
          "Titre": "General Opinion",
          "Contenu": "They have gone to sufficient lengths to earn my respect."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SFG",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T23:06:08.000Z",
          "Titre": "Perfecr fit",
          "Contenu": "I ordered these bags 2 times and they didn't fit. This site was the only one which description and fit was accurate"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Camille Frame",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T16:57:26.000Z",
          "Titre": "Excellent Service",
          "Contenu": "I called the 800# with a specific question, the representative was very helpful and sent a few links for me to research so I could make the best purchase decision.  I always appreciate an excellent customer service experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan Mann",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T19:28:32.000Z",
          "Titre": "Absolutely outstanding service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tony",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T06:08:41.000Z",
          "Titre": "Purchase was good experience",
          "Contenu": "Product was easy to order online & was delivered on time in good condition."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Vandal",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T14:40:45.000Z",
          "Titre": "Customer service rep was very…",
          "Contenu": "Customer service rep was very knowledgeable and helpful in guiding me to make the right purchase choice"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Boy Scouts of America",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T19:07:05.000Z",
          "Titre": "Product was exactly as described and…",
          "Contenu": "Product was exactly as described and worked perfectly. Shipping was fast. Great purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "HSMC",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T18:14:08.000Z",
          "Titre": "Super time saver!",
          "Contenu": "Live telephone agent very knowledgeable. Love our automatic floor scrubber."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Glen",
          "Nb_Reviews": 1,
          "Date": "2023-02-13T22:03:25.000Z",
          "Titre": "Ordered floor scrubber and received in…",
          "Contenu": "Ordered floor scrubber and received in 1 week. Customer service very nice to work with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ed Mink",
          "Nb_Reviews": 2,
          "Date": "2023-07-05T15:14:54.000Z",
          "Titre": "Great product description",
          "Contenu": "Great product description, it was well packaged and delivered quickly! Thank you!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony Harris",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T15:59:13.000Z",
          "Titre": "The website was very easy to navigate",
          "Contenu": "The website was very easy to navigate, the check out was very easy as well. The unit was delivered in a timely manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Delane Brown",
          "Nb_Reviews": 1,
          "Date": "2023-05-27T04:35:11.000Z",
          "Titre": "The product was purchased to be used in…Church",
          "Contenu": "The product was purchased to be used in our church.  I am not using it but other people are and say it works wonders."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CHARLES SCHWABLE",
          "Nb_Reviews": 5,
          "Date": "2023-06-20T22:07:35.000Z",
          "Titre": "Easy to maneuver your website",
          "Contenu": "Easy to maneuver your website, affordable prices, good products"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Lawhon",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T00:30:35.000Z",
          "Titre": "Disaster turned Awesome…",
          "Contenu": "We ordered cleaner that unfortunately was damaged during shipping- customer service was great and got us a replacement immediately! Wonderful customer service and a great product"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Neato Cleaning & Restoration",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T17:21:47.000Z",
          "Titre": "They move fast!",
          "Contenu": "Top-notch customer service!  And they move fast!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T13:18:02.000Z",
          "Titre": "Well packaged and great product!",
          "Contenu": "Buffers came packaged well and in new condition. Thank you clean freak!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brandon McCartney",
          "Nb_Reviews": 2,
          "Date": "2023-08-12T00:06:35.000Z",
          "Titre": "Goto place for janitorial supplies",
          "Contenu": "Easy to navigate site, great pricing and super fast shipping"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Catherine DeWulf",
          "Nb_Reviews": 1,
          "Date": "2023-04-14T02:07:42.000Z",
          "Titre": "Fast shipping on in stock item and…",
          "Contenu": "Fast shipping on in stock item and surprisingly fast shipping on back ordered item."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JULIA .A",
          "Nb_Reviews": 2,
          "Date": "2023-08-14T23:34:12.000Z",
          "Titre": "I have always liked the products from…",
          "Contenu": "I have always liked the products from Clean Freak and also how fast we received the products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anna Tranhiep",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T17:27:28.000Z",
          "Titre": "Ordered a pressure washer switch",
          "Contenu": "Item I ordered was exactly as described. Shipped fast and arrived intact. Price was good. Everything worked as it should."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larry  Collins",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T17:51:11.000Z",
          "Titre": "Timely delivery and the cheapest I…",
          "Contenu": "Timely delivery and the cheapest I found for my cordless backpack vacuum"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jose Valderrama",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T14:19:58.000Z",
          "Titre": "Very fast shipping and product arrived…",
          "Contenu": "Very fast shipping and product arrived as described."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Alarid",
          "Nb_Reviews": 4,
          "Date": "2023-04-05T16:58:58.000Z",
          "Titre": "The 10' Wand worked great",
          "Contenu": "The 10' Wand worked great. It is a beautifully designed piece of equipment."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rufus Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T06:01:57.000Z",
          "Titre": "Excellent",
          "Contenu": "Excellent! I bought this wet vac and very well pleased. It does the work excellently!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "charles f ankrom",
          "Nb_Reviews": 2,
          "Date": "2023-06-02T15:00:57.000Z",
          "Titre": "The order got here in a very quick time…",
          "Contenu": "The order got here in a very quick time that is what is important to me ..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Benjamin Toncz",
          "Nb_Reviews": 1,
          "Date": "2023-02-03T21:23:30.000Z",
          "Titre": "Great ship time",
          "Contenu": "Great ship time! Got my package a lot earlier than estimated."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "A L",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T10:53:19.000Z",
          "Titre": "Got what I bought",
          "Contenu": "Got what I bought, well packed and fast. Very happy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin Hughes",
          "Nb_Reviews": 1,
          "Date": "2023-02-02T09:42:35.000Z",
          "Titre": "I received my order very quickly",
          "Contenu": "I received my order very quickly. I appreciate your prompt response."
        }
      ]
    }
  ]
}