{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.drivereasy.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Penny Rexford",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T00:47:56.000Z",
          "Titre": "OOPs! I should have checked you out.",
          "Contenu": "I paid for one year. Not able to enter the activation code  blocked by your computer system. Then it blocked my computer from ability to do anything by your activation code request app. that would not allow me to enter any code at all"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 3,
          "Date": "2023-12-17T14:32:12.000Z",
          "Titre": "After upgrading to the Pro version and…",
          "Contenu": "After upgrading to the Pro version and installing it on my computer, I let it upgrade all of the drivers it said needed to be upgraded. After it had finished my computer ran sluggish and all of my programs did not work right. I had it uninstall it and restore my computer back to a previous point and reinstall programs that were missing. I would not recommend this product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "bryan",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T15:50:34.000Z",
          "Titre": "Updated my gpu now I can't get a signal…",
          "Contenu": "Updated my gpu now I can't get a signal on monitor when pc is on"
        },
        {
          "Note": 1,
          "Lieu": "HU",
          "Pseudo": "Domonkos Bodnár",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T12:19:37.000Z",
          "Titre": "DO NOT DOWNLOAD THIS!",
          "Contenu": "DO NOT DOWNLOAD THIS!I wanted to update my audio drivers after reinstalling my computer, thought it would be easier with this program. Well, long story short: it completely deleted my audio driver from device manager, no other support program could find the needed driver, cause the sound card wasnt recognized. After 1 day of internal screaming i had to start from scrap and reinstall the computer again. Never going even near this program."
        },
        {
          "Note": 1,
          "Lieu": "LT",
          "Pseudo": "A. Dobiliauskas",
          "Nb_Reviews": 3,
          "Date": "2023-11-23T20:28:46.000Z",
          "Titre": "Just useless",
          "Contenu": "Got this software to update my drivers and was dissapointed. My laptop started working incorrectly. Even my keyboard started bugging out. Some buttons were not working. Ofcourse there is one but, I was using the free version of the app. Happy to say, with this miserable experience, I was discouraged to purchase their subscription."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stephen Adams",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T18:34:46.000Z",
          "Titre": "I never saw, got, the window to upload my code.",
          "Contenu": "The window to enter my code that I purchased never came up. I still don't have the pro i paid for. HELP please."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marty Lavens",
          "Nb_Reviews": 5,
          "Date": "2023-11-12T13:03:29.000Z",
          "Titre": "I paid and you gave 2 ACTIVATION DEFECTIVE CODES…",
          "Contenu": "MAybe if you had answered/responded to my ACTIVATION CODE problem.I purchased a LICENSE but you gave me a CODE that doesn't work. If I do not hear from you in another day then I will REQUEST a TOTAL REFUND as you do not deserve my MONEY when you do a TERRIBLE job of CUSTOMER SUPPORT."
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Anand Nagar",
          "Nb_Reviews": 7,
          "Date": "2023-10-22T05:29:14.000Z",
          "Titre": "Driver Easy does not offer enough…",
          "Contenu": "Driver Easy does not offer enough support for unknown devices. Such as Business card readers which I am trying very hard to find  a device driver for.Driver easy needs to offer continual improvement based on customer feedback.Further more have a much better visual interface for thier software, in the form of updates.The last time I have used Drivereasy software I expected an improvement from the last version that I used of Drivereasy, and more device tools for when in need of a rescue of a user.Kind Regards,Anand"
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Geoff Beeson",
          "Nb_Reviews": 17,
          "Date": "2023-11-22T14:38:07.000Z",
          "Titre": "Disastrous",
          "Contenu": "Useless. Crashed computer and have uninstalled programme but still trying to recover as can only access in Safe Mode without security programmes (Avast)"
        },
        {
          "Note": 1,
          "Lieu": "HR",
          "Pseudo": "Damir G Martin",
          "Nb_Reviews": 3,
          "Date": "2023-11-20T10:37:57.000Z",
          "Titre": "Driver Easy breaks your computer.",
          "Contenu": "Each time I try to use Driver Easy to update drivers on my machine, everything breaks and stops working. Blue screen of death, broken network adapter.. Absolute hot garbage of a software. Avoid at all cost."
        },
        {
          "Note": 1,
          "Lieu": "BH",
          "Pseudo": "Nishaj Yousuf",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T21:39:38.000Z",
          "Titre": "Bad not downloading and didn’t fix my issue. I need redund",
          "Contenu": "Bad software"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Howard Stehan",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T10:48:35.000Z",
          "Titre": "Driver Easy did not work",
          "Contenu": "Driver Easy did not work. It was NOT easy. It should be called driver complicated! I had to take my computer into the shop and have an expert technician do the installation. I was told this product has a money back guarantee.How do I get my money back for this product that didn't work?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Edric 'Ric' Green",
          "Nb_Reviews": 2,
          "Date": "2023-10-30T01:32:06.000Z",
          "Titre": "I am unable to update all my drivers…",
          "Contenu": "I am unable to update all my drivers and once the update is complete, my system freezes before the Windows load is complete. In order to use my system, I have to rollback everything to the state prior to the driver update attempt. This happens on 2 new systems that are experiencing serious latency."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Peter",
          "Nb_Reviews": 4,
          "Date": "2023-09-25T08:15:12.000Z",
          "Titre": "Look Before You Lea.",
          "Contenu": "App was downloaded and opened for action.  Display indicated to select choice of Scanning Method.  No response.  Tried mant times to get action but frame was frozen.Zero stars for losing 30 minutes of working time trying to get some response.  Completed your comment page but no response."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "REAPER_BRO",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T20:30:13.000Z",
          "Titre": "Bad for gamers, avoid if you dont want your graphcis card to become bad.",
          "Contenu": "Installed it because a game required an update of the motherboard. CCleaner didnt detect the update so I bought and used Driver easy. Right after I did that, my internet went from 100mgb per sec to 40mgb per sec. My 3070 went from being able to run cyberpunk max graphic at 130fps and have a second monitor on Wallpaper engine no problem to having 60 fps and difficulty running the secound monitor. It also made my razer headset unusable and any sound on the computer.Bad, stay away at all cost gotta reset my pc rn"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "justin",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T18:06:35.000Z",
          "Titre": "Purchased to help identify PCI driver",
          "Contenu": "Purchased to help identify PCI driver, failed to identify anything and didnt update any more than windows update or dell updates. Wasted purchase."
        },
        {
          "Note": 1,
          "Lieu": "BE",
          "Pseudo": "Oldbonny",
          "Nb_Reviews": 13,
          "Date": "2023-10-29T23:12:19.000Z",
          "Titre": "I bought this program because the…",
          "Contenu": "I bought this program because the latency of my PC was too high, I got drops when I wanted to listen to music. This could be due to old drivers that were installed, so I bought this program to update this driver. The result was that the latency was even greater than before, so this is a bad buy."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bronco",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T16:58:10.000Z",
          "Titre": "Had a problem with install on 2nd…",
          "Contenu": "Had a problem with install on 2nd computer, could not for life of me able to install the 'key'. The 1st computer installed on was fine. (I bought a 3 computer service package). The 2nd computer download kept asking for another payment. Could not get past this step, no where to install the key, this is amateur web dev mistake.  Emailed 'cust svc' about it, received a ticket for problem, and 5 days later and counting still NO response. Either these people are inept/stupid, overwhelmed or just some scam crap service. Requesting FULL refund today."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T18:09:21.000Z",
          "Titre": "Didn't work at all"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hunter",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T12:32:48.000Z",
          "Titre": "Immediate Regret, forced to system Restore",
          "Contenu": "Paid for a years worth of service, let Driver Easy update my drivers, and my PC immediately crashed. PC overheated, gpu failed to respond, hdd stuck at 100%. It took me three hours to system restore, after which I had to reset my BIOS and manually updated the drivers myself. Everything works now, which is, frankly, lucky for you. I'll never trust your software again, and I will be looking into getting a refund, if that's even possible."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Josuan Nunez",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T10:02:44.000Z",
          "Titre": "Driver failure",
          "Contenu": "Bought the pro, everything updated faster at the cost of it crashing my computer. It caused a driver failure, took it to a shop to repair it, came back home and decided to reinstall driver easy. Installed my drivers again, caused another driver failure again"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-08T20:20:01.000Z",
          "Titre": "Lost audio and number control after…",
          "Contenu": "Lost audio and number control after installing product.  Have not had any response from company to help me fix problems."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Preston V",
          "Nb_Reviews": 2,
          "Date": "2023-10-04T19:21:56.000Z",
          "Titre": "Updated drivers ruined everything",
          "Contenu": "Updated all drivers. Now screen flickers. Roll back didn’t fix it.contacted supported. They said drivers are good and it’s not their issue and asked for a list of things to trouble shoot. I replied, and never got a response back. Took to a local tech who fixed it. Confirmed it was the driver installation that caused the issue even though the drivers and hardware are fine. It just changed needed configuration settings or something of the sort."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dan Carlo",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T01:52:52.000Z",
          "Titre": "I did the instant downloads for all of…",
          "Contenu": "I did the instant downloads for all of the drivers and then a little while after my PC just crashed and took me to a blue screen and it won’t reset back to windows. I talked to a computer technician just now and he’s saying I’m going to have to use a laptop and down load windows on a drive and reinstall everything. Saying I’ll be losing everything in my files in my main drive. Extremely frustrating and awful experience with “drivereasy”. Tomorrow is where I’m gonna get everything sorted and fixed hopefully. I’m sorry but I will be contacting later at some point for a refund. I probably got the shorter end of the stick as one of your customers. Ugh"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JOHN E.",
          "Nb_Reviews": 2,
          "Date": "2023-11-11T22:41:15.000Z",
          "Titre": "I was unable to download driver…",
          "Contenu": "I was unable to download driver easy...turns out my hard drive was corrupted. I'd like a refund given the circumstances."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T06:12:28.000Z",
          "Titre": "Horrible",
          "Contenu": "Horrible. Downloaded what it said I needed. Now I can't click my start bar, and half of my applications are corrupted. Going to have to boot into bios to get this mess fixed. Once I do I will not be using this Horrible app anymore."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Gerald",
          "Nb_Reviews": 2,
          "Date": "2023-09-27T04:16:20.000Z",
          "Titre": "Caused me to lose e mail function in my…",
          "Contenu": "Caused me to lose e mail function in my computer when reair mode was done along with I do not know at this time I have tried to use your service before with a lot of trouble Sorry"
        },
        {
          "Note": 1,
          "Lieu": "ZA",
          "Pseudo": "Dr.S.B.Stasikowski",
          "Nb_Reviews": 2,
          "Date": "2023-07-29T15:50:48.000Z",
          "Titre": "Bad  experiene with a wrong activation key.",
          "Contenu": "i BOUGHT  Driver EASY , paid and received an activation ke y.After managing to download and install the  software, I could  activation key.not ACTIVATE IT, because Driver Easy has sent me  a WRONG activation key..I wasted a lot of time  and the technical help was not efficient. I am deeply dissatisfied. WhaT nosw ???"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "CHASE",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T23:29:25.000Z",
          "Titre": "TERRIBLE SERVICE",
          "Contenu": "TERRIBLE SERVICERemoved drivers and had to do a complete system restore losing my work for the last 2 weeks. I've been working non-stop to recover from it.Be WISE and manually update and download your drivers.Seems like a money grab to me! Thankfully I got my refund!"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Baldski Man",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T09:34:45.000Z",
          "Titre": "Honestly useless for those looking to…",
          "Contenu": "Honestly useless for those looking to use without spending money, download speed is very slow (Around 50 kbps) and the supposed 'fixes' promised did not change anything, there are far better products than this. Overall, not recommended for free users but if you're willing to burn money on a waste then go ahead, note that this is me putting it lightly."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric Kaigler",
          "Nb_Reviews": 2,
          "Date": "2023-09-15T00:30:31.000Z",
          "Titre": "You did not do what you're write up…",
          "Contenu": "You did not do what you're write up promised. Yet you took my money, that's unfair to me. I don't see in any way of doing business with a company who doesn't show what they are capable of before taking payment   that's just not right. :{"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James D",
          "Nb_Reviews": 1,
          "Date": "2023-06-17T23:16:31.000Z",
          "Titre": "Driver Easy made it so my computer would not boot.",
          "Contenu": "I got Driver Easy because I had a Windows Update that broke many things and I suspected that drivers might be the issue. When I let Driver Easy do its thing it identified a bunch of drivers that needed updating. Driver Easy took the computer from being a usable computer with some problems to a black screen an unable to boot."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "S LAWRENCE",
          "Nb_Reviews": 5,
          "Date": "2023-11-14T20:27:07.000Z",
          "Titre": "Well",
          "Contenu": "Well, laptop CRASHED immediately following the download. So - that's the reason for the ONE STAR."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jacob",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T19:54:30.000Z",
          "Titre": "Bought software but it would never…",
          "Contenu": "Bought software but it would never accept the code , says can’t connect to server"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Space Station",
          "Nb_Reviews": 9,
          "Date": "2023-08-31T19:47:19.000Z",
          "Titre": "This software when uninstalling left a…",
          "Contenu": "This software when uninstalling left a boot print on my PCI card which kept causing my computer to crash. My friend has a computer repair company and was able to get the footprint removed from my PCI card. But for some reason, it had to be reinstalled on my computer. He said unfortunately it would cost $175 hr @ 4 hours min., for his tech to reach the issue. I said no at this point."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Linda L",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T18:56:33.000Z",
          "Titre": "I have spent over 5 hours trying to…",
          "Contenu": "I have spent over 5 hours trying to correct the \"updated drivers\" that were installed with the Pro version...tech support tried to help with suggestions that I had already tried...I have asked for a refund as I was better off before using this app ****update-requested refund was processed immediately...unfortunate  that actual product isn't as great as their Customer Support...thank you!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jordan",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T01:28:40.000Z",
          "Titre": "Driver Easy installed drivers for…",
          "Contenu": "Driver Easy installed drivers for devices not even connected, nor ever connected, to my system. It screwed up my sound. My speakers now crackle and pop constantly. This has been a nightmare."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Butch",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T06:14:02.000Z",
          "Titre": "Program difficult to load, if at all, and charged 3 times for the same program",
          "Contenu": "First of all, my credit card was charged THREE TIMES for this program.  I contacted my credit card company and submitted non-fraud refusal of payments on 2 of the charges.The company seems to think the program loaded successfully on my computer.  It didn't, and I have no use of the program.  I do have the company icon showing, but it on takes me to the \"free program\" with a screen that only offers more additions at another charge.I am totally fed up with this program and demand a total refund of the 3 charged amounts ($29.95 x 3)"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stanley W",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T17:25:34.000Z",
          "Titre": "Bait and Switch",
          "Contenu": "Bait and Switch.  Shame on youEpson V600 displays as readable.  Purchase your product and the scanner does not appear."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "BRENDA L",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T18:42:46.000Z",
          "Titre": "No sound on computer",
          "Contenu": "I purchased Driver Easy to update drivers on computer in order to restore sound on my computer.  They updated all drivers; however, it did not restore the sound.  This was a money back guarantee and they immediately reimbursed me since this product did not work."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "d lieffering",
          "Nb_Reviews": 1,
          "Date": "2023-04-23T21:18:04.000Z",
          "Titre": "complete and total scam",
          "Contenu": "complete and total scam, never download! doesn't really do anything and i've read multiple sources stating it doesn't update anything but just downloads bloatware. i seriously doubt any of the positive reviews are real but i could be wrong."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Chris Dale",
          "Nb_Reviews": 5,
          "Date": "2023-05-19T09:34:34.000Z",
          "Titre": "I took out the sub because usb 3 port…",
          "Contenu": "I took out the sub because usb 3 port is not recognizing all my external hard drives.  After upgrading to th professional version I still have the same issue.  Nothing has changed so I have wasted my money"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Peter",
          "Nb_Reviews": 3,
          "Date": "2023-08-17T04:05:21.000Z",
          "Titre": "Looks like I'm not alone here",
          "Contenu": "How can I be constructive when your software can't even run a backup.Please do not tell me to write a useful review when a simple backup never ends.Genuine Experience??Are telling me that I'm a LIAR???Do have the guts to keep this rate public?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tom McGrath",
          "Nb_Reviews": 3,
          "Date": "2023-10-02T01:47:25.000Z",
          "Titre": "Borderline Fraud…",
          "Contenu": "Your add on Google was completely misleading.My problem was finding a missing print driver which your app was completely unable to deal with"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "GENEVA",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T23:09:16.000Z",
          "Titre": "still outdated",
          "Contenu": "i fownloaded them and it is still telling me they are all outdated. it now says i need to purcghhase an additional program to actually install the uodates"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Marianne",
          "Nb_Reviews": 3,
          "Date": "2023-10-05T23:57:56.000Z",
          "Titre": "I asked for help since 5 drivers could…",
          "Contenu": "I asked for help since 5 drivers could not be updated and your answer is \"rate your experience\".Is that the help you promise ???If that is your answer, I apply herewith for a REFUND OF MY MONEY FOR A SYSTEM THAT DOES NOT SEEM TO WORK FOR ME.Please reply ASAP with your answer.Thnk you,Marianne Teske."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "bradley",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T21:19:06.000Z",
          "Titre": "Don’t buy premium",
          "Contenu": "Bought premium went to activate and kept freezing only during activation"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Forest",
          "Nb_Reviews": 2,
          "Date": "2023-04-12T21:11:02.000Z",
          "Titre": "This company is terrible. 100% Trash",
          "Contenu": "This company is terrible and operates more like a scam corp than a real business. Customer support does not exist and you can try to contact them but you will wait 2 or more days for a response if ever. They will take your money in seconds but you will not get an activation key and so far even with tickets turned in to address the issue no one responds and you pay for software you never receive.Worst company I have ever seen and I would call it a scam corp in my opinion. Don't use this company if you do not want to lose money and time and have tons of frustration."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JimK",
          "Nb_Reviews": 2,
          "Date": "2023-05-02T21:21:57.000Z",
          "Titre": "This was my second bad experience with it. I'm done.",
          "Contenu": "Today was the second time I installed a recommended driver update for my graphics card. Immediately after doing so, I lost audio (and I was scheduled for an online conference in just a few minutes). My second monitor screen just went black. Checked all connections; everything was tight. Tried a restart. Then my keyboard didn't work! I called my tech support person, who helped me restore the system to just before the update. Then we deleted the DriverEasy. That was $35 for the service call. Previously, it was over $100 to get things restored.. Be careful what you download. It asked if I wanted to install the update. Of course, that's why I got the program. Maybe it did not completely or correctly install the update? Whatever the reasons, I uninstalled the DriverEasy program today and will not recommend it."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "David Brooks",
          "Nb_Reviews": 4,
          "Date": "2023-09-19T13:27:57.000Z",
          "Titre": "Updated all the drivers it found that…",
          "Contenu": "Updated all the drivers it found that needed updating and my PC was stuffed. Internet, mouse all locked. Had to restore to a Macrium Image which took me hours."
        },
        {
          "Note": 1,
          "Lieu": "UG",
          "Pseudo": "zephaniah",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T00:13:24.000Z",
          "Titre": "Well it did not solve the problems I…",
          "Contenu": "Well it did not solve the problems I had on my laptop. Even after buying the 17updates .My desktop continued with the mouse just blinking not selecting things in time,overloading for hours yet having alot of space"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "High Altitude Rhubarb",
          "Nb_Reviews": 2,
          "Date": "2023-05-01T05:02:23.000Z",
          "Titre": "Drive Easy has a webpage claiming it…",
          "Contenu": "Drive Easy has a webpage claiming it can be of value solving the Windows 10 problem of Windows WiFi software not running on this computer.  It was of no help whatsoever but wasted a great deal of my time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Louis Markoya",
          "Nb_Reviews": 3,
          "Date": "2023-06-11T05:37:30.000Z",
          "Titre": "I used your product to correct occasional screen flashes",
          "Contenu": "I used your product to correct a blinking screen, which worked, but...after I updated my drivers through your program I lost all sound in my system...in fact it did not even recognize the speakers after the update2 days later I am still without sound and am exhausted from trying and totally frustrated"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jaime Frias",
          "Nb_Reviews": 2,
          "Date": "2023-07-25T00:15:45.000Z",
          "Titre": "Disappointed",
          "Contenu": "The reason why I got Driver Easy was that, even though my Window 11 laptop is fully and functionally connected to the Internet, the Wi-Fi network adapter keeps disconnecting. I was told that updating its drivers would help, but installing Driver Easy has made absolutely no difference."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark E Grossi",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T21:36:29.000Z",
          "Titre": "Easy!!!!",
          "Contenu": "Easy!Rules- too many and hard to understand the procedures.I don'nt understand saved copy of electronic saving on my pc.Difficult to understand all the rules."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Clifford",
          "Nb_Reviews": 1,
          "Date": "2023-07-23T00:06:06.000Z",
          "Titre": "I ask for help",
          "Contenu": "I ask for help. I never received a response. I have tried to get this printer to work for several weeks now and still not working. I bought this cheap HP printer because my big HP 4620 printer won't print after I spent big money for ink and it won't print.. I've owned  5 or 6 HP printers that worked  well, including the 4620 until I replaced the ink. I also replaced the ink in this 3772 and nothing. That's when I asked for help,  nothing.."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "w b",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T17:10:11.000Z",
          "Titre": "bad driver install for",
          "Contenu": "ethernet driver was wrong it installed had to get geek squad to help. kept mr of line 4 days/ UNHAPPY with this program. uninstall"
        },
        {
          "Note": 1,
          "Lieu": "HU",
          "Pseudo": "haffner",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T01:15:42.000Z",
          "Titre": "Give my money back",
          "Contenu": "Give my money back. Downloaded a corrupted driver update and ruoned my whole laptop. Needed to reinstall everything!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Benjamin",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T20:52:45.000Z",
          "Titre": "It didn’t update my graphics driver",
          "Contenu": "I was getting a notification that my graphics driver needed to be updated so I paid for the pro version of Driver Easy. After using it, my computer still said the graphics driver needs to be updated."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "pw003",
          "Nb_Reviews": 2,
          "Date": "2023-07-11T02:39:45.000Z",
          "Titre": "Single driver needed, didn't work, ended up with 37 that I don't know whether they work either.",
          "Contenu": "I needed a single driver for connecting the audio from my Dell Laptop to my Samsung screen.  The answer was that I got no sound at all.  I bought this driver plus 36 others.  The main one I needed doesn't work.  I have no idea about the other 36.  Cannot recommend purchasing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ed",
          "Nb_Reviews": 3,
          "Date": "2023-11-25T22:42:12.000Z",
          "Titre": "Can't get a driver for Acer Asper5…",
          "Contenu": "Can't get a driver for Acer Asper5 model N19C3 for touch pad or sound. That`s all I wanted it for."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Freecons Gaming",
          "Nb_Reviews": 3,
          "Date": "2023-07-08T04:52:40.000Z",
          "Titre": "Can't get a response back on my email",
          "Contenu": "Can't get a response back on my email, bought this, didn't get a license key for my other 3 computers, won't make this mistake again!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-04-25T04:08:54.000Z",
          "Titre": "Messed things up",
          "Contenu": "Updates made my graphics card incompatible with my processor and somehow managed my wifi. The IT technician then attempted to sell me their services to pay more money to get my computer fixed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cole",
          "Nb_Reviews": 1,
          "Date": "2023-04-23T23:50:26.000Z",
          "Titre": "Made my laptop run like garbage and…",
          "Contenu": "Made my laptop run like garbage and when I rolled it back it deleted my windows installation and bluescreened me. Cost me $100 at microcenter to fix on top of the price of the application. Garbage."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2023-05-28T23:07:38.000Z",
          "Titre": "Tried using the free version to update…",
          "Contenu": "Tried using the free version to update my integrated graphics driver. The download was so slow then quit.Feel it was just a bait-and-switch to upgrade to the Pro version."
        },
        {
          "Note": 1,
          "Lieu": "BE",
          "Pseudo": "Tomasz",
          "Nb_Reviews": 1,
          "Date": "2023-08-27T15:57:13.000Z",
          "Titre": "Program can’t help",
          "Contenu": "Program can’t help, windows after install drivers restart and turn on win when any drivers was installed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jacquie Waring",
          "Nb_Reviews": 2,
          "Date": "2023-11-13T01:02:29.000Z",
          "Titre": "Did not correct my problem?",
          "Contenu": "I used the program, however, it did not correct my problem."
        },
        {
          "Note": 1,
          "Lieu": "SA",
          "Pseudo": "EST",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T04:46:48.000Z",
          "Titre": "The price is high compared to the…",
          "Contenu": "The price is high compared to the service. I think you should have better pricing strategy.Thank you for the great app anyway but I don’t think I’m going to renew because of the pricing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joseph",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T20:12:14.000Z",
          "Titre": "This program is dangerous",
          "Contenu": "This program is dangerous.  It screwed up everything on my computer.  Made my \"slave\" printer un-usable.  Do NOT download this program.  It will be the worst thing you could do to your computer"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Boluwatife",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T22:32:07.000Z",
          "Titre": "Bad Drivers",
          "Contenu": "When using it to update my drivers it caused me to have to reset my entire computer because of faulty drivers"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rhiana",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T05:09:39.000Z",
          "Titre": "Save your money...scam.",
          "Contenu": "I was researching how to fix a printing problem online and I took a gamble with this company/business, which was a \"sponsored ad\" at the top of the Google results. Immediately upon downloading my computer was acting boggy and glitchy. I was prompted to download the file repeatedly for roughly 5 minutes and finally I lucked out with a working file. After the program scanned my computer (very quickly might I add, I was impressed.) I was subsequently asked to download over SIXTY drivers. Now I know I am a little behind when it comes to technology, so I must assume part responsibility for operator error, but the program was basically harassing me and the trickery aspect of their marketing was obviously apparent. Needless to say, I reluctantly entered my payment information with a sense of calamity through their posted \"money back guarantee\". Once I realized I had been had, it was too late because even though I received a very prompt and punctual automated response to my refund request with a ticket number, I have yet to be followed up with by any company personnel... over a week later, still nothing. Keep your money and save your time. This appears to be nothing more than an intentionally confusing click-bait scam."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Simon",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T22:43:18.000Z",
          "Titre": "Drivereasy caused printer problems",
          "Contenu": "Running Driver Easy caused my printer to stop printing. I had to run Restore to return my computer to an earlier date.  Then two weeks later they charged my VISA an extra $106."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 8,
          "Date": "2023-09-04T13:44:13.000Z",
          "Titre": "Your tech people never reached back to…",
          "Contenu": "Your tech people never reached back to me. You are a sorry organization.However, you app is very good. I won’t be renewing when the time comes!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Michael Longstaff",
          "Nb_Reviews": 4,
          "Date": "2023-09-25T11:42:11.000Z",
          "Titre": "I ran driver easy which updated 20…",
          "Contenu": "I ran driver easy which updated 20 items since the updates I have no keyboard and have to use onscreen keyboard"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carlos",
          "Nb_Reviews": 1,
          "Date": "2023-07-23T16:38:41.000Z",
          "Titre": "Do not recommend",
          "Contenu": "Extremely hard to use once you pay the membership.Also, automatically upsell when you request help via the website chat."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Yousuf Chowdhury",
          "Nb_Reviews": 3,
          "Date": "2023-07-17T06:41:03.000Z",
          "Titre": "My review of \"Hellish\" Driver Easy",
          "Contenu": "Driver easy is super crap. I done a amazing fresh install of Windows and it was running fine. But I didn't have the drivers to access my data drive that was connected on the scu sata port on my motherboard and the driver to be able to use an xbox controller on my PC. So I installed Driver Easy and then proceeded to update all my drivers; as although I didn't need them, I thought it would lead to greater performance and benefits. To my dismay, this application's automatic Driver updates caused my PC to become superslow and caused an error with the in built graphics card on the motherboard. The paid service which is designed to improve PC experience done the exact opposite.To add even more insult to injury, the driver easy program failed to create a system restore point before updating the drivers, thus making it very difficult to rollback the negative changes.I was able, by the grace of God, to reverse some of the damages caused by this program by downloading drivers from my motherboard's manufacturer website. But still, my PC is not as fast as it was compared to before it was attacked by DriverEasy!All in all, from my experience I recommend to absolutely avoid this malicious program as it seeks to destroy PCs and not improve them!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marc S Silverman",
          "Nb_Reviews": 3,
          "Date": "2023-11-11T23:04:48.000Z",
          "Titre": "Name\tAMD High Definition Audio Device",
          "Contenu": "Name\tAMD High Definition Audio Device  Could not find Sound Card."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MARYANN KLIMASZEWSKI",
          "Nb_Reviews": 2,
          "Date": "2023-05-31T21:00:39.000Z",
          "Titre": "Horrible company",
          "Contenu": "Horrible company. Never did what it said it will do. Their guarantee is fake, they are very simply liars. Do not purchase, unless you have the time to haggle with them, over a refund, and then you never get it!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Larry",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T13:25:33.000Z",
          "Titre": "my computer is slow than before driver…",
          "Contenu": "my computer is slow than before driver easy, plus still have programs not responding."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jon",
          "Nb_Reviews": 1,
          "Date": "2023-04-16T23:12:04.000Z",
          "Titre": "It didn't do anything except disappear…",
          "Contenu": "It didn't do anything except disappear from my screen when I clicked on update button.  For details see my ticket number 90389 filed yesterday."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Patrick",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T09:55:26.000Z",
          "Titre": "Laptop Keyboard wont work after…",
          "Contenu": "Laptop Keyboard wont work after runningDriver easy I have spent hours with no suscess. I now have to use external keyboard"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "vernon",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T14:28:07.000Z",
          "Titre": "after downloading your drivers the…",
          "Contenu": "after downloading your drivers the speakers on my laptop still do not provide sound. However, the audio jack does work."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Mahir",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T20:33:26.000Z",
          "Titre": "My computer experienced an error",
          "Contenu": "My computer experienced an error. it cant acces the boot device. this happend after i restarted to update my drivers."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "PHUONG NAM",
          "Nb_Reviews": 2,
          "Date": "2023-05-09T05:35:32.000Z",
          "Titre": "i updated it and it restart the…",
          "Contenu": "i updated it and it restart the computer and just stuck in the loading logo . second PC got this problem and their solution is just add 3 free months to the account even cant use the computer. what a scam"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William A.",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T20:33:31.000Z",
          "Titre": "I purchased it to resolve a problem I…",
          "Contenu": "I purchased it to resolve a problem I have with my WiFi driver but it didn't help.  The interface and everything is worked as expected."
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "curtis",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T10:17:25.000Z",
          "Titre": "Not working at all it gives older…",
          "Contenu": "Not working at all it gives older drivers, I just paid for nothing"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Patrick",
          "Nb_Reviews": 5,
          "Date": "2023-07-10T03:35:03.000Z",
          "Titre": "After using the automatic update",
          "Contenu": "After using the automatic update, my computer using win 10 takes at least 10 min to load a program. I am extremely disappointed"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "thomas",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T01:10:36.000Z",
          "Titre": "u don't seem to be able to fix things",
          "Contenu": "u don't seem to be able to fix things or respond in a timely fasion"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rocco",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T21:02:45.000Z",
          "Titre": "Previously I had used DriverEasy to…",
          "Contenu": "Previously I had used DriverEasy to update drivers on my system. It worked fine before. I have a newer system and when I went to resurect it, I needed some updates but my license had expired and I needed to get a new one. So I bought a new license and updated 23 drivers. I asked for the system to crate a backup. Went through on system 1 but there must be a HD issue as the Disk 0 is maxed at 100%. So I figured, I bought this so lets use this on my daily system which is working fine. Created a back up point. Updated 23 drivers but now I have system bugs. My dual monitors go black when I am presenting in Teams and Zoom. They go black when I go to websites. Absolutely ridiculous. Support is not helping very much. Also the system did not create a back up point in my drivers so now I am asking the support to tell me what is friggin WRONG WITH MY COMPUTER THAT WAS WORKING FINE BEFORE!!!!! I hope they fix this cause I'm kind of a little &^%$$#$%%# mad about this right now.... as you can tell."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Da Truth",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T05:11:39.000Z",
          "Titre": "Do not use",
          "Contenu": "Do not use! Bricked my pc and forced me to rollback to an older version before downloading and using Easydriver"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paul Karchesky",
          "Nb_Reviews": 2,
          "Date": "2023-05-19T01:20:52.000Z",
          "Titre": "Lots of fails",
          "Contenu": "After two days of working, trying to use this it still fails. I went through the FAQ's and still could not get it to work. I emailed support with full screen shots of the error. I'm still waiting for a reply. I'm pretty knowledgeable with computers and it is still failing. I have now also asked for a refund. This was such a good idea that I would have used it on all 3 of my computer, if only it worked."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Alex McLeod",
          "Nb_Reviews": 2,
          "Date": "2023-08-27T00:03:20.000Z",
          "Titre": "Driver downloaded and installed the…",
          "Contenu": "Driver downloaded and installed the incorrect mother board driver so communications card did not work.  Customer had to troubleshoot by contacting manufacturer website, locate, download and install correct driver to solve the problem,"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 2,
          "Date": "2023-05-22T00:45:42.000Z",
          "Titre": "Too complicated switching from free to…",
          "Contenu": "Too complicated switching from free to pro. Paid the money and could not complete the process. Please return my money.Michael Boudrie"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 1,
          "Date": "2023-06-17T00:36:34.000Z",
          "Titre": "Error second day !!!",
          "Contenu": "Second day and error.Unable to process.Reported, waiting for response.I hate this crappy stuff."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lauren",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T18:22:00.000Z",
          "Titre": "Unnecessary product aimed at people who…",
          "Contenu": "Unnecessary product aimed at people who don’t know better than to not use this"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "kelly",
          "Nb_Reviews": 1,
          "Date": "2023-04-23T02:19:59.000Z",
          "Titre": "Made my laptop inoperable",
          "Contenu": "Made my laptop inoperable. Flashing between screens. Still waiting after 5 days to hear back from company so in the mean time I have no lap top"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Frank Certo",
          "Nb_Reviews": 2,
          "Date": "2023-07-11T02:34:52.000Z",
          "Titre": "Don't bother",
          "Contenu": "Don't bother. Never fulfilled case. Ended up paying for HP support anyhow."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert a Jensen",
          "Nb_Reviews": 1,
          "Date": "2023-04-26T10:06:17.000Z",
          "Titre": "I bought this software call them said…",
          "Contenu": "I bought this software call them said it would put a ticket in and someone will get back to you and Iam still waiting"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 2,
          "Date": "2023-11-18T23:52:36.000Z",
          "Titre": "Not impressed waste of 26 or 32 bucks I…",
          "Contenu": "Not impressed waste of 26 or 32 bucks I guess I would like my money back"
        },
        {
          "Note": 1,
          "Lieu": "SA",
          "Pseudo": "zolwag",
          "Nb_Reviews": 3,
          "Date": "2023-05-13T02:52:08.000Z",
          "Titre": "easy driver wasnt the right choice…",
          "Contenu": "easy driver wasnt the right choice because it downloaded wrong drivers for my pc specs. i am not renewing after this."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T16:00:03.000Z",
          "Titre": "I am still waiting for your reply to my…",
          "Contenu": "I am still waiting for your reply to my email asking how to fix the video driver upgrade that blanked out my screen. Is that reply coming?After reply: They are correct, they did reply on 18 Dec, and it was in my spam folder. I will now (20 Dec) try their new suggestions."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jba Jba",
          "Nb_Reviews": 3,
          "Date": "2023-11-28T04:16:47.000Z",
          "Titre": "I like that the software seems to help",
          "Contenu": "I like that the software seems to help, but the problem remains.My cursor was disappearing for minutes at a time. Now, it just disappears for 20 seconds."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Axel",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T17:11:52.000Z",
          "Titre": "Connection issues",
          "Contenu": "The moment I updated my driver's my PC immediately had \"connection  issues\" however after booting up a restore point (very easy to do) my issues got better but not completely fixes"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Casey",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T18:52:05.000Z",
          "Titre": "Worked great in the past. Blue screen of death this time",
          "Contenu": "I have used Driver easy many times before and had no issues and simplified the process. This last round, DE literally crashed my computer when it got to the AMD drivers. Took me an entire day to get things back to working and multiple system restores. I ended up having to install each driver individually until i found the one causing the issues... was extremely frustrating."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Vlad",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T00:12:32.000Z",
          "Titre": "Didn't fix my driver issues",
          "Contenu": "Didn't fix my driver issues, just another bit of predatory software. I requested some support, it took a couple days for them to get back to me and the email was just \"sending my issue to a higher level tech.\""
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T22:02:01.000Z",
          "Titre": "Driver Easy did not resolve my audio issue though the Team seems committed to help me one way or another",
          "Contenu": "A short summary: Driver Easy did update my drivers that were out of date, but the updates did nothing to resolve my audio issue   || Driver Easy updates did nothing to resolve my audio issue. (I have already submitted this information earlier through your website.Description:My problem started 6 months ago when my computer's motherboard failed.  My computer is a HP-Pavilion 27\" Touch Screen All in One - Intel Corei7   12GB Memory - 256B Solid State Drive.  Anyway, when my computer was returned from Best Buy's \"Computer Center\", with a new motherboard, my audio would not work despite the fact the built-in speakers were connected.  Somehow the computer was not recognizing that the speakers were in place ... When one right hand clicked on the Speaker Icon the drop down showed the “Speaker Set -Up (Unknown) - OFF\".  Well, long story short ... the store, itself, did \"something\" and got the speakers to work again but the manager told me a future Windows update might disable the speakers again.  Well, yesterday I had two Window 10 updates which did nothing to my speakers, but my Windows Search feature became disabled (which has happened before) so I tried my usual fixes, and nothing happened.  So, then I backed out the updates and still nothing happened.  It was then I downloaded Media Creation Tool I22H2 (which was advertised to fix this issue) and did fix my Window Search problem but somehow now has disabled my speakers!  I then searched the internet for how to fix the speaker problem and came to Driver Easy which I purchased and updated my drivers which has not solved my issue.Sorry for such a winded story but I want to give you all the details.  Sincerely,Thomas Diemer"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T02:43:51.000Z",
          "Titre": "I don't need the program but I will try it as it is already installed.",
          "Contenu": "Sorry I bought your program as I was having a problem with my Vantec Model: UGT-PC3A2C card which worked fine till I reinstall Windows 11. I tried your program which did not work for this. I reinstalled windows again with no luck. I then removed the card from the computer and used the computer for a few days and then reinstalled the card which still does not work so I am going to try a different Brand of card. I hope that works. I had no problems with my Device Manager which said everything was working.I don't think it's your problem but it didn't help.Have a great day.Rick"
        },
        {
          "Note": 2,
          "Lieu": "HR",
          "Pseudo": "Ivica",
          "Nb_Reviews": 1,
          "Date": "2023-01-16T23:38:29.000Z",
          "Titre": "I bought Driver Easy to solve the…",
          "Contenu": "I bought Driver Easy to solve the problem with NVIDIA graphics card driver, which I could not install, after many attempts. However, Driver Easy did not help me at all. It is probably a good software when everything works fine, but does not solve your problems. In the end, I solved the issue with the help of other driver software."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jo",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T18:09:42.000Z",
          "Titre": "Auto renew option causes you to pay…",
          "Contenu": "Auto renew option causes you to pay more. It would be much better if the auto renew didn't make it that the price doubled the following year. I like the service, I just wish the pricing stayed more consistent with less surprises."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Scott Dailey",
          "Nb_Reviews": 2,
          "Date": "2023-08-11T14:46:16.000Z",
          "Titre": "It took several tries to update all of…",
          "Contenu": "It took several tries to update all of my drivers.  There were error messages initially, but eventually all drivers were updated.  Problem is my keyboard now does not work on my laptop.  I have contacted tech support which has requested much more information to resolve the problem.  I am currently gathering this information.  This certainly is not the \"two-click easy\" update process claimed in the ads.As of 8/11/23 problem still has not been resolved. I took the computer to a repair shop which solved some of the problems.  Driver Easy customer service wasn't much help, as they were slow to respond.  I have requested a refund of the purchase price.  Driver Easy created more problems than it resolved.  They should rename it \"Driver Difficult\"."
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "brett",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T08:13:59.000Z",
          "Titre": "Installed new drivers but hasn’t helped…",
          "Contenu": "Installed new drivers but hasn’t helped with fps.Customer service team helpful with other issues that could be affecting the lag while my son is gaming but nothing worked."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Marie",
          "Nb_Reviews": 3,
          "Date": "2023-08-30T08:00:36.000Z",
          "Titre": "Driver Easy did nothing to fix my printer problem.",
          "Contenu": "Driver Easy downloaded all the things it had & it didn't make a bit of difference in my printer continuing to say ERROR every time I turned it on. I think it must be that something in the printer itself has come loose or broken."
        },
        {
          "Note": 2,
          "Lieu": "PL",
          "Pseudo": "maki",
          "Nb_Reviews": 3,
          "Date": "2023-07-08T15:16:32.000Z",
          "Titre": "it's ok",
          "Contenu": "It does tell you which drivers need updating and most of the time it works okay. However, with their servers downloading at a speed of 55 KB it takes unnecessarily long. Also, it took me hours to download a graphics driver from their list that just turned out to be an incorrect driver."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Belgico",
          "Nb_Reviews": 1,
          "Date": "2022-12-23T18:29:07.000Z",
          "Titre": "I had problems with the wifi",
          "Contenu": "I had problems with the wifi, then I saw the truble asking me to update a driver  I see your invitation and I buy the product for 29 dollares gor a year service  after I scan my lopt top I haven't seen any fix trouble on my laptop, still having the same problem to get wifi  still running slowdece"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Douglas Standing",
          "Nb_Reviews": 2,
          "Date": "2023-05-26T01:28:47.000Z",
          "Titre": "Discrepancy suggesting update of Nvidia…",
          "Contenu": "Discrepancy suggesting update of Nvidia GeForce driver for Win7 with GTX 1080ti. Nvidia doesn’t have that driver version and their newer drivers support Win10/Win11 only. Where did the suggested driver version come from?  Driver Easy suggestions have otherwise been good so far."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sandra",
          "Nb_Reviews": 6,
          "Date": "2022-11-28T00:45:21.000Z",
          "Titre": "Hard brake or crash?",
          "Contenu": "If u live in a highly congested locale——you are going to have “hard brakes”. I’d rather a hard brake than a crash!And I don’t like the idea of an application telling me how I donor don’t drive. Younger people (<30) might not know how to drive without prompts—I do. I accident in over 50 years of driving."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gary Jon",
          "Nb_Reviews": 1,
          "Date": "2023-01-07T19:15:33.000Z",
          "Titre": "Keeps starting in the middle of my work…",
          "Contenu": "Keeps starting in the middle of my work day kicking me off the work I was trying to do. When I try to then close tabs and windows to correct issues it found it will not fix. When I rerun the scan see the issues when I click continue to fix it does not."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jimmy D",
          "Nb_Reviews": 1,
          "Date": "2023-03-19T15:39:18.000Z",
          "Titre": "Don't waste your money!",
          "Contenu": "It only fixes surface issues, not the bigger problems that it's advertised to handle. Windows and CCleaner can automate updating my drivers for free! Driver Easy is $30 for the same functionality.  Waste of money!"
        },
        {
          "Note": 2,
          "Lieu": "FR",
          "Pseudo": "Monika",
          "Nb_Reviews": 2,
          "Date": "2023-08-07T20:55:23.000Z",
          "Titre": "Dissatisfied",
          "Contenu": "May have only partially installed the product because it took so long to download.  It has not solved the problem by installing a driver for my older HP printer.  If I can not solve the problem in the next few says, I will cancel the product."
        },
        {
          "Note": 2,
          "Lieu": "JP",
          "Pseudo": "Keaton Watson KroeTheDragon",
          "Nb_Reviews": 2,
          "Date": "2023-11-05T00:32:41.000Z",
          "Titre": "Make sure it gets updated often",
          "Contenu": "Honestly driver easy was the reason I had to format my entire PC. A driver update was stuck and refused to download. With bad drivers I can't do my work."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stanley",
          "Nb_Reviews": 2,
          "Date": "2023-05-04T22:18:58.000Z",
          "Titre": "I needed to reinstall my network driver…",
          "Contenu": "I needed to reinstall my network driver which I somehow lost. I resubscribed thinking they would replace my network driver but alas it did not happen I had to hunt down the file at a proper site and install it myself."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sandra-North Charleston,SC",
          "Nb_Reviews": 15,
          "Date": "2023-02-22T20:58:03.000Z",
          "Titre": "Better Customer Service",
          "Contenu": "This company need to improve customer service. My old computer crashed, had to get a new one. Asked if I could use the drivereasy from my old laptop to my new one, NEVER got and answer, so purchased another, but will definitely not renew."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Harry",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T19:57:34.000Z",
          "Titre": "I hate having to fill out these…",
          "Contenu": "I hate having to fill out these reviews!     The fact that I needed you in the first place, was a debocle.     I needed one driver for a USB to serial adapter, it didn't work, I didn't need a scan of my entire system, to upgrade the drivers that I had that were already working."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kenneth",
          "Nb_Reviews": 1,
          "Date": "2022-12-24T00:19:35.000Z",
          "Titre": "Was not a good investment for me but that does not mean it would not be great for someone else.",
          "Contenu": "It really did not do much or find any drivers that needed to be upgraded. I just ended up buying a new battery for my Acer laptop. May have just been me and it probably is a great investment for others."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Ian",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T20:53:13.000Z",
          "Titre": "After using Driver Easy",
          "Contenu": "After using Driver Easy, I get a blue screen error (Windows 10Pro) every time I try to use my USB print server."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Liam Holl",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T20:44:03.000Z",
          "Titre": "other drive checkers that show updates but not drive easy not impressed with performance",
          "Contenu": "i have other drive checkers that show updates but not drive easy not impressed with performance. Will be requesting a  refund."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jamie",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T18:35:42.000Z",
          "Titre": "Didn't Work As Promised",
          "Contenu": "I only bought this product to fix an issue I was having, and the website I ordered it through recommended this for my specific problem.  It did not fix my issue.  I have emailed support and have not heard back anything."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T04:47:22.000Z",
          "Titre": "Still Waiting on Assistance or a Refund",
          "Contenu": "Below is a copy & paste of my emails describing my issue. Pease note that the first email starts at the bottom of the review. I am still open to your help if possible. My desire is to see if your techs can help resolve this problem. If not, I would like to receive a refund. Your integrity is at stake to keep your word in refunding my purchase of your product. I will change my review should you respond back whether I get a fix or a refund. Dan Gordon.-------------------------------------------------------------Daniel Gordon dangordon53To: Driver Easy support+id105871easeware.zendesk.comWed, Nov 8 at 7:09 PMLily, Thank you for responding back to my concern.Will this tech contact me by email or phone. Because of the all the scam calls I receive every day. They must identify themselves as Driver Easy tech. If they do not, I will hang up.  Should the tech desire a phone call.I would prefer the tech email me with an approximate time that the call will be made.Thank you for your assistance.Strength & Honor.Dan-------------------------------------------------------------\tLily Qiu (Driver Easy)Nov 8, 2023, 17:41 GMT+8Hi Daniel, Thanks for getting in touch. I'm sorry to hear you're having issues.  I'm not sure what to recommend here, so I'm going to escalate your ticket to our advanced technicians, who will be able to investigate further.  They'll be in touch soon. Kind regards, Lily Technical SupportDriver Easy-------------------------------------------------------------\tDangordon53Nov 8, 2023, 05:51 GMT+8Hi, my name is Dan Gordon,I have a set of X15 Ear Bluetooth Ear Buds that work great my Samsong phone and Lenvo laptop. But NOT on my EliteBook. So I did a web search and found this website. https://www drivereasy com/knowledge/solved-windows-10-bluetooth-audio-stuttering-issues/I went through each and every Fix on this page to resolve the issue.I paid for the Driver program in Fix 4. and went through Fix 5 to no avail.So, I went to Fix number 6 and installed \"Fortech\" which took care of some other small issues. But did not clear up the Bluetooth Audio Stuttering Issues.So, I am now at a loss of what to do. If this cannot be resolved, I would like a refund.Thank you for your assistance.Dan Gordon"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ML Jones",
          "Nb_Reviews": 3,
          "Date": "2023-03-29T11:33:12.000Z",
          "Titre": "I followed your instructions which was…",
          "Contenu": "I followed your instructions which was easy. Unfortunately it didn't solve my computer problem so it will have to go in the shop.  Otherwise, I think Driver Easy is a good product! So 5 stars for that!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2023-04-30T23:38:10.000Z",
          "Titre": "When I first used Easy Driver I thought…",
          "Contenu": "When I first used Easy Driver I thought it was the best ever. It downloaded drivers and installed in minutes, no matter the amount. But…when it came time for the end of my free trial….  I needed to install a large driver.. It found the Nividia driver and warned me it was large and it would take a long time unless I upgraded to the PRO version. I only needed the one driver so I didn’t go for the upgrade and started the download. It downloaded at about 57 mbs! It took 9 hours to download and install as the Easy Driver app throttled the download speed! They advertise the PRO version as being 10 times faster which is a normal speed of 517 mbs of any of my other downloads. I was held hostage by an App."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Simon Bateman",
          "Nb_Reviews": 6,
          "Date": "2023-09-07T13:26:59.000Z",
          "Titre": "Didn't meet expectations",
          "Contenu": "Out of the 26 Drivers out of date on my system Driver Easy only updated 5 of them. However a full refund was given without any quibbles"
        },
        {
          "Note": 2,
          "Lieu": "HR",
          "Pseudo": "Saša",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T10:05:45.000Z",
          "Titre": "I wasn't able to install Driver Easy on…",
          "Contenu": "I wasn't able to install Driver Easy on a Windows7 32bit. Being said, tool wasn't of much use in that particular case."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T22:58:31.000Z",
          "Titre": "Internet crashed",
          "Contenu": "Right after I updated all my drivers, I lost internet. I never had a problem with your program.This update SUCKS"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T16:39:04.000Z",
          "Titre": "It did not help",
          "Contenu": "It did not help.  My computer is not recognizing the drive.  It is spinning and seems to otherwise be okay. It's a Toshiba Canvio Connect II."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Georgia D",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T02:54:27.000Z",
          "Titre": "I can’t get back to the screen to put…",
          "Contenu": "I can’t get back to the screen to put my license key in so I can use your product. A person texted me once and I’ve never heard how to solve the problem."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MICHAEL STILL",
          "Nb_Reviews": 8,
          "Date": "2023-06-11T20:52:44.000Z",
          "Titre": "Drivers out of date were updated",
          "Contenu": "Drivers out of date were updated, but the lack of audio was not addressed. Microsoft tech support was able to resolve it."
        },
        {
          "Note": 2,
          "Lieu": "TH",
          "Pseudo": "Willem Van den Broek",
          "Nb_Reviews": 5,
          "Date": "2023-07-11T12:33:41.000Z",
          "Titre": "Problems with installation . What to do??…",
          "Contenu": "I have installed your program but I get a notification from OUTBYTE that There are still drivers to be updated ??!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jon W.",
          "Nb_Reviews": 1,
          "Date": "2022-11-28T00:48:39.000Z",
          "Titre": "not complete service",
          "Contenu": "You only completed half of the service.  Maybe I tried to start the program to soon, I don't know"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Kenneth Watters",
          "Nb_Reviews": 5,
          "Date": "2023-01-25T08:43:16.000Z",
          "Titre": "Purchased driver updater as keyboard saver???my Lenova…",
          "Contenu": "Purchased driver updater as my Lenova Thinkpad keyboard keys numerals and enter would not work. Updated all my drivers and still not working :-("
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ronj",
          "Nb_Reviews": 4,
          "Date": "2023-06-10T20:27:33.000Z",
          "Titre": "Well it didn't solve the problem but I…",
          "Contenu": "Well it didn't solve the problem but I fixed it by uninstalling AVGDriver Updater. Then reinstalled it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Cameron",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T11:33:32.000Z",
          "Titre": "Driver Easy not so easy…",
          "Contenu": "Driver Easy installed a WiFi driver on my computer that made it unable to connect with my Ethernet cable due to software/hardware issues which made uninstalling the driver a hassle because Driver Easy couldn’t connect to the internet in order to revert back to the original driver. I eventually got it fixed by connecting to a mobile hotspot and going into my settings to uninstall the driver Driver Easy installed and reinstall the original driver but overall the experience was not a good one and made me feel like I wasted $40."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Johnny",
          "Nb_Reviews": 2,
          "Date": "2023-06-05T08:02:32.000Z",
          "Titre": "I searched for a driver for a video…",
          "Contenu": "I searched for a driver for a video converter. Driver Easy popped up and I purchased thinking it would find a driver. It didn't. Out $32.35 and still no driver. I wouldn't recommend this."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ronald E. Wells",
          "Nb_Reviews": 1,
          "Date": "2022-12-18T02:35:20.000Z",
          "Titre": "Not sure what went wrong but I ended up…",
          "Contenu": "Not sure what went wrong but I ended up going to Dell and getting the Drivers I needed, Please refund my Money as soon as you can. Thanks"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T04:37:29.000Z",
          "Titre": "Was not able to install the software."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Matt Galey",
          "Nb_Reviews": 2,
          "Date": "2023-10-12T01:55:00.000Z",
          "Titre": "Not something I really need",
          "Contenu": "Not something I really need. Only found some driver updates for things I don't really use anymore."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Phil",
          "Nb_Reviews": 1,
          "Date": "2023-04-29T22:16:55.000Z",
          "Titre": "I bought the full product",
          "Contenu": "I bought the full product. It would not install the bluetooth driver for windows 11. Several emails to support and the problem is still not resolved. I do not trust this product."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Isaac Silas",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T02:23:21.000Z",
          "Titre": "Updating drivers messed something up",
          "Contenu": "I updated my drivers using pro version and it broke overwatch 2, every time I run the game after updating the drivers it immediately crashes with a message saying it was a problem with the drivers"
        },
        {
          "Note": 2,
          "Lieu": "BG",
          "Pseudo": "Venelina",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T08:46:34.000Z",
          "Titre": "It could not find and install the NFC…",
          "Contenu": "It could not find and install the NFC Proximity driver and the touchpad and pointer drivers."
        },
        {
          "Note": 2,
          "Lieu": "IL",
          "Pseudo": "שני",
          "Nb_Reviews": 1,
          "Date": "2023-02-20T10:17:36.000Z",
          "Titre": "Didnt solve my problem they miss some…",
          "Contenu": "Didnt solve my problem they miss some drivers that  i wqnted to fix on my device even in the pro"
        },
        {
          "Note": 2,
          "Lieu": "SG",
          "Pseudo": "Veena",
          "Nb_Reviews": 1,
          "Date": "2023-01-27T13:16:13.000Z",
          "Titre": "I subscribed because it was recommended…",
          "Contenu": "I subscribed because it was recommended to solve my problem with the keys on my laptop.unfortunately ,it didn't work."
        },
        {
          "Note": 2,
          "Lieu": "CN",
          "Pseudo": "gene",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T23:38:37.000Z",
          "Titre": "cpu issues",
          "Contenu": "Drive easy has not solved any of the issues im having with my items"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Laconic",
          "Nb_Reviews": 3,
          "Date": "2023-06-05T22:14:46.000Z",
          "Titre": "It fixed only one of my problems",
          "Contenu": "It fixed only one of my problems; it did not repair the drivers for my usb portals"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T19:46:03.000Z",
          "Titre": "App kept crashing",
          "Contenu": "App kept crashing, did not resolve my BSOD."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Larry",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T21:31:28.000Z",
          "Titre": "Program could not locate and update the…",
          "Contenu": "Program could not locate and update the wifi adapter"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "TIM",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T03:08:07.000Z",
          "Titre": "Delivered to the wrong door…",
          "Contenu": "Delivered to the wrong door instructions not followed"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T00:33:56.000Z",
          "Titre": "This software was not able to resolve…",
          "Contenu": "This software was not able to resolve my problem."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Tim",
          "Nb_Reviews": 1,
          "Date": "2022-11-21T04:44:16.000Z",
          "Titre": "You charged me more than price…",
          "Contenu": "You charged me more than price advertised when I renewed my subscription."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kenneth Heck",
          "Nb_Reviews": 2,
          "Date": "2023-07-14T22:54:08.000Z",
          "Titre": "I think the price is too high",
          "Contenu": "I think the price is too high. Compare to DriverMax and Driver Booster."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Barry",
          "Nb_Reviews": 2,
          "Date": "2023-10-25T22:54:12.000Z",
          "Titre": "did not do what I needed to fix the…",
          "Contenu": "did not do what I needed to fix the DX11 problem"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Wayne Wyatt",
          "Nb_Reviews": 3,
          "Date": "2023-03-07T22:46:40.000Z",
          "Titre": "You should of told me that Driver Easy…",
          "Contenu": "You should of told me that Driver Easy can't be used with iPads. But maybe you did, but I didn't see it."
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "Bruce",
          "Nb_Reviews": 1,
          "Date": "2022-09-14T10:39:26.000Z",
          "Titre": "App was easy to use but missed a lot…",
          "Contenu": "App was easy to use but missed a lot (about 30) updates that I should have got, some marked urgent and some more than a year old. I only found them when I contacted my equipment supplier (Dell) because of on-going problems. The Dell troubleshooter found and downloaded all the updates that Driver Easy missed and that solved my existing problems. I could NOT recommend Driver Easy."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Glen",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T03:17:13.000Z",
          "Titre": "The Driver Easy software did not fix my…",
          "Contenu": "The Driver Easy software did not fix my driver problem"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Casey",
          "Nb_Reviews": 1,
          "Date": "2022-10-28T18:43:28.000Z",
          "Titre": "Stopped working when I upgraded to pro",
          "Contenu": "Driver Easy has always worked when I needed to update my wireless driver but when I upgraded to pro, it couldn't update the driver"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "dustin",
          "Nb_Reviews": 1,
          "Date": "2022-08-22T04:30:51.000Z",
          "Titre": "Program works as advertised",
          "Contenu": "Program works as advertised. However I accidently allowed auto renew to be checked and CANNOT find where to cancel that. Seems to be hidden purposely (I wonder why). Program works but I wouldn't say it's worth more than $10 Total. I will cancel my account and never pay the auto renew price. There are cheaper options that do the same thing and don't charge you YEARLY. This is purely software not software as a service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Reed",
          "Nb_Reviews": 1,
          "Date": "2022-09-12T21:01:01.000Z",
          "Titre": "The primary reason I purchased Drive…",
          "Contenu": "The primary reason I purchased Driver Easy was to stop the infamous DPC Watchdog which was rebooting my hard drive almost every time I turned my computer on. I updated my drivers with Driver Easy and I am still having the same trouble with DPC Watchdog."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Joanne",
          "Nb_Reviews": 4,
          "Date": "2022-10-04T21:20:25.000Z",
          "Titre": "Incompatible",
          "Contenu": "Turned out to be incompatible with Windows 11. Stopped downloading at graphics. Did 16/25 updates though before I had to uninstall. I have requested a refund for the Pro version."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gary R",
          "Nb_Reviews": 1,
          "Date": "2023-05-06T00:20:52.000Z",
          "Titre": "Didn’t solve problems",
          "Contenu": "Didn’t solve problems. Four drivers not upgrade."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sean",
          "Nb_Reviews": 1,
          "Date": "2022-10-04T01:44:32.000Z",
          "Titre": "Good program, but clearly flawed...",
          "Contenu": "Things were going great with this app, no real problems and a simple, straight-forward UI.  But then I had to reset my computer because of some malware/bug problems and when I went to go install drivereasy on the same laptop, just reset, it denied me claiming device limit has been reached.  Very frustrating to be stuck with a freshly reset PC and no way to access the update driver functions I rightfully paid for. Oh, and the \"login\" to reset device associations direction is a dead end because i was never asked to CREATE a login for Drivereasy as far as i remember (and if I did then your reset password function is broken and not sending out reset links).  This COULD be a great program, COULD be a must-have for any PC, but some of your oporations still need work obviously.  Two days lag before you can expect a customer service reply?"
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "Heide",
          "Nb_Reviews": 6,
          "Date": "2022-08-16T23:24:05.000Z",
          "Titre": "Downloaded",
          "Contenu": "Downloaded. Seemed to be doing a great job of re installing the drivers I needed. But then keeps crashing computer. Stuck in an endless loop of, boot computer, try to download drivers, computer crashes, re boot computer :( So far not getting my $50 worth."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joe Ray",
          "Nb_Reviews": 2,
          "Date": "2022-09-30T00:38:26.000Z",
          "Titre": "Flustrating",
          "Contenu": "I am not up to speed with this stuff- Everyone wanted to help-- Could not figure out Where to go--Thanks--I did get it working on my own --do not know how???"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tom Myers",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T20:52:53.000Z",
          "Titre": "Doesn't work"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jan Rogers",
          "Nb_Reviews": 3,
          "Date": "2022-07-05T18:18:19.000Z",
          "Titre": "It was frustrating when I would receive…",
          "Contenu": "It was frustrating when I would receive instructions, follow them completely, and still the scanner would not work.It boiled down to checking a box that said W-11The people that were helping me were very kind to try and find what was wrong."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Merimac",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T12:12:17.000Z",
          "Titre": "Not performing as claimed",
          "Contenu": "It failed to update Bluetooth devices."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "matthew",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T03:57:22.000Z",
          "Titre": "It will not scan and then says error"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Patrick Evans",
          "Nb_Reviews": 2,
          "Date": "2022-09-11T21:59:23.000Z",
          "Titre": "Unsuccessful attempts to load/start Driver Easy",
          "Contenu": "I have tried repeatedly to load your program and activate it without success.  I need help, please call me at (561) 798-3785 and walk me through the process.  thank you"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Christopher",
          "Nb_Reviews": 2,
          "Date": "2022-05-03T21:12:06.000Z",
          "Titre": "Computer slowed down after running the…",
          "Contenu": "Computer slowed down after running the program.  I performed multiple cleanings and removal of bad registry keys and still, my Windows 11 has taken a step backwards with Driver Easy only finding 2 drivers needing updating.  $30 for 2 fixes that may have slowed my machine down is not good."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Andrew",
          "Nb_Reviews": 1,
          "Date": "2022-11-02T01:16:02.000Z",
          "Titre": "Had to reinstall network driver because…",
          "Contenu": "Had to reinstall network driver because driver easy installed a intel when I have AMD"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 2,
          "Date": "2022-03-20T19:26:59.000Z",
          "Titre": "I kept getting knocked off the internet…",
          "Contenu": "I kept getting knocked off the internet & remedied that by going back to an earlier version of Windows 10. I installed new drivers from Driver Easy . I'm still getting knocked off internet even though I uninstalled the adapters and restarted the computer. This is on 2 computers. Still working on issue."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2022-03-18T02:49:14.000Z",
          "Titre": "I purchased Diver Easy in hopes it…would work.",
          "Contenu": "I purchased Diver Easy in hopes it would solve my problem involving blue screen and WatchDog Violation. 3 or 4 drivers were updated. However, this didn't fix my problem.  It may have helped some in that it seems I am having fewer crashes, but it still crashes.  A lot of the time it crashes in sleep mode."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 2,
          "Date": "2022-01-27T05:19:53.000Z",
          "Titre": "I ran Driver Easy and now I don't have…",
          "Contenu": "I ran Driver Easy and now I don't have any audio on my laptop. It has not been easy, and my computer speaker and microphone are not working properly now. The follow up from customer service was well intended, but actually resulted in more problems. After spending several hours on it, I will probably be back to where I started before I ran Driver Easy.  I'm sure the software works for some people, but it did not work for me."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Brett",
          "Nb_Reviews": 1,
          "Date": "2022-01-14T23:37:14.000Z",
          "Titre": "Frustrated",
          "Contenu": "I am having an issue with my lap top. I did some research and was directed to buy and download Driver Easy to resolve my issue. I did this and I am still in the same place I was 5 days ago. Driver easy did not work to ix the issue and I am now waiting for there techs to do something to help me. It's taking far to long. So am not happy with the results I am having so far."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "TERRY WEST",
          "Nb_Reviews": 2,
          "Date": "2022-07-31T23:42:04.000Z",
          "Titre": "Failed in three ways",
          "Contenu": "I used driver easy on my surface laptop and it did one restart and would not work after that.  My computer was no longer able to sign into my work account for Microsoft and it didn't update anything"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jerry",
          "Nb_Reviews": 1,
          "Date": "2022-01-03T13:48:57.000Z",
          "Titre": "I do not know who to believe",
          "Contenu": "I was impressed when 11 drivers were found to be out of date and my internet speed increased moderately and my slow internet improved. Then I tested my internet speed and the number was very unimpressive. Then another company searched my computer for outdated drivers and found even more. Now I do not know WHO to believe??? My internet speed is still very slow after updating my drivers the first time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jill",
          "Nb_Reviews": 1,
          "Date": "2022-08-18T17:47:58.000Z",
          "Titre": "didn't really fix my connection problem…",
          "Contenu": "didn't really fix my connection problem with connecting with my monitor to my laptop (dp error), but it did run several things in the background - have no idea what impact that did."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 1,
          "Date": "2021-12-19T15:42:38.000Z",
          "Titre": "I do like the way driver easy applied…",
          "Contenu": "I do like the way driver easy applied pics to my devices after updating drivers, which is exactly as easy with 1 click as promised:however, it gave me an Error Message when it tried to up..... sound card (which is the reason I got it.  I've reached out to Microsoft and will follow up Monday.   Also will contact you if need be.  Busy time of year for everyone.        Thanking you"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2021-12-23T18:57:52.000Z",
          "Titre": "Great Product works great",
          "Contenu": "Great Product works great.  Auto-renewal was checked off when purchased.  After purchase I followed up on account to see if it was checked off and it was CHECKED ON, wow.  I had to uncheck it again.  The software should have a reminder but not 2 different things CHECK ON. The customer must go outside of the software to uncheck.  Reminders are great for renewal. thanks"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 2,
          "Date": "2021-12-12T18:17:17.000Z",
          "Titre": "Well for starters you could be more…",
          "Contenu": "Well for starters you could be more clear in your presentation of the stars.How they were presented to me was in a vertical column and no numbers whatsoever!I thought I was giving 4 stars assuming that the number of stars starts at the top being 1 star and ever increasing to 5 at the bottom.However that was a wrong assumption on my part.So in future try to make your survey clear and easy to understand."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Basappa Basu Gantotti",
          "Nb_Reviews": 7,
          "Date": "2021-12-19T20:14:11.000Z",
          "Titre": "God software but did not fix my issue.",
          "Contenu": "Though I felt it was easy to use and I may have downloaded some unnecessary drivers, the issue I had with a software remains. It did not help my issue at all. I will have to contact support for their suggestions. As I do download drivers for my hardware from the manufacturers directly on a regular basis, I do not see this software to be of much help to me. Perhaps for those who do not Know how to download drivers, this may be helpful."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2022-01-05T06:47:51.000Z",
          "Titre": "Basically Not Worth It.",
          "Contenu": "Basically, this program will only do what can be done manually in just a few minutes.If it were a lot cheaper, it might be worth having just to save a bit of time, but at its price, I just don't think it worth it.There are other programs out there that will do everything this does and a lot more at a cheaper price."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Richard Dannah",
          "Nb_Reviews": 2,
          "Date": "2021-10-26T10:42:39.000Z",
          "Titre": "help fix pen driver on a surface",
          "Contenu": "I was looking for easy driver to help fix the use of my touch pen on my surface, the easy driver found all other drivers except doing what I want it to do. I found no advantage in purchasing this software if it has done anything at all. It appears I waisted my money, even after doing required, 'I am not behind the door' and can usually work though problems and quite good with computers, but driver Easy did not help."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "sebastian garcia",
          "Nb_Reviews": 2,
          "Date": "2023-10-26T21:33:51.000Z",
          "Titre": "i dont know how to down load my drivers"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "S. Callan",
          "Nb_Reviews": 1,
          "Date": "2021-10-15T13:06:27.000Z",
          "Titre": "Unfortunately",
          "Contenu": "Unfortunately, I have only frustrated myself. I have a windows 10 laptop and I cannot use my flatbed scanner with it. Never had a problem with any other computers in the past but I've installed the driver from Xerox and installed, no luck, finally got driver easy and did all the installs and updates. Still, it says there isn't a driver or update the driver. I have given up for now but want to figure it out in the near future."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Happy Depressive",
          "Nb_Reviews": 1,
          "Date": "2022-08-30T03:19:20.000Z",
          "Titre": "I used to love Driver Easy",
          "Contenu": "I used to love Driver Easy, but Cclean now checks drivers and found 3 that Driver Easy missed. I was very disappointed and will probable cancel my subscription."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "E Hicks",
          "Nb_Reviews": 1,
          "Date": "2022-01-09T22:02:20.000Z",
          "Titre": "Computer Slowdown",
          "Contenu": "I paid for the premium version as I did not know what drivers would fix the problem I was having with audio-visual sync on sites such as YouTube, however I now have large amounts of slowdown across my entire computer, and I wouldn't even have any idea about which update caused it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Flavius Potopsingh",
          "Nb_Reviews": 6,
          "Date": "2021-10-28T18:47:18.000Z",
          "Titre": "Service installed 10/18/2021",
          "Contenu": "Service installed 10/18/2021. Did not solve problem with an installed driver. 2 requests made on 10/18/21 for technical assist: 49404 and 49406. On sixth business day after (10/25/2021), requested status update-no response as of today (10/28/2021). Customer service has been no-existent. Dissatisfied with service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2022-01-09T14:11:59.000Z",
          "Titre": "Had to reinstall Windows 10",
          "Contenu": "I needed a new driver for a network printer so I bought driver easy.  In addition it said that I needed 15 other drivers and one of the options was to update all.  I decided to update all since I had received notices that a video driver was outdated.  I updated them all and when I rebooted I received the blue screen which stated that there was a problem with the boot system and it was not correctable by microsoft.  I finally had to reinstall windows 10.  On the bright side the printer works and I have not received any of the previous notifications."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Matthew",
          "Nb_Reviews": 1,
          "Date": "2021-12-22T15:07:37.000Z",
          "Titre": "No change in operation.",
          "Contenu": "Driver Easy found and updated 31 drivers on my laptop.  However the operation and speed of the computer is no different at all.  Even after following other recommendations on the website the computer is so lagging and non-responsive that it is no more useful than a cinder block."
        },
        {
          "Note": 2,
          "Lieu": "MX",
          "Pseudo": "WILLIAM RICHARDS",
          "Nb_Reviews": 4,
          "Date": "2021-10-18T18:45:53.000Z",
          "Titre": "Driver Easy probably cleared up my main…",
          "Contenu": "Driver Easy probably cleared up my main problem that was the reason for my purchasing the program (missing touchpad driver which I deleted accidentally), but now my computer seems to be running slower and an Upgrade from Microsoft wasn't able to complete the process. It backed out restoring everything.Driver Easy after two attempts didn't seem to complete updating 18 drivers that were reported to need updating. I'm not sure how many remain or whether others still need replacement. The lack of info is disturbing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Deborah",
          "Nb_Reviews": 5,
          "Date": "2022-04-15T05:23:27.000Z",
          "Titre": "Not very happy",
          "Contenu": "I am having an issue with my network driver which is the reason I purchased this. It did not solve my problem. When I reached out to support she said she would have to escalate the tech issue and no one ever contacted me after that."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Greg Mott",
          "Nb_Reviews": 2,
          "Date": "2022-01-28T07:34:17.000Z",
          "Titre": "Not worth getting unless you are willing to pay",
          "Contenu": "\"Free\" product that goes out of its way to make doing its job unecessarily hard so you buy the pro version. I was getting fltmgr.sys blue screens, this product didn't fix. 2nd star is because they have the money back guarantee."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "John Needham",
          "Nb_Reviews": 5,
          "Date": "2023-12-11T11:47:08.000Z",
          "Titre": "Could not help me on this occasion",
          "Contenu": "My fairly elderly (tablet) computer had several issues which I hoped would be fixed by comprehensively updating thirteen drivers. Unfortunately though, doing so made matters worse. In fairness, Driver Easy did attempt to help me further but seemed unable to. In the end, without quibble, they refunded my year's subscription (and I bought a new device). A reliable and helpful company, at least."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Gary Neigum",
          "Nb_Reviews": 5,
          "Date": "2023-12-15T14:24:52.000Z",
          "Titre": "Multiple computer crashes",
          "Contenu": "I had to reinstall os the last 3 times after updating drivers.  I still don't know where the problem was so now I don't even want to use the program"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "William T.",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T00:03:20.000Z",
          "Titre": "The initial free version did not…",
          "Contenu": "The initial free version did not specify all of the things the software could do - and so I was drawn into purchasing the year license. That did identify and updated a number of drivers effortlessly and smoothly.It did not solve the original problem of why my computer can no longer access or read the DVD or SD card reader ( after last update to Windows 10)."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bruce",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T23:58:04.000Z",
          "Titre": "The free version is unuseable",
          "Contenu": "The free version is unuseable.  That may be intentional, for revenue.  It is still dishonest.  I fault your lack of ethical marketing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T07:58:26.000Z",
          "Titre": "Bit of a problem",
          "Contenu": "Seamed to work pretty well, until it killed my ethernet. Never was able to find it again, so I had to restore my windows 10 to a previous state. Haven't put Driver Easy back into the system, and won't, until I can figure out why my ethernet port disappeared. Made a mess by losing many of my programs."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ryoo",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T03:44:37.000Z",
          "Titre": "It worked great to update driver and my…",
          "Contenu": "It worked great to update driver and my gaming did not crash anymore.but it made mass up my Power Dvd 22 and could not reinstall the software somehow.even downloading the software from the company website and reinstalling the software did not work."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Allen Sternstein",
          "Nb_Reviews": 6,
          "Date": "2023-08-20T18:56:02.000Z",
          "Titre": "Good product but ran into audio driver issues",
          "Contenu": "After using the product on my new Acer Aspire 5 laptop running Windows 11. My Zoom audio wouldn’t work. Got tech support from Microsoft and then Zoom. Don’t think your product caused the problem, but there was no way to figure out if the drivers updated were a contributory factor or nothing to do with the problem. Microsoft uninstalled and reinstalled the audio drivers. Zoom tech uninstalled, reinstalled Zoom and ran a Zoom clear up app to remove any left over configs from all the previous attempts to fix things. Then ran an uninstall and reinstall. All ok now."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Middendorf",
          "Nb_Reviews": 3,
          "Date": "2023-09-22T18:57:33.000Z",
          "Titre": "Not intuitive at all!!!",
          "Contenu": "Not intuitive at all!!!I cannot believe that you did not at least have someone UNASSOCIATED with Driver Easy run through a \"most basic\" operation of finding dups and \"saving the dups\" to a folder. No user wants to \"automatically\" delete files without having saved the dups should an \"Oops\" have occur."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "paul",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T12:40:00.000Z",
          "Titre": "USB port driver fix",
          "Contenu": "My Toshiba laptop USB ports became inactive? I downloaded Driver Easy as a conduit for a repair. The software, driver easy did update any outdated drivers; however, my main necessity unfortunately was not corrected which led to the use of an actual computer technician."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Audra Kramer",
          "Nb_Reviews": 2,
          "Date": "2023-10-24T21:41:22.000Z",
          "Titre": "Not sure if it is worth it.",
          "Contenu": "I don’t know that it actually did anything beneficial for my computer. It said that it updated 32 drivers but I saw no improvement in the function of my device."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Taelonso Grim",
          "Nb_Reviews": 4,
          "Date": "2023-10-25T16:54:37.000Z",
          "Titre": "Only used it once",
          "Contenu": "So far I only used it once so I don't know much on how it will do so until I have used it a couple of times I won't know for sure if I will keep it or not"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "alison kirkbride",
          "Nb_Reviews": 8,
          "Date": "2023-09-15T09:54:19.000Z",
          "Titre": "Driver update error message",
          "Contenu": "I updated my drivers but got an error message for my graphic's card which I have reported - I had a quick message back saying they were looking into it but have heard nothing since. apart from that it seems to work ok"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jose F",
          "Nb_Reviews": 2,
          "Date": "2023-11-19T07:46:37.000Z",
          "Titre": "Didn’t really seem to do anything in…",
          "Contenu": "Didn’t really seem to do anything in terms of increasing performance with updates"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "P. Wynn Norman",
          "Nb_Reviews": 4,
          "Date": "2023-03-24T23:21:11.000Z",
          "Titre": "Instructions not clear",
          "Contenu": "Instructions not clear. Page wouldn't respond at times. Very frustrating. Ended up downloading twice and still don't know if it works. How about a simple step by step that is clear and includes an embedded link that provides additional information for people like me who are too stupid to figure out what you really mean or why something isn't working."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Randall B.",
          "Nb_Reviews": 1,
          "Date": "2022-12-25T17:17:43.000Z",
          "Titre": "just so-so",
          "Contenu": "I have another program, Driver Booster 10.1, that I have had for quiet sometime. I ran Driver Easy as soon as I purchased it, to be honest it didn't do much more than the one I have been using. If a person doesn't have a driver program it would be OK I suppose, but for me personally, it just is not worth the $30 to buy Driver Easy. So I gave it 3 stars ... it's OK but in my opinion it is just average ..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "carrielyn",
          "Nb_Reviews": 11,
          "Date": "2023-01-05T20:31:09.000Z",
          "Titre": "I really liked diver easy the first…",
          "Contenu": "I really liked diver easy the first time I had it. This time I purchased it and my computer stopped running I really don't understand it however I have wrote them and I'm sure they will take care of me. All and all the product is very good I don't know what happened this time it may be because I had to factory reset my computer before I had gotten the driver easy. However if your drivers are out of date please give them a try."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Judith K",
          "Nb_Reviews": 1,
          "Date": "2023-01-02T17:16:15.000Z",
          "Titre": "DriverEasy did not solve my problem",
          "Contenu": "DriverEasy has been very responsive, but it has NOT solved my problem, which is loss of use of my integrated laptop camera.  Both Krissy and Wes McCray have tried their best to help me with it.But because DriverEasy has not solved the problem, could you please refund my money as soon as it is convenient for you?IMany thanks and Happy New Year!Judith Cole"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "George",
          "Nb_Reviews": 1,
          "Date": "2022-12-19T22:25:45.000Z",
          "Titre": "Handy little bugger",
          "Contenu": "I love the fact that the application can provide a comprehensive analysis on dated device drivers. Install instructions were a bit confusing and misleading, but eventually worked out. I was apprehensive at first that the app was some type of malware.App is useless unless you upgrade to paid subscription, but the cost is minimal and covers 3 devices. Video device driver failed to install correctly with virtually no help on the issue or what to do about it."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Robert Sinclair",
          "Nb_Reviews": 1,
          "Date": "2022-12-06T21:13:09.000Z",
          "Titre": "Why Driver Easy needs to supply better product support",
          "Contenu": "The product works great, in both my cases the follow up support did not solve the problems I was having.For example I loaded the new driver/currently available driver and Windows 10 audio still does not workOn the other PC I downloaded Driver Easy, and when I went to upgrade to pro, I encounter an error and could not upgrade to pro, and I could not find the driver I need to make the system work on the hardwire ethernet.  So I still have not been able to use Driver Easy to get the driver I need."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "The Xrayman",
          "Nb_Reviews": 4,
          "Date": "2022-12-06T00:02:06.000Z",
          "Titre": "Causing more work than it is worth!",
          "Contenu": "Not happy.  This has happened twice now and always after I run an update with Driver Easy on my wife’s laptop.  It updates the Intel UHD driver and shifts it to 360 HZ so the laptop screen effectively becomes useless.  I spend the rest of the day figuring out how to isolate the driver properties and figure out how to set the display to 60 Hz.  When you “Update All”, it tells you that it is creating a restore point but when you go back in after it eliminates the laptop display, it shows that no restore points have been made."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Doc",
          "Nb_Reviews": 3,
          "Date": "2023-06-07T06:55:05.000Z",
          "Titre": "It does  GOOD JOB IN IDENTIFYING small…",
          "Contenu": "It does  GOOD JOB IN IDENTIFYING small drivers that are obvious. But, it doesn't dig deep enough into the device manager to elucidate those drivers off-line and connected to IBM-like drivers that perpetuate Windows display drivers. It is sufficient for the average user, but falls short for the advanced user."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "R Leo",
          "Nb_Reviews": 3,
          "Date": "2023-05-30T04:38:33.000Z",
          "Titre": "You say you update my Nvidia graphics…",
          "Contenu": "You say you update my Nvidia graphics card when in fact you do not.  Immediately after your scan I go to Nvidia and see my driver needs updating.  This makes me wonder if you are actually updating other drivers.  I don't have confidence in Driver Easy."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "george",
          "Nb_Reviews": 1,
          "Date": "2023-04-24T04:49:47.000Z",
          "Titre": "I selected your company after I looked…",
          "Contenu": "I selected your company after I looked for reviews of your prloduct and the reliability of the drivers you provided.  However after I purched you  product      and paid for the drivers I have been unable have them installed even though I provided the activation Key. I have been unable to have drivers installed.  You note that I am not connected to the internet, whicy is not true, and cannot activate the drivers I have paid for.  Pleast resolve this problem immediately or I will cancel my order."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Monty S",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T19:49:39.000Z",
          "Titre": "I like the program",
          "Contenu": "I like the program, I had 10 drivers that needed to be updated and it worked very well. The 2 issues I had was one finding the license key email for my second computer, I eventually found it the next from 2Checkout as the email title not Driver Easy. The second issue was my second computer had to roll back due to a failure installing the Video Driver and 13 other drivers. I then reinstalled the software and proceed to install each driver independently leaving the Video Driver for last, which worked but took up more time due to 4 or 5 restarts during this method."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "joe",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T14:55:03.000Z",
          "Titre": "i still can not get sound on my…",
          "Contenu": "i still can not get sound on my computer."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "ROYCE",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T19:12:03.000Z",
          "Titre": "ITS OK",
          "Contenu": "ITS OK, I FINALLY TRACKED DOWN A POSSIBLE REMEDY FOR WHY THE WINDOWS DESKTOP WAS FREEZING. I COULDN'T FIND ANYTHING IN DRIVER EASY THAT WOULD LET ME ROLL BACK A DRIVER FOR THE PROBLEMS THOUGH. PLEASE REMIND ME WHEN THE YEAR IS UP FOR THIS SOFTWARE AS I DON'T WANT TO RENEW THIS"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "J. Weirich",
          "Nb_Reviews": 2,
          "Date": "2023-04-15T19:12:20.000Z",
          "Titre": "I purchased after I was unable to…",
          "Contenu": "I purchased after I was unable to activate my Headphone jack after a recent update. Initially it seemed to work. The next Day when booting my Laptop Windows 11, I found again my headphones inoperative. Kinda dissapointed in the money I wasted."
        },
        {
          "Note": 3,
          "Lieu": "FJ",
          "Pseudo": "Dmitri",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T03:11:11.000Z",
          "Titre": "A major download failed twice",
          "Contenu": "A major download failed twice, timed out. the procedure for sending a screenshot hasn't worked. Waiting for advice; rating may improve if the problem is solved."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Ali",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T09:14:51.000Z",
          "Titre": "It does not detect all drivers in my pc…",
          "Contenu": "It does not detect all drivers in my pc for update. I have to use other driver updater like kerish doctor's driver update window to update the rest."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Hoss",
          "Nb_Reviews": 2,
          "Date": "2022-12-12T01:42:07.000Z",
          "Titre": "It's easy to use",
          "Contenu": "It's easy to use, nice that I can just que all the updates up at one time,even though you have to get the pro version. Didn't fix my Disk running at 100% problem, but that just means more than likely my HDD is dying."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Terry Tidwell",
          "Nb_Reviews": 6,
          "Date": "2023-02-18T04:10:43.000Z",
          "Titre": "Maybe it's just me......",
          "Contenu": "I purchased this because my monitor is blacking out randomly and in an effort to upgrade the drivers, felt that this app would help. Well, it hasn't, helped this problem at all, but I've noted that tab crashes are less"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mary Rose",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T16:16:50.000Z",
          "Titre": "Nothing is free like advertised",
          "Contenu": "Needed a sound driver update quickly and  saw this on a search and thought it was solution—free driver updates. If you have all the time in the world you probably could make it work. But having wasted a lot of time I bought service out of desperation. Worked ok."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Darrell",
          "Nb_Reviews": 4,
          "Date": "2023-05-05T05:11:25.000Z",
          "Titre": "Half way there",
          "Contenu": "I like that did instantly update and install, but it didn't trigger Auto connect with printer.  I do think MS blocked it although it say driver unavailable"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kay",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T23:51:59.000Z",
          "Titre": "Did not solve problems and after…",
          "Contenu": "Did not solve problems and after installing audio on computer stopped."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Ali",
          "Nb_Reviews": 3,
          "Date": "2022-12-22T01:21:42.000Z",
          "Titre": "It does not detect all drivers",
          "Contenu": "It does not detect all drivers for update. I used kerish doctor and iobit driver booster afterward as they detected a couple of more driver needing update. But driver easy is fast and convenient."
        },
        {
          "Note": 3,
          "Lieu": "ZM",
          "Pseudo": "Elvis",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T11:53:45.000Z",
          "Titre": "The software is easy to use and simple…",
          "Contenu": "The software is easy to use and simple to installAfter updating my drivers my computer could not function properly (it kept on starting and restarting with an error massage DPC watchdog violation)"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Brian Wilson",
          "Nb_Reviews": 7,
          "Date": "2023-03-02T00:39:26.000Z",
          "Titre": "Some of the drivers were not compatible…",
          "Contenu": "some of the drivers were not compatible with my PC however those that were installed without a hitchMy Laptop is 5yrs old and I suspect the other drivers were for a modern PCI  will write another review after I have tested it fully if like"
        },
        {
          "Note": 3,
          "Lieu": "PE",
          "Pseudo": "Victor Gaspar Berger",
          "Nb_Reviews": 2,
          "Date": "2022-12-19T08:31:22.000Z",
          "Titre": "It makes updating so easier but i has its issues",
          "Contenu": "It makes updating so easier, less time consuming and less stressful. However, when i updated one of the drivers my PC started having some problems and I had a difficult time fixing it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JOHNNIE C SAMPSON",
          "Nb_Reviews": 4,
          "Date": "2023-03-22T02:26:01.000Z",
          "Titre": "Not to bad as of now",
          "Contenu": "When I purchased Driver Easy, I expected to get only one driver I wanted. however, I got 16 drivers my computer needed, but did not get the one I needed the most and cause me to purchase this driver update program. However, they are working on it and trying to get me the driver I really want. the others are great for my computer as a whole."
        },
        {
          "Note": 3,
          "Lieu": "CH",
          "Pseudo": "Schriber",
          "Nb_Reviews": 1,
          "Date": "2023-03-05T14:14:54.000Z",
          "Titre": "Driver download has surely improved the…",
          "Contenu": "Driver download has surely improved the 12 year old system a bit. But I have still to look for other corrections to speed up especially starting speed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Phyllis",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T21:29:22.000Z",
          "Titre": "Confusing",
          "Contenu": "The actual program is very easy to use, but to find where to disable the renewable option is like trying to put a jigsaw puzzle together without the picture being printed on it. It is far too confusing to disable the renewal option, when one simple button that says to select whether you want it renewed or you don't is all it is needed."
        },
        {
          "Note": 3,
          "Lieu": "HR",
          "Pseudo": "Danijel",
          "Nb_Reviews": 3,
          "Date": "2023-05-07T15:42:34.000Z",
          "Titre": "big price for Pro version.",
          "Contenu": "big price for Pro version.other programs offer similar or almost the same for a lower price.the program is otherwise easy to use."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Douglas",
          "Nb_Reviews": 5,
          "Date": "2023-08-30T14:11:47.000Z",
          "Titre": "The loading and use of any new drivers…",
          "Contenu": "The loading and use of any new drivers has been straight forward. But after the first set of new drivers there has been a problem with my computer BIOS which as yet has not been solved ."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 4,
          "Date": "2023-08-23T01:56:44.000Z",
          "Titre": "I was hoping this would solve things",
          "Contenu": "I was hoping this would solve my problemIt’s difficult to say what the computer really needs but it wasn’t a driver too bad would’ve been an easy fix for a few bucks. Thanks anyway."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T05:14:15.000Z",
          "Titre": "I updated two drivers and it shut down…",
          "Contenu": "I updated two drivers and it shut down my Internet connection. I have reverted back to the old drivers. The Internet connection now works fine."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Luis",
          "Nb_Reviews": 1,
          "Date": "2023-04-02T06:11:24.000Z",
          "Titre": "I got this program in order to get an…",
          "Contenu": "I got this program in order to get an updated drive to my canon mg8380-c printer, but it did not. So so far it did not make any difference."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 1,
          "Date": "2023-01-14T05:16:23.000Z",
          "Titre": "Easy to use but...",
          "Contenu": "It was super easy to use, however, it did not fix my problems. I did respond to the automated email asking if my problems were fixed.. 24hrs later. No response."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "jayden",
          "Nb_Reviews": 1,
          "Date": "2022-11-26T07:48:37.000Z",
          "Titre": "did as it should have but...",
          "Contenu": "did as it should have but...driver easy did update some items on my computer, unfortunately i am unsure if they were helpful towards the issue or not."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David G",
          "Nb_Reviews": 1,
          "Date": "2022-11-22T13:25:50.000Z",
          "Titre": "You assume an automatic…",
          "Contenu": "You assume an automatic re-subscription.  I don't want your service.  I want to cancel it soon as I can.  It angers and frustrates me that I can't find a way to easily change the subscription type to \"nonrecurring\"!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "D Dave",
          "Nb_Reviews": 1,
          "Date": "2022-12-31T06:21:40.000Z",
          "Titre": "First time I ran the driver update I lost a monitor.",
          "Contenu": "Update: I was finally contacted by support. They gave me instructions for reinstalling the display adapter driver. That fixed it.----------------------------------I upgraded to Pro. The first time a ran the auto update, one of my monitors reverted to very low res and stopped functioning as a 3D monitor. This monitor is critical to my work. New 3D monitors are not available and used ones are very hard to find.I have not been able to roll back the driver update and I have not been able to do a manual update.A system backup was done before the update, but the system restore failed.I submitted a ticket almost a week ago and have followed up with reminders, but I have not been contacted by support.Driver Easy may not be responsible for the failure of the new driver, but they should be responsible for recovering the original driver and full functionality of the monitor."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Leslie Robinson",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T07:06:45.000Z",
          "Titre": "Unable to find the printer Drivers I need",
          "Contenu": "I have been unable to find the HP Printer drivers I needed.  I have Windows 10 compatible HP Printers.  UNable to get them to work on my HP Windows 11 Computer."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dwayne",
          "Nb_Reviews": 1,
          "Date": "2023-07-01T22:20:34.000Z",
          "Titre": "at 1st it was great then my pc crashed…",
          "Contenu": "at 1st it was great then my pc crashed and now I find trying to redownload is a pain, it keeps try to charge me again ."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mrs. Pratt",
          "Nb_Reviews": 3,
          "Date": "2023-10-30T06:28:26.000Z",
          "Titre": "Still the PC is slow",
          "Contenu": "Still the PC is slow. I haven’t notice improvement at all. Maybe later. I am still have two drivers that are not fixed."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Rick",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T01:30:05.000Z",
          "Titre": "Haven't noticed a change in the way my…",
          "Contenu": "Haven't noticed a change in the way my pc operates, so too early to tell."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "dougms1",
          "Nb_Reviews": 7,
          "Date": "2023-07-17T17:47:17.000Z",
          "Titre": "after using it mt entire system refused…",
          "Contenu": "after using it mt entire system refused to boot ,so had to use windows to repair my system"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T17:54:36.000Z",
          "Titre": "No product key in the email",
          "Contenu": "I didn't receive my product key in an email so that I could save it and I closed the page so I no longer can use it on other devices if I need to. It really should be common sense to provide the key. If I had closed the page before I used it I'd be out of luck. The product worked at least..."
        },
        {
          "Note": 3,
          "Lieu": "JP",
          "Pseudo": "ITSURO",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T23:25:32.000Z",
          "Titre": "Customer Service is good and polite.",
          "Contenu": "Although the trouble has not been fixed yet but at least the customer service is so good and polite."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mara",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T20:23:45.000Z",
          "Titre": "Driver updates",
          "Contenu": "The pop ups and downloading is confusing and looks like a scam. Product worked on one of my scanners but not the other. Could be more user friendly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marcia Miller",
          "Nb_Reviews": 14,
          "Date": "2023-08-07T17:56:44.000Z",
          "Titre": "Easy download, so-so installation, good function",
          "Contenu": "Easy to download, seems to work okay, but the process was tricky with too many repetitions, too many \"But wait! Just add this!\" screens."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steven Easterday",
          "Nb_Reviews": 3,
          "Date": "2023-09-02T01:10:50.000Z",
          "Titre": "The download and start up was ok for my…",
          "Contenu": "The download and start up was ok for my computer was ok. But they left off the instructions to add the program to my other 2 devices. Help?Steve 503.828.7144."
        },
        {
          "Note": 3,
          "Lieu": "NZ",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T22:50:07.000Z",
          "Titre": "Effective for routine drivers",
          "Contenu": "The application seemingly was effective in locating and installing the recommended system drivers even when the direct update from the motherboard's official website seemed to fail to install, but may not identify, find or install drivers for installed PCIe special cards outside of the routine system drivers, such as Intel VR WiGig PCIe card; leaving one's system still with an \"unknown device: with no driver."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2023-02-17T22:20:23.000Z",
          "Titre": "After upgrade to Pro download of…",
          "Contenu": "After upgrade to Pro download of drivers was extremely slow. Download timed out 3 times for 1 NVIDIA update."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "jesus leal",
          "Nb_Reviews": 1,
          "Date": "2023-04-09T17:40:52.000Z",
          "Titre": "it updated my drivers but made it VERY…",
          "Contenu": "it updated my drivers but made it VERY inconvenient to use unless i bought the pro version😮‍💨"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patricia Hopkins",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T02:37:32.000Z",
          "Titre": "It was easy to install",
          "Contenu": "It was easy to install. but unfortunately it didn't solve my problem."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 2,
          "Date": "2023-07-18T04:38:58.000Z",
          "Titre": "Did not work as promised",
          "Contenu": "I purchased it to solve my 100% disk activity problem. Easy to install easy to use but did not solve problem"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Thomas",
          "Nb_Reviews": 2,
          "Date": "2023-07-02T06:29:17.000Z",
          "Titre": "My security device tells me the memory driver is not turned on. I do not know how to do that.",
          "Contenu": "I found the program dows not include the memory driver. My security device tells me it is not turned on. I seareched all over and could not find how to turn the memory driver on."
        },
        {
          "Note": 3,
          "Lieu": "SK",
          "Pseudo": "Ladislav",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T19:01:50.000Z",
          "Titre": "My notebook died after i updated…",
          "Contenu": "My notebook died after i updated drivers..  but its a good app, but little overpriced i think.."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Bovie",
          "Nb_Reviews": 3,
          "Date": "2023-04-19T19:12:26.000Z",
          "Titre": "It updated 15 drivers but none of then…",
          "Contenu": "It updated 15 drivers but none of then solved my audio problem of max of 20% total volume"
        },
        {
          "Note": 3,
          "Lieu": "IL",
          "Pseudo": "haim",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T10:43:30.000Z",
          "Titre": "Helpful staff and customer service",
          "Contenu": "Helpful staff and customer service, but not all drivers are found like intel network adapters and generic pnp monitor, and more"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jerry",
          "Nb_Reviews": 3,
          "Date": "2023-03-31T23:24:57.000Z",
          "Titre": "I gave a 3 star because it did not take…",
          "Contenu": "I gave a 3 star because it did not take care of the issues I purchased the app for to start with."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steven Easterday",
          "Nb_Reviews": 3,
          "Date": "2023-01-25T07:00:19.000Z",
          "Titre": "Faulty printer/scanner driver....help!",
          "Contenu": "Where can Driver Easy help me with my laptop and printer/scanner interface?It doesn't work any better for me.Why?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "AKP",
          "Nb_Reviews": 1,
          "Date": "2022-11-22T17:33:59.000Z",
          "Titre": "It did not fix my main problem",
          "Contenu": "It did not fix my main problem, others were repaired, but the problem with my display still remains"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Wi",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T19:32:49.000Z",
          "Titre": "It's overpriced",
          "Contenu": "It's overpriced, but I think it fixed my driver issues."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 3,
          "Date": "2022-11-21T23:29:38.000Z",
          "Titre": "Keeps breaking my Intell I211 when…",
          "Contenu": "Keeps breaking my Intell I211 when doing driver updates. Other than that works fine."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Customer Robert",
          "Nb_Reviews": 8,
          "Date": "2023-08-21T08:46:45.000Z",
          "Titre": "Not impressed!",
          "Contenu": "It fails to deliver on its promises."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carol Ann",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T19:06:09.000Z",
          "Titre": "Download experience was not clear or…",
          "Contenu": "Download experience was not clear or easy."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "RT",
          "Nb_Reviews": 2,
          "Date": "2023-02-10T22:13:57.000Z",
          "Titre": "Fair product",
          "Contenu": "Fair product, limited usability but does job well."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2022-11-16T06:16:18.000Z",
          "Titre": "Won't stop asking for reviews",
          "Contenu": "Won't stop asking for reviews! I am a renewing customer, that alone should tell how I regard your app."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Morrill",
          "Nb_Reviews": 2,
          "Date": "2023-04-18T23:51:48.000Z",
          "Titre": "Very confusing plus unable to update…",
          "Contenu": "Very confusing plus unable to update all drivers"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "BloodyWarrior",
          "Nb_Reviews": 2,
          "Date": "2022-11-14T04:10:42.000Z",
          "Titre": "It does update your computer parts…",
          "Contenu": "It does update your computer parts faster but for me personally it didn’t solve my current problem I was having."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Anthony",
          "Nb_Reviews": 1,
          "Date": "2022-10-08T08:43:23.000Z",
          "Titre": "I got Driver Easy downloaded a few days…",
          "Contenu": "I got Driver Easy downloaded a few days ago. 14 improvements were made. Before I started using Driver Easy, my laptop would constantly be hot, very hot!! That issue has now largely been resolved.The cost of Driver Easy is affordable. The reason for not getting the 5 stars review is that other competitors say that I still have old drivers to upgrade. I guess you pay for what you get.Hey. I'm not complaining. It did the job!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michele",
          "Nb_Reviews": 2,
          "Date": "2023-02-10T20:31:16.000Z",
          "Titre": "Fixed the issue of my computer dropping…",
          "Contenu": "Fixed the issue of my computer dropping its internet connection, but now my video conferencing doesn't work."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dimetreus Griffin",
          "Nb_Reviews": 2,
          "Date": "2022-10-07T02:14:19.000Z",
          "Titre": "EASY  DRIVER IT WORKS…",
          "Contenu": "EXPLAINING  ABOUT EASY DRIVER IT WORKS BETTER BECAUSE I HAD 9 OUT DATED DRIVERS ON MY DEVICE AND NOW I AM FACING BLUE DRIVER NEEDS TO BE FIX AND I HAD PROBLEMS SINCE LAST YEAR AND STILL FACING THIS ISSUE TODAY AND THEY HAVE A TICKET FOR YHIS ISSUE AND WAITING FOR THEM TO REACH OUT TO ME IN MY E MAIL SO THAT I CAN MOVE FROM THIS ISSUE."
        },
        {
          "Note": 3,
          "Lieu": "BE",
          "Pseudo": "Bahram",
          "Nb_Reviews": 26,
          "Date": "2023-08-29T20:31:24.000Z",
          "Titre": "Hight price!",
          "Contenu": "Beetje duur, maar het heeft mijn probleem opgelosst!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Wolf",
          "Nb_Reviews": 1,
          "Date": "2022-10-10T22:16:12.000Z",
          "Titre": "Didn't work for me",
          "Contenu": "I purchased Driver Easy because my Windows 11 reported incompatible drivers (all Logitech webcam drivers) and that memory integrity had to be deactivated. I was hoping to resolve the issue with Driver Easy. While the program updated some drivers, my issue was not resolved."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "GEORGE VAN HOUTEN",
          "Nb_Reviews": 2,
          "Date": "2022-09-29T17:58:58.000Z",
          "Titre": "I installed Driver Easy and did a scan…",
          "Contenu": "I installed Driver Easy and did a scan it showed a list of drivers that needed updating. I selected to update all drivers, when I re-booted I still had the original problem. The audio device said driver not found , I found my original driver disc and loaded the driver from it and it fixed the problem. I do not think ordering Driver Easy was worth it for my situation"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tee-shirt Lover",
          "Nb_Reviews": 4,
          "Date": "2022-10-01T22:31:23.000Z",
          "Titre": "Better than other printers on the market",
          "Contenu": "Not exactly plug-and-play but far superior to HP's equivalent.  We bought the Pro pack and it didn't take us to the installation area. We  found it but too much searching required. At least we didn't have to attempt interacting with the bot or any offshore technicians."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Donniemac",
          "Nb_Reviews": 3,
          "Date": "2022-09-27T20:10:26.000Z",
          "Titre": "Printer Down.",
          "Contenu": "I had a problem with my printer.  I research the problem and found that just maybe I needed to update all my drivers. So that done I had my teckie resolve the program and got things going again.  Wether the updated Drivers contributed I cannot confirm but I know I needed a driver update. Job done."
        },
        {
          "Note": 3,
          "Lieu": "SE",
          "Pseudo": "jan Lennart",
          "Nb_Reviews": 3,
          "Date": "2022-09-12T23:36:20.000Z",
          "Titre": "I downloaded to upgrade to 5G",
          "Contenu": "I downloaded to upgrade to 5G. aperently I cannot upgrade. the app in my computer (Qualcomm Atheros) don't have the required parameters. M-soft tells me that the best app is upgraded. I have to get a completely new app. After some search I can't find which work, I think google and M-soft is doing some bad things!!!!!!!!!!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "BRENDA TRUAX",
          "Nb_Reviews": 7,
          "Date": "2023-02-14T00:07:54.000Z",
          "Titre": "Not really sure yet",
          "Contenu": "Not really sure yet.  I ran the app 2-3 times, but things haven't improved as much as I thought it would."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "J P",
          "Nb_Reviews": 2,
          "Date": "2022-08-31T20:53:44.000Z",
          "Titre": "This is not the first time I've used…",
          "Contenu": "This is not the first time I've used DriverEasy to get me out of trouble, it's never let me down and their customer service is excellent whether you have a question or need some assistance.The reason I've given 3 Stars is so that sceptical people read this, most people never believe 5 Stars."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "R_A_N",
          "Nb_Reviews": 3,
          "Date": "2022-09-23T22:49:38.000Z",
          "Titre": "I had to rebuild my system and it work…",
          "Contenu": "I had to rebuild my system and it work great to have it update most everything, but does not update all MS Window items.  You still have to go to your set-up file for windows and run updates to download."
        },
        {
          "Note": 3,
          "Lieu": "ZA",
          "Pseudo": "Warren",
          "Nb_Reviews": 1,
          "Date": "2022-07-25T10:39:44.000Z",
          "Titre": "I bought this to try and fix a problem…",
          "Contenu": "I bought this to try and fix a problem with a 4-port USB Expansion Card. This did not resolve my issue. However, a number of other drivers got updated so I suppose it did work....but was a lot of Money for me at the time in our currency ZAR to fix a specific problem. I can only assume the Expansion card itself is faulty."
        },
        {
          "Note": 3,
          "Lieu": "CH",
          "Pseudo": "Jeremy",
          "Nb_Reviews": 1,
          "Date": "2023-02-20T09:44:07.000Z",
          "Titre": "Useful but you're such a whiny software"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2022-07-27T22:03:19.000Z",
          "Titre": "Excruciatingly slow but easy to use",
          "Contenu": "The first step of creating a \"restore point\" took more than 45minutes, then the downloads took another eternity, eventhough there were nobody else using the internet at the same time. If it wasnt for the waiting time, I would rate 5 stars as the software is extremely easy to use and relatively cheap."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Merix",
          "Nb_Reviews": 1,
          "Date": "2022-07-12T00:16:31.000Z",
          "Titre": "Logitech Users only",
          "Contenu": "After updating old drivers, I tested my Logitech GHUB headset and the problem im having is still there in the mic. It stops working while being silent in game play while im on discord with friends. I knew this software is a bit of a long shot to fix my issue on windows. Other than my issue, I guess this program is ok? If this was a program you can select which apps you have problems with and see it can do dynastic check for you would be nice"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mrs. J",
          "Nb_Reviews": 3,
          "Date": "2022-07-04T15:06:59.000Z",
          "Titre": "It seems to work properly",
          "Contenu": "It seems to work properly, though I've only had it a few days.The reason I gave it only 3 stars is because of the auto-renewal payment system. I don't see ANYWHERE how I can turn that off! I suspect I will have to make a call to some center to have that addressed, which means you'll have to staff it. Wouldn't it be better to allow me to change that mistake on this end?"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Gaetan Jocelyn Lessard",
          "Nb_Reviews": 6,
          "Date": "2022-11-11T20:50:45.000Z",
          "Titre": "I am returning to IObit Driver Booster",
          "Contenu": "I am returning to IObit Driver Booster. The program find three more drivers."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jacqueline",
          "Nb_Reviews": 1,
          "Date": "2022-07-13T06:58:23.000Z",
          "Titre": "Never did load",
          "Contenu": "I tried to load it on my laptop and because my laptop is in S mode, the program would not load.  I was told that a refund is in progress by the technician I was referred.. I do not want to change from S mode.  It was not a five- star review for me since there is no provision for your product to work within me changing my computer."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Louis C",
          "Nb_Reviews": 1,
          "Date": "2022-07-02T21:59:35.000Z",
          "Titre": "Early for me to revise stars",
          "Contenu": "Early for me to revise stars.  Enjoy your website well done.  Im hoping your staff can get my Realtek Audio so that it can be recognized by my computer.  That Realtek Audio has completely been disabled and or removed from computer.  Devise Manager has shown Realtek a couple of times at top of device but darkened and not responding.  Thanks.  Appreciative of concern."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lloyd R",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T16:36:06.000Z",
          "Titre": "Found the help you gave to me; to much for me.",
          "Contenu": "Found the help you gave to me. Hard to follow; to much I did not understand. So I could not make it work. So I went back to a company for support that I had used in the past (Driver Support) they scanned the computer and found the same two problems and their downloads worked very well. The audio came back at once. Thanks for your help. Lloyd Ritch"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "K E T",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T10:51:34.000Z",
          "Titre": "Drive easy only really works practically if you have the paid version",
          "Contenu": "Updated Drivers are crucial for the efficient running of computers and the OS manufacturers, claim to provide these but users are trapped into buying separate licences to get updated drivers from third parties....the IT industry requires proper regulating. Will it ever happen. Best can be said is that Driver Easy facilitates this at a significant price on an annual basis. If you don't renew the annual subs your system will noticeably deteriorate functionally. More transparency from all, please. Out of pocket again..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T17:19:59.000Z",
          "Titre": "Was great except for one thing",
          "Contenu": "Was great except for one thing. The driver for my internet connection failed leaving me with no internet after the driver update.  I had to resurrect an old laptop to download the correct driver from Intel. After that it still wanted to update my Intel driver with the one that did not work."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Craig R",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T18:03:15.000Z",
          "Titre": "Simple to use. But use with caution.",
          "Contenu": "The software was easy to use, but in the end did not really solve my problem.   Though I will say reading all the info on their pages pointed me in the correct direction to solve my problem.  It was not updating drivers...it was in rolling back drivers that had updated beyond what my hardware could handle that in the end solved the problem.  So this software has its place.  Be careful allowing any program to update drivers to older hardware.  However, I should say it helped keep many drivers updated and in line with Microsoft's own updates that to my surprise does not always keep drivers updated to match newer or revised drivers.  Which makes this simple to use software valuable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "cheryl",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T20:46:27.000Z",
          "Titre": "Almost a 100% rating",
          "Contenu": "The software install was easy and fast, but the download form has pre-checked boxes on the page and a lot of other information that makes it easy to overlook a box that gives them permission to auto-bill and have you pay for a renewed annual subscription at the regular rate when your first year is up. This was viewed by me as a  deceptive practice. I asked for the authorization to be removed through support and it is supposedly done.  Other than that the program works fine in finding and installing needed drivers.  If not for the order download form, I would have rated the program as excellent!"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Elaine Ward",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T03:09:28.000Z",
          "Titre": "Driver Easy was easy to download and…",
          "Contenu": "Driver Easy was easy to download and use and I've updated several drivers.  Unfortunately, it didn't fix my printer problem of always coming up 'off line'. I'm still working on that."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Andrew Farrell",
          "Nb_Reviews": 3,
          "Date": "2023-12-12T16:23:42.000Z",
          "Titre": "The program does what it is supposed to…",
          "Contenu": "The program does what it is supposed to do and is very easy to use. My only complaint is the price as it is a bit high, otherwise its a great product."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mark Thompson",
          "Nb_Reviews": 6,
          "Date": "2023-12-01T02:14:10.000Z",
          "Titre": "Hard to say",
          "Contenu": "Hard to say as it didn't resolve my issues, though I later discovered it wasn't a driver problem, It seemed to download OK and claimed to update 22 drivers, so fingers crossed it did no harm."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mary A",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T20:38:34.000Z",
          "Titre": "I still have the same issue I can't…",
          "Contenu": "I still have the same issue I can't find my audio play device"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Randy Nieusma",
          "Nb_Reviews": 2,
          "Date": "2023-11-23T05:15:59.000Z",
          "Titre": "fairly easy to get the app downloaded /…",
          "Contenu": "fairly easy to get the app downloaded / installed and up/running, a little more difficult for a novice to complete all updates (more drivers than my system stated were out of date). finally have system up to date and will monitor performance."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Niko",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T20:49:30.000Z",
          "Titre": "Good, however...",
          "Contenu": "A fairly reasonable price for the convenience that is provided, however, where it falls short is download speeds and failed downloads.I noted all the larger driver files it was attempting to download, paused driver easy and went directly to the sources and found significantly faster speeds and no failed downloads.Overall satisfied but definitely room for improvement."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William Jones",
          "Nb_Reviews": 2,
          "Date": "2023-12-03T00:33:00.000Z",
          "Titre": "I like the ease of the download however…",
          "Contenu": "I like the ease of the download however I am still getting scans that says drivers are outdated?"
        },
        {
          "Note": 4,
          "Lieu": "BH",
          "Pseudo": "Bhm",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T05:23:51.000Z",
          "Titre": "Definitely noticed the improvement.",
          "Contenu": "Getting a license and download was clear/straight forward and the software user experience is simple. Till now the experience is simple. I am still testing as there are some doubts as to will current my OS or not. I had moments that when I updated the driver the software suddenly stopped working but got an update in windows 11 and it was fixed so am still reviewing and will test further updates. In short, i did test other similar software and it directly corrupted my os and driver easy is different. I had features/settings that I didnt know about because it was working with the generic driver in my device and driver easy installed the full driver, for that alone I am satisfied."
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "Ahmad",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T03:33:28.000Z",
          "Titre": "Works as intended",
          "Contenu": "Does what it says it does. Scanning was pretty quick. Pro version made it easy to update all the drivers in a single click. Price does seem quite reasonable, though as I think drivers are not updated very often, the application would be used only occasionally. It wouldn't feel like I would be fully utilizing the subscription. I hope I am able to transfer the license to different PCs in instances I decide to upgrade my rig too."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gator Ater",
          "Nb_Reviews": 2,
          "Date": "2023-10-18T16:11:06.000Z",
          "Titre": "Easy to use and it found a lot of…",
          "Contenu": "Easy to use and it found a lot of problems. However,I got it to fix a keyboard problem after a Win 10 update as I read an update had caused problems in this area for others. But, alas, keyboard still produces many errors. (missing letters, repeating letters.)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dave Dritsas",
          "Nb_Reviews": 4,
          "Date": "2023-09-20T03:07:11.000Z",
          "Titre": "I had all soslow to no load times, wifi adapter not found error messages, slow video loading, etc.rts of problems with my…",
          "Contenu": "I had all sorts of problems with my drivers, such as slow to no load times, wifi adapter not found error messages, slow video loading, etc. Driver Easy provided me with a correction to all these errors saving me time and money not being able to get a internet connection. Now my laptop is running again like new. Thanks, Driver Easy (tried to give 5 stars but the 5th star isn't lighting up)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Keith",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T16:16:26.000Z",
          "Titre": "It was easy to purchase and download…",
          "Contenu": "It was easy to purchase and download but not 100% sure it was the solution to my problem so I could not give it 5 stars"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Edward",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T23:10:53.000Z",
          "Titre": "One click update works great",
          "Contenu": "Updating drivers with one click  using Driver Easy pro is as easy as advertised. However updating drivers did not solve a problem as I had hoped it would,  with device manager updating every two seconds or so causing it to become unusable. It was a cure someone suggested online that didn't work for me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephen",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T19:12:54.000Z",
          "Titre": "Needed to update hard to update…",
          "Contenu": "Needed to update hard to update drivers. Driver Easy was simple to use."
        },
        {
          "Note": 4,
          "Lieu": "BS",
          "Pseudo": "Eugenia",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T02:35:02.000Z",
          "Titre": "Clear explanation",
          "Contenu": "It was difficult at first since the problem was not being rectified.Then I was able to figure it out"
        },
        {
          "Note": 4,
          "Lieu": "IL",
          "Pseudo": "Tomer",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T13:25:54.000Z",
          "Titre": "Keep your drivers up to date with ease",
          "Contenu": "This is a really great, easy and user friendly application for those who want to keep their drivers constantly up to date. Been using it for a couple of years now and can recommend it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eric Pineda",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T02:51:57.000Z",
          "Titre": "Great driver updater",
          "Contenu": "Always used free version and it works great. Paid version seems a lot better, would recommend it. Ease of use of the paid version and time savings is worth it. Only suggestion is to improve download speeds."
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "iDStudio",
          "Nb_Reviews": 1,
          "Date": "2023-06-03T21:33:14.000Z",
          "Titre": "Reliable drivers and overall user experience",
          "Contenu": "Reliable drivers, finds drivers you didn't know you had or needed for rather obscure windows functions. Manual updates are useful. On the downside, only the pro version creates a rollback backup and is still expensive for the home/casual user outside the US where dollar conversions to local currency are high for many users, after all you don't need to update drivers throughout the year, you do it once or twice and that's it!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Walter Richardson",
          "Nb_Reviews": 12,
          "Date": "2023-10-15T13:23:17.000Z",
          "Titre": "Great tool",
          "Contenu": "I would have given this a 5 but my only concern is that I paid for the year and I’d be lucky if I need to use it more than three times. Great tool though, saved me hours searching for drivers needed to have my pc running optimally."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Hamish",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T23:24:47.000Z",
          "Titre": "I would give five stars, but...",
          "Contenu": "I would give five stars, but for the fact I got some drivers for Logicool devices which I don't have. After installation had grid pattern on display, but after reverting and trying again without Logicool drivers all went well. Very streamlined and easy to use, but if you find drivers for devices you don't have chosen, then be cautious."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Geminied Taurus",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T21:50:28.000Z",
          "Titre": "I have been trying to get updated…",
          "Contenu": "I have been trying to get updated drivers for my Zoom R24 mixer.  I guess you don't cover that device.  Other than that, everything is great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "xx",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T19:54:42.000Z",
          "Titre": "it usually works good but the last time…",
          "Contenu": "it usually works good but the last time I used it, the screen went blank, and the next day I had to call Dell and do a reset.  A couple other times, I had to skip certain driver updates.  I'm not as confident about it as I use to be, but I'll keep it for now as a backup if I need it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas Gibson",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T19:57:02.000Z",
          "Titre": "I found I had a lot of outdated drivers…",
          "Contenu": "I found I had a lot of outdated drivers but it did not resolve my original problem."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T08:43:20.000Z",
          "Titre": "Missing Drivers",
          "Contenu": "For the most part it does update lots of missing drivers; however, it doesn't update all drivers such as gaming drivers. It would be nice to include gaming drivers updates as well so we don't have to buy multiple programs to get missing drivers."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "C B Mulholland",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T10:16:52.000Z",
          "Titre": "It did a good job but when there was an…",
          "Contenu": "It did a good job but when there was an update to the Intel screen the computer screen flickered and then went blank with a spinning circle on it.  I left the computer running all night but it was still there in the morning.  I forced a power down and then it come up correctly.  I am not sure if it was the update of the screen driver or the significant firmware update from HP at the same time.  It is a new Laptop."
        },
        {
          "Note": 4,
          "Lieu": "IE",
          "Pseudo": "Patrick",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T23:32:46.000Z",
          "Titre": "I cannot get audio with my u tube…",
          "Contenu": "I cannot get audio with my u tube imports"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dameion",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T00:54:43.000Z",
          "Titre": "The experience was straightforward and…",
          "Contenu": "The experience was straightforward and easy. I was having 100% disc usage when downloading off a computer application called STEAM. I tried the free trial in attempt to cover all bases and this app didn’t change anything. Driver easy seems like a great application to use. Just didn’t work for what I needed it to do. 9/10!"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Josh",
          "Nb_Reviews": 2,
          "Date": "2023-08-14T02:23:15.000Z",
          "Titre": "Worked very well",
          "Contenu": "Worked very well. I bought a second monitor so I wanted to enable the PC onboard graphics as well as having my other monitor plugged into the dedicated graphics card (a desktop tower PC). I enabled the onboard graphics in the BIOS but it was missing the driver. Windows couldn't identify and download it. Rather than open up my machine to try and find out what the graphics chip was, I just ran Driver Easy and it immediately identified the missing driver and the ones that needed updating. I wasn't prepared to wait the 5 hours for the driver to download using the FREE version of Driver Easy so I bought the subscription (which isn't bad for a year). It download/installed and my monitor worked straight after the reboot. Well worth it to save some time, though I may only use it the once, so you will have to factor in whether it is worth it to you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Frank Wichmann",
          "Nb_Reviews": 3,
          "Date": "2023-08-14T17:52:30.000Z",
          "Titre": "Tried to use the free version",
          "Contenu": "Tried to use the free version but was very difficult. I ended up buying a one yr license as I had many driver issues. The paid version is very easy to use and my computer runs like new. I would have given it 5 stars except that I felt the company made the free version very frustrating for the average user."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T19:14:01.000Z",
          "Titre": "Mostly worked",
          "Contenu": "Mostly worked; except when it didn't"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Christopher Brisland",
          "Nb_Reviews": 11,
          "Date": "2023-10-31T22:18:38.000Z",
          "Titre": "Does what it says on the label",
          "Contenu": "Keeping one's drivers up-to-date is usually a PITA chore. With Driver Easy it does what it says on the label.Could be a tad quicker though..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gamefish",
          "Nb_Reviews": 1,
          "Date": "2023-01-29T18:24:17.000Z",
          "Titre": "Keeping drivers up to date on Windows with a permanent for life license.",
          "Contenu": "Keeping drivers up to date on Windows PC's is one of the aspects of Windows that drove me to Apple. Everything inside an Apple device (of any kind) is built by Apple so software upgrades include attention to all internal parts and components automatically.If Driver Easy was available back then I might still be a dedicated Windows person. Now I use it because I must in order to enjoy the A rated video games. Driver Easy made updating my drivers a no-brainer and is worth every cent I paid for the license. I want to know if it is possible to purchase a life-long license and avoid the annual subscription renewal hoo-haa."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T18:54:23.000Z",
          "Titre": "Struggling to install drivers - Use Easy Driver. …",
          "Contenu": "I was struggling to install drivers that Intel driver updater caused my PC to become unstable. After repurchase of Easy Driver, I was able to install these drivers without any glitches. The application is very fast and easy to use. I would recommend extending your database of drivers to include more Intel drivers. I was unable to install Intel Arc and Iris Xe Graphics - WHQL for Windows 11 Pro from Intel - my PC become unresponsive and I had to revert to previous settings. It would have been great if Easy Driver updater database had recognised that my PC meets the requirements to install the Arc drivers."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CATHY L",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T17:04:58.000Z",
          "Titre": "The software is really good",
          "Contenu": "The software is really good - it does not catch all of the drivers because after I ran this software I ran another one (trying it out) and it caught 7 more.    But other than that, I will be using it on 3 of my devices at least once a month."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike Tuccinardi",
          "Nb_Reviews": 4,
          "Date": "2023-03-16T02:49:56.000Z",
          "Titre": "Excellent software.",
          "Contenu": "Once I found the correct link to enter the 25 digit code (without mistakes), your updating driver software ran clean, on three different Windows 7 machines with varying software images. The machines run much better. Thank you very much. I appreciate the hard work that went into it. I know from experience writing this kind of code is not easy.Now, if you could get rid of entering in the 25 digit product key, I would have given you a five start rating. As it is, I have the product key taped to the keyboards. Not that I'm going to run it every day but since 2009, I have had to reload the operating systems more than 5 less than 10 times. (One company I worked for in Silicon Valley (BTI) supplied auto dealerships with inventory software. If they missed a monthly payment, they'd activate the kill code. Not paying didn't happen often.)Regards, Mike Tuccinardi"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert C.",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T21:23:04.000Z",
          "Titre": "Some drivers not alway current",
          "Contenu": "Rather easy to use. I do not have the time nor desire to search and wait, however some drivers suggested are not always the most current. My situation might be unique - so I will allow for a bit of ambiguity. Overall - pertty good."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Joy",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T02:57:11.000Z",
          "Titre": "Didn't solve my problems...but",
          "Contenu": "I would of given 5 stars but unfortunately did not solve my computer problems. I gave 4 stars because customer service was excellent. I had no problems to process a refund."
        },
        {
          "Note": 4,
          "Lieu": "NO",
          "Pseudo": "Stian",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T08:14:56.000Z",
          "Titre": "Easy to use and found most of the new…",
          "Contenu": "Easy to use and found most of the new drivers, except my network card, thats why I give 4 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vic",
          "Nb_Reviews": 1,
          "Date": "2023-08-06T19:16:31.000Z",
          "Titre": "My son identified this tool to help me…",
          "Contenu": "My son identified this tool to help me locate any needed updates for my new desktop computer. We found several that were needed for processor and other items since the factory."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gavin",
          "Nb_Reviews": 3,
          "Date": "2023-09-05T19:26:47.000Z",
          "Titre": "I like your guys software it’s really…",
          "Contenu": "I like your guys software it’s really easy to use and super convenient to have everything right there ( I have the full program )  just wish the free version had a little more to offer"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Brian Wilson",
          "Nb_Reviews": 4,
          "Date": "2023-03-24T01:49:30.000Z",
          "Titre": "Driver Easy, probably the Easiest Tech Company to deal with",
          "Contenu": "My computer crashed after installing a driver using Driver easy updating software.I reported this to their support team and they instantly offered me a refund shocked at my experience. They were quite concerned and offered to try and solve the problem.But unfortunately the computer had to be sent away for repair. However when it returned, I requested a reinstall of the Drive easy software and they obliged immediately.This time the PC drivers were updated without any problem.I recommend them as truly friendly customer centred company who believe in their product and genuinely interested in customer feedback"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Gordon",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T05:10:55.000Z",
          "Titre": "Puchased a paid version  without trialling the free version because it was low cost and convenient and was critically necessary because of an instability with Windows11/Visual Studio/vb.net",
          "Contenu": "Puchased a paid version  without trialling the free version because it was low cost and convenient and was critically necessary because of an instability with Windows11/Visual Studio/vb.net. I suspected a NVidea driver or a Microsoft issue.I knew that I could stop the problem if I prevented the machine going into sleep mode.Problem appears to have gone away but I am a little disappointed that not enough feedback was given for me to determine conclusively what the problem was and time did not enable me to investigate the issue thoroughly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Heide",
          "Nb_Reviews": 6,
          "Date": "2023-09-14T23:17:17.000Z",
          "Titre": "It has not been great I still have some…",
          "Contenu": "It has not been great I still have some issues with my PC my Inbox is so confusing right now and I do not know what I need to do with it, for my PC to run as smoothly as it has been."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Ricardo B Serrano",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T21:51:14.000Z",
          "Titre": "Satisfied with driver easy for updating…",
          "Contenu": "Satisfied with driver easy for updating drivers in my PC. Thanks!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Tom Grbich",
          "Nb_Reviews": 4,
          "Date": "2023-05-30T05:19:27.000Z",
          "Titre": "Get things running",
          "Contenu": "I had to re-image a drive and in the process, I found a couple of things that just would not work any longer - attaching to the internet being one of them.I suspected that it might be a driver issue and having used Driver Easy before, I invested again and to my (huge) relief, everything was soon running freely again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 5,
          "Date": "2023-05-04T23:07:44.000Z",
          "Titre": "I purchased a used laptop  and wanted to install my printer that is setup on my desktop. It is a Epson WF2850. I get a message saying driver not available. I cannot find the driver.",
          "Contenu": "I have a Epson WF2850 that is installed and working find on my desktop. I just purchased this laptop and want to add the printer on the laptop. I went through the Control Panel under printers and scanners. I did all the all the instructions that said to do. At the end, I get I message Driver not available. My printer isn't that old, I get updates and they update just fine. Any suggestions on getting the printer to work on my laptop, please let me know."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T10:44:37.000Z",
          "Titre": "I would like to thank you guys on this…",
          "Contenu": "I would like to thank you guys on this driver Easy program ..which the name says it all…I have had couple of old laptops and desktop computers which I needed drivers for ..if it wasn’t for you guys on searching on the rights drivers for these computers of mine ..I have no idea how I would have found them myself ..it probably would have given me a headache searching for them ..i recommend this driver easy for everyone"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert D",
          "Nb_Reviews": 3,
          "Date": "2023-04-19T18:30:39.000Z",
          "Titre": "Updating driver - great, licensing has problems",
          "Contenu": "The task of finding and updating drivers is done quite well. There does appear to be a bug in the licensing part of the software. I bought my license on 9/22. Which should have been valid for a year. However, the software recently stated that the license had expire and forced be to buy another one. You might want t look into that."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Franklin Randall",
          "Nb_Reviews": 3,
          "Date": "2023-06-21T03:46:12.000Z",
          "Titre": "Refunded overcharge/missing camera driver?",
          "Contenu": "My first review I deleted. In fairness to Driver Easy the overcharge was refunded! My camera is not working on my desktop computer it could be because I have a missing driver for it. I uninstall the camera and then reinstalled it. This is the reason I installed Driver Easy. It did update 5 drives but can't find the camera? At this point I am not sure what to do."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christine",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T19:10:54.000Z",
          "Titre": "The website was okay and the download…",
          "Contenu": "The website was okay and the download simple. The necessary driver did not load a driver that allows my cpu to talk to the printer. I can print a test page, but it still refuses to list the print job in the job list and will not print anything sent other than the test page. I have done everything short of purchasing a new printer. The printer is newer than the cpu which runs windows 10."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2023-04-12T08:40:55.000Z",
          "Titre": "A very good product BUT",
          "Contenu": "A very good product.Very satisfied with its functionality.The only gripe I have is the significant price jump compared to previous years when there is no stated improvement either in functionality or specification.Available on three computers when I have only one computer is no consolation."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-03-13T07:29:23.000Z",
          "Titre": "I am sure you have heard this before...",
          "Contenu": "I am sure you have heard this before, but there should be an option to have a one-time purchase as many people do not like the subscription based product. I would have been willing to pay a little more for a one time purchase."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kenny G",
          "Nb_Reviews": 4,
          "Date": "2023-03-24T23:04:51.000Z",
          "Titre": "It makes updating system drivers a lot…",
          "Contenu": "It makes updating system drivers a lot easieer then having to hunt them down and install them manually.  However the price could be lower since there are others I use that cost nothing."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Rip",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T17:26:31.000Z",
          "Titre": "Program seems to work well",
          "Contenu": "Program seems to work well, but you guys shouldn't bother offering a free version if it can't install the drivers as well. A bit of a predatory business tactic."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "J. Conner",
          "Nb_Reviews": 1,
          "Date": "2023-02-19T10:12:43.000Z",
          "Titre": "Just buy it",
          "Contenu": "I'm never going to figure out how to manually install and update my drivers, and you shouldn't either. Just stomach the 30 dollars a year and your PC womt slow down any time soon."
        },
        {
          "Note": 4,
          "Lieu": "LU",
          "Pseudo": "Phil",
          "Nb_Reviews": 1,
          "Date": "2023-07-29T21:22:17.000Z",
          "Titre": "Nice to use but a tad expensive.",
          "Contenu": "The tools were simple to use but the fact that a 30 Euros subscription was required for automatic help is a bit... perplexing, to be honest. Otherwise, it was a great deal!"
        },
        {
          "Note": 4,
          "Lieu": "TH",
          "Pseudo": "Stephen Unsworth",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T05:05:04.000Z",
          "Titre": "Works well but so quiet I was unsure the app was loaded",
          "Contenu": "Signed up for the pro version. 6 weeks later I could not remember whether I had seen that the program was loaded on my laptop and working. I do not recall receiving any post-purchase e-mails telling me about using it.So I did a quick search on my windows logo and sure enough the app had been loaded and indeed it reported that I had been scanned and my drivers were all up to date.Strange that I had no consciousness of the app having been loaded and that it was working quietly in the background. Perhaps its existence on my device should have been made a bit more transparent to me by the company!PostscriptA few days after writing this review I discovered an e-mail that would have alerted me to the presence of Driver Easy on my laptop in the junk folder. I can't remember whether I was alerted to that possibility by the company.Anyway, so far so good with the product!"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Malcolm Colley",
          "Nb_Reviews": 4,
          "Date": "2023-02-26T06:00:16.000Z",
          "Titre": "The software repaired missing drivers…",
          "Contenu": "The software repaired missing drivers and updated most getting me out of a hole but  speed was still fairly slow.  I still needed to do a Dell repair to get more speed and even after this there is room to improve further."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Johnny",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T00:30:14.000Z",
          "Titre": "While most onboard drivers get updated…",
          "Contenu": "While most onboard drivers get updated without the need of having to flash it through BIOS majority of USB Bluetooth drivers are unable to complete their updates."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dave, not IT",
          "Nb_Reviews": 2,
          "Date": "2023-02-12T22:37:32.000Z",
          "Titre": "Great product.  Works well. Comprehensive but would like lifetime subscription.",
          "Contenu": "Great product.  Comprehensive check of drivers for all devices on my computer.  I like that subscription covers 3 device.  WOULD REALLY LIKE TO PURCHASE A LIFETIME SUBSCRIPTION OR ONE FOR 5 YEARS."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Tom H",
          "Nb_Reviews": 20,
          "Date": "2023-09-26T17:35:41.000Z",
          "Titre": "Driver easy is a helpful bit of kit…",
          "Contenu": "Driver easy is a useful piece of software which is ery easy to add to regular computer maintenence."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Yomi",
          "Nb_Reviews": 1,
          "Date": "2023-07-01T23:41:22.000Z",
          "Titre": "aLL BUT ONE SOFTWARE was installed.",
          "Contenu": "My experience was made great by re-installing all but one required software. Only one, the HP software still needs to be installed. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sandi",
          "Nb_Reviews": 1,
          "Date": "2023-04-15T05:20:49.000Z",
          "Titre": "Was skeptical but it fixed my…",
          "Contenu": "Was skeptical but it fixed my flickering screen on my ASUS laptop which is about 6 years old. I wound up having to purchase the Pro but for the price didn’t think it would fix the problem… it did!  Small price for big peace of mind!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Alison",
          "Nb_Reviews": 14,
          "Date": "2023-10-14T21:25:23.000Z",
          "Titre": "It got a very old computer running…",
          "Contenu": "It got a very old computer running again. Not perfect, but an ancient machine of 12 years."
        },
        {
          "Note": 4,
          "Lieu": "DK",
          "Pseudo": "Toxicity D-Day",
          "Nb_Reviews": 10,
          "Date": "2023-05-20T20:44:07.000Z",
          "Titre": "Its great, but weary.",
          "Contenu": "I got driver easy pro, great choice IMO.I've had it before, even pro upgrade. So I think this review is due.If you decide to upgrade to pro, to let it update your drivers its great for the majority of the drivers. But, some drivers can cause issues like BSOD or a total pc freeze, due to faults with the driver updates. I don't have a great idea as to why, but it might also just be my pc.However, usually these sort of problems arent the case.Last year when I had pro, I had no faults after updating the drivers.It only appears to be this time around.4/5 its worth it, but be careful when dealing with drivers in general."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "StarFox",
          "Nb_Reviews": 2,
          "Date": "2023-04-21T23:38:41.000Z",
          "Titre": "Excellent tool to have",
          "Contenu": "Didn’t make a 5 because it keeps saying that I need to update 3 drivers and when I try them, looks like is processing them but when I scan again they keep coming back. Other than that it would be a 5"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Al S.",
          "Nb_Reviews": 2,
          "Date": "2023-09-10T22:11:29.000Z",
          "Titre": "Everything went smoothly",
          "Contenu": "Everything went smoothly. Driver Easy took care of everything. Would have given 5 stars but after the driver update install I'm still having a problem with a bluetooth driver and my touch pad went dead. Trying to remedy this. But over all happy with the product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Milus Campbell",
          "Nb_Reviews": 2,
          "Date": "2023-08-15T01:52:54.000Z",
          "Titre": "Driver Easy is quick and easy",
          "Contenu": "Driver Easy is quick and easy. The only potential problem is that I have no way of positively confirming that all my drivers are up-to-date. I have to take your word for it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rod",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T23:18:13.000Z",
          "Titre": "Very easy to install",
          "Contenu": "Very easy to install. Upgraded all my out of date drivers and resulted in bringing my laptop  up to date. Very satisfied thank you."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Jess",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T17:30:08.000Z",
          "Titre": "First time user, very satisfied 👍",
          "Contenu": "Is my first time using this type of program but it was so easy to use you just push the button and the program does the rest for you. Is super easy to use and picked up everything that needed fixing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "A Corbett",
          "Nb_Reviews": 5,
          "Date": "2023-08-24T22:49:08.000Z",
          "Titre": "On 4 PCs.  As automated as Possible.",
          "Contenu": "The Driver Easy is installed on 4 Devices in my home. When activated, it searches all drivers, and autoupdates.  I would prefer a scheduled monthly scan and auto install, but this is as good as you can get now."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Khuong Le",
          "Nb_Reviews": 2,
          "Date": "2023-11-18T17:43:50.000Z",
          "Titre": "Easy to used",
          "Contenu": "Easy to used. Only 1 thing that it's not catching quite the system update"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Granger",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T03:34:17.000Z",
          "Titre": "I had a bunch of errors about my…",
          "Contenu": "I had a bunch of errors about my drivers and I didn’t know and didn’t have time to manually install all of them would of been a five if it didn’t mess my audio up a little but I just had to change it in settings"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "George",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T01:46:16.000Z",
          "Titre": "Some drivers were hard to fix                                                                    d",
          "Contenu": "It fixed the majority of drivers quickly. BUT, 4 needed additional work.. I had to try and re-try to get them updated. Overall took 40 minutes. But it did get the job done in the long run."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Heide",
          "Nb_Reviews": 6,
          "Date": "2023-09-17T22:34:08.000Z",
          "Titre": "I have trusted Driver Easy for years, however here lately I have had trouble signing in. Please help with this issue. .",
          "Contenu": "I have trusted Driver Easy for years, however here lately I had some issues signing in."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Steve Sharrad",
          "Nb_Reviews": 12,
          "Date": "2023-03-05T17:34:48.000Z",
          "Titre": "Easy installation",
          "Contenu": "Easy installation. Easy driver update mske driver easy, well easily one of the more useful tools to keep your device running smoothly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "robert grona",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T12:54:43.000Z",
          "Titre": "it help fix some my problems with my…",
          "Contenu": "it help fix some my problems with my computer, works as jt should and i thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ida",
          "Nb_Reviews": 3,
          "Date": "2023-02-08T21:51:11.000Z",
          "Titre": "It seems to be working good",
          "Contenu": "It seems to be working good.  All drivers have been updated by one.  I keep trying to update that one driver but even when they say it did, once I restart and run the program again, that diver is not updated."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "angela",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T01:48:05.000Z",
          "Titre": "Quick Pro service",
          "Contenu": "Quick Pro serviceTried to fix driver issue myself for free but I could not with instruction givenPaid and got it fixed quick-very quick !!thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott M. Thomas",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T22:20:58.000Z",
          "Titre": "Everything went well on two of my…",
          "Contenu": "Everything went well on two of my laptops but, caused an error on boot up on my third. It caused a problem with my WiFi driver & I had to uninstall the driver Driver Easy installed. I would have given you a 4 1/2 if I had the option."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T00:01:09.000Z",
          "Titre": "corrected no sound on old H P envy…",
          "Contenu": "corrected no sound on old H P envy desktop after downloading the driver....so far all i ve used it for but it did the job thxs"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 1,
          "Date": "2023-06-03T23:21:09.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use, and appears to have updated most everything. I would have given it 5-stars, however, but it did not update my NVidia driver to the most recent."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Juan Carlos",
          "Nb_Reviews": 1,
          "Date": "2023-04-21T01:37:16.000Z",
          "Titre": "Progress and follow-up of the tool",
          "Contenu": "DE, really solved the issue in my laptop... i will send you more feedback later...The progress and follow-up of the tool in the short and medium term, it is valuable for everyoneThx"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "mark",
          "Nb_Reviews": 7,
          "Date": "2023-05-13T01:10:59.000Z",
          "Titre": "Does what it says on the tin",
          "Contenu": "Does what it says on the tinNice and easy and quick to update all drive's got no complaints apart from the constant time outs when downloading the drives"
        },
        {
          "Note": 4,
          "Lieu": "PL",
          "Pseudo": "Przemyslaw",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T21:05:20.000Z",
          "Titre": "Best for newest drivers",
          "Contenu": "I never heard about this app before. I had some issues with Forza4 on my PC and someone suggested to use your app to fix it. My game still got crushed, but at least I got newest drivers :)"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Sylvia A",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T17:40:07.000Z",
          "Titre": "The drivers didn't work but I received…",
          "Contenu": "The drivers didn't work but I received my refund immediately. Thank you"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Alan",
          "Nb_Reviews": 12,
          "Date": "2023-09-21T15:04:56.000Z",
          "Titre": "Decent bit of kit",
          "Contenu": "Updated a significant number of drivers but another driver analyser found 2 more recent drivers. Hence rating of 4"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Sudhir Phadke",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T06:32:05.000Z",
          "Titre": "Disappointed",
          "Contenu": "In all 16 drivers were updated. Printer performance has improved after drivers update but no improvement in laptop performance."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Javier Ramirez",
          "Nb_Reviews": 2,
          "Date": "2023-07-15T18:57:21.000Z",
          "Titre": "Works great",
          "Contenu": "Did great … updated all my drivers but I still couldn’t turn on my touchscreen need to figure this out ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Richardson",
          "Nb_Reviews": 4,
          "Date": "2023-03-15T20:52:48.000Z",
          "Titre": "DriverEasy did what it said",
          "Contenu": "DriverEasy did what it said, but it didn't really fix my problem.  And, since my problem seems to be a driver issue, I'm confused."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jan",
          "Nb_Reviews": 2,
          "Date": "2023-07-01T18:40:24.000Z",
          "Titre": "Solved my problem with Windows locking…",
          "Contenu": "Solved my problem with Windows locking up on startup after an update. Work fine now."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rhiannon",
          "Nb_Reviews": 1,
          "Date": "2023-02-07T00:01:32.000Z",
          "Titre": "Easy and straightforward to use",
          "Contenu": "Easy and straightforward to use. Updating drivers has never been easier. I only wish it were a little bit cheaper."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ernest",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T00:46:16.000Z",
          "Titre": "Although it took a while to get the…",
          "Contenu": "Although it took a while to get the program going, it ultimately fixed my problem very nicely."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "EDWARD JOSEPH NELSON",
          "Nb_Reviews": 3,
          "Date": "2023-10-27T13:46:26.000Z",
          "Titre": "to early to give a constructive review…",
          "Contenu": "to early to give a constructive review but happy so far"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "polishhaven",
          "Nb_Reviews": 2,
          "Date": "2023-02-19T23:27:21.000Z",
          "Titre": "Had to upgrade to Pro",
          "Contenu": "Had to upgrade to Pro, free version was taking forever to install drivers. Much too complicated too."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr philip grainger",
          "Nb_Reviews": 5,
          "Date": "2023-12-20T23:55:08.000Z",
          "Titre": "Driver Easy Paid Version",
          "Contenu": "After installing the free version and been satisfied with the product. The only negative was the laborious task of manually downloading and installing drivers taking hours so decided to upgrade to the paid version. Wow what a difference hours became minutes. Highly recommend if you want to keep your drivers updated."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rex",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T01:25:14.000Z",
          "Titre": "Fought driver issues for months",
          "Contenu": "Fought driver issues for months with another update program. Tried the free scan and Driver Easy found several other outdated drivers related to my problem. I allowed it to update those drivers and my problem was resolved!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Doug Dares",
          "Nb_Reviews": 4,
          "Date": "2023-12-20T18:11:51.000Z",
          "Titre": "Your company is very unhelpful in that…",
          "Contenu": "Your company is very unhelpful in that this program would not install and very nice to refund my money in a few hours. Never had any chance to use it or see what it does."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alex Nunez",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T05:27:50.000Z",
          "Titre": "Spent hours trying to find the related…",
          "Contenu": "Spent hours trying to find the related drivers to some unknown devices on my computer and gave in and purchased driver easy. Hands down a huge time saver I wish I would’ve just went here first. Planning on using this tool for all the computers I have around the office."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shawn",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T20:00:45.000Z",
          "Titre": "This software saved the day",
          "Contenu": "This software saved the day! It completely resolved an audio driver issue on a brand new acer predator laptop. The audio driver was corrupted after a Win11 update. Thank you for this amazing software! So easy to use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cody",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T21:00:39.000Z",
          "Titre": "Easy to use, affordable, and yes, it works!",
          "Contenu": "There's not much I need to say about Driver Easy.For one, the product is quite easy to use, even for people who aren't particularly \"software savvy\", as a Pro subscription enables the software to perform installations automatically.The subscription is also easy to activate, and well with the money you spend on it. For a single PC (which is likely the most common subscription option), you'll pay only 30 dollars for a year's subscription (which is less than 3 dollars a month, if you can't be bothered to do the math), and the product is also quite easy to activate after the subscription is purchased.Also, the product not only does its job, but does it well. When I find my PC isn't running as fast as it should be, or the speakers aren't blasting as loud as I'm used to, all I gotta do is let Driver Easy do it's thing, and boom! Problem solved!So yes, I HIGHLY recommend Driver Easy to keep your computer running smoothly, and at an affordable price!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Samuel Lolmaugh",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T03:21:04.000Z",
          "Titre": "Great job driver easy",
          "Contenu": "My experience was great  My grandson call me   Upset that his computer wouldn't it stay connected to the Wi-Fi Did some researching  Is found driver easy Figured I would give it a try It turns out there was a 125 drivers on his computer that were never updated But now it's working fine he's happy I'm happy"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rose",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T23:15:32.000Z",
          "Titre": "The app makes it really easy to update…",
          "Contenu": "The app makes it really easy to update drivers that need updating no matter so many,"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CaraN",
          "Nb_Reviews": 8,
          "Date": "2023-12-11T01:49:42.000Z",
          "Titre": "Appreciate the Ease",
          "Contenu": "I like the ease of using Driver Easy. I don't have to keep track of what drivers need updating and run into fewer issues (caused by outdated drivers). I've never had an issue with getting an outdated/problematic driver using this software. This is my second year using this software."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Christopher",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T18:38:39.000Z",
          "Titre": "Useless",
          "Contenu": "Useless - could not sort connecting ext drives (what I bought it for!) Also have not replied to my eMail on this as advertised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T00:02:04.000Z",
          "Titre": "Super cool program this",
          "Contenu": "Super cool, SUPER helpful little program. Glad you offer a free one, but the auto installer is the best feature ever. It was easy, get multiple licenses for your home and it's cheap!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T19:52:11.000Z",
          "Titre": "I had tons of drivers that needed updating.  Driver Easy did a great job!",
          "Contenu": "Very easy to download on my three devices.  There were many drivers that needed updating.  I was a little fearful that my computers wouldn't come back but no problem.  Driver Easy did great!   The name says it all!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Doug",
          "Nb_Reviews": 10,
          "Date": "2023-12-09T22:38:27.000Z",
          "Titre": "Great Support",
          "Contenu": "Great support.  Issue resolved with-in 12hrs as promised and with the very outcome I had hoped (and asked for).  Thank you for the quick turnaround.  However, I were to be asked about my website store experience... I'd have to give one less star because I'd have liked the option of extending my current subscription when sales are to be had.  Purchasing currently simply pushes out a new key.  That's not very user friendly and a hassle to manage."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gary",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T19:18:51.000Z",
          "Titre": "It found all of my outdated drivers and…",
          "Contenu": "It found all of my outdated drivers and downloaded the newest version automatically. I love this program."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Brian Boot",
          "Nb_Reviews": 7,
          "Date": "2023-12-08T04:15:10.000Z",
          "Titre": "It Does Exactley What Is Promised",
          "Contenu": "I have been having problems for some time and just when I thought I had them beaten a corrupt update really had me beaten, after trying for days to sort this out I happened to see a article that referred to the exact answers to my problem. I purchased Driver Easy and watched as all my problems disappeared. I write this so that others who have these type of problems can be very sure that Drive Easy is the answer"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Luc",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T01:56:43.000Z",
          "Titre": "Driver Easy really help to put lots of correction to my computer",
          "Contenu": "Driver Easy really help to put lots of my drivers up to date and to solve the problem I was having with both of my printer"
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Brian Boot",
          "Nb_Reviews": 7,
          "Date": "2023-12-09T00:07:05.000Z",
          "Titre": "A way back to sanity",
          "Contenu": "Hi AllI recently had a major malfunction with my computer, a corrupt update that caused my computer to really throw a fit of major proportions and after days of trying to fix this my frustration was about to make me buy a new one then when I was searching for help,(This was all done using mouse keys which was adding to matters) when I happened to see a advertisment for something called Driver Easy and I thought lets see what this is all about. Well the rest is history, I purchased it and then just sat back and let Driver Easy return my computer to a fully working unitand to anyone out there who has a major crash I would advise them to invest in Driver Easy for a way to sort them."
        },
        {
          "Note": 5,
          "Lieu": "SA",
          "Pseudo": "Khaled",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T17:50:08.000Z",
          "Titre": "Get this if your steam games keep crashing",
          "Contenu": "My task bar initially was jittery, my games kept crashing. I didn't know which driver to update . But apperantly I had a lot that were out of date. This software was an easy fix to all that"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stewart Wilber",
          "Nb_Reviews": 4,
          "Date": "2023-12-01T04:12:57.000Z",
          "Titre": "Saved an aging but good-running computer from the recycler!",
          "Contenu": "I have an aging Dell Studio laptop as a spare, and was having a great deal of trouble with Windows 10 Update killing the wi-fi. I narrowed the problem to drivers, and got zero help from Dell or Intel. Seeing a mention of Driver Easy somewhere (sorry, I don't recall where), I gave it a try. It updated my drivers with no drama, and my good old Dell Studio now works fine (it will play blu-rays, and has a gorgeous screen, and is 1st generation intel core 7),"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Les",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T15:20:24.000Z",
          "Titre": "My OS has run for a long time until I…",
          "Contenu": "My OS has run for a long time until I had some problems which Driver Easy repaired. Unfortunately, the other problem I had was not a driver problem. Still researching this problem. Keep up the great work."
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "HG Bosch",
          "Nb_Reviews": 5,
          "Date": "2023-12-18T19:34:14.000Z",
          "Titre": "Super Product",
          "Contenu": "Super Product, a life saver, needs to be on every Windows Computer"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T06:10:47.000Z",
          "Titre": "If you want a great program that is so simple to use and understand this is the program to use!!",
          "Contenu": "This is the best way to update your drivers, and it is so simple to do and if for some reason it would miss a driver and you call and talk to them and there’s a few things you have to do but if it comes out to be a missed driver you get a free year. The other thing that I love is when you call the company you actually get to talk to a real person and if you’re having trouble with something they will walk you through the whole process of fixing things, it’s just a remarkable program."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terrance",
          "Nb_Reviews": 5,
          "Date": "2023-12-16T00:13:20.000Z",
          "Titre": "Driver Easy Great Product",
          "Contenu": "Great product, easy to use. Has made my computer operate more efficiently."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter Bell",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T23:06:12.000Z",
          "Titre": "Prompt  response  to my problem  and…",
          "Contenu": "Prompt  response  to my problem  and questions  thankyou"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T02:16:34.000Z",
          "Titre": "I beat the dreaded 100% disk usage…",
          "Contenu": "I beat the dreaded 100% disk usage error with this software after trying dozens of solutions"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Francis",
          "Nb_Reviews": 17,
          "Date": "2023-12-08T13:59:16.000Z",
          "Titre": "Renewal was easy and quick",
          "Contenu": "Renewal was easy and quick, the product is easy to use. I`d really appreciate it if they looked again at the possibility of including bios updates."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T00:27:51.000Z",
          "Titre": "New Bee Link mini pc that was missing  Some drivers !!drivers!",
          "Contenu": "I bought a new Bee Link mini pc that had some missing drivers, So I downloaded AVG driver updater  It said I had 14 outdated and 3 missing drivers so I bought the software for 25 dollars, ran AVG updater and voila it updated all my outdated drivers but did nothing to repair my 3 missing drivers. Now for the happy ending.I bought Driver Easy and Everybody was fixed and HAPPY."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Dale Hobbins",
          "Nb_Reviews": 4,
          "Date": "2023-12-13T18:10:24.000Z",
          "Titre": "Cleaned up my drivers on two devices",
          "Contenu": "Cleaned up my drivers on two devices, just wish that there was a plan for two devices for two years for the same price as the one year three devices plan.Maybe next year that plan will be available?"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Alexander",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T12:56:23.000Z",
          "Titre": "It found and fixed multiple drivers out…",
          "Contenu": "It found and fixed multiple drivers out of date and stopped the 100% disk usage problem on an old pc running windows 10. Easy to download and use. You probably don’t need to renew the purchase and should uncheck this or you’ll get billed again next year. This should be left unchecked for most people would be my advice to improve the experience."
        },
        {
          "Note": 5,
          "Lieu": "NO",
          "Pseudo": "ERIK HANØY",
          "Nb_Reviews": 3,
          "Date": "2023-12-10T19:28:32.000Z",
          "Titre": "Great application",
          "Contenu": "Great application. No worries with stress finding drivers to update, Driver Easy dies the job. Well worth the fee."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chastity Thompson",
          "Nb_Reviews": 3,
          "Date": "2023-11-29T14:24:19.000Z",
          "Titre": "This product is Amazing!!",
          "Contenu": "My laptop kept crashing and the error told me it was a driver issue but didn’t tell me which one. A coworker recommended Driver Easy and it worked! It was amazingly easy to download and run the scan. It found drivers that needed to be updated and then did the updates. My laptop doesn’t crash anymore! I definitely recommend this product!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Derek",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T02:12:49.000Z",
          "Titre": "That time company gets the job done.",
          "Contenu": "Having big trouble after doing a reset on my computer,tried lots of ways to fix the problem, ended up buying Driver Easy,perfect name for a company that gets the job done."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T18:04:01.000Z",
          "Titre": "I’m pretty impressed with the ease on…",
          "Contenu": "I’m pretty impressed with the ease on my part this service has provided. Hit a few buttons and 30 bucks later my part was done. Thanks for the product!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Juliana",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T22:16:06.000Z",
          "Titre": "the program found several drivers that…",
          "Contenu": "the program found several drivers that needed update and updated them. I like this program because it is easy to use and is the cheapest I found."
        },
        {
          "Note": 5,
          "Lieu": "CZ",
          "Pseudo": "Pavel",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T18:16:36.000Z",
          "Titre": "Driver Easy? Yeah, it is THAT easy! I just wish there was a life-time purchase option.",
          "Contenu": "I needed drivers for my brand new laptop. Installed Win11, but there were some major problems with drivers compatibilty and sound issues. Had to do a fresh install of Win10 instead. Some drivers were missing on the official manufacturer page, specificaly the touchpad/trackpad driver, which didn't work after all win10 updates. So I downloaded Driver Easy and it was that easy. Just a click to scan and another to download. And everything works. I just wish there was a life-time licence. For 1 year for 30 bucks, and I will probably use it once. I never had to install or update drivers. Maybe that is a wrong thing to do, but I never had problems not updating during the lifespan of a computer. Unless I had to reinstall Windows. But otherwise great investment to a perfect program."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "George Polkorn",
          "Nb_Reviews": 11,
          "Date": "2023-10-23T12:30:50.000Z",
          "Titre": "Good easy to use PRO drivers updater",
          "Contenu": "Successfully ran DriverEasy Pro on our 3 PCs at home. One PC had as many as 25 drivers outdated, which DriverEasy updated efficiently. Only 1 small problem occurred here- loss of sound (like Youtube playing in silence). Was easy enough to fix: right clicked speaker icon on taskbar and ran through available Microsoft trouble-shootings- sound restored once ran through speakers trouble-shooting- a driver had to be updated and PC restarted. Thought to mention this in case other customers strike this problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Avery",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T10:59:05.000Z",
          "Titre": "Your software was very friendly and…",
          "Contenu": "Your software was very friendly and easy to use for me. Just with some simple step and kaboom, I get what I want. Keep up the good work and update more features in the future Driver Easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Philip D",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T04:06:45.000Z",
          "Titre": "Set the Standard",
          "Contenu": "Quick, multiple responses to my problem. Offered to communicate again quickly. Eventual solution was agreed and implemented. All took less than 12 hours to resolve including overnight.Where do you get that kind of service from anyone?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Smart customer",
          "Nb_Reviews": 10,
          "Date": "2023-11-19T16:48:28.000Z",
          "Titre": "Good driver updater",
          "Contenu": "The application does a good job of updating your computer with the latest drivers. I have received no spam from them. The only suggestion I would have is to enable an auto update feature that scans your computer occasionally for updates."
        },
        {
          "Note": 5,
          "Lieu": "BB",
          "Pseudo": "Faik",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T01:27:09.000Z",
          "Titre": "I'll be honest",
          "Contenu": "I'll be honest, I never purchased DriverEasy. I used a heavily speed limited cracked that they allow people to use. But when I first got my laptop, it blue screened constantly. Windows Update didn't do anything, neither did downloading straight from the manufacturers, but DriverEasy fixed it. Gotta put respect on their name"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Devin",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T00:50:23.000Z",
          "Titre": "Driver Easy Fixing Drivers",
          "Contenu": "Driver Easy fixed the outdated drivers on my PC with ease."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Sunil Kumar",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T04:27:40.000Z",
          "Titre": "Yeah",
          "Contenu": "Yeah! Your software is absolutely okay but unfortunately it didn’t work in my system however i would definitely suggest our friends to buy this software in future,Thanks"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Johny Popa",
          "Nb_Reviews": 3,
          "Date": "2023-11-29T02:15:50.000Z",
          "Titre": "I turned out that I had a hardware…",
          "Contenu": "I turned out that I had a hardware problem with my laptop but Driver Easy were very helpful and kind to advice for a solution and guide me through extra steps. Thank you for your time."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Adonis Antonia",
          "Nb_Reviews": 5,
          "Date": "2023-11-06T12:15:00.000Z",
          "Titre": "Skeptical at first, Extremely happy afterwards!",
          "Contenu": "What I really like, is how quick and friendly the customer service is. I’ve felt safe, understood and heard.Once unlocking the pro version of Driver Easy, everything went really smoothly. Not gonna lie, I was a bit skeptical at first because I’ve never heard of this software. But I’m actually really happy having this software now, because I don’t have to manually check if there’s a new update or driver anymore! Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Russell Goodale",
          "Nb_Reviews": 2,
          "Date": "2023-12-22T00:44:54.000Z",
          "Titre": "easy to use",
          "Contenu": "easy to use. so far the best driver finder that I have used."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ian Blakemore",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T11:22:35.000Z",
          "Titre": "Fantastic and very quick in response…",
          "Contenu": "Fantastic and very quick in response and finding ways to try and get the sound working again on my laptop.The second option worked,it was explained simply so I could follow and took less than a minute to do Thank you so much, it meant I could participate on my online zoom course, which is important for my career"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angela",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T15:31:27.000Z",
          "Titre": "I was legit having a meltdown..",
          "Contenu": "I was legit having a meltdown because my laptop wouldn't find my wifi anymore. I researched and came across an article from Driver Easy with a very easy to interpret guide on what to try and if that doesn't work, try this next, then this, etc. It wasn't salesy. Finally at the end it said download this free version and you may need the pro version.  Let me just say the $30 for the pro version I spent was WORTH my sanity. It found 18 missing drivers and knew my computer specs automatically so I didn't have to search what Dell version I had. Voila, my wifi was accessible again and seemed to get things working a little more speedily.  Thank you to Driver Easy! I'd definitely recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin C.",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T15:33:31.000Z",
          "Titre": "I really like Driver Easy",
          "Contenu": "I really like Driver Easy. The price is very fair and my computer definitely is running better...Thank you very much!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T03:28:02.000Z",
          "Titre": "Fixed Microsoft server not running the…",
          "Contenu": "Fixed Microsoft server not running the computer very well.  Got the correct drivers and bam.  Works like it should."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "yehuda",
          "Nb_Reviews": 4,
          "Date": "2023-11-10T02:00:29.000Z",
          "Titre": "The main reason I signed up with driver…",
          "Contenu": "The main reason I signed up with driver easy was that I have a $500.00 scan snap scanner, that needed updated drivers. The manufacturer said it's discontinued model. I was looking not to throw it out, so I reached out to Driver Easy and their technicial got right down to it and in a few minutes  he got it going."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "rholen",
          "Nb_Reviews": 3,
          "Date": "2023-11-08T05:54:23.000Z",
          "Titre": "Love Driver Easy, I'd be lost without it!!",
          "Contenu": "I've used Driver Easy for years as did my Dad. Owning the Pro version is a must to update all drivers at one time. I perform this check and update drivers weekly to ensure they are current and problem free. The process of checking all drivers and updating those that need is automated and extremily fasy!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paula Durkee",
          "Nb_Reviews": 2,
          "Date": "2023-11-08T12:40:31.000Z",
          "Titre": "My computer is older and  windows…",
          "Contenu": "My computer is older and  windows update was causing all kinds of issues. Spent weeks trying to turn my sound on, update my music and use my printer. This program identified what drivers were needed I updated and am all set now. Thank you so much for your"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "naj",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T05:52:50.000Z",
          "Titre": "I saw a video",
          "Contenu": "I saw a video. I watched another about driver easy. I started thinking this is bs 💩 it can’t be that easy. OOOPS!!! I was wrong, I’ll admit I was wrong and no other excuse. It was easy, easy, super darn easy! I recommended it to my mom, sisters, brother, next door neighbor and y’all. It works, it’s quick and simple."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T06:24:54.000Z",
          "Titre": "Very easy to install",
          "Contenu": "Very quick and easy to install for someone who is not tech savvy at all!"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Mark Woudenberg",
          "Nb_Reviews": 3,
          "Date": "2023-12-17T00:46:25.000Z",
          "Titre": "Did a great job on a 2019 server with a…",
          "Contenu": "Did a great job on a 2019 server with a new motherboard"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T17:14:50.000Z",
          "Titre": "What a breeze it was having all my…",
          "Contenu": "What a breeze it was having all my drivers updated automatically by Driver Easy.  Prior to getting your software, I would rely on Microsoft to update Windows and drivers.  Unfortunately Microsoft did not update drivers.  Thank God for Driver Easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elsa",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T04:27:19.000Z",
          "Titre": "Keep in mind that drivers need regular updates to ensure your hardware functions optimally. Make it a habit to check for updates periodically.ive Stars",
          "Contenu": "Five Stars - A Game-Changer for My PC!I can't say enough good things about Driver Easy! My computer was slowing down, and I couldn't figure out why. Then, I discovered this fantastic tool. With Driver Easy, I not only found out that I had a whopping 22 outdated drivers, but it also made updating them a breeze.The user-friendly interface and straightforward process made it easy for even a non-tech-savvy person like me to use. After updating all those drivers, my computer runs like a dream. It's lightning fast, and I've noticed a significant improvement in its overall performance.I couldn't be happier with the results, and I highly recommend Driver Easy to anyone experiencing computer issues. It's an absolute game-changer, and I give it a well-deserved five-star rating. Thank you, Driver Easy, for breathing new life into my PC!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Anthony",
          "Nb_Reviews": 2,
          "Date": "2023-11-10T08:58:24.000Z",
          "Titre": "A Driver finder that you can trust.",
          "Contenu": "I've trusted this 'driver' finding program for years. It is has been great to have a reliable product that has had a long and trusted life.PC techs will, with good cause, often refrain from using these types of tools.I've never looked back on my years of using this product. You can use it for free to get what you want, or pay to have the process automated.Either way, a SAFE and RELIABLE product, that will often resurrect machines with unknown drivers. Find a missing driver? Ask them and they will add it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barbara",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T18:42:31.000Z",
          "Titre": "I lost the ability to adjust the…",
          "Contenu": "I lost the ability to adjust the brightness on the last Microsoft Windows 11 update. The driver eliminated the adjustment.  I was able to get one that worked from Driver Easy and my screen brightness was restored."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T18:36:18.000Z",
          "Titre": "My Computer sound was restored and my…",
          "Contenu": "My Computer sound was restored and my computer is running much faster and all video is much sharper,"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Randy",
          "Nb_Reviews": 21,
          "Date": "2023-10-31T07:05:38.000Z",
          "Titre": "I have tried updating drivers…",
          "Contenu": "I have tried updating drivers individually in the past and have ran into some issues and I saw an ad for Driver Easy so I scanned my computer with the program and it found that I had 10 drivers that were out of date but a lot of others that were up to date. Well I decided I would purchase the program so It could update the 10 drivers that needed updating and i was pleasantly surprised at how quickly and efficiently it did just that. It even fixed an issue i had with a game I have on my computer that wasn't booting up that just started unexpectedly. I can safely vouch that Driver Easy is Easy."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jean-René Daigle",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T04:03:43.000Z",
          "Titre": "I never buy licenses from any company",
          "Contenu": "I never buy licenses from any company. I always uses free apps or trial BUT this program is worth it! It does exactly what they say it does. Fast and secure drivers update, no worries to have I just love the way it goes. 👍"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Teter",
          "Nb_Reviews": 3,
          "Date": "2023-11-17T20:21:20.000Z",
          "Titre": "They delivered what they promised",
          "Contenu": "They claimed that you just needed to press one button once to get all drivers updated, and if that didn't fix your problem, you'd get a refund. They made good on both those claims."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Mr Blenkinsopp",
          "Nb_Reviews": 2,
          "Date": "2023-11-18T19:42:27.000Z",
          "Titre": "Brilliant",
          "Contenu": "A rapid and effective update of all of my dated drivers for a reasonable annual charge. Thank you for great product ans service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rebecca",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T05:53:28.000Z",
          "Titre": "I really don't know how you did",
          "Contenu": "I really don't know how you did! I am extremely confused about my computer right now. I do know it was fast and that it didn't work. :("
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T23:13:35.000Z",
          "Titre": "He waited for me and was very nice to…",
          "Contenu": "He waited for me and was very nice to talk with."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Lynda",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T06:53:39.000Z",
          "Titre": "The one stop shop to effortlessly get the best from your PC",
          "Contenu": "Driver Easy just kept showing me all the updates that Microsoft kept avoiding.  In the end I upgraded to make it a one stop shop.  The software did what it said and I noticed quite an improvement my laptop. Thanks D.E!!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Dennis O",
          "Nb_Reviews": 6,
          "Date": "2023-11-18T01:19:09.000Z",
          "Titre": "I too was reluctant to buy a driver…",
          "Contenu": "I too was reluctant to buy a driver finding, sorting program, but after having no luck in sorting my problems out fully. Driver Easy to the rescue to fix  my issues and helpful support team investigating the remaining problems."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Jean Claude Petit",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T22:40:06.000Z",
          "Titre": "Anxious buyer",
          "Contenu": "I usually do not use these type of programs ( I was burned in the past). I must say that although buying you software with some anxiety, it has revealed itself to work very well. So, I will say the same thing as the guy who fell from the 38th floor \"I hope its going to last!!!\" Seriously, Driver Easy is a good program.Jean Claude"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Hercules",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T11:07:03.000Z",
          "Titre": "Best customer service ever fast and easy"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Colin Ward",
          "Nb_Reviews": 10,
          "Date": "2023-10-26T00:20:52.000Z",
          "Titre": "Driver Easy is just that.",
          "Contenu": "Driver Easy is just that, Easy. Install, start the program, add your activation code, and run the program. The rest is easy. Just let it install any out-of-date drivers. Follow any instructions on the screen. Enjoy!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Roger Fielden",
          "Nb_Reviews": 3,
          "Date": "2023-10-24T12:19:14.000Z",
          "Titre": "Driver easy is well priced",
          "Contenu": "Driver easy is well priced, totally intuitive to use, displays the processes that it is carrying out clearly and is reasonably fast. It solved a problem of a missing driver and updated a whole bunch of outdated drivers. It saved me a lot of time and I am very pleased with it. Real value for money"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dale",
          "Nb_Reviews": 3,
          "Date": "2023-11-11T04:03:06.000Z",
          "Titre": "As a novice in PC fixes I had searched…",
          "Contenu": "As a novice in PC fixes I had searched multiple sights for trouble shooting techniques for my PC. Rate Driver Easy listed what I needed step by step and helped me solve my issues."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Rachel",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T17:57:13.000Z",
          "Titre": "Simple to use",
          "Contenu": "Simple to use. Does a great job keeping my specs up. Makes it easier to game on my laptop."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Kristine Warne",
          "Nb_Reviews": 7,
          "Date": "2023-12-06T07:35:57.000Z",
          "Titre": "Easy to sign up and great low price",
          "Contenu": "Easy to sign up and great low price. Instructions and how to set up are user friendly and product performs well."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Matt",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T22:02:17.000Z",
          "Titre": "Wish I tried the Pro version sooner",
          "Contenu": "I had been using the free version of Driver Easy for years but was in a time crunch and paid for the Pro version.  I wish I had done it sooner.  Download speeds were way faster than 10x and the auto install of the drivers was a nice change.  Just clicked \"Update All\" and walked away."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Arnez",
          "Nb_Reviews": 2,
          "Date": "2023-11-24T17:13:08.000Z",
          "Titre": "Using Driver Easy has helped update…",
          "Contenu": "Using Driver Easy has helped update drivers and get my system moving smoother again.  Thanks Driver Easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe in Colorado",
          "Nb_Reviews": 4,
          "Date": "2023-12-09T02:14:14.000Z",
          "Titre": "\"One Click\" is  the way to go",
          "Contenu": "My need for total driver updates was daunting, so I chose \"One Click\"."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sammy",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T09:06:52.000Z",
          "Titre": "Extremely Worthwhile for keeping drivers up-to-date",
          "Contenu": "Very straightforward UI. Reliable and safe driver delivery with system checkpoint."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Jesse G",
          "Nb_Reviews": 10,
          "Date": "2023-12-03T16:31:20.000Z",
          "Titre": "A must have",
          "Contenu": "An extremely helpful and time saving tool for every driver you need."
        },
        {
          "Note": 5,
          "Lieu": "CZ",
          "Pseudo": "Eduard Šimánek",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T16:11:15.000Z",
          "Titre": "Professional program",
          "Contenu": "Simple, fast and reliable. I have been using it for several years and I am completely satisfied. In addition, the program is also in the Czech language."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BeepBeepRichie",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T13:59:52.000Z",
          "Titre": "I love driver easy",
          "Contenu": "I love driver easy! My bf told me about it and then I started to do my own research to make sure it was legit. It gives important updates for your computers health that windows doesn’t always provide. I’ve only had driver easy for a week and all the issues I was having before driver easy have so far all been revolved. I’m so happy I bought driver easy cause it really is that easy. And worth the money! I thought the price would be higher! So to have my computer running so smooth with a click of a button for a low price for the whole year. I’m super happy to have driver easy and my computer life will never be same haha. I am not going back! Thank you driver easy for making my life easy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "joseph",
          "Nb_Reviews": 2,
          "Date": "2023-11-13T21:20:21.000Z",
          "Titre": "I've been using this for about 3 and…",
          "Contenu": "I've been using this for about 3 and keeps everything working great especially after a windows update."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carla Pückler",
          "Nb_Reviews": 3,
          "Date": "2023-11-25T07:07:16.000Z",
          "Titre": "This software is very good for me",
          "Contenu": "This software is very good for me. Updating it in recent days even make it easier to use"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elias",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T20:41:09.000Z",
          "Titre": "It keeps the computer healthy and up to date.",
          "Contenu": "It’s a great product! It does what’s needed from drivers updates in an easy way,  to keep the computers in a healthy state."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Randy",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T03:34:33.000Z",
          "Titre": "This fixed and loaded the drivers that…",
          "Contenu": "This fixed and loaded the drivers that were unable to load for bluetooth , audio and video without any issues and little input from me."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Philippe",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T21:46:01.000Z",
          "Titre": "Driver Easy solved my driver issue",
          "Contenu": "Driver Easy solved my driver issue with my keyboard. As its name implies, the process was easy."
        },
        {
          "Note": 5,
          "Lieu": "JM",
          "Pseudo": "Ricardo",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T22:24:13.000Z",
          "Titre": "Easy to use..",
          "Contenu": "Easy to use... updates the computer quickly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eugene",
          "Nb_Reviews": 2,
          "Date": "2023-11-25T11:55:43.000Z",
          "Titre": "You got to get Driver Easy the price is fair but it's  worththe money to find out how many Drivers on your computer need updating.",
          "Contenu": "After down loading Driver Easy and ran it wow! it found 12 needed Drivers updates that I would have never know about."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T19:42:29.000Z",
          "Titre": "Easy purchase and download",
          "Contenu": "Easy purchase and download, first use the program updated 18 out of date drivers, i am very happy with it,"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Marvin",
          "Nb_Reviews": 3,
          "Date": "2023-11-03T14:05:45.000Z",
          "Titre": "Great product",
          "Contenu": "Great product. It found many drivers which windows and me didn't find. Some software problems could be fixed with improved speed."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Frans Bedford-Visser",
          "Nb_Reviews": 7,
          "Date": "2023-11-19T13:42:55.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use, and sorted out the charging issues I had been having with my laptop."
        },
        {
          "Note": 5,
          "Lieu": "SA",
          "Pseudo": "Majed",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T21:29:16.000Z",
          "Titre": "Easy and nothing need to be done",
          "Contenu": "Easy and nothing need to be doneسهل الاستخدام وسعر مناسب مع الجمعة البيضاء"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles Ynfante",
          "Nb_Reviews": 4,
          "Date": "2023-11-07T11:16:26.000Z",
          "Titre": "Simple to use",
          "Contenu": "Simple to use. Hassle-free. Yes, there was a payment for this; but, oh, well. The process took a couple of hours for 36 driver updates, but it was worth it. The graphic card works a lot better."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Metz",
          "Nb_Reviews": 10,
          "Date": "2023-12-01T23:07:59.000Z",
          "Titre": "Driver Easy is truly easy to use",
          "Contenu": "Driver Easy is truly easy to use. You feel good when you know that all your drivers are up-to-date."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Flavio",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T23:10:34.000Z",
          "Titre": "Facile e rapido - Easy and fast",
          "Contenu": "Il programma funziona in maniera rapida e semplice.Tre program works fast and easy"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Douglas",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T15:12:33.000Z",
          "Titre": "So easy to use!",
          "Contenu": "Incredibly easy to be assured that all your system’s drivers are up to date. And so reasonably priced!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cosmic Debris",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T01:07:57.000Z",
          "Titre": "My desktop system was unusable until Driver Easy!",
          "Contenu": "I built a very high end desktop system early this year. I built it with best components I could afford. It's maxed out on memory and has one of the fastest Intel 13th gen CPUs available.When it runs it was wicked fast and made CPU/GPU intensive jobs a breeze. But after a recent Windows update it became more and more unstable. If it went to sleep it would not wake up except by rebooting. Often it would just reboot for no reason. My dream system was useless. It became a huge frustrating time suck. I spent days searching for advice on how to address the severe errors in the event log. While searching for information on Windows driver issues I came upon Driver Easy. I figured I'd try Driver Easy before spending days to reinstall Windows, all the hardware drivers and all the applications I use. I downloaded the trial version (this is a GREAT idea) and Driver Easy found a very large number of possible driver issues. I used the manual method to find and repair a couple of the more serious driver issues. Driver Easy found many issues that the motherboard's manufacturer (ASUS) or the other major components (e.g. MSI 4070 GPU) or Windows update did not address.After using the Driver Easy trial version my system had fewer problems booting (yes, I had booting issues too). The improvement in stability was dramatic and I decided to purchase a license in order to get the \"automatic\" fix procedure to address the rest of the problems it found.Driver Easy is the real deal and absolutely lives up to its advertising. I let it automatically repair a large number of suggested driver issues. My system is now rock solid and stable. Before Driver Easy, my system would reboot several times a day and even rebooting took several tries. Driver Easy saved me *days* of work to reinstall Windows, all the hardware drivers and dozens of applications. Thank you for a great product! I'd give it more stars if I could...:-)"
        },
        {
          "Note": 5,
          "Lieu": "TW",
          "Pseudo": "Liang Yu Chan",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T09:50:30.000Z",
          "Titre": "Quick and warm reply",
          "Contenu": "Got a problem of duplicated payment. Thanks Lily Qui from Driver Easy helped me out!!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Richard Todt",
          "Nb_Reviews": 4,
          "Date": "2023-11-13T21:05:14.000Z",
          "Titre": "The fact that driver easy updated…",
          "Contenu": "The fact that driver easy updated everything more than what windows updater does"
        }
      ]
    }
  ]
}