{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.smtp2go.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Joey J Stones",
          "Nb_Reviews": 15,
          "Date": "2023-07-11T10:00:08.000Z",
          "Titre": "Their awful & shortsighted policy means…",
          "Contenu": "Their awful & shortsighted policy means you can't use the business email they provide to contact potential new clients (who have provided their email and asked to be contacted). I'm self employed and SMTP2GO have essentially choked my ability to contact clients. Probably the worst experience I've had in years!"
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Jim West",
          "Nb_Reviews": 6,
          "Date": "2021-08-24T21:38:07.000Z",
          "Titre": "They censor email content",
          "Contenu": "I sent <10 test emails to my personal email address (0% bounce or spam) and they suspended my account.I understand that an ESP must protect their reputation and can suspend accounts that receive lots of spam complaints, but smtp2go seems to go further and they manually read your emails and will suspend you if they don't like what they read.The list in their TOS is long, including: \"b) send defamatory, harmful, abusive, vulgar or obscene content or material\". So, if you include some 4-letter word, say goodbye to your account."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Yohan Bukash",
          "Nb_Reviews": 2,
          "Date": "2021-09-20T12:20:48.000Z",
          "Titre": "Do not pay attention to all the positive comments because they are fake and they are the ones who wrote it ( Smtp2go Service )",
          "Contenu": "One of the worst services I've ever seen, the technical assistants you can say are dumb  because they don't treat their customers well and they've been sending me emails about giving  a good rating on TrustPilot to smtp2go service absolutely i'll not do it . And By The Way the guys who work with smtp2go who wrote all those 5/5 reviews . Keep away from this service . And the transmission in this service is very weak, what a service to scam customers. Advice go to amazon aws is better than getting nervous because of this service . Lol they block my account after this review ."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "D-ward",
          "Nb_Reviews": 9,
          "Date": "2017-02-13T14:34:05.000Z",
          "Titre": "Down-time. Rude.",
          "Contenu": "We did not find them a particularly efficient or customer-centric organisation in a quite crowded marketplace. There was the downtime (see their Twitter account for notifications as some indication) and also their customer service levels left much to be desired. There are many organisations in the same space and we would suggest shopping around if you're considering this firm (or running it in tandem with another provider in consecutive months).They do offer the basics, smtp service, notification of any changed emails etc, but at a similar (or greater) price point to many others."
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "Keth",
          "Nb_Reviews": 3,
          "Date": "2021-12-15T12:23:31.000Z",
          "Titre": "We like the way of not responding to us…",
          "Contenu": "We like the way of not responding to us and answering other people, so you don't take criticism for your service, so again I have to give you one star for this."
        },
        {
          "Note": 1,
          "Lieu": "TR",
          "Pseudo": "Mehmet Çelikoğlu",
          "Nb_Reviews": 1,
          "Date": "2021-06-18T12:19:17.000Z",
          "Titre": "wretched",
          "Contenu": "Hello;one of the most ridiculous companies I have ever seen in my life I definitely do not recommend you to get service, their staff is very rude, their service is very bad"
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Yohan Bukash",
          "Nb_Reviews": 2,
          "Date": "2021-09-28T00:09:11.000Z",
          "Titre": "This service is a joke",
          "Contenu": "This service is a joke , Which shows us that this service does do what they wants without respecting  the customers .First, do not follow the conditions, as if you follow the terms they will remove your account.Secondly, if you want to go to BBB to defend yourself you will not find them because their company is not recognized neither in Europe or America.Thirdly I advise you to go to another service because this will make you nervous .  if anyone know how to sue them please make new review and tell me how cause this service is scam and all the 5/5 reviews are fake and i promise .By The Way 1) my Data is opt-in 100%2 ) i've store online i sell gift cards and i've 2 payments method ( By Buying Online or COD )3 ) no one is unsubscribe to my service or report my email to spam and that's proof this service is lie / Joke / Dumb ............."
        },
        {
          "Note": 1,
          "Lieu": "BS",
          "Pseudo": "John Burgess",
          "Nb_Reviews": 1,
          "Date": "2019-02-19T01:20:19.000Z",
          "Titre": "Bad service + arrogant policies",
          "Contenu": "Bad service - they suspect you of being a spammer just because you start to use the account more than before. Arrogant and non-caring. There are much better services out there than this one."
        },
        {
          "Note": 1,
          "Lieu": "EG",
          "Pseudo": "Josh Frankel",
          "Nb_Reviews": 1,
          "Date": "2017-05-25T00:36:23.000Z",
          "Titre": "Bad company and bad support",
          "Contenu": "bad company and bad support , i don't use my account even and find my account suspend and my money lost and call support close chat with me , avoid this company"
        },
        {
          "Note": 1,
          "Lieu": "SG",
          "Pseudo": "Во все Дыри",
          "Nb_Reviews": 1,
          "Date": "2020-11-30T07:59:44.000Z",
          "Titre": "They refused to service the account…",
          "Contenu": "They refused to service the account (xiaomi-ru.com domain) without explaining the reason. Strongly do not recommend this service!"
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Nanne Dijkstra",
          "Nb_Reviews": 4,
          "Date": "2019-11-28T09:12:45.000Z",
          "Titre": "No communication after suspended account, we only send 33 mails,",
          "Contenu": "I wanted to test the service of STMP2GO because I was looking for a reliable relay server. At first the communication was great and the support was also fast and good.After having send 33 email using SMTP2GO, I noticed the mail wasn't send. SMTP2GO suspended my acount because of 'unusual activity or an unusually high number of bounces or spam complaints'. We already noticed that there was a bot filling out form on one of our sites and we took appropriate measures. Keep in mind that we only send 33 mails using SMTP2GO. SMTP2GO didn't inform us by mail that they suspended the account (would have been the right way).I tried contacting support by chat but received a default reply and when I asked more questions about 'why', I kept receiving the same reply (not from a bot, but a real person). I send an email yesterday asking about the problems but didn't even get a reply!I think it's fairly indecent to react like this! I understand that if there's an abuse issue, that SMTP2GO has to do something to protect their own system. But you can communicatie with a customer in a decent way."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Fiddiam SA",
          "Nb_Reviews": 2,
          "Date": "2018-06-18T13:34:23.000Z",
          "Titre": "poor choice",
          "Contenu": "poor choicemay be suitable for small senders or hobbies, not recommendend for commercial use.have a nice day"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "None Noneman",
          "Nb_Reviews": 1,
          "Date": "2020-10-07T12:39:52.000Z",
          "Titre": "STOP EMAILING ME ABOUT THE BOUNCE…",
          "Contenu": "STOP EMAILING ME ABOUT THE BOUNCE NOTIFICATIONS....!!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "ID",
          "Pseudo": "SEAMOLEC",
          "Nb_Reviews": 1,
          "Date": "2021-12-16T03:12:22.000Z",
          "Titre": "Thank you SMTP2GO",
          "Contenu": "Thank you SMTP2GO, my project solved use smtp2go"
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "Keth",
          "Nb_Reviews": 3,
          "Date": "2021-12-15T23:42:50.000Z",
          "Titre": "Our long journey is still going on to…",
          "Contenu": "Our long journey is still going on to find a service that works for us after disastrous issues with SendGrid, First we spoke yesterday with a worker called Jennifer via chat, and we asked her that we are looking for a service that is better than SendGrid, and we told her that we have several problems with sending with this service and we are looking for an alternative and what will motivate us to subscribe to their service instead of subscribing to their services Bigger like Amazon SES, MailJet and MailGun, so she started explaining things to me like the speed of sending, but we all know that there are services that are faster than this service in sending, and she told me the price and lied about me saying that they are the cheapest companies that offer these services, but when i answered her that Amazon Ses Saved Us 100,000$ for $10 she avoided answering this question. Secondly, she told us that we should try the service, but after the first 10 emails, we found that our emails reach spam in Yahoo. We did not hesitate and asked them,And another worker called Louise answered us, and she told me I should send them a link from Mail-Tester with the same message and the result was 9.5 which is very good and that's where the discrepancy started, she told me the problem was that we didn't Verify the last CNAME And it's Link Track because we felt it was unsafe on our domain, and then she said something to us that we felt was stupid and she justified the spam because of our unsubcribe link, which we've been using since we set up the store through Shopify, so we took Our amazon aws account and we tried the Amazon Ses smtp to the same mail, the same message, and the same Unsubscribe link , And we did a test and it arrived in the inbox ( Yahoo ) And she started evading the answer again, which made us unsatisfied.Edit ( 15 Dec ) :I am really surprised by your response, what is your matter if we create an account using a number from a company or our private number, something else about our domain I explained to the worker Jennifer that we don't trust your service frankly, and we will not add our private domains within your service because your service not safe  . One more thing. We only sent 10 emails and complained about the problems we saw. Let's imagine if we hit 100,000 per month, that would really be disgusting. Let's talk a little about your website. It's really disgusting and embarrassing , Your site lacks many things, the first is the theme  of your website that attracts our attention and it's rubbish in blue. How can you compare your service that is not recognized internationally, recognized only in New Zealand, with huge services such as SendGrid, Amazon Ses, SparkPost, and PostMark.I am just a customer like other customers who have to criticize the services and tell the truth, if you don't accept criticism I advise you to close your service or just close your account from TrustPilot, this will be better.Edit 2 : This is really strange, how did you know that we are not interested , if we were not interested, we would not have created an account, and if we were not interested, why would we send emails through your service. Secondly, I must clarify something about the phone number. You are only Email Marketing service. What is Your Business if we use a phone number, whether we bought it online or not, add to this that we will not use the phone number in sending, but we will use the email as a sender and we will not need a phone number, and This is just an argument you made to cover up your bad things. We are interested in SMTP2GO , but we want a good service for us, not blue trash (you know what I'm talking about )Edit 3 : You really embarrassed yourselves, I read your TOS twice and didn't find any paragraph that talks about using a free or paid cell phone , or you hide some terms from your customers. I am waiting for your answer so that you blame this time on my name or my family's name because you didn't like it, you really embarrassed yourselves.really disgusting !"
        },
        {
          "Note": 2,
          "Lieu": "FR",
          "Pseudo": "H.Chiron",
          "Nb_Reviews": 1,
          "Date": "2022-07-06T20:48:04.000Z",
          "Titre": "Average service although we expected something better",
          "Contenu": "When we started sending using this service, even though we had several transmission problems, we were trying hard to fix them, as was the smtp2go team .Although the delivery was not what we expected but there was the customer service almost the best we have seen if not the best ,  Until we talked to one of the worst we've seen , really unprofessional and so disrespectful ( l can't tell the name cause Smtp2go keep reporting our review) .She start asking us the same questions that we've been asked over and over again \" How you've collected your data ? \" , we refused to answer any questions from her and we demanded to fix our issues first ,We said that we are using MailJET and we didn't saw the same problem that our emails keep deferred then she said something which is really made us extremely furious .From her :\"If you are getting better results with MailJET , then you may be better off staying with their service. \"We start telling her that she's so unprofessional , then she told us this :Her answer :\"I'm simply giving you options. \"Well we didn't asked you for that you can keep it for yourself , we have a problem and you've to fix it for us , we are paying  for that .And the funniest part , she just sent us an email as Review Team to ask us again about our data list .What a Joke , Honestly she's by far the worst agent we've ever seen , seriously if you keep doing this kind of  behaviours , You gonna lose some clients , anyway we'll close our account and demand our money back due this unprofessional behaviour from her ( I can't tell the name cause SMTP2GO keep reporting my review )Thanks again  for trying and working with us to resolve our issues , You have done your job perfectly :) , even you cannot fix a simple problem which is hilarious .Average service although we expected something better ."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Luke T.",
          "Nb_Reviews": 1,
          "Date": "2019-01-08T20:36:59.000Z",
          "Titre": "Completely inflexible team",
          "Contenu": "Completely inflexible team. They tried to fit our research emails into the standard marketing email template (what we can/cannot say), and that just didn't work. Very aggravating. Ultimately we went to another service and we haven't had any problems with them, and the quality of the delivery is just as good."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Healthcare IT Business Owner",
          "Nb_Reviews": 1,
          "Date": "2018-09-15T11:59:42.000Z",
          "Titre": "The actual service is very good and…",
          "Contenu": "The actual service is very good and solved a major aspect of our deliverability challenge. But SMTP2GO allowed my account to only be partially implemented for a very long time. Not being technical myself, I thought that things were fully set up. SMTP2GO was sending me very nondescript emails to notify me of the situation, but I never got a phone call. I paid extra money (not a lot, but a few dollars) per month FOR YEARS before figuring it out. Now, is this my fault too? You bet. But I really would have liked a phone call in addition to just a bunch of emails telling me that SMTP2GO's services weren't fully operational on my site."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shawn Organ",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T18:53:33.000Z",
          "Titre": "The product is fine, but....",
          "Contenu": "The product is fine...As a large school District we require a traditional PO and Invoicing accounting modality.  This pay as you go billing does not work for us and it is hard to get this working in advance of our subscription end date.Also the support is weak,  I have called many times to get a recording letting me know someone will have to call me back.  it is apparent that this is not a US based organization and it shows in the lack of presence.I would like to have better continuity with an account rep or other support team member so I am not having to start over fresh each timeBut, when I do get a call back, the issue is usually resolved quickly and efficiently."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Holly",
          "Nb_Reviews": 1,
          "Date": "2023-02-22T19:39:22.000Z",
          "Titre": "it is not as reliable in delivery as…",
          "Contenu": "it is not as reliable in delivery as send grid and a bit clunky"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Emma Robinson",
          "Nb_Reviews": 4,
          "Date": "2022-01-23T12:42:36.000Z",
          "Titre": "SMTP2GO has linked simply with our…",
          "Contenu": "SMTP2GO has linked simply with our system allowing a seamless process,i have found the fees to be reasonable.  I am finding that are messages still find their way to junk  files or disappear and some people simply do not receive the emails,  though this is few and far in-between.  Over all it works for us."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DAN NORDQUIST",
          "Nb_Reviews": 4,
          "Date": "2020-05-07T21:39:39.000Z",
          "Titre": "Gracious CEO",
          "Contenu": "Update: The CEO, Charlie, contacted me and explained that it was an incorrect decision and invited me back. Very gracious and of course I forgive them for treating me the way they did. Thank you, Charlie.Original post:These are a hate-full group that will kick you to the curb if you email something they don't like."
        },
        {
          "Note": 3,
          "Lieu": "CY",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-01-27T14:58:25.000Z",
          "Titre": "We need date filtering greater than 45…",
          "Contenu": "We need date filtering greater than 45 days like 1 year"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Craig Kahl",
          "Nb_Reviews": 1,
          "Date": "2021-12-21T18:19:52.000Z",
          "Titre": "be good to talk to  a rep here and there"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LOY'S OFFICE",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T18:17:46.000Z",
          "Titre": "I like the easy of the set up",
          "Contenu": "I like the easy of the set up.  The website or dashboard is user friendly and has ease of use.  Being able to set your own password is a nice feature.  The tracking and reporting help us to see who is using the email and track the high users."
        },
        {
          "Note": 4,
          "Lieu": "MY",
          "Pseudo": "USER",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T02:55:36.000Z",
          "Titre": "Great service but only 1 improvement",
          "Contenu": "Great service, but There is one downside. The hard bounce that occurs when sending to the wrong mailing list is primarily the sender's fault, but shouldn't it be filtered and banned in the own system? It is not right to place all responsibility for using the wrong mailing list on the sender. All good except for that."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MicroWest",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T21:19:38.000Z",
          "Titre": "Great Reporting/Exporting",
          "Contenu": "With COVID we didn't send any bulk emails for over a year (even though we still purchased the service). We sent out a Christmas/New Year’s message to our customers and it still worked as well as before. What made it even better is the improved Reporting. Using the Activity I was able to Filter and export the Hard Bounces into CSV and quickly cleanup my database, this saved me hours of time! Thanks!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Graham",
          "Nb_Reviews": 1,
          "Date": "2022-09-07T19:01:51.000Z",
          "Titre": "Overall a fantastic experience",
          "Contenu": "Overall a fantastic experience. I switched over from SendGrid and was extremely impressed with the ability to view the status of each individual email request and any error associated with it which is really helpful when building your sender reputation.In the rare event of a service issue their customer support were always fantastic and very responsive.Highly recommend SMTP2GO for startups and their plans are flexible enough that you can scale without having to break the bank starting out. They’ll even bill you in CAD if desired which was a huge plus for us."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael P.",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T20:56:47.000Z",
          "Titre": "Overall very easy implement",
          "Contenu": "Overall very easy implement. Have used for several years and the system is reliable. Easy to track and visually see emails through the reports. Solid application."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Elias",
          "Nb_Reviews": 1,
          "Date": "2022-01-31T20:05:00.000Z",
          "Titre": "Easy to use, high recommended",
          "Contenu": "We have been using SMTP2GO for a couple of years now, has always been reliable. Emails go out on time and it takes the hassle away from having to diagnose email issues that we previously had.Very easy to use with minimal interaction once setup."
        },
        {
          "Note": 4,
          "Lieu": "ID",
          "Pseudo": "Tole Sutikno",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T13:20:37.000Z",
          "Titre": "We used SMTP relay from SMTP2GO to…",
          "Contenu": "We used SMTP relay from SMTP2GO to support OJS PKP. We hope that it will be supported"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Albers",
          "Nb_Reviews": 1,
          "Date": "2022-02-01T15:12:39.000Z",
          "Titre": "I really like the ease of use as well…",
          "Contenu": "I really like the ease of use as well the reporting that is provided.  I would recommend this product to others."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TexasFixer",
          "Nb_Reviews": 1,
          "Date": "2022-07-20T03:23:12.000Z",
          "Titre": "SMTP2GO just works",
          "Contenu": "SMTP2GO just works, no issues no problems. Easy set up as well."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Ka-ming",
          "Nb_Reviews": 1,
          "Date": "2022-01-24T17:07:39.000Z",
          "Titre": "No issues for simple email porting SSL TLS",
          "Contenu": "We had to use an email address that relied on older technology (no TLS or SSL) and found that using this service helped us overcome those issues. There were no service interruptions since signing up, and the service was as expected. Definitely recommend if clients need a way around the current email settings from corporations."
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "Vitor Hugo",
          "Nb_Reviews": 4,
          "Date": "2021-10-05T04:49:36.000Z",
          "Titre": "Registration email is not sent.",
          "Contenu": "It's even hilarious that an email company doesn't send emails.The registration email is simply not sent, it does not arrive in the spam box. I can't register with my company email because there are problems with your login system.EDIT: After a few hours of a long chat in support my issue was resolved, it wouldn't be bad to get a reward for the bug."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "BW",
          "Nb_Reviews": 1,
          "Date": "2021-08-31T16:18:56.000Z",
          "Titre": "We have a had very good success using…",
          "Contenu": "We have a had very good success using SMTP2GO.  We send out anywhere from 300,000 to 500,000 emails a month (we are a school district).  The dashboard is very easy to use, even for our non technical users.  Running reports has allowed us to fix issues in a very timely manner.  Of the few times when SMTP2GO is having issues we are alerted and informed once the issue has been resolved."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AJ P.",
          "Nb_Reviews": 1,
          "Date": "2021-07-04T14:13:29.000Z",
          "Titre": "This has been incredibly useful for…",
          "Contenu": "This has been incredibly useful for some of our legacy devices and with services that don't support the kind of authentication Office 365 requires to set up directly. It can be a little odd to set up and you do need to remember to change the credentials here if they change if 365, but otherwise it's what we needed Across 850 employees, the tier we're at for monthly traffic fits perfectly."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Ali",
          "Nb_Reviews": 2,
          "Date": "2021-02-09T22:12:27.000Z",
          "Titre": "We use SMTP2go for our entire system…",
          "Contenu": "We use SMTP2go for our entire system and would recommend the service. Its easy to use and easy to setup.  Their team is also very attentive to any potential issues that would effect our deliverability rate.I did some research looking at other solutions, this was the most reasonably priced with the most features."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "MO",
          "Nb_Reviews": 2,
          "Date": "2020-04-14T08:13:29.000Z",
          "Titre": "I am rarely motivated to write reviews…",
          "Contenu": "I am rarely motivated to write reviews for products of services, However for SMTP2GO I am making an exception. Their service is excellent and at a price point that makes economic sense for my business. I have found their dashboard both easy to use and navigate. Deliverability of emails is top grade. I have no hesitation in recommending their services."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "IBN",
          "Nb_Reviews": 1,
          "Date": "2019-09-24T14:40:49.000Z",
          "Titre": "SMTP2GO has really helped us reduce our…",
          "Contenu": "SMTP2GO has really helped us reduce our email management overhead. Before SMTP2GO, we used an in house mail server that required maintenance we didn't have time to perform. It was old, outdated, and required knowledge of email servers we didn't have. SMTP2GO has really freed up our time to focus on our core offerings and the minimal cost is worth every penny of that!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dirk",
          "Nb_Reviews": 1,
          "Date": "2019-11-26T19:11:32.000Z",
          "Titre": "The experience has been very good",
          "Contenu": "The experience has been very good.  I have used it for around 5 years.  Only once did I have a problem, when one recipient claimed that he was getting 6 or 7 copies of each email.  I worked with the SMTP2GO team, and they couldn't find any issues on their end.  The problem may well have been with the recipient's own email provider anyway.  But in any case, the problem ended quickly, and otherwise the service has worked perfectly for me, very satisfied!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joshua Jacobs",
          "Nb_Reviews": 2,
          "Date": "2019-12-10T22:22:31.000Z",
          "Titre": "SMTP2GO has been a great service",
          "Contenu": "SMTP2GO has been a great service.  We use them for relaying of our Scanners and other devices using SMTP service in our company.  This allows us to keep our mail servers more secure and keeping unwanted traffic off of them.  We have noticed very good support services with SMTP2GO and if support is ever needed issues resolved in no time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Hampton",
          "Nb_Reviews": 2,
          "Date": "2022-12-21T19:27:34.000Z",
          "Titre": "Great email service"
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "QM",
          "Nb_Reviews": 1,
          "Date": "2018-12-11T10:14:48.000Z",
          "Titre": "Recommended :)",
          "Contenu": "I've started using SMTP2GO because of some serious problems and limitation of my previous mail server system. I have to say that SMTP2GO is one the best I've ever used.I'm using it in my firm, with a lot of emails going out every day. SMTP2GO never had a serious problem.The monitoring system of emails and bounces etc is very good as well."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Emphatech Solutions",
          "Nb_Reviews": 1,
          "Date": "2020-08-18T04:43:34.000Z",
          "Titre": "Seamless services. Rapid Responsiveness.",
          "Contenu": "SMTP2GO has a major role in helping us to grow.Their seamless mail services has been a game-changer for us.Any grievance is handled with utmost priority and resolved as soon as possible.A big thumbs up to the team.Giving 4.5 stars, Since there is always room for improvement.Regards"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Dave Warren",
          "Nb_Reviews": 1,
          "Date": "2019-10-31T03:15:44.000Z",
          "Titre": "Great service for our needs",
          "Contenu": "All in all, SMTP2Go has been a decent enough service. We primarily use it for delivering messages sent via SMTP from systems that need to be able to delivery email if our in-house infrastructure is down.We do no bulk mail so I cannot comment as to how SMTP2Go operates in this area.Uptime is fine, they admit when they have issues (a major plus). The UI is a bit hit-or-miss, we've needed to update DNS records a few times to maintain DKIM signing, but hey, at least they support SPF, DKIM, etc."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel Oostra",
          "Nb_Reviews": 1,
          "Date": "2019-02-13T16:00:14.000Z",
          "Titre": "We have been using smtp2go for a couple…",
          "Contenu": "We have been using smtp2go for a couple of years now and since we've been using them we have had no issues with our outgoing notifications emails to our clients. Very simple to set up and very affordable SMTP services. We will continue to use this service and would suggest it to anyone who needs reliable email services. Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris Mihm",
          "Nb_Reviews": 1,
          "Date": "2018-10-30T04:46:55.000Z",
          "Titre": "Recommended!",
          "Contenu": "SMTP2Go has been my go-to for trusted emails for over a year now and I have no complaints! The service is affordable, easy to use both from the sender and receiver sides, the site/software is intuitive and informative, and I've had no issues whatsoever in getting emails to the places they need to go! I definitely recommend their service."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Martin",
          "Nb_Reviews": 1,
          "Date": "2018-11-27T04:18:44.000Z",
          "Titre": "Well worth it",
          "Contenu": "SMTP2GO is overall a really good service. It gives me peace of mind knowing that the emails from my app are being delivered, and that I can check on the overall status right down to individual email sends whenever I need to. I find the interface to be quite clean and user-friendly, and they continue to improve it. I was impacted once when there was unscheduled downtime, but that's actually pretty good considering I've been using SMTP2GO for a long time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "M Morgan",
          "Nb_Reviews": 1,
          "Date": "2019-07-02T12:33:28.000Z",
          "Titre": "SMTP2GO is a reliable resource",
          "Contenu": "SMTP2GO is a reliable resource.  We use it to provide email capability to third party apps that we do not necessarily want inside our network, or for vendors who are not capable of providing for themselves.  It has also been valuable as a bridge for older copiers to continue to work with the increasing security requirements of solutions such as Office365.  I have never experienced downtime with the service, or had any issues that were not resolved within a few minutes.  Overall a solid solution."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 3,
          "Date": "2020-10-06T22:23:33.000Z",
          "Titre": "Have been using SMTP2GO for about a…",
          "Contenu": "Have been using SMTP2GO for about a year now to avoid dealing with our contract IT people.  The only issue I have had is over time I was no longer about to send from a made up email address, it had to be bona fide.  That ties up licenses at work.  Not the end of the world."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Peter Sharpe",
          "Nb_Reviews": 1,
          "Date": "2020-12-01T02:44:12.000Z",
          "Titre": "SMTP2GO has been the answer to all our…",
          "Contenu": "SMTP2GO has been the answer to all our bulk email problems.  As soon as we started using SMTP2GO, we no longer had any problems with our emailing of invoices or otherwise.  It's been easy to set up and use and we are very happy with the services.  Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James P. Buffalo",
          "Nb_Reviews": 1,
          "Date": "2019-03-05T18:42:01.000Z",
          "Titre": "Highly recommend!  We love it",
          "Contenu": "We have been using SMTP2GO for over four years.  The dash board alone is reason enough.  But the service is great.  At our high point we sent over 2000 emails a day. With the dash board we could also text out application to see if we actually are sending emails.  Critical in development.   Great service."
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Thami Muzi Manyoni",
          "Nb_Reviews": 1,
          "Date": "2018-01-22T12:58:28.000Z",
          "Titre": "I liked the speed of their online chat …",
          "Contenu": "I liked the speed of their online chat and the patience of the person who was helping me (Teresa). Even though I was having connectivity issues she was patient until the end. She managed to help resolve the issue I had and also offered assistance on how to resolve the issue should I come across it in future."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alex Baird",
          "Nb_Reviews": 1,
          "Date": "2019-01-10T13:26:54.000Z",
          "Titre": "I have used SMTP2GO for several years",
          "Contenu": "I have used SMTP2GO for several years.  By far the easiest way to provide SMTP/email delivery services.  Simple and flexible setup.  Tech support is very prompt and diligent.  Good selection of service options based on number of emails processed.  Reasonable pricing.  I would highly recommend."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Safwat",
          "Nb_Reviews": 1,
          "Date": "2018-11-20T21:08:44.000Z",
          "Titre": "Great service",
          "Contenu": "I have been using them for about 2 years. Have never experienced a problem with their service of have any downtime. I highly recommended to everyone else as they are trustworthy and I am very satisfied as a client and we will continue to be using it for all our business and customer needs."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "IT Management",
          "Nb_Reviews": 1,
          "Date": "2020-06-09T16:02:10.000Z",
          "Titre": "It is a good service..",
          "Contenu": "It is a good service and we like it, however there are a couple of things that we are unable to do. One problem we have is when our office does a mass email to our employee's it doesn't like it. Another is it doesn't like our vacation responder."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Alvin Joseph Robles",
          "Nb_Reviews": 1,
          "Date": "2018-12-27T06:21:34.000Z",
          "Titre": "great smtp host server!",
          "Contenu": "been using smtp2go as my main smtp hosting app, and ive got to say im very impress on the delivery and speed of sending my smtps to my clients. also, the prompt assistance of their 24/7 support. which is really nice when i need assistance on my smtp configurations. thanks a lot!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 4,
          "Date": "2022-01-11T02:00:12.000Z",
          "Titre": "User friendly interface and solid service and support",
          "Contenu": "The user interface is intuitive and the set up of domains, and the overall process of configuring a new domain, is fast and easy. I find domain and API Key configuration much easier that some competing services also. In addition, the email delivery has been great and is constantly fast. The chat support has answered my questions or resolved issues over 98% of the time. They are usually very responsive on chat and even email. The one concerning issue I see with SMTP2GO is the Suppressions - Blocked recipients list. If there is a Blocked recipient, you are not notified about the block. SMTP2GO needs a process that generates an email notice to us, the account holder so action can be taken right away. SMTP2GO, please add notifications to the Blocked recipients list. Overall a great service!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "fn0",
          "Nb_Reviews": 1,
          "Date": "2020-06-30T07:07:14.000Z",
          "Titre": "Signup was easy",
          "Contenu": "Will report later, but just say now that smtp2 signup was very easy. My ISP TELUS will be subcontracting its email to Google and I don't care to depend on being signed into Google for outgoing emails, so am going to switch to smtp2go"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andy Picton",
          "Nb_Reviews": 1,
          "Date": "2018-11-06T13:16:40.000Z",
          "Titre": "SMTP2GO has been a dependable service",
          "Contenu": "SMTP2GO has been a dependable service. We've been with them a few years and had very few issues. They are very strict on monitoring to make sure we aren't sending spam, which is good overall. We sometimes have deliver-ability issues when sending to AOL or Yahoo recipients, which they recommend us not to do. Unfortunately, we can't always control our clients' usage and it's awkward trying to explain this all the time without sounding like we have a limited service.Their reporting is great and makes it easy to monitor our reputation and the status of emails we've sent."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "PJ",
          "Nb_Reviews": 1,
          "Date": "2019-07-03T16:27:01.000Z",
          "Titre": "Great product for the need to securely…",
          "Contenu": "Great product for the need to securely and reliably deliver email. It just works! We've been running on it for many months, and particularly happy with the feature of sending using the most secure sender-authentication mechanisms ( DKIM, etc. )"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Maggie",
          "Nb_Reviews": 1,
          "Date": "2019-10-31T13:25:22.000Z",
          "Titre": "Love being able to text 100 people at a…",
          "Contenu": "Love being able to text 100 people at a time and not pick up the phone, save me so much time! The online account is very user friendly, when I wasn't able to figure it out on my own I was able to call and someone helped me immediately!"
        },
        {
          "Note": 4,
          "Lieu": "CR",
          "Pseudo": "Luis Cardenas",
          "Nb_Reviews": 1,
          "Date": "2019-03-22T23:28:34.000Z",
          "Titre": "Hi excellent customer service for small companies like ourselves",
          "Contenu": "HiWe have been smtp2go customers for long time and always we had having excellent support.We are located in Costa Rica and for our business is very important to have some person to talk I order to fix some issue.Best regardsLuis"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Hogan",
          "Nb_Reviews": 1,
          "Date": "2019-04-23T20:42:04.000Z",
          "Titre": "SMTP2GO is the perfect solution for my…",
          "Contenu": "SMTP2GO is the perfect solution for my application to be able to send emails to customers.  It allows them to receive receipts via email and not use ink and paper unnecessarily.  Setup was fast and easy and pricing is very reasonable."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Nathan",
          "Nb_Reviews": 3,
          "Date": "2020-02-19T13:26:06.000Z",
          "Titre": "We have used SMTP2GO for some time now",
          "Contenu": "We have used SMTP2GO for some time now. It has always proved to be a reliable sending resource with relatively few issues. The dashboard is particularly user friendly and very easy to track sends and download updates etc."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "M Slutzky",
          "Nb_Reviews": 2,
          "Date": "2018-10-30T11:50:42.000Z",
          "Titre": "I've been using SMTP2GO for several…",
          "Contenu": "I've been using SMTP2GO for several years now. It's great for those who like me travel for work a lot. The only thing to improve would be a Quartz image which instals the smtp codes in order to make things easier for users."
        },
        {
          "Note": 4,
          "Lieu": "PK",
          "Pseudo": "Irfan Merchant",
          "Nb_Reviews": 1,
          "Date": "2021-12-21T13:02:55.000Z",
          "Titre": "Few lines for SMTP2Go Service",
          "Contenu": "SMTP2GO makes it possible for us to send emails to our employees from our own systems. Billing is always prompt and accurate. A trustworthy partner we can recommend."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JRL",
          "Nb_Reviews": 1,
          "Date": "2019-06-05T16:24:30.000Z",
          "Titre": "Good for Emergency Alert Emails",
          "Contenu": "SMTP2GO works well to deliver the services that you need provided. Their service gives us the great opportunity to monitor the systems we need to keep a careful eye on, and receive email alerts when the time comes."
        },
        {
          "Note": 4,
          "Lieu": "BB",
          "Pseudo": "Jabarry G",
          "Nb_Reviews": 1,
          "Date": "2018-09-03T03:46:14.000Z",
          "Titre": "My experience has been great",
          "Contenu": "My experience has been great. With other providers it was an issue getting them to give me the IP address for the smtp server but with SMTP2Go it’s been a breeze and they keep me updated if the address ever changes"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "L Weisz",
          "Nb_Reviews": 1,
          "Date": "2019-06-25T13:15:36.000Z",
          "Titre": "UI is excellent",
          "Contenu": "UI is excellent. Customer service is quick and efficient. Have found that it is sometimes difficult to trace an email and to determine what happened to it if the user complains that it didn't receive it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nathan Lyle",
          "Nb_Reviews": 3,
          "Date": "2019-09-25T02:08:13.000Z",
          "Titre": "Would Definitely Recommend",
          "Contenu": "Fairly pain free, the few times I've had problems, the support has been great. I like the information I'm able to get to in order to troubleshoot. Has made reaching my clients much more reliable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cullen",
          "Nb_Reviews": 1,
          "Date": "2019-07-02T15:09:14.000Z",
          "Titre": "This service has allowed us to use a…",
          "Contenu": "This service has allowed us to use a more secure email system than previously while still integrating with the software that we need to do our work. It has been a great help and is reasonably priced."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daryl M",
          "Nb_Reviews": 1,
          "Date": "2019-07-23T14:02:53.000Z",
          "Titre": "We have used SMTP2GO in our business…",
          "Contenu": "We have used SMTP2GO in our business for many years now. We have many automated email notifications that are sent daily and we use their service in these cases. The service is simple and works well."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Rene Lanteigne",
          "Nb_Reviews": 1,
          "Date": "2019-02-02T18:48:33.000Z",
          "Titre": "Reliable and a good solution",
          "Contenu": "Reliable and a good solution, for someone who travels a lot and doesn't want to have to reconfigure his devices everytime he changes Internet provider to send emails."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Mark Davies",
          "Nb_Reviews": 2,
          "Date": "2018-08-30T23:20:56.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service. In the rare instance of an issue we are advised by email and able to view status online. Good reporting of traffic for us to identify issues elsewhere."
        },
        {
          "Note": 4,
          "Lieu": "CL",
          "Pseudo": "Soco Astorga",
          "Nb_Reviews": 1,
          "Date": "2018-09-04T10:29:21.000Z",
          "Titre": "SMTP2GO is a very good service",
          "Contenu": "SMTP2GO is a very good service.  They perform as advertised.  Solved our problem of our legitimate emails being marked as SPAM and not being seen by our clients."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Beckmann",
          "Nb_Reviews": 1,
          "Date": "2018-10-02T21:06:28.000Z",
          "Titre": "We were stuck with Godaddy's limited SMTP",
          "Contenu": "We were stuck with Godaddy's limited SMTP functions, we could not even send out a company newsletter to all 150 employees without having to break it up into three emails, since they have a 50 address limit per message, plus only 250 smtp relays per day (without buying more, per user). I found SMTP2GO solved that issue, but it actually had so much more to offer, with statistics, bounce and spam reports. Plus, less messages were being blocked to legitimate addresses by the other email systems. My only wish is that SMTP2GO should have a complete email and webmail system, we would probably switch over in a heartbeat.  Only 4 stars, as user creation is time consuming for large numbers of addresses. And I wish the rates were only per message, and not with set blocks, as our sent emails fluctuate month to month with no consistency.Overall, I would recommend their product."
        },
        {
          "Note": 4,
          "Lieu": "ID",
          "Pseudo": "Vincent H",
          "Nb_Reviews": 1,
          "Date": "2018-10-31T03:13:29.000Z",
          "Titre": "Very good. Run flawlessly",
          "Contenu": "Very good.But it is nice if we can change the bounce email notification template.I want to put my company name and link there instead of SMTP2GO."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 3,
          "Date": "2021-10-12T18:26:31.000Z",
          "Titre": "Works very well",
          "Contenu": "Works very well; needed something that worked right without the hassle of getting our contract IT group involved."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Team Horner IT Dept",
          "Nb_Reviews": 1,
          "Date": "2022-01-31T18:31:22.000Z",
          "Titre": "This is a great service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Workfront",
          "Nb_Reviews": 1,
          "Date": "2019-02-13T17:57:01.000Z",
          "Titre": "SMTP2Go is very reliable and easy to…",
          "Contenu": "SMTP2Go is very reliable and easy to use. We use it as an easy relay for our printers/scanners, SaaS applications, etc."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Lambertus Verhage",
          "Nb_Reviews": 1,
          "Date": "2018-10-16T19:37:25.000Z",
          "Titre": "It is always accessible that's great",
          "Contenu": "It is always accessible that's great But it can always betterThat's Dutch talkingRegards Lambertus"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marci",
          "Nb_Reviews": 1,
          "Date": "2018-09-25T12:50:18.000Z",
          "Titre": "This works very well with our system",
          "Contenu": "This works very well with our system. We are able to get our voicemail sent to our email."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John M Miller",
          "Nb_Reviews": 1,
          "Date": "2019-06-23T13:51:25.000Z",
          "Titre": "Useful",
          "Contenu": "Generally, works well, and is easy to use. However, sometimes sending is slow."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gregory Albert",
          "Nb_Reviews": 1,
          "Date": "2019-08-27T12:51:48.000Z",
          "Titre": "SMTP2GO has served our needs well",
          "Contenu": "SMTP2GO has served our needs well. When needed customer service was helpful."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Rick Williams",
          "Nb_Reviews": 1,
          "Date": "2018-11-27T23:04:06.000Z",
          "Titre": "The software does what it says it does…",
          "Contenu": "The software does what it says it does is easy to configure and just works!"
        },
        {
          "Note": 4,
          "Lieu": "AE",
          "Pseudo": "Yudeshtra Naidoo",
          "Nb_Reviews": 1,
          "Date": "2019-04-06T13:28:39.000Z",
          "Titre": "No issues since I got the subscription",
          "Contenu": "No issues since I got the subscription. It’s reliable and it works!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wolf Laurel",
          "Nb_Reviews": 2,
          "Date": "2021-09-21T16:03:45.000Z",
          "Titre": "Great service",
          "Contenu": "Great service. A little hard to learn in the beginning."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "WBCL Alerts",
          "Nb_Reviews": 1,
          "Date": "2020-06-02T15:45:09.000Z",
          "Titre": "Its a good service",
          "Contenu": "Its a good service. Support is good. Set it up and forget it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Barbara Einhorn",
          "Nb_Reviews": 1,
          "Date": "2018-08-15T13:48:55.000Z",
          "Titre": "We are happy with the services SMTP2GO…",
          "Contenu": "We are happy with the services SMTP2GO provides to our office"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mr Howard Coates",
          "Nb_Reviews": 21,
          "Date": "2021-12-14T18:41:19.000Z",
          "Titre": "Good but.....",
          "Contenu": "Good, but 2fa is not thought out properly"
        },
        {
          "Note": 4,
          "Lieu": "TH",
          "Pseudo": "Ajay Kumar",
          "Nb_Reviews": 1,
          "Date": "2020-01-22T00:36:57.000Z",
          "Titre": "I am using service from past 3 yrs",
          "Contenu": "I am using service from past 3 yrs. So far happy"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Linda",
          "Nb_Reviews": 1,
          "Date": "2018-03-22T15:41:24.000Z",
          "Titre": "SMTP2GO gets our email very well…",
          "Contenu": "SMTP2GO gets our email very well delivered."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jean",
          "Nb_Reviews": 1,
          "Date": "2019-06-05T15:04:20.000Z",
          "Titre": "Great service and have not had any…",
          "Contenu": "Great service and have not had any issues"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "RANDY BELL",
          "Nb_Reviews": 5,
          "Date": "2019-09-03T22:42:27.000Z",
          "Titre": "Reliable service at an affordable pricr"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Equijust",
          "Nb_Reviews": 1,
          "Date": "2019-07-02T13:02:44.000Z",
          "Titre": "They are very professional",
          "Contenu": "They are very professional. Recommended"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "John Forbes",
          "Nb_Reviews": 4,
          "Date": "2018-12-04T07:23:20.000Z",
          "Titre": "Had very good and consistent service"
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Marcello Gallorini",
          "Nb_Reviews": 1,
          "Date": "2018-12-11T08:09:53.000Z",
          "Titre": "Efficient and always available."
        },
        {
          "Note": 4,
          "Lieu": "BN",
          "Pseudo": "walter loh",
          "Nb_Reviews": 1,
          "Date": "2018-08-30T10:27:41.000Z",
          "Titre": "very useful and easy to setup"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Helen Anderson",
          "Nb_Reviews": 16,
          "Date": "2023-12-11T15:50:19.000Z",
          "Titre": "SMTP2GO is rock-solid",
          "Contenu": "SMTP2GO is rock-solid, with awesome support. Thoroughly recommended if you need an e-mail sender that works, with an economically sound UI and excellent support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "codersmurf",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T22:22:12.000Z",
          "Titre": "great support",
          "Contenu": "quick, knowledgeable, nice, no issues"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Steve Goacher",
          "Nb_Reviews": 2,
          "Date": "2023-11-08T16:19:39.000Z",
          "Titre": "we have sent millions of emails over…",
          "Contenu": "we have sent millions of emails over the last 6+years using smtp2go and they have provided a very reliable service.  We only use their support team occasionally but today we needed their help and their support (from Charlotte) was really great. The problem was sorted quickly once we knew what we needed to do."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roger Kreps",
          "Nb_Reviews": 4,
          "Date": "2023-11-21T20:08:42.000Z",
          "Titre": "Delivery I don't know how you do it",
          "Contenu": "Delivery I don't know how you do it, but you get  all of my Customers that have gmail and hot mail in their in boxes.  The others I have used don't.  Great price.  Overage was also the thing you will run them and bill us the difference instead of shutting it off."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "A Systems Architect",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T21:17:39.000Z",
          "Titre": "SMTP2GO checked all our feature needs…",
          "Contenu": "SMTP2GO checked all our feature needs at a very attractive yearly cost. Ease of use and reliability have been great. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Jennifer Webb",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T13:29:37.000Z",
          "Titre": "Highly Recommend!",
          "Contenu": "I had been trying to sort out a mail delivery issue for weeks before SMTP2GO solved it in minutes. Louise was professional, knowledgeable, and incredibly patient with me as we set up my account. This is a phenomenal service and company! Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "BD",
          "Pseudo": "Shahidul Islam",
          "Nb_Reviews": 8,
          "Date": "2023-11-21T00:03:06.000Z",
          "Titre": "Fantastic experience with Support Eng. Emma",
          "Contenu": "I had a fantastic experience with Emma from smtp2go support. She provided exceptional assistance in resolving a technical issue I was facing. The level of support I received truly exceeded my expectations. It's evident that smtp2go places a high value on customer satisfaction. The platform itself is outstanding, offering reliable and efficient email delivery services. The ease of use and robust features make it a top choice for anyone seeking a dependable SMTP service.What sets smtp2go apart is not just the quality of its services, but the dedication of its support team. Emma's prompt and effective resolution of my problem showcased a commitment to customer success. I highly recommend smtp2go not only for its powerful email delivery solutions but also for the unparalleled support provided by professionals like Emma. It's a testament to their commitment to ensuring a smooth and positive experience for their users. Choosing smtp2go has proven to be a wise decision, and I'm confident in its reliability for all my email delivery needs."
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "Ian Scott",
          "Nb_Reviews": 4,
          "Date": "2023-11-02T12:04:02.000Z",
          "Titre": "Amazing Fantastic Support",
          "Contenu": "I have been using SMTP2GO for about 2 years now. Their service works great. What really stands out though is their customer support.The odd time I've needed to contact their support team, I am so impressed with their responsiveness and help. They are great."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Karina",
          "Nb_Reviews": 4,
          "Date": "2023-09-06T05:42:40.000Z",
          "Titre": "Customer Service is Fantastic",
          "Contenu": "Customer Service is Fantastic! I was nervous about changing my platform settings to use SMTP2GO, but Rick was on chat support, and he helped me all the way through the setup process, from adding records to my DNS settings, to creating SMTP users, and being really patient with answering all my questions. (AND I had a lot of them) I really like the features so far, I'm on the free plan, and I think the whole service works great. It's definitely an added tool for any growing business where email communications are vital for growth."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matt Westfall",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T20:59:56.000Z",
          "Titre": "Smtp2go is the WAY 2 go",
          "Contenu": "Smtp2go servers, systems, and website are way faster than any other providers of this type of service we have used.Their support is prompt, they do not globally disable your account but continue to accept your mails and effectively gold your emails hostage and wait threw days to 'review and respond' to answers you provide them based on vague non descript 'issues'.Their dashboard is comprehensive and you can identify most problems and address them before they even notice themselves."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan McCrae",
          "Nb_Reviews": 2,
          "Date": "2023-03-23T18:12:47.000Z",
          "Titre": "We have been using SMTP2GO for 2+ years without a hiccup.",
          "Contenu": "Two years ago we launched a web based, custom application for our company. One of the most important parts of the system was linked to automated notices regarding our customer's order status. We struggled with SMTP solutions from two other providers. I found SMTP2GO and had it configured and running very quickly. No blacklisted domains, account lock outs, or evil \"we're going to close your account\" due to too many spam submissions. We have been using SMTP2GO for 2+ years without a hiccup."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lucid Technologies",
          "Nb_Reviews": 3,
          "Date": "2023-07-11T19:17:52.000Z",
          "Titre": "Amazing service and support",
          "Contenu": "I have been with SMTP2Go for almost a year and it has been a super reliable service. No issues and seeing delivery matrix is great. Super affordable and well worth the cost. Helps decrease required administration of email servers. Only need support once (for a few questions) and they were very responsive and answered each question thoroughly. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Alexandre Dénommée",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T22:19:42.000Z",
          "Titre": "The best!",
          "Contenu": "had an issue today (wich is rare) and they respond quickly. super satisfied since multiple years."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Andrew",
          "Nb_Reviews": 1,
          "Date": "2023-06-17T00:56:08.000Z",
          "Titre": "Powerful SMTP services for multiple domains or single users.",
          "Contenu": "SMTP2GO is a cloud-based email delivery platform that helps deliver and track emails and they are good at it.Based in Australia, we have been using SMTP2GO for the past several years. [3 years in June 2023] Customer interface is second to none. Support via e-mail is swift for any enquiries. Its features include ticket support, live chat, setup assistance, feedback loops, blacklist monitoring, spam trap detection, real-time analytics, weekly summaries and bounce/spam tracking. They constantly monitor their system and advise if one of your user is having issues to a computer breach. Outstanding."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Adam Clarke",
          "Nb_Reviews": 2,
          "Date": "2023-06-08T01:51:51.000Z",
          "Titre": "Cost effective and reliable",
          "Contenu": "Does exactly what it says on the tin. SMTP2Go provides a cost-effective and reliable service for outgoing email. We use it for a number of tasks including notifications from equipment and third-party SASS platforms (e.g. JotForm, Zapier) as it's much easier and cheaper than using Microsoft 365."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brad Bloomer",
          "Nb_Reviews": 1,
          "Date": "2023-01-17T03:00:27.000Z",
          "Titre": "Thank you being a breath of fresh air…",
          "Contenu": "Thank you being a breath of fresh air in the nightmare world of crappy useless so called tech support which is so prevalent these days.Your quick response, giving me the exact solution I needed and even going the extra mile to find that blacklist has me flabbergasted.You have solved my problem which I am ashamed to admit has taken up the better part of my day today.Very satisfied smtp2go user!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Casey T.",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T18:21:53.000Z",
          "Titre": "SMTP2Go has been a lifesaver for…",
          "Contenu": "SMTP2Go has been a lifesaver for setting up copiers and AIO printers to send scanned emails. I started with the free version and used one of my smaller clients. The services worked so well, and we now have the paid version, and all of my clients are sending scans with no problems. The smtp2go website activity is my go-to to see real-time client mail flow to see any errors or delays. I have been pleased with the few times I contacted support for the fast response and resolutions—excellent product/service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric Sietsema",
          "Nb_Reviews": 1,
          "Date": "2023-02-22T20:00:22.000Z",
          "Titre": "Smpt2Go Is Great!",
          "Contenu": "Smpt2Go is an amazingly simple service, but also it solved a very large problem that we were facing. Having reliable email services when needed, they have been our go to for some out dated equipment not supporting new email rules and requirements. Their service has saved us a lot of money by allowing us to use our equipment as needed."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Peter Bishop",
          "Nb_Reviews": 3,
          "Date": "2023-11-16T02:47:14.000Z",
          "Titre": "Easiest SMTP system I have ever used",
          "Contenu": "Just wanted to say this is the easiest SMTP system I have ever used and I have 20 years of web experience. Works perfectly with my VPS. Thank you so much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony Herman",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T20:02:19.000Z",
          "Titre": "Super Reliable - Why Go Anywhere Else?",
          "Contenu": "SMTP2GO super reliable and a great solution for our clients who need excellent email delivery reliability. From an admin point of view, having logs in a nice, online interface helps us troubleshoot issues easily. We've been using it for years.Why go anywhere else?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "A Younis",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T17:43:45.000Z",
          "Titre": "Great website, Great Support-!",
          "Contenu": "I've heard about the service through Reddit in one of the subs i had, it was just a passing mention for smtp2go but i got intrigued.Upon trying to get set up with them, their website and interface was super super user friendly, i got setup within 2 hours (should be much less for experienced users)I got my scan to email issue which haunted me for 3-4 months resolved in no time.For support, you will get in touch with a human as soon as you hit chat. Support is very friendly and helpful.I highly recommend this service, you won't go wrong with them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rich",
          "Nb_Reviews": 4,
          "Date": "2023-03-30T22:37:02.000Z",
          "Titre": "Very happy with SMTP2Go",
          "Contenu": "Very happy with SMTP2Go. Been using them for several years now since my ISP pawned off SMTP handling to Google. I have multiple domains and I have excellent deliverability, no problems what so ever. Especially useful if you are mobile and constantly jump from ISP to ISP. Gives your addresses a solid reputation, as they are always going out from the same source."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pat DiPersia",
          "Nb_Reviews": 2,
          "Date": "2022-07-11T18:55:51.000Z",
          "Titre": "Extremely happy with SMTP2GO!  Great support, great price, great service!",
          "Contenu": "Have been using SMTP2Go since we started moving clients to Office 365.  So much easier and more secure to point multi-function devices and similar to SMTP2Go as opposed to having SMTP go through basic authentication and such on O365.  SMTP2Go just works.  Support (In the rare event you need them) is quick to respond and helpful.Not sure I've ever had a complaint about the service in several years.  Can't beat the price either!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ledoktre",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T16:47:36.000Z",
          "Titre": "We moved datacenters for our hosting…",
          "Contenu": "We moved datacenters for our hosting needs and along with that came restrictions on SMTP. We tried another SMTP solution before finding SmtpToGo and let me tell you, SmtpToGo is AWESOME. I had initially looked at the restriction as a hinderance or a limitation but now after partnering with SmtpToGo, I can honestly say this is the way to do it. Not only am I getting much better deliverabity, but I have more granularity per sender, more reports, full DKIM support. Wow. Just awesome."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob",
          "Nb_Reviews": 2,
          "Date": "2023-06-28T18:31:13.000Z",
          "Titre": "I am very happy with SMTP2GO service",
          "Contenu": "I am very happy with SMTP2GO service.  Setup was extremely easy and fast.  I like the dashboard and various reports that I can generate and most important the ability to see the activity on my account to assure that my emails are being delivered.  The one time I needed to contact technical support, not for an issued with the service, but because of something I did not quite understand, they were quite friendly and solved my issue fast.  Our company still uses some legacy software that will no longer work with Microsoft 365, so SMPT2GO was a great solution to our email needs.Try their free service and you will soon be a subscriber."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Makena",
          "Nb_Reviews": 2,
          "Date": "2022-07-09T08:26:34.000Z",
          "Titre": "Still one of the most reliable SMTP providers",
          "Contenu": "After so many years, SMTP2GO is still one of the most reliable SMTP providers who never fails to send email and provides good and responsive customer service. Whenever your account is having issue, e.g. suspected of sending spam, SMTP2GO allows you to investigate and respond with adequate time, unlike some bigger boys who bans your account almost immediately and some even request reactivation fee.Email sending speed may not be the best, but is good enough in most cases."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Billy Ferguson",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T18:46:19.000Z",
          "Titre": "Excellent customer Service!!!",
          "Contenu": "The level of support and professional help with Jenn was awesome! She took the time to walk me through setting up my new SMTP2GO account and how to implement the changes necessary to fix the issue that I was having on a WordPress website. 5-STARS!!! I 100% recommend this company and it's level of support! Thank you Jenn! You made this an easy process and resolved the issue I was having with emails not being received!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ernest Swords",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T10:56:05.000Z",
          "Titre": "SMTP2GO has been an absolute…",
          "Contenu": "SMTP2GO has been an absolute game-changer for us with their exceptional service and unwavering dependability. Prior to discovering SMTP2GO, our email inquiries sent through our WordPress website were plagued with bouncing issues and frustratingly low delivery rates. However, ever since we switched to SMTP2GO, our email problems have become a thing of the past. The level of reliability they provide is truly remarkable. Without hesitation, I wholeheartedly recommend SMTP2GO to anyone seeking a solution to their email woes. Put your trust in them and bid farewell to email troubles once and for all."
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "Michael Gasperl",
          "Nb_Reviews": 3,
          "Date": "2022-06-13T18:41:49.000Z",
          "Titre": "I'm using smtp2go since years now and…",
          "Contenu": "I'm using smtp2go since years now and am very happy with delivery, web surface, handling and support. I can only recommend it to anyone, who uses WordPress, has an own VPS or needs to improve delivery quality in general. The user and domain administration is easy and quick. In the end it just works as expected without any hassle."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PhilDom",
          "Nb_Reviews": 2,
          "Date": "2023-08-07T16:04:03.000Z",
          "Titre": "Excellent Support Responsiveness",
          "Contenu": "I reached out to SMTP2GO support today for help with a mail delivery failure I was getting. They answered back with information and a fix within 10 minutes. You absolutely can't get support like that anywhere else. Great job!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Metabolic Research Center",
          "Nb_Reviews": 1,
          "Date": "2022-05-24T22:12:12.000Z",
          "Titre": "We use SMTP2GO for our business emails",
          "Contenu": "We use SMTP2GO for our business emails. We rely on proper and uninterrupted delivery of these emails on a daily basis. All emails are delivered in a timely manner. The dashboard is easy to navigate and understand. Billing updates are a breeze. Everything is very simple and requires very little monitoring on our part. The convenience of being able to \"set it up and forget about it\" is very valuable to us in our busy organization."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim",
          "Nb_Reviews": 2,
          "Date": "2023-02-05T16:57:19.000Z",
          "Titre": "Been a customer for years, has never let me down!",
          "Contenu": "I have been an SMTP2Go customer for many years, both personally and professionally.  They have never let me down, and I just keep adding use cases.  The most recent was just a couple of weeks ago when onboarding another acquisition and setting up their copier/scanners using the IP based authentication option.  Easy to set up, easy to use, and just works!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Siarkas",
          "Nb_Reviews": 1,
          "Date": "2022-07-06T18:07:13.000Z",
          "Titre": "SMTP2GO is a time saver!",
          "Contenu": "Before SMTP2GO I used to use my personal email (Comcast) smtp server for my company scanners and accounting software emails.  Unfortunately my provider would flag my account every month when I sent out my invoices which would be over 100 emails as SPAM.  I then had to login and change my password every month!!!!  Now with SMTP2GO I have ZERO issues."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Warren",
          "Nb_Reviews": 3,
          "Date": "2022-09-26T21:13:09.000Z",
          "Titre": "Customer statement mailings",
          "Contenu": "We are using SMTP2GO for mailing hundreds of customer statements. The service is reliable and works smoothly with our code. The SMTP2GO portal is easy to use and allows us to view every note sent, who has opened the note, and if a reject, soft or hard bounce was detected. Also handy is the follow-on e-mail note with a list of hard bounce addresses, which we use to update our DNC table."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Mike Clay",
          "Nb_Reviews": 1,
          "Date": "2022-05-31T18:21:48.000Z",
          "Titre": "Couldn't be happier !!",
          "Contenu": "The SMTP2GO service has been flawless since we started using it.  No more problems with blacklists and server issues, it just works.  The front end dashboard tools are exactly what is needed, with great tracing, error reporting, and amazing analytics on the messaging goes out.  Account management is easy and everything is clear and simple to understand with options and packages, and the cost is great.SMTP2GO is great example of a product that just does what it should and does it well !! Couldn't be happier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay Singleton",
          "Nb_Reviews": 1,
          "Date": "2022-06-07T18:24:23.000Z",
          "Titre": "Simple and fairly priced!",
          "Contenu": "I was recommended SMTP2GO by an IT professional.  It has worked great for our needs.  We send out 100s of email daily to keep our internal team updated on project status.  It was easy to set up and verify. Our messages come from multiple email domains. SMTP2GO solved one of the biggest issues we were having, messages getting flagged as junk or spam especially anything hosted by Google.  It is simple and fairly priced.  Definitely recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Jonson",
          "Nb_Reviews": 2,
          "Date": "2022-11-29T19:37:36.000Z",
          "Titre": "SMTP to go has made it very easy for my…",
          "Contenu": "SMTP to go has made it very easy for my home automation system to send me messages every day.  Considering that every door opening triggers a message,  it can be thousands per month.  I was struggling on how to find a SMTP service that was affordable enough but had a high throughput and lots of allocation.  Truly a great experience all around!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kalen",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T18:04:35.000Z",
          "Titre": "Does what it is intended to do very…",
          "Contenu": "Does what it is intended to do very well. Eliminates the issues with attempting to use M365 accounts for scan to email, allows individual accounts per device as is best practice, price is right and support is super fast and responsive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Garret Cleversley",
          "Nb_Reviews": 1,
          "Date": "2022-12-28T19:11:13.000Z",
          "Titre": "Easy setup",
          "Contenu": "Easy setup, has simple easy to read reports, and the price is awesome. It helps us catch errors in our POS system with bounced mail reports and mistyped emaIls. The integration with our MSP software was simple. Instantly helped our email deliverability. Highly recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LDSi",
          "Nb_Reviews": 1,
          "Date": "2022-05-24T18:31:57.000Z",
          "Titre": "SMTP2GO great choice for email server",
          "Contenu": "We use SMTP2GO to send SMTP emails from our hosted web applications. We moved to SMTP2GO  from Amazon Simple Email Service (SES), which is free, but has a lot of limitations. SMTP2GO proved a very convenient, simple and full featured service. The team behind is responsive, and quick. They even developed a new feature on our request that allowed easier partitioning of services. I can recommend SMTP2GO to anyone who needs to send emails from an application and not worry about black lists, gray lists, and complex email server configurations"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "IT Fusion",
          "Nb_Reviews": 1,
          "Date": "2023-02-02T21:11:11.000Z",
          "Titre": "Solve your scanning, web and alerting emails issues!",
          "Contenu": "SMTP2GO has solved issues for us with scanning, web and system alerting. Google and Microsoft have made it increasingly difficult to use their systems for these purposes, especially from older equipment.  SMTP2GO has resolved these issues and we now have reliable scanning and system alerting emails."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert E",
          "Nb_Reviews": 2,
          "Date": "2022-07-19T01:20:45.000Z",
          "Titre": "Reliable, reasonable, and helpful",
          "Contenu": "Having a reliable hosted SMTP solution, and not having to monitor and maintain your own, is worth its weight in gold.  SMTP2GO offers the right level of service that our organization needs.  It’s easy to use and easy to manage, and support is prompt, knowledgeable, and friendly.  They were a great help getting us off the ground and running."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barry Borror",
          "Nb_Reviews": 1,
          "Date": "2023-03-17T15:41:12.000Z",
          "Titre": "SMTP2GO -Simple -Reliable -Customizable",
          "Contenu": "SMTP2GO has been a simple, reliable tool for our operations where have systems sending in status alerts to our support team. Because it is so configurable we rarely find a location where we cannot use it. Our customers like it because it doesn't require and special network changes to allow it work."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Diego",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T03:11:08.000Z",
          "Titre": "Great external SMTP service",
          "Contenu": "I've used a few famous SMTP providers over the last few years and this was one of the easiest and quickest to implement. The interface is intuitive and the deliverability has been good. Also, the support team has been attentive. We are very satisfied!"
        },
        {
          "Note": 5,
          "Lieu": "CO",
          "Pseudo": "Francisco",
          "Nb_Reviews": 2,
          "Date": "2022-10-27T18:41:57.000Z",
          "Titre": "I'm a small web hosting provider and I…",
          "Contenu": "I'm a small web hosting provider and I was Having a lot of issues with email deliveries to big corporations and the usual outlook.com, gmail.com, etc. but since I routed my server email via SMTO2GO every single message arrive its destination, not to mention that I have full control and the log in their web interface are very useful and detailed. In all the years of being a customer I only experience a couple of hiccups (mostly from my side due to customers sending too many emails  at the same time) at the support was fast and very responsive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan C",
          "Nb_Reviews": 2,
          "Date": "2022-07-12T22:00:24.000Z",
          "Titre": "A+ Service, Highly Recommended",
          "Contenu": "I’ve been using SMTP2GO as the emailing system for my forum for years now. I’ve used other email services in the past, but none have come close to SMTP2GO for reliability and transparency. The usage data has helped me draft more effective emails, increase open rates, and avoid being flagged as spam. Have only needed support a couple of times, but they’ve been great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan Lowe",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T20:16:07.000Z",
          "Titre": "One of the best support experiences I have had in a long time",
          "Contenu": "I had an issue and Jenn in support was amazing.  She responded within minutes to about 5 or more emails from me.  Gave me clear and direct directions and had a fabulous attitude.  Thanks again Jenn!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Hornby",
          "Nb_Reviews": 1,
          "Date": "2023-03-17T14:48:08.000Z",
          "Titre": "Best transactional SMTP service out there",
          "Contenu": "The pricing is great, and the service just works!- Fast, intuitive, clean web interface- Extremely high email delivery rates. If an email isn't successfully delivered, there is clear analysis in the web portal to be able to resolve the delivery issue- Fast email delivery- Reasonable pricing- Great support"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jimmy Rogers",
          "Nb_Reviews": 1,
          "Date": "2022-07-06T18:25:25.000Z",
          "Titre": "SMTP2GO is a lifesaver for us",
          "Contenu": "SMTP2GO is a lifesaver for us!  We rely on our scanner to email documents to numerous locations, and we were struggling with our existing provider and its reliability.  Our tech guy suggested SMTP2GO, and it was easy as could be.  We've got a reliable dashboard and more analytics than we could imagine!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JC",
          "Nb_Reviews": 1,
          "Date": "2022-08-23T16:40:47.000Z",
          "Titre": "SMTP2GO is the WAY2GO!",
          "Contenu": "We were using the STMP server of our hosting company and were having a lot of problems with their servers being blacklisted. So we started researching alternative SMTP services. The first company we checked out seemed promising, but surprisingly they still had a few servers that were blacklisted. We then came across SMTP2GO and found out that ALL their servers checked out clean, so we signed up. Since then we have been very happy with the reliability and the ability to view various important stats of our mailing in their portal. We are now on top of our emails and have the peace of mind knowing that our emails are being reliably delivered to our clients!"
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-07-19T04:10:27.000Z",
          "Titre": "Perfect solution for my need",
          "Contenu": "Been using their service about 5 years. Only need whitelist ip for my email serverGot several cases including spam attack and they help me to solve the problems even my spam exceded and exhausted monthly quota, but they raise my quota for the month so my server works againGood service whitelist ip, i don't need mass email marketing which i dont know they have of or not but ITS perfect for me"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill Bajcz",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T19:51:07.000Z",
          "Titre": "smtp2go works and delivers mail",
          "Contenu": "smtp2go works.  Mail gets delivered.  Reporting is helpful and support is great."
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "Andri",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T19:48:24.000Z",
          "Titre": "Easy to use",
          "Contenu": "SMTP2GO has been very easy to set up and use. Its interface is straight forward. It also provides great reports and insights. We are currently using it for various different usages, including transactional emails."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris E",
          "Nb_Reviews": 1,
          "Date": "2022-06-08T00:29:59.000Z",
          "Titre": "Pleasant Experience So Far",
          "Contenu": "We have been using SMTP2GO for about a year now and it has been a great experience so far. Interface is very clean and easy to navigate, dashboard and the backend responsiveness is amazing. Other services we had used in the past takes long time to load even for a simple stats page. We started off with the basic tier and then upgraded as we grew, and overall service has been exceeding our expectations. Having a dedicated WordPress plugin to avoid any complicated configurations is a bonus too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 2,
          "Date": "2023-03-31T15:27:48.000Z",
          "Titre": "A truly affordable service for those with email host SMTP restrictions",
          "Contenu": "I have a customer with two users that have mailing lists of between 500 and 1000 recipients. These two users  send to these lists several times per month and sometimes several times a day. Unfortunately they are on GoDaddy email which limits outgoing emails to 500 per day per account and this was causing a huge headache for me and my customer. So, I had to find a solution and came across SMTP2GO which was the perfect solution for my customer. Now entering our 5th year with SMTP2GO,  my customer can freely send their emails every day without worrying about a daily restriction and I have not had to listen to complaints. This is a WIN-WIN for all parties."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Craig Engbrecht",
          "Nb_Reviews": 1,
          "Date": "2022-06-15T15:36:40.000Z",
          "Titre": "A fantastic company for your SMTP needs!",
          "Contenu": "SMTP2GO has been the primary source for our SMTP hosting needs. They have been extremely responsive to support requests even when you are not a paid account.They are fast to respond, their support docs cover about 90% of questions, and they are very lenient on new accounts that have small amounts of mail flow. Their paid packages are almost too reasonable, and the suggested products and pricing is excellent.I would highly recommend them to anyone who want or needs an SMTP service for their printer, website, or any other needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Damon Gallaty",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T19:51:13.000Z",
          "Titre": "Best solution for solving RBL and spam issues!",
          "Contenu": "I was having a problem with spammers faking e-mails from my domain, which wound up putting my domain on multiple RBLs. I used SMTP2GO to establish SPF and DKIM records for outgoing e-mail from my domain, and now I have reliable outgoing e-mail that doesn't get accidentally blocked as spam. The service has been very easy to use and very affordable. The ability to monitor bounce rates is a really nice bonus."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sean Montgomery",
          "Nb_Reviews": 1,
          "Date": "2022-08-30T18:07:46.000Z",
          "Titre": "Perfect for Small Office Support",
          "Contenu": "I provide IT support for several small offices.  SMTP2Go is the perfect solution for an office that need a simple SMTP relay for various office devices. (Scanners, etc)  The fact I can create different accounts for different customers is perfect for my use case.  Love it, and have never had an issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-02-28T20:14:07.000Z",
          "Titre": "This has shown to be a great tool to assist in collections.",
          "Contenu": "This has shown to be a great tool to verify that our invoices are received correctly and identifies those email addresses that require our attention. This has resulted quicker payments and has saved immense amounts of time in follow up phone calls."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greg Razewski",
          "Nb_Reviews": 1,
          "Date": "2022-10-30T15:22:13.000Z",
          "Titre": "Smtp2go helped us when we were in a…",
          "Contenu": "Smtp2go helped us when we were in a tight spot with our previous provider.  They gave us a simple fix to roll out email scanning to our customers saving us from doing individual smtp accounts with each customers mail provider."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ardavan from Graphicwise.com",
          "Nb_Reviews": 1,
          "Date": "2022-09-07T18:48:58.000Z",
          "Titre": "Top Notch Service + Dependability",
          "Contenu": "Great service and dependability. Before we found SMTP2GO, our email inquiries through our WordPress website were bouncing all over the place, high delivery issues, etc. We haven't had an email issue since. I highly recommend SMTP2GO."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan Coleman",
          "Nb_Reviews": 2,
          "Date": "2023-03-30T18:26:28.000Z",
          "Titre": "The best relay service we've ever used",
          "Contenu": "We have used SMTP2O for the last six years and cannot express how happy we are with the service. The few times we have had to open a support ticket (less than five) they have responded accurately and concisely and in a very timely manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "W.D.",
          "Nb_Reviews": 1,
          "Date": "2022-11-08T22:31:43.000Z",
          "Titre": "Great service that is always up",
          "Contenu": "Great service that is almost always up and rarely down.    Customer support is great and responds quickly.  Any issues are resolved in a timely manner.  Price is reasonable when compared to similar services.  Really couldn't ask for better service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill Mayer",
          "Nb_Reviews": 2,
          "Date": "2022-11-07T02:41:59.000Z",
          "Titre": "Our highly recommended and reliable email provider",
          "Contenu": "SMTP2Go is our go to provider for emails being sent by our various copiers, alarms, cameras and other devices. It's very reliable with seldom an issue. A great way to bypass restrictions from other email clients. Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Blueshift Computer Technology",
          "Nb_Reviews": 1,
          "Date": "2022-09-13T19:39:55.000Z",
          "Titre": "Service is great",
          "Contenu": "Service is great - no issues with outages or services not working - reliable, cost efficient solution that works great for our business. We look forward to using the product for many years to come! Highly recommnded for anyone looking for a quality SMTP service provider."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andy Dodge",
          "Nb_Reviews": 1,
          "Date": "2022-05-31T18:30:42.000Z",
          "Titre": "We have been using SMTP to go for years…",
          "Contenu": "We have been using SMTP to go for years and have loved the simplicity and reliability it has provided.  It is very easy and fast to setup, gives us great insight into what is being sent and allows us to securely setup even older devices to send emails from multiple different locations.  I would highly recommend them if you need a reliable smtp server!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank Wagoner",
          "Nb_Reviews": 2,
          "Date": "2023-02-10T15:40:50.000Z",
          "Titre": "Solid and Reliable",
          "Contenu": "This is a vendor our company has used for over a decade, and we have never had any issues with our various systems sending out SMTP messages using their platform.  We've also noticed all of the improvements to their site over the years, and highly recommend this vendor."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rich Wawrzyniak",
          "Nb_Reviews": 2,
          "Date": "2022-06-27T17:25:34.000Z",
          "Titre": "SMTP2GO is a great business partner",
          "Contenu": "SMTP2GO is a great business partner.  Their service is very reliable, and we have never missed distributing email to any of our downstream clients or business partners.  Their Terch team is always around if help is needed but the service has run so smoothly that we haven't had any real issues.       Regards, Rich Wawrzyniak  CEOKITB.tech"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Andrews",
          "Nb_Reviews": 7,
          "Date": "2023-04-12T20:41:16.000Z",
          "Titre": "SMTP2GO /  Simple Setup / Has everything you need.",
          "Contenu": "SMTP to go is has been very valuable to me as a forwarding SMTP server for both my personal network notifications as well as a recommendation to my corporate clients that want an easy yet customizable tool to forward messages from Devices that may use legacy protocols without encryption or authentication. This product can provide SMTP forwarding to all the devices I have encountered including ones that would not work with Google and O365. Very very valuable item to have in your toolbox. It is also priced very reasonably. Multiple accounts can be setup under your service to provide separate analytics for each device as well. All around, this is the best SMTP service I have seen out there. I give it a definite thumbs up."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Randolph Nelson",
          "Nb_Reviews": 1,
          "Date": "2022-07-27T18:08:08.000Z",
          "Titre": "I have been using SMPT2GO for more than…",
          "Contenu": "I have been using SMPT2GO for more than a year now.  I started because other smtp servers I was using kept failing or not resolving names properly.  I have never had an issue with SMPT2GO, it works seamlessly and provide useful statistical output that I can use to analyze my email operation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Seng-Poh Lee",
          "Nb_Reviews": 2,
          "Date": "2022-12-28T20:39:40.000Z",
          "Titre": "SMTPGO is great for proxying your emails",
          "Contenu": "SMTPGO is great for proxying your emails when your ISP either blocks port 25 or if their IPs are all listed in the spam databases. Their interface is simple and works well and you really don't have to think about it after initial setup."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "pmikyoto",
          "Nb_Reviews": 1,
          "Date": "2022-06-13T18:12:23.000Z",
          "Titre": "we have been using SMTP2GO about 2…",
          "Contenu": "we have been using SMTP2GO about 2 years.. previously used SendGrid but SMTP2GO has better console and reporting tools.we had 1 weird mail delay issue for few hours in 2 years of use but. .when we contacted support it was very smoothly supported and eventually they fixed the issue very quick..  I am happy with this service."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Wayne",
          "Nb_Reviews": 2,
          "Date": "2023-04-12T18:32:42.000Z",
          "Titre": "SMTP2GO Has been a very valuable vendor…",
          "Contenu": "SMTP2GO Has been a very valuable vendor for us. Since Google has introduced additional security protocols we have moved all of our printer and fax capabilities to your service. Thank you for your amazing product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Osoborne",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T19:07:22.000Z",
          "Titre": "Excellent customer service!",
          "Contenu": "Excellent and friendly customer service. We use SMTP2Go in our Org and it's been a valued asset. I once reached out to ask a tough question and they went above and beyond to find the answer for us. Excellent company to do business with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian A.C.",
          "Nb_Reviews": 2,
          "Date": "2022-08-19T21:24:57.000Z",
          "Titre": "The best company so far",
          "Contenu": "I tried several similar email companies before settling on SMTP2GO. Over the last year, I've found that this one is easy to use, reliable, has excellent technical support, has lots of good features, and is very cost-effective. I had also previously used companies like Constant Contact and Mailchimp, but this gives you much more control, which I like."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greg W",
          "Nb_Reviews": 1,
          "Date": "2022-06-24T19:30:03.000Z",
          "Titre": "Best SMTP Relay Server Service I have used",
          "Contenu": "Therefore I wanted to have a solid worry-free, reliable solution for sending mail instead of configuring and maintain a smtp-server myself. The quality is very good for the prices. They also support almost every port that is used for SMTP to use with their SMTP Servers. Their support is also quick to get back to you and very efficient. I would recommend this SMTP Service to anyone looking for one, they are by far the best for the price."
        },
        {
          "Note": 5,
          "Lieu": "LB",
          "Pseudo": "Racha K.",
          "Nb_Reviews": 1,
          "Date": "2022-10-28T07:31:47.000Z",
          "Titre": "Excellent experience",
          "Contenu": "Excellent experience in sending emails to my clients without any delays nor problems. I've been using this service for more than 5 years without any problems.The support team is friendly and helpful. And i only reached out for couple of questions in the beginning.Thank you so much for such a flawless experience.Wish you all the best."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tera Communications",
          "Nb_Reviews": 1,
          "Date": "2022-10-27T18:48:02.000Z",
          "Titre": "I struggled with setting up SMTP relays…",
          "Contenu": "I struggled with setting up SMTP relays for voice mail to email with multiple PBX manufactures as well as scanners. SMTP saves me so much time and money because I have a tool to show IT departments that it's not an issue with the PBX or scanner, its a setting they need to change."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Philly MSP",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T20:15:33.000Z",
          "Titre": "Great mailing service at the low cost",
          "Contenu": "Great mailing service at the fair cost. We've been using it for clients and their software applications, and the multitenancy comes in handy. Automatic spam/bounce reports are helpful to keep those mailing lists current."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RxIT",
          "Nb_Reviews": 1,
          "Date": "2022-07-18T19:38:49.000Z",
          "Titre": "All our SMTP needs in one place",
          "Contenu": "We needed a service for our copiers and other legacy devices so they can securely send email.  We found it in SMTP2GO. They have all our SMTP needs in one place. No more complicated setups with O365 or wondering why your gmail account stopped working all of a sudden.  Easy to setup and is always available and never down! :)"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Empresa Virtual",
          "Nb_Reviews": 2,
          "Date": "2023-04-12T19:19:11.000Z",
          "Titre": "Great service and better support",
          "Contenu": "in our many years of SMTP service they have given my company I've always found a great service and above all great support for the couple of ocassions that someone has abused the service to do a spam. They always reported to me first that I have an issue and take a swift action to avoid being black listed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric P",
          "Nb_Reviews": 2,
          "Date": "2022-11-08T21:50:55.000Z",
          "Titre": "A+ Support and Great Value",
          "Contenu": "As with all tech services, there are a base set of expectations: WORK as advertised, and HELP if there are issues. SMTP2GO excels at both of these, PLUS they are proactive about improving their product. For a very competitive price, the set of tools and metrics provided are just right, and in the few instances where I ran into issues, their customer support team was on top of it (often times in just minutes), and stayed on top of it until the problem was solved. I can't recommend this company enough for those who are looking for a solid, reliable transactional email service."
        },
        {
          "Note": 5,
          "Lieu": "MA",
          "Pseudo": "Sayf",
          "Nb_Reviews": 1,
          "Date": "2022-06-13T19:47:24.000Z",
          "Titre": "Great service and support",
          "Contenu": "Great service and support. We were having issues before sending confirmation emails via our website using our webhost's PHP mailer. That's no longer an issue and we have 100% email delivery with smtp2go."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bobby Whitley",
          "Nb_Reviews": 4,
          "Date": "2022-08-09T18:10:28.000Z",
          "Titre": "SMTP2GO is my go-to SMTP Provider",
          "Contenu": "SMTP2GO is my go-to smtp for all of web based applications as it insures delivery and provides the ability to track the sent emails.  The features that separate it from the competition is the multiple domains that can can be configured with DKIM and the bonus is that they also have the best price.  I have recommended it to my customers.  The one feature I which they had was WordPress plugin that uses an API as some hosting companies will not let you use an external SMTP provider."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harley",
          "Nb_Reviews": 3,
          "Date": "2023-04-09T22:01:40.000Z",
          "Titre": "Excellent and affordable workaround for…",
          "Contenu": "Excellent and affordable workaround for when your ISP or network does not support SMTP natively. Been trying them out for a few days now and so far it works great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Zatkiewicz",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T20:08:37.000Z",
          "Titre": "Excellent Service",
          "Contenu": "I tested several SMTP relay service providers before deciding on SMTP2Go. I have sent approximately 500,000 emails a month for over a year using this service, and I highly recommend it. They get five stars from me for reliability, ease of use, service and support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Administrator",
          "Nb_Reviews": 1,
          "Date": "2022-09-12T16:58:34.000Z",
          "Titre": "promptly resolved issues",
          "Contenu": "We have a custom online app that used to be hosted by the app's server, and continuously had email delivery issues.  Since switching to SMTP2GO in April, we've had 2-3 issues, but they were resolved very promptly by SMTP2GO."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave Palmer",
          "Nb_Reviews": 1,
          "Date": "2022-05-24T19:41:19.000Z",
          "Titre": "Reliable service",
          "Contenu": "We partnered with SMTP2GO several years ago and haven't had a single issue with our scan functions since. We had previously struggled with a reliable SMTP platform.I highly recommend their product and services."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T21:09:29.000Z",
          "Titre": "SMTP2GO has simplified email",
          "Contenu": "SMTP2GO has simplified the sending of emails through on premise devices and servers. being able to use SPF, DKIM, and DMARC for these communications has been a blessing. i would highly recommend to anyone in need."
        },
        {
          "Note": 5,
          "Lieu": "GI",
          "Pseudo": "Piranha Designs",
          "Nb_Reviews": 2,
          "Date": "2022-11-30T17:45:25.000Z",
          "Titre": "Brilliant Service",
          "Contenu": "SMTP2GO has a brilliant service. We have been using their services for a number of years now, and we are very satisfied with them. They are very reliable and we have never had any issues or problems. We would highly recommend anyone to use SMTP2GO."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Geerling",
          "Nb_Reviews": 1,
          "Date": "2022-06-07T18:58:32.000Z",
          "Titre": "Solution for remote devices emailing alerts/logs",
          "Contenu": "I use the service to get emails from many remote devices that have built-in emailing systems for status and alarm. The optional use of ports and secure email settings allow me to evaluate each situation and come up with a comfortable choice. It was easy to sign up and get started, easy to implement on devices and easy to monitor the use to determine what level of service I needed to pay for."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phil H",
          "Nb_Reviews": 1,
          "Date": "2022-11-08T19:57:33.000Z",
          "Titre": "Excellent and Fast Service with Affordability and Flexibility",
          "Contenu": "From the easy setup, to the great support staff, SMTP2GO makes a perfect relay for anyone looking to use Mulitfunction Machines or relay for an e-mail server.  Always fast, and Reliable never been blocked or blacklisted.  Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "bruno david bispo silva",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T22:37:46.000Z",
          "Titre": "What is best provider communications",
          "Contenu": "Smtp2go is the stronger company.We can send emails, templates, SMS and the best.. we can create sub accounts separating each costumer.And also, have integration by api.By API we can bring all data about messages and send emails for there."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "dw",
          "Nb_Reviews": 1,
          "Date": "2022-11-08T19:22:08.000Z",
          "Titre": "Service has worked well for us",
          "Contenu": "Service has worked well for us, and prices seem very reasonable for the service. Very good uptime so far, and quick responses when we have had support issues. I would definitely recommend SMTP2GO as a service provider."
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "- José Carvalho",
          "Nb_Reviews": 2,
          "Date": "2022-12-14T10:44:10.000Z",
          "Titre": "Good service to manage SMTP without issues!",
          "Contenu": "The SMTP2GO service allow the correct management of e-mail sending without the issues os spam, it gives good report tools and allows you to understand all the activity and track bounce or e-mails not received. With this, you have total control of the e-mails sended by your services (websites, newsletters, services, ...)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shelly Peacock",
          "Nb_Reviews": 1,
          "Date": "2022-06-22T18:31:14.000Z",
          "Titre": "Highly recommend!",
          "Contenu": "I have used smtp2go for sending outgoing e-mails to my customers for years now and have been very please.  Very dependable and fast and responsive customer service. I would highly recommend them to anyone wanting to send lots of important e-mails."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Choice Auto IT MANAGER",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T23:05:19.000Z",
          "Titre": "I was dealing with unable to send for a…",
          "Contenu": "I was dealing with unable to send for a few months earlier this year loaded the Smtp2go and all my issues were resolved, absolutely the best fix for send to mail issues. Highly recommended for home and businesses that need this to resolve SMTP issues,"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AZ",
          "Nb_Reviews": 2,
          "Date": "2022-06-13T18:59:36.000Z",
          "Titre": "longtime user",
          "Contenu": "we have been using smtp 2 go for the past 6 years to send all of our marketing, correspondence etc. for our company.we are very happy with the support, integration, features etc.would really recommend."
        },
        {
          "Note": 5,
          "Lieu": "TH",
          "Pseudo": "Ajay Kumar",
          "Nb_Reviews": 2,
          "Date": "2022-12-29T08:01:41.000Z",
          "Titre": "I am using SMTP services for the past 7+ years",
          "Contenu": "I am using SMTP services for the past 7+ years and I am having different 3 accounts for us and our clients. I never have any issues, if sometimes we had issues, the support works great."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Kaj",
          "Nb_Reviews": 2,
          "Date": "2022-08-01T08:30:15.000Z",
          "Titre": "Excellent all rounder",
          "Contenu": "Things I like: very fast & responsive support (and technical department who helped promptly with some email MIME structuring issues), excellent deliverability to email hosts I've tried (so far), Australian datacentre (for Australian customers), easy to use API to link my PHP scripts with, good email tracking screenHave used Sendgrid and Sendinblue and while these are also good, I think SMTP2GO offers all the features these do, but is better - e.g. I found Sendgrid IPs sometimes turning up in blacklists, and Sendinblue does not do link rewriting to my own custom subdomains"
        }
      ]
    }
  ]
}