{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.motionvfx.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "AT",
          "Pseudo": "Jakob Lehner",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T16:08:59.000Z",
          "Titre": "Paying for plugins twice, that’s just ridiculous",
          "Contenu": "The only company who sells you their plugins for a one time fee and expects you to pay them for a second time via abo if you want to use their new plugins. Instead of just offering the new plugins via abo. Everyone who spent a lot of money there and trusted them is doomed."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Martin Mills",
          "Nb_Reviews": 3,
          "Date": "2023-10-29T05:22:44.000Z",
          "Titre": "They introduced a subscription model…",
          "Contenu": "They introduced a subscription model that is forcing people who already own most of the products in their subscription service (paid in full before the subscription was released) to pay a monthly fee to access new plugins. Why would i and many others like me want to pay a monthly fee to use software we already own just to access 2-3 plugins that we dont. Just a money grab from a company who were the best. I will now be looking to alternative suppliers for my video editing plugins since you wont sell me individual products anymore. Your new model sucks for those like me who have spent $1000's with you over the years."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Lewis",
          "Nb_Reviews": 11,
          "Date": "2023-11-14T17:45:40.000Z",
          "Titre": "You’ll own nothing and be happy!",
          "Contenu": "\"This subscription world that MotionVFX just launched is coming from the same place as You’ll own nothing and be happy!Rentals...Feudalism...Peasants we all...\" (Quote from an FCP FB group)As a very loyal customer of MVFX I'm deeply disappointed and very angry about their new business decision which is basically a gigantic meaty slap in the face to the customers but MVFX just call it like: \"The next logical step...\" So I personally own almost every single plugin they have released and spent 1000s of dollars over the years. I was so excited about their new upcoming products (mTracker Surface & mRotoAI) and I was going to buy them too without any hesitation until I found out it is available via subscription ONLY - not even an option to buy it. So basically they just bundled these 2 new products with their other older plugins which I personally own them all and now force me to pay 350$ per year just to get access to the new ones and some future expansions which will be also available via sub ONLY and call this bundle like \"it is just a new product release which you don't have buy\". Anyway, me and SO MANY others are still in shock about the way MVFX tried to hide all of this as it'll be a new plugin release until the very last moment while kept us customers so excited about it and the biggest offer they could come up with at the end was to give us extra 3 months for free to the subscription model that no-one wanted in the first place. Not to mention that with this move I got treated no different from someone buying from MVFX anything the first time today so tell me why should I keep supporting this company in the future? I feel so betrayed by MVFX and they made me hate myself for investing so much money for an uncertain future where I'll probably have to pay subscription to keep my current plugins I own to get updated - even if they now promise that it won't happen like that. I just don't understand why MVFX isn't happy to give one-time payment option as well to their loyal customers who already proved the fact THAT THEY WOULD/WILL SUPPORT MVFX IN THE FUTURE WITHOUT FORCING THEM WITH BS SUBSCRIPTION MODELS ONLY?\"Also they lied... They told everyone in the MO2 FB group, who had lost the ability to use the MO2 software (basically everyone) not to worry. They were working on something even better! It was MO3! And that it would be worth the wait! Never mind the fact that for many who had paid good money for their software, the only way they could continue to use the software was to in fact retrograde their operating system. A process that for many was just another series of obstacles that they, the consumer, would have to bear the responsibility for. They even told us in this group that those customers of MO2 would be able to acquire MO3 at a discounted price considering that our current software that we gave them money for, was non functional. Never, never, did they ever once tell anyone that MO3 would now be Paywalled behind a subscription service. These guys are fleece merchants. Now they tell you, that if you let them screw you out of even more money, that now this time, they will support their products. See before, they couldn't support them because you weren't giving them enough money. But now with this new business model, have no fear. They will now support and deliver. See how this works.\" (Quote from MO2 FB group) I’m just trying to wrap my head around the logic of \"We must go subscription to survive!\"- Okay, so can I give you some money AGAIN by continuing to purchase your product just like I've been doing over the years to support you even if you keep your subscription models as a choice?- No, you can not. I would rather lose you forever no matter how much support you gave us over the years...- Ok, well, good bye then!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael G",
          "Nb_Reviews": 1,
          "Date": "2023-06-11T18:34:47.000Z",
          "Titre": "This company is absolutely a SCAM",
          "Contenu": "This company is absolutely a SCAM; stay away from their products. I bought my plugin for the final cut, and two months ago, I switched to Davinci because of color grading. The biggest problem with these plugins is that they are made only for one platform. To be changed, you must pay again for 100% of the products from different editing programs. Which I feel is a total scam on people; in the editing world, people switch constantly.  Guys, stay away from them until they find a way to solve this problem because your investment in those plugins is for nothing. If you care for people, find a way to pay a small price for switching the same product on different platforms, especially in the editing world. Remember, Jeff Bezos became the most successful person in the world because he applied simple rules, and the customer was always right. I wasted 600 USD for you, and now I can't even use it on Davinci because you didn't even find a way to switch for a small price. Again, I DO NO NEED to PAY 100% for THE SAME PRODUCT; that's only if you are trying to scam customers, which you guys do."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "ML",
          "Nb_Reviews": 4,
          "Date": "2023-05-09T20:23:34.000Z",
          "Titre": "mInstaller is terrible. DaVinci Resolve add-ons are unstable.",
          "Contenu": "They have great videos showcasing their add-ons but once it's time to use the add-on yourself it's a coin toss if it actually works at all after purchasing. I'm strictly referring to MotionVFX products for DaVinci Resolve. They have good response times for product support. I know this because half the time I apply the add-on onto the timeline it doesn't work and I have to contact their support. They'll simply tell me I'm using an outdated version of the add-on. But....Before I contact support, I always visit the mInstaller desktop app to check if there is an updated version...the support staff will passively aggressively shift the error on the user for not using the most up to date version. Perhaps they get the same problems repeatedly and they don't care as much. It's great that MotionVFX supports DaVinci Resolve, but it's extremely buggy and doesn't work half the time and the install is usually missing fonts. I don't know if this happens to the FCP add-ons, but it's routinely inconsistent for DaVinci Resolve. Their quality control is terrible, their support staff respond timely but they'll shift any error onto the user.It's probably best to buy their products if it's been on the market for a really long while. Their newest products don't work well at launch if at all."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 1,
          "Date": "2022-12-08T16:37:03.000Z",
          "Titre": "Hit or Miss product poor customer support.",
          "Contenu": "Without a trial period to test MVFX plugins there is no way of knowing if your are throwing money away on one of their mediocre plugins. After spending upwards of $1000 on their products, I have found less than half to be worthy of their price tag and without adequate support when apps are problematic. Waited 2 years for older products to be updated to operate on Apples M1 silicon.  Some of their products are great. Good luck discovering which..."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "AmateurGardener",
          "Nb_Reviews": 12,
          "Date": "2023-03-27T10:20:11.000Z",
          "Titre": "Good products that run smoothly, no refunds...",
          "Contenu": "Good products that run smoothly. Very easy to use. My one gripe is that I bought a plugin for £80 that didn't have the flexibility I required, so was useless to me. Having spent close to a couple of hundred I figured they'd refund me as I'd not actually used it for anything, but they refused. So, sort of silly really as I'd have likely spent a lot more but will now be using only FxFactory that let you trial products. Can't afford to waste money on things that don't work as intended. So if you definitely know something will work for you, buy with confidence, but no refunds..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 1,
          "Date": "2021-07-30T13:05:55.000Z",
          "Titre": "Excellent customer support, but super glitchy plugin.",
          "Contenu": "Excellent customer support, but super glitchy plugin. Had some issues with mPuppet but Jason got back to me quickly with a personalized workaround. Very friendly and super helpful! Only trouble is, more glitches keep on coming, costing hours of extra work and lots of headaches. Once the bugs are fixed this would easily be a 5 star plugin."
        },
        {
          "Note": 4,
          "Lieu": "ID",
          "Pseudo": "Helmi Fauzi",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T10:01:42.000Z",
          "Titre": "I adore MotionVFX products because of…",
          "Contenu": "I adore MotionVFX products because of their originality and usability. Their customer service, however, is truly amazing. I emailed their support desk since I couldn't find the typeface I required. They returned with a brief instruction on how I could make what I wanted for free using Motion Naturally, this only fuels my desire to increase our financial relationship. good job!"
        },
        {
          "Note": 4,
          "Lieu": "SC",
          "Pseudo": "fastidiouslive.com",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T06:48:52.000Z",
          "Titre": "Satisfied customer",
          "Contenu": "I’ve been using motion vfx products for a while now and their products never disappoints. All plugins and effects including the free ones perform above expectations. Great customer support and they are quick to reply. Great job team 👌🏾"
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Asad rehman",
          "Nb_Reviews": 1,
          "Date": "2022-10-23T21:21:56.000Z",
          "Titre": "I wondered how many days/months/years I…",
          "Contenu": "I wondered how many days/months/years I needed to reach top-tier youtubers/filmmakers in editing. This brilliant site and its plugins makes everything look so professional and so easy, while you focus on making the footage needed! I'm so happy I stumbled upon this amazing website at the time I was making my short documentary! And it works perfectly with Arabic. Can't recommend it enough, and the support team are pretty friendly and smart"
        },
        {
          "Note": 4,
          "Lieu": "PK",
          "Pseudo": "Adab",
          "Nb_Reviews": 4,
          "Date": "2022-11-11T18:52:51.000Z",
          "Titre": "It's a good software recommend this"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christian Olmeda",
          "Nb_Reviews": 1,
          "Date": "2021-06-22T11:45:45.000Z",
          "Titre": "Reputable and Helpful.",
          "Contenu": "Motion VFX is a reputable makers of Quality plug-ins. during this switch to Apple silicon, its helpful how clear they are about which product have been optimized for M1. also if your having trouble with one of their products you can contact them and they are quick to respond."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "A beginner creator",
          "Nb_Reviews": 1,
          "Date": "2022-05-09T09:58:48.000Z",
          "Titre": "Very useful resources available and…",
          "Contenu": "Very useful resources available and their support team is helpful too. I just wish the products were a bit cheaer as I ended up buying many of them..."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2022-06-27T16:32:51.000Z",
          "Titre": "Problems to get into my account on my new computer.",
          "Contenu": "I was worried because I couldn't retrieve my purchases and I was getting lost. Very helpful people. Thanks very much."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Christoph",
          "Nb_Reviews": 1,
          "Date": "2022-02-23T16:24:04.000Z",
          "Titre": "Being a Davinci Resolve user I started…",
          "Contenu": "Being a Davinci Resolve I came across the Motion VFX plugins a while ago on YouTube and started to use them. Meanwhile I have six of them in use, some more regular (mIntro2) than the other (mMatrix). Anyhow, I like + the look and feel of the outcome 👍🏻+ the adoptability to my own needs 👍🏻+ all is very stylish 👍🏻+ ease of use in Davinci projects 👍🏻The quality and the style of the plugins definitely deserve a 5+ rating, truly excellent! The only two reasons I am deducting one star from my rating are - the hefty price tags (only works if you are patient enough to wait for discount codes) - which I somehow understand as they charge a premium price for a premium product 😢- the installer routine, you have to use their mInstaller plugin, which likely makes the installs very controllable for them but is a bit annoying on the user side 🤬 but this isn't a show stopper.All in all I am happy with Motion VFX and hope for sume stuff from their Final Cut family to be translated into Davinci Resolve."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "jcbrouwer-media Hendrik-Ido-Am",
          "Nb_Reviews": 1,
          "Date": "2021-05-11T11:37:13.000Z",
          "Titre": "Creativity, quality and service",
          "Contenu": "A company with creativity, quality and service. There is a quick response and thoughtfulness. Highly recommended.jcbrouwer-media"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T13:48:54.000Z",
          "Titre": "Top-Notch Service at motionVFX: A Hassle-Free Experience",
          "Contenu": "The customer service at motionVFX is consistently brilliant. Whenever I've run into a problem, they've sorted it out no bother, and that's a big reason why I stick with them. This was the second time I needed help swapping a plugin, and their team sorted it out for me without any fuss. Marcel was the latest to help, swapping one of my mystery plugins for another that I fancied more. I'd definitely recommend them. I've got loads of their products now."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Johnathan",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T14:58:02.000Z",
          "Titre": "This a support and service review",
          "Contenu": "This a support and service review. I had a pretty unique issue with FCPX not being able to locate the mTracker plugin(s). This is definitely not normal for Motion VFX software; it usually just works. Jakub was extremely helpful and stuck with me for over an hour while we walked through troubleshooting procedures, and eventually a permanent fix. Thanks again Jakub! You're a life saver."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "James Heming",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T15:15:31.000Z",
          "Titre": "Top end products and support",
          "Contenu": "These guys are super efficient when it comes to support.Oh and their products are pretty darn good as well!"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "info_",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T22:31:07.000Z",
          "Titre": "I had a very urgent matter wrote on…",
          "Contenu": "I had a very urgent matter wrote on Saturday, received answer until Monday. So i had to find another solution. On the bright side, Monday morning I got answer and a fast solution to my predicament"
        },
        {
          "Note": 5,
          "Lieu": "KR",
          "Pseudo": "naakss",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T16:08:09.000Z",
          "Titre": "I have used plugins from every company…",
          "Contenu": "I have used plugins from every company on the market.But the destination was motion vfx.Apple updates are no problem at all. All plugins always work properly. It's always been that way.Even though the price looks expensive, it is actually cheap. Absolutely buy it.Believe it. This is sincere advice from seniors."
        },
        {
          "Note": 5,
          "Lieu": "NO",
          "Pseudo": "Truls Lucas Melbye",
          "Nb_Reviews": 4,
          "Date": "2023-12-06T13:40:37.000Z",
          "Titre": "fantastic tool, but what if something goes wrong? no problem, fantastic support!",
          "Contenu": "Working professionally today means that you actually have to base your trust on a third-party company so that the final product is as good as possible. I purchased plugins from this site several years ago and it has worked flawlessly. today I got the error where nothing worked, and I logged in to the website and got an answer within 5 minutes on live chat, and it turned out that the error was simple user error and it was quickly sorted out. As for the software itself, it is easy to use, straight forward. Many plugins can be fine until they crash, and then you are completely dependent on good customer service to fix it immediately. highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Joshua Heinrich",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T15:17:59.000Z",
          "Titre": "MotionVFX product & support are exceptional",
          "Contenu": "MotionVFX offers both some exceptionally high quality products and the best support I have ever received. I've used their motion graphics for over a year now. First time I had a bug? I reported it, received a chat reply within minutes, they confirmed the bug on their end, solved the issue, sent me $10 of credit for bug reporting, and pushed an update. All of this occured within a few hours. Truly fantastic experience!"
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "waseemkakakhel",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T16:50:51.000Z",
          "Titre": "Zbigniew helped me",
          "Contenu": "Zbigniew helped me, over three hours, with patience and persistence, until he resolved my really weird issue of mLUT not working on my new M3 MacBook. He was always there when I came back from restarting my computer, which was so comforting. He was very knowledgable, what a great experience. Thank you Zbigniew"
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Ulf Areskoog",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T16:12:58.000Z",
          "Titre": "Excellent response time and problems solved.",
          "Contenu": "The response time for the support have been less then an hour for the two times I needed your assistance.Very professional support and problems solved."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "realisticfit",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T17:22:17.000Z",
          "Titre": "Exquisit Products & Customer service.",
          "Contenu": "I have been spotting MotionVFX for a while now, because they just have top Notch and exquisite plugins for your editing workflow, or just improving quality overall. At black friday, i made a mistake. I was helped by Marcel, and i have to say... on top of the good impression, his service was exquisit. I cant wait to sit down, with 2 new plugins from MotionVFX. Truly one of my best investments i could have made during BlackFriday."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "A. A. Siena",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T11:43:38.000Z",
          "Titre": "MotionVFX it's a leader company in video effects",
          "Contenu": "MotionVFX it's a leader company in video effects and the Website is well constructed and displayed. Prices and offers are clear and include license for two Macs, which is perfect for most users."
        },
        {
          "Note": 5,
          "Lieu": "CR",
          "Pseudo": "Johnny Sánchez",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T18:09:50.000Z",
          "Titre": "Excellent support",
          "Contenu": "First of all, excuse my english lol. I received an excellent support. They hyelp me with patiente. Resolved all my issues and bring me and extra detail that I don't wait it! :-)"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Ben Cotrulia",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T17:43:08.000Z",
          "Titre": "I'm starting to make tutorials and…",
          "Contenu": "I'm starting to make tutorials and desided to purchase the mTutorial pack. I'm very excited, this pack is great.  Motionvfx have brilliant products and costumer support is excellent"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Tori Grace",
          "Nb_Reviews": 2,
          "Date": "2023-11-21T16:38:13.000Z",
          "Titre": "They go above & beyond",
          "Contenu": "They go above & beyond. Seriously.I cannot fault the incredible quality this company offer in terms of plugins and assets. I'm a YouTuber and I can't live without their software having tried a competitors software before which stopped working. They also went above and beyond to help me with a query.. and ended up really blessing me with their generosity. Can't fault the software or the company behind it all."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T18:56:59.000Z",
          "Titre": "Very helpful in solving a problem with M-Tracker 3D Area",
          "Contenu": "I had a question about placing the points in M-Tracker 3D Area off screen that I was having trouble with, and Jakub Wojtkowiak was very effective in assisting me and demonstrated how to do it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Sciacchetano",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T14:43:20.000Z",
          "Titre": "Motion VFX is a game-changer on Apple Silicon!",
          "Contenu": "I've been using Motion VFX on M1 Ultra - MacStudio & M1 MAX - MBP, It's been a game-changer, especially for on-the-fly masking and color grading. The tool integrates flawlessly, and the speed at which I can execute complex tasks is incredible. Whether it's refining a scene's look or creating intricate masks, Motion VFX makes these tasks feel effortless. It's enhanced not just the quality of my work but also my enjoyment in the creative process. For anyone in video editing, this is a tool that genuinely lives up to the hype!"
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "simonejumper",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T12:49:03.000Z",
          "Titre": "the service was amazing I got an…",
          "Contenu": "the service was amazing I got an immediate response and solve the problem"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Vincenzo Gabriele (Gabrylux)",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T14:07:08.000Z",
          "Titre": "I have purchased several plugins for…",
          "Contenu": "I have purchased several plugins for Final Cut Pro and I am really satisfied, both for the quality and the ease of installation! Furthermore the assistance is really fast and helpful!  Thanks again.  Vincenzo"
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Mateusz",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T16:43:26.000Z",
          "Titre": "Fast support with new ideas",
          "Contenu": "I got an idea, about changing one of the options with mProduct template for Resolve, I was thinking, that I could be some great addition, so I have contacted the motionVFX support. The next day they have come back with a solution, updated the template and it worked like a charm! Tell me, is there any company, that would did it that way? 😄"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "gloriousfilming",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T16:04:36.000Z",
          "Titre": "The Best DaVinci Resolve Plug-ins and Templates",
          "Contenu": "If you work in DaVinci Resolve, forget about any 3rd party website or subscription model. MotionVFX is just another level and the only place that you need to know about to raise your videos and films to the next level!"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "NL",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T14:03:00.000Z",
          "Titre": "mVFX has good products that helped me…",
          "Contenu": "mVFX has good products that helped me to make my contents better looking contents. Also the service is great, specially when giving the discounts afterwards."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jordan",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T23:15:55.000Z",
          "Titre": "Customer service responded quickly and…",
          "Contenu": "Customer service responded quickly and solved the problem right away!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave Bear",
          "Nb_Reviews": 2,
          "Date": "2023-10-23T13:45:02.000Z",
          "Titre": "Teaching an old dog new tricks!",
          "Contenu": "“As an old dog (age 66) learning new tricks”, MotionVFX is an important tool in my editing toolbox.  MotionVFX allows me to tap into my ultimate creativity. All the MotionVFX tools are in now powerful.  Keep up the great work guys!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nick",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T15:14:30.000Z",
          "Titre": "Quality Products & Great Customer Service",
          "Contenu": "I’m a new customer of two months with MotionVFX after searching for plug-ins to enhance my projects (I’m a hobbyist).  In the two months of using MotionVFX plug-ins, I’ve had several questions and reached out to MotionVFX and their team went out of their way to help me out. Thank you, MotionVFX."
        },
        {
          "Note": 5,
          "Lieu": "SA",
          "Pseudo": "Mohammed Elnaiem",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T19:26:38.000Z",
          "Titre": "They were super helpful and prompt in…",
          "Contenu": "They were super helpful and prompt in addressing an issue I had."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "mark_",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T14:26:37.000Z",
          "Titre": "Great support",
          "Contenu": "Great support, awesome product!I had some issues to get the product running on my older machine, but thanks to support that was quickly resolved."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "aaron_",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T16:36:12.000Z",
          "Titre": "Amazing products and customer service!",
          "Contenu": "First and foremost, MotionVFX has amazing customer service, and they take care of their customers.MotionVFX not only has great customer service, but they make easy-to-use FCP plugins that are not cheesy but truly help you make solid edits to impress. Some of my favorite plugins are the mTracker and their new cinestudio subscription."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T14:34:35.000Z",
          "Titre": "I had a change I wanted MotionVFX to…",
          "Contenu": "I had a change I wanted MotionVFX to make on an already existing template and asked the team if they could make it. Within 3 days the change was made. Really appreciate them! I just purchased 5 more templates from them because they made this change for me."
        },
        {
          "Note": 5,
          "Lieu": "HU",
          "Pseudo": "Coprus Astra",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T20:02:16.000Z",
          "Titre": "Unmatched Quality",
          "Contenu": "In today’s digital age, it’s not just about editing videos but about crafting a visual experience. MotionVFX has been a game-changer in this domain for me. Their suite of products has not only streamlined my daily video editing tasks but has also empowered me to elevate the quality of my work to a level I had only dreamed of. The ease of use combined with the sophistication of their tools means I can produce top-tier quality videos without the usual hassles. Their modern approach to design and functionality ensures that I’m always ahead of the curve, and the results speak for themselves. Truly, MotionVFX is an indispensable asset for any serious video editor looking to make a mark in the industry. Their commitment to excellence shines through in every product, and I couldn’t be more grateful for how they’ve transformed my workflow and final outputs. Highly recommended! Keep up the good work guys! Thanks from Hungary!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "ross",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T12:35:37.000Z",
          "Titre": "Fantastic products which get updated…",
          "Contenu": "Fantastic products which get updated regularly. If there is ever any issues or questions, simply drop the guys a message and they respond instantly and always go above and beyond to help solve any queries/issues you may have 10/10"
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "J D Freedman",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T11:27:03.000Z",
          "Titre": "EXCELLEMT SUPPORT",
          "Contenu": "It is great to have a good product (plug in app) but waht is more important is having responsive customer support that helps you to use what you have bought.  That is where I really have to commend MotionFX because I had a problem that couldn't be fixed and kept me from installing the FX I bought.  They had a number of people respond and came up with a timely solution that worked great.  So that kind of support is REALLY appreciated"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "illusionary Forces",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T14:16:32.000Z",
          "Titre": "Fantastic company and products",
          "Contenu": "I really am impressed with mvfx.  The plug-ins for FCP are top notch and their customer service and tech support are exceptional.   Any issue I've had has been responded to within 24 hrs if not sooner.  They go out of their way to help, a nice perk for an independent editor.  For the quality and usability of their products the prices are reasonable (especially when they have a sale or buying multiples).  I can't recommend mvfx enough."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Kuehne",
          "Nb_Reviews": 3,
          "Date": "2023-10-30T17:27:46.000Z",
          "Titre": "Rock Solid Product & Awesome Support Team",
          "Contenu": "Rock solid products and an amazing support team.  Recently moved from Final Cut to Resolve and haven't missed a beat thanks to MotionVFX."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Lívia Freire",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T14:32:14.000Z",
          "Titre": "MotionVFX is the best",
          "Contenu": "very attentive staff! MotionVFX is the best for FinalCut that I know so far. Worth the investment. I was impressed with mFilmLook and recommend it."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "carlomones",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T23:07:41.000Z",
          "Titre": "MotionVFX & Jakub were so kind",
          "Contenu": "MotionVFX and Jakub were so kind to give me a discount when I couldn't afford mTransition Paper. Jakub's initial reply was very helpful, quick, and straight to the point, without any unnecessary back-and-forth. Just fast and easy! Thank you so much MotionVFX and Jakub! I'm so happy to my first MotionVFX purchased!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "gtwovids",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T09:33:51.000Z",
          "Titre": "I had an issue affecting my plugins",
          "Contenu": "I had an issue affecting my plugins on Final Cut Pro at 1am, all plugins had the red error message and I couldn't get them to work. I contacted customer service through the chat feature and I was assisted within minutes. !0 minutes later I had my issue corrected and I was good to go. Not only are their products top notch, but their customer service is amazing as well!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GravityMediaPro",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T02:32:55.000Z",
          "Titre": "An Absolute Game Changing Suite of Products",
          "Contenu": "There have been 3 revolutionary things I’ve experienced in my video career.  The first being the transition from analog tape to DV (read: I’m old.) The second being the standards conversion from SD to HD.  The most recent, my discovery of MotionVFX.The look I can obtain now in my videos by myself rivals what I could do 5 years ago with a dedicated graphic designer.  MotionVFX is the polish that turns your videos from “good” to “great.”The old adage is true of, “you get what you pay for.”  The initial investment might seem higher vs After Effects templates, but there’s no comparison in the ease of use and the quality you can achieve.Plus, they don’t use a subscription model: so you own what you pay for.Lastly, the management of your plugins, templates and timelines is in a dedicated Mac OS app, and has been flawless, even when Apple temporarily breaks FCPX in an update, their plugins work.They seem like a wonderful company to support.  I will continue to do so, and would advise you to do the same."
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Peter Gerard Alvarez Harper",
          "Nb_Reviews": 2,
          "Date": "2023-10-09T09:57:24.000Z",
          "Titre": "My account problem was sorted in a…",
          "Contenu": "My account problem was sorted in a matter of 52 seconds. I have had the account problem for three years (which was my own fault). MotionVFX help chat Jakub sorted the merger of my accounts with ease and urgency. Super impressed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Juice",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T09:27:32.000Z",
          "Titre": "Always great to work with but I had an…",
          "Contenu": "Always great to work with but I had an issue that they handled with no problem at all That's why I'm a repeat customer"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "David Dickinson",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T14:37:27.000Z",
          "Titre": "Amazing service",
          "Contenu": "I've bought loads of plugins from MotionVFX and the quality is top notch. One of those plugins had a directional effect that only worked in one direction, but I needed it to go the other way. I asked their support team how I could reverse it and they said it wasn't possible for that particular effect, but that they'd get their team to look at it. Their team patched the effect so it worked in both directions in under 24 hours. Absolutely stellar customer service. Couldn't be happier."
        },
        {
          "Note": 5,
          "Lieu": "FI",
          "Pseudo": "Shaun",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T11:35:58.000Z",
          "Titre": "The best templates and plug-ins",
          "Contenu": "You get what you pay for in life! And you certainly get your moneys worth from motion VFX. Totally brilliant company with world leading plug-ins and templates. Always our first choice because in simple terms the templates and plugins just work. Customer service is excellent too and nothing is too much trouble even if one asks for a slight customisation."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Distant Sun Studios",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T14:45:34.000Z",
          "Titre": "Fantastic High Quality Effects and outstanding customer support.",
          "Contenu": "Fantastic effects - will take my projects to a whole new level. I also used the chat feature on their website with a couple of questions - and not only was the response very quick (within 5 mins), it was extremely helpful and very well informed about their products. I can't recommend MotionVFX highly enough! Outstanding."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Marian Redmann",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T23:31:18.000Z",
          "Titre": "Awesome",
          "Contenu": "Awesome, best customer service I can Imagine. Fast and helpful, even personalised solutions as part of service. Thank you very much! Highly recommended (FCPX plugins)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "scott_",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T01:10:25.000Z",
          "Titre": "Best Presets and Best Support Team",
          "Contenu": "They not only have some of the best presets out there but their support and dev team are top notch. I've reached out numerous times for help with a preset or reporting a bug and they've always quickly responded and either fixed the bug or instructed me on how to solve my problem. It feels good purchasing products from a company who really listens to their customers."
        },
        {
          "Note": 5,
          "Lieu": "FI",
          "Pseudo": "David Popa",
          "Nb_Reviews": 2,
          "Date": "2023-07-18T09:21:49.000Z",
          "Titre": "Incredible products and service at…",
          "Contenu": "Incredible products and service at Motion VFX. Had some trouble with missing fonts and within a few minutes we were able to solve the issue with the amazing help team. Its truly incredible that on a basic M1 MacBook Air using FCPX editing complex timelines (10 bit 4k footage) and throwing all these incredible plugins that it still works so smoothly. I do use proxy files to get the speed working seamlessly but still- its game changing to work so quickly with these plugins. A big fan of mDocumentary and mDiary plugins as you can add just a touch of a flare, lens blur and beautiful titles to add an enormous amount of value to your footage. I will say however that FCPX (with my setup) is indeed faster than Davinci resolve, as I tried both and opted for FCPX. Motion VFX ROCKS!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sean B.",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T16:07:12.000Z",
          "Titre": "Jakub helped me through a problem that…",
          "Contenu": "Jakub helped me through a problem that was NOT MotionVFX's but solely my misunderstanding.  He then proceeded to go above and beyond by making and sharing a video of him walking through the steps I would need to do what I wanted.  AND then he gave me an genius editing tip to avoid a problem I would've encountered later."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Martin Klöckner",
          "Nb_Reviews": 2,
          "Date": "2023-05-04T13:52:51.000Z",
          "Titre": "The right place for Video Creators and Editors",
          "Contenu": "Beside the awesome products (which you can buy for a real fair price, but they have some free goodies too), you get perfect customer support from real nice people. Yes, right, this is not a call center or simple shop, at motionvfx are real video experts who love to help.Recommendation!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Chico",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T01:52:43.000Z",
          "Titre": "Great Products and exceptional customer service",
          "Contenu": "I have purchased quite a few FCPX plugins from Motionvfx because their products are easy to use and they provide detailed step by step tutorials via their website. I was initially hesitant to make a purchase because their prices were higher than others. However, as the saying goes, you get what you pay for. Their plugins are exceptional and very polished. In addition, the company has weekly sales and/or deals, which make the plugins easier on the wallet."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Stuart",
          "Nb_Reviews": 8,
          "Date": "2023-11-01T15:38:40.000Z",
          "Titre": "Absolutely brilliant customer service",
          "Contenu": "Absolutely brilliant customer service, I totally don’t know what I’m doing but they guided me through the problem and solved it and you could tell they actually wanted to help awesome 👏🏻"
        },
        {
          "Note": 5,
          "Lieu": "CZ",
          "Pseudo": "DEJFOTOcz",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T13:24:40.000Z",
          "Titre": "mVfx plugins for final cut pro are AWESOME!",
          "Contenu": "I’m final cut pro editor and wanted to try something that will speed up my edits,  will be easy to use and will look professional at the same time. I’m happy that i’ve found Motion VFX plugins! Everything is so intuitive, pro looking and i have no words to complain about. Even the support is awesome and i have never experienced support like this! Big thumbs up."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jon Siddall",
          "Nb_Reviews": 4,
          "Date": "2023-02-17T19:08:23.000Z",
          "Titre": "Awesome VFX software for Davinci…",
          "Contenu": "Awesome VFX software for Davinci Resolve and FCPXI use their products for client videos, my own YouTube channelAlways releasing modern title packs that are very user-friendly and stunning designs.Tons of choice for all VFX needsFantastic plugins"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff Bellune",
          "Nb_Reviews": 2,
          "Date": "2023-06-07T22:17:50.000Z",
          "Titre": "The Team at MotionVFX is Great!",
          "Contenu": "They produce really good products, and although they tend to be on the pricey side, the time that their plugins and templates save me provides real value.After-sales support and tech support are outstanding. They have been patient with my dumb questions and willing to assist me with details both large and small.Marcel in particular put in extra time and effort to come up with a creative solution to a specialized task I wanted to complete in mO2. My task originated in a competitor's product, and he gave me a solution that was unorthodox, yet effective and efficient. Five very large stars for MVFX!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "roaming_toni",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T18:50:28.000Z",
          "Titre": "Packs are super slick and they also…",
          "Contenu": "Packs are super slick and they also offer support chat that usually answers within a few minutes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bear",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T15:32:26.000Z",
          "Titre": "Great service, quick response.  Thanks",
          "Contenu": "While it's extremely frustrating to get a product that doesn't work correctly on your system at first, having a tech team that's knowledgeable and quick to respond to get you up and running is such a relief!  These guys make great products and back them up 100%."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Nick",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T12:25:50.000Z",
          "Titre": "I have been purchasing MotionVFX…",
          "Contenu": "I have been purchasing MotionVFX templates for FCP for many years and they just get better and better! Creative, flexible and above all, reliable. When I did have a minor glitch with a transition, the issue was fixed by the support team in just a few hours. Good value for money too which keeps the client happy!"
        },
        {
          "Note": 5,
          "Lieu": "TH",
          "Pseudo": "Aekraj T",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T13:59:15.000Z",
          "Titre": "Totally satisfied with Motionvfx support",
          "Contenu": "I've experience a difficulties using \"mtracker3d Neon Pack DropZone01\" because it has no logo x rotation parameter. Once I let the support team know, the technical support guy Marcel, he repose very quickly and help me solved the issue in no time. Also note that,  I did't explain the problem so well in the first time due to my English which is not my native language, but Marcel did try to understand and help me through. I'm really impressed and have a very good experience about the support team of Motionvfx. Keep up the good work"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "sciclunam",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T22:42:07.000Z",
          "Titre": "A bit of a hicup",
          "Contenu": "Usually the packs works without any problems.  Last pack that was purchased had a minor issue.  Reached out to MotionVFX.  They responded quickly and corrected the problem to my satisfaction.  They showed commitment to their product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "skypilotdroneimages",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T00:50:31.000Z",
          "Titre": "Highest praise!!!",
          "Contenu": "I’m a new user to Davinci Resolve and happened across MotionVFX and am I glad I did.   Their products are worth their weight in gold in terms of quality and time savings.    Their customer service shines as well.  Emailed a question and got an answer back within hours!    They are my go to effects software folks!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Murd Media",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T14:18:25.000Z",
          "Titre": "Even when I made a mistake on…",
          "Contenu": "Even when I made a mistake on purchasing the wrong product, Marcel and Gabriel were more than willing to work with me on getting an exchange done. I'm grateful to them and MotionVFX for working with me."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Fred",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T06:28:55.000Z",
          "Titre": "Marcel from MotionVFX was super helpful…",
          "Contenu": "Marcel from MotionVFX was super helpful and nice of him to help me out. After recently joining YouTube I was after a specific pack and he kindly helped me with it. He was super helpful and thanks to him and his team. This will help my editing time be more efficient and my make videos more creative . Thank you to the team at motionVFX you guys are awesome."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "DG",
          "Nb_Reviews": 2,
          "Date": "2023-03-17T14:02:45.000Z",
          "Titre": "Excellence in Motion",
          "Contenu": "I have been a huge fan of MotionVFX for quite a while, mainly because I find the quality of their products is literally off the scale. They not only make products that are extremely high quality but they also make them amazingly simple to use meaning I get visually impressive results very quickly ... every single time. To be honest, I don't know how they make their plugins and templates at such good prices too. Keep 'em coming MotionVFX!"
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "Cedric",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T12:29:22.000Z",
          "Titre": "MotionVFX Sets The Standard!!!",
          "Contenu": "Ever since I discovered MotionVFX some years ago, I've been using various templates for FCPX and Motion. In my opinion, the quality of the products is second to none. A great product and an extremely helpful customer service staff. Not that I've ever had an issue, but at times, I just needed more information about the product. But, customer service help was very fast and very courteous.  Also, the mInstaller application is a must-have!! They have a lifelong customer with me!!!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "RichardS",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T14:39:40.000Z",
          "Titre": "Essential!",
          "Contenu": "Fantastic, imaginative, robust software that is essential in the creative process, adding that extra element to your productions. I've used a variety of MotionVFX products over many years and seen the range develop and expand. Also, friendly, responsive help from the support team. Long may it continue. Many thanks!"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Alessandro",
          "Nb_Reviews": 2,
          "Date": "2023-08-03T12:35:24.000Z",
          "Titre": "Effective customer support.",
          "Contenu": "Hi to all, I would like to share my latest positive experience.With the latest updates of FCPX and Motion (both Intel and Silicon), developers have been busy updating their plugins. A few days ago, one of the Motionfvx plugins I use the most (Mpuppet), was updated. Once the update was done, I immediately did some testing and wow! Faster, more stable, in short definitely improved (both Intel and Silicon). Unfortunately in my case I had problems opening some projects built with the previous versions of the app/plugin. After a few failed tests I contacted customer support to explain the problem. And... within a few days BOOM! Resolved! I would like to point out that it is not to be taken for granted that a singular problem is quickly addressed and successfully resolved within a short period of time, which thanks to the Motionvfx developers, it was. Thanks again to the whole Motionvfx team, I am a satisfied customer :)"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Lonely Rocker",
          "Nb_Reviews": 1,
          "Date": "2023-04-18T17:11:14.000Z",
          "Titre": "Enjoying the products",
          "Contenu": "Enjoying the products.  They are well designed and very useful in my Youtube Episodes.  Keeps things moving and exciting.  Plus customer service has been very friendly and helpful and that always makes the difference in building trust with companies you buy from."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Uli Plank",
          "Nb_Reviews": 2,
          "Date": "2023-03-28T11:29:01.000Z",
          "Titre": "MotionVFX on the iPad, great support",
          "Contenu": "Since MotionVFX are the first third-party to support DaVinci Resolve on the iPad, I thought I'd give them a try. Installation didn't work right out of the box (while it did on the MacBook). Support helped me quite fast and now it's working perfectly fine."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ben",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T10:45:14.000Z",
          "Titre": "The guys replied really promptly",
          "Contenu": "The guys replied really promptly, which is great because their plugins are for professional work. So quick replies make all the difference."
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T13:43:12.000Z",
          "Titre": "The Crew of the Motion VFX Company is…awesome!!!",
          "Contenu": "The Crew of the Motion VFX Company is the competence in person!!!Love Your products and your support!!!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mark Thomas",
          "Nb_Reviews": 2,
          "Date": "2023-10-02T16:56:50.000Z",
          "Titre": "Excellent MotionVFX Customer Service!",
          "Contenu": "Had just bought mTuber 2 and experienced problems trying to access it.  MotionVFX were on the case instantly, and responded immediately to any follow up emails.  Pleased to report they fixed the problem! Impressive customer service."
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Jędrzej Paulus",
          "Nb_Reviews": 4,
          "Date": "2023-07-18T13:35:09.000Z",
          "Titre": "Marcel for 5 stars. MPodcast is great.",
          "Contenu": "Had a problem with mPodcast - a plugin for Da Vinci. Marcel identified the problem in a minute, shared his recommendation, described what to do and in the next 5 minutes my problem was resolved. Now i use mPodcast to add more effects to the video. I like it."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Grim Ghoul",
          "Nb_Reviews": 16,
          "Date": "2023-04-12T02:34:29.000Z",
          "Titre": "MotionVFX is the best!",
          "Contenu": "MotionVFX has the best assets I have found anywhere.  The quality is unmatched and for anyone like me, you can get Davinci Resolve for free and then you can spend $300 like me on MotionVFX and have some of the best (Transitions) ever!mTransition Zoom DVRmTransition Fade DVRmTransition Noise DVRmChannel Modern DVR(mScrawl Freebie March)I love them, I did spend the rest of my birthday money thinking I might get March and April stacked unlocked towards Grand Prize, but I messed up, I try to explain my Autism because I take things to extreme when I make mistakes when I got upset, I hope I did not annoy them.Thank you MotionVFX for creating the best quality I ever seen!Anyone reading this using Davinci Resolve.You can get these for free right now.mCamRigmTransition LumamHelloDVmMatrix"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "crfig",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T15:17:34.000Z",
          "Titre": "I had the most difficulty downloading .drfx files to DVR",
          "Contenu": "I had the most difficulty downloading video plugins for DVR studio. MVFX support (specifically Marcel) has been so patient, kind, and directive to provide guidance and solutions to the problem. Mind you, this was over the course of 10 days. The specific problem was that my DaVinci Resolve Studio version could not recognize the .drfx file. Through various attempts to troubleshoot multiple things, Marcel helped me ensure I had the correct download folder route, cleared cache files, and successsfully re-installed the plug-ins. It helped to do a shared viewer through TeamViewer. He was able to go to work and find the solution within minutes. We probably should've done that from the start and regardless, my plug-ins are working smoothly. The MVFX team has a great support team!Regarding the assets that I purchased mAntique, mMovieTransition, and mMeasurements are very unique assets that video editors ought to have in their toolbox. They really do speed up the workflow. Thank you MVFX team! You guys create some really cool things."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T03:39:02.000Z",
          "Titre": "Support staff are wizards!",
          "Contenu": "Support staff was able to troubleshoot and figure out, with very little information from my end, what turned out to be a very technical permissions issue on my computer that was preventing their software from importing the file I needed to use. I'm amazed they were able to pinpoint and solve it so effectively and so quickly. Kudos!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 5,
          "Date": "2023-04-19T13:32:08.000Z",
          "Titre": "Products and Support Review",
          "Contenu": "I'm new to video editing and the products ive bought have been excellent, crucially, the sales pitch they use accurately reflects the product you get and the ease of use. Also, the support system for follow up questions is fast and very helpful."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Emmanuel Avargués",
          "Nb_Reviews": 2,
          "Date": "2023-07-21T19:34:10.000Z",
          "Titre": "Very responsive support staff (Marcel)",
          "Contenu": "Very responsive support staff (Marcel), has helped us recover an old video render that used an outdated MotionVFX plugin. Best plugins on the market, and best staff! Recommend 100%"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Katie",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T12:50:34.000Z",
          "Titre": "Brilliant products and brilliant…",
          "Contenu": "Brilliant products and brilliant customer service. Motion vfx plugins are the best on the market - work seamlessly and look fab. I've had only one reason to contact customer service - talked to Jakub and he helped instantly and resolved the problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "WindowThree",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T17:00:27.000Z",
          "Titre": "Support team at MotionVFX",
          "Contenu": "Support team at MotionVFX is the best! Very clear and responsive 😊👍🏻"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Simon",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T20:04:19.000Z",
          "Titre": "Prompt help within minutes, and constant communication until resolved",
          "Contenu": "I had an issue with the title tracking plugin, where it was not tracking the footage. I reached out to MotionVFX through their app, and they got back to me very quickly (within 10 minutes). They then proceeded to assist me in real time (chat), suggesting different things that might help fix the problem. In the end, they helped me solve the problem on the spot. No back and forth. Real human assistance. Very refreshing. Thanks guys!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "amine benhamad",
          "Nb_Reviews": 2,
          "Date": "2023-10-25T19:03:47.000Z",
          "Titre": "Thank you to Jakub for helping me with…",
          "Contenu": "Thank you to Jakub for helping me with my issue. I accidentally purchased plugins with the wrong email, and his assistance was greatly appreciated."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "phil",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T22:38:42.000Z",
          "Titre": "great support",
          "Contenu": "Just great. Fast reply, understood the problem, had an idea , what could be the problem ( even though it was not their own software ) and an overall nice conversation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Austin",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T11:19:02.000Z",
          "Titre": "Always What I Need",
          "Contenu": "I always love the products they put out and how you get a lot for what you pay for without being overloaded with too much where I never end up using it. Customer service has always been super responsive whenever I needed it."
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "alex_bukovac",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T13:43:09.000Z",
          "Titre": "Excellent products + 5 Star Customer Service",
          "Contenu": "The products are high-quality and the customer service is ON POINT - 5 STARS. Combine the 2 and you couldn't ask for better. If you are looking for high fidelity product and kind people that will assist you in what you need - MotionVFX"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yael",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T16:57:06.000Z",
          "Titre": "Amazing service",
          "Contenu": "These guys are the best. The products are great, smooth and the ability to change presets to almost everything is awesome. But to top that the customer service is exceptional. Every single time they go the extra mile to help. Worth the $ investment."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T15:35:15.000Z",
          "Titre": "Best-in-class editing tools. No competition.",
          "Contenu": "Flawless products, visually and technically. MotionVFX cover the standard range of titles, transtions, presets for colour grading, etc. that you'll find elsewhere, with the exception of their 3D packs (which I haven't tried yet but they look fantastic).Stylistically, though, they're a cut above other providers. They're consistently, noticeably cleaner and sharper than their competitors, and also much more reliable. If it breaks, they can fix it, and if something isn't going to work (a modular template with the latest version of FCP, for example) they tell you BEFORE you buy. Customer service is lightning quick, friendly, and helpful. If you're considering a purchase they can enable certain elements on your account manually and they become available as soon as you sign in. Price-wise, yes, probably the most expensive you'll come across, but you do get what you pay for. Personally I try to bundle packages that I know I'm going to buy eventually and that gets you a discount at checkout (15% on three items, 30% on five). Even without the discount I'd still be a happy customer, but it gives a little bit more incentive and you won't regret it once you start playing around on the timeline.TL;DR: Fairly expensive, but I won't use anyone else now. Highly, highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Bob__",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T12:38:27.000Z",
          "Titre": "Needed some technical support with a…",
          "Contenu": "Needed some technical support with a particular plugin and these guys were absolutely on it.   They answered quickly, sent videos to help and honestly I couldn't fault them at all."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "XAVIER SAER",
          "Nb_Reviews": 2,
          "Date": "2023-08-24T15:25:02.000Z",
          "Titre": "Marcel & the team from VFX were quick…",
          "Contenu": "Marcel & the team from VFX were quick to respond, took their time to analyze my specific concern and provide all the answers. Excellent service with a :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Johnny",
          "Nb_Reviews": 2,
          "Date": "2023-02-23T12:27:51.000Z",
          "Titre": "Good Place to purchase software",
          "Contenu": "I have truly enjoyed making purchases from MotionVFX because the process is simple, quick and the product works as advertised. The option to adjust the product to your project needs gives the product so much more value. So my most recent purchase was great because I purchased mCollage. However, it was the Final Cut version instead of the Resolve version. I sent a message to MotionVFX about the issue and how I would like to get this changed to the correct product. The response was great and they exchanged and updated the product so that I was able have the corrected product quickly. They have great customer service and I look forward to making continued purchases from MotionVFX"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T09:37:38.000Z",
          "Titre": "Above and Beyond",
          "Contenu": "I love MotionVFX products for their creativity and ease of use. What is exceptional; however, is their customer service. I couldn't find the font I needed so I sent an email to their help desk. They came back with a simple tutorial on how I could create what I needed in Motion free of charge. Of course this only makes me want to spend more money with them :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Skye Reno",
          "Nb_Reviews": 2,
          "Date": "2023-05-29T11:44:24.000Z",
          "Titre": "Jakub is a rock star!",
          "Contenu": "Jakub is a rock star! I have rarely had tech difficulties with MotionVFX; but when I have, Jakub has stayed with me and provided clear and concise help that provided perfect results. And even before Jakub... over the last decade, there have been others, that have provided the same wonderful tech support for the few times I have needed it. Mostly, the tech support I needed was because I was being an idiot and the answer was right in front of me. This last time though, it had to do with an FCPX update that effected a few plugins. Jakub was right there for me.Heartfelt thanks Jakub!Cheers,Skye Reno"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "jillurdaneta",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T11:48:35.000Z",
          "Titre": "From Frustration to Success: How MotionVFX Support Team Saved My Day",
          "Contenu": "I recently purchased mo2 plugin, and to be honest, I was completely clueless about how to make it work. I felt a bit overwhelmed and frustrated, to say the least.But here's where the magic happened: I reached out to their customer service through their website, and I was blown away by the level of patience and dedication they showed. The customer service representative stuck with me through the entire process, guiding me step by step until I finally got MO2 up and running smoothly.I can't stress enough how rare it is to find such excellent customer support these days. This experience made me appreciate companies like motionVFX even more. It's not just about having a great product; it's also about having a team that genuinely cares about their customers' success.So, if you're in the market for video editing plugins, I wholeheartedly recommend checking out Motionvfx.com, not only do they offer fantastic products, but they also back them up with top-notch customer support. It's people like these that make our lives easier and our creative endeavors more enjoyable.Let's show our support to companies that go the extra mile for their customers. Together, we can encourage more businesses to prioritize excellent customer service. So, go ahead and explore what motionvfx has to offer, and experience the difference for yourself. You won't be disappointed!Happy editing, everyone! 🎥✨"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "dave",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T02:15:56.000Z",
          "Titre": "Very pleasant to converse with",
          "Contenu": "Very pleasant to converse with, and even though I fixed the issue before them, they were thankful that I found an issue they weren't aware of and even gave me bonus credit for spotting a bug. I'll take it! Thank you, MotionVFX."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ED",
          "Nb_Reviews": 4,
          "Date": "2023-11-13T16:07:23.000Z",
          "Titre": "Top Notch Support!!",
          "Contenu": "Great, attentive support. they stuck with me though the entire fix."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Royce",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T14:35:56.000Z",
          "Titre": "I love the products by the company",
          "Contenu": "I love the products by the company. They have elevated my visuals greatly. They also have great customer service and support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wilson",
          "Nb_Reviews": 4,
          "Date": "2023-06-21T17:36:44.000Z",
          "Titre": "Great plugins!",
          "Contenu": "When ever I have a problem with a plugin or a question I get a relatively quick response. All the Plugins I purchase from them work great and save me time and help to make my videos way cool!"
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Daniel Z. Chohfi",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T14:57:23.000Z",
          "Titre": "Stellar support",
          "Contenu": "Stellar support, awesome products!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T04:04:30.000Z",
          "Titre": "Amazing support team",
          "Contenu": "The support team was wonderful and very responsive! They helped me solve an issue I was experiencing while using one of their plug-ins. I really appreciated their kindness and help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T15:23:51.000Z",
          "Titre": "Customer Service 👍👍",
          "Contenu": "I had an issue with a purchase and I contacted MotionVFX using chat. The problem was handled promptly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ross_",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T18:20:30.000Z",
          "Titre": "The customer service with MotionVFX…",
          "Contenu": "The customer service with MotionVFX helped me through a stressful situation where my email was hacked and I was unable to log in. The product has also been great, I'll be using MotionVFX for my video editing needs in the future and recommending the company to others as well."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Henning",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T12:28:46.000Z",
          "Titre": "I love the plugins and have been using…",
          "Contenu": "I love the plugins and have been using them for year. They are one thing that gives my channel the professional look that it has. The support is super nice and competent!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Hans",
          "Nb_Reviews": 1,
          "Date": "2023-04-18T17:59:00.000Z",
          "Titre": "Excellent Cusomer Support",
          "Contenu": "I had missed a deadline on one of the FCP plugins and contacted the support team for assistance. Their quick response and subsequent support was outstanding. The time frame and manner for customer support that most software companies consider normal, customer support from MotionVFX exceeds that by ten-fold. Great job, much appreciated. Thank you Jakub for your quick and professional response."
        }
      ]
    }
  ]
}