{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.flashbay.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "ET",
          "Pseudo": "Mame Abdulah",
          "Nb_Reviews": 5,
          "Date": "2023-12-11T03:16:03.000Z",
          "Titre": "allows users to create and share…",
          "Contenu": "allows users to create and share interactive multimedia content, such as animations, games, and interactive websites.2. It provides a platform for developers to create engaging and visually appealing content that can be easily accessed and shared across different devices and platforms.3. Flashby can be used for educational purposes, allowing teachers to create interactive learning materials that engage students and enhance their understanding of complex concepts.4. It has been used in advertising and marketing to create eye-catching and memorable campaigns that capture the attention of consumers.5. Flashby has also been used in the entertainment industry to create immersive experiences, such as interactive storytelling and virtual reality applications.Overall, Flashby is important because it enables the creation of dynamic and engaging content that can be used for a wide range of purposes, from education to entertainment to marketing."
        },
        {
          "Note": 1,
          "Lieu": "GM",
          "Pseudo": "Madeline Jatta",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T01:08:10.000Z",
          "Titre": "I am thankful for the company"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "David",
          "Nb_Reviews": 22,
          "Date": "2022-07-12T11:12:33.000Z",
          "Titre": "Useless company that enjoys sending out…",
          "Contenu": "Useless company that enjoys sending out unsolicited emails which are spam, i have never heard of this company before, but since you want to send me spam this is my review.If you don't like this review, do not send unsolicited spam emails to email addresses you have stolen since you emailed me at an unlisted email address which is not publicly visible !"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Samantha Adams",
          "Nb_Reviews": 1,
          "Date": "2021-03-11T15:02:46.000Z",
          "Titre": "Great customer service. My disappointment at receiving the wrong product was quickly turned around by the delivery of the proper items within a week.",
          "Contenu": "My first experiences were great. My most recent purchase was a different experience. Although the package arrived early, it smelled odd and musty. Inside were my flash drives. The logo was correct but 2.0 not 3.0. I immediately contacted my rep.  Apologies with a partial refund? These cost nothing, I’m paying a premium! Since asking for a full refund and return if wrong product I’ve heard nothing. Ironically, when ordering, emails, phone calls and all kinds of attention. Too bad. I will follow up with end result. Hopefully this review can be updated soon"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Toby DeJonge",
          "Nb_Reviews": 8,
          "Date": "2019-08-09T19:17:25.000Z",
          "Titre": "DO NO TRUST THIS COMPANY!!!",
          "Contenu": "DO NO TRUST THIS COMPANY!!!Terrible company. Appalling customer service. Sent me a broken and badly damaged item and refused to refund my money. Had to get bank involved in the end due to such terrible customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rita Clark",
          "Nb_Reviews": 1,
          "Date": "2013-08-11T16:52:48.000Z",
          "Titre": "I ordered 8GB and I received 2GB flash drives",
          "Contenu": "I ordered 8GB and I received 2GB flash drives - I have tried to call company twice and have sent an e-mail trying to exchange them. So sad. Love the way the look but I cannot fit my clients images onto them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amanda Taussig Nemec",
          "Nb_Reviews": 1,
          "Date": "2016-09-02T03:05:17.000Z",
          "Titre": "Couldn't even get a quote!",
          "Contenu": "I found flashbay through a popular photographers group on Facebook. I went to their website and couldn't find any pricing so I filled out their quote request form. I asked for quotes on qty 25 and 100 for 2G and 4G drives. I got an email from \"Esther\" who also signed her name \"Kristine\", but it was only for 100 units. I wrote back and told Esther/Kristine that it was a bit more than I was able to spend, could she please send the quote for 25 units. Instead of sending me the quote, she asked me what my budget was. I told her what I'd LIKE to spend and she said they couldn't do that. She still didn't send the quote for 25. And the letter continued with reasons why they were more expensive, but the writing wasn't even correct English so I feel like the entire thing is suspect."
        },
        {
          "Note": 1,
          "Lieu": "SS",
          "Pseudo": "maxamed badgale",
          "Nb_Reviews": 1,
          "Date": "2020-08-12T18:54:09.000Z",
          "Titre": "Its very fantastic",
          "Contenu": "Its very fantastic and ilove its helping me very well"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Midgar Monkey",
          "Nb_Reviews": 74,
          "Date": "2018-05-12T00:04:20.000Z",
          "Titre": "dont spam adverts",
          "Contenu": "dont spam adverts. Word of mouth means your worth while."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Brayden Shotter (MrBrayden9898)",
          "Nb_Reviews": 1,
          "Date": "2020-03-16T18:00:18.000Z",
          "Titre": "Nuisance",
          "Contenu": "Why are you spam calling a Canadian phone number?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kayla T Jackson",
          "Nb_Reviews": 1,
          "Date": "2022-03-22T10:45:32.000Z",
          "Titre": "Their price inquiries are inaccurate &…",
          "Contenu": "Their price inquiries are inaccurate & the customer agent I spoke to was overseas, I would just take my money to shopiosx"
        },
        {
          "Note": 2,
          "Lieu": "ZA",
          "Pseudo": "Marie Midcalf",
          "Nb_Reviews": 1,
          "Date": "2021-12-08T08:51:02.000Z",
          "Titre": "Long wait for delivery",
          "Contenu": "The ordering and payment process was efficient but according the Google search, you should have your order in 5 days (also stated on the quote I received). I was told it would be 8 days... It took 2 weeks. The courier company (TNT Express) has given me 3 different stories about the shipment. They’re unable to find information about deliveries on their system and when they put you through to their ‘manager’, the call gets cut off.  When I did finally receive the USB’s they were in good condition and packaged as requested."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Melissa",
          "Nb_Reviews": 1,
          "Date": "2014-01-01T01:19:07.000Z",
          "Titre": "Great service until delivery",
          "Contenu": "Great customer service through review of models, proof creation and ordering process. Company made an entry error for the shipping address, and was not very responsive through the delivery process (that started a couple days before holiday season), which arrived eight (8) days late."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Paul Grace",
          "Nb_Reviews": 2,
          "Date": "2020-03-19T07:50:23.000Z",
          "Titre": "Excellent service"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rachel D.",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T23:29:37.000Z",
          "Titre": "Final cost was not true; over kill with sales calls",
          "Contenu": "There was an issue with the cost of the final bill because the sales tax did not populate on the site. I had to make a separate payment after someone contacted me about the missing sales tax. Also, how many times the assigned sales rep calls our office when I originally started the process was too much. I work in a law office that has a very high volume of client traffic. Calls from Flashbay's sales rep every single morning just to reach out were unnecessary. I understand sales goals and meeting margins, but it was to the point the company looked greedy."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "kg",
          "Nb_Reviews": 1,
          "Date": "2016-06-20T14:55:26.000Z",
          "Titre": "Great results, tough road getting there",
          "Contenu": "We have recently rebranded our organization and are attempting to standardize everything.  Convincing the company to use our true logo colors, rather than changing them based on other factors, was an uphill battle.  In the end, though, the product looks great and we are pleased to distribute them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kristina Soltesz",
          "Nb_Reviews": 1,
          "Date": "2014-06-17T21:51:49.000Z",
          "Titre": "Not what I expected",
          "Contenu": "I didn't understand why I couldn't buy 50 flash drives and 200 lanyards.  It didn't make sense so I am buying the lanyards somewhere else. The drive was nice but the logo was not as dark and eye-popping as the picture when I approved it. Disappointed. But they were fast which was good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "QuickMAR",
          "Nb_Reviews": 1,
          "Date": "2015-08-24T21:12:38.000Z",
          "Titre": "Review of Flashbay",
          "Contenu": "My sales representative was great to work with. She followed up after I received my order to make sure everything arrived as it should. \r However a company policy made ordering very frustrating. If you are paying with a credit card the billing and shipping addresses have to match. With a company that is spread throughout the United States it turned out to be quite the hassle to mail the flash drives to my sales representative who will be handing out the flash drives. I had to put the order on his personal credit card and reimburse him for the costs rather than using a company card. Definitely not an ideal ordering situation."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Juan",
          "Nb_Reviews": 1,
          "Date": "2016-07-30T02:02:02.000Z",
          "Titre": "Good customer service, ok product but not outstanding.",
          "Contenu": "It was very easy and straight forward to order but the product quality of their alloy usb is too plastic to me, I expected a more solid feel. Customer service and logo printing were good and easy."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Luke P",
          "Nb_Reviews": 1,
          "Date": "2015-10-15T18:17:11.000Z",
          "Titre": "Flashdrives for CSA Research",
          "Contenu": "I would give Vanessa 5 stars absolutely. She worked with me diligently and was quite impressive with how she kept me up to date on the status our order and what we had to do next.\r I was not thrilled by learning that my order might not have come on time due to holiday in China. I figured it would be a simple job because we had it shipped to Santa Clara, however the headache came when my expectations of arrival was put into question. This wasted much of my time and made me focus on what should have been your company's dealings. \r Thankfully, Vanessa helped a lot and stayed in touch with me on an almost day-to-day basis and calmed my nerves. I appreciate her work but am perturbed that nowhere on your site was the information readily available that they were made and shipped from China."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Monty",
          "Nb_Reviews": 1,
          "Date": "2018-10-09T14:48:47.000Z",
          "Titre": "You get what you pay for",
          "Contenu": "The prices were fair and the customer service was pretty good however the product is not great. Print quality definitely leaves something to be desired."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James McGhee",
          "Nb_Reviews": 1,
          "Date": "2014-07-07T23:43:07.000Z",
          "Titre": "Nice product, extremely difficult to order from.",
          "Contenu": "Although I'm quite pleased with the product itself, Flashbay makes it about as complicated as they possibly can for a customer to actually buy from them.  The minimum order is prohibitively high (kept me from using them the last two wedding seasons) and it doesn't allow you to customize each drive individually.  They also make you go through a rather silly process of requesting a temporary password that has to be emailed after a sales rep gets in touch with you either over the phone or through email.  From there, you have to log in to be able to see your options/ prices, upload your images, branding, etc. and wait again for a sales rep to get in touch with you.  A designer sends you a proof with the best approximation of the images/branding you uploaded (it's nowhere near as specific or automated as say designing business cards) you make corrections if necessary, and then... finally, the send out your order.  All told, it took 6 days to go through the whole process; in comparison, the very similar process of ordering business cards takes me about 15 minutes.  Shipping was fast, to their credit.  Like I said, I've quite happy with the product itself, but if another company offered the same with a streamlined ordering process, and no enormous minimums, I'd switch to them in a heartbeat."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patti Kochman",
          "Nb_Reviews": 1,
          "Date": "2013-01-15T23:27:08.000Z",
          "Titre": "Aaron was great to work with",
          "Contenu": "However, there was an issue with Fed X and we didn't receive the order in time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2018-08-14T23:14:43.000Z",
          "Titre": "They do decent work and meet the…",
          "Contenu": "They do decent work and meet the deadlines.  Price is avg at best."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Don Kessler",
          "Nb_Reviews": 1,
          "Date": "2020-03-21T11:07:05.000Z",
          "Titre": "Awesome place to buy tech & stuff",
          "Contenu": "Awesome place to buy tech & stuff, great staff, low prices"
        },
        {
          "Note": 3,
          "Pseudo": "Angela Darnell",
          "Nb_Reviews": 1,
          "Date": "2020-11-12T07:02:42.000Z",
          "Titre": "great service",
          "Contenu": "great service, they select great product. staff also good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ron Harden",
          "Nb_Reviews": 1,
          "Date": "2018-09-24T23:22:22.000Z",
          "Titre": "My disappoint is that your product is…",
          "Contenu": "My disappoint is that your product is not made in the USA."
        },
        {
          "Note": 3,
          "Lieu": "ID",
          "Pseudo": "Igrin Taqiya",
          "Nb_Reviews": 2,
          "Date": "2021-04-22T01:05:39.000Z",
          "Titre": "Helpful",
          "Contenu": "Can provide significant benefits if used properly"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Daniel Rosenhanst",
          "Nb_Reviews": 1,
          "Date": "2016-01-18T22:24:27.000Z",
          "Titre": "A little aggressive but otherwise fine.",
          "Contenu": "A little aggressive but otherwise it was fine."
        },
        {
          "Note": 3,
          "Lieu": "SI",
          "Pseudo": "hramse12",
          "Nb_Reviews": 1,
          "Date": "2016-08-08T14:28:31.850Z",
          "Titre": "good :)",
          "Contenu": "very good but not quite"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Kari Hann",
          "Nb_Reviews": 1,
          "Date": "2018-02-14T14:48:25.000Z",
          "Titre": "Product is not what I ordered!",
          "Contenu": "My experience started out great. I was looking at ordering either 50 or 100 USB's for my company with our logo. I had my mind set on a particular style but after my account manager got in touch with me and sent me a sample box, I was intrigued by the \"on the go\" styles that offered a second port you could plug into your mobile devices. My account manager was quick to respond and follow up with quotes and info I requested. I asked whether the port would be compatible with our company phones (iPhone 7 and iPhone 6s - same port) and was told it would be.Here are the exact words of my account manager “Yes, it will definitely fit into an iPhone 6S and other iPhone models with a USB-C port”And then when I asked this again just to be 100% sure before ordering he replied with “Yes, if you choose the USB-C connector, it will fit the iPhone 7” so I placed the order for 100 of these flash drives without hesitation. Keep in mind, these were more expensive than the original style we had planned to order. When I received the USB's I was excited to plug them into my phone and test out how we could share info on our company phones. However, I was very disappointed to quickly realize they do not fit into our phones. Not even close. I immediately contacted my account manager about this issue. I told him how dissapointed I was that I was mislead to believe these were compatible with our company iPhones. This was over a week ago and this issue has still not been resolved. My account manager has been so slow to get back to me with solutions to this issue. Always calling this an \"inconvenience\" and never acknowledging his mistake. He now tells me all the devices this USB IS compatible with which does not make a shred of difference to me since they are useless in our phones which is why we purchased them. I have had to follow up several times when he hasn't got back to me when he says he is going to. Always saying he is waiting on his \"Quality Control Team\" and he appreciates my patience. I have asked for a manager to get back to me on this issue and this request was ignored. At this point I have been offered 30% off on my next order but there will be no next order. I shouldn't be paying full price for a product that does not do what was promised and I shouldn't be waiting over a week for a solution when he was so quick to respond to every email prior to this order being placed. I have asked again in big bold letters for a manager to contact me and that is where this issue now stands...Edited to add a manager did reach out to me and resolved this issue. I was offered a partial refund to compensate for this error which I accepted. I appreciate the quick follow up once I escalated the issue."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kali",
          "Nb_Reviews": 2,
          "Date": "2017-03-24T12:40:47.000Z",
          "Titre": "Would Order Again",
          "Contenu": "Would order again"
        },
        {
          "Note": 3,
          "Lieu": "PH",
          "Pseudo": "David Halljborn",
          "Nb_Reviews": 1,
          "Date": "2017-10-23T07:27:23.000Z",
          "Titre": "Thanks flashbay!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sondra DiFrancia",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T22:39:04.000Z",
          "Titre": "Mixed Signals",
          "Contenu": "Our overall experience with Flashbay was positive, resulting in a high-quality product. However, there was a minor hiccup that caught us off guard. When we were ready to proceed with our order, we were informed that the product had to be shipped to the billing address, with no option for separate shipping addresses. This was a departure from our usual experiences with vendors, as we routinely handle orders on behalf of our clients.This deviation from the norm raised concerns and almost led us to explore other options for our business needs. Fortunately, the Flashbay team, during my ordering process, accommodated our request and allowed a separate shipping address. While we appreciate their flexibility in this instance, it has given us some pause about future orders.It is our sincere hope that Flashbay reevaluates and potentially revises this policy in the future. Our team was genuinely impressed with the quality of the notebooks we received, and we would gladly consider ordering from Flashbay again if this shipping address restriction were addressed."
        },
        {
          "Note": 4,
          "Lieu": "EG",
          "Pseudo": "مدحت هاشم _ EBB",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T00:35:44.000Z",
          "Titre": "Good 👍 you ...This site and those…",
          "Contenu": "Good 👍 you ...This site and those running it are good at their job"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marianne Calilhanna",
          "Nb_Reviews": 2,
          "Date": "2023-10-03T23:20:49.000Z",
          "Titre": "Great customer service and speedy…",
          "Contenu": "Great customer service and speedy production. I dealt with a real person (Donovan!) who helped me find appropriate giveaway options that are meaningful for my clients."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joshua",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T19:57:13.000Z",
          "Titre": "Satisfactory Experience",
          "Contenu": "Overall, I was satisfied with the product and the help we received from the team! Our event ended up being great, and everyone liked the custom water bottles we purchased from Flashbay. However, I do wish there was a better way to track shipment. TNT wasn't very helpful. The bottles were delivered but the tracking information I received virtually kept me in the dark on the delivery status. I had to call the sales team and send emails to get an update. Again, everything turned out great. That was just a hiccup in the process. Thank you Flashbay!"
        },
        {
          "Note": 4,
          "Lieu": "NG",
          "Pseudo": "JOHN",
          "Nb_Reviews": 1,
          "Date": "2023-08-27T22:08:23.000Z",
          "Titre": "Website needs a little work",
          "Contenu": "Nice website with amazing products and designs .But there is one issue I see which is the website ,I kinda looks unprofessional in a way.Like the first website header area looks to scattered with the imagine of uses scattered.It would be nice If the header image was designed to have the usb nicely positioned instead if scattered.Thanks you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dysphagia Cafe",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T19:53:57.000Z",
          "Titre": "The follow-up was great",
          "Contenu": "The follow-up was great! I was disappointed with all the hoops I had to go through to have something shipped to a business that was separate from my billing address. That was a first time for me. But, it was resolved and everything was received in time and I am so far satisfied with the product."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Cherilyn Schrijer",
          "Nb_Reviews": 15,
          "Date": "2023-04-20T11:55:35.000Z",
          "Titre": "Flashbay is a great place to have your…",
          "Contenu": "Flashbay is a great place to have your wedding or party. The food is delicious and the service is excellent. The atmosphere is very nice and they have a lot of activities for you to do while you are there. I would definitely recommend this place for anyone who wants to have their wedding or party at Flashbay."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pono Nauka",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T01:20:10.000Z",
          "Titre": "Customer service and response time was…",
          "Contenu": "Customer service and response time was amazing.  However, phone call follow ups did not take in to consideration the different time zones (we are in Hawaii) and I was getting calls at 4:00 or 5:00am!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pete Traynor",
          "Nb_Reviews": 2,
          "Date": "2023-04-04T13:57:20.000Z",
          "Titre": "Recently visited here and their store…",
          "Contenu": "Recently visited here and their store had a great selection of computer accessories- from keyboards to external hard drives and USB hubs! The prices were reasonable and competitive, and I was able to find everything I needed for my setup."
        },
        {
          "Note": 4,
          "Lieu": "CY",
          "Pseudo": "Aniek Goedegebuur",
          "Nb_Reviews": 25,
          "Date": "2023-04-25T13:56:48.000Z",
          "Titre": "Fast",
          "Contenu": "Fast, simple, beautiful results! We reordered a previous order that we made and they were able to duplicate it exactly with no trouble and it came in just a week!"
        },
        {
          "Note": 4,
          "Lieu": "NG",
          "Pseudo": "Abba Engineer",
          "Nb_Reviews": 3,
          "Date": "2023-11-23T00:00:03.000Z",
          "Titre": "What an amazing service",
          "Contenu": "What an amazing service, this company provide easy user experience."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Lotfi Grift",
          "Nb_Reviews": 7,
          "Date": "2023-03-03T07:46:03.000Z",
          "Titre": "I am very happy with the service and…",
          "Contenu": "I am very happy with the service and quality of Flashbay Wedding & Party. We had a wonderful time at our wedding, they were very professional and helpful. I would highly recommend them to anyone!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daphne Rasefske",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T22:38:31.000Z",
          "Titre": "Leslie Marcum was very quick to respond…",
          "Contenu": "Leslie Marcum was very quick to respond and helpful with any of my questions.  Would definitely work with her again if we needed flashdrives."
        },
        {
          "Note": 4,
          "Lieu": "PK",
          "Pseudo": "Muhammad Shakeel",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T19:40:31.000Z",
          "Titre": "Excellent and good"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "David Griffins",
          "Nb_Reviews": 3,
          "Date": "2023-04-25T15:58:06.000Z",
          "Titre": "Excellent service and products",
          "Contenu": "Outstanding Service and good range of products."
        },
        {
          "Note": 4,
          "Lieu": "PK",
          "Pseudo": "Abdul Zahid",
          "Nb_Reviews": 2,
          "Date": "2023-07-16T11:22:09.000Z",
          "Titre": "i had a great  experience with them"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim Packett",
          "Nb_Reviews": 1,
          "Date": "2022-10-19T17:23:48.000Z",
          "Titre": "Great service",
          "Contenu": "Great service. Good selection. Donovan was there through the whole process. My only miss was buying a USB for computers instead of getting one that had USB-C for phones."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robbin Aliot",
          "Nb_Reviews": 1,
          "Date": "2022-06-28T16:02:21.000Z",
          "Titre": "Thank you",
          "Contenu": "Nice product, good quality, attentive sales staff. My only criticism would be excessive packaging. Every water bottle was individually boxed and wrapped and then inside a big box with more packaging materials. Not very environmentally friendly, could have been packed with a lot less waste."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lt. McCray",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T02:03:35.000Z",
          "Titre": "was fast and accurate"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pearl Wamsley",
          "Nb_Reviews": 1,
          "Date": "2022-02-17T19:49:42.000Z",
          "Titre": "Joseph was very attentive",
          "Contenu": "Joseph was very attentive, helpful, and on top of the project. The variety of products they offer is unparalleled as is the quality. I wish the turnaround time was slightly faster, but it was still a perfectly reasonable timeline and they really they did a great job. Would recommend to others, and will probably use in the future."
        },
        {
          "Note": 4,
          "Lieu": "UG",
          "Pseudo": "AGUMASHABE ABLE",
          "Nb_Reviews": 2,
          "Date": "2023-10-10T13:01:39.000Z",
          "Titre": "best car dealers ever"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DGN RC Racing Components",
          "Nb_Reviews": 1,
          "Date": "2022-07-14T15:01:43.000Z",
          "Titre": "Did a re-order very nice product my…",
          "Contenu": "Did a re-order very nice product my customers really like the pen with the USB . Did have a double charge to my CC they resolved the prob very quickly . I will  do more with this company in the future ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CNewton",
          "Nb_Reviews": 1,
          "Date": "2022-01-25T16:48:01.000Z",
          "Titre": "Conor Kennedy provided excellent…",
          "Contenu": "Conor Kennedy provided excellent customer service, above and beyond!  So grateful.  Felt like there was a bobble in the production schedule as I anticipated receiving my masks in 7 business days and it took a little longer.  Overall very happy with the product and printed logos.  The quality of the maks is good and these were received in time for my event.  Praise the Lord!  I opened one and put it on - there is a bit of a funny smell - but hoping that subsides once unwrapped and aired out.  Thanks for all your help!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kristan McMahon",
          "Nb_Reviews": 1,
          "Date": "2021-09-17T01:34:24.000Z",
          "Titre": "Great customer service and the products look good.",
          "Contenu": "Olivia was great to work with. She was responsive. She checked in appropriately at every stage of the process including after receipt of the items we ordered. I appreciated her efforts to engage us without being overbearing. The masks themselves look great. We're going to use them with a small group of our constituents who are traveling soon as a low-key way to brand our group. We specifically ordered the FFP2-like mask, so hopefully that will be accepted where we are headed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim Hornibrook",
          "Nb_Reviews": 1,
          "Date": "2021-04-09T20:28:03.000Z",
          "Titre": "Antonio with Flashbay helped our store…",
          "Contenu": "Antonio with Flashbay helped our store (Redwood Trading Post) make some logo water bottles.  He was great.  Very helpful.  Very professional.  Very proactive in making sure all steps of the process were clear and ensured the process was easy and successful.  I would highly recommend Flashbay and Antonio.Jim Hornibrook"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Press Kingz LLC",
          "Nb_Reviews": 1,
          "Date": "2021-04-22T21:59:42.000Z",
          "Titre": "Sky Black Face Mask",
          "Contenu": "Nicholas was a pleasure to work with! We had somewhat of a complicated order and he went above and beyond to make sure our clients needs were met. Press Kings LLC appreciates your patience and your willingness to compromise in order to meet ours and our clients needs. Everyone was pleased with the results."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Desiree",
          "Nb_Reviews": 1,
          "Date": "2020-12-01T02:13:55.000Z",
          "Titre": "Great quality and service",
          "Contenu": "Brian who helped me was wonderful. He was very quick to respond to emails and super considerate and helpful. My company ordered 100 masks, 7 of which came wrongfully printed. But Brian is going to send us replacements. Everything came quickly in the mail. Aside from those 7, no complaints! Great quality masks and they look amazing!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas Jones",
          "Nb_Reviews": 1,
          "Date": "2021-02-10T14:46:13.000Z",
          "Titre": "I contacted several companies seeking…",
          "Contenu": "I contacted several companies seeking quotes for some custom printed masks for the Church I serve.  Donovan was the first to respond, the same day.  By the next day we received a sample mask.  Donovan was very helpful in the ordering process.  We have received the masks and are very pleased with them.   The cost was a bit more than the other companies we received quotes from, however we are pleased with the end product.    I do wish the company would offer an option for 'American made' masks."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "One Step",
          "Nb_Reviews": 4,
          "Date": "2021-02-09T21:16:46.000Z",
          "Titre": "Compliment on service and products",
          "Contenu": "I have used FlashBay many times for many of their products...the most recent was their face masks with our logo on it and they were Great!!!  Jill at FlashBay has taken care of many of our orders efficiently, very polite, always prompt and very competitive...keep up the Great products and service!!!  Amos"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Link Up Communications",
          "Nb_Reviews": 1,
          "Date": "2020-02-20T16:27:36.000Z",
          "Titre": "Having my account managed by Seamus…",
          "Contenu": "Having my account managed by Seamus White was terrific. He got me all the information I needed to make a quick, but informed decision. The entire process from print to delivery was so fast, I was surprised to see that the package had arrived. The only reason I'm rating this a 4 out of 5 stars is we haven't used them yet, but our flash drives LOOK terrific! Can't wait to use them next week."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Caitlyn",
          "Nb_Reviews": 1,
          "Date": "2020-01-17T15:39:43.000Z",
          "Titre": "It was a really great experience",
          "Contenu": "It was a really great experience and the final product came out perfect. There was a lot of back and forth with our sales representative Kyle and he was very responsive and did his best to assist us in finalizing our decision. Got the cube speaker and its small but really cute and easy to use. Also arrived before we anticipated which was very helpful with a big event coming up quickly."
        },
        {
          "Note": 4,
          "Lieu": "CD",
          "Pseudo": "theophile hishamunda",
          "Nb_Reviews": 2,
          "Date": "2021-05-24T07:59:31.000Z",
          "Titre": "We ordered some amazing customized…",
          "Contenu": "We ordered some amazing customized masks and they are absolutely phenomenal! Super high quality, easy on the ears, provide confidence that the material truly protects but yet easy to breathe. Antonio was outstanding. Arguably one of the best customer service experiences I’ve ever had. Period. He returned my emails and requests within minutes. Quick to give me updated quotes and virtual images. Product arrived within a week. Every single thing Antonio promised on he delivered. Was never pushy or impatient. Will order other products without hesitation."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Penny Stevens",
          "Nb_Reviews": 1,
          "Date": "2019-11-20T14:41:46.000Z",
          "Titre": "We purchased a small number of flash…",
          "Contenu": "We purchased a small number of flash drives from Flashbay, and received them within a week of approving the design.  The product is high quality and the logo is crisp & clean on the stick.  To date, we haven't used the drives, but anticipate no problems, based on the quality of the customer service & turnaround time.  Matt was a great contact, and was most helpful in completing our order.  Good job, so far, Flashbay!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shani Underwood",
          "Nb_Reviews": 1,
          "Date": "2019-09-20T18:00:34.000Z",
          "Titre": "Web Cam covers/ Phone Charging Banks",
          "Contenu": "Web Cam covers were a hit.  The chargers don't seem to be very great at holding a charge.  Phone Charging Banks themselves look great.  The first 2 we tried were charged over night and literally charged an iPhone from 20% to 43% and was only in use for 24 minutes and died.  We will charge again and see if it was just that one. Product wise satisfied, delivery was fast and ahead of our very tight deadline.  Overall satisfied."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Sasha",
          "Nb_Reviews": 2,
          "Date": "2018-12-25T01:27:53.000Z",
          "Titre": "Excellent online store Flashbay where…",
          "Contenu": "Excellent online store Flashbay where you can buy different gadgets and the rest. I had to make a gift to my friend for my birthday and knew that he needed a power bank and on the site I saw a gift set where there is a power bank and a flash drive 2 in one. So I decided to buy it to please my friend. My order was placed fairly quickly in which I was satisfied and when the delivery of goods"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cheri",
          "Nb_Reviews": 1,
          "Date": "2019-06-04T16:57:58.000Z",
          "Titre": "I enjoyed working with Flashbay",
          "Contenu": "I enjoyed working with Flashbay and they delivered a great product in a timely manner. My only frustration was getting bounced around to three different people helping with my order and I had to tell each new person what I wanted. Each of the people were really nice and helpful, I just wish I could have only dealt with one person from beginning to end."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carey Oconnor",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T04:00:45.000Z",
          "Titre": "Great products and prices",
          "Contenu": "Great products and prices. The item seems very durable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Barry Dougherty",
          "Nb_Reviews": 1,
          "Date": "2021-09-14T22:35:55.000Z",
          "Titre": "I'm very satisfied with my Flashbay…",
          "Contenu": "I'm very satisfied with my Flashbay product. Chris, in sales, had excellent knowledge of the products and was able to assist me in a pleasant and professional manner. The turnaround of proofs for logo/copy placement was quick as was the delivery time. I'd never ordered from Flashbay before and as with any company I find on the internet there is always that uncertainty of a company's reputation. Speaking with Chris and his attention to detail in our initial conversation made me feel comfortable and confident that I would be getting the highest service and a quality product–and they did not disappoint."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "K. D.",
          "Nb_Reviews": 1,
          "Date": "2019-05-03T14:08:39.000Z",
          "Titre": "Great Customer Service ad Products",
          "Contenu": "Yudi Raphaelsohn was very helpful and provided great customer service. He sent out estimates/quotes as well as product samples. The samples and marketing sent out were great, and there was no expectation or hassling for our business. Yudi was helpful throughout the whole process, and everything was done in a very quick and timely manner. No complaints - 4.5 stars (I rarely give a 5 star review unless something was truly above and beyond and stuck out to me.)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Julia Wilcock",
          "Nb_Reviews": 1,
          "Date": "2019-04-22T16:40:22.000Z",
          "Titre": "The purchasing process was very easy",
          "Contenu": "The purchasing process was very easy.  Hieu Truong was a great representative.  The product was completed in a a timely fashion and delivered promptly.  The only suggestion I have would be to broaden the USB 3.0 selection. As many of the industries are working on securing their computer processes, the up to date USB's will be needed"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Soe Lopez",
          "Nb_Reviews": 1,
          "Date": "2021-09-10T23:55:23.000Z",
          "Titre": "Joseph was very responsive and helpful…",
          "Contenu": "Joseph was very responsive and helpful with our special requests for our order and delivery super quickly. Our logo masks look great. I'll definitely keep them on our list for the next order. Thank you, Joseph, for your great customer service!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jen Ryan",
          "Nb_Reviews": 1,
          "Date": "2019-03-01T22:10:53.000Z",
          "Titre": "Good product and very easy process",
          "Contenu": "Good product and very easy process.  It was great how they sent me samples right away - it was probably the thing that made me choose this company.  I was slightly irritated that we had to have the same shipping and billing addresses, as it made things a bit inconvenient, but overall had a good experience and would work with them again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rob Heselbarth",
          "Nb_Reviews": 1,
          "Date": "2018-10-29T20:32:43.000Z",
          "Titre": "Plastic bags are annoying",
          "Contenu": "I didn't want the flash drives in a plastic bag but my rep advised me to ship them in bags to prevent scratching and paint chipping. I trusted him and they arrived in perfect condition. But, it was frustrating to cut the bag off each drive over and over and over. Next time I'm going to insist they ship them to me without the bag."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ludovic Bernad",
          "Nb_Reviews": 4,
          "Date": "2019-04-21T12:06:43.000Z",
          "Titre": "Great Service and Delivery",
          "Contenu": "Very good service and delivery! My CSR Roque was a pleasure to work with, and I would work with Roque again in a heartbeat! Only issue I had with Flashbay is the financial controller that blocked my CC payment (even though I was shipping to my billing address), which then resulted in me having to make a costly wire transfer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alexa Odenweller",
          "Nb_Reviews": 1,
          "Date": "2017-09-20T15:27:20.000Z",
          "Titre": "Customer service and flexibility was …",
          "Contenu": "Customer service and flexibility was great and very timely. We were happy with the final product in terms of it turning out how we expected it to look. Our only reservation was the size of the flash drive itself. It covered up USB ports that were next to where it was plugged in. That was more of a lack on insight on our part than Flashbay's as it could have been avoided before we placed the order for that specific drive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Megan Garon",
          "Nb_Reviews": 1,
          "Date": "2017-08-30T21:13:08.000Z",
          "Titre": "I've now ordered two products with …",
          "Contenu": "I've now ordered two products with Flashbay (one with another company) and both flash drives were amazing! Excellent quality.My only issue this time around was that the sales person was overwhelming and, if the flash drives weren't so great, I would have taken my business elsewhere. The gentleman was extremely nice and professional, but he didn't know when to back off and there were too many follow ups and check-ins."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Abby Reimer",
          "Nb_Reviews": 1,
          "Date": "2017-10-30T16:14:46.000Z",
          "Titre": "Nice work.",
          "Contenu": "I liked working with Nick because he answered all my questions in a timely manner. The only thing I'd suggest next time is sending a working model - it was weird getting models that didn't work so we couldn't test the product and make sure it was in working condition. But when I expressed this concern - I was sent a working model so that was nice. Overall, good price and the products came on time. I'm happy with the experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Liat",
          "Nb_Reviews": 2,
          "Date": "2018-02-02T17:53:49.000Z",
          "Titre": "Good Job",
          "Contenu": "Like most organizations, we searched around for the best deal; we had the misfortune of starting to work with companies that are absolutely unprofessional and completely unreliable. As a representative for your company, Max did a fantastic job at communicating properly, making us feel safe and you she gave us piece of mind that the product we were receiving was in fact what you promised. I will definitely refer you guys and will keep you in mind in future projects."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hardy Brands",
          "Nb_Reviews": 1,
          "Date": "2022-10-21T00:18:53.000Z",
          "Titre": "Branded Flashdrives",
          "Contenu": "Super responsive customer service. I would like the ability to order on the website."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mo",
          "Nb_Reviews": 1,
          "Date": "2017-07-25T16:55:35.000Z",
          "Titre": "Great Custom Products",
          "Contenu": "Have used this company twice for business related custom USB Drives. The product is great, the pricing is competitive. Only issue I have is on promotional items there are no fully functioning samples available, primarily the speaker. Want to be able to use these items but don't want to have to invest in an item that may not be worth it. Some USBs needed to be reformatted to work, had a few that were misprinted. Overall good company with wide range of options"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robin Mardis",
          "Nb_Reviews": 1,
          "Date": "2019-09-24T21:27:52.000Z",
          "Titre": "Eye C U Photography",
          "Contenu": "I’m a new customer, with that said, I’m very pleased thus far. I gave my order to Jennifer and she did a suburb job making sure that my order was right. I’ve shared my jump drives with my friends and family and they love them. Thanks Flashbay.Sincerely yours,Robin MardisEye C U Photography"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Claudia Grimes",
          "Nb_Reviews": 1,
          "Date": "2021-04-16T16:43:27.000Z",
          "Titre": "It was great working with Donavan",
          "Contenu": "It was great working with Donavan, he was very helpful and answered all my questions in a timely manner.  He went above and beyond what I expected.  The order was quick and the masks are of good quality.  We are very please with our purchase. Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christopher L",
          "Nb_Reviews": 2,
          "Date": "2018-06-01T18:05:31.000Z",
          "Titre": "Great Company",
          "Contenu": "Wow.......Not many companies do what they do. My first experience with them was nothing short of rocky. To be honest, it was really bad. You are probably thinking, why would you give them 4 stars. After I had a terrible experience, not only did I get a call from the manager but also from the president of the US division (could have that wrong). You see, it's one thing to mess up. However, to own up and do everything you can take make that experience right. Now that is a great company."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brett Fisher",
          "Nb_Reviews": 1,
          "Date": "2019-09-03T21:30:33.000Z",
          "Titre": "Flashbay comes through",
          "Contenu": "This was the first time Flashbay had been used by my organization. We were impressed with the responsiveness of Nick, the sales rep, who treated our order as a top priority. He was very quick in generating the cost quote we requested and provided a terrific digital mockup. I didn't think a six-day turn-around was likely, since the products were coming from overseas. But Nick was true to his word. The products look exactly as they appeared on the mockup. They were produced and delivered promptly. Thank you, Nick and Flashbay!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Swain",
          "Nb_Reviews": 5,
          "Date": "2022-01-24T23:45:21.000Z",
          "Titre": "Reorder was easy",
          "Contenu": "Entered a previously ordered custom flash drive.  Everything was easy and order was received when promised.  Pricing a little high, but my order was small and the customer service is great.  Will use them again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jordan Sklansky",
          "Nb_Reviews": 1,
          "Date": "2020-10-27T18:38:09.000Z",
          "Titre": "Product was amazing, small shipping error.",
          "Contenu": "Product was amazing, customer service quick responses to emails. There was a small shipping hiccup both in a product coming to me, and someone else’s product shipped to me by accident. I would definitely order from Flashbay again they were great to deal with."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Geoff Dobbin",
          "Nb_Reviews": 2,
          "Date": "2018-10-19T17:14:19.000Z",
          "Titre": "Great company to work with...",
          "Contenu": "Excellent interactions and communications! I worked w/ Jennifer and she was able to walk me through the process of design, ordering and proofs. She processed my order and answered all my questions, even the ones that were probably silly. A definite recommend for others. Pricing was competitive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Olivia Jones",
          "Nb_Reviews": 1,
          "Date": "2017-10-30T18:36:59.000Z",
          "Titre": "Overall, great customer service and product quality",
          "Contenu": "The service is quick, courteous, and the product is great quality. My only reservation was that upon placing the order, I realized the price per unit was a bit higher than some other vendors, which I didn't notice before then, as I sourced vendors whose price per unit was higher than Flashbay's."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Katherine",
          "Nb_Reviews": 2,
          "Date": "2021-03-02T00:04:57.000Z",
          "Titre": "Great Quality Product and Good Customer Service",
          "Contenu": "My company purchased Webcam Covers and I was delighted to see the quality of the product was superb! I had the pleasure of working with Brian who promptly responded to all my questions. Would definitely recommend and purchase from Flashbay again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Allison",
          "Nb_Reviews": 1,
          "Date": "2020-09-10T16:02:52.000Z",
          "Titre": "Very Good Customer Support",
          "Contenu": "Brian assisted me with finalizing our product. He was very patient with getting us several different proofs as we tried to work out our favorite looking mask. He was extremely helpful with his suggestions, quick to respond and overall great to work with."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cailen - Rancho Cordova",
          "Nb_Reviews": 1,
          "Date": "2019-11-11T16:35:44.000Z",
          "Titre": "Flash Drive Review",
          "Contenu": "Flash Drive ReviewWe ordered swivel USBs for our agency and the customer service was excellent. Answered questions and helped get into our price point. The product is standard, I would like a little more of a beveled edge on the metal swivel but the print is quality."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephanie Gumpel",
          "Nb_Reviews": 1,
          "Date": "2018-01-02T17:57:55.000Z",
          "Titre": "I had a pretty positive experience",
          "Contenu": "I had a pretty positive experience. Max was very helpful and thorough and aided me from start to finish. He was also very nice and I enjoyed working with him.The process seemed a little structured and corporate, but not my sales rep's fault. I think it's just the nature of this kind of company. There was an issue with my shipping and there was some annoying bureaucratic policy type stuff to deal with. I also wish the products were made in America. The sticks looked pretty good and were shipped on time at a reasonable price."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lee",
          "Nb_Reviews": 1,
          "Date": "2018-01-18T23:13:11.000Z",
          "Titre": "Really pushy sales, good drives",
          "Contenu": "Flashbay is great at what they do - sales and flash drives. I just wanted to order like 20 drives... but they only do sales rep style, you can't see pricing online. If you don't reply for at least a day they're following up and bugging you... I told them I was in no rush at all but the entire process was one big pressured rush. I felt like I had to order just to get them to stop bothering me... so I did. Flashbay won! The drives are nice, but the whole sales process completely turned me off from wanting to work with them again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brianna",
          "Nb_Reviews": 1,
          "Date": "2019-03-28T14:34:56.000Z",
          "Titre": "Great work and fast turn around",
          "Contenu": "Great work and fast turn around. Had to question shipping cost because on every quote I was sent, shipping was free. When I was sent my first invoice, it included a $25 shipping fee. The invoice also did not reflect changes we had just communicated about. Made edits quickly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jennifer Garnick",
          "Nb_Reviews": 1,
          "Date": "2018-11-08T21:15:46.000Z",
          "Titre": "Our flashdrives had a shipping mishap…",
          "Contenu": "Our flashdrives had a shipping mishap which got them to us a couple days late which wasn't ideal.  Filip Sola - our sales contact, however stayed on top of it and was communicative about what was happening and provided up[dates and follow-up.  His customer service was great!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jamie Abbott",
          "Nb_Reviews": 1,
          "Date": "2017-08-30T13:10:35.000Z",
          "Titre": "Returning Customer",
          "Contenu": "The thumb drives we ordered looked great and arrived very quickly. Staff went out of their way to help with billing and delivery turnaround. The only complaint we had, was delayed communication during the proofing/ordering process. Once we addressed this, there were no further issues."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TJ",
          "Nb_Reviews": 1,
          "Date": "2019-05-23T21:44:22.000Z",
          "Titre": "The purchase of the USB Drives was easy…",
          "Contenu": "The purchase of the USB Drives was easy and quick. They actually arrived at my office a couple days before the anticipated delivery date. The graphics came out great and will be a wonderful tool as I build my business brand. I will use them again for future purchases."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Laura",
          "Nb_Reviews": 1,
          "Date": "2019-09-05T20:44:03.000Z",
          "Titre": "Great follow up and great follow…",
          "Contenu": "Great follow up and great follow through from beginning to the very end. Conor followed up to confirm we were aware of the order status and even contacted us on the day of delivery to discuss our level of satisfaction. Follow up and follow through was outstanding!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2018-10-11T23:01:26.000Z",
          "Titre": "Great customer experience with a few snafus...",
          "Contenu": "Great customer experience with a lot of assistance from staff as we walked through the entire process.  Shipped on time as promised.  Quality was there.  But, two slight surprises hit at the end.  First, we had asked about having data put on our flash drives from the start and thought that was what we talked about throughout the process.  When we placed the order, found that we were facing an additional $25 or so for that to happen.  Second, we were somewhat surprised when our products arrived from China.  We had been in touch and working with a company in CA, USA."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve Colberg",
          "Nb_Reviews": 2,
          "Date": "2018-03-08T20:48:56.000Z",
          "Titre": "Good experience, would recommend",
          "Contenu": "Product and responsiveness would both be a 5. The only reason I moved to a 4 is that I had to ask for a previous rate/cost to get the prices down to where I'd had it with a previous company. That was granted immediately and everything else about the experience was great"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gearhead Records",
          "Nb_Reviews": 1,
          "Date": "2018-07-08T21:26:19.000Z",
          "Titre": "Easy to Work With and Great Product",
          "Contenu": "Very easy to work with and great, quality product. Had a problem with one of the flash drives not working, but contacted my rep Kris and he was able to credit me back right away for that one damaged drive. Will definitely order custom flash drives from these guys again!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Susan Schmechel",
          "Nb_Reviews": 1,
          "Date": "2017-08-07T20:15:42.000Z",
          "Titre": "Flashbay products are very good and the …",
          "Contenu": "Flashbay products are very good and the prices are reasonable.  The only issue I had was having to repeat in several emails that our company name had changed.  Then, it was still wrong on the invoice.  But, it is all straightened out now.  We will order again in the future."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John G",
          "Nb_Reviews": 1,
          "Date": "2019-06-03T21:53:53.000Z",
          "Titre": "Our company purchased an order of logo…Kassbohrer ATV",
          "Contenu": "Our company purchased an order of logo branded USB drives from Flashbay.  Mark was our account manager.  He was very professional and helpful.  He processed our artwork immediately and we received the order ahead of our expectations.   Great work."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anna C",
          "Nb_Reviews": 2,
          "Date": "2021-10-14T15:35:20.000Z",
          "Titre": "We were happy with our order of custom…",
          "Contenu": "We were happy with our order of custom face masks. The only issue we had was with not receiving one of the face masks we ordered and paid for; however, we are still waiting to hear back on this issue."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Mullen",
          "Nb_Reviews": 1,
          "Date": "2018-12-29T13:35:39.000Z",
          "Titre": "overall a great experience",
          "Contenu": "overall a great experience. My only suggestion would be on the email interactions. They were mechanical, almost scripted and that made me hesitate about ordering. But the product I ordered got here quickly and is very well made. I will order again"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Zurawik Law Firm",
          "Nb_Reviews": 1,
          "Date": "2020-08-19T13:30:09.000Z",
          "Titre": "Nick was easy to deal with and the item…",
          "Contenu": "Nick was easy to deal with and the item was timely in delivery. Nick was wonderful however, the containers for the flashdrives are not adequate.  Would have liked to have it in some plastic covering rather than a small baggie."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chelsa Nelson-Preble, Out of the Clouds",
          "Nb_Reviews": 1,
          "Date": "2020-03-18T18:42:51.000Z",
          "Titre": "Kyle was great to work with!",
          "Contenu": "Kyle was great to work with.  He was responsive, thorough, and up front about expectations.  He price matched my product and the artwork looks fantastic.  I will definitely come back to Flashbay when I need to reorder.  Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "BI",
          "Pseudo": "Elie Solo NDABOROHEYE",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T03:06:39.000Z",
          "Titre": "Happy to be in this company",
          "Contenu": "Happy to be in this company. But l 'm good In french"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alexandra Lauber",
          "Nb_Reviews": 1,
          "Date": "2019-08-14T19:15:25.000Z",
          "Titre": "Branded USBs",
          "Contenu": "When I reached out to Flashbay for branded USBs, they got in touch with me right away, gave me price lists, and quickly sent mockup designs. The ordering process was very easy and I had great customer service every step of the way."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charlie",
          "Nb_Reviews": 2,
          "Date": "2020-02-23T00:15:47.000Z",
          "Titre": "Very good quality......could be faster writing though",
          "Contenu": "The flash drives are of very good quality in appearance. The use of the flash drives is well received by my clients.For a USB 3.0 drive, I wish the write capability was much faster. They are not as fast as a SanDisk drive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TDREF",
          "Nb_Reviews": 1,
          "Date": "2018-07-18T15:39:45.000Z",
          "Titre": "Fast service",
          "Contenu": "Flashbay did a great job turning around our custom USB order in a short amount of time. We were pleased with their responsiveness and attention to detail when specifying logo placement and orientation on the drive itself."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gayla Jones",
          "Nb_Reviews": 1,
          "Date": "2018-05-04T16:28:55.000Z",
          "Titre": "Erik made my experience with Flashbay…",
          "Contenu": "Erik made my experience with Flashbay very efficient and was extremely knowledgeable with my account and my product.  He handled my request in a very timely manner, that’s making my buying experience easy and effective."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kathryn Gardner",
          "Nb_Reviews": 1,
          "Date": "2019-09-23T14:50:11.000Z",
          "Titre": "I was very impressed with Flash Bay",
          "Contenu": "I was very impressed with Flash Bay, their quickness and details.  I enjoyed working with Hieu too, he talked me through some things I would never have understood doing it on my own.Thank you very much"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vanessa Sanchez",
          "Nb_Reviews": 1,
          "Date": "2018-12-21T00:45:49.000Z",
          "Titre": "Smooth process, fast delivery",
          "Contenu": "Flash drives had the logo we wanted and there was no problem getting it in the right color. They also came in pretty quick! Overall it was a pretty straightforward process and everything flowed smoothly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brianna Brailey",
          "Nb_Reviews": 1,
          "Date": "2019-03-07T15:40:48.000Z",
          "Titre": "Good customer service and product",
          "Contenu": "Good customer service and product. Melvin was very helpful in placing my order. I needed the web cam covers with a fast turnaround, and Flashbay was able to get them to me a day earlier than projected!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "SR",
          "Nb_Reviews": 1,
          "Date": "2019-05-09T14:11:55.000Z",
          "Titre": "Very Good...",
          "Contenu": "Melvin was very compliant and patient with allowing me to get the answers from my bosses in a timely fashion.  He was always reachable and allowed us to get our order under the time constraint we had."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MR",
          "Nb_Reviews": 1,
          "Date": "2021-05-12T19:40:07.000Z",
          "Titre": "The mask was exactly as promised",
          "Contenu": "The mask was exactly as promised. The shipping information was off, but everything arrived within the promised time. The representative was very helpful with the entire process."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Massachusetts customer",
          "Nb_Reviews": 2,
          "Date": "2019-08-23T16:34:13.000Z",
          "Titre": "The service was quick and personalized",
          "Contenu": "The service was quick and personalized, and very helpful, even though I was not placing a large order. My only hesitation with the company is that products are expensive. But they look great!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Satisfied customer",
          "Nb_Reviews": 3,
          "Date": "2019-09-23T15:42:19.000Z",
          "Titre": "Promised and delivered",
          "Contenu": "Promised and delivered!  Prompt service for a small order. Didn’t have to order a minimum of 100 as with most other companies.  Shipping was a little expensive, otherwise, totally satisfied!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rosemary B. Matney",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T11:23:26.000Z",
          "Titre": "Quick and Communicative"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2018-02-06T23:54:54.000Z",
          "Titre": "Electronic Samples & Shipping Costs",
          "Contenu": "Had some issues with agreeing to send samples of electronics to verify quality; but samples did arrive.  Also issues over shipping charges, which are much more than what i see elsewhere."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott Ferguson",
          "Nb_Reviews": 1,
          "Date": "2020-10-21T16:26:56.000Z",
          "Titre": "Great product despite delivery delay",
          "Contenu": "Delivery of the masks we ordered was delayed, but we understand it's a challenging time for everyone. The product is great; our event logo is wonderful on the masks."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matt K.",
          "Nb_Reviews": 1,
          "Date": "2022-08-23T15:39:48.000Z",
          "Titre": "Overall good",
          "Contenu": "Overall good!  Joseph was very responsive when asked questions.   Finished product turned out good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ashley",
          "Nb_Reviews": 1,
          "Date": "2019-12-19T21:37:08.000Z",
          "Titre": "They were very thorough with the…",
          "Contenu": "They were very thorough with the details of our order. As soon as the logistics were completed it was a quick turn around to product in hand. Overall very nice and courteous."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Luke Thompson",
          "Nb_Reviews": 1,
          "Date": "2018-07-07T15:24:14.000Z",
          "Titre": "Flashbay was very quick and thorough…",
          "Contenu": "Flashbay was very quick and thorough with my request and manifested great communication.  The only negative was recieving too many \"reminder\" emails to post this review."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Geneal Thompson",
          "Nb_Reviews": 2,
          "Date": "2021-05-11T04:12:29.000Z",
          "Titre": "Efficiency",
          "Contenu": "I am happy with the product, the fast delivery, the packaging, and the efficiency of Mark in helping me make my way through the ordering process.  Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Emily Lloyd",
          "Nb_Reviews": 1,
          "Date": "2022-05-19T16:20:32.000Z",
          "Titre": "Overall these look great",
          "Contenu": "Overall these look great! The bubbles are a little more opaque than I realized, but our logo is clean and clearly legible!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rick Delpra",
          "Nb_Reviews": 1,
          "Date": "2020-02-19T11:09:04.000Z",
          "Titre": "We have received our order in a timely…",
          "Contenu": "We have received our order in a timely manner and are happy with the appearance. We have not check functionality at this point but are happy with the overall product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Derek McGee",
          "Nb_Reviews": 2,
          "Date": "2021-02-01T07:27:59.000Z",
          "Titre": "FlashBay offers quality samples of its…",
          "Contenu": "FlashBay offers quality samples of its products, which helps to better understand what people need. FlashBay has first-class products and customer service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Maria Vela",
          "Nb_Reviews": 1,
          "Date": "2018-08-29T17:55:34.000Z",
          "Titre": "Excellent Service",
          "Contenu": "Thank you for all your help. The order was received. We are pleased with your excellent service and the quality of your product. For sure, you will heard from us again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Staci Briggs",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T20:26:24.000Z",
          "Titre": "Rachel Gutierrez is AMAZING",
          "Contenu": "Having Rachel Gutierrez as my sales representative made the process easy and stress-free! Rachel followed up frequently, and created image proofs with each email interaction as she understood more of what we were looking for. We talked for a whole month until purchase was made in early December. She was polite and followed up regularly when I got busy and at times forgot to answer her! She was patient and helpful throughout."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Returning Customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T00:01:06.000Z",
          "Titre": "Awesome Customer Service",
          "Contenu": "Awesome follow-up, amazing customer service, very short lead times, great communication, fast shipping, solid products.. I could go on all day about the \"pro's\" and not 1 \"con\""
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keisha Hoar",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:14:34.000Z",
          "Titre": "I want to thank the Flashbay team",
          "Contenu": "I want to thank the Flashbay team, especially Ellie. She made my ordering super easy. I am looking forward to working with her and her team again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Twana Black",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T17:00:22.000Z",
          "Titre": "Awesome experience and affordable transaction!",
          "Contenu": "Brain Truoung was awesome.  He walked our organization through the purchasing process and gave us options. It was a very smooth and QUICK transaction!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Lane",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T18:39:34.000Z",
          "Titre": "Ellie was very kind and helped me along…",
          "Contenu": "Ellie was very kind and helped me along every step of the process. These cups are Christmas presents for individuals with disabilities at my workplace and I couldn't have asked for a better sales representative to speak to."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aristotle Miller",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T04:31:12.000Z",
          "Titre": "Good Service, Staff Very Helpful",
          "Contenu": "I was satisfied with the product and found the staff to be very attentive and accommodating. They were there to help with any questions or issues I had, and made it very easy to place my custom order."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TES",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T08:07:44.000Z",
          "Titre": "Great product at a great price!",
          "Contenu": "Great product at a great price!I think my expectations were low given the price I received.  I was very pleasantly suprised when my tumblers arrived each individually boxed looking quite nice.  My experience with my customer service agent was also quite good as he gave me a few different options and worked with me to get to the right product.  Very pleased!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T00:02:22.000Z",
          "Titre": "Sales helped guide me on the best…",
          "Contenu": "Sales helped guide me on the best choice for our project.  They were extremely fast with making edits to proofs too!  The final product is perfect!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joyce Sanchez",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T22:49:17.000Z",
          "Titre": "Amazing customer Service and Quality Products",
          "Contenu": "Navigating purchases on my own has often posed challenges for me, but thanks to Brian, every transaction concludes seamlessly. Our company has engaged with Flashbay twice, and each experience has underscored the exceptional quality of their products, from the devices themselves to the imprints that adorn them. Flashbay stands out as an outstanding company, and our allegiance to them remains unwavering as we consistently turn to them for our Solar Powered Charging Banks. The sheer excellence of these products has captivated not only our team but also our clients, who express their admiration regularly. Flashbay's Solar Powered Charging Banks are nothing short of amazing, leaving an indelible mark on both us and those we serve."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melissa Lee",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T18:42:02.000Z",
          "Titre": "Fast and Easy",
          "Contenu": "It was easy to order and I received my product quicker than originally anticipated. The item looks great and am pleased with the quality."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jarrid Gross",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T19:17:08.000Z",
          "Titre": "Excellent Customer Service!!!",
          "Contenu": "Matt was very helpful in choosing our product and was very quick to help with questions and getting quotes. The delivery was quick and the process was great. Nice work!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Monica Schoch-Spana",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T00:38:34.000Z",
          "Titre": "Jill - best communicator ever!",
          "Contenu": "Jill, the principal sales account manager with whom I interacted, was an incredible Flashbay representative! She was knowledgeable about the products, swift and thorough when answering my questions, adept at following up in a timely manner, and fully focused on supporting my decision-making and final order. This was one of the best customer service experiences I have ever had! I highly recommend this company - they clearly make working with their customers a top priority."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robin",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T21:36:14.000Z",
          "Titre": "Ellie was responsive and promptly…",
          "Contenu": "Ellie was responsive and promptly prepared our order, got it in production, stayed in touch during the process and contacted me on the day we received it to make sure it was correct and we were happy.  Top notch service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lindsey Leason",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T00:37:34.000Z",
          "Titre": "Max from Flashbay reached out and…",
          "Contenu": "Max from Flashbay reached out and answered my questions about the products and provided me with a very informative sheet about the product I was interested in. He also helped me meet my intended budget. The product arrived right on time and everyone in my company like it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lauren",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T23:06:31.000Z",
          "Titre": "Efficient, affordable, great product",
          "Contenu": "Donovan was extremely efficient and helpful as I was ordering wireless chargers for my companys holiday gifts. The process could not have been smoother and the product came out great! Shipping was so quick and easy. Thanks again Donovan!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Josh Wieller",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T22:39:42.000Z",
          "Titre": "Amazing, amazing, amazing!!!",
          "Contenu": "I searched a bunch of different vendors but at Flashbay I received clear and concise quoting, a sample/demo pack the very next day, top level customer service, quick proofs and an amazingly quick turnaround and fair pricing. There is no reason not to use Flashbay. They secured a repeat customer."
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Umar adam",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T11:22:05.000Z",
          "Titre": "Hi junk ejjey you sir have money for…account",
          "Contenu": "Hi this is new product of America design Jersey man ut arsenal Liverpool real Madrid Barcelona FC Manchester city any of Jersey"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "anon",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T00:13:42.000Z",
          "Titre": "great experience",
          "Contenu": "Flashbay was great, especially Nick M. He was super responsive and friendly, got a proof of what I wanted super quickly, and was open to suggestions or changes if needed. The proofs looked great, exactly what we wanted, and he sent us two sample mugs so we could see what the mug would be like. It was easy to ask for a quote, approve the design, and place the final order, and Nick checked in every step of the way to keep us updated on what was going on and see if we had any questions. Mugs just arrived and they look great, exactly like the proofs. Great experience and will definitely order again if I need any more personalized staff gifts."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terrie",
          "Nb_Reviews": 3,
          "Date": "2023-12-15T20:15:29.000Z",
          "Titre": "Very simple to place and order",
          "Contenu": "Very simple to place and order, products are great, and our account representative, Marcus Quincy, is easy to work with and makes sure our account is handled smoothly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Heather F.",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T20:57:58.000Z",
          "Titre": "Great Customer Service and Product",
          "Contenu": "Casandra was wonderful! She helped me to understand my options and worked through multiple proofs to get to the final design I was happy with. Just got my shipment and I love the insulated water bottles I ordered. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Betty Odunayo",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T05:55:31.000Z",
          "Titre": "I loved working with Ellie",
          "Contenu": "I loved working with Ellie, she was very patient and helpful. Samples came very fast and it was easy to make decisions because she was very hands on. I love that she responds to her emails very quickly. I will definitely order here again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marlen Moya",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T20:48:42.000Z",
          "Titre": "Brian was really patient and very…",
          "Contenu": "Brian was really patient and very helpful. He was responsive and quick. The cups arrived in good shape and arrived ahead of scheduled time 😊"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kateryna G",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T21:15:20.000Z",
          "Titre": "Exceptional Branding Service by Donovan: Perfect, Polite, and Satisfying",
          "Contenu": "Donovan did an outstanding job with the branding of goodies for my company. His work was perfect and he was consistently polite throughout the process. We are genuinely satisfied with both the quality of his work and the level of service he provided."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jane paulk",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T20:03:24.000Z",
          "Titre": "Very nice website to shop online…",
          "Contenu": "Very nice website to shop online Galatea like phone,laptop and any more best service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mitch S.",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T05:59:50.000Z",
          "Titre": "This was a great experience overall",
          "Contenu": "This was a great experience overall. Jill was very helpful in answering questions and getting me a samples that arrived surprisingly fast. The products are high quality and the branding looks clean and sharp. They have a great selection of options too. Highly recommend Flashbay."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susie Craft",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T18:25:50.000Z",
          "Titre": "My sales account manager",
          "Contenu": "My sales account manager, Matt Kusanovich, is wonderful to work with.  He is very quick with responding and we have been very pleased with the product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shannon Bone",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:56:54.000Z",
          "Titre": "Wonderful Costumer Service",
          "Contenu": "Wonderful Costumer Service! Fast shipping and easy to order from."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yulia Ovchinnikova",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T04:11:47.000Z",
          "Titre": "Great Service",
          "Contenu": "Great communication, everything what I ordered came out nicely, very fast produced and delivered."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Douglas Clemens",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T14:26:08.000Z",
          "Titre": "I requested a quote on Sunday and…",
          "Contenu": "I requested a quote on Sunday and received a phone call early Monday morning. For those of us who don't sit in front of a computer for work, having a live person call and listen to my needs was important. Flashbay was very professional, timely and informative. I recommend this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julian Saria",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T21:25:49.000Z",
          "Titre": "Eric Hoecker is the reason my…",
          "Contenu": "Eric Hoecker is the reason my expereince was great.  By far the most prompt and helpful salesperson I've ever had the pleasure of working with - this guy is a treasure!"
        },
        {
          "Note": 5,
          "Lieu": "HK",
          "Pseudo": "万晓芯",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T12:28:19.000Z",
          "Titre": "Good",
          "Contenu": "I am very satisfied with the product and service, it helped me a lot."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Briana Vanderwiel",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T22:51:33.000Z",
          "Titre": "VERY HELPFUL",
          "Contenu": "Jill was very helpful in assisting me with our flash drive order. We went back and forth many times to decide on a size and qty of flash drives. Once we placed the order our shipment came in a very timely manner and was of great quality. We will be returning for more buisness."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brooks Harken, ABVI",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T23:22:22.000Z",
          "Titre": "GREAT JOB!!",
          "Contenu": "GREAT JOB!!The team was incredibly helpful with our product ordering. Not only were they great with providing guidance while selecting the product and placing the order, but their response time was next level. It was wonderful to work with a new company that we will be using for all promotional products going forward. As a non-profit, it is important to work with a company that doesn't overcharge and provides you excellent customer services. Well done to Donovan and his team!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julie Lamb",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T18:57:12.000Z",
          "Titre": "Amazing product and customer service!!!",
          "Contenu": "Never having ordered through this company before, it was the best experience!  Ellie helped me through the process from start to end.  She was very patient with myself, and our staff waiting for numbers and approving designs.   Normally when I order through somewhere I have never dealt with before, I am nervous about getting the final product.  The product was everything Ellie promised, and we could not be happier!!  We will be returning to this company for future needs!!   Thank you so much Ellie!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sheena",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T18:00:07.000Z",
          "Titre": "Great product and great employee!",
          "Contenu": "I was handed a project after a coworker left and was given little instruction as to what was going on. When I tell you that Donovan Rains was beyond helpful, throughout the entire process, that is still an understatement. Not only was he attentive, quick to reply, quick to act and incredibly knowledgeable but did so while being both personable and professional. Then on top of it all our products came out beautifully and we cannot wait to give them out at our upcoming company party. 5 star product and 5 star customer service. We will be using them for our needs in the future!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cara Pacholski",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T16:10:25.000Z",
          "Titre": "Great Service",
          "Contenu": "Quick responses, fast turnaround and a great product that I received."
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "randol gregor",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T12:35:30.000Z",
          "Titre": "Exceptional Service and Quality Products from Flashbay",
          "Contenu": "I recently had the pleasure of working with Flashbay, and I must say that my experience was nothing short of outstanding. From their impressive range of customizable promotional products to their unparalleled customer service, Flashbay truly sets the standard for excellence in the industry.One of the standout features of Flashbay is the diverse selection of high-quality products they offer. Whether you're looking for custom USB drives, power banks, or even wireless chargers, Flashbay has a comprehensive catalog that caters to a wide range of promotional needs. The products are not only stylish and functional but also built to last, reflecting the company's commitment to delivering top-notch quality.What truly sets Flashbay apart, however, is their dedication to customer satisfaction. Throughout the entire process, from product selection to delivery, the Flashbay team demonstrated exceptional professionalism and efficiency. They were responsive to my inquiries, providing valuable insights and guidance to ensure I made informed decisions. The level of personal attention I received made me feel like a valued customer, and it's evident that Flashbay places a strong emphasis on building lasting relationships.Moreover, the customization options offered by Flashbay are impressive. The online design tool is user-friendly, allowing me to create a product that perfectly aligned with my brand's identity. The attention to detail in the customization process was commendable, resulting in promotional items that not only showcased my brand but also exceeded my expectations.The ordering and delivery process was seamless, with Flashbay delivering on time as promised. The products arrived in pristine condition, securely packaged and ready to make a lasting impression on my clients and colleagues. The overall experience was so positive that I will undoubtedly turn to Flashbay for all my future promotional product needs.In conclusion, Flashbay stands out as a company that excels in both product quality and customer service. Their commitment to excellence, coupled with a diverse and customizable product range, makes them a top choice for anyone seeking premium promotional items. I wholeheartedly recommend Flashbay to businesses and individuals looking to make a lasting impression with high-quality, personalized products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julie R",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T16:03:46.000Z",
          "Titre": "Jill K was so helpful to work with",
          "Contenu": "Jill K was so helpful to work with. This was a last minute order, she got our logo artwork uploaded quickly (and then corrected, after I sent her the wrong one) and I received our solar chargers - 125 of them - well before the date I requested!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valerie Billings",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T18:59:56.000Z",
          "Titre": "Alex was very attentive and helpful",
          "Contenu": "Alex was very attentive and helpful. He sent me ton's of information and helped me on deciding what would work in my retail shop."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Esther Acevedo",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T22:11:55.000Z",
          "Titre": "Exceptional Support & Order Processing",
          "Contenu": "We ordered tote bags for an event that was just over a week away and received prompt replies as well as modifications to our logo. Our order came in well before the anticipated deadline and the bags came out beautifully and better than we could have hoped for. From start to finish, we were beyond impressed and FlashBay will be our go to company for future merchandise purchases!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angela Tran",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T21:26:42.000Z",
          "Titre": "Great quality",
          "Contenu": "Hi Jill, We recently had the pleasure of experiencing Jill's outstanding service, and we couldn't be more impressed! From the moment we placed our order for water bottles, Jill's swiftness in getting them to us was truly remarkable. Jill's efficiency stood out right from the start. Our order was processed promptly, and within no time, she ensured that our water bottles were on their way to us. This level of responsiveness is a rarity and certainly made our experience with her stand out. Not only was Jill quick in delivering the goods, but the quality of the water bottles exceeded our expectations. The bottles were sturdy and well-printed. Thanks,"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Richter",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T20:35:25.000Z",
          "Titre": "Excellent Service & Promotional Item",
          "Contenu": "I worked with Sierra from start to finish and it was a great experience. I love the result which was a branded key chain USB/USB-C flash drive. It's a promotional tool for networking of my consulting practice."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ro",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T20:24:26.000Z",
          "Titre": "Amazing would buy again!",
          "Contenu": "Connor from Flashbay helped me with everything. He ensured correct design, great price and even helped me sort out delivery to my expo venue.Our expo guests loved the solar powered powerbanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Betz",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T23:58:19.000Z",
          "Titre": "Alex White was detailed",
          "Contenu": "Alex White was detailed, attentive, communicative and had terrific follow-thru!  And the end result is just what I wanted!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicole Kiernan",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T15:51:41.000Z",
          "Titre": "Excellent Service",
          "Contenu": "Rachel and her team did an amazing job! I changed my design idea multiple times and each time, Rachel quickly turned on the updated version. The end product looks great! Couldn't be happier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Walter",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T22:43:11.000Z",
          "Titre": "I needed branded merchandise and was blown away!",
          "Contenu": "I needed to order a lot of branded swag in a very short amount of time, and I reached out to Flashbay.  My account manager, Brian Truong, went above and beyond in helping me choose the correct products, but also made sure that everything went smoothly and he kept me in the loop every step of the way.  I received my product earlier than promised, and it exceeded my expectations.  I will absolutely be reaching out to Brian and Flashbay the next time I need branded items for any of my upcoming events."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mayron Guerrero",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T01:09:59.000Z",
          "Titre": "Will definitely work with them in the future",
          "Contenu": "Very easy communication, our sales representative Alex White took good care of our order from the very beginning until we received it, making sure everything was alright.Quality of product top notch!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Heather D.",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T17:57:25.000Z",
          "Titre": "Great Quality & Customer Service",
          "Contenu": "Working with Ellie was awesome! She's definitely on top of making sure you feel good about your purchase before you place an order. Follows up with phone calls, which I love. Our pens and flash drives are very high quality we feel good about handing to our customers and partners."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ren Meixner",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T21:09:12.000Z",
          "Titre": "Non Profit Repeat Customer!",
          "Contenu": "I had a great experience. From the very beginning, Matt helped me through the design (and redesign) process and kept me updated through production and shipping. When it came time to reorder, I went directly to him, and he remembered me and was excited to help. Flashbay makes a quality product, delivers it well, and hires quality people to help get it to you!"
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "Faiz Abbas",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T07:40:27.000Z",
          "Titre": "BEst in the world to be Revolution…",
          "Contenu": "BEst in the world to be Revolution Digital techno"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Meridian Blue Construction",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T17:37:39.000Z",
          "Titre": "Consistency and Quality",
          "Contenu": "Working with Flashbay was wonderful - from customer service to the quality of the product, it truly was a great experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Megan Strobel",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T20:05:46.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "Can't stress how nice it was to be able to talk to a real person on the phone and have all of my questions answered quickly. Flash drives were just what we needed and the process was very simple and efficient from start to finish- I would recommend Flashbay!"
        },
        {
          "Note": 5,
          "Lieu": "EG",
          "Pseudo": "mostafa kamal",
          "Nb_Reviews": 3,
          "Date": "2023-12-17T13:31:02.000Z",
          "Titre": "very  good website and i try that to…",
          "Contenu": "very  good website and i try that to try the gaming system"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lori Gardiner",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T20:01:39.000Z",
          "Titre": "Ellie was a pleasure to work with…",
          "Contenu": "Ellie was a pleasure to work with ordering my new flash drives. I will definitely work with her again in the near future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gopi Reddy",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T07:01:39.000Z",
          "Titre": "Rachel's diligence and professionalism",
          "Contenu": "I was amazed by Rachel's diligence and professionalism. She offered two layouts for the logo on the bottles and accommodated multiple updates (color changes) to the logo.  When presented a lower-price quote from a competitor, she reduced the price a little and explained why she couldn't match their price.  And the bottles arrived ahead of the promised time.To the management:  You may have to do some competitive analysis starting with pens.com and see why their prices are a lot lower.  I approached Flashbay only because pens.com could not promise the expected delivery date."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lindsay Wood",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T00:12:01.000Z",
          "Titre": "Great experience!",
          "Contenu": "Our rep, Marcus sent us a very organized product sheet directly to our email, which made things easy from the get-go. A lot of merch wholesale sites are too busy and confusing to navigate. Our rep was quick to answer all of our questions, and I love the sample photos that were created with our logo. It gave us a great view of what to expect. The production and shipping turnaround time was quick and flawless. We'll certainly order from Flashbay again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nick",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T20:44:22.000Z",
          "Titre": "Happy with our experience",
          "Contenu": "Conor was helpful and provided all the information we needed in a timely manner. Product looked great, turned out as requested."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sue M.",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T16:37:58.000Z",
          "Titre": "Everything was great! :)",
          "Contenu": "Justin was fantastic throughout the entire process! He made everything easy for me on my side. The water bottles we ordered came out exactly how we wanted, I know the company will love them. Thank you again for your help, Justin!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dillon w/ Data I/O",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T01:53:56.000Z",
          "Titre": "Conor Kennedy stepped up and help me…",
          "Contenu": "Conor Kennedy stepped up and help me place my order. With quick responses and accurate knowledge we were able to get my custom order placed and shipped immediately! 10 out of 10 will be working more often with Conor."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Craig Speirer",
          "Nb_Reviews": 4,
          "Date": "2023-11-20T23:08:31.000Z",
          "Titre": "Flashbay Nailed My Order",
          "Contenu": "Flashbay made concessions so that I could make sure I was ordering what I wanted and it worked out very well.  Extremely pleased with the process, time frames, prices, and products I received."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sherri F. no full name",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T21:36:34.000Z",
          "Titre": "Excellent Service & Quality",
          "Contenu": "Customer service was great and speedy. I broke the free sample they sent me and received another one the next day. The quality of the item I purchased in bulk was great. I will definitely continue working with Flashbay and hope they continue expanding their offering!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Burck Schellenberg",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T23:33:05.000Z",
          "Titre": "Ellie",
          "Contenu": "Ellie, the agent who helped me, was so super attentive for my small project that I was just blown away.  She help me clarify what I was looking for and won a customer for life"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T20:23:06.000Z",
          "Titre": "Easy to use and very fast…",
          "Contenu": "Flashbay has a very simple user interface, and very responsive and helpful staff to assist in project design and ordering. After a few different orders I’m still surprised at how quickly custom items in bulk can be had."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Regular Fit LLC",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T14:54:33.000Z",
          "Titre": "Excellent product and service!",
          "Contenu": "Lane was so helpful to answer all my questions and the quick turnaround time was just what I needed ahead of the holiday season! I placed my order, payment and delivery, all within less than a week!! The quality of product was amazing too! will definitely be a return customer!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James L Armstrong",
          "Nb_Reviews": 3,
          "Date": "2023-10-16T20:50:08.000Z",
          "Titre": "Great experience with knowledgeable…",
          "Contenu": "Great experience with knowledgeable staff and quick product fulfillment time! Olivia was both kind and knowledgeable on all product offerings and did everything she could to not only get me prices but also samples of these items so that we could make an informed final decision. We will definitely be purchasing from Flashbay again in the near future!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristie Misiak",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T18:36:52.000Z",
          "Titre": "Excellent customer service all around",
          "Contenu": "Very professional, quick to respond (backups included). Provided excellent service and assistance with graphic proofs to make certain QR is legible/readable"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan Waldron",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T14:42:40.000Z",
          "Titre": "It's hard to feel like you are getting…",
          "Contenu": "It's hard to feel like you are getting a personalized, in-person, customer experience over the phone and email. But Max with Flashbay did just that! Excellent customer service, great customization process, and speedy delivery at each step! Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sierra M",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T21:54:11.000Z",
          "Titre": "Flashbay is our Go-To!",
          "Contenu": "Flashbay was awesome and very attentive. Our samples were in hand the very next day and the customized pieces we ordered were there within a week. They called to confirm and were responsive to all our questions. We will definitely be using them in the future. 10/10 recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathy Hrabovsky",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T01:04:08.000Z",
          "Titre": "Our AMAZING Flashbay Rep",
          "Contenu": "Our Flashbay Rep, Alex White, was attentive & proactive without being annoying! We were able to work together efficiently to bring our order to fruition! Alex was extremely patient & understanding in placing an order with a grant funded, nonprofit! Thank you Alex & Flashbay Team! Best - Kathy (412-953-5202)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Sells",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T00:04:45.000Z",
          "Titre": "Beatrice Dizon made the process very…",
          "Contenu": "Beatrice Dizon made the process very easy. She emailed the logo very fast and the drives arrived and were perfect. Great job."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan Brady",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T01:10:33.000Z",
          "Titre": "Randall went the extra mile to make…",
          "Contenu": "Randall went the extra mile to make sure our bottles looked great and were exactly what we wanted. Great customer service. Great product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elena Amaro",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T20:29:07.000Z",
          "Titre": "Flashbay is great",
          "Contenu": "Flashbay is great! They are very responsive, accurate with my order request, and shipped my product out quickly! I will definitely continue to do business with them!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arin Alexander",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T01:07:27.000Z",
          "Titre": "Great and smooth process",
          "Contenu": "Great and smooth process. Max was very friendly and welcoming and was eager to make the deal happen.I would definitely recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paige Chase",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T22:18:49.000Z",
          "Titre": "Fast and Quality Service",
          "Contenu": "From first inquiry to even after final delivery Max was on top of it! He responded quickly and professionally. He answered any and all questions, even ones I thought were ridiculous of me to be asking. Service was fast and the branded water bottles are outstanding. The quality of the water bottle and the logo wrap are more then I anticipated. Max quickly sent out samples for us to look at and feel before even ordering. Being in Alaska we are use to being treated like a third world country by the postal service, we however received all our good before they were anticipated. Max kindly reached out after delivery to make sure we were satisfied with our order."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mal`akh Richard Rollins",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T17:51:04.000Z",
          "Titre": "FLASHBAY equals Perfection",
          "Contenu": "What made my experience great, you ask? 1st up Eric, and all the sales staff, and your high-end quality products. Everyone’s courteous and professional to the 3rd degree. Each time a production studio or Podcast speaker opens up my presentation and holds and views my eBook, your (flash drive,) they’re are impressed.  It took my artwork, and your company, who in turn took my artwork and placed it so precisely on the flash drive, making my eBook stand out above the rest. So, each time I send out my eBook, Flashbay represents.  I highly recommend Flashbay products. I'll never use another company, why fix something that works?                         Mal`akh Richard Rollins"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Landon Smith",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T17:07:44.000Z",
          "Titre": "Excellent Experience and Great Finished Product",
          "Contenu": "I worked with Alex White and he was great to deal with.  I gave him a general idea of what I was looking for.  He made recommendations and provided digital samples almost instantly.  He offered physical samples but with my time crunch I opted to pass.  He wasn't pushy towards one particular product, he just provided insight as what would work best with my logo.  In the end, I trusted Alex's expertise and it came out perfect.  I will definitely come back to him again!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Aakash Jain",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T13:27:11.000Z",
          "Titre": "Great Product.",
          "Contenu": "Great Product.I have been a loyal customer for a long time and I am very satisfied with its quality and performance."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard P.",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T20:14:44.000Z",
          "Titre": "Happy First-time Customer",
          "Contenu": "We just received shipment of our first time order with Flashbay.  The customized water bottles look great.  The customer service was outstanding from beginning to end. The product is high quality as is the screen printing. The processes to proof the order and make payment were very simple.  We're happy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Suzanne Stone - The Pinehills",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T19:33:55.000Z",
          "Titre": "Always a pleasure to work with Flashbay…",
          "Contenu": "Always a pleasure to work with Flashbay and in particular, our rep Conor Kennedy.  Our company has used them for branded flash drives for years.  From friendly reminders/check-ins to fast delivery, we are always happy with our order and experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CM",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T16:43:14.000Z",
          "Titre": "Great customer service and product",
          "Contenu": "Great customer service - made sure our product came on time even with a quick turnaround. Additionally, the product turned out great - very happy with the result!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "River T.",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T21:25:28.000Z",
          "Titre": "Quick, Easy, and High Quality",
          "Contenu": "From the time we submitted the request, the outreach and production process was quick and easy. Our rep, Justin, was incredibly prompt and attentive to what we needed and did such a great job taking care of us. We will definitely recommend and utilize flashbay in the future!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alyssa Holland",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T18:21:23.000Z",
          "Titre": "I love working with Flashbay!",
          "Contenu": "I love working with Flashbay! They are dedicated to providing high quality materials at a reasonable cost and in a timely manner. They are happy to work with you to meet your deadline, no matter how urgent, and are very responsive throughout the process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christy Fleming",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T22:33:35.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "Ellie went above and beyond to make this a seamless purchase. Happy with entire process of working with Flashbay."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larissa Belsky",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T20:54:29.000Z",
          "Titre": "Sierra did a great job navigating us…",
          "Contenu": "Sierra did a great job navigating us through the buying process to ensure our shipment was delivered on time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Austin Holian",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T21:32:20.000Z",
          "Titre": "My contact Hieu Truong went above and…",
          "Contenu": "My contact Hieu Truong went above and beyond in terms of service. We were able to get an order to its destination on time, even after several edits.  His communication was key throughout my rush.  I fully recommend Flashbay."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Biros",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T18:42:27.000Z",
          "Titre": "Great experience and a really nice…",
          "Contenu": "Great experience and a really nice quality wireless charger. Clients will see our brand everyday on their desk."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Heather Long",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T15:55:33.000Z",
          "Titre": "Fast and Helpful",
          "Contenu": "I called and needed assistance to place a new order. The gentleman helped me right away and got what I needed in just a few minutes. The order was placed that day."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Prakash Parmar",
          "Nb_Reviews": 2,
          "Date": "2023-10-09T15:49:12.000Z",
          "Titre": "I recently had the pleasure of…",
          "Contenu": "I recently had the pleasure of acquiring custom USBs from Flashbay, and I can't speak highly enough of my experience. From start to finish, it was exceptional. The product itself met all my expectations, and I was pleasantly surprised by the speedy delivery. Flashbay went above and beyond, and I have every intention of ordering from them again in the future. Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Myca EL",
          "Nb_Reviews": 2,
          "Date": "2023-11-26T02:51:57.000Z",
          "Titre": "Fantastic online presence",
          "Contenu": "I love the online presence and their catalogue. Excellent service. Flashbay  should keep it up."
        },
        {
          "Note": 5,
          "Lieu": "KE",
          "Pseudo": "geoff njuguna",
          "Nb_Reviews": 9,
          "Date": "2023-12-09T00:23:53.000Z",
          "Titre": "Got the best matchine Know working with…",
          "Contenu": "Got the best matchine Know working with confidence."
        },
        {
          "Note": 5,
          "Lieu": "JM",
          "Pseudo": "Kavaughn Williams",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T03:54:08.000Z",
          "Titre": "Customized Flashdrive is the way to go",
          "Contenu": "Customized Flashdrive is the way to go. I was satisfied with the experience and would recommend it to anyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jesse Brede",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T23:01:25.000Z",
          "Titre": "Solid product and customer service",
          "Contenu": "Solid product and customer service. We will use them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trae Dilley",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T23:40:30.000Z",
          "Titre": "Olivia was very helpful in getting me…",
          "Contenu": "Olivia was very helpful in getting me proofs on a timely manner. Olivia was very respectful and easy to communicate with. Best part is that she was willing to work with us on other projects/events."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Happy Customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T16:52:20.000Z",
          "Titre": "Happy Customer",
          "Contenu": "Olivia was very helpful and professional, making sure I was happy with my order!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 2,
          "Date": "2023-10-16T18:14:06.000Z",
          "Titre": "WIll use again",
          "Contenu": "Ellie was timely, friendly, offered appropriate advice and recommendations, and the design work was quick and accurate.  Product arrived as promised in just a few days from order.  I plan to use Ellie and FlashBay again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Reilly Jones",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T01:41:02.000Z",
          "Titre": "Fabulous Experience",
          "Contenu": "Conor was very responsive and helpful. Items looked as promised and came quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jodie Tharp",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T15:38:29.000Z",
          "Titre": "As expected and fast.",
          "Contenu": "Flashbay provides a quality product at competitive prices.  The turnaround time was nearly immediate.  I fully recommend FlashBay."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Claudia Del Valle",
          "Nb_Reviews": 2,
          "Date": "2023-10-16T17:56:09.000Z",
          "Titre": "Olivia",
          "Contenu": "Olivia, Was fast to respond and made the process very smooth. We appreciate all her efforts to ensure that we got the best customer service possible.  It was a pleasurable experience, doing business with her and Flashbay!"
        },
        {
          "Note": 5,
          "Lieu": "KE",
          "Pseudo": "briton otara",
          "Nb_Reviews": 2,
          "Date": "2023-10-27T14:06:41.000Z",
          "Titre": "Flashbay are reliable for providing…",
          "Contenu": "Flashbay are reliable for providing high quality materials and it’s pocket friendly. They are very responsive and fast making sure you are convenient throughout the process. I consider flashbay to make more orders in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Serena Verlin",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T23:56:45.000Z",
          "Titre": "Conor was amazing",
          "Contenu": "Conor was amazing, with all my multiple requests, the speed and quality of our on the product was extremely impressive.   They are definitely a company I would use again."
        }
      ]
    }
  ]
}