{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.crowdbotics.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MH",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T18:44:34.000Z",
          "Titre": "Avoid Crowdbotics",
          "Contenu": "1. Misleading Representation:I entered into an agreement with Crowdbotics based on their claim that they possessed the necessary capabilities to develop the project I requested. However, soon after the payment was made, I was informed that the desired project was beyond their scope. This discrepancy in representation misled me and eroded my confidence in Crowdbotics' integrity.2. Extended Project Timeline:Initially, I was informed that the project would be completed within a reasonable timeframe of approximately 5 months. Regrettably, despite more than a year of collaboration, not a single item outlined in the Product Requirement Document has been accomplished. This excessive delay demonstrates a lack of commitment to meeting agreed-upon deadlines.3. Inadequate UI Design Contribution:A significant portion of the UI design was undertaken by myself rather than Crowdbotics, indicating afailure to fulfill the obligations outlined in our agreement. This lack of input from their side undermines the value and quality of the services I expected from Crowdbotics.4. Frequent Team Personnel Changes:Throughout the course of our engagement, there have been multiple instances of team personnelchanges, leading to inconsistencies and disruptions in the project's progress. These changes havehindered effective communication, impeded knowledge transfer, and further contributed to the project'sstagnation.5. Harassment for Payment:I have experienced persistent harassment from Crowdbotics regarding payment for upcomingmilestones, despite the fact that the initial milestone outlined in the agreement remains incomplete.This pressure to pay for unfinished work is unacceptable and suggests a lack of professionalism and disregard for our contractual terms.6. Ignored Feedback:Repeatedly, my feedback and suggestions for each iteration of the build have been ignored,demonstrating a failure to incorporate client input into the development process. This disregard forfeedback severely hampers the collaborative nature of our engagement and undermines the likelihoodof achieving a satisfactory outcome.Please note that this review reflects my personal experience and opinion as a dissatisfied client. Your experience with Crowdbotics Corporation may vary."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "m Performance",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T15:49:50.000Z",
          "Titre": "Scammers be aware!!",
          "Contenu": "Scammers be aware!!! You will not be able to call or contact the supervisor. There is no number to call. When I asked Jovana for her supervisor's phone number she just said no. This is an insane company. I paid 2800$ upfront to complete the app. They said they will complete it in 3 months so I should sign up for a premium subscription and I Will receive weekly updates. Well a year later 6500$ was Spent on their subscription, and with no weekly updates was very hard to contact them. They keep working on the wrong app that looks like 10 year old made it. They kept stretching the time so I could not call the bank and cancel . I keep telling them they are working on the wrong app, and they just tell me they will work on my app but they keep sending me after 3 months same app that is not functional nothing works. It is just 3 page simple app. Each time they convince me that they will work on the correct app so I don't cancel the subscription and when I ask for weekly updates they just come up with an excuse. Not worth the risk and programmers are from other countries that have very minimal skills or education in programming. Also, programmers are from high-risk scamming countries, this is a big security problem!! You can get a better job done from youtube tutorials. The company is clearly run by scammer criminals. Do not recommend risking getting scammed. Looks like I'm not the only one."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brian Henock",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T08:31:29.000Z",
          "Titre": "Time to Start Dev Needs to be Reduced",
          "Contenu": "I didn't like how long it took to get off the ground after I scoped a very small project for months and then paid to begin the feature. I was told that the ask was unclear and it was being investigated like it was a bug. It was not until I complained, that things moved forward. The project would have finished closer to my desired time if this did not happen. Once it was escalated and the development was under way, the rest of the process went smooth. From there the team was attentive, helped resolve bugs and launch the feature in a timely manner."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris Stallkamp",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T01:03:53.000Z",
          "Titre": "Bad experience initially... greatly improved since",
          "Contenu": "Crowdbotics is a one stop shop for getting your app built and operating. They helped me create a music discovery app. My recent experience with them has been outstanding, and I couldn't be more pleased with the final product. I had many issues early on, however it seems that those issues have been fixed. If the last 6 months are an indication of how Crowdbotics will continue to function, this would be an easy 5/5 review."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Trent Glaser",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T01:11:55.000Z",
          "Titre": "Project Manager was great",
          "Contenu": "Project Manager was great.  However, I wish they helped and communicated better once project was done."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Loudenback",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T18:53:55.000Z",
          "Titre": "Developed complicated dropshipping application",
          "Contenu": "I contracted Crowdbotics to build a complex dropshipping application for the Shopify app store. The app had many features and fairly complicated workflows involved, including numerous API calls and specific features needed for a dropshipping business. Crowdbotics built this for me at a solid rate - when the contract was signed a whole team was assigned to my app, which was very impressive. Communication was always quick and effective, and tasks were tackled in a very timely manner. My team was awesome to work with and always explained tasks clearly. The app is looking great and all features we could need are ready. Looking forward to launching it on Shopify shortly!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Nadjar",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T18:24:31.000Z",
          "Titre": "Team was responsive and enthusiastic",
          "Contenu": "Team was responsive and enthusiastic, felt like I was dealing with my company and not an outsourced team. Cared about the deadlines and the finished product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Salim",
          "Nb_Reviews": 2,
          "Date": "2023-05-04T23:27:18.000Z",
          "Titre": "Great Development Partner.   Crowdbotics management has gone beyond…",
          "Contenu": "Crowdbotics management has gone beyond the call of duty to make Hawa the Game a reality. Hawa LLC has done business with Crowdbotics for over 2 years. They are trustworthy, creative, helpful and reasonably priced. Couldn’t ask for a better development partner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zach McLeod",
          "Nb_Reviews": 1,
          "Date": "2023-05-06T21:36:07.000Z",
          "Titre": "Fantastic to work with!",
          "Contenu": "It has been an absolute pleasure to work with Crowdbotics. They do a fantastic job onboarding you and understanding the project that you need created. Every member of their team was exceedingly kind, and easy to work with. They built the product exactly to my specifications at what I think is an absolute steal of a price. I will certainly be working with them again for my next project."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elise Jones",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T02:30:46.000Z",
          "Titre": "Highly recommend!",
          "Contenu": "Since day 1, Crowdbotics has gone above and beyond to help us with our product. After a terrible experience with another company, they were able to give us what we were looking for in a long term partner. They are professional, trustworthy, and collaborative. Thank you, Crowdbotics!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ADHme App",
          "Nb_Reviews": 1,
          "Date": "2023-02-22T02:37:26.000Z",
          "Titre": "A GREAT DEVELOPMENT FIRM!",
          "Contenu": "I was literally shocked to see anything other than 5 star reviews because they made our dream app come to life. They were efficient, effective, and consistently went above and beyond. I've recommended to anyone who will listen!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jorge",
          "Nb_Reviews": 2,
          "Date": "2023-01-07T02:45:41.000Z",
          "Titre": "Turning My Ideas into Code",
          "Contenu": "Turning ideas into codeI have worked with the Crowdbotics team on numerous apps and projects.  They make the process of turning ideas into code as straightforward and inexpensive as possible.  The international team of engineers and designers take care of every aspect of the app development.  I am already planning my next app!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charmaine",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T20:00:57.000Z",
          "Titre": "I received feedback and responses…",
          "Contenu": "I received feedback and responses expeditiously? Great communication with first line customer service.  I realized late that I made a hasty decision and couldn’t commit and Crowdbotics was very understanding.  If and when I am ready to start the journey of creating my own app, I will be looking forward to working with them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Don",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T22:55:33.000Z",
          "Titre": "Our executive coaching and advisory…",
          "Contenu": "Our executive coaching and advisory firm sought a partner to develop software for our cutting-edge management tools. After an extensive vetting process, Crowdbotics emerged as the clear choice. One key factor that sets Crowdbotics apart is the team’s ability to understand and translate our needs. They ask the right questions to ensure that they have a fundamental understanding of our goals and requirements. The result has been a seamless collaboration on multiple products that align with our vision. We also appreciate Crowdbotics’ flexibility in terms of its pool of resources who can work on software projects across different disciplines. This allowed them to keep pace with our timelines, ultimately saving us time and money. We highly recommend Crowdbotics to any company in need of software development services. They are a reliable, professional and skilled team that will work tirelessly to bring your vision to life."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Benjamin",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T21:01:25.000Z",
          "Titre": "Crowdbotics is an incredible partner…",
          "Contenu": "Crowdbotics is an incredible partner for building an MVP. You truly get full support from a dedicated team, making it a collaborative experience. Chris, Zack, and Amir have been incredibly attentive and professional. Crowdbotics built our app, giving us total visibility and control over the code. I highly recommend them!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jorge",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T18:19:30.000Z",
          "Titre": "I have been working with Crowdbotics…",
          "Contenu": "I have been working with Crowdbotics for approximately five years on multiple different software, applications, and projects. They have been extremely helpful in turning my ideas into reality, and I’ll personally find the weekly meetings with the team, extremely valuable, educational, and productive!"
        },
        {
          "Note": 5,
          "Lieu": "BA",
          "Pseudo": "Vladimir Stević",
          "Nb_Reviews": 2,
          "Date": "2021-06-17T08:38:29.000Z",
          "Titre": "Working for CB is awesome experience",
          "Contenu": "Working for CB is awesome experience, people are helpful and whole process is really cool. Helped me learn a lot new stuff. :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Martin",
          "Nb_Reviews": 2,
          "Date": "2023-06-22T00:17:48.000Z",
          "Titre": "Responsive and dedicated to customer satisfaction",
          "Contenu": "Initially, our collaboration with CB was off to a promising start. However, as we approached 90% completion of the project, we encountered some challenges that caused progress to stall. We promptly raised these issues with CB, and they were proactive in addressing and resolving them. Consequently, we have been able to resume our collaboration and are now nearing the completion of our Minimum Viable Product (MVP).We remain committed to working with CB to leverage their services for scaling our product. Their expertise and support have been instrumental in bringing us to this point, and we believe that continuing this partnership will enable us to achieve our goals effectively.We appreciate CB's responsiveness and willingness to rectify the issues that arose during the project. It demonstrates their dedication to customer satisfaction and their commitment to delivering high-quality solutions. We have confidence in their ability to help us successfully launch our product and drive its growth in the market. We look forward to continuing this productive partnership and achieving our shared objectives."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "mayank kushal",
          "Nb_Reviews": 1,
          "Date": "2021-06-18T15:12:05.000Z",
          "Titre": "Awesome place for developers",
          "Contenu": "I have been working for Crowdbotics for the last 3 years, awesome place to work. They made working remote fun and a learning experience."
        },
        {
          "Note": 5,
          "Lieu": "BD",
          "Pseudo": "Mahbubur Rahman",
          "Nb_Reviews": 1,
          "Date": "2021-08-11T15:32:41.000Z",
          "Titre": "Great place to work",
          "Contenu": "Great place to work, glad to be a part of Crowdbotics. it made collaboration easier and more efficient, the Figma integration made it easier to turn beautiful designs into code"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 5,
          "Date": "2021-06-03T05:22:22.000Z",
          "Titre": "Mobile app development in record time—worth every penny!",
          "Contenu": "I had looked into \"do it yourself\" type mobile app development platforms to develop an app based on an idea for an educational tool. I contacted a number of companies, trying to save some money without sacrificing quality (sounds impossible, right). I came across Crowdbotics in mid-2020 but decided against them because of the monthly cost, although I was interested in their approach to developing mobile apps—they have a modular approach which seemed to be different from all others I checked out. After trying several platforms and not being satisfied with the results, I went back to Crowdbotics and arranged an initial meeting to discuss my app idea. They were professional, capable and willing to work with my budget. I agreed to work with them and within days, was assigned a project manager who scheduled a kickoff call to review the requirements of the app. After confirming the details, they started development. The project manager contacted me weekly and scheduled regular calls to keep me up to date and to show me the progress via live video chats and demonstrations. Her development team was very responsive. What impressed me most was how, after only 3 months, the app was up and running. The Crowdbotics team was communicative, keeping me informed with each step, and syncing regularly with me regarding milestones and timelines. Often, they kept me on track. In the end, they developed the app, based on my requirements, and did it in record time. They have a solid team and have been great to work with. I've been very pleased with the results and glad I went with Crowdbotics."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nat Holstom",
          "Nb_Reviews": 4,
          "Date": "2023-05-16T07:32:23.000Z",
          "Titre": "Thanks for working on my project",
          "Contenu": "Thanks for working on my project!  It took a long time but I'm really happy with the result. Coming back for v2 soon."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Helen",
          "Nb_Reviews": 1,
          "Date": "2023-05-28T17:30:01.000Z",
          "Titre": "The team I am working with is…",
          "Contenu": "The team I am working with is professional and thorough."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Reid Michalek, Safe Route",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T17:05:19.000Z",
          "Titre": "Safe Route",
          "Contenu": "The professionalism each individual portrayed during the calls as well as making all parties feel comfortable with what was being discussed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ana",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T16:42:08.000Z",
          "Titre": "Zach and aj have been so attentive and…",
          "Contenu": "Zach and aj have been so attentive and so professional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kameta",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T21:39:50.000Z",
          "Titre": "The response back the help from…",
          "Contenu": "The response back the help from Crowdbotics was timely and professional"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SEAN",
          "Nb_Reviews": 2,
          "Date": "2023-04-28T15:40:05.000Z",
          "Titre": "I felt understood and assisted…",
          "Contenu": "I felt understood and assisted throughout the process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sanquez H",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T02:16:55.000Z",
          "Titre": "Fast Response",
          "Contenu": "Jovana responded much sooner than expected for my request."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Bergano",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T00:39:47.000Z",
          "Titre": "We went from zero to MVP within 30 days…",
          "Contenu": "We went from zero to MVP within 30 days with Crowdbotics. They were thorough scoping out the project and had top notch app developers ready to go. Their team understood the expectations of our Fintech and tying together our partners as well as nailing funds flow. We were very pleased with their work and ongoing project updates."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T16:46:41.000Z",
          "Titre": "Awesome advice"
        }
      ]
    }
  ]
}