{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.coconstruct.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JW",
          "Nb_Reviews": 1,
          "Date": "2020-06-18T21:35:55.000Z",
          "Titre": "Not adaptable enough for custom home builders",
          "Contenu": "Not adaptable to custom builders.   Software improvements take too long.   Job Log function completely useless.   Change order process is not clean, too many unnecessary steps and notifications.  No good way to include 3rd party contributors to projects (architects, interior designers).  Too many issues to list, none ever addressed or improved."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Gordon",
          "Nb_Reviews": 4,
          "Date": "2021-11-18T04:42:29.000Z",
          "Titre": "I don't want to give a bad review",
          "Contenu": "I don't want to give a bad review, but we've used Co-Construct for many months now and I can't really say it's worth the money.  There doesn't seem to be much adaptability for different or custom projects - and really nothing at all for a GC who performs both commercial and residential renovations and TI's.  Sorry Co-Co, I had higher expectations and had hoped to find a software where I didn't have to input and revise the entire schedule to suit how project sequence flows in the real world.The original demo sold it for me, but the reality lost it for me.  I'd love to see Co-Co lower their price significantly to compete, and provide some better offerings and functionality for small GC's.  There still is potential but the software needs a lot of work."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Reid",
          "Nb_Reviews": 1,
          "Date": "2020-06-22T20:00:59.000Z",
          "Titre": "Pros... and Cons",
          "Contenu": "Lots of features with this app and if you take the time to learn how to implement them into your business, it can be very helpful.  I find that the app helps me present my company in a very professional light, but don't find that it saves me any time over my previous systems.  It is also not a money saver, the cost is quite high compared to the amount of return we feel that we get.  The mobile app and time clock features are also unreliable and my crew hates the app because it is slow to load for log in and log out."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brandon",
          "Nb_Reviews": 1,
          "Date": "2020-07-20T22:44:45.000Z",
          "Titre": "Resistance is futile",
          "Contenu": "Resistance is futile. You will assimilate to CoConstruct. It does a lot of things...and some well. It would be an easier thing if I just started construction, but the pivot to CoCon has pains. Don’t expect your desires in software to be answered, but it has improved in time we’ve been using it. Dire need for faster/more servers. A lot of lag."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Luke",
          "Nb_Reviews": 1,
          "Date": "2020-06-18T21:55:20.000Z",
          "Titre": "Mobile app isn’t great",
          "Contenu": "Mobile app isn’t great. Could be more intuitive. Overall has a “clunky” feel to the entire application. I like the scheduling options."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kurt M Fedewa",
          "Nb_Reviews": 1,
          "Date": "2020-06-19T11:15:45.000Z",
          "Titre": "Co Construct Review",
          "Contenu": "1. I've asked for consistent pricing for our NAHB 20 club and I haven't heard anything in months.  There are 20 plus members of just my club, with many more 20 clubs and there is a large majority of members that are using Co Construct.  There should be some special pricing for this group.2. Buildertrend seems to have put some more time into product development lately, such as implementing the WIP (work in progress) form and having it link directly to the jobs in progress and with Quickbooks, tempting to switch.3. Just some advice from the outside, Co Construct was great two years ago and it seems like you're relying on the past to keep you going.  New development is key, communicate to your clients what developments you're working on.4.  My team was at IBS this last year and we are one of the company's that is \"all in\" with Co Construct.  We brought some ideas to the table and some were received and you told us you're working on them, others were not deemed that important.  Like any good company, you need to have a rep assigned to each company and have them reaching out to us on monthly basis to see how things are going.You can call me at 517-388-2841 to discuss any of the above items."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Melanie",
          "Nb_Reviews": 1,
          "Date": "2020-06-18T22:02:29.000Z",
          "Titre": "I have been using CoConstruct for about…",
          "Contenu": "I have been using CoConstruct for about 9 months and I am still not 100% sold on the program. There have definitely been some components that I have found need to be worked on. The majority of these issues have to do with change orders.1) It is quite difficult to confirm whether line items include profit and overhead or not without toggling back and forth from the estimate view. I usually have to have a notepad, check the estimate view, write down the pricing breakdown, toggle back to the change order and verify.2) The client view seems to lump everything together and we often get complaints of wanting to see the pricing broken down into line items.3) If you enter a \"new item\" into a change order and save it as a draft it doe snot allow you to go in and edit the item. You have to delete it and start from scratch.4) When an selection has a change order tied to it you can no longer open the detail box. Can't this be opened as \"read only\"?5) Aside from those issues we've had numerous issues with emails. We haven't been able to enter all of our clients because someone else who uses coconstruct, through another company, also has that email entered. This seems rather silly and limiting.6) I'd like to see better options for repeat clients and clients who have multiple projects. It seems like I have to create a new login for each project and they just end up getting spammed with new welcome emails. I'd love to see these areas improved as they leave me wondering if I should look into different software."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gary Doski",
          "Nb_Reviews": 3,
          "Date": "2020-06-18T22:26:02.000Z",
          "Titre": "They are spending too much time on new…",
          "Contenu": "They are spending too much time on new and not enough time fixing what the have"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Drew",
          "Nb_Reviews": 1,
          "Date": "2020-06-15T22:32:17.000Z",
          "Titre": "The app needs a lot of work",
          "Contenu": "The app needs a lot of work.  The text boxes dont work correctly and the majority of the time I am just waiting for the app to load.  Its not my phone or service, its the app.I like the idea and we enjoy a lot of the features, but the app needs a serious overhaul or upgrade.Also, we should be able to put pictures in our proposals, thats a big deal that we cant do."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Todd",
          "Nb_Reviews": 1,
          "Date": "2020-06-12T19:05:43.000Z",
          "Titre": "Co-construct is good but can be better.",
          "Contenu": "Co-construct good be can be better.Co-construct has been our go-to for our project and client organization and communication.  Unfortunately, the system has not kept up with trends in technology by focusing on usability improvement of the existing platform versus a focus on regular launch of new features that may/may not be as useful as the base platform.  Simple improvements to the existing platform's functionality would dramatically improve useability.  Examples would be 1) being able to choose whether vendors receive notifications of changes to to-dos, schedule items, etc., 2) ability to sort selections by room, 3) Full functionality in the mobile app, 4) respond and fix bugs more quickly, and well as a handful of other easy improvements."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Philip",
          "Nb_Reviews": 4,
          "Date": "2020-07-22T19:49:05.000Z",
          "Titre": "It's good",
          "Contenu": "It's good.  I like the updates"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Broderick",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T19:07:20.000Z",
          "Titre": "CoContruct helps me to track all of my…",
          "Contenu": "CoContruct helps me to track all of my projects very easily"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Ray Wynsouw",
          "Nb_Reviews": 1,
          "Date": "2021-09-20T21:04:10.000Z",
          "Titre": "It's like having a real life Partner in my day-to-day operation.",
          "Contenu": "Coconstruct makes my world cohesive, connected and my entire team is up-to-date all the times. Confusion has been eliminated as well as re-occurring errors or omissions on job sites. Our clients love it from selections to schedule to budgeting and finally able to share ongoing photo's with friends and family during the build. A little slow on the draw for my check mark processes in the schedule module or it would be a 5 star. Currently I have you at 4.5"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christine",
          "Nb_Reviews": 1,
          "Date": "2020-07-21T12:25:01.000Z",
          "Titre": "It is great to keep everyone informed…",
          "Contenu": "It is great to keep everyone informed and combines many common industry tools. Not a big fan of the bidding feature, as it could use some changes. But overall, it the best tool for keeping all parties sane and conversations/selections stored! Can't imagine running a big project without it again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joel",
          "Nb_Reviews": 1,
          "Date": "2021-11-28T15:00:19.000Z",
          "Titre": "It is a fantastic piece of software…",
          "Contenu": "It is a fantastic piece of software that essentially runs almost all of my business. My clients love how much they can stay involved with the project and can check in on it at any time. The only reason not to give it five stars as they are slow to solve issues that the users bring up consistently over years."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Isaac",
          "Nb_Reviews": 1,
          "Date": "2021-09-11T01:05:47.000Z",
          "Titre": "Excellent program!",
          "Contenu": "Excellent program!! Has saved us $ in lost upgrade charges etc. The scheduling program in is a life saver and the central place for communication with clients is a life saver. Some aspects of the app display choices in a confusing way for trades but otherwise excellent!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Simon",
          "Nb_Reviews": 1,
          "Date": "2020-06-20T00:56:31.000Z",
          "Titre": "I found CoConstruct to be the most…",
          "Contenu": "I found CoConstruct to be the most user-friendly of the CRM web applications I tested and I have become more ardent in my adulation of it the longer we use it.CoConstruct's support team are extremely helpful and the software continues to evolve and improve. They have also proven to act on suggestions for changes and enhancements."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephanie",
          "Nb_Reviews": 1,
          "Date": "2021-10-18T15:25:28.000Z",
          "Titre": "This is a great system for our…",
          "Contenu": "This is a great system for our customers. They love being able to see updates and keep all the information for their homes accessible. The only reason I did not give 5 stars is because we wish it was more customizable with what our customers were able to see. Overall it is a great program!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Diana",
          "Nb_Reviews": 1,
          "Date": "2020-07-21T16:39:55.000Z",
          "Titre": "I used CO-Construct as a trade partner…",
          "Contenu": "I used CO-Construct as a trade partner before I came to work for the builder.  As a trade partner it was wonderful having the job address, client contact info, specifications, and job schedule at my fingertips!  As a builder I like that COC is constantly making improvements to the website.  Our out of state clients (on the younger side) LOVE having this website during the build."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tyson Sonnenberg",
          "Nb_Reviews": 1,
          "Date": "2020-06-19T23:17:46.000Z",
          "Titre": "Still have a long way to go",
          "Contenu": "Still have a long way to go, but getting better.  Would love to see more calendar functionality (think gmail, or Team up).  Would like to see more seamless Quickbook integration"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 1,
          "Date": "2021-05-19T21:30:19.000Z",
          "Titre": "Coconstruct is wonderful and has…",
          "Contenu": "Coconstruct is wonderful and has changed the way we do business  - in a good way. I gave a 4 star review as there is always room to improve some of the processes. You are great at listening to user's input, so I know you'll continue to improve."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2020-07-22T11:14:47.000Z",
          "Titre": "This software does so much to help our…",
          "Contenu": "This software does so much to help our business, it's capabilities are so limitless that we still feel that we are only cracking the skin after 3 years. The staff is very helpful and informative, no question stumps them and they are always adding new improvements the the software."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 1,
          "Date": "2021-04-30T20:43:33.000Z",
          "Titre": "Always impressed.",
          "Contenu": "I have always been impressed at Coconstruct's immediate and detailed response to my request for assistance and this was no exception.  However, the resolution has not always been satisfactory in my opinion.  In this case, some changes were made to the file sharing entity of the program which resulted in a more time consuming process for my methods of sending those shared files.  I expressed these concerns with the assistant however I was not under the impression anything would change.  That being said, the assistant did offer alternate ways of sharing the files to facilitate my needs.  Thank you Meredith."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ann",
          "Nb_Reviews": 1,
          "Date": "2020-07-22T16:09:30.000Z",
          "Titre": "I love this program and think it's help…",
          "Contenu": "I love this program and think it's help our system within our company.I would just like to be able to make a few edits within selections and that's not available yet."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ron",
          "Nb_Reviews": 1,
          "Date": "2020-06-22T14:26:02.000Z",
          "Titre": "Which depth is best for you?",
          "Contenu": "Just like wading into the water, different people are comfortable at different depths, so to is one way to measure a software system.CoConstruct is definitely not shallow in it features, like a kiddie pool.  Also, it is not overwhelming, like the ocean, in features like some intense project management programs.  CoConstruct feels almost like the perfect depth of water, with features that many construction and remodeling companies desire.  Whether you perform all your work in house, subcontract out all of your work, or a hybrid of the two, CoConstruct can, and should, be used to continually improve your company performance and processes.   This company's customer service is top-notch.  Their commitment to continual improvement is second to none.  Feel free to wade into the basics at the beginning and move deeper into the details as you get more comfortable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2021-01-28T13:25:16.000Z",
          "Titre": "Using this software added roughly 3-4%…",
          "Contenu": "Using this software added roughly 3-4% additional profit we were missing out on with other software or excel spreadsheets. Customer support is very responsive and works on your needs very promptly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Taylor",
          "Nb_Reviews": 1,
          "Date": "2020-07-22T11:41:41.000Z",
          "Titre": "everything is great except the schedule",
          "Contenu": "everything is great except the scheduling feature. for such a critical part of the tool, it has way to many glitches and is incredibly slow. causes a lot of frustration with out field team"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Monica Miller",
          "Nb_Reviews": 5,
          "Date": "2020-07-22T14:25:28.000Z",
          "Titre": "Communication interface is excellent",
          "Contenu": "Communication interface is excellent.  Customer support is very helpful, responsive and quick to reply, even if they don't have a fix.  Estimating functions are very good, BUT customer support could use more training on helping clients customize the system to fit their individual companies.   Most of our greatest advances in using the software have come from internal efforts or 3rd party companies helping us with CoConstruct rather than getting our problems solved with CoConstruct support staff.  Basic training provided in video or in person opportunities have been fantastic.  The networking at CoCon events is a big plus.   Weakest link by far is the CRM functionality for tracking leads, marketing and sales metrics etc.  It was sold to us as a replacement for multiple platforms we were currently using including a CRM.  But we are frequently told CoConstruct isn't really designed provide that level of performance."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shawn",
          "Nb_Reviews": 2,
          "Date": "2020-06-18T22:33:15.000Z",
          "Titre": "CoConstruct is not perfect BUT I'd be…",
          "Contenu": "CoConstruct is not perfect BUT I'd be willing to bet no other provider of similar service is either.  We have been with them for over 3 years and I can't imagine trying to run my business without their platform.  In spite of their imperfections I have to say that they seem to be constantly working on adding useful features and improving their process.  As my initial policy I decided I would attempt to use EVERY button and feature they had available.  It took 2 years to get there but as our business grew there was nothing about the software that hasn't proven itself useful which is not what I normally find in similar cases.  Their customer service is excellent.  When you call they answer or actually call you back very quickly if you leave a message.  When you talk to them they actually have good advice and can actually answer your questions.  Thats not typical in this world either.  I don't like the price but they do work hard to make you WANT to keep paying for their service instead of just holding you to a contract they talked you into agreeing to. At the end of the day I think that's what its all about!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Janet",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T17:29:01.000Z",
          "Titre": "Construction Coordinator",
          "Contenu": "Program is great to use, but there is still room for improvement. Like when you cannot delete a photo downloaded in to the wrong job."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ronnie",
          "Nb_Reviews": 1,
          "Date": "2021-02-10T15:15:13.000Z",
          "Titre": "This was a very informative…",
          "Contenu": "This was a very informative presentation. My only issues with the presentation were that there were some technical issues during the presentation, and there were some outdated slides from older versions of COCO."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Rod",
          "Nb_Reviews": 2,
          "Date": "2020-07-02T21:31:10.000Z",
          "Titre": "training",
          "Contenu": "Its obviously a great system. Im just not sure I'm getting the best out of it. I know you have training but they are not that easy to find the one you want to cover the issue I have in a certain area."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 4,
          "Date": "2021-05-13T10:58:48.000Z",
          "Titre": "Love this system",
          "Contenu": "Love this system. I got CoConstruct for scheduling and communication but are starting to use it more and more for estimating, bidding and financial applications. It provides a clean communication structure for all of my staff, trades and clients."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karlos",
          "Nb_Reviews": 1,
          "Date": "2020-07-23T04:21:11.000Z",
          "Titre": "Works great and love the options",
          "Contenu": "Works great and love the options! Only problem is that it's a little slower than some other similar apps that don't have nearly all the options."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Martijn",
          "Nb_Reviews": 1,
          "Date": "2023-01-26T04:50:28.000Z",
          "Titre": "I have used CoConstruct for a little…",
          "Contenu": "I have used CoConstruct for a little over a year now and I’m ready to step it up and intergrade a little more. A little pricey for a small business but very helpfull"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kyle",
          "Nb_Reviews": 1,
          "Date": "2022-08-20T18:32:47.000Z",
          "Titre": "Green bee Kyle The app is very convenient and works…",
          "Contenu": "The app is very convenient and works great I use it weakly for about three years now and it's very consistent and works great"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bryan",
          "Nb_Reviews": 2,
          "Date": "2020-08-15T18:46:27.000Z",
          "Titre": "Co-Construct is out front when it comes…",
          "Contenu": "Co-Construct is out front when it comes to what custom home builders need in a software platform."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Denise",
          "Nb_Reviews": 2,
          "Date": "2021-02-22T14:33:05.000Z",
          "Titre": "We are very happy with the way…",
          "Contenu": "We are very happy with the way Co-Construct works for us.  We also like that you are continually adding new features.  One feature that we'd like to see is the ability to print from the LEAD page.Thanks!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wendy",
          "Nb_Reviews": 1,
          "Date": "2021-08-18T15:26:10.000Z",
          "Titre": "Customer service is the BOMB",
          "Contenu": "Customer service is the BOMB!  Everyone is knowledable and friendly.  The software is very user friendly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Adam",
          "Nb_Reviews": 1,
          "Date": "2022-01-08T21:48:49.000Z",
          "Titre": "It’s a very good program",
          "Contenu": "It’s a very good program. It has its limitations, but I like it overall."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cheryl",
          "Nb_Reviews": 1,
          "Date": "2020-06-29T19:55:56.000Z",
          "Titre": "I would like to see CoConstruct come…",
          "Contenu": "I would like to see CoConstruct come with it's own database of pricing, etc (with local modifiers for particular areas of the country) in order to create a complete estimate"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matt",
          "Nb_Reviews": 1,
          "Date": "2021-09-17T15:14:22.000Z",
          "Titre": "Just a few quirky functionality that…",
          "Contenu": "Just a few quirky functionality that needs to be fixed but otherwise great construction management software."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rob",
          "Nb_Reviews": 1,
          "Date": "2020-06-19T13:25:06.000Z",
          "Titre": "Definitely think that the platform is…helpful and increasing efficiency.",
          "Contenu": "Definitely think that the platform is well built and organized for the job. I appreciate the consistent improvements."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jonathan Cook",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T16:23:35.000Z",
          "Titre": "CoConstruct is an exceptional…",
          "Contenu": "CoConstruct is an exceptional construction management software that has revolutionized the way construction projects are managed. As a user of their software, I can confidently say that CoConstruct has simplified the construction management process by providing a comprehensive platform that streamlines all aspects of project management.One of the things that I love about CoConstruct is the ease of use. The software is user-friendly, and the interface is intuitive, making it easy to navigate and understand. This is particularly important for construction projects, where time is of the essence, and no one wants to waste time trying to figure out how to use a complicated software program.Another thing that sets CoConstruct apart from other construction management software is the exceptional customer support. The team at CoConstruct is always available to answer questions, provide guidance, and offer solutions to any issues that may arise during a project. This level of support is a testament to their commitment to their clients' success.Additionally, CoConstruct offers a wide range of features that allow users to manage all aspects of a construction project, from scheduling and budgeting to communication and document management. This comprehensive approach ensures that every aspect of a project is accounted for, reducing the risk of errors and delays.In conclusion, I highly recommend CoConstruct to anyone in the construction industry looking for a reliable, user-friendly, and comprehensive construction management software. Their exceptional software and customer support have made managing construction projects a breeze, and I couldn't be happier with the results."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jon Sonnenberg",
          "Nb_Reviews": 2,
          "Date": "2021-02-26T19:52:46.000Z",
          "Titre": "Thankful for this Software",
          "Contenu": "CoConstruct is very easy to learn and use. There are a couple of small features that I would add, but over all the product is great."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Tracy",
          "Nb_Reviews": 1,
          "Date": "2021-05-25T18:42:40.000Z",
          "Titre": "I use CoConstruct very little",
          "Contenu": "I use CoConstruct very little, but what I use it for is easy and straight forward to use."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephen",
          "Nb_Reviews": 1,
          "Date": "2021-01-22T16:25:01.000Z",
          "Titre": "We love the system",
          "Contenu": "We love the system. Need better on boarding"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2022-08-30T19:39:39.000Z",
          "Titre": "Great product but needs an asset/…",
          "Contenu": "Great product but needs an asset/ consumables inventory management module"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2020-06-15T22:54:04.000Z",
          "Titre": "I like the features that are offered…",
          "Contenu": "I like the features that are offered but there is soooo much that I still haven't been able to successfully navigate and can't afford the trip to any of the training. I would love to be able to utilize the proposal, invoicing, contracts etc. as well as better grasp the way to build templates and the data (formulas) to be used for budgets."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2020-06-18T21:35:07.000Z",
          "Titre": "Great platform",
          "Contenu": "I've been working with CoConstruct now for a little over 2 years and in that time only the last 5-6 months really heavily. When I say heavily I now use it to run my company. Generally the platform is great and while there are a few minor issues I wouldn't not use the platform just because of them. Customer service and support couldn't be much better, they are very quick to respond and offer the assistance necessary when something does come up."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Trisha",
          "Nb_Reviews": 1,
          "Date": "2020-06-15T22:13:42.000Z",
          "Titre": "Great service I wish the accounting…",
          "Contenu": "Great service I wish the accounting worked better and change orders were able to be exported via estimate/invoice and not directly to invoice so we would have real accurate budget vs actual.  This is why we are not able to utilize the accounting functions which is disappointing. I keep hoping an update will correct this issue."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2020-06-14T21:57:20.000Z",
          "Titre": "Couldn't run my business without it!",
          "Contenu": "Coconstruct is great as a building software system. We love it and our clients love it. Communication is fantastic and nothing can be deleted so there is a reduced chance of miss communication.The support from the team at Coconstruct is fantastic and they respond almost immediately to any technical issues.I would normally give it 5 stars but it is a bit expensive at present as the fee's are based in US dollars. ( I am in Australia)I could not imagine building without it as a base for interactions with my clients and suppliers and subcontractors!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bryan",
          "Nb_Reviews": 2,
          "Date": "2020-06-15T23:09:55.000Z",
          "Titre": "Co-Construct gets even better every week",
          "Contenu": "Co-Construct continues to make additions/adjustments to their program to suit the needs of their clients.  They also provide more added value to the customer experience through additional portals (The Community and a Masterclass)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Farren",
          "Nb_Reviews": 1,
          "Date": "2020-08-18T04:45:08.000Z",
          "Titre": "90% there",
          "Contenu": "90% there just a little more tweaking on a few tools."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrew",
          "Nb_Reviews": 2,
          "Date": "2020-06-12T02:04:08.000Z",
          "Titre": "I love the program, but wish it worked with Xero!",
          "Contenu": "I love the program. I wish it integrated the actual spent column with Xero. We have xero synced but can’t see what our actual costs vs estimate without a bunch of hand work. Qb does it, why can’t xero?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2020-06-12T00:44:37.000Z",
          "Titre": "We have used the product for about 5…",
          "Contenu": "We have used the product for about 5 years.  It is a great program with great support and continual updates.  We are not using the entire program but probably 75%."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gordon",
          "Nb_Reviews": 1,
          "Date": "2020-06-12T01:28:26.000Z",
          "Titre": "Best software we have",
          "Contenu": "Best software we have. Staff is working hard to roll out new features all the time.Thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2020-06-18T21:49:15.000Z",
          "Titre": "It’s close to being perfect but it’s…",
          "Contenu": "It’s close to being perfect but it’s still lacking a few features that seem pretty simple."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gary Brown, Sterling Bay Homes",
          "Nb_Reviews": 1,
          "Date": "2020-06-12T12:40:18.000Z",
          "Titre": "Construction Management",
          "Contenu": "Well worth the investment!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nate",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T16:34:57.000Z",
          "Titre": "Started using this program over 2 years…",
          "Contenu": "Started using this program over 2 years ago and have confidently been able to take on work and stay organized. The budgeting tool relieves my anxiety over money because I can clearly see where I am at on every job. I love the templates and how much quicker I can get proposals to my clients. Nate"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JW Bowen",
          "Nb_Reviews": 2,
          "Date": "2023-11-23T11:38:46.000Z",
          "Titre": "A Company's tool",
          "Contenu": "Me, I'm 63 years old. Veteran and gracefully accepted by a company to help me complete a mortgage in the next two years. I know, whats this have to do with us.I think Coconstruct helps both the simple minded personnel, as well allows the wiggle room for more complicity to help the complexity of more corporate requirements.  Basically one stop shop for the whole company"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marty",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T15:10:25.000Z",
          "Titre": "Comfortable with CoConstruct",
          "Contenu": "CoCon allows us to easily track our expenses vs budget. Which is the bottom line for all companies.  It becomes a thermometer for every individual job.  We also use it as a means to keep other team members up to date regarding changes, challenges and work status by noting important dates and events."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T14:28:35.000Z",
          "Titre": "Quality Service - Quick Response Time",
          "Contenu": "Upon having a problem with our CoCo system, I had sent a request for help and received immediate responses and updates. This type of service in this situation means everything to me and my company! It ultimately didn't matter whether the issue was fixed immediately or not, it was the peace of mind of knowing that we were being  helped as quickly as possible."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sara",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T20:53:38.000Z",
          "Titre": "We use CoConstruct on a daily basis and…",
          "Contenu": "We use CoConstruct on a daily basis and so do our clients. It makes communication manageable and organized. And our clients can review their quotes and make selections easily. Even on the go from their mobile app. We wouldn't be able to function well on multiple projects without CoConstruct."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Roman",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T07:56:08.000Z",
          "Titre": "We have been using Co Construct for…",
          "Contenu": "We have been using Co Construct for about 6 years and find it a very useful platform to work from. It has improved client communication dramatically and our clients are very happy with the system and happy working with us, as all the details can be discussed via CO Construct."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Interiors By Thomas",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T20:48:39.000Z",
          "Titre": "CoConstruct has been vital",
          "Contenu": "CoConstruct has been vital in the growth and organization of our custom home remodeling company. We use CoConstruct for everything from CRM, Estimating & Templating, Scheduling & Project Management, Budget Tracking, Purchase Orders & Order Templating, Change Orders, tracking Bills & Payments to vendors and from customers etc.. Our business is 100% integrated with CoConstruct. We don’t use any program outside of CoConstruct except Quickbooks Time for the ease of employee time tracking and transferring to payroll."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maya",
          "Nb_Reviews": 3,
          "Date": "2023-09-11T22:20:01.000Z",
          "Titre": "CoConstruct easily does the job of one…",
          "Contenu": "CoConstruct easily does the job of one full time employee.  It is easy to learn, and very powerful and covers everything a remodeler or custom new home builder does in the course of the day.  A worthwhile investment"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kelly Ann",
          "Nb_Reviews": 3,
          "Date": "2023-11-06T15:22:43.000Z",
          "Titre": "Best Tech support",
          "Contenu": "Meeting regularly with our assigned representative who answers all of my questions with great patience (Daniela)Customer service picking up almost immediately every time I call and they are so very knowledgeable."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Craig Cogan",
          "Nb_Reviews": 2,
          "Date": "2021-10-26T20:58:11.000Z",
          "Titre": "We have used Co Construct since 2014…",
          "Contenu": "We have used Co Construct since 2014 and would be lost and disorganized without it. Fantastic features across the board for everyday use for entire team. Having information and photo's archived for years after completion can be very handy too when you get random calls from clients wanting to know something about their job.The help center is amazing too and the Co Construct team are constantly upgrading features. Highly recommend if you want to take your business to next level.Craig (Director Cogan Custom Homes)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AmyLynne Darling",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T21:04:48.000Z",
          "Titre": "glad I scheduled the zoom meeting",
          "Contenu": "I initially answered the calls to stop being bothered by co-construct employees. But I'm so glad I did! They have helped us use the bills part of CC which has been a tremendous help  and much needed tool for us. We are so happy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T15:05:21.000Z",
          "Titre": "It’s just so helpful to be able to see…",
          "Contenu": "It’s just so helpful to be able to see the details of each job, and to be able to post pictures of the progress for the team, and the customer"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T15:31:22.000Z",
          "Titre": "Check-in with CO+ Rep",
          "Contenu": "Our rep does a great job checking in to see how things are going with our team and how we are using Co-Construct.  He offers to help with any features that we aren't taking advantage of.  I always learn something during our meetings!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "karl wysocki",
          "Nb_Reviews": 3,
          "Date": "2021-10-12T11:22:10.000Z",
          "Titre": "Very good software .We are finally…",
          "Contenu": "Very good software .We are finally using all of the features and communicating with our customers.Our revenue has doubled since we started using it and are margins are up and more consistent month to month.Really starts to have an impact on our overall buisiness.The training sessions are also great it is very challenging to get older construction workers to work with software but you make it pretty easy.ThankKarl Wysocki"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lori Christiansen - TruBuildersAZ.com",
          "Nb_Reviews": 3,
          "Date": "2020-07-22T17:30:48.000Z",
          "Titre": "CoConstruct is AWESOME!!!",
          "Contenu": "CoConstruct is AWESOME!!!Co+ does an excellent job of managing all of our remodeling projects, from the small to the huge projects where clients have dozens and dozens of choices to make.  The ability to set due dates on their clients' choices is fantastic, helps keep all of us on track.  Then there is the project schedule and the job log because all need a place to record the small details.The CoConstruct goes above and beyond and puts together an amazing CoCon, a conference for builders that encourages and grows us all.Try Co+, just remember, you have to eat an elephant one bite at a time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Craig",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T17:25:03.000Z",
          "Titre": "Intuitive and very well thought out",
          "Contenu": "It is very intuitive, which is important as we have managers, supervisors and field personnel using this on a daily basis. Tracks all of our projects and can easily put in pictures and files for each project.  Allows us to know up to the minute where any project is at and the issues we need to address during the process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T20:44:33.000Z",
          "Titre": "Everything we need",
          "Contenu": "We tried a different app that didn't work out well for us and it cost more. Coconstruct is very user friendly. It is simple yet robust in its features."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Adam",
          "Nb_Reviews": 3,
          "Date": "2021-07-02T23:02:35.000Z",
          "Titre": "For years we managed our busy building…",
          "Contenu": "For years we managed our busy building company with whiteboards / xcell spreadheets and emails , constantly struggling to align and integrate . we took the dive into Co Construct 4 years ago and it has transformed the way we do business .. I think the best thing is CC is  completely teachable to any new staff after a few weeks even our juniors are proficient in the system ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wayne",
          "Nb_Reviews": 1,
          "Date": "2021-10-19T11:38:27.000Z",
          "Titre": "The Co Construct program is a gold…",
          "Contenu": "The Co Construct program is a gold mine. It forces even the newest Project Manager to be pro active in scheduling for his or her jobs. Using it and referring to it multiple times a day and referring back to it, makes scheduling and keeping track of each jobs status easy and effective. I would recommend this program to anyone who wants their PM's, whether new to the industry or seasoned with years of experience, to move to the next level of effectiveness.I wish I had this program 38 years ago!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Darwin",
          "Nb_Reviews": 1,
          "Date": "2020-07-21T16:48:33.000Z",
          "Titre": "A software tool from start to finish!",
          "Contenu": "Coconstruct is a comprehensive tool to assist you in your day to day activities. Very helpful in keeping all your data in one platform throughout the entire build process. From the very first time a prospect contacts you until the very last warranty item, it can all be done in Coconstruct. When you sign up, you don't just get the software, you also get to join a community of like minded people and help on any subject is just a message away!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karl",
          "Nb_Reviews": 1,
          "Date": "2022-05-09T13:33:11.000Z",
          "Titre": "I am a big fan of CoConstruct",
          "Contenu": "I am a big fan of CoConstruct.  I have never built more than 6 homes at one time.  Currently I have 15 under construction.  The Schedule feature is worth my monthly cost alone.  Specs/Selections is a fantastic tool.  It is so helpful when the customer fully engages and makes their selections on time.  My customers like the program too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bruce Haikola",
          "Nb_Reviews": 3,
          "Date": "2021-06-25T11:48:27.000Z",
          "Titre": "After a few months of using CoConstruct…",
          "Contenu": "After a few months of using CoConstruct it has become our main tool connecting all aspects of our business under one roof.  Management and field staff are up to date on all our projects. Estimating and Proposals roll into project management and costing. Client and subcontractor interface on a task by task basis help keep all those discussions and decisions in order.  My bookkeeper integrates quickbooks with our estimates and we can track costs as frequently as we wish.  Still finding and learning how we implement.  Our field staff has embraced CoConstruct simply because it is easy for them to use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rohit",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T17:14:52.000Z",
          "Titre": "We have been using them for years",
          "Contenu": "We have been using them for years. They have great features like specs & selections, 2 step estimating, adding tax %, contingency to your estimate template, the proposal template takes information automatically from the project etc. Customer support is also very responsive."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Cody",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T16:21:03.000Z",
          "Titre": "Changed the course of our business",
          "Contenu": "- Knowledgeable team- Obviously a system built by people who have been in the field - This program has vastly improved our customer relations and made us more profitable at the same time"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Graham",
          "Nb_Reviews": 2,
          "Date": "2023-03-31T19:58:54.000Z",
          "Titre": "We've been using CoConstruct since 2015…",
          "Contenu": "We've been using CoConstruct since 2015 and it has been a game changer for our company. It was great from the beginning but kept getting better and more sophisticated through the years helping us grow as a company as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sarah",
          "Nb_Reviews": 1,
          "Date": "2021-03-19T14:27:09.000Z",
          "Titre": "Improved Communication",
          "Contenu": "Improved CommunicationCoConstruct has helped us improve our communication with our buyers and trade partners. The software helps keep us more organized from the moment with meet a new buyer until the day they move in to their new home. The support we get from the tech team at CoConstruct is great, if they do not immediately know the answer to our question they will get back to us later."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alan",
          "Nb_Reviews": 2,
          "Date": "2022-10-10T03:14:20.000Z",
          "Titre": "Co construct is a must have!",
          "Contenu": "Co construct allows us to manage way more projects then we could with human management alone. As a long time user of the system, I have experienced their continuous upgrades and new services for improvement. They listen and implement suggestions, and the tech support is like no other! They always respond to emails, calls and provide solutions!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Glenn Evans, CEO Cedar Winds Design Build",
          "Nb_Reviews": 1,
          "Date": "2020-06-19T14:07:33.000Z",
          "Titre": "The program works really well for us",
          "Contenu": "The program works really well for us. We have completely imersed our processes into it and it has changed the way we do business. The support team is outstanding, and always there to help when we need them. Also, the development team is forever improving the system based on the feedback and suggestions given.Outstanding work!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2022-05-31T19:01:38.000Z",
          "Titre": "Big Fan",
          "Contenu": "I started using CoConstruct in June of 2018. It streamlined my company the moment I started doing my estimates in their platform. It keeps all information pertaining to specific jobs in the right place, got my jobs on a schedule that is easily edited in real time and integrates with Quick Books. It continues to be the engine that drives my company. The more my team and I use it, the more it helps us. It seems endless in a good way!!!!!!!!! Extremely satisfied CoConstruct user!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tona",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T21:58:04.000Z",
          "Titre": "CoConstruct has everything to keep our…",
          "Contenu": "CoConstruct has everything to keep our company well organized.It is easily accessible from my phone and computer.Whenever I do have a question, I can always just count on the HELP button and someone knowledgeable is always there to help answer my needs."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jane",
          "Nb_Reviews": 1,
          "Date": "2023-04-24T15:27:33.000Z",
          "Titre": "You have all the tools",
          "Contenu": "Your software has all the tools we need to manage our jobs.  Your support is outstanding; any issues I have asked about have been quickly resolved by phone or, if necessary by screen share.  The only item I would like to be more fond of is the photos. It takes a lot of work to find an image quickly. I love the integration with quick books for invoicing and payroll."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2020-06-20T12:30:10.000Z",
          "Titre": "Game Changing Software",
          "Contenu": "We have been looking for a software for year that would eliminate double entries both on the contract side and accounting.  We were also looking for a program that would help align the trades and our clients on one platform.  After trying a couple other programs that would have taken months to set up, we found Co-Construct, and it has been an amazing game changer ever since.  I couldn’t see trying to do business without it!  Thanks Donny and the Co-Construct team for all your hard work!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Andrea",
          "Nb_Reviews": 1,
          "Date": "2021-02-20T14:01:42.000Z",
          "Titre": "Co-construct has kept me organized and…",
          "Contenu": "Co-construct has kept me organized and on track with our customers and trades. It’s quick and easy to navigate and there’s nothing you can really hurt or wreak for first time users. Honestly don’t know what I would do with out this organizational tool. Thank you Co-construct for coming into my life! Lol."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pacific Ridge Construction & Remodeling LLC",
          "Nb_Reviews": 2,
          "Date": "2020-07-23T00:02:16.000Z",
          "Titre": "Everyone always does a tremendous job…",
          "Contenu": "Everyone always does a tremendous job helping you walk through any of the steps you may have forgotten or just get stuck.  I've never stumped them with a question they did not know the answer to!!  Good job - keep up the good work. - oh and it's refreshing when you chat with a real live person who treats you as an important client, and does not rush you off the phone!  That makes a difference."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Dwayne Butler, Master Edge Homes",
          "Nb_Reviews": 3,
          "Date": "2023-04-17T15:43:55.000Z",
          "Titre": "CoConsrtuct is easy to use and helpful…",
          "Contenu": "CoConsrtuct is easy to use and helpful in so many ways. The three major areas for projects to go off the rails are schedules, finances and communication. All three are covered here and our clients love it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julie",
          "Nb_Reviews": 1,
          "Date": "2021-09-07T14:49:28.000Z",
          "Titre": "I love how Co-construct has helped our…",
          "Contenu": "I love how Co-construct has helped our company.  It keeps everyone informed and on the same page.  There is one little detail that I'd like to see updated.  I'm a designer so I use it from that aspect.  When entering items in the selection tab, if there are categories that are not needed, I use the hide option.  The issue that I have is, the next time I open up the specs & selections tab, the categories that I'd previously hidden are listed again and I'm scrolling past them all over again.  Nothing big just a nuisance."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2020-06-19T10:45:44.000Z",
          "Titre": "Game Changer",
          "Contenu": "CoConstruct has changed the way we do business and communicate with our clients. Estimating, scheduling, job logs, time cards and budgeting all at you finger tips. We have been using this software for 2 years and the more we use it, the more it does for us. The customer support, the way they listen to their users and the upgrades that reflect the users input, makes them truly unique. “Using CoConstruct is the best business decision I have made since being in business”"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cole",
          "Nb_Reviews": 1,
          "Date": "2020-07-20T22:32:00.000Z",
          "Titre": "this has been one of best improvements…",
          "Contenu": "this has been one of best improvements to business in a long time. Customers love to know their schedule, selections, and message center in one place.I recommend CoConstruct to anyone serious about their business!!!.  ThanksCole Lowry RaindagO! RemodelingDallas. Tx."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kim Hibbs",
          "Nb_Reviews": 1,
          "Date": "2020-06-19T18:16:13.000Z",
          "Titre": "CoConstruct Review",
          "Contenu": "Could not be more pleased with CoConstruct.  The exact system needed for a custom homebuilder.  We are big on procedures and processes, and CoConstruct makes it easy.  Communication with their team is excellent.  They respond in a hurry, and offer helpful information.  If my team has suggestions on ways to advance/improve anything, they listen and are constantly updating. We love it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janeen",
          "Nb_Reviews": 1,
          "Date": "2021-07-09T21:24:01.000Z",
          "Titre": "We're all on the Same Page!",
          "Contenu": "Excellent software to keep everything organzed and recorded. Our installers, builders, and office staff as well as designers are all able to be on the same page on the project. CoConstruct also offers support and takes care of us very well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jerry",
          "Nb_Reviews": 2,
          "Date": "2021-08-14T02:38:51.000Z",
          "Titre": "Co construct has made my small company look like a big one.",
          "Contenu": "Co construct has helped my small construction remodeling company look like a big operation. It’s made me and all of my subs more efficient.I am only using the scheduling part now… But once I can integrate everything it will be even more valuable to us."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maya",
          "Nb_Reviews": 3,
          "Date": "2020-06-19T10:08:32.000Z",
          "Titre": "CoConstruct does the work of a full…",
          "Contenu": "CoConstruct does the work of a full time employee in our company.  It has brought systems to us that I had thought about implementing for years but never had the time.  Purchase Orders, online time clock, virtual change orders, lead tracking and more.  The support is amazing. They are always improving the software.  Co Camp is a great way to get you started."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "shep",
          "Nb_Reviews": 3,
          "Date": "2021-04-27T14:25:27.000Z",
          "Titre": "listening to succeed",
          "Contenu": "I have been a Co - Construct user for 10 years. I believe what makes the product so successful is that Donny Wyatt, the founder, has former builders on his staff and therefore the software directly reflects what builders need and want. They have also encouraged and implemented their customers ideas in the development of the product. I believe that effort is what has made Co- Construct a product that will continue to be cutting edge in the homebuilding industry."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2020-06-18T22:00:02.000Z",
          "Titre": "Have been using Co-Construct for about…",
          "Contenu": "Have been using Co-Construct for about 8 years.  As a volume producing specialty contractor I hated spread sheets and white boards so much I spent thousands of dollars for a programmer to create software that we could be more efficient in the office and in the field.As a new General Contractor in the remodel business I was lucky to connect with Donny and his staff at Co-Construct.  Our remodel business became efficient within days after plugging our projects into the Co-Construct system.Client and trade partners never had it so good!  Real shared scheduling keeps everyone on the same page."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Craig",
          "Nb_Reviews": 6,
          "Date": "2022-06-30T16:14:58.000Z",
          "Titre": "Great Program great customer service",
          "Contenu": "Great Program great customer service I have been with Co-Construct almost from their founding. They have always continued to innovate and listen to us as customers to make the program work best for our needs.  I have been on other platforms, and all are okay, but the customer service and help are what make it 2nd to none."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greg",
          "Nb_Reviews": 1,
          "Date": "2023-02-02T16:00:27.000Z",
          "Titre": "I love how all the information is saved…",
          "Contenu": "I love how all the information is saved in the database and I can customize the estimates based on the clients scope.It is very user friendly and enables me to view the project not only from a financial perspective but from an operations standpoint as well.Thank you"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Mike Francoeur",
          "Nb_Reviews": 4,
          "Date": "2021-09-21T11:56:33.000Z",
          "Titre": "My views of CoConstruct",
          "Contenu": "CoConstruct helps us manage all of our project much much much more efficiently.  its the perfect tool for us and integrates well with Quickbooks to make our life simpler and our projects run much more efficiently and quickly while giving our customer full transparency and a chance to participate at all levels of the project... Its AWESOME"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 3,
          "Date": "2022-03-25T12:08:40.000Z",
          "Titre": "Co Construct has continued to develop…",
          "Contenu": "Co Construct has continued to develop their platform adding very useful functions for our clients and build teams. We have used the program for 7 years and feel like we find new powerful resources several times a year."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chip",
          "Nb_Reviews": 1,
          "Date": "2020-07-21T11:49:10.000Z",
          "Titre": "The new normal.",
          "Contenu": "This product has changed how we do everything. We have implemented pieces over time which I think is the only way it can be done because of the learning curve. This product isn't perfect but new ideas and ways to do things are coming out all the time. Leadership is forward thinking so it will continue to get better."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aaron",
          "Nb_Reviews": 1,
          "Date": "2020-06-19T17:04:14.000Z",
          "Titre": "CoConstruct is amazing",
          "Contenu": "CoConstruct is amazing! The system is tailored to a construction manager and client experience in so many unique ways that I can't imagine using something else. They are constantly adding new robust features, and they even have a helpful forum community specific to the program and the industry. The customer service is 10/10 as well. I have a couple of small complaints - a sometimes clunky user interface and minor glitches, and a mobile app that doesn't work at all without an internet connection - but the app is amazing when you're connected!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob",
          "Nb_Reviews": 2,
          "Date": "2021-08-11T00:21:38.000Z",
          "Titre": "CoConstruct is the BEST software that…",
          "Contenu": "CoConstruct is the BEST software that exists for managing a service business that I have ever seen!  It is easy to navigate and has a great mobile app. If I ever have an issue, or do not know how to perform a task, I can call CoConstruct support or email them and have an answer quickly!  I can not LIVE or run my construction business without CoConstruct! I am a vocal advocate telling anyone running a service business that if they want everyone in their company to have immediate access to a customer file with all their documentation, contact info, schedule, etc., in one place, then CoConstruct is a must have!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ernesto",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T13:49:42.000Z",
          "Titre": "for people like me that lm not 100/100…",
          "Contenu": "for people like me that lm not 100/100 on English language that’s not bad and all bcThe options r so easy to understand and easy to do anyw report or place pictures about the project that we r working on Tks"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "S. Grant",
          "Nb_Reviews": 2,
          "Date": "2021-03-01T18:49:48.000Z",
          "Titre": "Co-Construct is a breeze!",
          "Contenu": "Co-Construct is one of the best custom home building software in the industry.  It has consistently exceeded our expectations in that it is very user-friendly, easy to navigate, and their customer service reps are a delight to work with.  They have always been friendly, fast, and efficient in helping us with any issues we've come across (which have been very few).  I would highly recommend Co-Construct to all custom home builders looking to take their business to the next level."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "R.L.",
          "Nb_Reviews": 1,
          "Date": "2021-09-14T18:43:53.000Z",
          "Titre": "Our Most Important Tool",
          "Contenu": "CoConstruct is a the most important tool for our Custom Home Building company.  It is the hub that keeps all aspects of our business running smoothly. CoConstruct allowed us to not have to hire another project manager."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2021-09-04T00:34:06.000Z",
          "Titre": "Co-Construct has helped us streamline files.",
          "Contenu": "We have been using Co-Construct for a several years now. We started using it for the time clock function and have expanded to using more functions. We are trying to use it from beginning to end. Our paper file room has shrunk dramatically."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kerry",
          "Nb_Reviews": 2,
          "Date": "2021-02-15T15:25:40.000Z",
          "Titre": "I love the software",
          "Contenu": "I love the software, from the great specs and selection templates, the new proposal feature to the schedule to communicate to everyone. The one improvement I offered a while ago is to integrate the schedule into the proposal. All the clients ask for it so we have to make a pdf and send it separately. Keep up the great work. Kerry"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Carroll, owner",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T17:21:48.000Z",
          "Titre": "CoConstruct is the most comprehensive program available to the small custom builder",
          "Contenu": "This program, unlike Buildertrend, provides the comprehensive package and flexibility required for a small custom homebuilder.  I have not found any equivalent that has as many features nor the presentation to all parties quite like CC does it.  I highly recommend CC for any company looking to bring professionalism and efficiency to their company for a price that makes sense for a small builder."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Benjamin",
          "Nb_Reviews": 1,
          "Date": "2020-06-19T12:28:25.000Z",
          "Titre": "CoConstruct has been a great company to…",
          "Contenu": "CoConstruct has been a great company to work with.  The on-site training was really useful to get started.The staff have also been very helpful in making the software work and helping us get the most out of the software.  It's not just a purchase it and they ignore you company.  They've been really responsive to questions and are constantly updating the software with useful features."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Rick McCarthy, HR2 Construction Ltd.",
          "Nb_Reviews": 1,
          "Date": "2020-06-19T16:03:57.000Z",
          "Titre": "Co-Construct has been a big help to my…",
          "Contenu": "Co-Construct has been a big help to my construction company.  It allows us to keep all our information in one place and available everywhere, which in todays market place is a must.  The Co-Construct Team and the training available is great and they platform is constantly improving.  Of the systems we tested Co-Construct has been the preferred choose by our customers and overall easy to use by myself and our small team.  I am not sure how we managed without in the past.  If you are not using a production / project management system currently I highly recommend the investment.  Co-Construct was our choose and I am very happy with the product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sean",
          "Nb_Reviews": 1,
          "Date": "2020-06-29T19:54:49.000Z",
          "Titre": "Game Changer",
          "Contenu": "Co-Construct has been a complete game changer for me.  Every new project I try to implement an additional feature of Co-Construct.  I am now using it to schedule, estimate, communicate with homeowners and subcontractors, as well as my own team.  The more I learn, the more time it saves.  The more I put in, the more I get out.  The team at Co-Construct is always there to help with any questions.   If you want to take control of your projects and save time and make more money, I highly recommend giving Co-Construct a try.  It's changed everything for me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rae",
          "Nb_Reviews": 2,
          "Date": "2022-03-28T04:52:18.000Z",
          "Titre": "This app is absolutely amazing",
          "Contenu": "This app is absolutely amazing. What is best overall is the customer service and the support I receive from this company. They are always willing to look into every issue promptly.  They give me useful information that helps me set up various sections of this software that better serves my company. The training videos and countless help documents are always available just by doing a simple search or you can have a discussion in the community section for insite from others using this software. Overall, CoConstruct is one of if not the best software for construction companies. I highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Casey",
          "Nb_Reviews": 1,
          "Date": "2020-06-18T22:22:19.000Z",
          "Titre": "High-quality, kick-ass",
          "Contenu": "I have been using CoConstruct for almost a year to run my construction company. They have excellent support and have been extremely quick to respond to any questions I have, as well as help train me and my team to use it effectively and efficiently. I highly recommend it to anyone who is looking for a system that can scale with their company, and help deliver high-quality communication with their clients and their team. They are a kick-ass support, and help my team kick ass."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ric",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T17:06:03.000Z",
          "Titre": "Cheerful, competent, clear speaking",
          "Contenu": "The staff at CoConstruct are in the US and speak English I can readily understand. They are competent, friendly and cheerful, that makes a big difference when a user (like me) calls-in frustrated, discouraged and feeling stupid because I cannot get the software to function as I think it should."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vahe Ohannessian, Architect / Builder",
          "Nb_Reviews": 1,
          "Date": "2020-06-29T22:56:55.000Z",
          "Titre": "Excellent and constantly improving",
          "Contenu": "I took a long time researching all the different systems available for construction management and decided to go with Co-Construct, and I have not been disappointed after 3 years of using it. The design works very well as a portal with which the builder team, the clients and subs/vendors all interact and see what they need to see. I'm impressed with the developers committment to listen to users' feedback and implement improvements at a great pace. Our clients are also impressed before and after they hire us - it's an important part of winning and executing design-build project as an architect-builder firm. Well done Co-Construct team, and keep up the great work!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Diane",
          "Nb_Reviews": 2,
          "Date": "2021-11-24T21:24:11.000Z",
          "Titre": "Using Co Const",
          "Contenu": "Co Const had a little learning curve but once we got used to using it we loved it.  Getting all of our subs on board took a little time.  Now we have clients, designers, our managers everyone is using it.  Makes it easy to track changes, decisions, and keep all of us on the same page.  Love the fact we can post files / drawings and photos of our projects."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Assembly Builders, Inc",
          "Nb_Reviews": 1,
          "Date": "2020-06-18T23:12:04.000Z",
          "Titre": "Indispensable",
          "Contenu": "Indispensable. We use it every day in every phase of our projects for the last 3 years. They've continued to add features and improvements. Customer service has always been there for us and they've been super responsive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vicki",
          "Nb_Reviews": 2,
          "Date": "2021-11-30T16:55:47.000Z",
          "Titre": "I find the program easy to use",
          "Contenu": "I find the program easy to use.  The technical support is phenomenal and very easy to work with.  I have referred the software to other users.  And finally, the fact that the consumer is listened to and updates to the program provide the proof that we are important and our needs are being listened to."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brandon",
          "Nb_Reviews": 1,
          "Date": "2020-06-22T11:58:35.000Z",
          "Titre": "This has been a great addition for our…",
          "Contenu": "This has been a great addition for our company.  Before CoConstruct we used an accounting software to create estimates and several spreadsheets to make selections and track the progress of our projects.   CoConstruct has brought our entire business into one easy to use program.   Once templates are made, estimating is a breeze.  Estimates vs. actuals can be completed with as much detail as we want.  We have had some issues syncing with our accounting software but the team at CoConstruct has worked with us to correct this issue.  This sync issue was not enough for me to reduce my rating to a 4 star becuse of how great the team has worked to correct it.  Plus  all the positive benefits far out weight this one issue.  I am very happy with our decision to work with CoConstruct."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jerry McDaniels",
          "Nb_Reviews": 1,
          "Date": "2020-06-19T21:58:46.000Z",
          "Titre": "McDaniels Construction_CoConstruct Review_061920",
          "Contenu": "CoConstruct has given my business the ability to have a competitive edge in our market.  It allows for a small to medium business like ours to organize and utilize tools to improve the quality of our product. It does not do it by itself. You must get involved with the \"Community\" within CoConstruct and with the resources, they make available to you.  You still have to make an investment and put in the work. The difference is the return on your investment. I have needed help from time to time. They have had my back when I needed them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donna",
          "Nb_Reviews": 1,
          "Date": "2021-11-15T19:47:12.000Z",
          "Titre": "oconstruct is an excellent software to…",
          "Contenu": "oconstruct is an excellent software to use for Business..  Fast, accurate for projects from start to finish! All information including schedule dates with calander are there at your fingertips. I would recommend this software program to anyone who wants to have a thriving business"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Manaia",
          "Nb_Reviews": 1,
          "Date": "2022-06-10T02:48:55.000Z",
          "Titre": "I haven't learned all of the functions yet, BUT the support system is AMAZING",
          "Contenu": "I haven't learned all of the functions yet; however, I am very, very, very happy with the support staff at CoConstruct. They are patient and extremely knowledgeable with all of my inquiries. Just love these folks (and the program too!)."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phil",
          "Nb_Reviews": 1,
          "Date": "2021-11-22T14:38:38.000Z",
          "Titre": "The software is excellent and the…",
          "Contenu": "The software is excellent and the support is also very good. Having labor tracking , files and Photos of the ongoing and upcoming projects all in one place has been a great tool for us in terms of communication and efficiency. The ability to track change orders has been especially helpful."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jane",
          "Nb_Reviews": 1,
          "Date": "2022-04-25T14:38:53.703Z",
          "Titre": "Awesome",
          "Contenu": "I have used lots of software and find CoConstruct very intuitive and user friendly.  Everyone is very helpful if you have a technical question or just do not understand how it works."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terry Stewart",
          "Nb_Reviews": 1,
          "Date": "2020-06-29T21:49:08.000Z",
          "Titre": "Best decision i have made in the last…",
          "Contenu": "Best decision I have made in the last several years to move my business model to Co-Construct. Not only has our business benefited from the online management system, we have learned much more about managing our business through the COVID-19 webinars and the masterclass was absolutely great. My opinion, Donny Watts cares about his customers. Their technical support answers the phone immediately and is always helpful and easy to talk with. Spencer Padgett, the builder in residence at CoConstruct, is on target with the masterclass and webinars."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven",
          "Nb_Reviews": 1,
          "Date": "2022-03-25T00:46:18.000Z",
          "Titre": "Great system for running a smooth…",
          "Contenu": "Great system for running a smooth construction company. It has been a hit since our first estimate. Very clean, detailed and professional looking. The estimate templates are worth it alone!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 1,
          "Date": "2022-07-15T12:59:33.000Z",
          "Titre": "Five years with Co-Construct has been a…",
          "Contenu": "Five years with Co-Construct has been a true help. I was a little apprehensive at first, but once I learned how to use it, it has streamlined my process to truly eliminate any wasted time and troubles."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brad",
          "Nb_Reviews": 2,
          "Date": "2020-06-18T22:15:27.000Z",
          "Titre": "CoConstruct Experience",
          "Contenu": "I have been using CoConstruct for about 6 months now and still learning new things every day. It has been a lot of work to get data input and things set up the way we like them but it was evident early on that the payback will be well worth time spent. It is a very user friendly system and the support has been excellent. Taking the online CoCamp course was very worthwhile as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ashley",
          "Nb_Reviews": 1,
          "Date": "2022-07-07T01:03:08.000Z",
          "Titre": "Fleschner Construction says \"Yes\" to Co-Construct",
          "Contenu": "Fleschner Construction has relied on Co-Construct and it's integration with QBO to run the business for 6 years.  We love it, our customers love their portal, and I appreciate the constant improvements that are made regularly to the platform.  I cannot imagine running my business without it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adam",
          "Nb_Reviews": 1,
          "Date": "2020-06-30T14:44:43.000Z",
          "Titre": "Co Construct is a great program",
          "Contenu": "Co Construct is a complex but simple to use program that keeps you organized a efficient.   Customers can keep up to date on there projects and you can set a schedule for your clients to make there selections without having to personally stay on them to keep the project flowing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patti",
          "Nb_Reviews": 1,
          "Date": "2022-08-10T17:18:06.000Z",
          "Titre": "Excellent Employee",
          "Contenu": "I have found CoConstruct to be very helpful, easy to navigate and the customer service is excellent.  We see CoConstruct as an \"employee\" of sorts --- that does everything we ask.  We rely on  it more and more each day."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Craig",
          "Nb_Reviews": 6,
          "Date": "2020-06-19T09:23:26.000Z",
          "Titre": "Co-construct best management tool",
          "Contenu": "Co-construct is by far the best tool available to streamline the communication and management of our construction company. Our customers love it because it's very intuitive for them to use to track their project progress. Great programs only as good as the support you get and Coconstruct support is the best."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Adam",
          "Nb_Reviews": 1,
          "Date": "2020-07-20T21:36:37.000Z",
          "Titre": "The product is excellent",
          "Contenu": "The product is excellent, but the service is even better. I've never been 'stuck' while using CoConstruct because their support team responds to questions promptly. I highly recommend CoConstruct."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DAVID THOMPSON",
          "Nb_Reviews": 2,
          "Date": "2020-06-29T20:39:52.000Z",
          "Titre": "This program has transformed how my…",
          "Contenu": "This program has transformed how my remodeling company operates. Everything from project estimating, field and office management and communication, scheduling subcontractors, project management, etc. They even hosted a 2 1/2 day training event and had weekly online training to help get me going.My subs and crews love working with it. Subs are scheduled out weeks in advance so no last minute calls saying \"can you be there tomorrow?\" If the schedule ever slips, everyone affected is notified immediately."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ann",
          "Nb_Reviews": 1,
          "Date": "2020-06-19T13:09:10.000Z",
          "Titre": "CoConstruct is Part of Our Team",
          "Contenu": "CoConstruct has been such a help to our company in keeping all the information in one place so the management, field personnel and the clients all have access to the same specs, photos, and discussion threads.  The clients love the pictures and weekly updates we post, especially since many of our clients live out of the area.  The 360 degree photos have proved to be invaluable in finding buried outlets and other issues that arise. As the project manager, I find that issuing purchase orders is a snap when I have my estimate data entered the way I want it to appear on the PO.  Specification changes and Change Orders are a much improved process over the old way of doing things, and everything is logged for reference.  The CoConstruct team is excellent; well-trained, responsive, collaborative and engaged.  Love them!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Brodie",
          "Nb_Reviews": 1,
          "Date": "2022-05-06T21:34:56.000Z",
          "Titre": "This program is excellent for…",
          "Contenu": "This program is excellent for everything from organizing schedules, sending PO and bid requests, and building project estimates. I am not sure how I did things without it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jared",
          "Nb_Reviews": 1,
          "Date": "2021-02-10T15:15:16.000Z",
          "Titre": "CoConstruct organizes the data you need…",
          "Contenu": "CoConstruct organizes the data you need to effectively manage a project without the unnecessary clutter that typical project management software has. Being able to get the info you need quickly, and assign tasks to your team on the fly has made us a more effective team. I highly recommend this platform to aggressive builders."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brad",
          "Nb_Reviews": 2,
          "Date": "2021-01-21T15:38:02.000Z",
          "Titre": "CoConstruct has helped get us organized…",
          "Contenu": "CoConstruct has helped get us organized by being able to keep all of our project information in one place. Support is excellent and the system is very user friendly. I also appreciate that you take suggestions for improvement"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brett Handler",
          "Nb_Reviews": 1,
          "Date": "2022-03-31T14:54:26.000Z",
          "Titre": "Over the last 30+ Years",
          "Contenu": "Over the last 30+ years, Dreamstar has used many of the Project Management Software Programs. Our company has morphed to meet the economic shifts, building trends, and now unprecedented appreciation in land, labor and product costs. Keeping the process financially successful has required tremendous amount of attention to the details.As our company has changed and grown, so has CoConstruct. The integration with Quicken OnLine has allowed the team to understand and react to the ever changing business climate. The Specification and Selections Section keeps our entire team on the same page. The clients feel the love. They are kept in the loop with details, pictures, conversation, and financial transparency that is the magic formula necessary to carry out our our goals as a company. As I stated earlier, we are always changing and constantly look at the other available project management programs. A change from CoConstruct is simply NOT in the cards. They work with us to accomplish everything we need from the program to assure our continued success. Brett Handler Dreamstar Custom Homes (561) 662-7700"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Belinda",
          "Nb_Reviews": 1,
          "Date": "2021-09-22T18:48:58.000Z",
          "Titre": "Excellent Customer Service",
          "Contenu": "The thing that sets Co-Construct apart from other project management software is the customer care. Whenever I contact them with a question or an issue, I receive immediate, professional attention, and the CSR stays with me until the issue is resolved. They really are top notch."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Becky",
          "Nb_Reviews": 1,
          "Date": "2020-06-29T20:44:01.000Z",
          "Titre": "We love the customer service that…",
          "Contenu": "We love the customer service that CoConstruct allows us to give our clients. We have even been awarded jobs because we offer CoConstruct to our clients. Since day 1 we have been very happy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2022-09-08T19:54:47.000Z",
          "Titre": "Onboarding was great and support has…",
          "Contenu": "Onboarding was great and support has been extremely helpful. It has organized our project even better than what we thought we were getting."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wil Reed",
          "Nb_Reviews": 3,
          "Date": "2020-08-14T20:28:11.000Z",
          "Titre": "Support is Critical",
          "Contenu": "The support team is the heart of CoConstruct. They make the learning process enjoyable, helping me close more deals, take on new deals with confidence, and makes my client's overall experience a pleasure."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Stefano",
          "Nb_Reviews": 1,
          "Date": "2021-11-18T14:04:33.000Z",
          "Titre": "the program allows us to load it with…",
          "Contenu": "the program allows us to load it with all type of information so end up being a one-stop source of information for us. that makes our time more effective."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tammy",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T19:43:09.000Z",
          "Titre": "Very knowledgeable",
          "Contenu": "Debbie is very knowledgeable and very patient! Our meeting we had she presented it so we could understand. Thanks Debbie!!!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Virgil",
          "Nb_Reviews": 1,
          "Date": "2020-06-19T09:53:45.000Z",
          "Titre": "I find writing variations much less…",
          "Contenu": "I find writing variations much less stressful, a really professional way of presenting variations to your clients,In my opinion this alone pays for the cost of the program"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kay",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T20:08:18.000Z",
          "Titre": "Had some issues with downloading to…",
          "Contenu": "Had some issues with downloading to Quick books and called for some assistance.  They had my issue resolved with the hour. I love Co-construct and how it communicates with Quick books."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trevor",
          "Nb_Reviews": 1,
          "Date": "2020-06-18T22:13:18.000Z",
          "Titre": "CoConstruct has helped us take our company to the next level.",
          "Contenu": "CoConstruct has helped us take our company of 16 years to the next level in construction, finances, and customer service. Can’t imagine building homes without the organization that CoConstruct provides us."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin",
          "Nb_Reviews": 1,
          "Date": "2020-06-19T13:51:37.000Z",
          "Titre": "CoConstruct = Gas to a Flame",
          "Contenu": "Rewind 4 years back, I was a skeptic. I had tried all the other \"trials\" but nothing fit just right. Being a Design-Build firm, there are so many moving parts, finding a program that worked well was becoming frustrating. We had always seen CoConsturct and just felt the investment was too much, we were wrong. CoConstuct is literally our lifeline and our central hub for literally everything we do. No more double entries!! Onboarding may appear daunting but honestly, you are never finished. You simply can't keep up because the CC team is ALWAYS pushing out new features and updates. Seriously, always. If a part of the program isn't working to the best of its ability, they already know about it. Odds are, they are going to have resolved in the next round of updates. Their customer support is hands down the easiest to work with. You are literally on the phone with a real human, who speaks fluid English, knows their product, and eager to help you navigate through whatever obsitcal; in a matter of seconds. The program allows us to maintain our margins while providing enough transparency for clients to make informed decisions. The management team sincerely wants to understand your needs and will move mountains to ensure your up and running smoothly-- shout out to Spencer! All in all, the investment is worth it and we highly recommend it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roger Keith whitt",
          "Nb_Reviews": 2,
          "Date": "2021-02-21T15:28:50.000Z",
          "Titre": "This is a great tool for the company to…",
          "Contenu": "This is a great tool for the company to use, keeps all contractors informed and less phone calls to each other which means more time is spent on work."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Barbara",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T15:31:33.000Z",
          "Titre": "Kaley was very patient and explained…",
          "Contenu": "Kaley was very patient and explained everything to me that I needed to know at the time, knowing that it was my first time using Co Construct."
        }
      ]
    }
  ]
}