{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.headphones.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pinar Marie Sahin",
          "Nb_Reviews": 6,
          "Date": "2023-10-27T17:47:34.000Z",
          "Titre": "Returned Headphones, Company Refuses Refund",
          "Contenu": "I shipped a purchased pair of headphones back to headphones.com using their prepaid label. The label I used was the company’s prepaid label, but now they are refusing to refund me, telling me to contact USPS. I contacted USPS and they said that since they are the merchant, they assume responsibility for items shipped back to their warehouse with their label. I have saved all communication from headphones.com customer support  and forwarded it to my bank. Now I have to proceed with the chargeback, and I am telling all of my clients and family members never to use headphones.com, as they cannot take responsibility for a return that was lost in transit. Which they, as the merchant, must take responsibility for. If your return is lost in transit, headphones.com refuses all refunds. Beware.EDIT: You all need to know how headphones.com treats its paying customers. Not long after I posted this review, a customer service agent sent this email to me: “Yes you are responsible for getting a return to us. You have already left false information in your 1-star review of our company along with false information in your first chargeback.We are unable to refund you for a product that has not been received. We have told you what is currently happening with the USPS claim in relation to your return.”There’s nothing false about what I said in my previous review. I used their label, I shipped the item back to them, and now they are refusing to make things right. Do not purchase from this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ricardo Hudson",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T18:04:09.000Z",
          "Titre": "It took two months to get the product",
          "Contenu": "It took two months to get the product, and I haven't received it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Huy trinh",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T07:05:26.000Z",
          "Titre": "Buyer beware",
          "Contenu": "Buyer beware! This online store has a crazy high restocking fee than others, and they apply the restocking fee from day one u recieve no matter what reasons, make sure u contact andrew from musicteck, he has a lot of iem brands than this sucking store and his customer service is the best in business. This is the very bad customer service company ive dealt with"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pinar Marie Sahin",
          "Nb_Reviews": 6,
          "Date": "2023-08-04T18:52:13.000Z",
          "Titre": "Returns and Refunds @ Headphones.com",
          "Contenu": "This company probably has the worst return policy I’ve seen. They advertise free returns on their website, but what they don’t tell you is that they deduct 10% of the cost of the item from your refund if they feel the return is unnecessary (and if it’s damaged due to their fault in shipping, they demand you file a warranty claim first before shipping it back). On top of this, I returned my item (a pair of Focal Bathys headphones) last week and still have not received any indication my item was received or when my refund will be processed. I would avoid this store in the future."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Heather Morigeau",
          "Nb_Reviews": 2,
          "Date": "2023-09-17T01:34:52.000Z",
          "Titre": "Never ordered this product it was a…",
          "Contenu": "Never ordered this product it was a random charge on my credit card."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael S Rillo",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T08:46:31.000Z",
          "Titre": "Fraudulent charge",
          "Contenu": "This was a fraudulent charge on my and my wife's cards. One for $1275.00 and another for $425.00. I disputed these charges with my card company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jose Luis Hernandez Septien",
          "Nb_Reviews": 3,
          "Date": "2022-11-17T01:47:08.000Z",
          "Titre": "This one star is dedicated to the…",
          "Contenu": "This one star is dedicated to the “manager” of Alan (if there is actually one) for being cheap on me as a customer and poor customer service when the item was returned in near mint condition less than two weeks and still got hit with a 25% restocking fee. There are not enough one star reviews that will help my bank account nor my relationship with this company. AVOID buying at headphones.comReplying to headphones.comOf course, I also returned the “free” item in perfect conditions along with all the purchased items. The Conductor 3X GT is a flawed item and still prefer to defend the manufacturer than the customer who is paying for the item. Since the response was in “money” terms, let’s talk money…from my $2500 purchase, headphones.com kept $625 (25% fee). That’s a stiff fee from a company that claims 1 year of returns on new items. What a strikingly different policy for final sale items. Incredibly disappointed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jose Luis Hernandez Septien",
          "Nb_Reviews": 3,
          "Date": "2022-11-13T13:00:03.000Z",
          "Titre": "25% restocking fee",
          "Contenu": "Please, avoid buying “final sale” items at headphones.com, they make sure to backup manufacturer design problems on items instead of the customer’s experience. The Burson Conductor 3X GT is flawed with a problematic fan, not suited for top of the line headphones like MDR-Z1R which would clip even in low gain, and it is lacking in harmonic content of the notes. I got a 25% restocking fee with (in my experience) a problematic unit. Very disappointed. Honestly, considering never buying again at this website :("
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Foster",
          "Nb_Reviews": 4,
          "Date": "2023-01-06T00:47:26.000Z",
          "Titre": "Not being able to test before purchasing!",
          "Contenu": "I wouldn't say my experience was great, however, the response time from emails was consistent and informative to a point. Let me explain.I signed up for email list at Headphones.com over a year ago. After 7 months of receiving emails, one particular email stood out in a negative fashion. I read it and responded. Had to do with why I hadn't made a purchase. Headphones wanted to cancel or remove me from emails.Moving forward I made a purchase of 2 products on 12-24-22. I received an email on the 25th from Andrew himself thanking me for the purchase and why I chose Headphones.com. I responded, on the 27th I received an email from a staff member claiming they would be happy to help with any issues I have.I find this a little condescending. Andrew if you send a personal email to me then keep the conversation between you and me. Not a staff member. The email you sent should be The staff at Headphones.com would like to thank you for your purchase etc.Now present day. Depending on how the issues I'm having already with both products get handled will determine the final outcome. This an update submitted 2 reviews on items purchased. No response from Headphones.com. I did submit a review to ifi. Far more damaging than what I left on Headphones.com Working on leaving one with Moondrop.I have another update. As I stated earlier how Headphones.com would handle the situation. They failed miserably. I did request to talk with a manager. Taron responded and we got nothing resolved. He did send a return form however Headphones.com wants to charge me for return shipping. I ended the conversation with him and went to the bottom of the totem pole. Headphones.com customer service is lacking in integrity. 1 April asked if I wanted to return items. I said yes and mentioned I would like to upgrade the headphones. I also mentioned the ifi UNO EQ was not working. April didn't bother to ask what was wrong or to give any insight as to why the EQ is not working. I emailed ifi about EQ not working, they sent me some checks to perform. If they didn't resolve the issue then send it back to the vendor. As for the Moondrop Kato's, I wanted to upgrade however April ignored my request and told me they were now closed and that she would extend my concern to the Headphones.com team. I never heard back. I did learn Headphones.com will not post a review if the rating is 3 stars or less."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "popnimpop",
          "Nb_Reviews": 1,
          "Date": "2022-12-26T17:43:36.000Z",
          "Titre": "Banned for saying hello to a friend in community discord and returning products asap (company attempts to slander me as well)",
          "Contenu": "Dear headphones.com,I am writing to express my extreme disappointment and outrage at the treatment I received on your Discord server. As a valued customer of your company, I expected better from the moderation team and customer service.On 12/24/2022, I was banned from your server for simply saying hello to another user. I had no intention of causing any harm or disruption, and was simply trying to be friendly and welcoming. However, an unreasonable moderator saw fit to ban me with no warning or explanation.When I reached out to your customer service for an explanation, I was met with complete silence. Not only was I unfairly banned from the server, but I was also denied any chance to have my voice heard or my side of the story told. This is unacceptable.I have been a loyal customer of your company for years, and I have always had a positive experience with your products and services. However, this incident has completely changed my opinion of your company. Your actions have shown me that you do not value your customers or their experiences on your server.As a result, I will no longer be supporting your company. I will be sure to spread the word about the terrible treatment I received, and I am confident that I am not the only one who will be turning away from your company because of it.Edit now that they have replied: they are now claiming I haven't bought a product in their system for some reason which is either an accounting issue or a blatant attempt to mislead readers. Both ways it further adds reason to distrust this company. They also claim my ban is for some previous offense to a \"rule 2\" which covers things such as bigotry and harassment. Seeing as this doesn't seem to be some sort of \"parody\" or joking response from them, and the fact that I am both very much against racism, sexism or any form of bigotry and have never shown or acted in a manner to suggest this as a reason to ban me, this is a blatant attempt to slander me. I may look into taking action, as that is not only a false attempt to damage my character but to be honest I am mostly just done with the childish behavior of this company. I also had my friend do more research, and the actual reason for my ban was because one of their mods knew me from another server and has been holding some grudge about me selling my Sennheiser hd650 to buy a stax headphone. This isn't exactly inclusive behavior for a community around a company that sells all types of headphones to all types of customers. Why they attempted to slander me instead of fixing the issue or at a bare minimum apologizing is beyond me but I strongly suggest avoiding business with them. To be clear (in case they decide to behave like a proper corporation handling a complaint rather than children), I have no intention of doing business with them in the future no matter the resolution they come up with. This experience has given me too much of a distain for them and I would rather take my business elsewhere. I do however expect an apology and that they delete the slanderous remarks they made and clear things up for future readers seeing these post. It's better to be seen as a bad company than a childish bad company that will go as far as to illegally slander former customers on completely fabricated claims."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jane",
          "Nb_Reviews": 4,
          "Date": "2022-09-18T22:46:38.000Z",
          "Titre": "Return Policy: Huge restocking fees!!",
          "Contenu": "RESTOCKING FEES:Base 10%Additional:In-Ear Headphones  +5%Sale Items + 10%Affirm Financing  +5%Missing Accessories or original packaging  +15%Products with batteries  +5%Earwax or Dirty headphones  +25%Return of more than 2 items in a calendar year  +25%Failure to ship item within 7 days of receiving return label  +30% I will literally never buy here again. Also don't buy the brand Final, the quality is atrocious and now I have to pay $30 to return it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Unknown",
          "Nb_Reviews": 1,
          "Date": "2021-11-08T00:38:46.000Z",
          "Titre": "Shipping was mediocre at best…",
          "Contenu": "Shipping was mediocre at best especially since they send packages requiring a signature. I understand wanting to protect your product however for those that work often and are rarely home it makes it very difficult to receive a package requiring a signature. Because of this I shall never order from headphones.com again even if it is the only place I can find a particular item. Id rather wait a month or two and order it from overseas."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "STEPHEN EHR",
          "Nb_Reviews": 7,
          "Date": "2022-03-22T19:12:51.000Z",
          "Titre": "Your return policy on \"Final Purchase\"…",
          "Contenu": "Your return policy on \"Final Purchase\" options that are, on delivery, defective, and even with that being defective, are not returnable, are deplorable and I will never purchase from you again and I bet you don't publish this either\"......"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kieran Keith",
          "Nb_Reviews": 1,
          "Date": "2022-10-17T17:47:10.000Z",
          "Titre": "they done make me sign some stuff now i…",
          "Contenu": "they done make me sign some stuff now i gotta go get it ion know why i gotta sign for headphones but alr"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carol Killy",
          "Nb_Reviews": 1,
          "Date": "2021-07-26T14:46:04.000Z",
          "Titre": "Headphones not told non refundable.",
          "Contenu": "Bought headphones  not what I needed went to return now they say non refundable and yet was not told this by Allen with Customer Service. Contacted them and still haven’t heard anything. It’s not like I have 200.00 to throw away. They pride themselves with a 265 day return and yet their customer call center doesn’t say you can’t return it.  Pissed off for sure."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "TCbran",
          "Nb_Reviews": 2,
          "Date": "2021-06-10T00:02:43.000Z",
          "Titre": "I don't understand the positive reviews.",
          "Contenu": "For a company that so strongly touts its return policy, I found the process very challenging. You have to get approval to return headphones. That takes days. You have to pay a surcharge to return headphones, which is not small. I requested a waiver of that charge and was told no. I was a first time headphones.com customer. My first time will be my last time. Even Amazon offers better service, in my opinion."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Doug Farmer",
          "Nb_Reviews": 1,
          "Date": "2021-05-08T13:37:36.000Z",
          "Titre": "Some delays can be expected due to…",
          "Contenu": "Some delays can be expected due to COVID but waiting over 3 months and being told literally every week the shipment would come next week over and over again made it a painful experience. Not to mention the fact that you are billed the full amount when the order is placed rather than a deposit and then billed when the product actually is shipped. I don’t think I will be ordering from headphones.com again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-06-07T02:51:43.000Z",
          "Titre": "One can was dead on arrival",
          "Contenu": "One can was dead on arrival, got a return label on Thursday. Ship back the Hifiman sundara on Friday morning. I was told another pair will be shipped as soon as USPS confirm they got the package. That was no the case for me. I wish I used crutchfield. They have better support and they work on Saturdays."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carlie Gausvik",
          "Nb_Reviews": 1,
          "Date": "2020-09-18T18:45:15.000Z",
          "Titre": "I ordered my ifi hip dac Sunday of last…",
          "Contenu": "I ordered my ifi hip dac Sunday of last week, it’s Friday, I still haven’t received any tracking information and I even contacted customer service via email inquiring about my package and I haven’t received a response. So as of now it seems like I just burned $130 for no reason."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dr Eas",
          "Nb_Reviews": 10,
          "Date": "2020-02-19T22:07:50.000Z",
          "Titre": "So far you've not replied to multiple requests",
          "Contenu": "So far, you've not responded to my 4 (including this, 5) requests for an exchange. I purchased via you because of your 365 day CNET reputation. Either you are understaffed, woefully behind in email / contact, disorganized, or I hope, not dishonest. Very frustrating..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "KB",
          "Nb_Reviews": 1,
          "Date": "2021-01-17T23:57:14.000Z",
          "Titre": "False Advertising",
          "Contenu": "Ordered products from this site almost a week ago (got priority express shipping) and they still haven’t shipped even though on the front page of their site “In Stock & Ready to Ship”. Very disappointing experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "G.",
          "Nb_Reviews": 1,
          "Date": "2022-01-05T22:36:40.000Z",
          "Titre": "$30 for shipping and 1 week later",
          "Contenu": "$30 for shipping and 1 week later, it’s still 5 days from arriving.   Regardless of the holidays, this price and speed for shipping on any item is a little disappointing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "S Scott",
          "Nb_Reviews": 2,
          "Date": "2019-07-12T20:45:46.000Z",
          "Titre": "Never again",
          "Contenu": "July 2019.  After two bad experiences in less than a month I have to share.  Headphones.com seems to be having extreme difficulty with fulfillment.  The first order had a tracking number but wasn't delivered to the carrier until a week later, and only after my nagging the company via email, to which they were very unresponsive for days at a time.  The second order has been in place for five days, still unfulfilled and not one response to the several emails I've sent to info-at-headphones.com, except to inform me that they're out of the country.  I've now cancelled the second order and intend to avoid headphones.com from now on.  I can only hope that I get my money back.  Buyer beware!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tanmay Kumar",
          "Nb_Reviews": 2,
          "Date": "2020-05-04T22:52:51.000Z",
          "Titre": "Defective product and lack of response to set up return/refund…",
          "Contenu": "Defective product and lack of response when return is requestedI received a defective product that I promptly notified them about. I considered getting a replacement but requested a return the next day. This expensive set of headphones was received defective and they won't respond to my requests to return (over email or through their website). Taron at Headphones.com acknowledged that I received a defective product and that was not okay. I now have an expensive set of defective headphones for which I have not been able to get a return and refund set up. I just want to return these and get my money back.I've checked my spam - they just have not responded. They conveniently do not provide a telephone number to contact for customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lyle Ganske",
          "Nb_Reviews": 2,
          "Date": "2021-01-13T22:03:13.000Z",
          "Titre": "The did great when I bought headphones",
          "Contenu": "They did great when I bought headphones, but when I bought a dac/amp the service was horrible. Item never shipped, even though it was supposedly in stock. Ultimately cancelled order."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Omid Eizadi",
          "Nb_Reviews": 1,
          "Date": "2017-11-02T20:19:20.000Z",
          "Titre": "Your inventory signal (if a device is …",
          "Contenu": "Your inventory signal (if a device is in stock and when it will ship) is inaccurate which leads you to merchandise things ineffectively which leads to people buying things and becoming disappointed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customebobor",
          "Nb_Reviews": 5,
          "Date": "2021-01-25T19:09:03.000Z",
          "Titre": "No delivery",
          "Contenu": "Place an order over a week ago, still no expectations for delivery. Product was in stock and had fedex two day delivery.  Tried contacting them by email, no response at all"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alan Zambarano",
          "Nb_Reviews": 1,
          "Date": "2021-03-24T18:20:14.000Z",
          "Titre": "Still haven't recived the head phone…",
          "Contenu": "Still haven't recived the head phone TR175 I order[order 8619]                                                Alan Zambarano PS  Hope to hear from you soon."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "RICHARD LAUB",
          "Nb_Reviews": 2,
          "Date": "2021-04-15T14:53:43.000Z",
          "Titre": "I still don't have the IEM's",
          "Contenu": "I still don't have the IEM's.  I don't understand why you would send me this knowing that I have not received the package and that it is late."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Jonathan Sero",
          "Nb_Reviews": 3,
          "Date": "2021-06-01T16:17:27.000Z",
          "Titre": "Ordered some Focal Clears and have not…",
          "Contenu": "Ordered some Focal Clears and have not arrived, apparently shipment delayed or something but have not received any current updates."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "andrew Holt",
          "Nb_Reviews": 2,
          "Date": "2019-12-20T22:17:33.000Z",
          "Titre": "My order 3545 from 11/30 has still not arrived",
          "Contenu": "My order 3545 from 11/30 has still not arrived and FedEx shows only a label has been submitted.  Terrible service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Fleener",
          "Nb_Reviews": 1,
          "Date": "2021-08-20T14:57:39.000Z",
          "Titre": "I am not happy with the sound of the…",
          "Contenu": "I am not happy with the sound of the Moondrop S8. also, too many pop-up ads on sites I visit."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vernon Buster",
          "Nb_Reviews": 2,
          "Date": "2021-11-09T16:07:33.000Z",
          "Titre": "The wrong cables were sent.",
          "Contenu": "The wrong cables were sent. Was my told how and when the error would be coorcted."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "hector ordiales",
          "Nb_Reviews": 2,
          "Date": "2021-07-11T15:16:21.000Z",
          "Titre": "Super fast service...."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nate",
          "Nb_Reviews": 1,
          "Date": "2020-02-26T18:15:55.000Z",
          "Titre": "Their customer service was horrible",
          "Contenu": "Their customer service was horrible, constantly giving false promises/expectations, it was bad enough for me to leave this review. I'm a peaceful person and I like to resolve problems with the other party as quietly and smoothly as possible, but they were abysmal. I had to message them for every delay and problem that there was. Not once did they message me first in the 1 month of this whole ordeal. I'm sure other people had positive experiences with them, but I was the unlucky one with the bad experience a really bad experience I might add. To start, my product was out of stock so they informed me after I filled out an email survey on Jan 12th. I purchased the product and selected for expressed shipping which takes 1-2 business days. They told me they'll give me a discount for a lower end model and asked me if I wanted to accept their offer (first impression wise they seemed alright since they were quick to reply and give me a discount for the troubles). I quickly replied and asked for a confirmation of the total price and that I will accept it if they send me a new unused product. They didn't respond back to the email so 2 days later I filled out another form on their website to ask for confirmation of the order. They finally got back to me saying that they are processing the order and they will get back to me regarding the shipping time. I sent back a reply asking what the final price would come out to be and when the price adjustment will be processed (they said they'll discount $500, for my $3799 purchase). Yes, with quick math it'll come out to be $3299, but the lower end model they were sending me sells for $3599 so I wanted to confirm if it was $3299 or $3099. They never replied or sent me any updates. Jan 17, 2020 I had to send them another email which they replied to saying they are shipping my item out and that the refund will be processed by the end of the day (STILL DIDN'T CONFIRM THE FINAL PRICE). The product arrived on the 21st and I had no problems with that. The problem is I still haven't gotten my adjustment credit. I decided I would just wait and give them time since the banks could be slow. I trusted that they did refund me and waited until Jan 24, 2020. I didn't get any adjustment credit so I contacted my bank to see if there were any incoming transactions. They told me there wasn't any and at this point I was just done with them. I filled out their RMA form and asked to return the product because I'm not paying 200 dollars more for a product that is of lesser quality + the horrible customer service I don't want to deal with. They gave me return instructions on the 27th of Jan and I sent it back to them. Oh I wish the problems ended by now. They received my product on January 30th. My refund has still not been processed as of February 12th, 2020 10:02 AM. My patience is running thin and I'm so close to opening a dispute with my bank if the refund doesn't process by the end of this week. I've bought dozens of musical equipment that costs thousands of dollars and this is the first time I ran into such problems. Other companies inform the customer when there is a problem and they give them an ease of mind. They also live up to the promises, but this company is a disaster. Not only do I have to email for every problem or update, but they also break promises.Update: They have refunded me finally, but this whole process was dreadful."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pierangelo De Pace",
          "Nb_Reviews": 1,
          "Date": "2022-03-11T09:39:22.000Z",
          "Titre": "I wish there was a way to rate the…",
          "Contenu": "I wish there was a way to rate the item, the vendor, and the manufacturer separately. Out of the box, the headphones came with three noticeable cosmetic defects: 1) unfinished/scratched yokes, 2) scratched aluminum frame in the back, and 3) emerging separation on the plastic component on the back of the right earcup, which does not clip back in place.I initially tried to live with them, until, less than two weeks after receiving the product, I decided to report the issues to the manufacturer (HEDD) first and later the vendor (headphones.com). HEDD asked me to send the item to them. They would fix it for no less than $500 or $600, depending on the type of intervention. After weeks of back and forth by email, headphones.com finally concludes:  \"As HEDD was not able to replace the headphones, we would not be able to offer a replacement. As these are cosmetic issues, they would need to be reported when received as there is unfortunately no way to know if they were scratched out of the box or if it occurred from use.\"Wonderful. It was probably my fault for not reporting everything to headphones.com immediately and, for this time, I will simply have to bite the bullet. I spent almost $2,000 for a pair of headphones in such poor manufacturing conditions. I will try to sell the headphones at a heavily discounted price.Customers beware, as headphones.com does not seem to stand behind the quality of the products they sell. I will unlikely do business with them again. I should have purchased from Amazon as I usually do.The HEDDphone sounds amazing, though. It's truly a wonderful piece of technology. Five stars for sure!UPDATE (to reply to headphones.com): My first correspondence with headphones.com was on Feb 19, as correctly stated in their reply below. My first correspondence with the manufacturer (HEDD) was on Feb 7. I mentioned in my review that I first contacted the manufacturer. I mentioned the same in my email exchange with headphones.com. So only six days after receiving the item. I tried with headphones.com only after being quoted so much by the manufacturer for a repair on an item that was supposed to be brand new (on Feb 15). This is explicitly mentioned in my message above, and your customer service knows about it (check my correspondence with them).I stand behind the claim that it is a wonderful product indeed. I gave it 5 stars here and on your website. The one star is for my experience with you, as vendors. The quote of mine that you reported from my email exchange with customer service clearly shows that I noticed these defects with time (what is the deadline to notice a defect anyway? One hour? One day? One week? Sure... I won't make the same mistake next time). In particular, I realized that the yokes of my unit are unfinished/scratched after comparing them with those of a friend who owns the same headphones. The defect might be light (it's not, unfortunately, even if it does not affect the functionalities of the product), but it's not what it is supposed to be. That's HEDD's fault.It's interesting that you could conclude that I placed the headphones on a hard surface (without even mentioning it once in your correspondence with me) by looking at pictures in which the headphones are correctly placed on their stand, or in my hands. I guess this statement is just as questionable as you are questioning the truthfulness of my review, implying that I caused the damages (which I did not). Couldn't the scratch be there already before the item was boxed? What about the separating plastic components on the earcups, which are getting worse every day by just light use? Is an emerging and developing product defect after just two or three weeks included in the price? And the unfinished yokes? Clearly not your fault, but you are the vendor and have unloaded all the risk on your customer.I understand it's my word against yours. I will bite the bullet. Not a biggie in the big scheme of things. You've got my money (I am sure it was not scratched, any defects with my payment?) and also this one-star review. My business will go somewhere else. For my next Audeze LCD-5, I will SURELY use Amazon! I am sorry, but at this price point I expect perfect working AND cosmetic conditions. Two weeks to detect cosmetic issues do not look that much, but that's probably just me. It's a little sad that you are implying I damaged the product. What evidence do you have? There's clearly a reason why Amazon can be trusted so much. I have returned expensive stuff for much less, without a problem. I should know better. Totally my fault.UPDATE 2: You are right, I spent $1499. Not almost $2000. I checked the current price of $1899 a couple of hours ago, could not remember exactly what I spent for the item two months ago. The substance does not change. It's still $1499. Quite a lot."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "NotAgain",
          "Nb_Reviews": 5,
          "Date": "2023-10-31T22:54:46.000Z",
          "Titre": "The lack of communication was totally…",
          "Contenu": "The lack of communication was totally unacceptable. Shipping a month late and having to reach out to get feedback on a $2000 purchase that they had already charged me for is terrible customer service. Probably won’t buy from them again."
        },
        {
          "Note": 2,
          "Lieu": "NG",
          "Pseudo": "shuaibu",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T01:57:38.000Z",
          "Titre": "it’s a simple activity"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeff Grigsby",
          "Nb_Reviews": 9,
          "Date": "2023-04-29T17:58:23.000Z",
          "Titre": "It has been 8 days and I have not…",
          "Contenu": "It has been 8 days and I have not received my headphones. My work cans died and I needed something quick to edit a voiceover for a video project. Unfortunately, I had to order next-day shipping from another vendor to complete my deadline and will be sending the Maxwell unit back when it rrives, these were shipped ground from Washington State to South Florida. :( It is unfortunate because I have always received my orders in a timely manner in the past and am a fan of your Youtube Channel. But in all honesty, I would be hesitant to order from Headhones.com again after this experience, especially when many other suppliers offer free 2-day shipping."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Randy Belk",
          "Nb_Reviews": 3,
          "Date": "2023-01-18T06:35:10.000Z",
          "Titre": "I bought a Burson Playmate 2 and after…",
          "Contenu": "I bought a Burson Playmate 2 and after about 3 months it quit working.  I contacted Headphones. Com and they told me they would contact Burson.  They did and I have been in contact with Burson as well but communication is slow and not very informative.  I have been waiting right at a month now for a resolve.  Have not gotten one yet other than they will let me know something when they hear from Burson.  I don’t know where the problem is but I feel someone has dropped the ball in the customer service department."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gumersindo Giboyeaux",
          "Nb_Reviews": 2,
          "Date": "2023-04-15T15:53:33.000Z",
          "Titre": "The return process is not customer…",
          "Contenu": "The return process is not customer friendly.  I had to fill out a form on the site to request a return.  It says to explain why but dose not leave a section to do so.  So I put it in the other information section.  Than I had to over explain why I am returning the headphones to a rep through email.  Then wait for him to finally decide that I am \"eligible\" to return the product. Then I had to wait for him to approve a return label.  Now I have to wait for it to be processed and reviewed before I can get my refund.  Just seems like a big hassle that I never experience anywhere before.  I only had the headphones for 3 days.  My order was already returned and delivered but I have no idea as to if it is being processed for refund or not.  It dose not show any information regarding this on the account page.  This is my first time here."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Harry Quandt",
          "Nb_Reviews": 1,
          "Date": "2022-09-29T00:11:10.000Z",
          "Titre": "Two stars for poor communication",
          "Contenu": "Two stars for poor communication. Ordered pads for my Focal Clears. Basic shipping was $14 - quite a lot for an extremely lightweight item.  UPS couldn’t deliver since I wasn’t home and the package required signature. Signature - really??  That was never mentioned in the ordering process. Cost me an additional $6 to reroute the delivery to a UPS office. Definitely not a seamless experience!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Andrew Morell",
          "Nb_Reviews": 2,
          "Date": "2022-11-19T17:28:54.000Z",
          "Titre": "Shipping cost and time for an item that…",
          "Contenu": "Shipping cost and time for an item that is under 1 pound was unacceptable"
        },
        {
          "Note": 2,
          "Lieu": "TH",
          "Pseudo": "George",
          "Nb_Reviews": 2,
          "Date": "2022-08-16T06:56:26.000Z",
          "Titre": "restocking fee killed my IEM hobby",
          "Contenu": "The purchasing process and enquiry response time is good.However, the return policy is not very clear. At the top of the page in \"Return Process\" it implies restocking fees can be avoided if \"your item must be in like-new condition with its original packaging.\"But later I found out much lower in the page it also says base restocking fee 10% plus 5% for IEM. 15% is a lot for restocking fee. This kills my interest in the high end IEM hobby as the only way to try them is to buy them and it doesn't make sense to keep paying 15% until you find the IEM you like."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David Parker",
          "Nb_Reviews": 2,
          "Date": "2022-08-06T19:38:02.000Z",
          "Titre": "My package was shipped over a week ago…",
          "Contenu": "My package was shipped over a week ago and now on 4 day delay while Post Office tries to deliver a package.    No reason for a delay like this!!!    Makes me think I will really check shipping methods on these products in the future."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Jianwei Wang",
          "Nb_Reviews": 1,
          "Date": "2021-05-22T23:46:42.000Z",
          "Titre": "Fast shipping",
          "Contenu": "Fast shipping, but, but! but!! but!!!, crazy ridiculous process fee, for a 149USD item, you have to pay 40USD process fee, that's crazy robbery，yes, i know it's UPS robbery, but why UPS, USPS also not bad, and you can not refuse to receive unless you pay return shipping and you can not get these ridiculous fee back, so international buyer, better go for other dealer."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Avi Shapiro",
          "Nb_Reviews": 1,
          "Date": "2022-02-02T15:08:15.000Z",
          "Titre": "Not happy",
          "Contenu": "Not happy. I received an item I did not enjoy and they charged me almost 30% to return it in like-new condition. Many other sites offer free returns without restocking. Also it took over a month past when they said it would be shipped. I'd avoid this site."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Quaeres",
          "Nb_Reviews": 1,
          "Date": "2022-05-04T19:20:54.000Z",
          "Titre": "After waiting for so long for the Mini…",
          "Contenu": "After waiting for so long for the Mini i-3 to be in stock, the item arrived missing remote battery which cost me at least another $40 - $50 in time, fuel–due to driving around to obtain the proper cell and the actual purchase of the battery. This particular cell is not stocked as much as others. Yes, it could be ordered on-line but I still would have missed presenting and setting it up for my friend's birthday.Andrew said he was unaware the unit was no longer shipping without a remote battery. It is his responsibility to check for updates to his product shipment restrictions. I recently received 5 other orders of audio equipment with remotes. They all had batteries with the remote!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Steve Ash",
          "Nb_Reviews": 3,
          "Date": "2021-03-17T18:50:18.000Z",
          "Titre": "Shipping was delayed and 12 days to…Not the best service experience.",
          "Contenu": "Shipping was delayed and 12 days to receive the product with a first time customer and product reviewer.They said they were sorry and offered me a $25 card after the sale when they just could have given me their 2 day shipping! I’ve received products from China and South Korea faster!Not a happy customer."
        },
        {
          "Note": 2,
          "Lieu": "ZA",
          "Pseudo": "Malcolm Sangster",
          "Nb_Reviews": 1,
          "Date": "2021-02-03T03:55:10.000Z",
          "Titre": "Incorrect Shipping Option",
          "Contenu": "I chose the FedEx Shipping option but the package was incorrectly sent via USPS. The problem was corrected but at the end of the day I paid a premium for a service that I did not receive and the delivery has been delayed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "THOMAS",
          "Nb_Reviews": 2,
          "Date": "2020-08-25T19:50:44.000Z",
          "Titre": "Poor communications and follow through",
          "Contenu": "Reluctantly, I have to say that headphones.com is very lacking when it comes to communicating with clients and follow up.  They have not responded to many emails and requests in chat sessions.  When I decided to cancel an order before shipment, they did not respond.  I finally had to get my credit card company to dispute the transaction to stop it.  Even then they did not respond.  Despite all this the order shipped and they said they would divert it to their warehouse.  When they didn’t follow through, I intervened, paying FedEx $18 to divert the shipment to headphone’s office.  They have a great website, offer great products but, despite claiming to welcome comments, they don’t respond."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Andrii Burov",
          "Nb_Reviews": 2,
          "Date": "2020-10-20T20:18:23.000Z",
          "Titre": "Shipmet services issue",
          "Contenu": "Item is ok.The problem is a shipment delivery, especially seller attitude to it.No one has answered my emails about delivery issue, which have happened because of incorrectly requested of ups service.To fix this issue in future please make sure you don't require signature without providing text notification about ups arrival time range. Otherwise it is cost to much nerves , time and money to receive a shipment.In my case Item was only 75$ valueBut I had to spend total 4 hours chasing shipment.20$ fee to pick up on weekends. On work days people usually work and don't drive to ups storages.Plus 50$ Uber cost drive to other city and back.So total experience was not worth it.You need to improve your order form to allow user to choose ups text notifications if you require a customer signature."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Trickler",
          "Nb_Reviews": 5,
          "Date": "2022-08-29T02:01:42.000Z",
          "Titre": "The left earphone did not work",
          "Contenu": "The left earphone did not work. I had to send away for new connecting wires for headphones to work"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "kjt",
          "Nb_Reviews": 1,
          "Date": "2022-01-23T22:28:49.000Z",
          "Titre": "Cord deteriorating after few weeks :(",
          "Contenu": "Cord is deteriorating after only few weeks. Unfortunately, the cords don't seem to be of good quality at all."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joseph Condon",
          "Nb_Reviews": 2,
          "Date": "2022-10-30T00:12:23.000Z",
          "Titre": "too heavy",
          "Contenu": "too heavy, otherwise great sound"
        },
        {
          "Note": 2,
          "Lieu": "ID",
          "Pseudo": "Zaenal Muslihin",
          "Nb_Reviews": 2,
          "Date": "2021-05-23T22:58:29.000Z",
          "Titre": "USPS service in Indonesia",
          "Contenu": "There is no faster delivery option for free shipping, in Indonesia the usps service is very slow and annoying"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jim Hong",
          "Nb_Reviews": 3,
          "Date": "2019-12-28T21:22:36.000Z",
          "Titre": "Order disappeared into the ether.",
          "Contenu": "Placed the order. Item was in stock. 3 days later, no notification. Even after sending email inquiring about status."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dhananjeyan Natarajan",
          "Nb_Reviews": 1,
          "Date": "2020-10-11T21:27:38.000Z",
          "Titre": "Preordered the hd 560s ship time keep…",
          "Contenu": "Preordered the hd 560s ship time keep changeing and they didn’t email me telling why it keeps getting delayed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "firstName lastName",
          "Nb_Reviews": 1,
          "Date": "2022-04-29T22:05:37.000Z",
          "Titre": "If it is something you can find at a…",
          "Contenu": "If it is something you can find at a larger retailer like Amazon, go there instead."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John in Mid Missouri",
          "Nb_Reviews": 5,
          "Date": "2021-12-13T18:06:11.000Z",
          "Titre": "Shipped my order to the wrong address - without asking me",
          "Contenu": "My issue here is customer service, not selection or the products I purchased. Ordered using paypal for payment. Selected to waive the signature requirement (and agreed to assuming all responsibility for loss or damage as I would expect). Contacted by April at Headphones.com who informed me that Paypal mandates a signature requirement beyond a certain $ amount. I specifically requested that they avoid the highly restrictive \"Adult Signature\" requirement, using the \"direct signature\" requirement that would allow me to send to to a FedEx Onsite. For reasons unknown, April sent my package not to me (so I could direct as I saw fit), instead, she sent it to an OnSite location of her choosing without asking me if this was acceptable. I asked to have it re-directed but that failed and it ended up going to the location she picked (seemingly at random since I am certain she has no idea where in my city I live with respect to this location). I even called the evening I found this out but no answer and no response...at all...other than the email asking where I wanted it sent to which I responded, but, that response failed to alter the delivery location). Maddening to have m order shipped to the wrong location this happen when I NEVER requested it. I have been a good customer but no longer after this shipping fiasco."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Richard A Garcia",
          "Nb_Reviews": 1,
          "Date": "2021-06-09T22:16:46.000Z",
          "Titre": "Customer service response time is…",
          "Contenu": "Customer service response time is mediocre."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "KARL ROUSSELL",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T14:57:12.000Z",
          "Titre": "You deliver real fast",
          "Contenu": "You deliver real fast, you get the product to your customers. Sooner than anyone else i bought from. It's returning products your not so good on. I had to returned a product and your not being very helpful on having this done!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Derek Hay",
          "Nb_Reviews": 1,
          "Date": "2023-01-30T21:44:15.000Z",
          "Titre": "Declined to give me a refund on a…",
          "Contenu": "Declined to give me a refund on a faulty item, giving store credit instead, despite that i had spent over $2,000 on four other items in the month prior. I was happy to purchase an alternate item, but felt this was unfair under the circumstance. It does not engender brand loyalty, if i am concerned what happens if one receives faulty goods."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James D",
          "Nb_Reviews": 1,
          "Date": "2022-12-05T21:10:20.000Z",
          "Titre": "Headphones showed sign of significant wear",
          "Contenu": "The headphones were described as open box like new but showed sign of significant wear including scratches on the outside, pilling on the ear pads, and the smell of cologne from the previous owner. Nonreturnable but not in the condition described. They sound good though."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-05-01T21:55:24.000Z",
          "Titre": "Misset expectations and poor communication",
          "Contenu": "I was originally attracted to the headphone.com website because google indexed their website as having the XBOX Maxwell available. Turns out they did not, and I did not get any communication of this or that I was on a wait list for it. I checked out as though the product was in stock.  When I inquired I found out that I had not actually ordered (even though charged) and that there was no ETA. Hard situation for Headphones.com, but they could have set expectations better."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Denni Apfelbacher",
          "Nb_Reviews": 1,
          "Date": "2023-02-11T09:25:56.000Z",
          "Titre": "The headphones  you need to know!!!!",
          "Contenu": "The headphones work well np. The fidelity, is well lacking. Measurements  per dcb at most levels at claimed dac or Bluetooth. By all means this is the best sounding headphones. I would wholly recommend. How ever, the cost and when at full volume it's obviously way beyond it's capacity. If your looking for a loud hard hitting headset like old Jack in and turn it up till you know it's to loud. This is not. Great for most. Not studios qualified  but very very close.  Bottom line ide buy for 500 at 800 no. Honestly"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shawn M.",
          "Nb_Reviews": 3,
          "Date": "2023-01-09T22:29:25.000Z",
          "Titre": "Great Options, but Customer Svc Needs Some Work",
          "Contenu": "PROs: 1.) The website is well organized and easy to use. Ordering is easy as well. 2.) April from Live Chat was great!CONs:1.) Return process is a bit deceptive as there are quite a few restocking fees. Should be more up front about this (i.e. restocking fees apply).2.) Return process is lengthy and not clear. In my case, I waited over a week to hear back on a return, finally received a notification and didn't know where to send it. Reached out via live chat and was told to use a label that I didn't know existed because it wasn't in the email."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark Peters",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T20:23:37.000Z",
          "Titre": "What's going on here?",
          "Contenu": "Yo - the left speaker in this headset rattles like it's already blown. How would I go about correcting this? I've only used it to listen in on phone calls and play a few games of Call of Duty."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "hike Aleksanyan",
          "Nb_Reviews": 2,
          "Date": "2022-12-26T23:35:27.000Z",
          "Titre": "Received an open-box item, paid for a new item.",
          "Contenu": "Shipping and product are 5 stars, but I received an open-box item.  The tape seal was already cut on my unit.  I paid full price for a new, sealed item; I did not select an open-box item."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert Dieringer",
          "Nb_Reviews": 1,
          "Date": "2022-06-15T01:27:30.000Z",
          "Titre": "Burson Soloist 3XGT",
          "Contenu": "Headphones.com provides a great service!  Very prompt action, follow thru and responses.Thanks!The Burson Soloist is a very good preamp.  Precise, and accurate,   but lacking emotion and a   vacuum tube   decay, and bloom  to the music  that for  \"me\"   makes music have more realism,   and not just a highly accurate recording.I want voices    \"fleshed out\"   and   the soundstage needs to convey   Human Presence."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Clarence Boggs",
          "Nb_Reviews": 2,
          "Date": "2022-07-18T22:25:50.000Z",
          "Titre": "Well it’s one thing to charge a…",
          "Contenu": "Well it’s one thing to charge a restocking fee, but to add on +5% for items like IEMs is a bit too much. When most people have no way of knowing how a IEM will sound before trying them. Some places won’t charge you at all if you buy something else 🤷🏻"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 3,
          "Date": "2022-06-23T00:12:15.000Z",
          "Titre": "You guys have a really good selection…",
          "Contenu": "You guys have a really good selection of headphones. I wish your shipping and handling aspects were a bit quicker with items shipping next day but in both of my purchases it was several days later. That being said, your reviews and customer policies certainly make up for it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kevin K.",
          "Nb_Reviews": 1,
          "Date": "2022-04-20T14:01:29.000Z",
          "Titre": "Why require a signature???",
          "Contenu": "I don't understand why this delivery required a signature. I work days, so when they tried to deliver it i wasn't home and they wouldn't leave it on my porch. Eventually they just left it at a UPS dropoff point, which is quite a ways a way from my house, and i don't own a car. The whole experience was annoying.Otherwise, the experience was smooth and i'm enjoying the product."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Greg R Holt",
          "Nb_Reviews": 1,
          "Date": "2022-01-05T23:20:28.000Z",
          "Titre": "When I ordered a material or the i e m…",
          "Contenu": "When I ordered a material or the i e m thanks for a great you guys I think I've ordered three times from you guys and on time I didn't have to wait long especially around Christmas you got it to me and what three days are they but when I'm talking about is the campfire aiem itself I was not happy it was"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Raymond Wong",
          "Nb_Reviews": 1,
          "Date": "2021-03-14T17:30:43.000Z",
          "Titre": "Three Stars for the way the item was…",
          "Contenu": "Three Stars for the way the item was shipped.  Grado box inside a padded shipping envelope is really not enough protection.  The headphones arrived undamaged but the Grado shipping box was pretty beat up.  It's a $420 limited edition headphone which I am collecting because it's my hobby to collect limited edition headphones..  But now since the box is beat up the total value of the headphone as a collectible has dropped significantly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chris Ellersick",
          "Nb_Reviews": 1,
          "Date": "2020-09-12T13:12:40.000Z",
          "Titre": "Never received item",
          "Contenu": "Never received item.  Emailed about the order (2 weeks later) and was told item would be shipped direct from manufacturer and order would be refunded.  After 4 weeks, contacted support again to formally request order cancellation and refund.  Order was refunded after that email (so issue is resolved), but I would have preferred to not have to follow up on the actions that were promised; thought that would have happened \"automatically\"."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Abhishek",
          "Nb_Reviews": 1,
          "Date": "2021-06-22T00:32:36.000Z",
          "Titre": "Watch out when you buy open box items",
          "Contenu": "Brough a set of $1000+ 64 Audio IEM and a Focal headphone. The headphone was nice, while the IEM was open box. No problem with the headphone, and it came sealed. The website mentions open box items as like-new condition. The item I received was not in such a condition. The IEM also came with wrong cable. I contacted support and shared requested info, there was no follow up afterwards. I contacted 64 Audio regarding the issue, and after 1 email conversation, they shipped me an upgraded cable via overnight shipping. kudos to 64 Audio on that"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brooks M",
          "Nb_Reviews": 1,
          "Date": "2020-08-16T00:41:50.000Z",
          "Titre": "Nonexistent Customer Service",
          "Contenu": "They promised next day delivery. I never got confirmation of shipping from them so I contacted them 4 times with no response.  I only got a response from them after I contacted the US distributor and complained.  I finally received what I ordered a week after promised.  They have no telephone and the only contact information they provide is to the \"info\" email which they studiously ignore.  I would not do business with them again.  Your mileage may vary."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patrick Champagne",
          "Nb_Reviews": 1,
          "Date": "2021-08-19T04:41:37.000Z",
          "Titre": "I ordered an open box $1290 headphone",
          "Contenu": "I ordered an open box $1290 headphone. A new headphone came in completely new packaging. It lacks bass, even though I'm told by staff that it is a model that is most bassy. I feel as if they should offer to cover shipping to send the unit back to them to test it on their ears to see that it is working properly and if it is, ship it back to me. If it isn't, replace it. I've had it about a week and mentioned the problem to them on day 1. I am using a Dragonfly Cobalt which helps. I feel they should go out of their way to help make sure I do not have a defective unit."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Christine Cassidy",
          "Nb_Reviews": 2,
          "Date": "2020-02-20T05:38:37.000Z",
          "Titre": "Full communication please",
          "Contenu": "Full communication pleaseYou need a phone number so people like me can talk you. It's called being available to help. As a result of no phone you missed a big buy on my part. If I'm going to spend 5 or 6 grand on products I'm going to need to chat with you especially if I have never done biz with you. So I call Todd in Montana. Sorry."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jon",
          "Nb_Reviews": 6,
          "Date": "2020-12-20T22:04:38.000Z",
          "Titre": "My earphones are great, however ...",
          "Contenu": "My earphones are great.  But the communication getting them was poor.  And when they got stuck somewhere in the mail, Headphones apparently found them and mailed them overnight to me, which would have been nice if they had informed me.  I had already pointed out that I wouldn't be home to receive them, so they sat on my doorstep for a few days until I got home.  Fortunately, no one stole them.  No apology.  I hope this was an isolated incident.  I had been a customer for decades.  Previous service had been good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mike Ruegg",
          "Nb_Reviews": 1,
          "Date": "2020-04-02T22:22:36.000Z",
          "Titre": "Three stars because the original…",
          "Contenu": "Three stars because the original shipment of Focal headphones was DOA. Left driver completely dead.  Somewhat slow to respond on the return and shipment of a replacement.  Hopefully things will speed up in response and getting a good pair of headphones to me.  Will update review once this gets resolved."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gordon Woods Jr",
          "Nb_Reviews": 1,
          "Date": "2020-04-15T22:45:54.000Z",
          "Titre": "I had a problem with them telling me my…",
          "Contenu": "I had a problem with them telling me my purchase was on the way.   It wasn't  even shipped yet.  It wasn't in stock.  I tried to cancel the order, and was denided.  They wouldn't let me.  I finally got my headphones when they received new ones.  I wouldn't buy anything from them again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Cardell",
          "Nb_Reviews": 2,
          "Date": "2021-03-10T19:52:13.000Z",
          "Titre": "Can't make a real review since order…",
          "Contenu": "Can't make a real review since order still hasn't been full-filled or shipped. They said it's up to HiFi Man for the order since it was a special order. Doesn't make sense because then why display a product that isn't ready?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "joseph chiapetta",
          "Nb_Reviews": 3,
          "Date": "2019-07-02T16:35:37.000Z",
          "Titre": "they are decent sounding headphones",
          "Contenu": "they are decent sounding headphones. i use them for movies more then i do music. i think that's where they are best suited. some songs they sound great some no so great. the source is a big deal with these. as a side note i did buy a balanced cable for them and it helped alot. for the price they aren't a bad investment. I had already said the service was great. The shipping carries lost the original headphones and they not only shipped another headphone but shipped a brand new one instead of the open box i had paid for. So 5 stars for service 3 stars for the product"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "TERENCE HANRAHAN",
          "Nb_Reviews": 1,
          "Date": "2018-12-28T20:20:05.000Z",
          "Titre": "Good site but how about a phone number?",
          "Contenu": "Personally, I'm a fan of a little more human interaction, especially insofar as I was buying a product not yet reviewed, so I had to make an educated guess based on my budget and the product category.I did look on the site for a phone number but did not see one."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MarkF",
          "Nb_Reviews": 1,
          "Date": "2018-06-14T21:27:02.000Z",
          "Titre": "First experience was mixed...",
          "Contenu": "I got the headphones I purchased at a small discount, which is positive.  But despite all claims that in-stock items ship in 24 hours, it took three days before they shipped the headphones and they never responded to emails I sent inquiring about if they had shipped yet.The website is pretty nice though the check-out system was buggy and took a few times until I was able to successfully place my order.Overall, it was a mixed experience.  I would expect better service from a dealer selling high-end gear.  I might give them another try if the price is right, but they haven't yet won my loyalty to be my go-to place to buy headphones."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Earl",
          "Nb_Reviews": 1,
          "Date": "2019-06-28T12:29:23.000Z",
          "Titre": "Think I am going to buy local for now…",
          "Contenu": "Think I am going to buy local for now on.Packaging was horrible and kind of half-as'd job. UPS guy was shocked the way this was boxed up. Spend $500.00 on head phones you should pack it out like it was your own."
        },
        {
          "Note": 3,
          "Lieu": "PR",
          "Pseudo": "Kenneth Klotzback",
          "Nb_Reviews": 1,
          "Date": "2021-06-01T13:22:20.000Z",
          "Titre": "Excellent service and delivery",
          "Contenu": "Excellent service and delivery, however they don't ship to Puerto Rico so I had to use a forward with my Family, which is not ideal since it should not be difficult to ship here."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David J Grais",
          "Nb_Reviews": 1,
          "Date": "2020-03-28T21:09:16.000Z",
          "Titre": "It is really annoying that Headphones…",
          "Contenu": "It is really annoying that Headphones provides no telephone number for people to call with questions. Email is not as good, especially when spending $5,000. Otherwise, its service was satisfactory."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "forbin",
          "Nb_Reviews": 1,
          "Date": "2021-03-01T13:59:40.000Z",
          "Titre": "don't deliver when promised... more than once",
          "Contenu": "I have ordered a couple of headphones. The HD800s were said to be in stock and really wasn't and arrived a week and a half after I ordered them when it was supposed to be delivered overnight. I pre-ordered the Focal Celestee, got a confirmation and update that headphones.com were expecting delivery from Focal with Fedex tracking and that mine would be shipping the next few days. Then a week goes by and I ask when mine were shipping and told that i didn't make the cut off of the lot that was received. Expectations are set and then are not met more than once... communication is OK but at the end of the day the customer expects what they order get it when they are told. To be fair, they didn't give me a credit one of my orders for the inconvenience of the in-stock issue and i gave one star back..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John K",
          "Nb_Reviews": 2,
          "Date": "2022-02-23T21:22:58.000Z",
          "Titre": "Purchased　Open Box Item.",
          "Contenu": "Purchased　Open Box Item.A couple of key components,　which should be included were not in the box.   Follow up service was Fine by customer service."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Gabriel Brouillet",
          "Nb_Reviews": 1,
          "Date": "2022-12-03T15:43:36.000Z",
          "Titre": "Tell us that the prices are in USD",
          "Contenu": "I have only one issue with my experience, that I consider really important. As a Canadian, I expected the price of the product I was interested in to be in CAD. The real problem is that no where in the billing process it was written that the prices was in USD, which is not really surprising, but I would really would had appreciated to know that before my purchase. I would consider continue to shop with you if this problem could be fix."
        },
        {
          "Note": 3,
          "Lieu": "IE",
          "Pseudo": "Austin Kingrey",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T21:35:55.000Z",
          "Titre": "Final sale terms are rather confusing…",
          "Contenu": "Final sale terms are rather confusing for someone not used to buying from this site. Making such a huge deal of the return policy only to find out that a newly purchased item doesn't include it, feels pretty bad."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "M.L.",
          "Nb_Reviews": 1,
          "Date": "2021-05-14T19:20:49.000Z",
          "Titre": "TL/DR: Great headphones, purchase elsewhere if not in US.",
          "Contenu": "Headphones are great, but purchase elsewhere. Super comfortable for long sessions with its really light plastic build yet still feeling durable. Sound is really clear, more or less neutral sounding but fits my usage perfectly. Only little annoyance about the headphones are the cable. Super long but otherwise still a great product. Only downside of this purchase was that fact that I paid a significant amount of tax and duties from purchasing internationally (from Canada). I paid almost half the cost of the headphones just in duties and taxes. If you are a Canadian resident and looking to purchase from this site I would steer clear from it and purchase locally. The \"free shipping\" to Canada will end up with you paying UPS absurd amounts in \"Customs Brokerage Fees\" on top of the \"Government Charges\" you will have to pay as well. Don't make the same mistake I did."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Ss",
          "Nb_Reviews": 1,
          "Date": "2021-02-16T15:18:33.000Z",
          "Titre": "This is 3 stars rather than 5 because…",
          "Contenu": "This is only 3 stars rather than 5 because they kept spamming me with emails to submit this review.  Rest of the process was great."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John in Mid Missouri",
          "Nb_Reviews": 5,
          "Date": "2020-12-10T20:44:18.000Z",
          "Titre": "Good deal but not entirely what I was expecting.",
          "Contenu": "The communication and shipping were solid. The product description was \"open box\"...while that leaves some room for interpretation, I generally think open box means all the original materials are included with minimal or undetectable wear and tear on the item in question. I would describe the  item I received as \"used\". There appears to be a screen protector on the unit which is OK, but, it has some \"stuff\" on it or under it and thus will need to be replaced and leaves me wondering - why was it left on? This item was shipped in the original box but items I would have expected in the box weren't included (no manual, no USB...but there were some stuck together screen coverings, presumably from the original packaging - why those were left in there is inexplicable). The unit itself seems fine so far but my expectations of what \"open box\" means (based on having purchased many open box/refurbished items in the past) diverged from what arrived, leaving me less satisfied that I was expecting."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jay W.",
          "Nb_Reviews": 1,
          "Date": "2019-11-06T19:08:35.000Z",
          "Titre": "Shipping from their warehouse could be…",
          "Contenu": "Shipping from their warehouse could be faster. Customer service after the sale was average."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Leo Smith",
          "Nb_Reviews": 1,
          "Date": "2021-03-22T07:15:06.000Z",
          "Titre": "Phones still not here even after the…",
          "Contenu": "Phones still not here even after the scheduled day being friday…"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Thanh Le",
          "Nb_Reviews": 1,
          "Date": "2021-04-14T06:43:51.000Z",
          "Titre": "U CANT RETURN OPEN BOX ITEM"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mason W",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T16:36:27.000Z",
          "Titre": "Great site for audio gear",
          "Contenu": "Good reputable site. They give the “no signature required” option for shipping which I appreciate. The only thing is how vague they are about back orders, I understand they probably know about as much as I do, but a general guesstimation would be nice."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brooksen Chancelor",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T21:23:04.000Z",
          "Titre": "I ordered a headset from Washington to…",
          "Contenu": "I ordered a headset from Washington to Florida on thanksgiving week, so the dilivery was a little ruff it was supposed to take a week and one day to arrive, i really wanted the headphone I ordered, so i asked questions afraid my package was stuck in UPS so i emailed them. Next day, i got a response from Headphone.com SOOO helpful and eased my worries, i know for a fact you are in good hands. The only reason i rate a 4 is because i didn’t like the wait, but what can tell you for a fact, when you order a package from Headphone.com you are in good hands and they reply to emails quick!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dorian",
          "Nb_Reviews": 3,
          "Date": "2023-11-27T22:01:58.000Z",
          "Titre": "Customer service has been positive in…",
          "Contenu": "Customer service has been positive in all my dealings with this company, products have been delivered on time and so far no quality control issues."
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "EH Lee",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T02:15:25.000Z",
          "Titre": "Thanks for tracking my order till…",
          "Contenu": "Thanks for tracking my order till fulfilment. Even the organisation unable to meet the projected date of delivery, but there was follow up throughout the entire process. Thank you.EH Lee"
        },
        {
          "Note": 4,
          "Lieu": "NG",
          "Pseudo": "Jerome Braih",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T18:59:25.000Z",
          "Titre": "Integrity",
          "Contenu": "Headphones.com apparently delivers their products in good condition and that's a great one for me to consider in doing business with them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike Manzano",
          "Nb_Reviews": 2,
          "Date": "2023-01-22T20:48:19.000Z",
          "Titre": "Bought Focal Utopias. Great customer service. Terrible shipping.",
          "Contenu": "I recently made a purchase on headphones.com and overall had a positive experience. The customer service was excellent and they even compensated me for a late delivery. However, I did have an issue with some items only shipping with FedEx, whose poor service reflected poorly on headphones.com. I would still recommend them, but keep this in mind when ordering. 4/5 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brayden",
          "Nb_Reviews": 2,
          "Date": "2023-01-24T22:00:11.000Z",
          "Titre": "Team helped fix return issues.",
          "Contenu": "Update: the reduction in restocking fee was never communicated with me. I appreciate the gesture as well as the responsiveness of their customer support. Took over 10 days past return being delivered and I still have not received a refund or any communication. If they are taking a restocking fee, they better get the refund done quickly.Will never shop here again. Policies are very misleading."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Josua",
          "Nb_Reviews": 2,
          "Date": "2023-02-06T20:25:32.000Z",
          "Titre": "IE200 mixed reaction.",
          "Contenu": "On the IE200 the comfort and fit are great. Could easily wear these for hours, but the sound is the issue.I wish I could give the IE200 two scores for sound. One with the stock tips and one with aftermarket tips. I was completely disappointed with the sound with the stock tips. They sound underwhelming and not worth $150. There are so many cheaper IEMs that sound better. But after watching Gizaudio’s video and then trying 4 different kinds of tips, I found some that fit tight enough and the sound improved exponentially. Can’t recommend them on the way they come but with the right tips the IE200 are fantastic and well worth $150.But the Headphones.com staff is great and I’m definitely happy with the service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Hillis",
          "Nb_Reviews": 3,
          "Date": "2022-12-29T03:05:34.000Z",
          "Titre": "Hifiman HE400se good product but bad registration process",
          "Contenu": "I recently bought a set of Hifiman HE400se headphones.  I received them in a little less than a week, which was fine.  I´ve found that they´re not as loud as two other pairs of headphones I have.  Perhaps that´s due to new technology (planar magnetic).  So I need to turn up the volume on my receiver.  That´s okay.  The sound is good and clean and they´re comfortable to wear.  When I went to register them online I was unable to do so.  First the website wouldn´t take a PDF of the invoice and verification of delivery.  Then it didn´t allow me to put in the verification field, wherein you type in the text of the squiggly letters and/or numbers in a field.  It kept telling me I was wrong, but I´m sure I wasn´t.  It makes me believe that the Chinese manufacturer doesn´t want customers to be able to register their products.  Who knows why--maybe warranty purposes?"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Maxime Caron",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T18:21:02.000Z",
          "Titre": "This shop is just perfect for getting…",
          "Contenu": "This shop is just perfect for getting and hight end audio stuff but the shipping is little bit too long for me"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Benjamin Koshy",
          "Nb_Reviews": 2,
          "Date": "2023-07-03T22:54:32.000Z",
          "Titre": "Quick and easy purchase with very good…",
          "Contenu": "Quick and easy purchase with very good customer support!My only gripe was the product pricing was quite misleading"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Arthur",
          "Nb_Reviews": 3,
          "Date": "2023-09-04T22:46:31.000Z",
          "Titre": "Great easy ordering process - fast delivery",
          "Contenu": "Great easy process. And great 365 Warranty was the discriminator.  I hope I never have to file a claim, but the peace of mind is worth it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bruce Bartlett",
          "Nb_Reviews": 3,
          "Date": "2023-09-12T07:54:20.000Z",
          "Titre": "Product and price were very good",
          "Contenu": "Product and price were very good; shipping delay of a couple of days was the only fly in the ointment.  Recommended."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 6,
          "Date": "2022-11-16T02:48:37.000Z",
          "Titre": "Competition is tough",
          "Contenu": "The advertising and presence was fantastic!! The only problem is the follow up and it was slow. I had other sellers calling imediately and for a $3,000 plus item that was needed. Anyway this is not my first purcahse from you and won't be my last. 40 years in the retail business taught me to be prompt and honest. Thanks RRo"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "GoodBoyShep",
          "Nb_Reviews": 1,
          "Date": "2022-11-22T18:26:01.000Z",
          "Titre": "Easy and good shipping.",
          "Contenu": "Easy and good shipping.2nd item I've bought from headphones.com Great return window"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MIchael",
          "Nb_Reviews": 1,
          "Date": "2022-11-27T17:45:06.000Z",
          "Titre": "Great experience and pleased with the…",
          "Contenu": "Great experience and pleased with the product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "HST",
          "Nb_Reviews": 2,
          "Date": "2023-01-23T23:48:31.000Z",
          "Titre": "What's up with the Sundara packaging",
          "Contenu": "What's up with the Sundara packaging?  It's a cardboard box with a sticker on it.  No manual.  Weird."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bill Tulloch",
          "Nb_Reviews": 1,
          "Date": "2023-02-20T01:19:15.000Z",
          "Titre": "I recieved my product very quick",
          "Contenu": "I recieved my product very quick. I had no problem with headphones.com. The product i ordered died within a week though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hasan El-haj",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T18:56:22.000Z",
          "Titre": "Amazing customer service",
          "Contenu": "Amazing customer service they really care and have attention to detail"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Miguel de Freitas",
          "Nb_Reviews": 2,
          "Date": "2022-10-21T08:25:31.000Z",
          "Titre": "Sennheiser HD-650 Headphones",
          "Contenu": "I called and asked them to match the price, another online vendor offered for the same product. They matched it with the understanding that at the the price they were matching, I was ineligible for the company's warrantee coverage. They emailed me an invoice, reflecting the agreed upon price; notified me when it was shipped; and sent me the corresponding tracking info, they'd promised me. The HD-650s arrived in good condition. They seem to be very well made (not flimsy) of a durable plastic. The fit is a bit too snug, but more comfortable than the last pair of 'phones I owned decades ago.  Midrange is good, and the bass a bit muddy, I've only been using them two days, so I expect them to improve with burn in. So far, so good. They are everything the rep at his keyboard led me to believe they would be. In parting, I should note all interaction with Headphones.com, up to this point, has been seamless. I highly recommend, doing business with them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Osvaldo Olivo",
          "Nb_Reviews": 1,
          "Date": "2022-10-03T22:31:54.000Z",
          "Titre": "Sundara Entry-Level PC Bundle",
          "Contenu": "The experience with headphones.com was great! I first ordered some headphones but then wanted to change to an entry-level pc bundle and customer service was able to help me make that change instantly! The only thing I did not like was that the entry-level Sundara pc bundle I purchased didn't have an RCA cable to connect the DAC to the AMP nor did I know what an RCA cable was. Since I am pretty new to audio equipment ( a complete noob) I had a hard time trying to figure out how and why I couldn't hear anything once I set everything up. After a few google searches, I realized I needed an RCA cable so I went to buy one at Target and was able to complete the setup. I just thought since it was an entry-level pc bundle it would include everything I need to start, but it's also my fault for not fully checking what came with the bundle. Overall not a bad experience. :)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dorian",
          "Nb_Reviews": 3,
          "Date": "2023-01-23T15:30:33.000Z",
          "Titre": "Knowledgeable",
          "Contenu": "Knowledgeable, helpful, give honest opinion about products"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Mark H",
          "Nb_Reviews": 1,
          "Date": "2021-11-22T03:44:01.000Z",
          "Titre": "Everybody loves a comeback!",
          "Contenu": "The complete lack of human interaction after a $1000 purchase, that was surprisingly pushed out 6 weeks from order, then to a full 8 weeks was crappy. The rebound was the effort to update weekly, and then ultimately the delivery of my Focal Clear headphones, which currently feel life changing. So...yeah exclusive access to the highest quality/value products is a thing!Mark"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Cheung",
          "Nb_Reviews": 4,
          "Date": "2021-12-01T23:53:31.000Z",
          "Titre": "Satisfaction would be 100% if.......",
          "Contenu": "The package was shipped shortly I placed the order. However, FedEx failed to deliver on the promised schedule (3 days behind). This is not the fault of Headphones.com at all but I was just a bit disappointed that FedEx has always failed to make delivery on time. Perhaps a different logistic vendor should be considered, such as UPS? Just a suggestion."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vernon Morris",
          "Nb_Reviews": 3,
          "Date": "2022-01-25T20:02:01.000Z",
          "Titre": "Had a problem with completing my order…",
          "Contenu": "Had a problem with completing my order on their website. the problem cleared up several minutes later. They ship quickly so the only other problem is fed ex shipping as their default shipping company, they don't deliver on Saturday without an additional cost. This is irritating at best."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrew Niesen",
          "Nb_Reviews": 1,
          "Date": "2022-02-18T00:21:19.000Z",
          "Titre": "Bad shipping (FedEx), Great Headphones",
          "Contenu": "Headphones were left outside and FedEx didn't bother to try to get a signature. Luckily someone was home to get it off of the roadside before anyone stole it. Otherwise the headphones are excellent and I hope they give an option for other shipping partners in the future."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LF",
          "Nb_Reviews": 1,
          "Date": "2022-01-09T21:17:56.000Z",
          "Titre": "Great deal, great sound quality",
          "Contenu": "The deal that Headphones.com had on the Focal Clears was great. Regarding the product, the Clears definitley bring audio quality up to the next level. You feel that you are experiencing a private concert inside your room. Soundstage extension, music resolution and frequency response is unparalleled. To me the Clears have an overall balanced sound signature with a very slight bump in the middle/upper treble. I use them with Tidal, Moon Audio's silver or black dragon cable and a Chord Mojo DAC. I am very happy with my purchase."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Geoffrey",
          "Nb_Reviews": 2,
          "Date": "2021-08-29T12:32:00.000Z",
          "Titre": "The Topping A50s amplifier is working…",
          "Contenu": "The Topping A50s amplifier is working just fine. My only complaints are with the FedEx delivery. One corner of the box was smashed, but the interior box was undamaged. FedEx also left the package in the mailbox by the street instead of bringing it to the front door on the porch; not very safe, but quicker for them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RM",
          "Nb_Reviews": 1,
          "Date": "2021-04-17T22:03:52.000Z",
          "Titre": "Purchased an open box set of…",
          "Contenu": "Purchased an open box set of headphones, and the original packing tape was cut open when I received them (a few days late showing up but I'm the dummy who still trusts the postal service)Really strange to see no new packing tape was applied when shipping a $1k item.Otherwise no issues, headphones arrived with noticeable wear on pads and strap but that's to be expected from a used set."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "rwtheisen",
          "Nb_Reviews": 1,
          "Date": "2021-04-28T22:07:02.000Z",
          "Titre": "The earpads for the Focal Clear…",
          "Contenu": "The earpads for the Focal Clear headphones are fine. My only concern is the manufacturer of the ear pads. I received the earpads in a brown box packed separately in small plastic bags. There was no Focal brand designation on the packaging. I trust that they are an authentic Focal product, but it would be reassuring to see a trademark or logo identifying them as such."
        },
        {
          "Note": 4,
          "Lieu": "NO",
          "Pseudo": "Svein Olav Nyberg",
          "Nb_Reviews": 12,
          "Date": "2021-04-06T11:55:46.000Z",
          "Titre": "Overall good service",
          "Contenu": "Overall good service, but some complication due to customer service not having read a message with the order. They did, however, correct this afterwards.Pre-purchase service is VERY good, and they even host their own forum for the type of product they sell (audio: headphones), without restrictions on contents or sentiments towards the products they are selling."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John England",
          "Nb_Reviews": 10,
          "Date": "2021-02-21T14:54:01.000Z",
          "Titre": "Would have been 5 stars if you used…",
          "Contenu": "Would have been 5 stars if you used anybody else to ship it with. They sat on it for three days and the the next day it only went 126 miles. The product itself is very good, a definite upgrade. And if you didn't tout same day shipping on your site it would be OK. When you make that kind of claim it leads me to believe I'm getting it quickly. Not so much. Actual DAC and amp are brilliant."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Timothy Sheehy",
          "Nb_Reviews": 1,
          "Date": "2021-04-08T22:02:06.000Z",
          "Titre": "Overall experience very good",
          "Contenu": "Overall experience very good.  Thank you for double-boxing and using FedEx.  The only suggestion is please use air wrap bags to stabilize the box inside the outer box.  The box was flopping around.  This is especially true when shipping to the east coast.  Thanks again, and will certainly consider future purchases with Headphones.com"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nate F",
          "Nb_Reviews": 1,
          "Date": "2020-12-27T18:52:05.000Z",
          "Titre": "4 out of 5",
          "Contenu": "5 stars if.... the headphones were allowed to go lower in volume (the quietest setting is a bit louder than I’d like) and if they fit more snug/secure on my head so that they didn’t move around as much when being even slightly active (walking/bending). Oh, and if the auxiliary cord was of more quality, especially given the price. Otherwise, great headphones 👍"
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Eliezer Gallego",
          "Nb_Reviews": 1,
          "Date": "2022-02-05T20:19:41.000Z",
          "Titre": "Great products, good prices, professionalism, and good customer service",
          "Contenu": "They have great products, good prices, professionalism, and good customer service, the only criticism I have is that they don't ship to Mexico so I had to have someone in the U.S. bring me the products, other than that I have no complaints."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2021-04-05T21:30:56.000Z",
          "Titre": "Good company with slow shipping",
          "Contenu": "They actually charged the amount listed. Companies usually add tax after. The shipping took around 9 days, hence the 4 star.Edit: FedEx says due to weather conditions and because the costumer wasn't available as a reason for late delivery, but both of those statements are not true. All my family members including  me were at home at the time they supposedly tried to do their delivery and the weather was pretty much sunny everywhere when they said it was delayed due to weather conditions."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Abid",
          "Nb_Reviews": 2,
          "Date": "2021-03-04T14:25:25.000Z",
          "Titre": "Focal Stellia + Arche Combo",
          "Contenu": "Responses were timely, though via email.  April was super helpful and Andrew was very friendly an welcoming.  I still think a business of this nature (technical with potential questions regarding equipment mismatch) need a customer service and support phone number.  Hence 4 stars.  Other than that the purchase was shipped the same day for overnight delivery.  It didnt get here till a week later but its not their fault as bad weather impacted FedEx delivery.  I would shop with them again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "hongzhou wang",
          "Nb_Reviews": 2,
          "Date": "2019-12-31T16:10:04.000Z",
          "Titre": "slow communication at first, but awesome customer support overall!",
          "Contenu": "Initially I ordered AEON FLOW CLOSED, and was told later they ran out of stock. Then they offered free upgrade of AEON 2 instead, the shipment of the new pair took a long time due to delay at the USPS. I contacted them with my frustration, and they followed up soon and offered expedited shipping as well as a gift card. Despite the initial wait on starting the conversation with them (only way is via emails), their customer service is great!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephan",
          "Nb_Reviews": 2,
          "Date": "2020-09-05T16:08:12.000Z",
          "Titre": "Happy with my purchase.",
          "Contenu": "The IEMs were shipped and arrived promptly. There was some kind of small problem as I was charged twice and immediately credited for one charge. My bank called me to find out what was going on. After I ordered, I immediately got a notice that the order had shipped from headphones.com and UPS so I stayed home all day to sign for them.  They were actually shipped the next day. These are minor things and their service in the past has been excellent. I won’t hesitate to order from headphones.com again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael D Miller JR",
          "Nb_Reviews": 3,
          "Date": "2021-08-09T20:01:06.000Z",
          "Titre": "I’ve ordered two sets of headphones",
          "Contenu": "I’ve ordered two sets of headphones, a portable amplifier and DAC as well as a desktop amplifier and DAC. Still waiting on the desktop which my understanding is a special order. Probably longer than I thought it would be. Everything else was delivered quickly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Fernando Pereira",
          "Nb_Reviews": 2,
          "Date": "2019-04-27T03:14:38.000Z",
          "Titre": "Great amp, friendly team, but lack of updates during delay",
          "Contenu": "This is the first time I bought audio gear from Headphones.com, and I'm very satisfied with the amp (Phonitor XE) thanks to the thorough review on the site that helped me in my decision. The team has been very friendly and helpful. When there was a delay in delivery due to customs apparently, they offered a discount. All good.  My only suggestion is that it would be good to update the client periodically when there are such delays."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Timothy F",
          "Nb_Reviews": 2,
          "Date": "2020-12-02T20:36:37.000Z",
          "Titre": "It was a bit complicated getting ahold…",
          "Contenu": "It was a bit complicated getting ahold of them to have the headphone cable replaced on my brand new Sundara headphones. As is typical these days, there is no phone number for customer service, none that I could find. But it has been replaced and the communication did step up pretty quickly!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nick Miller",
          "Nb_Reviews": 1,
          "Date": "2022-06-06T21:00:05.000Z",
          "Titre": "Good experience, just remember there are restocking fees",
          "Contenu": "This is an edit from a more negative reaction I had at first. I did have some initial shock because I did not read the fine print about restocking fees since I had read a review that stated no restock fee. Since then, I have gotten pretty responsive and very personal service from Alan. They were willing to work with me and waive 5% of the restock fee in this case, and were kind considering I was a bit emotional.Turns out I did decide to return the product as it was not a good fit for me. Alan replied instantly and approved my return (it's been over 30 days so I would not have been able to do this with another company). I do now see the value of the return policy and understand the need for restocking fees.Thanks Guys for the personal service."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Mathieu",
          "Nb_Reviews": 2,
          "Date": "2021-09-19T18:31:37.000Z",
          "Titre": "Should've read the fine prints.",
          "Contenu": "Very happy with my purchase, however I figured out after I made the purchase that the 1 year return period wasn't available with items on sale, I wished it would have said \"final sale\" on the item pages, similar to the B-stock items."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Martin van den Berg",
          "Nb_Reviews": 2,
          "Date": "2021-10-27T03:03:37.000Z",
          "Titre": "Replacement ear pads",
          "Contenu": "I ordered a pair of replacement ear pads for Focal Clear headphones, for when the time comes when the current ones wear out. They were 50% off so I couldn't resist. Unfortunately, they were backordered. They did eventually arrive and they are perfect. However, the ETA kept changing without updates being sent out. When I contacted headphones.com about when the order might ship they were always quick to reply, friendly, and helpful. Clearly, the worldwide supply shortage and shipping difficulties had a lot to do with this and it was no fault of headphones.com. Still, the long wait did affect my experience so I give it 4 out of 5."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Samuel Justice",
          "Nb_Reviews": 5,
          "Date": "2020-03-22T21:15:59.000Z",
          "Titre": "Great Customer Service!",
          "Contenu": "My experience with everyone at headphones.com was great. Unfortunately, the headphones I ordered said they were in stock, but were actually out of stock. That was a bit of a headache. However, Andrew went above and beyond to make the situation right! So, overall, I would recommend this website!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Barry H",
          "Nb_Reviews": 1,
          "Date": "2021-07-29T21:45:35.000Z",
          "Titre": "Be Aware FedEx shipped with signature…",
          "Contenu": "Be Aware FedEx shipped with signature required.While I get it, it ended up being a lot of bother since the 15 minutes that someone wasn't home was when they tried to deliver it, and then leave my >$1000 of headphones at a random Walgreens and I wasn't going to be home during the day the following day.  Ended up having to go through the whole bother of getting a fedex account to forward it to their holding center instead of a random Walgreens and then make a special trip out to where that was just to get my headphones.  Gear is nice, well-packed, and all that.  But the signature requirement ended up being a huge pain."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "R.Harish",
          "Nb_Reviews": 7,
          "Date": "2013-11-13T15:40:44.000Z",
          "Titre": "One of the Rare Places that actually know their Stuff",
          "Contenu": "Been a few years since I last puchased a head set and Bose has been my choice everytime, but giving such an expensive piece to equipment to a teenager seemed like a bad idea so I decided to give these guys a call. Ended up buying a creative headset which though not as good as what I use was quite brilliant for a fraction of the cost. The perfect place to meet all your auditory needs for sure."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "FRANK ACCARDO",
          "Nb_Reviews": 1,
          "Date": "2019-08-02T23:24:28.000Z",
          "Titre": "No 3.5mm plug/adapter!",
          "Contenu": "Honestly, package arrived on time and what a package! Headphones are spectacular. Just one \"minor\" detail doesn't get you 5 stars: there is no 3.5mm plug/adapter included, fortunately my friend next door had one otherwise I could have (as beautiful as they are!) only looked at them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rudy Perea Jr",
          "Nb_Reviews": 4,
          "Date": "2021-02-01T17:51:28.000Z",
          "Titre": "Great service and competitive prices",
          "Contenu": "Great service and competitive prices.  I am going to inquire about shipping status.  Possibly UPS is not updated for some odd reason.  I have no doubt the missing information will not be a problem.  I look forward to getting a DAC this time, AudioQuest red."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alaskan Experience",
          "Nb_Reviews": 2,
          "Date": "2021-06-09T21:07:13.000Z",
          "Titre": "The SERVICE was great",
          "Contenu": "The SERVICE was great.  Ultimately read the fine print about shipping and signature required.  Ship it to somewhere that you can sign for the product.  I'm sure they've dealt with it enough that they deem that extra process worth it.  It would be nice to have an opt-out assuming the risk however.  I had to have the product held and then pick up at FedEx (Which would have been OK but they've updated their ID guidelines requiring the delivery address be on your ID and mine has a PO Box.  A real hurdle if I had specified the address as my work address).  The people I worked with via e-mail and support were great though so props to them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dorian",
          "Nb_Reviews": 3,
          "Date": "2022-01-31T19:04:48.000Z",
          "Titre": "The product I purchased was not what I…",
          "Contenu": "The product I purchased was not what I expected and that was disappointing but the customer service was very good.  In the process of returning the item, but so far the customer care has been good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Humberto Bravo",
          "Nb_Reviews": 3,
          "Date": "2021-09-07T02:36:11.000Z",
          "Titre": "People at Headphones are both honest…",
          "Contenu": "People at Headphones are both honest and knowledgeable. Tried a couple of DACs and ended up buying from them, not only for their product but the help given to me specifically by Allen. Would recommend them anytime."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CHARLES HARRIS",
          "Nb_Reviews": 2,
          "Date": "2021-12-22T19:03:11.000Z",
          "Titre": "The Moondrop Kato are my first IEMs and…",
          "Contenu": "The Moondrop Kato are my first IEMs and I am totally impressed with them.  They provide clear details of the instruments, excellent vocal reproductions, the bass levels are not overwhelming. The comfort and fit are great with the silicone ear tips and most of all they do no fall out of my ears.  Being an audiophile I never expected to get this quality and robust sound from earphones. The review done by your staff person was factual and detailed in helping me to make my decision regarding the KATO IEM.  I look forward to the sound getting even better over the next several months.  I have had them for only one week and just totally blown away by them.  The only downside was the shipping and delivery.  The delivery info was misleading."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "enrique del valle",
          "Nb_Reviews": 2,
          "Date": "2021-01-08T02:55:10.000Z",
          "Titre": "Simple and easy",
          "Contenu": "Simple and easy, things are prices as they should be and the website is easy to navigate. Notification such as shipping info does go to either spam or promotion email wich can concern you the first time, other than that it was great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mary Jacobs",
          "Nb_Reviews": 1,
          "Date": "2022-03-30T23:12:04.000Z",
          "Titre": "Headphones.com were efficient at…",
          "Contenu": "Headphones.com were efficient at sending me my order and helpful about an plug issue. I only wish there had been more details about the plug, simple instructions would have helped."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas Shumaker",
          "Nb_Reviews": 4,
          "Date": "2019-11-27T05:36:12.000Z",
          "Titre": "Good Retailer",
          "Contenu": "I really like headphones and their products but communication on my order was not good.  It took a long time to get my headphones and they did not keep me updated.  I will still use them and recommend them but I am just saying this could be improved."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Barry Peters",
          "Nb_Reviews": 2,
          "Date": "2019-04-02T16:36:14.000Z",
          "Titre": "Issues Made Right",
          "Contenu": "I had some communications issues that resulted in me not knowing where my item was (lack of tracking info) and whether it had even been shipped by the time it should've been delivered.These, I found out later, were due to explainable circumstances for a small firm. I found this out when the CEO Andrew reached out to me with profuse apologies. The next day he set up a call to hear my story in detail.At the end, he gave me large discount for my issues and spent time talking with me about how to get the most enjoyment out of my purchase.After all this, I wholeheartedly recommend them for their personal touch."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 3,
          "Date": "2021-04-25T17:41:12.000Z",
          "Titre": "Great Products",
          "Contenu": "Headphones carries great products and ships quickly. Although I have not used it, the 365 day return gives me confidence buying headphones and iems. But, communication is lacking. My last order never had a shipping confirmation. I had no way to track it, and it arrived “signature required” when I was not at home. I tried to actively pursue order information, but when I tracked the order number in the email I was directed to an ad for product. I had to scroll through several products to get to the order information. Even when I got there the info was never updated. Very frustrating. When people are trying to track an order, putting up obstacles to that information only produces more frustration."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Ralf Brauchler",
          "Nb_Reviews": 1,
          "Date": "2021-05-27T05:55:23.000Z",
          "Titre": "Fast and good",
          "Contenu": "Fast and good, but ... just one thing:I ordered from Germany and before doing that I asked in your chat about how it works with taxes and customs. The answer was not perfectly correct stating, that I will get a \"preview\" or information in the checkout if there will be something additional to pay. That did not happen. I was not surprised that I had to pay extra customs and taxes, but I had to get this information from elsewhere. I think it would be very helpful to give this information on checkout, even if it's not an exact amount. Maybe just the information that there will be taxes and customs would help, but even better to link a page that does the calculation or calculate an estimation would be great."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Shaun Beauvais",
          "Nb_Reviews": 1,
          "Date": "2021-01-19T21:37:20.000Z",
          "Titre": "Best place to purchase headphones…",
          "Contenu": "Best place to purchase headphones related stuff. Only wish they would support affirm or paybright payment option. Thats is the only reason why iys not a 5 stars, when u sell stuff over 1k$ its a must In my opinion"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Samir Wong",
          "Nb_Reviews": 4,
          "Date": "2019-02-11T19:39:46.000Z",
          "Titre": "Andrew was great",
          "Contenu": "Andrew was great, he was very responsive and helpful.  I would have give 5 stars if there was also a mechanism to have a phone conversation; this would have allowed me to ask some more nuanced questions about the headphones themselves."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Hunter",
          "Nb_Reviews": 3,
          "Date": "2019-07-17T00:51:33.000Z",
          "Titre": "4 Stars and Rising!",
          "Contenu": "Headphones.com is a really new and great idea for those of us looking to build a headphone centered audio system.  They understand that unlike all other audio equipment, headphones are so important to audition.  Like speakers, all headphones have their very own sound and characteristics.  Unlike speakers, you also wear headphones.  So we have to audition another element of the equipment.  Their return policy is the best.  As a business, I think they are still working out some operating kinks.  And I believe they will in short order.  I have found that the Headphones.com team is very customer focused and is doing their best to create something special in this space.  Cheers!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephen D",
          "Nb_Reviews": 4,
          "Date": "2023-05-01T00:41:27.000Z",
          "Titre": "Solid customer service and especially…",
          "Contenu": "Solid customer service and especially responsive people returning emails promptly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patrick White",
          "Nb_Reviews": 2,
          "Date": "2018-08-24T17:13:11.000Z",
          "Titre": "Amazing in almost every respect",
          "Contenu": "Amazing in almost every respect. Sometimes it would take two emails to get a response, but that's a tiny complaint. Huge huge fans. Customer for life and will recommend to all of my friends (all ready have!)"
        },
        {
          "Note": 4,
          "Lieu": "IL",
          "Pseudo": "‪Oz Avraham‬‏",
          "Nb_Reviews": 1,
          "Date": "2021-06-24T14:32:48.000Z",
          "Titre": "Nice staff.",
          "Contenu": "The support team is very good, I got answers about all my emails, and detailed info more than I expected.I can recommend. I had delay with my order, but it wasn't their fault."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2019-03-09T00:37:20.000Z",
          "Titre": "Very good order response and shipping",
          "Contenu": "Very good order response and shipping. Offering a discount after the sale and then not responding was somewhat frustrating. The Stellia headphones are excellent...great clarity, accuracy and spatial depth."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Nathan",
          "Nb_Reviews": 1,
          "Date": "2021-07-01T20:02:13.000Z",
          "Titre": "Not enough communication when preordering",
          "Contenu": "I preordered a headphone but it hasn't shipped yet, and I haven't received any sort of estimate of when it might ship. I wanted to wait before giving a rating because it seems a little unfair to rate a service before the service actually does its thing, but I just received a reminder email to rate my experience with Headphones.com, so this is just what I have to say for now.UPDATE: The headphones ended up shipping earlier than the estimated ship date, so that was great. Shipping was also done with DHL, which I really appreciated because receiving an imported package (to Canada) is so much with DHL than with FedEx. I also found that I had accidentally added headphones.com's email address to my blocked senders list, so I had missed some emails from them (so that's on me)."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Pierre M",
          "Nb_Reviews": 3,
          "Date": "2021-04-21T20:17:00.000Z",
          "Titre": "Service was good",
          "Contenu": "Service was good. Some delays getting the item shipped out. I wish they dont use UPS and FEDEX for canada shipping as they  charge more for custom clearance... but its ok."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul Raffeld",
          "Nb_Reviews": 3,
          "Date": "2021-07-31T03:26:57.000Z",
          "Titre": "The Ayra and my 800s.…",
          "Contenu": "As far as ordering and delivery there were no problems.  The Ayras arrived on time and in good shape.  I am now in the brake in period.   They sound quite good out of the box but are lacking in stage width and depth.  I currently own a Sennheiser 800s and while competitive, the magnetic planar system should sound quite different.  You should know that I am 81 years  old and I use hearing aids. They work fine with the 800s and will work fine with the Ayra.  That said, I am an old audiophile who is just getting back into the game. No speakers, just headphones.  It would have helped so much to have spoken to someone in your shop to answer some questions and help with some concerns before buying. It is the reason four the 4 stars instead of 5. I will let you know as the brake in period progresses.  I have a Technics Cd/SACD  player and a Topping A90 amp."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jake",
          "Nb_Reviews": 2,
          "Date": "2021-12-21T20:10:44.000Z",
          "Titre": "Great people behind the company",
          "Contenu": "Great people behind the company. Good prices on all their inventory. I do wish they offered a faster shipping option for a more reasonable price though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Larry Goodwin",
          "Nb_Reviews": 2,
          "Date": "2019-10-15T17:44:15.000Z",
          "Titre": "Check It Out!",
          "Contenu": "A selection of quality headphones, dacs and other audio gear at competitive prices. Coupled with their generous return policy and customer focus make it a site worth checking out."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "George H",
          "Nb_Reviews": 2,
          "Date": "2021-03-29T18:19:25.000Z",
          "Titre": "Excellent in terms of shipping but I…",
          "Contenu": "Excellent in terms of shipping but I never got a response to my question about warranty service. I just did some searching online and went ahead and jumped on it"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "cth",
          "Nb_Reviews": 1,
          "Date": "2021-07-14T23:10:38.000Z",
          "Titre": "Items on time and as expected",
          "Contenu": "Items on time and as expected, though I do wish the manufacturer box had been placed inside a shipping box. The site has very in-depth and helpful reviews."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Peter",
          "Nb_Reviews": 1,
          "Date": "2021-06-21T18:09:15.000Z",
          "Titre": "Use Better Shipping Boxes",
          "Contenu": "Good price, Fast Shipping.  1 Star deducted because product was shipped in a Frankensteined, reused Amazon box, which is pretty bad for a >$1k purchase."
        },
        {
          "Note": 4,
          "Lieu": "IL",
          "Pseudo": "david",
          "Nb_Reviews": 1,
          "Date": "2019-11-12T06:30:57.000Z",
          "Titre": "I'm having issues with some headphones…",
          "Contenu": "I'm having issues with some headphones I recently purchased thru headphones.com. i've been in contact with Caleb Scott theCustomer Experience Manager, who seems to want to help. but I shouldn't have to ask 3x for a telephone # so I can further discuss my purchase and problem instead of emails back and forth. A bit frustrating after spending $600. Anyways I'll update this review after I actually get the problem solved. Update; Caleb finally sent his own personal # since they don't have a reg. office landline phone. After speaking with him I feel more hopeful the situation will get resolved in good & professional fashion. We'll see.More to come.... Caleb was able to arrange for a full refund and free return shipping. the headphones are nice, just not for everyone. thanx again caleb for your help and support"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "marcelo",
          "Nb_Reviews": 1,
          "Date": "2021-12-31T16:37:21.000Z",
          "Titre": "Great support",
          "Contenu": "The support provided and the result which unfortunately ended in an RMA was great. You've earned a returning customer. Thanks!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Lochhead",
          "Nb_Reviews": 1,
          "Date": "2019-12-10T16:43:41.000Z",
          "Titre": "Your part of the supply chain was…",
          "Contenu": "Your part of the supply chain was great, but UPS is limited in their options to customize delivery options... it ended up delay my delivery by three days."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott G.",
          "Nb_Reviews": 1,
          "Date": "2019-07-18T23:14:35.000Z",
          "Titre": "Delivered as expected",
          "Contenu": "Delivered as expected. Very well packed. Web site & checkout was good. I don't give 5 stars unless something spectacular happens. Thanks, Scott G."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "sergio leal",
          "Nb_Reviews": 1,
          "Date": "2021-06-16T01:48:05.000Z",
          "Titre": "The excellent attention but my focal…",
          "Contenu": "The excellent attention but my focal clears took a long time to arrive, but it was not your problem but FedEx, so I will buy with you again"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Philip Markowski",
          "Nb_Reviews": 1,
          "Date": "2020-10-28T19:02:23.000Z",
          "Titre": "Generally a pretty good experience, unexpected customs",
          "Contenu": "Generally a pretty good experience. Docked 1 star since I was unfortunately hit with a relatively big customs fee from UPS when it came to Canada."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Art",
          "Nb_Reviews": 5,
          "Date": "2022-03-27T16:50:30.000Z",
          "Titre": "I placed the order before 2PM",
          "Contenu": "I placed the order before 2PM, but it didnlt ship until the next day.  Kudos for using FedX again for shippinh."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim Hong",
          "Nb_Reviews": 2,
          "Date": "2020-01-06T18:33:18.000Z",
          "Titre": "Purchased an expensive item that didn't…",
          "Contenu": "Purchased an expensive item that didn't show up as planned. Communication was initially sparse, but once they engaged things imrpvoed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steven Hill",
          "Nb_Reviews": 1,
          "Date": "2021-11-15T15:43:56.000Z",
          "Titre": "Shipping of my order was overlooked by…",
          "Contenu": "Shipping of my order was overlooked by the warehouse. When I called them about it they shipped it to me second day air."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christopher Klapel",
          "Nb_Reviews": 3,
          "Date": "2022-02-06T18:55:20.000Z",
          "Titre": "a great place for audiophiles",
          "Contenu": "somewhat spammy emails if you add something to your cart but don't check out otherwise great experience"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Humberto Bravo",
          "Nb_Reviews": 3,
          "Date": "2021-06-17T04:18:24.000Z",
          "Titre": "Person that helped me was very friendly…",
          "Contenu": "Person that helped me was very friendly and professional, look forward to doing business with them again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeffrey Bressler",
          "Nb_Reviews": 1,
          "Date": "2019-08-15T21:25:19.000Z",
          "Titre": "Sound quality was excellent.",
          "Contenu": "Sound quality was excellent.Foam ear pads had a strong solvent smellTook a few days to dissapate but OK now."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eliyahu Isakov",
          "Nb_Reviews": 2,
          "Date": "2021-06-16T02:05:51.000Z",
          "Titre": "Shipping took 4 days as opposed to 2…",
          "Contenu": "Shipping took 4 days as opposed to 2 days like advertised, very problematic but good product tho"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Dan Lustig",
          "Nb_Reviews": 1,
          "Date": "2022-04-28T01:02:06.731Z",
          "Titre": "Shipping costs to Canada were…",
          "Contenu": "Shipping costs to Canada were expensive, but turnaround time was fantastic."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bradley Marcum",
          "Nb_Reviews": 1,
          "Date": "2021-03-14T20:07:42.000Z",
          "Titre": "There was a day delay before the…",
          "Contenu": "There was a day delay before the headphones actually shipped, but no complaints besides that."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel Bickford",
          "Nb_Reviews": 1,
          "Date": "2021-03-28T11:11:07.000Z",
          "Titre": "I had a problem with my order and they…",
          "Contenu": "I had a problem with my order and they took care of it quickly without me having to argue."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "john",
          "Nb_Reviews": 2,
          "Date": "2021-06-12T16:30:48.000Z",
          "Titre": "The delivery was great.....wish that…",
          "Contenu": "The delivery was great.....wish that there was free delivery to Canada just like B&H"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Slawek Nagalewski",
          "Nb_Reviews": 2,
          "Date": "2021-02-27T01:25:23.000Z",
          "Titre": "Very good service so far",
          "Contenu": "Very good service so far. Reserve the last star for future interactions. Great job so far!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bill Stephens",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T17:46:39.000Z",
          "Titre": "Super fast delivery an much appreciated."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-10-23T19:25:37.000Z",
          "Titre": "My open box item came defective",
          "Contenu": "My open box item came defective. But Alan Lin was helpful in resolving the issue."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joseph Fiakos",
          "Nb_Reviews": 1,
          "Date": "2022-05-23T18:42:41.000Z",
          "Titre": "great sound but gets a bit…",
          "Contenu": "great sound but gets a bit uncomfortable after an hour or 2 of use."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Gaffney",
          "Nb_Reviews": 2,
          "Date": "2022-08-10T03:03:02.000Z",
          "Titre": "Fast shipping great pricing overall a…",
          "Contenu": "Fast shipping great pricing overall a good experience."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Giliar Perez",
          "Nb_Reviews": 4,
          "Date": "2021-02-28T16:49:42.000Z",
          "Titre": "Great Expedited Shipping",
          "Contenu": "Good experience overall. I'll start with the (minor) cons - this was the first product I bought from Headphones.com, and a pre-order on top of it. While I understand the that delivery date was not guaranteed (and that was made clear to me when purchasing the headphone - it was vague, saying early February, then changed to mid-Feb), I ended up going to forums to ask for this information. All good though, because my question got replied by the owners. More importantly, I got an e-mail later in the week with clarifications around the shipping date, so that improved my confidence greatly. Appreciate the honesty. Suggestion for improvements? Bit a bit more conservative with the shipping date next time (something I observed already happened with the shipping estimate for the Clear MG Pro, which seems like it has been nailed).The shopping experience overall was streamlined, and fairly clean - the site is pretty straightforward to use, and it's also quick to check the status of orders since the login is very quick. I have one suggestion, though: tone down the tracking cookies and notification features - every time I access the website using Chrome or Firefox, an annoying popup asks me if I want notifications.So, all and all, I would absolutely buy from Headphones.com again, being the shipping time for ready-to-ship items so fast."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christopher",
          "Nb_Reviews": 4,
          "Date": "2021-09-11T21:55:12.000Z",
          "Titre": "Stand is nice",
          "Contenu": "Stand is nice $30 for shipping is a bit much. More expensive  than the stand."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kevin Zhang",
          "Nb_Reviews": 1,
          "Date": "2022-05-22T20:40:56.000Z",
          "Titre": "Deducted one star for all the annoying…",
          "Contenu": "Deducted one star for all the annoying emails asking me to review"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adam P",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:03:28.000Z",
          "Titre": "Great Experience",
          "Contenu": "I am new to the higher end headphone market and headphones.com has been great. Every time I have chatted with an employee they have been very knowledgeable and helpful in answering my questions. I am sure my questions are very basic but I have not been treated with anything but respect."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ronald",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T17:02:27.000Z",
          "Titre": "Sam was very professional",
          "Contenu": "Sam was very professional, knowledgeable and kind handling my return of my LCD-2C’s (classic) in exchange for the LCD-2’s. He worked with me patiently over several weeks to ensure I received my new headphones during the Holiday Season as well as short supply of Audeze headphones. I am now enjoying my music to a whole new level that is surprisingly a major ungrade over the classics."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Josh Nowack",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T01:04:10.000Z",
          "Titre": "A Game-Changer in Wireless Audio: Sennheiser CX Plus",
          "Contenu": "Needed a good pair of wireless earbuds and ended up buying the Sennheiser CX Plus True Wireless from headphones.com. Here’s the lowdown:Battery Life: These earbuds have a much longer than expected battery life. They last long enough for my daily use, which is a big plus. No frequent charging needed.Noise Cancellation: The noise cancellation is legit. It does the job of drowning out background noise pretty well, making the audio clear and focused. It’s a useful feature, especially in noisy environments.Customer Service: What made headphones.com stand out was their service. It’s rare to get good advice these days with so many options online. The team there actually listens and suggests what works for you. It’s straightforward, no-nonsense, and helpful.Final Take: If you’re looking for a solid pair of earbuds and want a place where you can get honest advice, headphones.com is a good bet. The Sennheiser CX Plus True Wireless does what it says and does it well. Happy with the purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Craig Dodrill",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T04:20:54.000Z",
          "Titre": "Customer service exceeds expectations!",
          "Contenu": "I had some technical issues getting my Qutest up and running.  Although it was an open box \"final sale\", Headphones.com support was fantastic!  They overnight shipped a new owners manual, usb cord, and provided technical support to get me up and running despite my unusual setup.  I couldn't ask for more!  And, by the way, the DAC is exceptional!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Siamak Yaghmai",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T02:15:41.000Z",
          "Titre": "Highly Reliable Vendor with great service",
          "Contenu": "I highly recommend this vendor. They have excellent service and extremely reliable. Everything was delivered on time and as promised. A totally great buying experience on some high priced speakers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Atkins",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T17:42:19.000Z",
          "Titre": "Great audiophile quality headphones",
          "Contenu": "Great selection of audiophile quality headphones and accessories. Bought several items --including open box products -- that were delivered quickly and in perfect condition. The best part of the shopping experience are the expert forums and audio testing that helps to describe how each model sounds (and feels) on or over ear. I have a few wired and wireless models --- Audeze, Focal, and HifiMan -- and each has a different specific \"purpose\" -- For use with a DAC, I like the DAC setting on my Focal Utopias (wired) and Bathys (wireless). The soundstage is wider and deeper in the Utopias and there is more detail in the high range. The Bathys are excellent in every other way and amzing for travel. My sense is that Focal has nailed the portable mid-range headphone so much better than most of the wireless models for sale at electronics stores because it has a comfortable, natural fit over the ears, with a closed back that blocks sound tremendously well and, if you require the ANC for flights, it is provided at low power output so there is no phasing buzz like in the Bose, Beats, Sennheiser and Sony model lines. For listening to classical or piano jazz music, the open box (demo?) wired pair of the HifiMan Arya Organic I got on Headphones arrived in perfect condition. They have among best soundstage that produces a balanced and accurate sound at nearly any volume."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christi Harris",
          "Nb_Reviews": 6,
          "Date": "2023-12-20T20:38:25.000Z",
          "Titre": "Always a top-notch experience",
          "Contenu": "The pre-order process at Headphones.com is excellent.  I got my unit the first day it was released.  The IEM is amazing!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Phillips",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T00:14:36.000Z",
          "Titre": "Headphones.com Amazing.",
          "Contenu": "I think Headphones.com provides an amazing level of support and plethora of options make for an amazing experience. I'd highly recommend shopping with them and intend to do so again in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bruce Bartlett",
          "Nb_Reviews": 3,
          "Date": "2023-12-15T20:38:25.000Z",
          "Titre": "Great customer support/relations",
          "Contenu": "My order arrived quickly.  Plus, a question posed to the headphones.com website was answered right away (and politely).  It turns out, *I* had made a mistake… NOT headphones.  That’s the kind of customer relations we need to see MORE of!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GERARDO PANEZ",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T19:21:05.000Z",
          "Titre": "Great purchasing experience",
          "Contenu": "Purchased twice so far...both went great; package arrived on time and well protected, communication very active from them makes you feel safe that the vendor cares...will be back for next purchase for sure"
        },
        {
          "Note": 5,
          "Lieu": "CN",
          "Pseudo": "robert",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T19:01:26.000Z",
          "Titre": "Great people to deal with",
          "Contenu": "Great people to deal with, my earphones were mailed immediately and easy to follow the delivery."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JESUS IS CALLING YOU",
          "Nb_Reviews": 7,
          "Date": "2023-12-07T04:24:46.000Z",
          "Titre": "Headphones.com is consistently…",
          "Contenu": "Headphones.com is consistently excellent in my experience.  I've received my orders in a timely manner and communication has been always fast. I haven't had a problem yet, but I did have to contact customer service for an inquiry and they went above and beyond my expectations. I will continue to support this business! Do not doubt to give them your business. They are good people."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alvin Chan",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T18:12:36.000Z",
          "Titre": "Solid reseller with a great focus on…",
          "Contenu": "Solid reseller with a great focus on customer satisfaction!   They work with you on making sure you get the product in the timeframe that you want and providing support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amy Pastino",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T01:43:35.000Z",
          "Titre": "Great customer service all around",
          "Contenu": "Great customer service all around!  My product came in sooner than expected!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T05:23:42.000Z",
          "Titre": "My first purchase from Headphones.com",
          "Contenu": "My first purchase from Headphones.com. After watching a bunch of review videos from The Headphones Show on youtube I ordered pair of headphones(open box) to try out and to get an idea of shopper's experience/customer service from Headphones.com. Opening the packaging I was pleasantly surprised and had to check twice to see if I ordered a new or open box pair of headphones. I could not tell the difference. I am very happy with my first purchase and experience with Headphones.com."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Deignan",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T04:32:51.000Z",
          "Titre": "You had what I was looking for",
          "Contenu": "You had what I was looking for. I ordered and you delivered. Price was the same as the others. Good service. No problems."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Timothy Federwitz",
          "Nb_Reviews": 4,
          "Date": "2023-12-08T18:50:59.000Z",
          "Titre": "The DCA E3 headphones are awesome!",
          "Contenu": "The DCA E3 headphones are awesome!FWIW, I have 17 pairs of headphones, with 3 being “flagship” and over $3K. I was looking at both the Stealth and Expanse, but wasn’t sure they would be different enough or worth it to me for the $4K. I also considered the Aeon Noire 2, but had hesitation. When DMS reviewed the E3 as a real upgrade from the Noire, yet even better or on par with the Stealth and Expanse, yet was only $2K… I immediately bought them. So glad I did! Very “open” sounding for a closed back with great separation. The frequency response is almost perfect to my ears without EQ. I am a bit of a bass head, so I will likely add a 3dB sub bass shelf. However, I will be happy to listen to these without that as well. Great detail capture."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony Simboli",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T02:40:01.000Z",
          "Titre": "I was pleased with the advice",
          "Contenu": "I was pleased with the advice, but more importantly, the service and turn around time of the responses was great. From the live chat to the follow-up emails the response time and turnaround time of the responses was great compared to all the competition. Even when compared to other non-related stores, it was the fasted, even if it was just to say “no answer yet” or “no shipping date yet” there was constant communication - much appreciated"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Williams",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T06:32:00.000Z",
          "Titre": "Very detailed communication of order…",
          "Contenu": "Very detailed communication of order status and shipping. Quite fast shipping and secure packaging."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trio",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T21:34:21.000Z",
          "Titre": "Functional + not annoying",
          "Contenu": "The website has no issues, it was easy to find the product I wanted (which I knew of ahead of time) and make the purchase. I received prompt email notifications regarding my purchase confirmation, as well as on day of delivery + delivery confirmation. My item got here quick, no problems with it of course. I wouldn't know what to suggest to improve the site, does it's job"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carl Eisen",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T19:58:55.000Z",
          "Titre": "Excellent experience except for FedEx",
          "Contenu": "Great communication with April on chat, excellent and secure packaging. As usual, very fast shipping. Headphones.com is my go-to site for quality audio products. My only complaint is with the shipper, FedEx. A horrible experience, hours spent on the phone with 7 different agents. I had to go the FedEx center to pick up my package even though 2 day delivery with signature was paid for. I won't have FedEx deliver ANYTHING to me since this has happened numerous times in past years. The Audio U4s that I ordered are excellent, providing amazing clarity and a very top notch listening experience. However there was no manual or instructions on how to use the Apex modules."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patrick Reed",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T17:46:43.000Z",
          "Titre": "Customer Service",
          "Contenu": "My experience was made great by April Vainionpaa‘s customer service. April was very quick to reply to my questions and escalated my problem to management to get it resolved properly. I couldn’t be happier with the service I received."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Josh Zandman",
          "Nb_Reviews": 3,
          "Date": "2023-12-17T23:06:40.000Z",
          "Titre": "Will definitely shop here again!",
          "Contenu": "Great buying experience! Love the top quality product reviews and super quick customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeffrey Krebs",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T20:15:06.000Z",
          "Titre": "Headphones.com has become my \"go to\"…",
          "Contenu": "Headphones.com has become my \"go to\" one-stop shopping site for headphones and accessories. Their stock is vast, their shipping is warp-speed fast, and their customer service is outstanding. I recently purchased my second set of cans from them, along with some extra ear-pads. No problems and everything went like perfection from order to delivery. Nothing not to like!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 6,
          "Date": "2023-12-19T00:57:00.000Z",
          "Titre": "Five Star Product Five Star Service",
          "Contenu": "Fast shipping, fair price and availability made this a seamless 5 star experience"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susanne",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T17:51:35.000Z",
          "Titre": "I love your company!",
          "Contenu": "I love your company!!  Take a look at all my orders."
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "osinubi olajide",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T17:06:35.000Z",
          "Titre": "Wonderful experience",
          "Contenu": "I recently discovered and it's now my new favourite spot to shop! The staff was super friendly and helpful, and they made the whole experience"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff Grigsby",
          "Nb_Reviews": 9,
          "Date": "2023-12-11T07:03:49.000Z",
          "Titre": "I trust headphones.com",
          "Contenu": "I trust headphones.com  You stock great products and have been impeccably reliable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RomC",
          "Nb_Reviews": 5,
          "Date": "2023-12-18T01:42:58.000Z",
          "Titre": "Good",
          "Contenu": "No issues with anything, good website."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "johnydazzles",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T22:21:37.000Z",
          "Titre": "Great company",
          "Contenu": "Great products, great policies, great customer service.  I always use headphones.com for my purchases!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JESUS IS CALLING YOU",
          "Nb_Reviews": 7,
          "Date": "2023-11-09T21:32:10.000Z",
          "Titre": "Well-earned FIVE STARS",
          "Contenu": "This is my second purchase from HEADPHONES.COM and will not be the last. It was a Focal Clear pre-order, which required months of patience, but it took as long of a time as it needed and no more even with an unforeseen delay. I received them exactly when the Lissimores said I would. I will continue supporting this impressive business, which began as a really risky startup by two crazy brothers, ha-ha! LONG LIVE ANDREW AND TARON and the entire Headphones.com team that keeps the gears turning!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DG",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T01:16:21.000Z",
          "Titre": "Headphones.com continues to deliver…",
          "Contenu": "Headphones.com continues to deliver high quality products with great customer service. Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "sd",
          "Nb_Reviews": 3,
          "Date": "2023-11-08T23:20:24.000Z",
          "Titre": "Ordering process is quick and easy",
          "Contenu": "Ordering process is quick and easy.  All contacts with customer service were timely, professional, and helpful.  My order included one item on back order and one “pre-order”  item.  Status updates were very helpful.  Please keep up the great work.  Thanks to everyone at headphones.com!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill William",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T00:05:23.000Z",
          "Titre": "Fantastic service and products",
          "Contenu": "Fantastic service and products.  I've had to work with their team on several orders and they always respond quickly and professionally.  If you're looking for advice they don't hesitate to suggest things they don't sell if they think it'll be a better match.  They are my number one go to for any headphone related gear."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicholas Sketas",
          "Nb_Reviews": 2,
          "Date": "2023-11-10T00:04:00.000Z",
          "Titre": "EXCELLENT OUTCOME AS ALWAYS",
          "Contenu": "As always there were many options to purchase the headphones you want, either new or open box which I opted for. I have no problem buying open box since my years of experience dealing with these folks assures me I’m getting a quality product. Shipping was quick and everything arrived as promised. I really don’t shop around because I trust headphones.com, it’s risk free."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dong Hyeok Kang",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T10:20:53.000Z",
          "Titre": "Prompt delivery, good service afterwards",
          "Contenu": "The purchase I made came with a defect, but Headphones.com was so prompt to take action and process through a brand-new unit from a manufacturer.Honestly, I learned a lot from my experience purchasing a product through them. Especially, it was such a pleasant experience to buy through an authorized dealer with a professional team willing to support on every margin they can. I recommend them, especially if you want to be safe with your purchase. On the other hand, of course make sure you read the terms and regulation carefully, as they do have their rules!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joshua P.",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T00:47:38.000Z",
          "Titre": "First time customer",
          "Contenu": "I ordered open box and the items were In like new condition and haven't had any technical issues so far so it has been a good experience for me . The focal bathys was a good choice for me without me having to hit the 1000 dollar mark and over to get good sound that I can use outside of my pc use without having to tug a wire and Amp with me wherever I go. I can use it also for my gaming and movie usage as well knowing the cash I spent was worth saving alittle more for if you want some thing better than the commercial alternative brands people go for."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert P",
          "Nb_Reviews": 3,
          "Date": "2023-12-06T21:37:35.000Z",
          "Titre": "The open-box is indistinguishable from new",
          "Contenu": "The open-box item is indistinguishable from new.  Fast shipping.  Great product.  Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Nick Bruyere",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T09:18:28.000Z",
          "Titre": "Great",
          "Contenu": "Great, easy and fast delivery"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeffrey Krebs",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T16:04:12.000Z",
          "Titre": "One-stop shopping for my headphone needs",
          "Contenu": "I recently purchased a second set of headphones from Headphones.com and I am very pleased with the fact that they are one-stop shopping for high-end headphone/accessories needs. The headphones arrived lightning-fast and customer service is awesome."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Wilson",
          "Nb_Reviews": 2,
          "Date": "2023-10-26T07:54:48.000Z",
          "Titre": "Awsome and Great value",
          "Contenu": "These headphones offer fantastic value for the price. When I first tried them out, I was pleasantly surprised by how amazing they sounded right from the start. They are comfortable to wear, produce great sound quality, and seem to be quite durable. I'm really happy with this purchase. The company behind these headphones is trustworthy, and their customer support and policies are top-notch. It's clear that they genuinely care about both their products and their customers."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Michael Molnar",
          "Nb_Reviews": 4,
          "Date": "2023-12-04T22:12:43.000Z",
          "Titre": "Hassle free great service",
          "Contenu": "Great customer service and hassle free purchase. Not my first transaction and won't be my last!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SPlatk",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T14:28:32.000Z",
          "Titre": "Order went through with no problems and…",
          "Contenu": "Order went through with no problems and I was kept posted on the delivery status."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David McAlister",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T23:19:15.000Z",
          "Titre": "Highly recommend this website!!!",
          "Contenu": "Found exactly the headphones I wanted at a great price. Can't wait to get them broken in.  Easy transaction with no problems, quick shipping as well.  Highly recommend this website!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "FEvans",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T22:08:55.000Z",
          "Titre": "F.,knowledgeable,informative &…",
          "Contenu": "F.,knowledgeable,informative & correspond with Real; “ salt of the earth “ hard working individuals that care about more about your satisfaction than the “ bottom line”."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Oswaldo Reynoza",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T01:21:21.000Z",
          "Titre": "Headphones.com went above and beyond…",
          "Contenu": "Headphones.com went above and beyond the “average customer service” you usually get nowadays from just about any company online (or brick & mortar). I had a minor hiccup with my purchase and headphones.com came through with amazing customer service for me. Made a life-time-customer of me!-Thanks Headphones.com and your customer experience agents."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nathan D",
          "Nb_Reviews": 2,
          "Date": "2023-10-12T02:52:45.000Z",
          "Titre": "Very helpful place to buy sound equipment",
          "Contenu": "It's a little intimidating to look at expensive audio gear, but headphones.com had a ton of info to help me find the right headphone for me, and I felt a lot more comfortable dropping a lot of cash knowing there was a 365 day return window in case I bought something I didn't love. Though I've loved all the products I've bought so far. And shipping was super fast on my latest purchase too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Custome111",
          "Nb_Reviews": 2,
          "Date": "2023-11-13T21:14:28.000Z",
          "Titre": "Perfect experience with headphones.com",
          "Contenu": "Perfect experience with headphones.comThe open box item was as new and the shipping was fast. I trust these people and they have very educational youtube channel and reviews."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Saswat Kar",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T05:13:57.000Z",
          "Titre": "I have a sweet experience with…",
          "Contenu": "I have a sweet experience with headphones.com . I have purchased a audio device headphone from their website. The product I received in a excellent condition and i have so much satisfied with their service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew Hunt",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T22:31:07.000Z",
          "Titre": "They actually know and care",
          "Contenu": "In an end-stage capatalist world, headphones.com is the rare site where you sense the people there actually care about what they do.  Their knowledge base is very high, the additional resources (discord, forums, youtube) give far more information than simple reviews on other sites, and they are attentive to every order.No more buying audio gear from the big river -- this is where I will get my headphones gear from now on."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tony Kern",
          "Nb_Reviews": 3,
          "Date": "2023-09-21T00:10:04.000Z",
          "Titre": "Bargain boojie",
          "Contenu": "This was the third purchase I believe from Headphones,com. Continually amazed how fast purchases ship (especially cross country). Packaged securely as well.Any contact with staff has always been positive.Appreciate the honesty when product is advertised as open box or final sale.When I saw the price for the B&W Px7 S2, couldn't order it any faster. While it's not a FOCAL Clear OG, still sounds fantastic and wireless means freedom to roam about the house and still have music in my ears."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T23:47:12.000Z",
          "Titre": "Fast and easy buying support via chat",
          "Contenu": "Fast and easy buying support via chat, time to ship was good, price was very good on sale. Shipping was very slow but that's UPS's problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Billy Martin",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T17:35:18.000Z",
          "Titre": "Audiophile HI-FI Components",
          "Contenu": "Exceptional customer service, high end audiophile HI-FI components, as well as recognition of my military service make HEADPHONES.COM a great choice for my needs!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris G",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T18:52:25.000Z",
          "Titre": "Helpful website with reviews and suggestions",
          "Contenu": "Lots of helpful information made selecting my product easier. The reviews and suggestions make Headphones.com stand out as an expert in HiFi products. Super fast shipping, too!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim Garcia",
          "Nb_Reviews": 4,
          "Date": "2023-09-20T18:34:24.000Z",
          "Titre": "Solid, dependable, honest guys!",
          "Contenu": "I bought an \"open-box\" Focal Radiance from Headphones.com and I have zero complaints about what they call \"open-box\" because I honestly could not even tell the headphones had ever been used.  The headphones are superb (and their review crew helped convince me of that) and I have complete confidence that Headphones.com stands behind their products.  I've bought from them before this, and had the same experience every time: it's shipped fast, there's no hassle, and they have great deals."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Headphone enjoyer",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T19:51:33.000Z",
          "Titre": "Shipped same day as per website (based…",
          "Contenu": "Shipped same day as per website (based on cutoff time). I had some questions which were quickly answered via online chat by a real person. Item arrived in excellent condition."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wendell",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T22:41:12.000Z",
          "Titre": "Fast response",
          "Contenu": "Fast response. Fast delivery. Item as described."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim W.",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T20:22:48.000Z",
          "Titre": "Great product, great service!",
          "Contenu": "My headphones arrived on time & packed professionally. The Sennheiser product is fantastic, I am very pleased with the product and the service from Headphones.com"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Chitwood",
          "Nb_Reviews": 8,
          "Date": "2023-11-16T06:28:50.000Z",
          "Titre": "Top Notch",
          "Contenu": "Top NotchFolks at Headphones.com are very easy to work with.  I appreciate the combination of technical expertise and helpful approach to my inquiries.  Nice to have a one stop information gathering and shopping experience for my audio needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jack Robinson",
          "Nb_Reviews": 3,
          "Date": "2023-11-24T02:16:51.000Z",
          "Titre": "Excellent service all around",
          "Contenu": "Excellent service all around. Quick shipping, and I love that you can choose whether or not you want to sign for your package."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicolas Touzé-Boinet",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T02:08:41.000Z",
          "Titre": "Excellent communication",
          "Contenu": "The headphones.com staff is very communicative and helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher Kavanagh",
          "Nb_Reviews": 2,
          "Date": "2023-11-10T21:16:07.000Z",
          "Titre": "Item shipped fast and in great…",
          "Contenu": "Item shipped fast and in great condition.  Love the focal radiance addition to my collection the sound is amazing. The bass on some songs shakes my brain and I love it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "THOMAS LEAF",
          "Nb_Reviews": 4,
          "Date": "2023-10-29T19:58:02.000Z",
          "Titre": "So I ordered a pair of Audeze Maxwells…",
          "Contenu": "So I ordered a pair of Audeze Maxwells that turned out to be the PS5 version when I really needed the XBox version.  Headphones.com sorted me out and we're very responsive.  They processed the return efficiently and applied the payment to the XBox version.  The only hangup was they were out of stock and I had to wait. They told me it would be two weeks or so and it turned out to be longer but Sam was always responsive and helpful whenever I emailed for updates. Nice people to deal with and knowledgeable about their products. If you want high end audio kit, they're a good place to shop."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Michael Molnar",
          "Nb_Reviews": 4,
          "Date": "2023-11-10T23:24:39.000Z",
          "Titre": "Another smooth transaction",
          "Contenu": "Another smooth transaction with great support.. thanks April! Will surely do more business with Headphones.com in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Miles Carter",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T00:31:14.000Z",
          "Titre": "Just great.",
          "Contenu": "My package was delivered (in Canada) in just one day and the service was exceptional, pretty impressive. Headphones.com offers great prices and incentives, along with an amazing community. I'll certainly be back before long."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Rajiv Saliling",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T05:13:23.000Z",
          "Titre": "nice great stuff to buy",
          "Contenu": "nice great stuff to buy , delivery is good and on time ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeffrey Hampton",
          "Nb_Reviews": 2,
          "Date": "2023-10-11T01:03:50.000Z",
          "Titre": "HM1 ohgodwhathaveidone",
          "Contenu": "For context, this is the only purchase I've ever made with headphones.com, and it was by far the biggest single purchase I've ever made in life aside from my car (priorities? What are those?). Sure, it's the only spot I could order the HM1 in the US, but also I've gained a lot of confidence in the last couple of years just watching headphones.com's influence in the community grow. I was happy to have an opportunity to buy from a place that had already given me so much knowledge and awareness in the past. I can't think of anything I'd have them do differently."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Greene",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T19:12:05.000Z",
          "Titre": "Thanks to Headphones.com",
          "Contenu": "I’ve always appreciated the commitment that Headphones.com has to informing the community of what products are out there, how to understand the varying technical terms related to audio and their ability to present products (for better or worse), rather than sell products.Through their videos, I came to conclusion to purchase a specific headphone amp, and headphones.com was able to fulfill the order quickly and at a good price. High recommendations and I’ll definitely continue to purchase from them in the future."
        },
        {
          "Note": 5,
          "Lieu": "CM",
          "Pseudo": "brain yuniwo",
          "Nb_Reviews": 3,
          "Date": "2023-09-08T09:45:46.000Z",
          "Titre": "These headphones are the best I have…",
          "Contenu": "These headphones are the best I have ever come across; they are lighter and soft and the sound system is perfect. The cost is affordable and easy to connect with any software, You can get it from Amazon, eBay, and any nearby electronic shop in Texas and Dallas. These headphones can be used by any age group, be it the young, adults, and even the elderly for their comfort. These headphones have a guarantee of a (01) year in case of any breakdown."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christi Harris",
          "Nb_Reviews": 6,
          "Date": "2023-09-21T19:52:53.000Z",
          "Titre": "Always a Winner",
          "Contenu": "I have ordered multiple times from Headphones.com over the past 18 months and the experience is always smooth and pleasurable.  The products are awesome, the shipping is fast & reliable and above all the customer service when needed is beyond fantastic.  I'm a customer for life."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Masoud Asadi",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T17:50:18.000Z",
          "Titre": "Highly Recommend",
          "Contenu": "My experience with headphones dot com was quiet pleasant and I recommend shopping here to all casual buyers or audiophiles. The delivery was fast, and the packaging was safe. I also highly recommend The B&W headphone that I bought (Px7 s2) which is on the sale only on headphones dot com at the time of writing this review."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher Lewis",
          "Nb_Reviews": 2,
          "Date": "2023-10-17T19:35:57.000Z",
          "Titre": "Great reviews and easy safe ordering.",
          "Contenu": "I’ve ordered two things from headphone.com, I received them fast and in good packaging. I love the reviews they have about different headphones/iems. I would recommend ordering from site to others."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alec Medearis",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T16:53:09.000Z",
          "Titre": "Easy purchasing and shipping…",
          "Contenu": "Easy purchasing and shipping experience. Love the discount on the Radiance - I'd happily pay full price for it if I had to. The store is the best and easiest place to buy new/open-box headphones in existence."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "David",
          "Nb_Reviews": 5,
          "Date": "2023-09-13T23:39:52.000Z",
          "Titre": "Great Experience and Great Headphones",
          "Contenu": "I bought 3 headphones and 1 amplifier, each in different purchases. The entire experience was excellent. Easy to navigate website, simple and quick purchase process and even though I was in another country (Canada) delivery took place in less than 2 business days. I don't usually leave reviews, but in this case I think they deserve it, as the whole process was excellent. Congratulations on your work. And, of course, the headphones are wonderful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Olimpo Polanco",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T13:09:26.000Z",
          "Titre": "Great selection of products and even…",
          "Contenu": "Great selection of products and even better customer service. ordered a few goodies and was promptly informed 1 of them was no longer in stock. April from customer service offered a great solution and I went with that. Will definitely order again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Refaat I.",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T01:19:17.000Z",
          "Titre": "Headphones.com booth at CanJam SoCal…",
          "Contenu": "Headphones.com booth at CanJam SoCal 2023I had the pleasure of visiting the Headphones.com booth at CanJam SoCal 2023. Both days, I spent a lot of time at that booth and listened to a LOT of headphones. The staff was very helpful and super friendly. I decided to buy the Dan Clark Expanse right then and there, and the buying experience was a breeze.  A special shoutout to Alan, April, and Taron. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "zacari larson",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T08:48:30.000Z",
          "Titre": "headphones came with a broken cord and…",
          "Contenu": "headphones came with a broken cord and the company would not accept returnsTalked to customer service and they were great sorted out the cord issue after a few emails good people highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Bower",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T22:33:41.000Z",
          "Titre": "One of the few sites that had the…",
          "Contenu": "One of the few sites that had the Maxwell in stock, and it arrived in just a few days from purchase. I also got a burson playmate 2 from this site for $450 open box and love it. Would highly recommend these guys. If I was rich, I'd probably spend a small fortune here."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jazz1",
          "Nb_Reviews": 6,
          "Date": "2023-11-29T23:13:03.000Z",
          "Titre": "Fast ship and great advice",
          "Contenu": "Fast ship and great advice! I love purchasing from their extensive inventory!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher Kavanagh",
          "Nb_Reviews": 2,
          "Date": "2023-10-14T15:50:46.000Z",
          "Titre": "Site was very easy to navigate",
          "Contenu": "Site was very easy to navigate, research and purchase what I wanted.  The shipping is fast and they communicate with their customers to make sure they're happy with their buy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom Gonzalez",
          "Nb_Reviews": 8,
          "Date": "2023-12-17T19:38:06.000Z",
          "Titre": "Excellent product selection",
          "Contenu": "Excellent product selection.  Great website experience. Arrived on time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eugene",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T20:33:56.000Z",
          "Titre": "My purchase was made easy.",
          "Contenu": "I left my items in my cart while I was giving it time to simmer in my head. I was sent an email saying my items have been reserved for me and was also given a discount, and that made it very tempting. I didn't realize that I added the wrong color for the WA7 Fireflies in my cart. I emailed them back and and said I have to test them out first at CanJam SoCal, and if they can change the WA7 Fireflies to black.The change was simple enough, I left the items in my cart and headed to Irvine. I came back after 5 days, my discount was still there and completed the purchase. I selected the overnight shipping, but since I made the purchase around 8 PM I knew it'd take two days.Been enjoying my Meze Liric and Woo Audio WA7 Fireflies since. ^_^"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Antonio Rivera",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T02:02:18.000Z",
          "Titre": "Could Not Have Been Easier",
          "Contenu": "What made it great was your user friendly web page and the variety of selections offered. It was easy to pick a product and order it. I received my Focal Elegia Headphones and love em. Hope you will have a call in service for questions in addition to the email option in the future. Love your YouTube Videos!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Vineesh",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T16:54:18.000Z",
          "Titre": "Truly Amazing Headphones - 7 Star Customer Support",
          "Contenu": "I was considering a few headphones before deciding on this one. I have to mention Sam Cooper for providing me with the necessary information and his own perspective for me to decide on one. On top of that he was really helpful in resolving a payment hiccup and made sure my order gets shipped the same day. I live in Canada and I got the headset delivered the very next day. It did not feel like an open box item in any way.Now about the headset. This was my first “audiophile grade” headset. The first impression was okay, I tried paying few songs from Tidal via AAC, and used the DAC mode too. It was really good but honestly I couldn’t really tell what all those reviewers were saying about it being truly amazing. I’ve heard about headphones burn in periods and decided to give it a try by playing pink noise for like 20 hours. Maybe it’s placebo but I could feel it being better. But all that changed when I decided to watch the new Gran Turismo movie with it. It was absolutely incredible, unlike anything I’ve experienced before. It never felt like I was watching a movie with headphones on. I highly recommend the Bathys especially with the open box pricing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Geoff B.",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T00:16:34.000Z",
          "Titre": "Always top notch",
          "Contenu": "Headphones.com is my only go-to place for all my audio needs. Great products, even greater prices, and the absolute BEST customer care. I will never purchase from anywhere else."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keplin",
          "Nb_Reviews": 2,
          "Date": "2023-09-30T11:41:44.000Z",
          "Titre": "Overall pretty good",
          "Contenu": "Overall pretty good, found what I needed got what I needed and it arrived within a couple days. No real changes I'd even have in mind tbh. Although if I'm being a bit selfish some cheeky little coupon codes once in a good while would be awesome lol"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Efrain",
          "Nb_Reviews": 2,
          "Date": "2023-09-14T00:04:45.000Z",
          "Titre": "I’ve purchased 3 headphones from here…",
          "Contenu": "I’ve purchased 3 headphones from here and have returned 2. Not because they were bad but because they just didn’t suit my needs. I love their return policy, yes they charge a restock fee, but it’s a fair price for what they’re offering."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Captc",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T00:12:30.000Z",
          "Titre": "Satisfied Customer",
          "Contenu": "The ordering process was easy.  My order arrived in two days and was packed well.  I will buy from Headphones.com again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 2,
          "Date": "2023-10-18T17:28:32.000Z",
          "Titre": "Headphones were exactly as I expected",
          "Contenu": "Headphones were exactly as I expected. Gorgeous! The price was far better than competitors. I will definitely be doing business with them in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gregory",
          "Nb_Reviews": 2,
          "Date": "2023-10-02T00:10:16.000Z",
          "Titre": "Deep interest in the products they sell…",
          "Contenu": "Deep interest in the products they sell and use.  Never try to push one brand,  great information and reviews of many brands. And strong customer service ethic"
        },
        {
          "Note": 5,
          "Lieu": "BD",
          "Pseudo": "ashraf shihab",
          "Nb_Reviews": 3,
          "Date": "2023-10-14T20:46:04.000Z",
          "Titre": "Impressive price with mindblowing quality.",
          "Contenu": "I want the best in a low price and after much searching i got headphones.com which recommended by one of my friends. I’m really satisfied, also going to gift a headphone to my that friend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim T.",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T15:28:56.000Z",
          "Titre": "Fantastic first experience",
          "Contenu": "I bought the Dunu SA6 MKii IEM's at an open box price. They shipped me a brand new set at the same price. I had problems with the sound quality and was almost at the point of returning the headphones until I found the right EQ tune that woke them up. Headphones.com were supportive through the process and willing to take the set back. Highly recommend to any purchaser. A+"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher Montagna",
          "Nb_Reviews": 2,
          "Date": "2023-11-09T01:08:57.000Z",
          "Titre": "Great Service",
          "Contenu": "Fast service, good prices, and support solves problems more than fair for customers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Truong",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T23:59:37.000Z",
          "Titre": "Great assortment of products and timely…",
          "Contenu": "Great assortment of products and timely delivery. I have purchased multiple times and have had very consistent experiences."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim Paich",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T19:38:11.000Z",
          "Titre": "I bought the 15oz Resolve Mug",
          "Contenu": "I bought the 15oz Resolve Mug. I’m very happy with the purchase.  It is definitely the best measuring coffee mug I own - very smooth, almost liquid textures. Not harsh at all."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Leibow",
          "Nb_Reviews": 5,
          "Date": "2023-09-15T05:17:22.000Z",
          "Titre": "Headphones.com is doing it right",
          "Contenu": "Headphones.com is doing it right. I bought a pair of closed back headphones from Headphones.com.  They sounded great but were too confining. I spoke to the people at Headphones.com and they were actually happy to help me. I decided on a pair of open back headphones and they couldn’t have been more helpful in deciding the best pair and doing the swap so I was without. Pair of headphones for a very short time. I really like the new pair and completely recommend Headphones.com to everyone. Terrific customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eli",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T22:35:43.000Z",
          "Titre": "Headphone.com a great place to shop",
          "Contenu": "A great selection of products to choose from.  The website is user-friendly and pricing is comparable. Order placed, received the order all in less than a week."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ash B",
          "Nb_Reviews": 2,
          "Date": "2023-10-18T21:30:50.000Z",
          "Titre": "On time delivery",
          "Contenu": "On time delivery.  Your great product reviews!  I love watching headphones.com YouTube channel.  As such, I wanted to give you my business for the great work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T23:31:49.000Z",
          "Titre": "Top tier all around",
          "Contenu": "The customer service is what is making me only order from here. Team is fantastic and the shipping was actually next day not the day after which is unheard of."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donald Wolff",
          "Nb_Reviews": 3,
          "Date": "2023-10-02T23:01:58.000Z",
          "Titre": "Thieaudio Monarch MKIII",
          "Contenu": "Thieaudio Monarch MKIII,  What can be said, it is better then my 52y/o ears can hear!!!  They are a thing of pure beauty.  I got the disco backs so they look almost a good as they sound.  I think that they are as close to a perfect all around IEM that humankind can make."
        }
      ]
    }
  ]
}