{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.playerschoicevideogames.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cody",
          "Nb_Reviews": 1,
          "Date": "2023-12-31T06:25:00.000Z",
          "Titre": "SCAM!!!",
          "Contenu": "SCAM!! Complete scam.. ordered a Ps2 system.. they sent my email a receipt with no delivery info, no tracking number so I went back to the site waiting for it to show up. A few hours later I go back to the site and I'm not logged in anymore and I go to put in my email so I can change my password and log in and it sends the reset password to a completely different email.. now I can't sign in to check my order, talk to them about my order or cancel my order so I'm just gonna go to my bank and cancel it myself since this fake company is zero help and just a scam.. don't order products from these people you will not get your items you'll just jump through hoops.. I'm never coming back to this Scam"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Colton Wells",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T19:04:09.000Z",
          "Titre": "Unreadable Disc",
          "Contenu": "Pretty sure I got a fake disc because there were no scratch marks yet my 360 couldn’t read it. Ended up just throwing away the game, it was only 5 dollars, and buying an actual copy from Walmart."
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "Luis Villarreal",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T21:53:41.000Z",
          "Titre": "Bad attention",
          "Contenu": "Hi, I made a purchase a week ago on your website and until today I have not received news of my ordersend a message through all the social networks and all the forms of contact they have and they don't respond to me in any of them"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Reg Mes",
          "Nb_Reviews": 1,
          "Date": "2022-03-01T23:54:06.000Z",
          "Titre": "THIS is a bad place do buss",
          "Contenu": "THIS is a bad place do buss. i ordered a ps2 console as left him 5 message why i had no ship yet over 10 day period then i received the  ps2 which come from a mexican from texas not from his site or store if even has a store lol also got 4 games and only 3 work as ived text him many times with no help or reply"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sfm Tv",
          "Nb_Reviews": 1,
          "Date": "2022-07-28T03:03:02.000Z",
          "Titre": "Dishonest reproductions.",
          "Contenu": "I was skeptical because of the price and rightfully so. The games I was sent were reproduction cartridges. Very convincing reproductions at that. The lettering for NTR-005 PAT PEND was too thin to be a legit card and was placed differently than on a real cartridge.Nowhere on the listing was it made explicitly clear that these were reproduction cartridges. It was implied I was purchasing used cartridges. If it was just 1 game I would assume it was a mistake, but both pokemon pearl and platinum were fakes."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bobby Davis",
          "Nb_Reviews": 2,
          "Date": "2023-06-01T12:46:28.000Z",
          "Titre": "Faulty PS2",
          "Contenu": "I gotten the PS2 I ordered and finding out it won't read discs. I don't know if the issue is the laser disc or the motor but either way, I was incredibly upsetUpdate: I made a review about getting my replacement and it works now so thank you David"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Blues",
          "Nb_Reviews": 1,
          "Date": "2021-11-16T19:31:25.000Z",
          "Titre": "Terrible Experience. Stay away.",
          "Contenu": "Not very please at all with my experience so far. It’s been a week, no tracking information, no communication at all on my order. I will not be doing business with this company ever again, and will be letting everyone I know to stay away from doing business with this company as well."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Suelen Dias",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T18:14:31.000Z",
          "Titre": "I WAS SCAMMED BY THIS COMPANY",
          "Contenu": "I WAS SCAMMED BY THIS COMPANY. I bought 10 Zelda games to the Nintendo Wii. What they sent to me is inauthentic. I returned those and they didn't refund me. I opened a dispute with my credit card, and they said to my bank I never returned it but for me, they said I was refunded, but that's not true and they also don't want to send me proof and now, they don't reply to my emails anymore."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Isaac Hernandez",
          "Nb_Reviews": 1,
          "Date": "2021-06-12T12:43:50.000Z",
          "Titre": "Just awful",
          "Contenu": "Well to start, it took them almost two weeks to send out my package, so that meant two weeks without a tracking number. I let that go as I just wanted my package, but then they sent my package to the billing address instead of the shipping address. On my receipt they emailed me it clearly says my shipping address and billing address are different. These people are lazy and stupid. Do not buy from them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rasa Guin",
          "Nb_Reviews": 1,
          "Date": "2021-08-24T04:26:47.000Z",
          "Titre": "Still waiting for tracking number",
          "Contenu": "Ordered Xbox series x. I have not received my tracking number yet. They have taken my money but are not sending the item. Should have processed order and sent tracking by now. Customer service does not respond."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "nanoniigga",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T00:23:57.000Z",
          "Titre": "I ordered from here 3 weeks ago and…",
          "Contenu": "I ordered from here 3 weeks ago and never got my order and when i mentioned getting a refund, they wouldn’t respond back to my email."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "OAKS, DEAN",
          "Nb_Reviews": 2,
          "Date": "2021-12-15T16:25:47.000Z",
          "Titre": "Deceptive Advertising Practices..",
          "Contenu": "Edited - Confirmed reproduction copy of the game.I got one DS game and a few ds replacement cases that were advertised as, \"Retail Cases.\" Nowhere in the listings were the words, \"Reproduction Cart\" mentioned. The case and cart, while decent quality and not obviously reproduction, are indeed reproduction. This is not a problem to me personally, but I am beyond annoyed that this was not mentioned to me ahead of time. Same thing for the game cases. They were advertised as 3DS reproduction retail cases. They are functional cases, but clearly, cheap knock-offs that only vaguely resemble authentic 3DS game cases. Will not shop again. Cannot recommend anybody risk purchasing from this shop.Response to comment - As I said in this initial review. I do not have any issues with reproduction game materials, but what I do have an issue with is not labeling reproduction content as such on your website. Allowing a return will not change my opinion or review of your website and my review was not an attempt to get refund/return. Simply a warning to other potential buyers of your objectively poor advertising."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Heidi Nichole",
          "Nb_Reviews": 1,
          "Date": "2021-12-31T19:53:26.000Z",
          "Titre": "Poor Service",
          "Contenu": "I put in a order for a Nintendo DS game, no tracking number, no nothing. And I still haven’t received my game. Will not be ordering from this site again. They are a money scam"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Letsgo brandon",
          "Nb_Reviews": 2,
          "Date": "2022-04-30T04:18:15.000Z",
          "Titre": "Never refunded me horrible",
          "Contenu": "Never refunded me horrible I canceled order but he never refunded me in over 10 days horrible service do not buy from!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JAMES K LANE",
          "Nb_Reviews": 2,
          "Date": "2021-06-04T11:09:34.000Z",
          "Titre": "Order ID #92510",
          "Contenu": "Orders from May 28, 2021 have not yet shipped.I've sent an email to customer service but it's been 4 days no response.SCAM!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Wendy Israel",
          "Nb_Reviews": 1,
          "Date": "2022-04-16T21:29:57.000Z",
          "Titre": "I ordered a PlayStation 5 over a week…",
          "Contenu": "I ordered a PlayStation 5 over a week ago and still haven’t received a tracking number"
        },
        {
          "Note": 1,
          "Lieu": "KZ",
          "Pseudo": "TIM MILLER",
          "Nb_Reviews": 6,
          "Date": "2020-12-18T18:29:01.000Z",
          "Titre": "I ordered a PS5 one month before…",
          "Contenu": "I ordered a PS5 one month before Christmas and the website indicated it was available. After taking three times what it was worth from PayPal, I get notice that they don’t have it in stock. They say they will refund my money, but they’ve had $1300 for one month now. I think this is clearly fraudulent advertising that they had the PS5 when they clearly did not."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Arthur",
          "Nb_Reviews": 1,
          "Date": "2021-02-03T00:02:24.000Z",
          "Titre": "Game does not work!",
          "Contenu": "I just received super smash bros after waiting forever to get it! The game doesn't work!! As soon as turn on the game I get \"The game disc could not be read. Please read the Wii Operations Manual for more information\".Why resell a product you know doesn't work? Anyway I need a way to return this and get my money back asap."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jay Drako",
          "Nb_Reviews": 1,
          "Date": "2021-04-21T13:05:39.000Z",
          "Titre": "This website/ company is absolute B.S",
          "Contenu": "This website/ company is absolute B.S. pay extra to get ypur package delivered faster and end up never receiving it!!!! This is a scam. DO NOT BUY FROM THEM. THEY WILL RIP YOU OFF GUARANTEED!!!!! The emails they send you end up in spam and they have no real.company voicemail. Not a legit company by any means!!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Keyshawn Carter",
          "Nb_Reviews": 1,
          "Date": "2021-03-10T15:46:41.000Z",
          "Titre": "PLEASE DO NOT SHOP HERE",
          "Contenu": "So far I have had a awful experience I recently purchased a PlayStation 2 and GameCube after purchasing I never received a email never received tracking they website is very outdated I have only received the GameCube and it is dirty I can’t even check if it works because they didn’t put the ac adapter power supply in the box this has me really worried about the condition my PlayStation 2 will come in i try to contact them and they almost never reply please shop somewhere else to save you the headache"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "mack gordon",
          "Nb_Reviews": 1,
          "Date": "2020-05-29T01:03:41.000Z",
          "Titre": "Was very happy to find something I was…",
          "Contenu": "Was very happy to find something I was looking for at an unbeatable price. Been waiting all weekend for the order to update and so far nothing. I've placed the order Thursday. I understand they're running a little behind right now. But as long as I receive my item ill be completely satisfied.Update: order was quietly canceled. Waste of time and money"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jason Phelps",
          "Nb_Reviews": 1,
          "Date": "2020-05-27T22:41:22.000Z",
          "Titre": "Took 3 weeks for these scam artist to…",
          "Contenu": "Took 3 weeks for these scam artist to send some cheap China knock off game, which was not what I ordered, I would email them for tracking and they would ignore me, and say it's on the way, never would provide tracking, I'll never use these rip off snowflakes ever again, they suck!!!!! Only reason I left a star is because you have too, to continue"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anthony McCullum",
          "Nb_Reviews": 1,
          "Date": "2020-03-21T16:15:16.000Z",
          "Titre": "I ordered a ps1 game that was supposed…",
          "Contenu": "I ordered a ps1 game that was supposed to be in original packaging with manual instead I received the disk only inside of a ps2 case the pictures they post for what they are selling is inaccurate. They did offered a refund if I send it back and include the printouts of my emails. So in total for packaging prints I'll recoup only about half of what I paid. What a joke."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mr. Chris",
          "Nb_Reviews": 1,
          "Date": "2021-04-08T01:53:40.000Z",
          "Titre": "Shady and false info they gave me.",
          "Contenu": "I don't know about trusting this site. I ordered a Xbox 360 wireless and they sent me tracking info many days after the purchase and the tracking says will be delivered to Fort worth Texas tomorrow. I live in alaska, so I think they ripped me off for 40 bucks. Emailed them and some automated thing, its a super unprofessional company and shady as hell. Now these guys are trying to tell me the post office messed up the scan. HOW, WHEN YOU WRITE DOWN PALMER ALASKA? Because these guys are full of it. Just give me my money back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jordan Brown",
          "Nb_Reviews": 1,
          "Date": "2021-04-21T18:04:00.000Z",
          "Titre": "Delivery time was good",
          "Contenu": "Delivery time was good. But when the package arrived and I opened it the cd was loose inside the disc case and the bottom got scratched. It was very used looking and I am upset with disappointment that I payed so much for this. I haven't played the game yet to see how good it runs."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel Tracz",
          "Nb_Reviews": 1,
          "Date": "2021-01-11T22:23:32.000Z",
          "Titre": "PS2 SO DIRTY,COVERED IN SCRATCHES",
          "Contenu": "Just received the PS2 I ordered. Its like I bought it at a garage sale.The system is covered in scratches and so DIRTY I wish I could up load some pics to show just how bad,also the red AV cable jack is broken.Luckily I kept my old cables.The only good thing is the system does work."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Krizia Malavelebron",
          "Nb_Reviews": 1,
          "Date": "2019-05-07T12:27:24.000Z",
          "Titre": "This is by far the worst website to…",
          "Contenu": "This is by far the worst website to order from! I ordered 2 items Off this store and never received one of them. I tried multiple times getting in touch with ANYBODY and i never got a response.Basically they just kept my money, i will never order from here again and i will dedicate my time to making sure nobody else falls for this scam!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Luis Gomez",
          "Nb_Reviews": 1,
          "Date": "2019-12-09T02:33:49.000Z",
          "Titre": "Don´t get me wrong",
          "Contenu": "Don´t get me wrong, but I love this game!!!!! I just can´t sand it!!! This game keeps on shutting down on me. Also, it had updated all my DS´s and not soon after I started having problems with my DS´s systems. Why did they bring out a faulty game? please fix the problem Activision!!!!!!!!!!!!!!!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jennifer Topleva",
          "Nb_Reviews": 1,
          "Date": "2021-02-01T05:26:51.000Z",
          "Titre": "I need my tracking number!",
          "Contenu": "I need my tracking number!! I tried to email them using the email that was on my receipt and they still haven’t replied to me. It’s been days. I just need to know when my package is getting here. Once I receive my package and see how everything works, I’ll rewrite my review."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shdhdbhd Djdjehshhd",
          "Nb_Reviews": 1,
          "Date": "2017-06-11T00:39:15.000Z",
          "Titre": "AT NO COST buy from this guy",
          "Contenu": "AT NO COST buy from this guy. He buys the items you order from eBay and resells them. His contact numbers don't work and his email is just crap that he tells you so you'll back off until eBay sends him what you ordered. His tracking is broken because he has nothing to put in (obviously because he is still waiting for the item) and it will stay as \"processing\". This dude is utter bullsh*t"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Aaron Pool",
          "Nb_Reviews": 1,
          "Date": "2019-05-06T20:13:05.000Z",
          "Titre": "Terrible Experience",
          "Contenu": "I bought a PS2, a dualshock 2, and 3 GTA games. When it arrived 2 weeks after purchasing, the PS2 was scratched on the top, the controller's buttons were sticking and the analog sticks couldn't move. The games did not come with their original case, instead with a 3rd party dvd case and printed out box art. Plus, the rca cable was broken. I had to go out of my way to buy a new dualshock 2 on Amazon and a new rca cable. They neither care for their costumers nor their own image."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sean",
          "Nb_Reviews": 1,
          "Date": "2017-09-24T17:58:27.000Z",
          "Titre": "Bought super monkey ball 2 from them on …",
          "Contenu": "Bought super monkey ball 2 from them on eBay. Fast shipping, but what I received was a warped, non-original case (it was white, not black, and fitted for dvds) with the label having been printed on regular printer paper, and on top of all of this, the case was completely empty inside. No disc, not even a booklet. Completely illegitimate and disingenuous, currently trying to get my money back through eBay. Don't trust this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Aaron",
          "Nb_Reviews": 1,
          "Date": "2018-11-19T03:50:54.000Z",
          "Titre": "Bought a game awhile back",
          "Contenu": "Bought a game awhile back, seals came broken and I paid full price, emailed them and they still haven’t responded. One even turned out to be non-original. Would steer clear of this website/business, vary shady stuff!They made this comment on here so I forwarded the original emails and still nothing (tried 2 emails by the way)"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pete",
          "Nb_Reviews": 1,
          "Date": "2017-04-22T11:22:16.000Z",
          "Titre": "Money hungry crooks.",
          "Contenu": "Saw that the nes classic editions were being discontinued, so I found some in stock at playerschoicevideogames.com they had them for $129 I ordered one for me, one for my brother, and one for my nephews. They took my money right away, then emailed me the next day saying order was void out of stock. Then a couple days later they have them listed in stock for $309 they lied, they just didnt want to sell them to me at that price. Money hungry crooks."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Philip Lapierre",
          "Nb_Reviews": 1,
          "Date": "2017-01-17T17:07:47.000Z",
          "Titre": "10 days and no Xbox 360 game",
          "Contenu": "I ordered and Xbox 360 game on the 7 of January 2017, it is now the 17 of January 2017 and still no game. I filed two complaints and the company responded by saying that the order has been sent. I want to continue to do business with them but I'm having my doubts now, since they can't even handle sending in one Xbox 360 game."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "K Lawrence",
          "Nb_Reviews": 2,
          "Date": "2012-12-27T20:55:39.000Z",
          "Titre": "Never received my order and tracking system had no information.",
          "Contenu": "I ordered a couple of games for Christmas gifts.  However, I did not receive them prior to Christmas as intended.  Today, when I logged in to track my order, the form stated that they processed the order, but gave no information as to when it would be filled, shipped or if it was back ordered or anything.  At this point, I would rather cancel my order and simply purchase the games from my local retailer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jerry McClellan",
          "Nb_Reviews": 1,
          "Date": "2013-04-22T17:41:32.000Z",
          "Titre": "Sketchy at best",
          "Contenu": "After a week of having my order \"processing\" I attempted to cancel it.  They responded by saying my order had already shipped and that I would receive it in 3-5 days.  They could provide no tracking number for my shipment.  I am still waiting.  According to their website my order is still \"processing\".  I would never again do business with playerschoicevideogames.com and suggest no one else does either."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike Zarrabi",
          "Nb_Reviews": 1,
          "Date": "2012-07-16T19:45:09.000Z",
          "Titre": "Disappointed customer",
          "Contenu": "Very disappointed with Player’s choice. Placed an order for one video game 9 days ago. Paid $7 shipping which with most other companies means express delivery, but have not received the CD yet. E-mailed customer service 4 times (firs e-mail about 5 days ago) and have not received any responses. Unless this issue is resolved quickly, I will not deal with Player’s choice again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nathaniel Bruso",
          "Nb_Reviews": 2,
          "Date": "2020-12-18T22:38:15.000Z",
          "Titre": "My experience is not good",
          "Contenu": "My experience is not good. I ordered a Wii console amd Wii fit game for Christmas for my wife. I was informed that both had been shipped at the same time as I purchased them at the same time. I was given a tracking number for a package that contained both items. I only recieved the Wii fit game. I emailed customer service and recieved no explanation as to why I did not recieve the Wii console other than it will be here in 4-7 days. I also did not recieve any new tracking number. This is disappointing my wife was really looking forward to this as she is starting to get back into exercising"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Allison Bamcat",
          "Nb_Reviews": 2,
          "Date": "2012-04-23T14:14:51.000Z",
          "Titre": "Still waiting for my order to ship!",
          "Contenu": "I'm having the same problem that several other people have had - I placed an order, put in for expedited shipping, and now I've waited over a week for my order, which is still marked as \"processing.\" E-mail from customer service said my item shipped several days ago, UPS has not been updated with a new status and customer service has stopped replying to my e-mails. Hoping I get my \"new\" gamecube game!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "D f doucet.  New orleans. La",
          "Nb_Reviews": 1,
          "Date": "2019-05-06T22:29:01.000Z",
          "Titre": "Do not buy anything from players choice",
          "Contenu": "Ps2 was stolen when delivered  never could get anyone from players choice to contact  they refuse to give me a customer service phone number to talk to somebody  as far as I am concerned I would never buy anything again from this company  also filed a claim with my bank to get my money returned"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Keisha",
          "Nb_Reviews": 1,
          "Date": "2020-06-17T00:07:46.000Z",
          "Titre": "Make sure you won't need to return or refund!",
          "Contenu": "I ordered a game.on May 28, 2020...on June 3, 2020 it was still showing as \"processing\" and I cancelled my order and received a conformation message that my order was successfully cancelled. I also called and left a vm a couple of days after that but no one called back. The game arrived on June 11, 2020. Also I never could find the refund policy..NOT GOOD FOR BUSINESS!! 1 🌟 b/c at least I didnt get robbed....I got the unwanted game. Also finally got an email response from this company stating the not 100% refund policy! Thanks for nothing.. never again!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "M.",
          "Nb_Reviews": 1,
          "Date": "2011-12-01T23:19:06.000Z",
          "Titre": "Late Birthday Gift",
          "Contenu": "I placed an order for a game intended for my husband's birthday, 2 weeks ahead of time. I immediately got a confirmation e-mail, telling me that the order was processed and would be shipped soon. My husband's birthday came and went with no updated info and no delivery. The next day, I finally got an e-mail saying the product had just shipped."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chad Grabowski",
          "Nb_Reviews": 1,
          "Date": "2018-12-19T22:59:51.000Z",
          "Titre": "Scam artists",
          "Contenu": "Scam artists. Advertise NEW items on their website and send you refurbished models and and give you a lame I’m sorry as restitution. They could care less that they are completely scamming people. No where on the item page does it say REFURBISHED. It says NEW. stay away from this scam operation."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Breanna Lambeth",
          "Nb_Reviews": 1,
          "Date": "2020-06-12T18:04:19.000Z",
          "Titre": "It's been over two weeks and I still…",
          "Contenu": "It's been over two weeks and I still haven't received my game. I ordered it on the 27th of May. I'm not sure if it's because of covid 19 or something else but either way I'm surprised and a little disappointed that I still haven't received it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Will",
          "Nb_Reviews": 2,
          "Date": "2011-11-29T00:16:32.000Z",
          "Titre": "I ordered two games got one with a post it!",
          "Contenu": "I can't believe that this company can't send an email letting you know your other game is on back order! Theirs no customer service at all! I have no idea when the game will come. Did I mention that I ordered games on Nov 7th and I just got one today three weeks later Nov 28th!\rWhat a scam this company is, I will never order games from them. I just pray the sent me a real game! If you have the time to spar and don't give a sh*t these guys might work for you."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian Lesyk",
          "Nb_Reviews": 3,
          "Date": "2012-04-11T20:40:20.000Z",
          "Titre": "COMPLETELY UNACCEPTABLE SALES PRACTICES!",
          "Contenu": "I bought a PlayStation 2 game from them on 3/21 which was clearly advertised as being in new condition.  When I received it, it was obviously used.  The disc was severely scratched and was not readable in my PS2 or PS3.  I mailed it back to them the very next day with detailed correspondence as well as e-mailed them to relay the issue.  Despite several e-mails, I have never heard from them since nor have I received any sort of refund or explanation.  Today is 4/11.  Buyers beware!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "K",
          "Nb_Reviews": 1,
          "Date": "2012-03-14T13:55:55.000Z",
          "Titre": "Still waiting.....",
          "Contenu": "Still waiting for delivery of my purchased items.\rFinally emailed the company after many days had passed, to ask the status of my order.  Was told via email that my order had shipped (although website said status was \"processing\") and would arrive in 3-5 days.\rThe truth was the order had NOT shipped and did not ship for another 4 days.  Verified this by checking USPS status and tracking info on website.  \rGoing on almost 2 weeks now and still waiting for delivery of product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tiff",
          "Nb_Reviews": 2,
          "Date": "2018-12-11T15:47:19.000Z",
          "Titre": "These guys are deceitful about there…",
          "Contenu": "These guys are deceitful about there product. Ive returned my item and they still havent given me my money back.  They ruined my children main christmas present and wont give me my money so i can try and correct there wrong doing. I urge yall to shop elseware."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eunice M.",
          "Nb_Reviews": 1,
          "Date": "2011-12-27T21:38:55.000Z",
          "Titre": "Purchased a \"new\" Wii game but received a \"used\" one that is not readable at all",
          "Contenu": "I got a Wii Pokemon Battle Revolution game for my son as a gift from Santa supposedly. It was advertised as a \"new\" product but I received a \"used\" one instead. The packaging looks new but when my son opened it on Christmas morning, the disc inside has lots of scratches.Then when we tried to use it, the disc is not readable at all. We retried several times to no avail. I'm very disappointed and disheartened when I saw the look in my son's teary-eyed face. I told him that I will contact Santa and see if he can replace it. I will contact the seller today."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jc",
          "Nb_Reviews": 1,
          "Date": "2020-06-26T03:07:22.000Z",
          "Titre": "Barley works.",
          "Contenu": "The PlayStation2 I bought barely even works & the games too. I know the PlayStation barely works because I bought brand new games so it should be no problems but the PlayStation freezes the games or the games don’t work."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kirsten Kalamanski",
          "Nb_Reviews": 1,
          "Date": "2012-05-07T20:30:36.000Z",
          "Titre": "It Wasn't a New Game",
          "Contenu": "I had been searching for a new Final Fantasy 8 game without the \"PLAYSTATION GREATEST HITS\" on the side. And I thought I had found it on this site. I was very excited in putting in my order. The shipping was fine, but when I opened up my package, it said \"GREATEST HITS\" on the side. I figured that wasn't a problem, I could live with that, but I ordered this game new and there are 7 good-sized cracks all over the case. That is FAR from new and highly doubt that those cracks happened during shipment in a bubble-wrapped envelope. VEry, very dissappointed in these guys. False advertisment."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jonathan Slater",
          "Nb_Reviews": 1,
          "Date": "2020-04-22T16:46:28.000Z",
          "Titre": "Where Is My Order?",
          "Contenu": "Received only FF7 in shipping. Im missing the console, AV Cable and power, Hyoerkin HDMI cabke, and memory card. I have yet to receive updated tracking information or any contact from 'David' with this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Moto",
          "Nb_Reviews": 1,
          "Date": "2021-03-29T16:08:18.000Z",
          "Titre": "Deceptive vendor",
          "Contenu": "Player’s choice shipped an item that did not match the description/picture. When I contacted customer service, they gave a generic email and stopped responding after it. Buy from here at your own risk."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "A Jog",
          "Nb_Reviews": 1,
          "Date": "2009-09-22T16:26:45.000Z",
          "Titre": "Did not ship did not respond to emails",
          "Contenu": "Did not ship anything and it has been over two weeks and I have not even received a tracking number.  Apparently they ONLY ship on Fridays.  Sent them a couple of emails they did not respond.\rNo idea if this site is for real or just a plain fraud"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bailey Smith",
          "Nb_Reviews": 1,
          "Date": "2020-04-24T21:24:59.000Z",
          "Titre": "I ordered a PS1 replacement case",
          "Contenu": "I ordered a PS1 replacement case, but when it came it was completely broken with cracks everywhere and pieces that had fallen off. The shipping time was reasonable, but the product I received is completely broken."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marcus J. Hopkins",
          "Nb_Reviews": 3,
          "Date": "2012-02-21T00:50:19.000Z",
          "Titre": "Absolutely No Customer Service",
          "Contenu": "I placed an order for a product on February 11th and received a confirmation E-mail from Player's Choice Video Games saying that my order had been received.  The money was debited from my account for the order.  It has been well over a week since I placed the order, and the order is STILL listed as \"Order Received. Processing.\"\r I attempted to contact customer service, and received absolutely no response from the company, whatsoever, and just got an E-mail from their sales department asking me to rate their service?  They provided me with no service, no information, and as of yet, no product.\r So far, I'm not impressed in the least."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Augustus Brookshier",
          "Nb_Reviews": 1,
          "Date": "2019-11-06T17:49:27.000Z",
          "Titre": "Too slow",
          "Contenu": "According to the tracking link in the email I received it’s taking 3 days just to process my order. The website said I’d have my order by the 8th of this week and it is the 6th. Far too slow for my liking."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Torres",
          "Nb_Reviews": 1,
          "Date": "2019-12-15T13:46:58.000Z",
          "Titre": "I've been contacting players choice by…",
          "Contenu": "I've been contacting players choice by email and ive sent multiply emails but I never get a respond. I just have one question. The games and consoles you guys sell are they new factory sealed or Used."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jason Benninger",
          "Nb_Reviews": 1,
          "Date": "2020-12-08T17:17:45.000Z",
          "Titre": "scalpers are scum",
          "Contenu": "Not a pro-consumer company in any way. Just some scumbag scalpers who are trying to take advantage of Christmas shoppers. Do yourself a favor and just wait for real distributors to restock."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Donald Parsons",
          "Nb_Reviews": 1,
          "Date": "2020-11-26T18:20:35.000Z",
          "Titre": "Scalpers",
          "Contenu": "Scalpers. Dishonest company taking advantage of bots to buy new consoles to sell back overpriced. Companies like this are these the reason regular consumers can't get ahold of products."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeffrey Piercy",
          "Nb_Reviews": 1,
          "Date": "2019-12-12T02:29:23.000Z",
          "Titre": "Scammed, spend your money somewhere else",
          "Contenu": "Bought the Nintendo New 2DS XL from them because I thought it was actually new due to it saying new in rainbow colors separate from the device name, not to be confused with the device title \"New 2DS XL\". No where on the listing did it say refurbished and it still doesn't although they have taken down the rainbow new word. I could have bought this at Gamestop refurbished cheaper. You guys are false advertising scammers. To all potential shoppers read the bad reviews and spend your money elsewhere. Got a fast response that you can read. I clearly did not misunderstand the device name. I clearly stated you guys had new separate from the device name. I will not return it based off of the other bad reviews where they were not refunded."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Matthew B",
          "Nb_Reviews": 2,
          "Date": "2019-05-06T18:24:41.000Z",
          "Titre": "Received games that didn’t work",
          "Contenu": "Received games that didn’t work, contacted the company and asked if I tried cleaning the games. Explained I did, no more response or offer for refund or exchange for a working game. Go somewhere else!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeff M",
          "Nb_Reviews": 1,
          "Date": "2020-04-26T14:33:40.000Z",
          "Titre": "Purchased an advertised game bundle and…",
          "Contenu": "Purchased an advertised game bundle and only the game came.  When contacted regarding their advertising and requesting a refund their claim was they could not find my purchase information."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Gonzalez",
          "Nb_Reviews": 1,
          "Date": "2019-05-06T23:45:45.000Z",
          "Titre": "All boxes i ordered were not original…",
          "Contenu": "All boxes i ordered were not original to the ps4 and were already broken. I replaced the first one and when the second one came broken too, they never responded to my complaints again. F them"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeremiah EricNelson Jeffers-Jarvey",
          "Nb_Reviews": 2,
          "Date": "2017-04-19T21:34:56.000Z",
          "Titre": "it seems to be a fraudulent business. want my money back",
          "Contenu": "I placed an order on the 13th. My payment went through and I expected it to be shipped in a few days. Today is the 19th and the website said \"payment received prpcessing \" since the first day. I emailed the contact info and was told \"your order has shipped it will be there 4-7 days\" with no tracking info and website still says processing.  That was 2 days ago. I don't want to wait a second week for me to get my order so I cancelled my order today. I'm going to be very upset if they do not refund my payment.  And judging by other reviews I probably won't get my payment. I may take legal action if I don't receive a refund. As they seem to be running a fraudulent business practice. Judging by the other reviews"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Erica Triminio",
          "Nb_Reviews": 1,
          "Date": "2012-12-23T07:00:20.000Z",
          "Titre": "Fraud!!!",
          "Contenu": "I never received my order that was paid for over two weeks ago! Plus, there is no contact number to request for any status. This is the only gift my son requested for Christmas! Unacceptable and Fraud!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nik",
          "Nb_Reviews": 1,
          "Date": "2019-06-03T05:04:20.000Z",
          "Titre": "Smh 🤦🏾‍♂️",
          "Contenu": "Ordered a DS lite 3 weeks ago and still haven’t received any tracking updates. Still says being processed. 🤦🏾‍♂️If y’all aint gon send my shii i want my money back on god."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rod Bowsher",
          "Nb_Reviews": 5,
          "Date": "2020-05-19T01:31:53.000Z",
          "Titre": "Resealed and damaged games.",
          "Contenu": "You don't know what you're going to get with this company.  It doesn't say on their site if it's new, used, has the original case, the manual, etc.  Added to this, they reseal used games.  I ordered three games, and I thought two of them were new until I saw the third one in a completely bogus repro case yet still sealed, with no manual inside and the disc obviously damaged.  I wrote them about the resealing practice a few days ago and haven't heard back. I can attest to the other reviewer's statement that we are receiving bogus shipping notifications, too, as I've received notification that my shipment mailed days ago, yet it had not actually been shipped.  Turnaround time seems to be about two weeks at this point. Not a great first impression and will attempt a return."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marisa Ramirez",
          "Nb_Reviews": 1,
          "Date": "2021-01-29T23:47:51.000Z",
          "Titre": "I did not order two of the same game",
          "Contenu": "I did not order two of the same game. I had sent an email to let them know. I never received a replied. I want to turn them back, because they are not for the xbox 360."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Giianko",
          "Nb_Reviews": 1,
          "Date": "2021-02-26T07:08:51.000Z",
          "Titre": "Don't buy anything here",
          "Contenu": "Don't buy anything here, the items are different from the pictures, I purchased a Wii U white, than it arrived black in bad conditions, with some part missing"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nathaniel moore",
          "Nb_Reviews": 1,
          "Date": "2020-10-22T04:12:35.000Z",
          "Titre": "I place a order 3 weeks ago and I still…",
          "Contenu": "I place a order 3 weeks ago and I still don’t have a tracking number I want to know weres my order no one is contacting me at all I left so many messages and nothing"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ryan Quinn",
          "Nb_Reviews": 1,
          "Date": "2020-05-14T20:32:02.000Z",
          "Titre": "Blatantly lied to about shipping date",
          "Contenu": "I had to email them to get a status on my order. They lied and told me they had shipped it but it would take 4-7 days, no tracking number given. At day 8 I again emailed them requesting either a refund or a tracking number for the location. They told me again it had been shipped on the 4th but gave me a tracking number that was made that day. They finally shipped the package the next day. System came unboxed, wrapped in bubble wrap, with some type of sticky substance covering the controller and the wrong memory card carelessly tossed into the box. I will never purchase from this site again. Giving false information to a customer to cover incompetence or down right shifty business is unacceptable. I have screenshots to prove all of my accusations as well. I definitely did not get what I paid for and the customer service was subpar at best."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Holly Matthews",
          "Nb_Reviews": 1,
          "Date": "2020-05-26T21:36:11.000Z",
          "Titre": "Scratched disc that won’t play",
          "Contenu": "I recently purchased a game and it was so badly scratched that it would freeze at the opening scene so I never got to play it.i do not recommend this site to anyone"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "johnboy matt",
          "Nb_Reviews": 2,
          "Date": "2020-04-28T22:31:47.000Z",
          "Titre": "Horrible the nerves  waited over 13…",
          "Contenu": "Horrible the nerves  waited over 13 days for a faulty as ps3 cotroller i will never waste my fkng time aagain  with this chickenshit seller. send me my refund!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ashwin Mandha",
          "Nb_Reviews": 1,
          "Date": "2019-05-06T18:59:49.000Z",
          "Titre": "No clear details on the product whether…",
          "Contenu": "No clear details on the product whether its new or refurbished, as it was refurbished i returned product seller promised me refund shipping charges but never did."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel Smith",
          "Nb_Reviews": 2,
          "Date": "2019-05-06T19:05:30.000Z",
          "Titre": "Recieved a product which was not…",
          "Contenu": "Recieved a product which was not clearly represented on the site as being refurbished. Didn't receive any contact when the issue was presented to the site."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rachel",
          "Nb_Reviews": 1,
          "Date": "2019-05-22T05:45:27.000Z",
          "Titre": "They Dropship and send you the incorrect item",
          "Contenu": "They just drop-shipped from Nintendo. And I ordered a new 3DS console and received a refurbished. Stay away they rip you off and will not respond to emails"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nikki LaBelle",
          "Nb_Reviews": 1,
          "Date": "2020-03-20T19:47:02.000Z",
          "Titre": "Still didn’t come in and can’t track it.",
          "Contenu": "When I ordered some games, I thought it would take only a couple days, but it has been more than a week since I ordered mine and I can’t even track it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Angel Barnes",
          "Nb_Reviews": 1,
          "Date": "2015-09-25T23:05:13.000Z",
          "Titre": "Awful Experience",
          "Contenu": "Ordered a NES & 3 cartridges..NES and 1 game (Super Mario/Duck Hunt) came 2 weeks later...game  system was dirty and the game cartridge did not fit inside of NES...screws were also missing from NES system...second game arrived (Ms Pacman)...this game does not fit either... (still waiting on 3rd game to arrive @which will likely NOT fit either)...its going on 3 weeks now) i submitted form, online to advise of defective game system and recieved NO response. I even called the \"business #, listed on website to speak with \"David\", on pprox 3 different occassions and, STILL, no one has called back AT all!!! The website states  100% SATISFACTION GUARANTEED. ...This is NOT true!!!! Don't get fooled or scammed like I did...they  got my $ and I got a dirty, wanna-be refurbished system that doesn't work at all!!!!! #wontgetmenexttime  #buyerbeware"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "XxZeNzYyxX 860",
          "Nb_Reviews": 1,
          "Date": "2020-02-01T02:53:13.000Z",
          "Titre": "When I got my game today it was soooo…",
          "Contenu": "When I got my game today it was soooo scratched up when I got it and I am mad right now this is not cool you can’t treat your customers like this."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "patrick steele",
          "Nb_Reviews": 1,
          "Date": "2020-11-13T12:38:45.000Z",
          "Titre": "I love paying 200% mark up on ps5",
          "Contenu": "I love paying 200% mark up on ps5. There deals are hobo trash just like the customer service. Do urself a favor don't shop here."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steven Rohr",
          "Nb_Reviews": 1,
          "Date": "2020-09-08T18:03:23.000Z",
          "Titre": "Fake copies of Pokémon games!",
          "Contenu": "I purchased a Pokémon platinum game and the one I received was a fake reproduction version and not an original authentic game"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Trllla G (MatchGod)",
          "Nb_Reviews": 1,
          "Date": "2020-08-20T03:05:45.000Z",
          "Titre": "Bro I ordered a Ps2 slim just for them…",
          "Contenu": "Bro I ordered a Ps2 slim just for them to send me one that doesn’t even turn on. Light doesn’t stay green. I better get a refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steve O",
          "Nb_Reviews": 1,
          "Date": "2017-06-08T15:09:20.000Z",
          "Titre": "Horrible customer service and still …",
          "Contenu": "Horrible customer service and still haven't received my game after ordering it 3 weeks ago. Best to shop at a more dependable company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "DIB",
          "Nb_Reviews": 1,
          "Date": "2020-01-29T01:04:14.000Z",
          "Titre": "Bad customer support",
          "Contenu": "I received two Wii games at Christmas time for my 7 year old grandson.  The baseball game did not work.  It kept freezing.  I was told to return the damaged game which I did using my own money for shipping.  I recently received the returned package and assuming it was the new game, dropped it off at my grandson’s home. The next day I get a call from my 7 year old grandson saying he got the same game returned and that there was a note indicating the actual disc did not match the case it was in.  Well I did not open the original package received at Christmas time but wrapped it for his gift.  I can guarantee I returned the exact disc and case that I originally received. There is no way the discs could have been mixed up because he doesn’t own any other Wii baseball games. I ordered MLB 2K11 but unbeknownst to me the case said 2K11 but inside was 2K8.  I am offended that you think I would try to scam you. The mistake was made by Players Choice.  I asked them to make it right but they wouldn't.  I will never order from this site again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William Nipper",
          "Nb_Reviews": 1,
          "Date": "2020-08-15T17:33:43.000Z",
          "Titre": "Waited two weeks and they sent me the…",
          "Contenu": "Waited two weeks and they sent me the wrong game. I tried to send them an email. It’s been over a week with no response."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Johnathen Walker",
          "Nb_Reviews": 1,
          "Date": "2018-02-16T06:37:59.000Z",
          "Titre": "Awful conditions of games",
          "Contenu": "Ordered mvp 06 ncaa baseball and got the disc in awful conditions and it barely even plays . HUGE waste of time and money"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "brick",
          "Nb_Reviews": 2,
          "Date": "2021-02-14T06:55:22.000Z",
          "Titre": "Sent garbage to me",
          "Contenu": "Sent garbage to me. The disk tray is broken. These people are scammers. Do not waste your time or money here."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tom James",
          "Nb_Reviews": 2,
          "Date": "2020-06-12T00:28:57.000Z",
          "Titre": "spent awhile picking out cases for…",
          "Contenu": "spent awhile picking out cases for various game systems and the shipping was $89. way too high for what i picked."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Declan McGarry",
          "Nb_Reviews": 1,
          "Date": "2020-02-13T19:34:24.000Z",
          "Titre": "Players Choice is a fraud",
          "Contenu": "I would give this place zero stars if possible. I had attempted to order nintendo ds games from this place. After taking my order and money it took over a week to \"process\" and then they shipped it to the wrong address. When I contacted them about this they told me I would have to wait until the mail is returned to get my refund, despite admission that they sent it to the wrong address. Additionally after reviewing the complaints on the better business bureau, \"lost mail\" seems to be a problem for this business. I still have not recieved any games nor a refund over 3 weeks after ordering. Look anywhere else this company has the worst costumer service and is attempting to defraud you of your money. And now they are attempting to show that they sent it to me by showing the USPS tracking that shows it going to the wrong address in Illinois when my shipping address was in Portland, Oregon. No where on their site does it warn when you are buying that orders over $100 must be shipped to the billing address. That is not common practice considering Amazon and other online business will still ship to shipping address."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ming Chan",
          "Nb_Reviews": 1,
          "Date": "2013-04-10T23:47:40.000Z",
          "Titre": "Did not ship my item",
          "Contenu": "Did not notify out of stock of item. Had to ask several times and finally told me item was out of stock and cancelled.!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Living With Sam",
          "Nb_Reviews": 1,
          "Date": "2019-05-01T21:34:28.000Z",
          "Titre": "Cracked Disc",
          "Contenu": "When I received the video game somehow it was sealed but the disc had a crack in it making it unplayable."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bryce Christian",
          "Nb_Reviews": 1,
          "Date": "2019-04-01T22:48:12.000Z",
          "Titre": "I ordered a playstation 2 and a hdmi…",
          "Contenu": "I ordered a playstation 2 and a hdmi converter, have not received it yet. I would like a full refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Colin Mahoney",
          "Nb_Reviews": 1,
          "Date": "2020-09-29T05:51:44.000Z",
          "Titre": "Complete and Utter Scam",
          "Contenu": "This store is just an eBay front with no quality control over the products they ship. Essentially, you pay them more money for them to find the same cheaper product on eBay and purchase it from the seller. I bought a “Refurbished“ PS Vita from this site which was fulfilled by a third party eBay seller. The third party seller at no point disclosed that the console did not include a charger, original box, or anything. All I got was the console. The console was packaged poorly and sustained damage during shipping. The console was in a thin bubble wrap envelope that would only protect it from minor impacts but not from being dropped or handled roughly (you know, things that happen during shipping). There were no indications that the package was fragile.“All sales are final” and all returns must be filed within 14 days... it takes 14 days to receive your package with how slow shipping is. Even if it arrives before then, customer service is non-existent, so good luck even initiating a return. Even if you get to return your purchase, they don’t give refunds for returns, only store credit. They are scamming you out of your money. You would be better off buying directly from an eBay seller for a cheaper price. That way, you know exactly what you are getting."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nick",
          "Nb_Reviews": 6,
          "Date": "2020-11-20T07:41:54.000Z",
          "Titre": "Nothing but a scalper!",
          "Contenu": "Nothing but a scalper!Buying up hardware and selling in for 3x the price.  You are shameful!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2020-11-12T18:12:04.000Z",
          "Titre": "Sham",
          "Contenu": "Sham. Charging 1.2 K for the Xbox Series X retailed at $599. Can I give less than one star?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Garrett",
          "Nb_Reviews": 3,
          "Date": "2020-01-14T14:42:24.000Z",
          "Titre": "Misleading Condition Of Games",
          "Contenu": "I'm a collector and ordered Dragon Quest VIII on PS2. The condition said New. Anytime I wrote to ask questions (via Gmail and Facebook) I never received feedback, other than a few auto-responses to my gmail. I ordered anyways, seeing I understand backlogs, life, etc. Businesses get busy. What I received in the mail was a re-wrapped/resealed game, without the cover sleeve over top of the case (because this game came with one originally when it was actually new). When I opened it, there was no insert for the Final Fantasy XII demo inside, so this copy definitely isn't a complete copy. The worst part is the discs are all scratched up and it took me around 3 tries to finally get the game to play correctly. This is NOT a game in NEW condition and I DO NOT appreciate the misleading information. If it was advertised as mostly complete in fair/used condition, then I might've kept my expectations not so high, as well as, I would've never paid the price I paid. When you advertise something as NEW, people expect it to be NEW/SEALED, or VERY close, MINT condition even, but it wasn't. Yes, I bought out of my own discretion and I also understand that sometimes things happen. Businesses aren't always going to have a 100% perfect wrap sheet. Accidents happen, but I really feel like someone dropped the ball on this one."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Glenda Pinkerton",
          "Nb_Reviews": 3,
          "Date": "2021-05-28T18:28:55.000Z",
          "Titre": "My grandkids can't even play the game"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JASON TEALY",
          "Nb_Reviews": 1,
          "Date": "2020-02-20T05:39:38.000Z",
          "Titre": "This website is horrible never got my…",
          "Contenu": "This website is horrible never got my order,do not buy from them this is a scam"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Scottie Hayes",
          "Nb_Reviews": 2,
          "Date": "2021-05-28T18:29:05.000Z",
          "Titre": "No av adapter",
          "Contenu": "No av adapter. Wth false advertising much???"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Max",
          "Nb_Reviews": 1,
          "Date": "2021-04-11T13:12:57.000Z",
          "Titre": "Not of quality",
          "Contenu": "Quick shipping, but item is lower quality than described. I ordered replacement cases for my PS3 games, but the cases that came in were of distinctly lower quality. The plastic on the front seems to ripple on a few cases instead of being smooth, there’s no Blu-ray logo at the top, the transparency is different as well. I tried inserting an insert to one of the new cases but it actually didn’t fit. When trying to close the case the insert was getting bent and rippled. I wouldn’t recommend unfortunately."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Strike",
          "Nb_Reviews": 1,
          "Date": "2020-04-11T08:35:22.000Z",
          "Titre": "Order for PS4 taking forever to ship",
          "Contenu": "Selecting a ps4 wasn't the problem..I made an order for that on April 9th and its 11th and my order is still hanging in there without being shipping or any email received concerning any reason for the delay...its a birthday gift and I do think it will not make in due time...Price was perfect but service so far is getting fraustrated..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jacob Lund",
          "Nb_Reviews": 1,
          "Date": "2020-11-21T17:23:58.000Z",
          "Titre": "Do not support this company!",
          "Contenu": "Buying up new systems to sell at a markup is only something scumbags and terrible company's do. These are products that parents want to get for their children and company's like this are a problem."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "S Gott",
          "Nb_Reviews": 1,
          "Date": "2020-10-27T22:59:37.000Z",
          "Titre": "Not impressed with my Game",
          "Contenu": "I am not very impressed. I had a Good Shipment. I i bought the Simpsons Road Rage. I read some reviews that it was Xbox 360 compatible. When it got here today i found out it is not Xbox360 compatible. I am very Upset"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Patricia Daniels",
          "Nb_Reviews": 1,
          "Date": "2020-04-12T20:58:45.000Z",
          "Titre": "Ordered my game on the 9th",
          "Contenu": "Ordered my game on the 9th. It is still showing processing.  I tried calling but the number is disconnected.  I sent an email but no response.  If you were able to get in touch with anyone please let me know how.  If you work there, please contact me at.  Thank you"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jose Pezo",
          "Nb_Reviews": 1,
          "Date": "2017-04-12T17:34:44.000Z",
          "Titre": "Bad customer service",
          "Contenu": "I bought a PS1 from here and it was the dirtiest thing I have ever received and it doesn't even reade any games, I'm asking for my money back now but no one will respond my emails I've sent like 7 already. I have to use my own money to ship it back to them even though I spent $50 already on the ps1. Bad service overall and you can find better prices out there"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Timothy T. Jackson",
          "Nb_Reviews": 1,
          "Date": "2016-10-21T00:26:56.000Z",
          "Titre": "Incomplete order",
          "Contenu": "I ordered several games first then the controllers my order came missing the main game that I wanted with a post it saying it will be shipped in a couple of days so now I have the controllers and no game. I would have preferred the entire order to be shipped at the same time. I hope that this problem is being resolved and some sort of compensation is in order for my inconvenience."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Aaron Ferguson",
          "Nb_Reviews": 2,
          "Date": "2020-06-15T10:00:18.000Z",
          "Titre": "I have never shopped here before so…",
          "Contenu": "I have never shopped here before so this is my first time using this site but I Ordered my game on Wednesday and it’s been nearly a week and I still haven’t received any tracking information on it hope I didn’t get scammed"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bowserjr101",
          "Nb_Reviews": 1,
          "Date": "2020-04-21T04:38:05.000Z",
          "Titre": "Fake GBA game",
          "Contenu": "I ordered The Legend of Zelda: The Minish Cap and it came in about a week, so that wasn't too bad. The second I opened the envelope I got sketchy vibes. First off, the sticker was white instead of red/green (green for Europe, red for NA). The cartridge itself was rougher and thicker than a normal cart and barely fit into any of my GBAs or DS lite. I unscrewed it and on the board there was a battery save (MC does not save with a battery!) and no Nintendo logo anywhere on the board! I'm giving this 2 stars because as of now it works fine and I've had no issues gameplay wise, but when people expect a game, they typically expect it to be LEGIT!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jael Mena",
          "Nb_Reviews": 1,
          "Date": "2016-09-07T14:30:17.000Z",
          "Titre": "Requested a game they send me a fake",
          "Contenu": "In the post I found in the website nowhere it was stated that the game would be a fake, i lost money. It took me forever to get a tracking number and now I understand why...when I got the game it had a \"Test\" saved game as soon as I started playing it looked off then it stopped saving all together....I tried migrating to a newer generation and it never gave me that option. After a little research I realized the game was not authentic. SAVE YOUR MONEY DONT BUY FROM THIS SELLER"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeremiah Donohue",
          "Nb_Reviews": 1,
          "Date": "2013-05-16T19:26:41.000Z",
          "Titre": "I live in the same state as these guys and have been waiting for a week so far!",
          "Contenu": "7 days since order placed...oh and they got my money...I would have expected 5 days seeing as we are both in the Carolina's... no info on tracking on their site....no response to message left in VM....VM? Really? I'll get screwed by Gamestop from now on...at least I can go into a store and get someone on the phone!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Jones",
          "Nb_Reviews": 1,
          "Date": "2012-12-08T06:30:58.000Z",
          "Titre": "Very Slow Shipping & No Refunds!",
          "Contenu": "Well, I definitely should had read the NO-RETURN policy before buying anything, and the shipping has been slow, with only one item arriving, and I'm still waiting on the second item, which was the most important purchase. The prices may have been lower than some other stores, but it's definitely not worth the slow shipping or no return policy. It's unlikely that I'd order from this place again. I'd rather order from a place with a fair return policy and faster shipping."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Luke Philip Walter",
          "Nb_Reviews": 1,
          "Date": "2016-03-01T23:30:07.000Z",
          "Titre": "Good Price, Bad Service",
          "Contenu": "Their prices were a little better than similar stores, but they had pretty bad service. Their order tracking does not work if you aren't a member. When I told them that my link for order tracking wasn't working, they told me that my game had shipped and would be there in four days or so. Five days after placing my order, I received another email from them telling me that the games had just shipped that day. It's now been eight days and I have yet to received my games. Hope they come tomorrow, but who knows. I'd rather just pay more at Lukie games who got my games to me faster even though I ordered them later than the ones I bought from Players Choice"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alyssa Pliler",
          "Nb_Reviews": 1,
          "Date": "2016-12-24T19:42:51.395Z",
          "Titre": "Wrong Product",
          "Contenu": "I was really excited to receive a game that I was in love with when I was a child but when the package arrived it was the wrong game so I now have to spend more money to have it sent back so I can get the right product"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James Bonner",
          "Nb_Reviews": 1,
          "Date": "2019-10-06T17:24:48.000Z",
          "Titre": "The first time I used Player's Choice",
          "Contenu": "The first time I used Player's Choice, and it was a good one. I'm not much of a gamer occasionally, however, I'll partake and when I do I'll look at Player's Choice first"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Damon Bell",
          "Nb_Reviews": 2,
          "Date": "2019-05-06T18:00:39.000Z",
          "Titre": "Poor experiance",
          "Contenu": "Game and price ok but delivery took forever and was told it was lost by shippers but was not logged in with them till after multiple email contacts. Felt Like I Was Given the run around"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alice Yarnell",
          "Nb_Reviews": 1,
          "Date": "2013-01-14T18:50:23.000Z",
          "Titre": "My order still hasn't shipped.",
          "Contenu": "I had no trouble placing the order online and promptly received a confirmation of my order.  That was nine days ago.  I now have received this survey and I'm pretty sure there is a problem with my order."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jerome Martinez",
          "Nb_Reviews": 1,
          "Date": "2020-06-26T02:52:47.000Z",
          "Titre": "Disappointing first experience",
          "Contenu": "The games where decently priced and I really liked the fact that they came in a DVD style box with really good quality prints of the box art, but the games where super scratched. In my experience buying used games elsewhere if possible the seller or store would resurface the games. Not the case here apparently. I had to get them resurfaced, just out of fear of them not playing. The other issue I had was with shipping. I received an email from customer service saying my games where shipped and they’d arrive in 4-7 business days. I waited the 4 days. Nothing. Waited the 7 days. Still nothing. I contacted customer service again, And I was told the same thing. But after that I immediately received an email with a tracking number finally. Something that never happened the first time. It just felt like they forgot to ship it and only did it after I complained. I like the products on offer here, but after this first time experience, I doubt I’ll buy something from here again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Customerpennysuds",
          "Nb_Reviews": 2,
          "Date": "2019-05-06T19:58:56.000Z",
          "Titre": "Didn't get what I ordered",
          "Contenu": "Thought I was getting a new product but received a used one. They did send a mailing label and refunded my money. Process took a long time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mark Burrell",
          "Nb_Reviews": 2,
          "Date": "2013-01-21T06:08:17.000Z",
          "Titre": "Communication and delivery time promised by David there was HORRIBLE",
          "Contenu": "When David who works there sent me an e-mail on Jan 12 (7 days ago) telling me \"Your game has shipped.  Should be there in the next 3-5 days\", I then e-mailed you below on Jan 18 (1 day ago) saying. It's been WAY OVER 3-5 days.  \rI have been waiting everyday for my little boy to have those games.\r*** I checked the order tracking # 9400111201080672159762 ***\rUSPS.COM Website info,\rYOUR LABEL NUMBER:\r9400111201080672159762\r SERVICE:\rFirst-Class Mail®\r STATUS OF YOUR ITEM:\rProcessed at USPS Origin Sort Facility\r DATE & TIME:\rJanuary 18, 2013, 8:19 pm\r LOCATION:\rGREENSBORO, NC 27498\r FEATURES:\rExpected Delivery By:\rJanuary 22, 2013\r Why would someone from your company say they shipped it on JAN 12th when it was SHIPPED ON JAN 18th???  I need an explanation.  I have documented everything, all e-mails and all communication about this special gift for my little boy who has been waiting patiently."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "joey",
          "Nb_Reviews": 2,
          "Date": "2019-01-12T19:19:26.000Z",
          "Titre": "hello folks I was wandering that I…",
          "Contenu": "hello folks I was wandering that I looking for spiderman web of shadows on 360 for brand new that on sale let me know asap! thanks"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Max",
          "Nb_Reviews": 1,
          "Date": "2017-06-26T17:05:37.000Z",
          "Titre": "Will not get your product",
          "Contenu": "They have a large inventory, which would be impressive if the game I ordered almost two weeks ago had even shipped."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Erica",
          "Nb_Reviews": 1,
          "Date": "2014-06-30T02:37:39.000Z",
          "Titre": "Be wary when doing business with this company.",
          "Contenu": "I pre-ordered a new game on May 2. \"Pre-Order\" means I expect to receive the game on or before the date I can go buy the game in the store (May 30). I periodically checked the website for the order status, which always said, \"Order processing\". Well, on May 29, I still didn't have the game, so I contacted the company through their website (order status still said it was processing), asking for shipping info...no response. On May 30, I called and left a voicemail asking about my order...no response. That evening, I canceled the order so I could go to the store to buy the game...no response. Six days later, the game shows up in the mail.  Now I have to decide if I'm going to ship this back to them at my own expense or just sell the game on Craigslist. I am staying away from Players Choice!\r UPDATE: In response to this review, the company contacted me to return the game at their expense and refunded my money. Dave has been polite and responsive. I just wish this had been the case right up front. I still wouldn't recommend this company if you need your order by a certain date, but if you are flexible on when it arrives, they might be okay to work with."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Marco Spinelli",
          "Nb_Reviews": 1,
          "Date": "2012-07-18T08:48:34.000Z",
          "Titre": "Great selection, poor customer service",
          "Contenu": "I recently bought a genesis and sega cd (I'm one of the people that actually enjoyed this system for the adventure games) and was very impressed by the selection of games that Players Choice offered.  It almost seemed too good to be true and unfortunately, three weeks after placing my order, I am afraid that it was.\r Two weeks after placing the order, I finally received a shipment but only half of the games I ordered were there along with a post-it note informing me the rest of my games would ship soon.  I found this to be a somewhat unprofessional way of communicating this to me.  An email or phone call would have been better.  Also, one of the games is scratched and unplayable and another game in a generic CD case without any instruction manuel (I was never informed the game would arrive this way).\r This is not to mention that I have sent them numerous emails asking about the return policy and to check on the status of my shipment and have received exactly ZERO responses!\r To Players Choice: are you guys reading these reviews?  Because if you are, you should notice that your customer service is being called into question over and over.  I would love to be a repeat customer so work on this!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rob Palkowski",
          "Nb_Reviews": 1,
          "Date": "2013-03-12T05:58:57.000Z",
          "Titre": "Good prices, but shipping takes forever and customers service lied to me, flat-out.",
          "Contenu": "I found a game I'd been looking for, new, for a good price, and placed an order on a Friday afternoon.  I checked the site on Tuesday and my order was still 'Processing', so I used the contact form to ask how many business days it takes to process an order before it ships.\r I received an email Wednesday stating that my order had shipped and should arrive in three to five days, with no further information.  A follow-up message asking for tracking information went unanswered.\r Today, the following Monday (six days after the 'three to five days' window; ten days after placing the original order), my order status on the web site changed to 'Shipped', and the tracking system shows that it had indeed not shipped until this afternoon.  The person who said it had already shipped had given me false information and did not acknowledge further inquiries.  I find this to be unacceptable and I will hesitate to order from this company in the future, despite the quite reasonable prices they offer.\r Taking a full week to 'process' an order before it ships is an whole other conversation - particularly since they accepted payment immediately, but would be excusable if a fair expectation was presented as part of the ordering process."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ELISHA WEBB",
          "Nb_Reviews": 1,
          "Date": "2019-05-06T22:08:09.000Z",
          "Titre": "Horrible experience",
          "Contenu": "Took very ever to receive my package and Controller was brock."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ADventuresVDO",
          "Nb_Reviews": 1,
          "Date": "2020-09-11T17:55:05.000Z",
          "Titre": "Fast and cheap, but not great quality.",
          "Contenu": "I purchased a copy of Mega Man Legends for the Playstation, to give some context.The speed at which it shipped was good, I have no complaints with how soon it arrived.However, Players Choice Videogames did not properly inform me of the shipping progress.  I got a shipping link well after I bought the game, and when I clicked on it, I got an error message.  But I can't pin this on PCV too precisely, and I got it quickly, so I'm not especially bothered by this detail.The price was nice, about the price I would like to buy this game at today.  Games from the fifth gen are more expensive than they used to be, so it's nice to finally experience a generation from before my time at a reasonable price.However, I've only played fifteen minutes and have problems with the quality.  For one, the opening sequence is glitched due to a scratched disc.  It runs fine until a certain point, then the voice audio starts to loop at the wrong line before cutting out entirely.  Then the cutscenes have consistent stuttering, not enough to completely ruin them, but anyone who loves the game will hate it, and I can't feel confident my experience is being negatively impacted by a low quality product.The disc is really scratched, which is a very uncomforting realization since the case came plastic-wrapped.  I realize that a game doesn't have to be new to come in the plastic, but it's such a common thought.  I'd rather the game had come in just the box, because this seems deceptive, intentionally or not.This is a small point, but when I buy a game where the website displays a specific box-art, I expect the case that holds the box art on the site.  What I mean is that the website lists the box art for MML in the CD case- the one with the awkward-looking 3D render.  But instead, I got a DVD-style case that looks more like it fits in my PS2 collection.  Again, this is a nitpick, but it means if I want this game to not stick out in my collection, I gotta buy another case with the art I expected.  Little inconveniences like this should be avoided.To recap, I'm giving PCV a 2/5 because I got a low-quality product that, while it works semi-decently now, could very well fall apart in a very short time.  If they could mention the quality of the game on their website, or if they could just up the quality of their copies, this should be a non-issue since I would know exactly what I was buying.  The other details were worth metnioning in my eyes, but not worth docking further points on their own."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stacci bass",
          "Nb_Reviews": 1,
          "Date": "2022-12-08T01:07:06.000Z",
          "Titre": "Just ordered a game Friday n still…",
          "Contenu": "Just ordered a game Friday n still processing and no track numbers"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charles Wright",
          "Nb_Reviews": 4,
          "Date": "2022-04-19T18:07:38.769Z",
          "Titre": "service",
          "Contenu": "after the order shipped, there was a bit of an extended delay at the USPS store in NC after the shipping label was created. But, when the order was unpacked, the console was bigger than the item picture."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Covington Jr",
          "Nb_Reviews": 1,
          "Date": "2021-05-02T21:03:31.000Z",
          "Titre": "The game was scratched up but for it to be almost 30 yrs old it was cool.",
          "Contenu": "The game was scratched up but for the it to be almost thirty yrs old it was cool."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kolby VanDonge",
          "Nb_Reviews": 1,
          "Date": "2020-06-12T22:08:26.000Z",
          "Titre": "Communication lacked.",
          "Contenu": "Communication wasn’t great. Took a week to get an email reply and I emailed 3 or 4 times. Phone number didnt work when I called 5 or 6 times but as far as the items I ordered I was impressed, everything worked great and I received 4 games as a bonus that I didn’t even request. Pretty good experience, just recommend working on customer service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "claire",
          "Nb_Reviews": 1,
          "Date": "2020-02-03T14:17:36.000Z",
          "Titre": "Not as bad as I had originally thought",
          "Contenu": "So here is what happened. I ordered a Wii U from here and they took the money out of my account. Then it proceeded to take them a week to respond to my emails, which they only did after I left a bad review. Turns out they cant ship to my address, which means that I had to go somewhere else for my Wii. They refunded my money which was great, but honestly it was about a week of me getting having nobody respond to my emails, and feeling like I got robbed. Also their phones do not actually seem to function."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Corey Winder",
          "Nb_Reviews": 1,
          "Date": "2019-09-03T16:25:25.000Z",
          "Titre": "I received a used Guitar Hero 3 PS2…",
          "Contenu": "I received a used Guitar Hero 3 PS2 game that was wrapped up like it was new and had scratches on it(yes games can get scratches) but it didn't work. Tried multiple times and it didn't work but I'm receiving a different copy and customer support is willing to work with me to get me a different copy."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cameron Lane",
          "Nb_Reviews": 1,
          "Date": "2017-02-10T03:35:07.000Z",
          "Titre": "Got my stuff... but with a little friction.",
          "Contenu": "I ordered DS cases. they were all off-brand and not what was shown on the website. :/UPDATE: I ordered pokemon sapphire edition from these guys, and what I ended up getting was a poorly made counterfeit gamecart of pokemon sapphire edition.2nd UPDATE: I sent back the bad copy of the game, and they sent me a legitimate copy. I would like to say (to the company) add an option for people to choose if they are fine with a counterfeit copy vs a real copy."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Hecs",
          "Nb_Reviews": 1,
          "Date": "2016-12-13T02:37:45.120Z",
          "Titre": "Slow Shipping",
          "Contenu": "I ordered the game as a Christmas present and had no idea in what condition it would be in. The price wasn't too bad all things considering. However, it took nearly a week to process my order. After it was processed though, delivery was quick. I received the order a few weeks later. The game was in acceptable condition but in a Wii game box (I ordered a GameCube game). This is a good site to buy your games as long as you can wait for order processing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Connie",
          "Nb_Reviews": 2,
          "Date": "2012-12-25T07:21:56.000Z",
          "Titre": "I received my iteams but they look beat up.",
          "Contenu": "I bought super mario brothers for $25 bucks for that price I expected a game in good condition, what I got was a game with bad scratches around it and looks discolored from the inside. Unfortunately another game site still has not sent me what I ordered over two weeks ago so I cannot test the game, all I can do is hope that it works and doesn't break after a few times played. But overall happy my item came in just really scared of the condition I got it in."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jane Au",
          "Nb_Reviews": 1,
          "Date": "2012-09-30T03:11:06.000Z",
          "Titre": "please reply to question",
          "Contenu": "I would like to buy a NEO Fami console and the first time when I send in a question it was answered the very next day. But I had a second question but been waiting for 4 days and still no reply.\rI really like to know if it is indeed what I want to buy before I buy it. \rThis store has a no return policy and eventhough the price of everything seems cheaper than anywhere else. I still don't want to pay for something and the shipping for something I may end up of no use."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "charles gonzales",
          "Nb_Reviews": 1,
          "Date": "2016-12-13T16:05:50.000Z",
          "Titre": "First time buyer,",
          "Contenu": "My experience was okay,only thing was when I tried to track my item they were slow to put any information when I was trying to track it. So overall I was okay with it since I did receive it. It just made me wonder if they received my order. I even called pay pal to verify that my order was placed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2020-03-28T09:27:08.000Z",
          "Titre": "mehh",
          "Contenu": "Had to update after product received. Disk had a few scratches and smudges despite having plastic around the case, but still works fine. Hours of operation should be included on the contact us page, since they're apparently closed on Saturdays."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Adan Mendoza",
          "Nb_Reviews": 1,
          "Date": "2013-02-27T22:14:16.000Z",
          "Titre": "Found a great Price on original Xbox controllers :-D",
          "Contenu": "I have been searching stores in my area and could not find a single store that still carries original Xbox controllers,I even checked online and most sites wanted $20+ for a used or refurbished controller which in my book is a NO-GO considering that they used to retail for about $14 for the mid range quality controllers but luckily I found this site online and for about $26 I am getting two controllers instead of one...though the shipping leaves a bit to be desired considering it I am paying for the shipping :-("
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stephen Munn",
          "Nb_Reviews": 1,
          "Date": "2013-02-09T02:45:35.000Z",
          "Titre": "A little more transparency on what I'm buying would be great.",
          "Contenu": "I bought a Game Boy Micro. It didn't say whether it was used or new, so I assumed used. The picture provided on the site was the official Nintendo product image, which shows two additional faceplates, in addition to the default one. The console arrived with only the default faceplate and a charge cable. The screen has a significant scratch in it, so when it's turned on, the scratch glows white. On anything but a white screen, it's distracting.\r I sent an email a day or so ago asking about the faceplates and have not received a response."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeffrey Warren",
          "Nb_Reviews": 1,
          "Date": "2019-05-06T21:38:14.000Z",
          "Titre": "Good service, bad waiting time",
          "Contenu": "Honestly I was pleased when I actually got the games but fact that I had to wait almost 2 weeks to get the games was ridiculous..I don't know if it was the company or the mailing service but either way, it felt alot longer then anticipated"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Aaron  Dzik",
          "Nb_Reviews": 1,
          "Date": "2012-12-11T22:34:08.000Z",
          "Titre": "Supremely slow processing and shipping",
          "Contenu": "I would write about the game console quality in this review, except i have yet to receive it after 2 weeks. I don't want to dismiss the quality of their products, however they simply need to address the tardiness of their processing/shipping department."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Wilkins",
          "Nb_Reviews": 1,
          "Date": "2013-07-01T12:02:10.000Z",
          "Titre": "Questioning",
          "Contenu": "Although I'm very nervous about trusting this website, I'm going to use it anyways for two reasons. One being that I found it while shopping through google and the other is that they say its ssl certified but we will see if all my money it gone."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Game Collector",
          "Nb_Reviews": 1,
          "Date": "2019-05-07T00:25:27.000Z",
          "Titre": "Inaccurate description",
          "Contenu": "Game was listed as \"Collectible\" condition but had no original packaging, and also didn't include the manual. Disc itself is in good condition, nonetheless the deceptive description has left me disappointed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Angelica",
          "Nb_Reviews": 1,
          "Date": "2019-05-06T19:57:38.000Z",
          "Titre": "Return/exchange with no response from Customer Service",
          "Contenu": "Bought a game console controller, and was thinking of either returning it or exchanging for a different model since the buttons are getting stuck down. Tried emailing Customer Service with no response from them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Matthew Schmidt",
          "Nb_Reviews": 1,
          "Date": "2017-01-28T14:45:33.000Z",
          "Titre": "Going to stay optimistic!",
          "Contenu": "I've reached out to their team several times now with questions about the conditions of their games but haven't heard anything. Might just try ordering it and waiting to see for myself the condition of the games"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nancy Jurgens",
          "Nb_Reviews": 1,
          "Date": "2012-12-10T23:24:45.000Z",
          "Titre": "Good Fast Service - Unforunately tried to get  DVD game & all were defective.",
          "Contenu": "Playerschoicevideogames provided good, fast service.\rUnfortunately the game I ordered came defective.  I'd ordered 2 more and they were defective too.\rI think playerschoice should try the DVD before they send it out."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Theresa",
          "Nb_Reviews": 1,
          "Date": "2011-11-21T00:02:33.000Z",
          "Titre": "Good Selection, but games dirty.",
          "Contenu": "I bouth two NES games and a 72 pin connector replacement.  Prices were great, hence the reason I ended ordering with this site.  It took a couple of days to process the order, but even living in Phoenix, I had the games by that weekend!\r The biggest negative for me was the games were dirty, literally.  I had to dismantle them and clean them before they would work in my NES.  I double checked with game I already had to make sure it wasn't the NES, but when my other games worked it seemed pretty logical it was the games that didn't work.\r It wasn't that hard to clean them, it was more just that thought that it may not have just been a dirty game.  Perhaps thats why it's cheaper."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "comhcinc",
          "Nb_Reviews": 8,
          "Date": "2018-04-11T21:29:43.000Z",
          "Titre": "As a retro gamer I love sites like this…",
          "Contenu": "As a retro gamer I love sites like this but I am often unhappy to find that one page will show stock and when you get to buy page it will not show any. Maybe I am just reading it wrong?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MaryJo Dunckley",
          "Nb_Reviews": 2,
          "Date": "2013-01-07T17:20:49.000Z",
          "Titre": "No shipping info on my order",
          "Contenu": "It has been a week and I still have no information about my order being shipped. I have sent two emails regarding this and no response. Must Have Better communication with customers......"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "trevor",
          "Nb_Reviews": 1,
          "Date": "2016-01-26T12:49:04.126Z",
          "Titre": "Not a bad vendor if you're looking for specific titles.",
          "Contenu": "I like the concept behind the company, and they certainly have a vast stock. I haven't yet purchased anything from them, personally, but I eagerly await my first opportunity."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chuck",
          "Nb_Reviews": 2,
          "Date": "2021-11-24T15:47:28.000Z",
          "Titre": "Delivery much (2 weeks) longer than…",
          "Contenu": "Delivery much (2 weeks) longer than original estimate."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stefanie Jamerson",
          "Nb_Reviews": 1,
          "Date": "2021-01-25T21:35:35.000Z",
          "Titre": "Game purchased was good",
          "Contenu": "Game purchased was good. Service mailing it out was poor; had to email company for verification.  10 days wait for confirmation.. to long.  Thanks."
        },
        {
          "Note": 3,
          "Lieu": "PH",
          "Pseudo": "Nathan",
          "Nb_Reviews": 1,
          "Date": "2022-02-14T21:25:57.000Z",
          "Titre": "Good quality video games",
          "Contenu": "Good quality video games. thanks"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jose Mateo",
          "Nb_Reviews": 1,
          "Date": "2012-12-31T19:28:30.000Z",
          "Titre": "product was used",
          "Contenu": "Never said on product description it was used... so when it arrived I did noticed the box was not official ps3 box (generic) and disk had a few scratches... USED"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "J. Baker",
          "Nb_Reviews": 1,
          "Date": "2012-09-09T20:40:55.000Z",
          "Titre": "When will it get here?",
          "Contenu": "After waiting for two weeks, our order finally arrived.  What a happy day for my son.  I only wish that the game we ordered would have been shipped sooner."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Adrian Moreno",
          "Nb_Reviews": 1,
          "Date": "2019-05-06T19:47:32.000Z",
          "Titre": "Pretty good deals",
          "Contenu": "Pretty good deals, bought copies of Pokémon diamond and pearl and they turned out to be fake. But they worked so cant complain."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kenny Screven",
          "Nb_Reviews": 1,
          "Date": "2020-05-28T08:57:23.000Z",
          "Titre": "Still waiting for my tracking number…",
          "Contenu": "Still waiting for my tracking number order to update. I ordered my game a week ago. Wondering if it’s already been shipped."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Raegon Moseley",
          "Nb_Reviews": 1,
          "Date": "2016-12-12T23:24:02.000Z",
          "Titre": "Brain age game",
          "Contenu": "I am happy to have finally received my game today, though I am displeased I got it three days later than the tracking system said."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kristina Duffy",
          "Nb_Reviews": 1,
          "Date": "2020-11-25T08:39:35.000Z",
          "Titre": "The website is quite descriptive and…",
          "Contenu": "The website is quite descriptive and easily accessible. I found a vast variety of games and accessories available."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joshua Selje",
          "Nb_Reviews": 1,
          "Date": "2013-01-31T21:54:11.000Z",
          "Titre": "Wondering",
          "Contenu": "Haven' rreceived item yet, $12 bucks for shipping and it's been 10 days, not mad just confused."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Matthew Baetzhold",
          "Nb_Reviews": 2,
          "Date": "2019-08-22T12:41:10.000Z",
          "Titre": "Not the value I'd expect for $100",
          "Contenu": "Bought a PS2, worked for about a month and now displays a distorted image. Rough for a $100"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Spantack Numbernine Shooter",
          "Nb_Reviews": 1,
          "Date": "2015-01-04T19:45:26.000Z",
          "Titre": "Shipping",
          "Contenu": "I actually scared because I believe it's a fraud but I'm going to give it a try"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eddie Pagan",
          "Nb_Reviews": 1,
          "Date": "2013-01-22T17:48:09.000Z",
          "Titre": "Quality was bad",
          "Contenu": "Disk was used in a way but not bad cause it's able to install"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Maria G Hernandez",
          "Nb_Reviews": 1,
          "Date": "2014-08-11T16:03:12.000Z",
          "Titre": "good deals on pricing",
          "Contenu": "trying it out for the first time"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "TARANDEEP  SINGH",
          "Nb_Reviews": 1,
          "Date": "2012-12-18T18:52:58.000Z",
          "Titre": "Took too long to ship!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tina",
          "Nb_Reviews": 1,
          "Date": "2023-12-23T06:28:49.000Z",
          "Titre": "I ordered a game for my grandson for…",
          "Contenu": "I ordered a game for my grandson for Christmas.  All I received was an email showing my credit card was charged.  After several days with no other information, I emailed the address on the invoice.  David responded very quickly with a tracking number.  The tracking number showed a label was prepared but package not received.  Another email to David.  He couldn’t understand why USPS hadn’t scanned it.  I don’t know if he contacted the post office or what, but the next time I checked the tracking number, but it was scanned and in transit.  I did receive the package from n time for Christmas.  David was very understanding and helpful.  Four stars are given because no tracking number was given until I emailed the company."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bobby Davis",
          "Nb_Reviews": 2,
          "Date": "2023-06-01T14:03:32.000Z",
          "Titre": "Got my replacement PS2",
          "Contenu": "The replacement works well and I didn't have to wait long for another which was niceUpdate: I kept getting asked to change my 1-star review or delete it and no I won't because it doesn't change the fact that you lazily gave me a bad one without checking if it's good or not first"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alec Pucillo",
          "Nb_Reviews": 1,
          "Date": "2022-06-07T23:08:29.000Z",
          "Titre": "Depends on the gamer but plastic wrap is a waste",
          "Contenu": "I purchased a couple of PS3 Move games, Player's Choice (PC) packages the game in generic PS3 cases (does not say \"Blu-Ray\" on the top). They could have stopped there (I know I'm buying a used game) but I was disheartened to see they sealed it in a plastic wrap. To some it might bring joy but I saw it as waste when plastic is a big issue worldwide. Other than that decent pricing, responsive team, and disc quality."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charles Brown",
          "Nb_Reviews": 1,
          "Date": "2022-11-04T19:03:59.000Z",
          "Titre": "What I think.",
          "Contenu": "Everything was fine, haven't really had chance to play game much but looks different than other resident evil games, could be a good thing, I'll find out."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nathan segevan",
          "Nb_Reviews": 1,
          "Date": "2022-10-21T21:36:07.000Z",
          "Titre": "Scratches on it but other than that",
          "Contenu": "To be honest I'll give it a four out of five because sometimes it freezes where I have to restart the game because the disc y'all sent me have a lot of scratches on it...... But other than that I've enjoyed playing it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brenden Hamilton",
          "Nb_Reviews": 1,
          "Date": "2021-05-02T03:56:36.000Z",
          "Titre": "The game I bought was hard to find and…",
          "Contenu": "The game I bought was hard to find and they had it which was cool. The price was better than other places as well. That’s 90 percent of the battle and they aren’t a scam site which is a huge plus. The game shipped kind of slowly but it was quicker than ikea when I bought end tables. I had a bit of a hard time tracking the shipment but I didn’t make an account before I ordered so that’s my bad I guess. All in all a very good place to buy older games for cheaper than GameStop and the game showed up so 4 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joy",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T03:58:15.000Z",
          "Titre": "Great prices and service",
          "Contenu": "I love the prices of the games and if I have a problem I can always get help with it and they are more than happy to help. Great selection and service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "C.J. McClure",
          "Nb_Reviews": 1,
          "Date": "2022-04-22T06:00:59.556Z",
          "Titre": "Service Was Good. Legit Site.",
          "Contenu": "I’ve ordered a controller, a game, and a PS3 console from this store.The controller took a little while to ship but it worked fine. In fact it works better than my PS4 controller and it’s a PS3 controller. But I’ve had it for like a year I think and I still have yet to have any issues with it. The game shipped the quickest and also worked fineThe console shipped pretty slow and when I got it it was defective. It kept overheating really quickly and it was virtually unplayable. I couldn’t be on it for more than like a few minutes before it would shut off from overheating. I contacted Players Choice and David offered a replacement one which works fine. I’ve had the new one for about a month and I have no issues with it. Well I guess the only issue is that the controller that came with it doesn’t really work, nor did the one that came with the first PS3 I got, but I just use the PS3 controller I originally got from players choice which, again works fine.All in all I guess the only real cons I have with buying from Players Choice is that some items take a while to ship, even when like realistically you’d think they’d be shipped about faster than they were, and like it’ll say it “shipped” on the site on a date before it actually shipped, and the controllers that come with the consoles that get shipped to you may not work properly.(Mine didn’t) but like other than that, the site is legit you get the products you order which generally work fine, and if you get a product that doesn’t work you can just contact them about it and they’ll replace it with one that does, so there’s not really a hassle in that area.All in all, I was definitely satisfied with my service here and it’s a pretty great site to order stuff from that aren’t usually on the gaming market anymore."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrew Qualls",
          "Nb_Reviews": 1,
          "Date": "2021-08-27T19:36:03.000Z",
          "Titre": "Fast shipping",
          "Contenu": "Fast shipping, however 1 of the 5 cases has a weak clip"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rebecca Herold",
          "Nb_Reviews": 2,
          "Date": "2021-12-02T20:38:57.000Z",
          "Titre": "Very simple and fast delivery"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Justin Jemison",
          "Nb_Reviews": 1,
          "Date": "2020-10-25T14:07:02.000Z",
          "Titre": "I found all of the old games loved when…",
          "Contenu": "I found all of the old games loved when I was a kid bring back so many good memories and also touchas my heart cause I can remember my mom taking me to toys r us to get NBA live 95 96 97 98 and 99.my mother passes away in 2006 and I miss her so much.thanks for the memories and I can't wait to play live 97 I might cry when I turn it on for the first time .thank y'all and keep"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Hamill",
          "Nb_Reviews": 1,
          "Date": "2020-11-01T23:50:02.000Z",
          "Titre": "Some difficulties, but eventually satisfied",
          "Contenu": "The initial game was so scratched we couldn't get past  the 1st level.  The return process was a bit harder than any other company I made returns with in the past. I ended up having to pay, pack & ship it myself. I eventually got a working copy and a cash refund. So far the game runs smoothly I will edit if anything changes (:"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Koz",
          "Nb_Reviews": 1,
          "Date": "2020-06-18T15:58:08.000Z",
          "Titre": "I got the Ps2 I ordered",
          "Contenu": "I got the Ps2 I ordered, and it works great. The controller wire sheathing had worn away a bit, revealing the wires, which was slightly disappointing, but not a worry. 3 second fix. It works perfect. Shipping/the arrival was a bit of a hassle, but I'm 90% sure that's because of COVID and USPS. Definitely can trust buying somehing from here."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kristine McDonell",
          "Nb_Reviews": 1,
          "Date": "2021-04-30T20:23:39.000Z",
          "Titre": "DS Game Ordered - Great Condition!",
          "Contenu": "Ordered ds game for my son. Order was here in about 10 days. Package was clean and undamaged; and no glitches 🙂✨Only one suggestion - would be nice to have a time line for delivery - wasn't able to see tracking until week after order was placed.  Would order from them again❗"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe Herrera",
          "Nb_Reviews": 1,
          "Date": "2020-03-13T17:06:28.000Z",
          "Titre": "Ordered Marvel Vs Capcom 3 (PS3)",
          "Contenu": "Game arrived in good condition. The tracking number I had for my order was not working for me but after emailing the site I had a very fast response and update. The game came with a manual that was a bit banged up on the cover page but in good condition everywhere else. The game disc had rings and streaks, likely from cleaning, but was easily wiped off with a glasses cleaning cloth. Overall pleased with the product, good price and fast customer service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Natalie",
          "Nb_Reviews": 1,
          "Date": "2020-05-01T01:30:47.000Z",
          "Titre": "As a video game collector",
          "Contenu": "As a video game collector, and first time ordering from the site, I was nervous with the reviews and such. I ordered 3 games that I hoped were authentic. 2 out of 3 games were, and I had a problem with the third game as it did not load properly up to my console; I emailed the customer support, and they got back to me within a day of the issue. They are a great service for first time use, and I am happy with my purchase. And I am pleasantly surprised that they were willing to help, so 4/5 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joshua Hancock",
          "Nb_Reviews": 1,
          "Date": "2019-05-27T19:19:13.000Z",
          "Titre": "Great delivery. Good condition.",
          "Contenu": "Got my game shipped to me sooner than expected. It came wrapped in what was obviously aftermarket plastic. Not sure why. The disc appeared to be in good condition. It appeared to have been cleaned but a residue was leftover showing the wiping motions. Cleaned it myself and the game only froze once so far on the second loading screen during gameplay."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "jacob haddad",
          "Nb_Reviews": 1,
          "Date": "2020-06-14T08:48:26.000Z",
          "Titre": "This is the best website for video…",
          "Contenu": "This is the best website for video games and i recommend to buy games from them. but the only thing I don't like it they shopping with USPS & the USPS they have so bad service. I hope they go with UPS or FedEx it's much better good service ;fast delivery ;Care about the order. Thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "roger melendrez",
          "Nb_Reviews": 1,
          "Date": "2016-09-22T03:43:25.000Z",
          "Titre": "Their quality is legit.",
          "Contenu": "This company doesn't waste time. You order and they will have it sent to you within 3-5 business days. I ordered two games from them and received them in perfect condition. If you are reading this because you're second guessing about ordering from this company, I'm going to go ahead & tell you to order from them! Prices are reasonable as well. I will definitely be ordering some more items from this website. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Leo C.",
          "Nb_Reviews": 2,
          "Date": "2021-03-06T20:45:26.000Z",
          "Titre": "I was only sent half of my order",
          "Contenu": "UPDATE:  While I did have trouble getting the final order (still waiting for the final piece, but it is on the way), the representative from the company (I was able to email them) did keep on top of it until my order finally got corrected. One thing to note, the items were in GREAT condition when I got them.  I probably will order from them again, but I really hope it goes more smoothly next time.Original Post:I was only sent half of my order, and have been unsuccessful in contacting this business as their phone number is disconnected and their contact form will not allow me to send a message."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel Gonzalez",
          "Nb_Reviews": 3,
          "Date": "2013-02-19T18:24:51.000Z",
          "Titre": "great place to find hard to find games",
          "Contenu": "prices are very fair and the service was ok i purchashed a game and called ahead of time to make sure cause i wanted to make sure it had everything in it cause i like keeping them in near mint to mint condition i was told that it was complete. when they replied to my email asking the same question i was told it was missing the instruction manual which i am greatly disappointed about. but so far everything else about them is great"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Colin Matthew Christman",
          "Nb_Reviews": 2,
          "Date": "2012-07-31T20:22:39.000Z",
          "Titre": "Had what I wanted, got it quick!",
          "Contenu": "I ordered SOCOM: U.S. Navy Seals from this company. They had it in stock, new, for $3.99 with $6.99 for shipping. The product was shipped quickly, and was shrink wrapped to look like new. I know the difference between a DVD case and a PS2 case, so when I opened it up, it was in a DVD case (was missing the PS2 memory card holder.) No matter, the game was in almost perfect condition, and it was at a great price. I would definitely order from this company again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lilian White",
          "Nb_Reviews": 1,
          "Date": "2016-02-03T16:46:03.855Z",
          "Titre": "Decent treatment and very little friction",
          "Contenu": "We ordered a PlayStation 2 game the other day. The disc was so scratched that we couldn't play it. After we sent an email to them telling what happened, they replied (in only one day) saying that the game is going to be replaced. A week later the game came (like new) and they sent an email making sure we received the replacement ok.\rSo... Not the best or worst experience, but at the end you guys were fair and helpful. The customer service was great! Thank you Players Choice Videogames."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wanda Carli",
          "Nb_Reviews": 1,
          "Date": "2012-12-11T00:50:11.000Z",
          "Titre": "Quick response to order",
          "Contenu": "I received a quick response to my order. I was pleased with the quick turnaround on my order. My only issue is that it was not mentioned if the gaming system I was purchasing was used. When I received my order the system was not in it's original box.  In fact it was not in a box at all except ,of course the box it was shipped in."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jake A",
          "Nb_Reviews": 1,
          "Date": "2020-04-12T22:48:22.000Z",
          "Titre": "Great Site 8.5/10",
          "Contenu": "They have a great selection of games at a great price as well as replacement game cases, which I haven't found at a good price elsewhere. Also, their site is very well organized and has a good aesthetic. It's a great site and I plan to buy from their site more."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Price",
          "Nb_Reviews": 2,
          "Date": "2017-02-20T17:04:38.000Z",
          "Titre": "Skeptical at first",
          "Contenu": "I was looking everywhere for THPS3 for Xbox original and couldn't find it. A simple google search sent me here and it was only a few dollars. Fast shipping and the disc was in great shape! If your playing on a Xbox 360 you may have to change your video settings to 480p. Will be ordering more games soon!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joel",
          "Nb_Reviews": 1,
          "Date": "2019-05-14T00:55:30.000Z",
          "Titre": "A good deal",
          "Contenu": "I bought some universal game cases for my SNES games. At first I was unable to see if they shipped and were on their way, but they got here in due time. They were very responsive to customer service questions when I was curious about my order. I'm a big fan of not having to buy these cases in the bulk stock of 100, that's a lot! The cases arrived in okay shape - a small chip off the corner on one - but nothing that is glaring or would get in the way of them serving their aesthetic purpose for me. I'll probably buy more in the future."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dave Mink",
          "Nb_Reviews": 1,
          "Date": "2016-10-12T12:26:09.000Z",
          "Titre": "Good Selection - Decent Prices",
          "Contenu": "The gaming community has blown up in recent years. With big budget games coming out every month and the boom of retro gaming, finding a decent place to buy your games can be hard to find. These guys have decent prices and a great selection. Always worth trying someone out once to see if you like em"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JH",
          "Nb_Reviews": 1,
          "Date": "2016-09-21T20:19:37.000Z",
          "Titre": "1 x PS4 Jewelcase",
          "Contenu": "I bought a single PS4 jewel case after losing one in a move. I appreciated the option to only buy one, as opposed to most other sites that required bulk purchases. Everything seemed to ship and arrive in a fairly quick manner and if I ever need something like this again, I would go straight to PCV."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "whataslacker",
          "Nb_Reviews": 6,
          "Date": "2017-06-30T13:14:35.000Z",
          "Titre": "Nice replacement controller",
          "Contenu": "This is a very nice replacement for the original controllers for the SNES system. Great for getting back into retro gaming and not having to worry about all that button mashing on older controllers (or worrying about where your old controllers are). Feels like the original. No sticky buttons."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "LP",
          "Nb_Reviews": 1,
          "Date": "2019-05-06T19:03:06.000Z",
          "Titre": "Just be prepared to wait a few weeks",
          "Contenu": "Took a while for the game to ship to my location. But the wait was worth it. Game came in pristine condition! Would highly recommend Players Choice Videogames again. Just be prepared to wait a few weeks, or even a month, before you can expect your item to arrive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Josh Lavoie",
          "Nb_Reviews": 1,
          "Date": "2014-04-26T01:33:33.000Z",
          "Titre": "Best bang for your buck for trade-in value.",
          "Contenu": "This site is the best way to get trade in value for your used games. They will accept almost any game as opposed to other sites. The only negative is the processing time (around 2 to 3 weeks). If you are willing to wait it out, this is a great place to buy and sell your used games!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jermaine Connelly",
          "Nb_Reviews": 1,
          "Date": "2017-02-08T19:23:54.000Z",
          "Titre": "Problems at 1st but they were resolved",
          "Contenu": "I purchased a PS2 from these guys only for it to fail 2 days later after playing it only once. Reached out to them about it and they sent a replacement power adapter but it did not work either showing that the PS2 console was the problem. They did send the adapter free of charge and responded to my emails in a timely manner.Once I told them that the console was the problem, they sent me another console free of charge and it has been working correctly since I received it. It took some time but in the end I did get what I paid for. Appreciate these guys resolving the issue like they did."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sue Westvig",
          "Nb_Reviews": 1,
          "Date": "2019-06-01T17:17:48.000Z",
          "Titre": "We purchased a Wii game at Christmas…",
          "Contenu": "We purchased a Wii game at Christmas and could not get it working.  Once David was aware of the issue he was quick to make it right and sent us a new game.  My boys are much happier now that they are able to play their video game.  Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tim",
          "Nb_Reviews": 1,
          "Date": "2012-01-24T02:44:39.000Z",
          "Titre": "Tim US",
          "Contenu": "i was dieing to find wrgames defcon one for a great price but every where i went i could not find it for a resonable price. then i stubled along this place and it was cheap so i ordered it and it is awsome this website truly is a good one to shop for old video games"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ricky Williams",
          "Nb_Reviews": 1,
          "Date": "2012-07-16T20:57:06.000Z",
          "Titre": "Good selection, bad shipment",
          "Contenu": "I was pleased with selection and convenience, but definitely not satisfied with the wait. It took you guys two weeks to process and ship my order, when it should have been two days to process and ship. Customers want their purchase(s) immediately so please improve!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tiago Almeida",
          "Nb_Reviews": 1,
          "Date": "2020-01-09T17:48:37.000Z",
          "Titre": "Easy to use. got what I was looking for.",
          "Contenu": "I had no problems finding what I wanted. I recieved it very quickly and I was satisfied with my order. Only problem, I bought it as a guest and couldn't track my order. Will buy from here again when looking for older games."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Slick Wattz",
          "Nb_Reviews": 1,
          "Date": "2020-03-09T19:24:25.000Z",
          "Titre": "Would have been 5 stars but game was…",
          "Contenu": "Would have been 5 stars but game was really scratched. Did come really fast. And when I didn’t get a tracking number I emailed them and they got back my really fast too overall will probably be ordering from this place again"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christopher Krug",
          "Nb_Reviews": 9,
          "Date": "2017-02-23T11:08:43.000Z",
          "Titre": "Easy Maneuveralility.",
          "Contenu": "Pros...Finding Items is easy and website layout is pretty cool as well. Cons..only 1 i saw,and that is site does not specify if a item is new or used..there is nothing worse than purchasing an item you think is new and finding out it is used."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2020-04-16T18:31:43.000Z",
          "Titre": "Pretty good website!",
          "Contenu": "Website is organized, but everything is a stock photo. Hard to tell condition and hard to tell if new/used. Layout of website is fine though. Can't speak on how ordering is, just writing this review for a free coupon."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anita Hutcheson",
          "Nb_Reviews": 2,
          "Date": "2014-05-30T18:09:52.000Z",
          "Titre": "Better than Ebay!",
          "Contenu": "Very fair prices. In fact, the prices are exactly the same as they were the last time I bought cartridges- back in 1986! My dad found them on clearance at Toy-R-Us for $1.00-$2.00 back then. We got our unit second hand when they were being phased out, so cartridges were cheap but choices were limited. I'm also glad that I could find a replacement adapter- couldn't find one anywhere else. My only critique- please post a way to show shipping times before checkout. I don't want to purchase if I don't know if it will be 3 days or 15. I have to plan my shipments based on when I will be out of town. Thanks!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kittah",
          "Nb_Reviews": 1,
          "Date": "2020-12-18T00:36:54.000Z",
          "Titre": "Seems to be reasonably priced",
          "Contenu": "Seems to be reasonably priced. The game I'm aiming for is cheaper compare to what i would see in my nearby retro game store so I find this would be a reliable site to search around for certain games"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rhonda Smith",
          "Nb_Reviews": 2,
          "Date": "2019-05-06T17:30:37.000Z",
          "Titre": "This is a great company",
          "Contenu": "This is a great company. But I ordered 6 games, they only sent out one, and gave me a tracking number for that one game. When they shipped the others I did not get a tracking number. Other than that, they are great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shannon",
          "Nb_Reviews": 1,
          "Date": "2019-05-08T01:14:23.000Z",
          "Titre": "The game system was a little scratched…",
          "Contenu": "The game system was a little scratched and dusty but to be expected from an older system that was preowned. It’s functional and the games had no scratches or imperfections that I can see so pretty good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Trevor",
          "Nb_Reviews": 1,
          "Date": "2016-09-16T14:20:11.457Z",
          "Titre": "Customer service was great with room for improvement.",
          "Contenu": "I had a great experience the only problem i had was when i tried to call about my order I was never able to contact anyone via the Phone number available, but once i emailed david i got a reply back immediately."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dar Morton",
          "Nb_Reviews": 1,
          "Date": "2011-12-13T02:42:01.000Z",
          "Titre": "New Game Cube Games!  That is great!",
          "Contenu": "Game Cube games are not easy to find that are new.  My son found this site and is excited that one will be bought that is not used.  You never can tell what you get when you buy a used one, and yes I will order it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anthony Gillis",
          "Nb_Reviews": 1,
          "Date": "2013-04-19T08:01:11.000Z",
          "Titre": "I am happily surprised!",
          "Contenu": "I did my first order of video games about 2 months ago and i keep coming back! First thing that surprised me is that for many of their Sega Genesis games i ordered from them, it came CIB with no mention of it on the website. Out of 5 games, 3 came with the case and instructions. Also their prices are good for a lot of games. Sure games like Zelda 3 or Super Metroid are not going to be any cheaper than anywhere else but they have a good selection of cheap games under 5$ for the NES and Genesis.\r Other good things about them:\r - All games come shrink wrapped for better protection in the shipping process.\r- They also have a redeem system with points earned with every purchase.\r- Shipping to Canada is fair."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Blake Walker",
          "Nb_Reviews": 1,
          "Date": "2017-12-28T23:18:47.000Z",
          "Titre": "They have been good so far with game selection.",
          "Contenu": "They have been good so far with selection, my one qualm is that they can be a little pricey on certain items, more pricey than places such as gamestop, but really cheap with others. I would recommend."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jack Lannister",
          "Nb_Reviews": 1,
          "Date": "2019-05-06T17:30:30.000Z",
          "Titre": "Better than expected",
          "Contenu": "Although I need to ask when my purchased item would arrive it was rather surprising the quality of it. The tracking fetcher didn’t work but nonetheless arrived promptly and with out incident"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Roamy Camilo",
          "Nb_Reviews": 1,
          "Date": "2019-12-12T15:32:07.000Z",
          "Titre": "I was skeptical about when my package…",
          "Contenu": "I was skeptical about when my package would arrive. It never gave me a time frame of when to expect for it to come. While it was quick to get to my home, I never knew WHEN it would come."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JC",
          "Nb_Reviews": 1,
          "Date": "2016-01-29T05:30:16.562Z",
          "Titre": "Great Selection!",
          "Contenu": "I am surprised at the massive selection of games they have. Just about every classic game/system you want they have. The price is reasonable also. I will definitely be buying games here from now on."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James K",
          "Nb_Reviews": 1,
          "Date": "2021-02-23T00:24:24.000Z",
          "Titre": "Good place to order games",
          "Contenu": "Good place to order games. Massive collection. Just wish they had a way of confirming they even got your order or if it has shipped. Though shipping didn’t take long at all"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hector",
          "Nb_Reviews": 1,
          "Date": "2016-09-07T19:59:48.387Z",
          "Titre": "good guys",
          "Contenu": "Great customer service but the post office messed up on my water therefore I never received it but as far as receiving a refund I got that ASAP and the team over there is extremely professional."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lil' Judd",
          "Nb_Reviews": 1,
          "Date": "2020-04-21T21:13:01.000Z",
          "Titre": "Write the title of your review here. (JK)",
          "Contenu": "Sounds promising based on the reviews, but I ordered an item and left an email but have not heard back and have not gotten any information on the condition and status of my order."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joshua Long",
          "Nb_Reviews": 1,
          "Date": "2012-03-25T18:57:32.000Z",
          "Titre": "Wow!",
          "Contenu": "I have been searching for years for a company that supplies classic NES products and this is the only place I have found. Next time I am searching for any classic game or console I know where to go."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2012-03-13T02:32:00.000Z",
          "Titre": "Good",
          "Contenu": "I thought the shipping and processing was a little to slow. I ordered them on a Friday so i knew they wouldn't  be processed over the weekend but i thought i would get them the week after. It took 10 day before they arrived. I had ordered a laptop the following Monday from another company and had it in 4 days and the laptop had arrived before the games. But besides the shipping and processing i am extremely satisfied with the games i purchased. The are in excellent condition. They are like brand new games write out of the box. I got them at a much better prices then any other site i looked for them on. I would have no problem buying from here again or recommending them to other people if they would speed up there shipping and processing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "kleb1",
          "Nb_Reviews": 1,
          "Date": "2014-01-09T23:36:23.000Z",
          "Titre": "Great place for adding to your collection.",
          "Contenu": "I'm new to this site but I will be a return customer. I collect old and rare consoles and this place has a great selection. I also like all the historic articles on gaming. Just a great site."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Deion Burk",
          "Nb_Reviews": 3,
          "Date": "2019-11-10T18:50:35.000Z",
          "Titre": "Unique Service",
          "Contenu": "Great! However most of these products are used. Not wore out used, but used. The shipping was a bit wonky. I got some items shipped at different times. They all came netherless."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve Young",
          "Nb_Reviews": 1,
          "Date": "2018-04-07T05:43:54.000Z",
          "Titre": "Great price for item, just wish there was more communication.",
          "Contenu": "Item was delivered at a very competitive price, though I do wish they were a bit snappier with their communication.  Overall I recommend checking them out if you're a collector."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kyle Grewing",
          "Nb_Reviews": 1,
          "Date": "2019-05-21T04:14:35.000Z",
          "Titre": "Resolved my issue",
          "Contenu": "Good selection of older games, first game was scratched and I could only play halfway through the game. Players choice sent out another copy of the game to make things right."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Kilmer",
          "Nb_Reviews": 1,
          "Date": "2018-04-29T02:19:26.000Z",
          "Titre": "Great selection, better prices",
          "Contenu": "Great selection with some of the best prices I have seen on the internet. Shipping speed is a bit slow, but worth it considering the massive price cuts on hard to find titles"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JB",
          "Nb_Reviews": 1,
          "Date": "2020-03-26T03:07:09.000Z",
          "Titre": "Great customer service response time",
          "Contenu": "Great customer service response time! My Wii game came in with a disk error but customer service has been good and responsible in dealing with the issue. Great site!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kyle Noel",
          "Nb_Reviews": 1,
          "Date": "2014-04-23T03:08:39.000Z",
          "Titre": "Very fair and honest company!!",
          "Contenu": "I found them to be very fair in their prices of both credit and cash. They also have a large selection of old and new games and consoles. all is very simple to search as well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Etienne  Wright",
          "Nb_Reviews": 1,
          "Date": "2019-05-07T14:06:49.000Z",
          "Titre": "Gave me no updates on my order",
          "Contenu": "Gave me no updates on my order . Had to email the seller . Transaction number could not used to track order details on the website . Game boy advance is perfection ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shane Langdon",
          "Nb_Reviews": 1,
          "Date": "2013-03-26T03:53:35.000Z",
          "Titre": "Great selection at a fair value!",
          "Contenu": "I am excited and frankly impressed by this sites,selection,prices, and reputation. Will be ordering from them again. Amazing selection...maybe one of the best on the internet."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lowell",
          "Nb_Reviews": 1,
          "Date": "2020-04-21T17:28:56.000Z",
          "Titre": "Very good first shopping experience",
          "Contenu": "The online shopping experience was very seamless. It was easy to find the games I was looking for and, surprisingly, at affordable prices. My only negative experience was the delay in having the items shipped and needing to e-mail the company to ask why the items hadn’t been shipped yet (it had already been 5 days since date of purchase and the items were still not shipped). The response to my query was immediate and in a few days, I did receive the games. The games were in great condition. The items did have to be shipped in two separate parcels, which were a few days apart. Not quite sure the reasoning for this, but they do have USPS trackers on them, so I’m confident the second package will arrive with no setbacks. David with the sales team has been responsive and easy to communicate with. I definitely plan on getting more games, especially while the world is in quarantine!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 1,
          "Date": "2020-04-13T08:12:49.000Z",
          "Titre": "Great prices and very good selection",
          "Contenu": "Great prices and very good selection. Some consoles are a little over priced however nothing extreme. The website design could certainly use an update however."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2013-01-18T02:19:29.000Z",
          "Titre": "Will shop with again",
          "Contenu": "Even though it took far more days than indicated on the website to even ship, once it did it arrived fast and safe, and in a nice cartridge container. Would shop with again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sean Kush",
          "Nb_Reviews": 1,
          "Date": "2016-11-04T19:02:04.653Z",
          "Titre": "Glad there are good videogames for sale still.",
          "Contenu": "I used to play original xbox with my siblings when i was younger and thanks to players choice videogames i finally have our favorite game to play when we get together:)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Peggy Pearson",
          "Nb_Reviews": 3,
          "Date": "2019-08-11T18:52:41.000Z",
          "Titre": "I have been looking for a DSI XL for my…",
          "Contenu": "I have been looking for a DSI XL for my son. I am on a fixed income. I found one I can afford. It was a customers  friendly  website. I am impressed. Thankmyou."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "William Daniels",
          "Nb_Reviews": 2,
          "Date": "2020-05-14T01:51:09.000Z",
          "Titre": "Ordered a controller here last week.",
          "Contenu": "Ordered a controller here last week.. And it arrive a little late than expected. The customer service was very helpful. Got the order and its working fine."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "dm022665",
          "Nb_Reviews": 5,
          "Date": "2013-05-31T08:51:30.000Z",
          "Titre": "My Experience",
          "Contenu": "Today I received my purchase. In all, it took 8 business days for my order to be received. I contacted Playerschoicevideogames.com because my order seemed to be stalemate, showing in processing although the payment was completed. I called and left a message on voice mail, but because my purchase was an intended gift, I also emailed my inquiry along with the explanation that it was a birthday gift to my grandson. I was advised it was on the way and would arrive in 3-5 days. The next business day I received a tracking number as well. I have to say that it was received in time and within the 5 business days as advised in the email response. Quite different from the postings I have read on here. I believe that this company is working on better service, and I am thankful that they were able to provide my game to give to my grandson in time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nik Albert",
          "Nb_Reviews": 1,
          "Date": "2016-10-27T19:23:06.000Z",
          "Titre": "Well done transaction",
          "Contenu": "The transaction was good. I docked a star because the Xbox game's case I received did snap shut like it was supposed to. I don't know who's fault it is."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eli Flores",
          "Nb_Reviews": 1,
          "Date": "2017-02-27T17:52:56.677Z",
          "Titre": "Good but not great online game shop",
          "Contenu": "The menus are a bit cumbersome. To have to scroll though multiple pages to find a game in a sea of games that are unavailable doesn't make for the best search."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jakob Faust",
          "Nb_Reviews": 1,
          "Date": "2015-07-24T22:18:40.498Z",
          "Titre": "A great company for vintage consoles.",
          "Contenu": "+The site has plenty of vintage consoles\r+It appears you can trade in your consoles\r+Consoles bought are of great quality\r -Website layout is mildly inconvenient"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Roger Lindenbach",
          "Nb_Reviews": 1,
          "Date": "2016-02-27T05:24:30.788Z",
          "Titre": "For Their Prices Why Not",
          "Contenu": "I'm impressed with the prices of the games they have in stock. Better price wise than lukie games or jj games. This may become my new favorite online game shop!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 1,
          "Date": "2019-09-11T23:42:03.000Z",
          "Titre": "A Great Place to spend money on a game collection",
          "Contenu": "Reliable with good prices and a damn good way to collect video games and gaming related items, especially considering the large variety of available items."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2012-03-28T23:16:54.000Z",
          "Titre": "Great selection and prices but...",
          "Contenu": "Great selection and prices on everything, but it took almost a week for them to process my order for a somewhat old game. I expect really old games would take longer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jon Davis",
          "Nb_Reviews": 1,
          "Date": "2020-04-19T01:02:25.000Z",
          "Titre": "It’s okay it’s fast shipping",
          "Contenu": "It’s okay it’s fast shipping but their was no HDMI But it give me two controllers but has some scuffs on it but not worried about that I like it’s:)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jessica Fleser",
          "Nb_Reviews": 1,
          "Date": "2019-05-11T03:32:23.000Z",
          "Titre": "Greatful customer",
          "Contenu": "My second game came much latter then expected but all in all im happy with it i received emails asking if i received it i am glad they were on top of it"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "C, Bryan Ethredge",
          "Nb_Reviews": 1,
          "Date": "2019-03-02T23:49:28.000Z",
          "Titre": "Looking for hard to find  games and…",
          "Contenu": "Looking for hard to find  games and consoles, This is the place to look prices  are good, and I easy able to find games I could  not find in stores."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "K Mac",
          "Nb_Reviews": 1,
          "Date": "2020-12-21T17:52:50.000Z",
          "Titre": "I have never seen such low prices on…",
          "Contenu": "I have never seen such low prices on used games. Guess I'll hold onto my old 360 a bit longer now that I found titles as low as $1.99"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jessica Johnson",
          "Nb_Reviews": 2,
          "Date": "2016-10-13T10:25:22.000Z",
          "Titre": "Great game, customer service could be better.",
          "Contenu": "I loves the game and they sent it quickly, but I reached out to them multiple times and couldn't get an answer. The game came in perfect condition."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Killian",
          "Nb_Reviews": 1,
          "Date": "2016-09-16T12:53:13.314Z",
          "Titre": "Halo 2",
          "Contenu": "The buying process went smoothly. Only complaint is the game is a little scratched so the game looks like it has a grey screen over it at some points."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Presley",
          "Nb_Reviews": 1,
          "Date": "2020-12-16T16:44:43.000Z",
          "Titre": "They have great stock but the…",
          "Contenu": "They have great stock but the description could be more specific on some products. Overall a good choice if you enjoy quality gaming."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amanda",
          "Nb_Reviews": 1,
          "Date": "2012-02-03T05:48:36.000Z",
          "Titre": "SO FAR SO GREAT!",
          "Contenu": "So far I've had a great experience finding what I've needed and wanted. I definitely recommend it...way better then any other online shop."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "brandon",
          "Nb_Reviews": 1,
          "Date": "2021-01-03T02:48:11.000Z",
          "Titre": "Good website for classic games",
          "Contenu": "Good website for classic games. Prices are very fair compared to other websites. And there is an incredible selection of games."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "'Aaron Hagel",
          "Nb_Reviews": 1,
          "Date": "2013-03-23T01:14:13.000Z",
          "Titre": "got what I ordered within a week's time",
          "Contenu": "This company is good, has a lot of the games that I am looking for.  I will be ordering from them again when I want to add to my collection."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Missy Feaster",
          "Nb_Reviews": 2,
          "Date": "2019-03-07T18:40:43.000Z",
          "Titre": "Easy and inexpensive way to get new and…",
          "Contenu": "Easy and inexpensive way to get new and old video games. Didn’t give 5 stars because a lot of the games I wanted were out of stock."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Edward Alves",
          "Nb_Reviews": 1,
          "Date": "2019-06-01T10:02:09.000Z",
          "Titre": "great site",
          "Contenu": "great site, easy navigation and they had the game i couldn't find anywhere for only 4.99. waiting to receive as we speak."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Connor",
          "Nb_Reviews": 1,
          "Date": "2019-08-30T19:09:55.000Z",
          "Titre": "A good website with just about any game…",
          "Contenu": "A good website with just about any game you can think of. It has fair prices on classic games and an overall nice experience"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Morgan",
          "Nb_Reviews": 1,
          "Date": "2014-07-17T06:00:59.000Z",
          "Titre": "Great website",
          "Contenu": "Great website got game and 10% off coupon. SHipping was a bit slow but i think that was probably the post office being busy mainly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jack",
          "Nb_Reviews": 1,
          "Date": "2017-03-23T11:34:03.000Z",
          "Titre": "Eventually I got the game.",
          "Contenu": "It took a few days longer than expected. However, the game still got here, and at a decent price. I will buy again from here."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Curtis R.",
          "Nb_Reviews": 1,
          "Date": "2019-05-06T17:21:05.000Z",
          "Titre": "Good prices (a happy median between…",
          "Contenu": "Good prices (a happy median between collector and retail pricing), quick shipping, very responsive to e-mail queries."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "A. Almaguer",
          "Nb_Reviews": 1,
          "Date": "2014-02-17T07:18:36.000Z",
          "Titre": "Great games, awesome prices!",
          "Contenu": "Purchased a ton of SNES games from Playerschoicevideogames.com during the holidays.  Their prices averaged to about 7 bucks a game, after tax.  Local  dealers wanted at least 12-20 bucks for these titles.  Will definitely buy from this place again.  My only issue with the web site is that it lists games that are not currently in stock.  They should not show up when doing searches for games.\r Response to AnGiroux Cressman' comment:\rHere is an example of my issue. I want to purchase some SNES games \"today\".  When I do a search for all SNES games, I get around 24 pages of games to look thru.  While I am reviewing these games, I notice that 7-8 pages are filled with games that are currently not available.  I would like to view only games that are in stock.  This option is currently not available.  I am not interested in the price of a game that is not in stock because it may change once it becomes available again.  If I am going to trade-in an item, I know exactly what it is and will search for that one item, rather than looking thru a long list."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eliza. A",
          "Nb_Reviews": 21,
          "Date": "2019-08-13T16:20:59.000Z",
          "Titre": "Good website & it is legit.",
          "Contenu": "I have been wanting to buy from this website for a while ever since I first discovered it. I wanted to get me a gamecube, games for the gamecube & playstation 1 games too. I got my console,my games in good condition well the paper mario tends to glitch sometimes but turns out some of them are like that. Then, I got a av cable, 32 mb memory card for the gamecube. Now, everything showed up, everything works good minus the controller that the gamecube came w/ but I don't like that I don't get my tracking number until I've contacted them that's the only issue I have. They were nice & sent me the info that I needed,but, other than that everything came, I got what I have purchased, games work & look good too. I'm so happy I got them & the website is actually legit, you get what you picked & payed for. It seem scary & a bit doubty but trust me it is what the website says it is, the customer service is great plus this website has more options in games & consoles in my opinion. If I had to rate it I'd be 4.5 stars out of 5 thank you guys so much for my orders."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Noah Holbert",
          "Nb_Reviews": 1,
          "Date": "2020-10-15T18:40:50.000Z",
          "Titre": "Great product good reliability. Need faster shipping",
          "Contenu": "Great product good reliability! Wish the shipper was faster getting the product out the door after purchasing"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cristobal Navarro",
          "Nb_Reviews": 3,
          "Date": "2017-03-22T16:20:09.013Z",
          "Titre": "Amazing",
          "Contenu": "It's great to be able to relive childhood memories as well as play games I've never been able to play before."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christian",
          "Nb_Reviews": 2,
          "Date": "2017-01-01T06:29:24.483Z",
          "Titre": "Great website with decent prices.",
          "Contenu": "Players choice offers a huge selections of products at a reasonable price, i will recommend to other gamers I know."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ryan Abram",
          "Nb_Reviews": 1,
          "Date": "2021-03-29T20:26:11.000Z",
          "Titre": "I don’t have the {REDACTED} product.",
          "Contenu": "Customer service was sassy (which I kinda respected) but I eventually got my product so here’s your 4."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Desi Ayers",
          "Nb_Reviews": 1,
          "Date": "2024-01-03T02:05:33.000Z",
          "Titre": "These guys are the go to guys for great…",
          "Contenu": "These guys are the go to guys for great service, quality products and fast delivery! Price is unbeatable too!! Cheers I'll be ordering from you forever!!! - Desi"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "anthony gilmore",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T20:08:15.000Z",
          "Titre": "Great customer service!!",
          "Contenu": "Everything about this company is exceptional and they go above and beyond to meet the customer's needs. Wide range of nostalgic and retro games and system's, competitive prices, fast delivery, and most important to me was the prompt and friendly customer service by David. I absolutely recommend them to any gamer 100% !!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tiffany “Tuffy” Harper",
          "Nb_Reviews": 4,
          "Date": "2023-12-15T21:30:31.000Z",
          "Titre": "I got the SNES console okay",
          "Contenu": "I got the SNES console okay, even though I ended up receiving a replacement AC adapter after the old one was broken for free."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tubalupacuss",
          "Nb_Reviews": 1,
          "Date": "2023-12-29T03:10:29.000Z",
          "Titre": "Great transaction",
          "Contenu": "Good price, fast shipping,  product as described.  I'll be back to shop here again,  keep up the good work!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joel",
          "Nb_Reviews": 3,
          "Date": "2023-11-21T21:55:53.000Z",
          "Titre": "Good experiences buying and selling",
          "Contenu": "Trading-in and buying games have both been very seamless. Quick response times on each service, and the games I bought were in very good condition. Vast majority were complete, as well. Definitely recommend this site for either buying or selling. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew Carpenter",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T18:08:06.000Z",
          "Titre": "Customer service isn't dead!!!",
          "Contenu": "Everything about this company is awesome.  Product knowledge, competitive prices,fast delivery,and most important to me was prompt and friendly customer service. I absolutely recommend them!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Wilson",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T23:33:00.000Z",
          "Titre": "Always Greatest",
          "Contenu": "My order was shipped and delivered on time! Awesome selection of games at reasonable prices!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Aguilar",
          "Nb_Reviews": 1,
          "Date": "2023-12-25T13:26:21.000Z",
          "Titre": "Very professional need not to worry…",
          "Contenu": "Very professional need not to worry about a thing"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Macy Paul",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T14:31:49.000Z",
          "Titre": "Not a scam",
          "Contenu": "This is a legit business & I received the game I ordered in a decent amount of time. I had a concern & was responded to right away. Thanks for being an awesome small business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jacob Reynolds",
          "Nb_Reviews": 1,
          "Date": "2024-01-03T21:01:30.000Z",
          "Titre": "Easy and fast shipping very please"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arian Torres",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T20:18:20.000Z",
          "Titre": "This store has just about everything…",
          "Contenu": "This store has just about everything when it comes to gaming and at a very affordable price and gets delivered in less than a week recommend this store 100% especially for those who love retro games."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ngr",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T23:22:46.000Z",
          "Titre": "Quick and easy delivery",
          "Contenu": "Quick and easy delivery, some items even arrived early."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MercrulioBronco j",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T18:55:05.000Z",
          "Titre": "This place Always comes in clutch",
          "Contenu": "This place Always comes in clutch. By having the right game at an astonishing price. I'll always look at them first for my gaming needs. Would recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aiden Rubchinuk",
          "Nb_Reviews": 1,
          "Date": "2023-12-28T23:14:48.000Z",
          "Titre": "Amazing game in perfect quality!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Khafra Powell",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T23:12:36.000Z",
          "Titre": "☆☆☆☆☆",
          "Contenu": "Game came before estimated date. Thank u!"
        },
        {
          "Note": 5,
          "Lieu": "PR",
          "Pseudo": "Alba Aparicio",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T22:22:26.000Z",
          "Titre": "Perfect product",
          "Contenu": "Perfect product. New. Perfect conditions. My girl like it very much. I will continue to be your client."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nai",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T00:37:10.000Z",
          "Titre": "My games came in a timely manner and it…",
          "Contenu": "My games came in a timely manner and it was in the box warped very pretty I will definitely order  again ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tiffany",
          "Nb_Reviews": 2,
          "Date": "2023-12-24T02:26:32.000Z",
          "Titre": "My trade in experience was great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maria Miranda",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T19:07:42.000Z",
          "Titre": "Amazing",
          "Contenu": "Amazing. Received my portal within four days. Great customer service also."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "duwqp",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T05:00:50.000Z",
          "Titre": "NBA 2K17 (Order)",
          "Contenu": "Hi, I recently ordered your last NBA 2K17 and im having no issues i just want a update. Transaction ID:\t80131061708"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric Marks",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T21:52:58.000Z",
          "Titre": "Easy and Supportive",
          "Contenu": "David was very professional.  The first product that arrived wasn't the right item, so I returned it and he sent the correct item right away.  It was an item that's not easy to find nowadays.  I'm endlessly appreciative!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher Ratliff",
          "Nb_Reviews": 3,
          "Date": "2022-10-18T09:01:15.000Z",
          "Titre": "I'm very satisfied with my first ever…",
          "Contenu": "I'm very satisfied with my first ever purchase with Player's Choice Video Games! My X Box Game Console came in perfect condition, thanks, Dave for emailing me earlier about when my item be shipped out soon!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paulette Smith-Cox",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T17:59:52.000Z",
          "Titre": "Awesome Experience….",
          "Contenu": "Awesome Experience….How prompt they were to answer their emails and when I had an issue with my PS2 they quickly resolved it without any issues. I can honestly say they stand by their products and I HIGHLY RECOMMEND BUYING FROM THEM. I have told my friends and family about them and we will be ordering from them again. Thank you Player’s Choice"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay",
          "Nb_Reviews": 1,
          "Date": "2023-02-17T17:29:40.000Z",
          "Titre": "Great Customer Service and Experience!",
          "Contenu": "When I received two games I had ordered, I noticed one of them had accidentally been sent wrong. I contacted them, and they responded very quickly, and immediately sent the correct game by priority mail; it came super fast! Upon receiving, they then told me to keep the other game, completely free of charge because of the hassle. I have always had such a great experience with this site, and will definitely continue to buy from them!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barb",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T17:41:11.000Z",
          "Titre": "The transaction went well",
          "Contenu": "The transaction went well. The game was delivered as expected, no delays. The game was in great condition, plays well, no issues. I would order from this company again, highly recommend!!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "clifford graham",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T19:09:14.000Z",
          "Titre": "Honest,reliable & fast",
          "Contenu": "Honest,reliable & fast, not to mention the great prices. I couldn't find games at Walmart. Com nor Amazon that'll beat Players Choice."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sara Walsh",
          "Nb_Reviews": 3,
          "Date": "2022-01-23T16:25:13.000Z",
          "Titre": "So helpful",
          "Contenu": "They were beyond helpful in getting my son his Zelda game. when we had an issue with the original they went above and beyond to correct it and ensure my son was able to complete his collection. Not only were they pleasant and easy to deal with but incredibly kind and thorough. Cannot recommend them enough!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tiffany “Tuffy” Harper",
          "Nb_Reviews": 4,
          "Date": "2023-12-07T21:41:34.000Z",
          "Titre": "The universal case came and looked as…",
          "Contenu": "The universal case came and looked as if it was the original!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mycipher",
          "Nb_Reviews": 1,
          "Date": "2022-06-20T17:17:39.000Z",
          "Titre": "I was skeptical because their prices…",
          "Contenu": "I was skeptical because their prices are lower than average. But I got my games within 10 days and are legit GBA cartridges. Customer service response was fast too when I thought I was missing a game. It just shipped separately for some reason."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cynthia Sweigart",
          "Nb_Reviews": 1,
          "Date": "2022-11-25T21:11:41.000Z",
          "Titre": "The website is easy to navigate",
          "Contenu": "The website is easy to navigate. The game condition was exactly as described. The prices are very reasonable. Will tell anyone who asks me about the best websites, to choose Players Choice. Keep up the good work.. Cynthia Sweigart"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Johnny Ray",
          "Nb_Reviews": 1,
          "Date": "2021-10-06T15:04:31.000Z",
          "Titre": "Fast Order and Quick Results",
          "Contenu": "I ordered several Atari and Sega games, they were delivered in a timely fashion and in good condition. Some titles were unavailable so there was a refund for them in the box. I didn't get my Order Number initially but I got a quick response when I sent in an email. Always one of my go-to Retro game stores for fair prices and quick turnaround!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cora",
          "Nb_Reviews": 1,
          "Date": "2022-01-26T02:26:13.000Z",
          "Titre": "Ships fast, quality games!",
          "Contenu": "I ordered two old PS2 games for my brother. They were the perfect gift, but I honestly didn't expect them to arrive before Christmas since I only ordered them a week before - they wound up arriving just in time, though! I was super impressed with the shipping speed and the quality of the games, too. Definitely a legit site, and has some cool finds :)"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Tracy Duerr",
          "Nb_Reviews": 1,
          "Date": "2021-11-30T16:25:22.000Z",
          "Titre": "Players Choice Video Games: an Excellent Company",
          "Contenu": "Awesome products and wonderful service!  Will buy from this great company again!!  My package was processed and delivered on time!  Customer service replied when they said they would… I recommend Players Choice to everyone looking for game consoles and games. A great choice to go for birthday and holiday presents!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Garrett Guy",
          "Nb_Reviews": 1,
          "Date": "2022-04-05T13:47:42.000Z",
          "Titre": "Quick and fast refund",
          "Contenu": "I’ve made two orders in this website now and recently almost made a third. I had to cancel however because I didn’t realize I had two of the same product in my cart. After about 20 min sending an email to customer support about canceling, they responded and gave me a full refund. You can trust this website along with the people."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim Liedl",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T16:45:11.000Z",
          "Titre": "Great reseller!",
          "Contenu": "Shopping was easy, and the selection was decent based on the used games market. I was really impressed with the shipping and packaging, I had to double check that I bough a used game beforeI opened the packaging. Very professional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin McCann",
          "Nb_Reviews": 8,
          "Date": "2022-05-30T17:45:54.000Z",
          "Titre": "Thanks so much!!!",
          "Contenu": "Ordered a Wii for our special-needs daughter who is familiar only with this gaming platform, and Players Choice came thru in timely manner and just as ordered and promised. Really well done and most deeply appreciated!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gavin B",
          "Nb_Reviews": 1,
          "Date": "2022-02-11T20:38:55.000Z",
          "Titre": "Excellent Service",
          "Contenu": "I was not expecting game cases, let alone cases in mint condition. One of them even had a manual! the discs were in excellent condition. When it comes to buying the games i used to play as a kid, I recommend shopping at Players Choice over anything else."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Coonley",
          "Nb_Reviews": 1,
          "Date": "2022-03-30T17:23:20.000Z",
          "Titre": "My experience with Player's Choice was…",
          "Contenu": "My experience with Player's Choice was fantastic. I got exactly what I was looking for, at a price far cheaper than I could find anywhere else. I had an issue with my email confirmation, but customer service was easy to get ahold of, and was able to clear up the issue immediately. Shipping was very quick, and the product came in excellent condition. I would feel very confident in buying from Player's Choice again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cain Haywood",
          "Nb_Reviews": 1,
          "Date": "2022-04-11T22:53:24.000Z",
          "Titre": "Pleased.",
          "Contenu": "Delivery was not near as long as I had originally thought. Also for a simply refurbished game that most places ask more than double the price I paid, it's in fairly good condition compared to others I've seen."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan Stelly",
          "Nb_Reviews": 4,
          "Date": "2022-09-16T20:06:13.000Z",
          "Titre": "Master Chief collector set",
          "Contenu": "Received item in about 6 days, came brand new with plastic wrapping on box. I have to be honest, I was going to get the digital download,  but buying from these guys even with shipping was better deal!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daimyo Shiro",
          "Nb_Reviews": 1,
          "Date": "2021-10-19T21:32:27.000Z",
          "Titre": "Awesome service!",
          "Contenu": "Recently was scrolling through YouTube, and saw this website. Ordered two items, a game and a controller, was worried when I only received one of the two items. Emailed them and got a quick response, reassuring me that I will get both of my orders. The next day, my second item arrived, couldn’t have been happier with the service and the mail time. Well deserved 5 stars!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hayles",
          "Nb_Reviews": 1,
          "Date": "2021-07-03T03:32:45.000Z",
          "Titre": "Great customer service",
          "Contenu": "When I received the game that I ordered it was scratched to death and needless to say I was not impressed. After I contacted customer service to see if we could do anything about my recent purchase they allowed me to return the game and exchange it for a great looking game! Barely a scratch. Perfect resolution, happy customer here"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luh Mark",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T20:11:52.000Z",
          "Titre": "Amazing",
          "Contenu": "I was super happy to play an old game from my childhood. I would very much recommend this for everyone"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessica Jones",
          "Nb_Reviews": 2,
          "Date": "2022-02-10T06:31:58.000Z",
          "Titre": "👍👍👍",
          "Contenu": "I ordered a game system from Player's choice, and had a few issues. They were quick to respond to my questions, and fixed things very quickly. Everything worked out better than I could have hoped. David has been so extremely patient, and helpful. This company definitely has my thumbs up 😃 Thank you Player's choice!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "sleek lunitick",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T21:59:40.000Z",
          "Titre": "The proves was good and good customer…",
          "Contenu": "The proves was good and good customer service also."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "A B",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T02:21:17.000Z",
          "Titre": "Wonderful store!",
          "Contenu": "I've bought from this company for about 2 or 3 years now. They have great prices and we've always got our product. I bought a Dreamcast from them and they were nice enough to through in a few extra games which is something they didn't have to do. Buy from them, they will go above and beyond for you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Our vision X-Zone.Zone-X",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T16:04:17.000Z",
          "Titre": "The first console never made it to me…",
          "Contenu": "The first console never made it to me but boy when y’all sent that second console amazing completely worth it I even got two extra games for the wait lit assassins creed games 💯🔥"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rosemary",
          "Nb_Reviews": 5,
          "Date": "2023-03-09T17:11:07.000Z",
          "Titre": "Amazing customer service",
          "Contenu": "First I just have to say what awesome customer service! I had issues with the tracking link in my order email so I sent them an email asking about my order. I have never had such a quick response from any company! I was sent a working tracking number and was told in the email when my order will be delivered, AND to email them back when I received it. This company truly cares about their customers. I received my GameCube console and games, all in working order!Second, what a selection! The fact that I can still find classic games and consoles, not just the \"newest\" ones. Something that a game store such as GameStop can't even provide. This is my new \"go-to\" for anything gaming related."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Connor Brown",
          "Nb_Reviews": 1,
          "Date": "2021-08-13T15:07:04.000Z",
          "Titre": "My Experience with a new gaming website",
          "Contenu": "I was so excited when I found just dance 2014 for xbox 360 because every other website was too expensive!!! But when I went to players choice they had one left so I knew I had to get it!!!! I love how you can track your order!!! My order came before it was supposed to come and it works great!!!! I am definitely going to tell my friends if you want a website that has all your favorite games for affordable prices go to playerschoice.com!!!! Thank you players choice you are awesome and I will definitely by a lot of things from your site in the future!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patricia",
          "Nb_Reviews": 1,
          "Date": "2021-12-02T02:54:50.000Z",
          "Titre": "Used Game order",
          "Contenu": "I placed an order on November 22 with this company. A couple of days later I emailed customer service with a question about my order. Within twelve hours, I had a reply. The game arrived in like new condition and timely. Will definitely search for more items from them. Very satisfied!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 1,
          "Date": "2022-08-17T21:27:01.000Z",
          "Titre": "This website was found by my grandson…",
          "Contenu": "This website was found by my grandson because he wanted to replace his Call of Duty game.  We bought it used and the ease of ordering and the quickness of receiving it was the best.  I would truly recommend ordering from this website.  They are spot on!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edward Lupella",
          "Nb_Reviews": 1,
          "Date": "2021-10-19T17:30:30.000Z",
          "Titre": "Good Price, Good Service, Good Timing",
          "Contenu": "I got worried because I had no confirmation the game shipped, but then the day it was to arrive I got an update, it showed the tracking info, and it was VERY fast. Game was in very good condition, extremely happy with the product and service (and had a lot of trouble finding the game anywhere else), despite that mild hiccup."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alberto Sauceda",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T14:46:27.000Z",
          "Titre": "Great Customer Service!",
          "Contenu": "Had a few issues but David was able to get everything fixed, games are 100% authentic, some even came sealed, great customer service. 100% recommended"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barbara Smith-Clemmer",
          "Nb_Reviews": 1,
          "Date": "2021-08-30T15:29:13.000Z",
          "Titre": "LOVED",
          "Contenu": "LOVED!  Been replacing some of the legacy games that were destroyed! Super glad i can keep the games going! thank you for your service!! Great customer service - quick response and great selection at a wonder price!! Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "D'Anne Stoddard",
          "Nb_Reviews": 2,
          "Date": "2023-03-20T16:44:26.000Z",
          "Titre": "Unbelievably amazing customer service!",
          "Contenu": "Unbelievably amazing customer service! I reached out concerning my order and got a prompt response each time. The item I ordered arrived safely and in perfect condition. And the cost was perfectly reasonable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luciano Martinez",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T19:50:46.000Z",
          "Titre": "David is very friendly and offers a…",
          "Contenu": "David is very friendly and offers a good price for trades"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Antonio Coleman",
          "Nb_Reviews": 1,
          "Date": "2022-02-19T00:45:03.000Z",
          "Titre": "All the games work and real fast…",
          "Contenu": "All the games work and real fast delivery! Done order with them twice and haven’t been disappointed.. Definitely will be ordering from them again in the future"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "christian vigil",
          "Nb_Reviews": 3,
          "Date": "2022-04-27T18:29:49.000Z",
          "Titre": "Games work but better care would be appreciated.",
          "Contenu": "I got the games I bought pretty quickly. Had only one tracking information for one of my games purchased. Also one of my games was just bouncing inside since it wasn't seated properly or it just popped off. They all do work fine after testing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erika",
          "Nb_Reviews": 4,
          "Date": "2021-10-05T15:19:56.000Z",
          "Titre": "Great customer service",
          "Contenu": "I was able to find a game I had been searching for, and it was delivered in a timely manner. David was very responsive when I emailed a question regarding my order. I would purchase from Players Choice again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Carlson",
          "Nb_Reviews": 1,
          "Date": "2021-07-29T20:02:16.000Z",
          "Titre": "This is absolutely awesome!",
          "Contenu": "This is absolutely awesome!! Definitely two thumbs up. I can’t wait to tell all my friends about it. I honestly haven’t been this excited in a while!!! I highly recommend checking it out for anyone who loves video games!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer Gilbert",
          "Nb_Reviews": 1,
          "Date": "2021-10-19T15:58:23.000Z",
          "Titre": "My son loves ordering from player's…",
          "Contenu": "My son loves ordering from player's choice. The games are very reasonable so he doesn't mind spending a lil bit of his allowance to get what he wants. You Rock!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Will",
          "Nb_Reviews": 2,
          "Date": "2022-08-23T07:43:26.000Z",
          "Titre": "You found the right place to buy from! Excellent all around from their communication to the actual condition of the products they sell! 5/5 stars good job guys! Keep it up!",
          "Contenu": "Great prices for hard to find items. Items are shipped as soon as payment clears. I've ordered video games so far and all of them have flawless discs we're talking no scratches or any other damage. They always play. I think one out of several USED games I've bought had very few and very minor scratches but plays with absolutely no problem. If you are buying something USED it will not be in NEW condition. 5/5 or 10/10 stars for you guys. Your communication is great. Everything I have purchased from you guys have been in excellent condition which is surprising considering the age and previous use they've endured over the years. Buy from them! I've shopped around online and they are very competitive with their prices and shipping and their overall selection. Their prices are very competitive and they have products that can be very hard to find. You will not regret it. If you're unsure, buy here. You will like what you recieve. I will always buy whatever gmaes/consoles/ etc I want from here. Congratulations on finding the right place to purchase from!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alterna Thunderfox",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T01:55:44.000Z",
          "Titre": "Awesome Sauce service!",
          "Contenu": "Well, not to brag, but I had received a complete, sealed copy of Super Mario Bros. Wii and LOVED IT!!! I cannot wait until May to get my next game at the Players Choice Videogames website. You are all awesome sauce!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda Ramsey",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T22:12:22.000Z",
          "Titre": "BLESSED AND OVER JOYED",
          "Contenu": "First and foremost; I am not the social media type, I hardly ever leave a review on anything. but people are quick to complain. I am quick to give a compliment. I have been searching for the games at a reasonable price for a while I searched everywhere. I was starting to get disappointed but then I came across this site. I had never heard of you. and I was skeptical but I decided to put it in Gods' hands and order these. when they came I was so happy you truly don't know how much joy you gave me. I don't ask for much and I am a christian who understands that small things matter just as much as big things. Thank you so much God loves you and I do to. I will order from this site again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cameron Flowers",
          "Nb_Reviews": 1,
          "Date": "2021-09-22T20:22:54.000Z",
          "Titre": "Pretty Good!",
          "Contenu": "I ordered a copy of NCAA 08 and it works pretty good! The game came in after a few days and I had no issues at all, besides from the fact you need an account to track your item. It's very reliable and I recommend using this website for retro games."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jose Parra Villalón",
          "Nb_Reviews": 1,
          "Date": "2022-04-20T20:10:37.030Z",
          "Titre": "Purchased items",
          "Contenu": "Upon request, they gave me my list of items purchased while I was waiting on two more items to arrive. If they can make it a standard to give you an items list with your receipt, that would be awesome! Really great response time and quality of products! Will be buying again soon :3"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chamarion Bishop",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T22:56:25.000Z",
          "Titre": "I love how the packaging looks and how…",
          "Contenu": "I love how the packaging looks and how it showed up. The game I ordered had no damage to it, it was in perfect condition. The game was playable and it was working."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ziggy Ghost",
          "Nb_Reviews": 1,
          "Date": "2021-07-29T20:12:29.000Z",
          "Titre": "Two thumbs up for Players Choice…",
          "Contenu": "Two thumbs up for Players Choice Videogames! A nice selection for video games, consoles, and accessories at an affordable price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kayla",
          "Nb_Reviews": 2,
          "Date": "2023-11-02T05:26:56.000Z",
          "Titre": "Product was as described and was…",
          "Contenu": "Product was as described and was shipped and received in a timely manner. Would buy from this company again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sean Berbert",
          "Nb_Reviews": 1,
          "Date": "2021-12-30T17:55:29.000Z",
          "Titre": "100% authentic retro games and…",
          "Contenu": "100% authentic retro games and accessories and they were quick to respond to any questions I had about my order. Will definitely buy from them in the future!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrea M.",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T20:22:47.000Z",
          "Titre": "I have bought from this sight several…",
          "Contenu": "I have bought from this sight several times and LOVE it I tell all my friends who love older systems about your sight!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cameron Davis",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T20:37:11.000Z",
          "Titre": "10/10 Good service console came clean"
        },
        {
          "Note": 5,
          "Lieu": "KE",
          "Pseudo": "Kevin Bosiree",
          "Nb_Reviews": 1,
          "Date": "2021-07-04T10:21:11.000Z",
          "Titre": "Quality.",
          "Contenu": "The video game I got from you was amazing. Always keeps me interested after my long days at work. I will definitely recommend video game lover to shop here."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "N V",
          "Nb_Reviews": 1,
          "Date": "2022-02-16T16:41:27.000Z",
          "Titre": "Players Choice wins",
          "Contenu": "Players Choice has every game imaginable for every console out there. Thank you for having such a great variety and fast shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryan Gilmore",
          "Nb_Reviews": 1,
          "Date": "2021-09-30T03:03:36.000Z",
          "Titre": "Game arrived looking almost brand new",
          "Contenu": "Game arrived looking almost brand new.  Great customer service.  Will use them for my next legacy gaming purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cody Scales",
          "Nb_Reviews": 1,
          "Date": "2023-01-07T20:19:05.000Z",
          "Titre": "Awesome selection of everything",
          "Contenu": "Y’all have an awesome selection of pretty much everything. Thank you for the good service and shipping. I will be a returning customer 👍"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin Monteforte",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T15:36:42.000Z",
          "Titre": "Noice",
          "Contenu": "Fast delivery, cheap price, disc looks brand new. Playing Amazing Island now and this game sucks but I made Amogus so yeah 10/10"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angela",
          "Nb_Reviews": 1,
          "Date": "2021-12-18T15:24:10.000Z",
          "Titre": "I was so impressed on the price and…",
          "Contenu": "I was so impressed on the price and excellent condition of the game cube i bought for my son!! Super fast delivery of a few days. Im super happy with my purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "crusty",
          "Nb_Reviews": 1,
          "Date": "2021-10-13T00:47:26.000Z",
          "Titre": "Everything on this website has very…cheap and affordable games,",
          "Contenu": "Everything on this website has a very good pricing and theirs really no game or console that dose not have good pricing its perfect i recommend it.10/10"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edith Grigsby",
          "Nb_Reviews": 1,
          "Date": "2022-04-22T17:18:46.641Z",
          "Titre": "the game 🎮 was for my son bday so far…",
          "Contenu": "the game 🎮 was for my son bday so far he is enjoying it and no problem with the game ty appreciate it he happy I'm happy ty again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "June Barnett",
          "Nb_Reviews": 3,
          "Date": "2023-10-30T23:07:50.000Z",
          "Titre": "Nintendo game was easy to buy and came…",
          "Contenu": "Nintendo game was easy to buy and came in perfect condition"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeremy",
          "Nb_Reviews": 1,
          "Date": "2022-03-11T14:49:19.000Z",
          "Titre": "Took a little time but I received what…",
          "Contenu": "Took a little time but I received what was purchased. I didn't mind and I would say if you have any questions before buying just reach out to them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Danielle  Barr",
          "Nb_Reviews": 3,
          "Date": "2021-08-03T18:11:40.000Z",
          "Titre": "Great experience ordering from these…",
          "Contenu": "Great experience ordering from these guys! Everything shipped in good condition and they are helpful and respond quickly!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Emily Plummer",
          "Nb_Reviews": 1,
          "Date": "2021-12-06T23:18:38.000Z",
          "Titre": "Customer service was excellent",
          "Contenu": "Customer service was excellent! I had to change something that I entered wrong when placed the order and fixed right away. Got back to me fast and shipping was quick too. Will buy from again for sure!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryan Knotts",
          "Nb_Reviews": 6,
          "Date": "2021-11-24T17:09:32.000Z",
          "Titre": "My recent order with Player's Choice…",
          "Contenu": "My recent order with Player's Choice Videogames was quite satisfactory. The order arrived timely, and the game plays well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Lomshek",
          "Nb_Reviews": 1,
          "Date": "2022-09-09T17:21:21.000Z",
          "Titre": "Trustworthy site",
          "Contenu": "Great service. Game arrived in less than a week in perfect condition. Games are fair-priced. I would totally use this site again to order games."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cody Brock",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T17:16:58.000Z",
          "Titre": "Great customer service!",
          "Contenu": "Great customer service! The disk they sent was flawed and they took care of me and then some. Will buy again when looking for vintage games and accessories. 10/10"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ShaneM",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T18:29:42.000Z",
          "Titre": "My Wii and the copy of Twilight…",
          "Contenu": "My Wii and the copy of Twilight Princess made it here safely with the game in great condition, very happy 😁😁"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keely",
          "Nb_Reviews": 1,
          "Date": "2022-01-10T19:20:30.000Z",
          "Titre": "Bought the original shadow of the…",
          "Contenu": "Bought the original shadow of the colossus from here. Not only did they have it in stock, but it came packaged like new."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryan Knotts",
          "Nb_Reviews": 6,
          "Date": "2022-10-14T18:16:16.000Z",
          "Titre": "My experience with Player's Choice…",
          "Contenu": "My experience with Player's Choice Video Games was excellent as always! Fast efficient shopping, check out, and delivery of my item."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jose duran",
          "Nb_Reviews": 1,
          "Date": "2022-12-10T21:52:52.000Z",
          "Titre": "Everything was excellent",
          "Contenu": "Everything was excellent, the deliver was fast, game in brand new conditions, price was super reasonable, my only complaint, is that I can only give 5 stars to this company, they  deserve 10 stars!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan Cohen",
          "Nb_Reviews": 2,
          "Date": "2021-10-25T17:36:18.000Z",
          "Titre": "Ordered an Xbox for my son- arrived…",
          "Contenu": "Ordered an Xbox for my son- arrived quickly and they emailed to be sure a received it- great customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "miguel",
          "Nb_Reviews": 1,
          "Date": "2022-02-08T17:05:20.000Z",
          "Titre": "Love this shop!",
          "Contenu": "Great place where I can find everything I want for my retro console. Big selection, fast shipping, great prices. I'll buy from Players Choice again soon."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Rivera",
          "Nb_Reviews": 1,
          "Date": "2021-07-30T04:28:01.000Z",
          "Titre": "At first I was unsure about this place…",
          "Contenu": "At first I was unsure about this place but now  I got what I wanted and I love the game for my 3DS (Pokémon Sun) Thank you guys!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KEMAH",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T20:40:43.000Z",
          "Titre": "Great place for gamers to shop!",
          "Contenu": "Great place for gamers to shop!! Very well package and you get exactly what the picture shows!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rachel R.",
          "Nb_Reviews": 2,
          "Date": "2021-10-06T17:34:02.000Z",
          "Titre": "Got exactly what seller advertised",
          "Contenu": "Got exactly what seller advertised.  Good condition.  Seller was quick to respond to me about shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Guy Eernisse",
          "Nb_Reviews": 5,
          "Date": "2021-12-02T22:07:49.000Z",
          "Titre": "Just the right thing!",
          "Contenu": "Looking for a game for my son he stumbled a cross the site. Great experience,  good selection and prices. We will return."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jetta Gli",
          "Nb_Reviews": 1,
          "Date": "2022-02-08T01:23:30.000Z",
          "Titre": "This website is definitely legit",
          "Contenu": "This website is definitely legit! Bought 3 3ds cartridges and in perfect shape and in their containers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bear",
          "Nb_Reviews": 1,
          "Date": "2023-02-07T17:22:53.000Z",
          "Titre": "Easy to order games in great condition…",
          "Contenu": "Easy to order games in great condition delivery was quick. Will order from them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2021-11-30T14:43:54.000Z",
          "Titre": "Great deal on Xbox 360 power bricks",
          "Contenu": "Great deal on Xbox 360 power bricks. Looks like they have a lot of other interesting things on their website."
        }
      ]
    }
  ]
}