{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.landlordstation.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Clark Massey",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T18:55:51.000Z",
          "Titre": "You keep rejecting my real estate cc",
          "Contenu": "You keep rejecting my real estate cc. I have worked over an hour on this issue during the last year. No resolution. Cc company assured me it’s an issue on your side but I never get sufficient help to resolve it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John McCann",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T00:53:04.000Z",
          "Titre": "Ordered a report on a rental applicant…",
          "Contenu": "Ordered a report on a rental applicant using first and last name as landlord station requests. The report  received had that name but was a different person. Landlord Station's requesting middle initial would have avoided that problem. My money was wasted."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chad Coogan",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T23:39:14.000Z",
          "Titre": "You should be able to find out how much…",
          "Contenu": "You should be able to find out how much they have in their checking and savings accounts that be more beneficial than some of this other crap"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jacob Ornelas",
          "Nb_Reviews": 1,
          "Date": "2022-09-14T21:30:01.000Z",
          "Titre": "landlordStation did a backgroud  for 15 years back",
          "Contenu": "landlordStation did a backgroud and went back 15 years . Instead of the normal 7 years. this is not right.and unprofessional. we need to have someone govern their process. This practice of going back 15 years isnot right."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Box",
          "Nb_Reviews": 2,
          "Date": "2022-03-28T14:15:11.000Z",
          "Titre": "It took almost a week to get the…",
          "Contenu": "It took almost a week to get the results and I never received an explanation why. This has never happen before just need to find a fix so that it doesn't happen again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carol Howell",
          "Nb_Reviews": 1,
          "Date": "2021-05-25T13:58:46.000Z",
          "Titre": "Not recommended",
          "Contenu": "System glitched. Ended up with incomplete report. I had to pay again for the right report and the link they sent to my potential tenant does not work. Still not resolved going on a week. Would not recommend."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ana Esquetini",
          "Nb_Reviews": 1,
          "Date": "2020-07-21T21:54:45.000Z",
          "Titre": "Horrible customer service",
          "Contenu": "Horrible customer service, when you call their 1 866 number they never answer nor call you back. I will definitely use another tenant screening station next time. I was very disappointed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brandon Long",
          "Nb_Reviews": 1,
          "Date": "2021-04-01T15:56:57.000Z",
          "Titre": "I sent out a request for a tenant…",
          "Contenu": "I sent out a request for a tenant background check and my client was unable to submit his application. When trying to contact Landlord station i was unable to get help."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel McManaman",
          "Nb_Reviews": 2,
          "Date": "2020-09-05T01:50:25.000Z",
          "Titre": "I requested a call back and did not get…",
          "Contenu": "I requested a call back and did not get it.  Better yet, just answer your phone - don't make me waste 5 minutes to get to a voicemail.  Reports are expensive."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Teri Abraham",
          "Nb_Reviews": 1,
          "Date": "2020-07-10T14:54:00.000Z",
          "Titre": "It's been two days and I still don't…",
          "Contenu": "It's been two days and I still don't have my Premium Report.  The entire report is supposedly held up because of TransUnion.  Waste of money......."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chrissou",
          "Nb_Reviews": 1,
          "Date": "2021-01-26T01:12:43.000Z",
          "Titre": "You did not catch up the eviction nor…",
          "Contenu": "You did not catch up the eviction nor the background for one of my tenants. Your search was not accurate"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gerard Curre",
          "Nb_Reviews": 1,
          "Date": "2021-11-05T16:20:05.000Z",
          "Titre": "Never got a background check in the…",
          "Contenu": "Never got a background check in the last two applications.I sent!!! that was 2-3 days ago!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "glenn beasley",
          "Nb_Reviews": 2,
          "Date": "2020-05-31T12:05:46.000Z",
          "Titre": "It’s to hard to read..",
          "Contenu": "It’s to hard to read... it looks like it says to accept the tenant even though the credit is really bad. Not sure that I’ll be using this again"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carol Fletcher",
          "Nb_Reviews": 1,
          "Date": "2019-08-16T15:39:28.000Z",
          "Titre": "I  have used Landlord station a lot in…",
          "Contenu": "I  have used Landlord station a lot in the past and loved them... Until now!  I needed some customer service on an issue that they said they would release a report and they did not and I tried to get ahold of them.   I have left numerous emails,  Report a problem on their site,  and phone messages with no reply to any of it.    It is an easy fix on their end.  They seem to be great as long as you don't need anything or an actual person to answer an email or phone message.  Very disappointing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Debbie Deyoung Thomason",
          "Nb_Reviews": 1,
          "Date": "2018-05-24T23:43:20.000Z",
          "Titre": "I am very disappointed in the service I…",
          "Contenu": "I am very disappointed in the service I am receiving .  We have questions regarding the background checks that we purchased . We have called about 6 times and left messages and have not had a returned call . My husbands nabe is Paul thomason and has left his phone number 318-560-5599. We would like to hear from someone ASAP . Thanks"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nick Shuford",
          "Nb_Reviews": 1,
          "Date": "2018-02-01T15:28:34.000Z",
          "Titre": "Not off to a good start",
          "Contenu": "I just opened an account yesterday and sent two Tenant screenings out. I had one of the email address’ wrong, so I’ve called in and emailed for help with no luck or reply back from anyone. I need to resend the tenets screen to the correct email address and could not find any help online or through calling in. Disappointed so far for sure."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JCA SERVICES",
          "Nb_Reviews": 1,
          "Date": "2019-10-31T17:07:54.000Z",
          "Titre": "Not good...",
          "Contenu": "This was my first time using landlord station, I  tried to pay like 6 times with different cards they never went through, there is no customer support, no live chats,  no answering the phone.  I need it the screening the same day and you responded by email a day later, I only needed a local background check with no credit record,  etc. By the time you answered I had already used myrental.com which gives more options and background check only from $9.99 and 30% discount for my board, and they always answer my calls. no thanks."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Miriam Bravo",
          "Nb_Reviews": 1,
          "Date": "2019-05-22T23:58:58.000Z",
          "Titre": "no free 1st time",
          "Contenu": "They advertised the first request to be free, but not for me. When I emailed them that it should not be charged, they would not credit my card. Be careful because they don't keep their word."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "George from Florida",
          "Nb_Reviews": 1,
          "Date": "2018-07-08T02:55:10.000Z",
          "Titre": "DECEPTIVE TIMEFRAME, CANCELLATION REFUSED, MONEY TAKEN",
          "Contenu": "> We noticed that there may be some erroneous criminal and/or eviction> records attached to your tenant's (xxx xxx) profile on Report> #yyyyyy> most likely because of their common name. We have sent it to Trans> Union to request a more thorough search. If possible Trans Union will> have those cleared off. Until that time, your report will remain> pending. In general Trans Union will turn these around in 24-48> business hours. BEWARE OF DECEPTIVE TIME FRAME.  Nobody would say 24-48 business hours if that wasnt meant to con you into thinking 1 to 2 days.We canceled our order at least 12 hours before any live person handled this matter.  NO REFUNDS -- SCREW US. Then later next day report was sent after tenant rented elsewhere.  To this date paid for report has never been opened or read.  No tenant and money gone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MT",
          "Nb_Reviews": 1,
          "Date": "2017-10-14T21:01:03.000Z",
          "Titre": "Not accurate",
          "Contenu": "The background check failed to bring up the applicants criminal history when I specifically paid extra to check the criminal history of the applicant."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William Winslett",
          "Nb_Reviews": 1,
          "Date": "2017-07-24T21:27:25.000Z",
          "Titre": "The site is hard to navigate",
          "Contenu": "The site is hard to navigate. The process is not laid out properly. Any one who isn't comfortable with a computer will struggle as my mother did."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "louanne caputo",
          "Nb_Reviews": 1,
          "Date": "2017-10-09T15:45:09.000Z",
          "Titre": "took days to received information had …",
          "Contenu": "took days to received information had to go to smartmove and get the same thing in minutes.  they spent double there money ! I will never use again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "rayna",
          "Nb_Reviews": 1,
          "Date": "2019-11-16T16:21:48.000Z",
          "Titre": "I’m still waiting for one report and no…",
          "Contenu": "I’m still waiting for one report and no phone is provided to us to call. Questions are not answered or only half way! So frustrating!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nancy Remedios",
          "Nb_Reviews": 1,
          "Date": "2019-11-30T20:20:13.000Z",
          "Titre": "You offered a free first credit report…",
          "Contenu": "You offered a free first credit report and you charged m credit card. I am member of Miami Realtors Association"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pierre NGUYEN VAN TRONG",
          "Nb_Reviews": 1,
          "Date": "2019-09-04T14:16:30.000Z",
          "Titre": "Your service is too expensive",
          "Contenu": "Your service is too expensive, and the report receive is not complete.  Waste of money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marcel Kornacker",
          "Nb_Reviews": 2,
          "Date": "2020-01-09T21:45:05.000Z",
          "Titre": "Poorly functioning site and support is *very* unresponsive",
          "Contenu": "I tried to run a background check through them and got an error message after pressing the 'Go' button (the error looked like a bug in their system; some pdf file missing). I had assumed that this didn't go through and went ahead with a different service for the background check, only to find a few minutes later that they sent a completed report.Since I don't want to pay twice for the same thing, I requested a refund from them. I first tried to do that through their support email system, and they still haven't responded to that (after now around 15 hours; their website claims they'll respond within an hour). I also called a support phone number (which isn't listed on the site), which asks you to press '2' and then tells you to leave a voicemail.Overall, the one thing they seem to do well is billing their customers; the rest feels like an afterthought.Update:Contrary to the response from Landlordstation, I did *not* receive any response to any of the three emails I have sent them so far. I also noticed that they charged me three times (I hit the Submit button three times, and in each instance received the same error message). The only communication I received from them was an automated email asking me to rate their \"response\". (It looks like this was automatically generated by Zendesk.)I will now get my credit card company involved in order to cancel their fraudulent charges."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joshua Vallario",
          "Nb_Reviews": 2,
          "Date": "2017-03-29T22:19:04.000Z",
          "Titre": "Credit reports are garbage and …",
          "Contenu": "Credit reports are garbage and unuseable."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "C.M.",
          "Nb_Reviews": 2,
          "Date": "2023-03-13T19:48:40.000Z",
          "Titre": "You didn't supply the credit check info…",
          "Contenu": "You didn't supply the credit check info to the people who paid for it.  I will.look for a service that does. I believe that they should have access supplied by the people who are responsible for the content.  This the first time I have used your service, the other service provided the info to my tenants.  Actually some of the information was incorrect.   He work info was far out of date.  I have confirmed his current work place and his last, but neither of these showed up on your report.  The info you had was maybe 6 or more years out of date"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "VQVQVQ",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T17:24:25.000Z",
          "Titre": "Can't edit mistakes...",
          "Contenu": "There was a typographical error made by the applicant and he only caught it after the information was submitted. We emailed LS to update the mistake and they are not able to. Client would have to spend another $45 to redo the application. We went to another company. I'm not sure I will continue using them in the future for my clients."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "EXP",
          "Nb_Reviews": 1,
          "Date": "2022-05-08T01:41:23.000Z",
          "Titre": "We’ve basically left Landlordstation…",
          "Contenu": "We’ve basically left Landlordstation for most of our items of Property Management, as the platform could be SO much better and it always seems to be a glitch in the system that makes all the mistakes that come up. Disaster left and right."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2020-07-27T13:09:20.000Z",
          "Titre": "Very poor tenant and yet Landlord station still recommends accepting him.",
          "Contenu": "Landlord Station review showed 600 credit score, a forced eviction less than 6 months ago, over 40 late payments, and 2 judgments in the last month.  And yet they still recommend that I accept the person as a tenant.  Are you kidding me? I called on Friday morning with an issue with my account, I was forced to leave a message because no one answered and as of Monday morning still no call back.On top of that the 2 screening took 2 days to complete!  This service is not what it used to be."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ARLESTER MILLER",
          "Nb_Reviews": 1,
          "Date": "2022-11-05T21:31:29.000Z",
          "Titre": "System is to complicated for me to use",
          "Contenu": "System is to complicated for me to use. when I sent out the application the tenants were having too much trouble."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gloria Mazuera",
          "Nb_Reviews": 1,
          "Date": "2023-01-20T18:17:29.000Z",
          "Titre": "Absolutely no support",
          "Contenu": "Absolutely no support. It's not clear when tenant pays -"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rainer Hoeglmeier",
          "Nb_Reviews": 2,
          "Date": "2021-10-03T22:06:40.000Z",
          "Titre": "Do not like the changes since using it…",
          "Contenu": "Do not like the changes since using it last. Gone is the recommendation feature the actual report has nothing in common with the sample report you showing and after contacting customer support they really did not give a satisfying answer.I will definitely looking elsewhere."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sebastian Mekkadath",
          "Nb_Reviews": 2,
          "Date": "2020-11-16T17:40:39.000Z",
          "Titre": "We can credit reports for a fraction of…service",
          "Contenu": "We can credit reports for a fraction of the money we pay for yours.  I sent my request for manual verification weeks ago and have not heard word."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joanne O'Donnell",
          "Nb_Reviews": 1,
          "Date": "2020-07-03T20:04:25.000Z",
          "Titre": "In the past I have had that experience…",
          "Contenu": "In the past I have had that experience with landlord Station and have used them for years. I currently am having a problem that isIn the past I have had that experience with landlord Station and have used them for years. I currently am having a problem that is getting me to the point that I may never use them again. I had that I may never use them again. I had a prospective tenant apply for a background check he was paying himself apply for a background check he was paying himself and it keeps coming up with the same error message. I have written to them numerous times, so has he, they keep saying they've fixed it and it is not fixed. I have asked repeatedly so has he for someone to call us. nothing and it keeps coming up with the same error message. I have written to them numerous times, so has he, they keep saying they've fixed it and it is not fixed. I have asked repeatedly so has he for someone to call us. Nothing. This is been going on for several weeks. I understand that you're shortstaffed. This is been going on for several weeks. I understand that you're shortstaffed but this is just ridiculous.. YOU CANNOT CALL THEM EXT 2 WHICH THEY SAY TO USE SAYS IT IS INVALID.  Please someone look up my information and call me. Joanne O'Donnell"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Midlaine Richard-Pean",
          "Nb_Reviews": 1,
          "Date": "2022-02-15T16:58:18.000Z",
          "Titre": "System is not user friendly and…",
          "Contenu": "System is not user friendly and customer service takes forever to get back."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "cupsue",
          "Nb_Reviews": 2,
          "Date": "2020-08-07T19:17:22.000Z",
          "Titre": "The credit report provides insufficient…",
          "Contenu": "The credit report provides insufficient employment history.I just need the employment history instead of verification. I know most of credit reports do report the employment history. Yours don't."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Blaine Brownlow",
          "Nb_Reviews": 2,
          "Date": "2020-08-26T15:08:41.000Z",
          "Titre": "Could not get report as pdf doc",
          "Contenu": "Could not get report as pdf doc.  Have not had that problem before."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Fawn Munro",
          "Nb_Reviews": 1,
          "Date": "2019-09-04T13:03:04.000Z",
          "Titre": "Credit card payment issues",
          "Contenu": "I have tried several times to update my credit card information with the site, and I keep getting an error that they can't resolve.  The issue is related to my billing zip code.  I have talked to my credit card company, and the problem is not on their end, and I have updated/corrected the information in my profile.  I was able to finally get it to work with my debit card, but that is not my preferred payment method."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tamika Watts",
          "Nb_Reviews": 1,
          "Date": "2019-06-11T19:22:08.000Z",
          "Titre": "I was frustrated by the response time",
          "Contenu": "I was frustrated by the response time.  I had to reach out several times using different mediums (phone, voicemail, email) before someone got back to me.  When I finally got a call back, I had a follow-up question.  It's been about 24 hours and I have not received a response.  The response time is unsatisfactory."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stephen Gardner",
          "Nb_Reviews": 1,
          "Date": "2017-10-24T17:23:07.000Z",
          "Titre": "Improvement needed in the speed category.",
          "Contenu": "Every single check that has been conpleted thus far has been placed on hold for some reason. A competitors site was used in comparison and the checks were not held up and were completed days before landlordstation.com. In a rapidly evolving industry with multiple offers and contracts flying... hours and certainly days, cost money and lose contracts."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2017-02-01T06:06:19.000Z",
          "Titre": "Should be tri-merge credit report and no customer service",
          "Contenu": "The credit report should be a tri-merge report and not just 1 bureau (Trans Union). The credit report should be simpler to read - the format could be more user-friendly. I needed some questions answered before I ran my tenant's credit, so I called the phone number. I left two voicemails over two days and nobody from LandlordStation even had the decency to call me back. This will likely be the first and last time I use this service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Karen H.",
          "Nb_Reviews": 1,
          "Date": "2017-03-14T20:58:16.000Z",
          "Titre": "Not Very Informative",
          "Contenu": "There was no credit report whatsoever and very little information.  We learned only that there is some employment history and how much is earned per month, but little else.  It was very quick service, but we don't know how helpful it really was.Actually, we don't know why there was no credit history and there was no information for any rental recommendation, which is what we thought we were paying for.  Not what we expected from our payment."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Scott Franklin",
          "Nb_Reviews": 1,
          "Date": "2019-11-02T05:11:20.000Z",
          "Titre": "It's impossible to get someone on the…",
          "Contenu": "It's impossible to get someone on the phone to answer questions, don't waste your time trying. They say that their phone service is limited, but even after leaving voice messages, I never got a phone call back. Email is they only way they ever communicated with me, and the response times to questions were lengthy. I'm lucky that I had a little time to waste, in getting my background check done. The final report was good and concise, but if you're in a hurry, and need questions answered quickly, forget it and look elsewhere."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dan Burkhart",
          "Nb_Reviews": 2,
          "Date": "2018-05-24T01:50:21.000Z",
          "Titre": "I will not use this site again until…",
          "Contenu": "I will not use this site again until there is an option to have potential tenants pay for the service when they fill out the application.  It seems reasonable to have a link sent to them with the type of service outlined, have them fill out the form, then enter credit card info etc. at the end and send it in.  It is too inconvenient in this electronic age to sit at a showing collecting checks for the cost of the app.  Otherwise the results were fast, but maybe a little more explanation as to why it all means.  Thank you."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lilian Andrawes",
          "Nb_Reviews": 1,
          "Date": "2022-08-21T18:42:25.000Z",
          "Titre": "I paid the fees and I didn’t get the…",
          "Contenu": "I paid the fees and I didn’t get the report"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Elliot",
          "Nb_Reviews": 1,
          "Date": "2019-06-30T00:51:33.000Z",
          "Titre": "Web Site Had Problems; Abysmal Customer Service; Almost Lost a Tenant",
          "Contenu": "My prospective tenant received the e-mail so she could confirm/approve processing of her application.  She filled in the form and tried to submit it, but it was rejected by Landlord Station's server with a cryptic error message that didn't really say what the problem was (how often we see that on web sites in general = sad). She called Landlord Station's toll-free help number during normal business hours and could only leave a voice-mail.  No one called back.  The situation was only resolved the next day, after I intervened and sent a stern message to Landlord Station.  Overall, my experience was a glitchy web site with poor error handling, and abysmal customer service.  I believe I deserve a full refund of the money paid.  I almost lost a good tenant."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lorraine",
          "Nb_Reviews": 2,
          "Date": "2017-08-06T18:40:02.000Z",
          "Titre": "Very disappointed",
          "Contenu": "I paid for the $45 level of service and expected to get information about employment and got zero. When I asked why not I was just told they didn't know why and it was up to me to verify employment. It seems to me that if a potential tenant gives you their social security number that would be easy to get. Paying $65 to get this information is far too expensive to pay for that service as most tenants complain already about paying $45. Will be looking for another screening service. Landlordstation customer service also couldn't explain to me how they \"accepted\" a tenant when their debt was extremely high and no employment verification was given. Just doesn't make sense to me and doesn't make me have confidence in the service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Karen Walter",
          "Nb_Reviews": 1,
          "Date": "2019-03-23T16:04:36.000Z",
          "Titre": "Not Easy to use for applicants and Landlords",
          "Contenu": "My applicants found the application very difficult to use and they 30-40 and used to digital systems. Entering employers there is no way to put in correct end date with for example  start 09/01/2018 to end date PRESENT in other words currently employed.  Instead your system ended with 01/01/2019 as if they are NOT employed.  This is unacceptable and not helpful.Also I had problems with the Application part of the system and could not get anyone to call me back. POOR customer service.Emailing is not sufficient when on tight deadlines to get a new tenant(s).  Also what do you mean when on screening and get score. Acceptable per what you allowed.  Where did I put in what is an \"acceptable\" score?  This also is unacceptable.  I emailed but did not yet get a response."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gina Lopez",
          "Nb_Reviews": 1,
          "Date": "2018-03-15T22:07:22.000Z",
          "Titre": "NO personal help",
          "Contenu": "NO personal help, site needs to be ore user friendly, add a ton more options to various things as items constantly pop up being a landlord/owner."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ty",
          "Nb_Reviews": 1,
          "Date": "2017-08-22T20:28:38.000Z",
          "Titre": "Poor security standards",
          "Contenu": "Poor security standards. I did a reset on my password when I had forgotten it. My password was e-mailed to me in plain text!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Cindy S",
          "Nb_Reviews": 1,
          "Date": "2020-05-09T11:47:29.000Z",
          "Titre": "I think the report is confusing and I’m…",
          "Contenu": "I think the report is confusing and I’m unable to get much use from it"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mary Bertao",
          "Nb_Reviews": 1,
          "Date": "2019-10-24T22:11:24.000Z",
          "Titre": "Can't get an answer",
          "Contenu": "Can't get an answer. No phone number to call. Really?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T22:25:22.000Z",
          "Titre": "It would be nice to have a response on…",
          "Contenu": "It would be nice to have a response on inquiries during weekends instead of waiting til Monday. Just a suggestion.  Thanks"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Monica Winkle",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T23:54:59.000Z",
          "Titre": "I used you about 3 years ago and just a…",
          "Contenu": "I used you about 3 years ago and just a few days ago.  You used to be so much more comprehensive than what I received from the tenant screening today. Very disappointed. I’m going to try and find a better option next time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kyle Bailey",
          "Nb_Reviews": 1,
          "Date": "2023-02-27T02:57:41.000Z",
          "Titre": "Do better",
          "Contenu": "Dashboard could use improvement for usability. People want point and click, and I find that I'm going in circles trying to find what I'm looking for half the time.  virtual walk thou on how to, or video guides to show what things do and how it works. Editing features such as the rental application took a while to figure out how to edit it, then it there was a mistake how to undo it.  just getting started but this is what has happened so far and trying to get help? where?Once you do figure it out on your own, it's a useful tool that gets the basics done."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2022-07-02T12:06:48.000Z",
          "Titre": "Good system, but can use some enhancements",
          "Contenu": "It would be helpful if the system allowed for messages to be sent outside of needing to send a maintenance request. Applications that allow for drop downs would be great. It’s not the most user friendly, and the dashboard could use an update appearance wise. It would be great if sign documents could be customizable instead of just allowing for one signature at the end of the document."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tara Mooney",
          "Nb_Reviews": 1,
          "Date": "2020-06-02T22:38:51.000Z",
          "Titre": "The credit report and background check…",
          "Contenu": "The credit report and background check were good but there were no bank accounts noted, checks on verified income, or past work history prior to a person who has retired. All above mentioned play an important role in deciding whether or not a person is a good perspective tenant. Therefore, I could not give this service 5 stars."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pierce",
          "Nb_Reviews": 2,
          "Date": "2022-06-09T19:40:20.000Z",
          "Titre": "Customer Service",
          "Contenu": "I did not get a response for the email I sent to customer service. The platform was somewhat user-friendly. I needed better instructions to do what I wanted to do, yet there was no customer service phone number to connect with anyone to resolve my issues on the platform."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alfonso Johnston",
          "Nb_Reviews": 3,
          "Date": "2022-02-14T01:16:29.000Z",
          "Titre": "I had issues a few weeks ago on using…",
          "Contenu": "I had issues a few weeks ago on using your site while I’m at my 2nd home in Baja, Ca. Mexico. I had numerous emails with the Landlord Station team before they said I was to be put on a “list(?)” so, my IP address would be recognized in the future. Well, trying to use get to Landlord Station through my computer and iPhone were blocked, again. This is frustrating for me!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bradley S.",
          "Nb_Reviews": 1,
          "Date": "2022-08-27T23:39:35.000Z",
          "Titre": "Do not care for the user interface or tenant screening reports",
          "Contenu": "Do not care for the user interface much. The site seems outdated and has a basic user experience. The tenant reports are also very basic and don't provide enough information."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marlene Floran",
          "Nb_Reviews": 1,
          "Date": "2021-10-12T10:52:03.000Z",
          "Titre": "The turn around when an applicant makes…",
          "Contenu": "The turn around when an applicant makes a mistake takes roo long to reset, so they can finish the screening acceptance."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "IVETTE VILLAFRANCA",
          "Nb_Reviews": 2,
          "Date": "2023-03-09T17:22:41.000Z",
          "Titre": "landlord expectations",
          "Contenu": "I like the report of credit but the verifications of employment and rental history are not good enough."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chris Cofield",
          "Nb_Reviews": 2,
          "Date": "2022-01-09T19:31:38.000Z",
          "Titre": "I’m the past you have included a…",
          "Contenu": "I’m the past you have included a recommendation or not recommended statement. What happened to this?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert Walker",
          "Nb_Reviews": 1,
          "Date": "2022-03-25T01:36:06.000Z",
          "Titre": "We would prefer a report with an accept or reject summary.",
          "Contenu": "We would prefer a report with an accept or reject summary.."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sue",
          "Nb_Reviews": 3,
          "Date": "2021-07-14T00:41:34.000Z",
          "Titre": "The pric ing is higher than others and…",
          "Contenu": "The pric ing is higher than others and your reports show less"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anna Smith Barthell",
          "Nb_Reviews": 1,
          "Date": "2019-12-18T21:31:09.000Z",
          "Titre": "As a landlord and property manager",
          "Contenu": "As a landlord and property manager, former loan officer, I have used this exclusively for several years, at the suggestion of someone else in the business.  Sometimes it works fine, but when it doesn't - it is brain damage.The support is nil , you get very late, cryptic answers that don't really answer your question.  If you have something that is time sensitive it will not resolve in a timely manner.  It would be nice if they made customer service more of a priority."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kenneth Colby",
          "Nb_Reviews": 4,
          "Date": "2019-12-21T03:36:58.000Z",
          "Titre": "Have had good luck with this company in…",
          "Contenu": "Have had good luck with this company in the past. As usual, they are quick. I had an obvious error in their calculation of income verses rent. Had to make a decision regarding the tenant since it took 24 hours for Landlord Station to answer my question as to the discrepancy. That was too late. Not sure I'll use them again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Terese N",
          "Nb_Reviews": 2,
          "Date": "2018-11-28T03:44:59.000Z",
          "Titre": "All the numbers worked out and I signed…",
          "Contenu": "All the numbers worked out and I signed a lease with my tenant. Approximately 2 hours afterward my tenant began texting me crazy delusional text.  Clearly this tenant has some sort of psychological history that was not disclosed on your report. Not sure if it is legal for you to find or disclose medical info but it would have been nice to know this sort of info would not be disclosed"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "BRH",
          "Nb_Reviews": 1,
          "Date": "2017-10-02T18:56:03.000Z",
          "Titre": "I selected a service that promised …",
          "Contenu": "I selected a service that promised phone verification. Based on the fast turnaround on a Saturday, I believe no phone verification was performed. If the verification requires consent of the applicant, the site should prompt the applicant to give that consent, given that I pre-paid for that service. If the applicant refuses consent, the report should indicate that choice to me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "De",
          "Nb_Reviews": 3,
          "Date": "2019-12-14T18:35:39.000Z",
          "Titre": "I have used this several times",
          "Contenu": "I have used this several times. Usually it works great. Once it seem to work but then the tenant told me he had a felony in which he was in prison for seven years and it did not show a criminal record at all. I did let Landlord station know about this problem or error, but they seemed to not care. This time in using it it mixed up the criminal record of my Tenant with another criminal record, which has happened once before. It did clear it up after 24 hours. I had a harder time using the new website than the old website."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ken Larsen",
          "Nb_Reviews": 8,
          "Date": "2017-01-31T18:33:07.000Z",
          "Titre": "Fast service, but criminal histories can't be trusted.",
          "Contenu": "LandLord Station is easy to access and the report is returned quickly; however, the criminal history are not accurate.  I've had applicant's admit to various felony and misdemeanor criminal convictions, yet the LandLord Station has never found a single one."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nina Wang",
          "Nb_Reviews": 1,
          "Date": "2017-06-07T15:17:17.000Z",
          "Titre": "currently my tenant had a problem to …",
          "Contenu": "currently my tenant had a problem to complete the tenant screen. She said when she answered the last five questions, it kept showing a different last name on the screen and she was unable to fix and submit her informaion.I hope that the process can be approved."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "William Johnston",
          "Nb_Reviews": 1,
          "Date": "2017-03-22T14:01:00.000Z",
          "Titre": "Prices have gone up and reliability seems to have gone down.",
          "Contenu": "I have used landlord station for my tenant background checks since 2010. Initially the service was great and the prices were reasonable. However over the last several years the search prices have increased dramatically compared to other comparable background search companies. I have also noted a trend of late that initial searches come back as \"erroneous\" with the excuse that the tenant may have a common name, then the search comes back a day later and appears fine with no erroneous records as previously indicated. I'm not sure why this trend seems to occur but something in the checks needs to be addressed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nelson",
          "Nb_Reviews": 1,
          "Date": "2018-07-08T17:23:46.000Z",
          "Titre": "The return time of credit report is…",
          "Contenu": "The return time of credit report is very good.  But I would like to see Landlord Station have better client services representations to answer questions and resolve issues expediently."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "wallace",
          "Nb_Reviews": 1,
          "Date": "2019-03-08T00:44:28.000Z",
          "Titre": "Some what hard to navigate",
          "Contenu": "hard to navigate. It’s also to expensive for the information you receive in the tenants reports. Could be more inclusive.Less legalization could help."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steven P",
          "Nb_Reviews": 1,
          "Date": "2017-09-15T13:09:25.000Z",
          "Titre": "Would like to see the last 4 digits of …",
          "Contenu": "Would like to see the last 4 digits of applicants SS# on report, so I can verify the one they gave me on my application is not fraudulent."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lisa R",
          "Nb_Reviews": 1,
          "Date": "2017-06-22T00:56:46.000Z",
          "Titre": "Not easy to navigate the website after …",
          "Contenu": "Not easy to navigate the website after purchasing the screening package.  Hard to find the button that has pre-paid screenings."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Warren Lambert",
          "Nb_Reviews": 1,
          "Date": "2017-09-17T16:46:03.000Z",
          "Titre": "Credit report not shown",
          "Contenu": "Credit report not shown but applicant did have credit.  I had to get applicant to provide his own credit report."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ann Shannon",
          "Nb_Reviews": 5,
          "Date": "2017-01-31T16:04:25.000Z",
          "Titre": "Review",
          "Contenu": "Navigation of the site is not very easy. Speaking to someone from landlord station on the phone is impossible."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Rosenbaum",
          "Nb_Reviews": 1,
          "Date": "2017-10-10T12:40:35.000Z",
          "Titre": "Complicated to turn an applicant to a …",
          "Contenu": "Complicated to turn an applicant to a tenant"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nina Davidson",
          "Nb_Reviews": 1,
          "Date": "2017-08-23T16:34:48.000Z",
          "Titre": "I didn't get all information..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marianela Orsini Piedra",
          "Nb_Reviews": 1,
          "Date": "2020-05-08T18:37:11.000Z",
          "Titre": "Too many glitches"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Casas",
          "Nb_Reviews": 1,
          "Date": "2017-03-26T19:12:22.000Z",
          "Titre": "Gets the job done."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Dyer",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T17:58:46.000Z",
          "Titre": "Screening results are great, but process could be improved",
          "Contenu": "screening is great.  Getting there has some issues.1) invalid emails of tenants - some are hard to read the handwriting or are complicated.  A mistake delays the entire process.    Suggestion. - Verify the email submitted is valid.  if invalid, this will give an opportunity to immediately correct it before continuing the process.2)  adjusting the application.  I had a potential tenant balk when they saw it included a criminal screening due to his history.  After the explanation, I tried to resubmit without the criminal background check, but could not change  it.      Suggestion - make it possible to change the checks requested after the initial submission. 3) Old, or irrelevant checks cannot be deleted. Suggestion - Add this feature.  I would like to get rid of the old ones."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Michlowsky",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T02:33:07.000Z",
          "Titre": "Improvements Needed",
          "Contenu": "It doesn’t appear the income was verified. Also, I used the pulldown menu to determine the cost in advance to charge the potential tenants, but when I actually purchased the report I learned you charged $5 more for additional information in the report. It was too late to charge the tenant for this. This need to be fixed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shockley Gaye",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T13:16:52.000Z",
          "Titre": "Stockdale",
          "Contenu": "It gave me the opportunity to look into a potential renter. It was not as user friendly as I would have expected but worked for what I needed"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "karen poole",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T15:58:42.000Z",
          "Titre": "Is the rental number given supposed to…",
          "Contenu": "Is the rental number given supposed to be their credit score or what is the scale for 'your' rental score?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Twu",
          "Nb_Reviews": 2,
          "Date": "2022-04-08T21:11:01.000Z",
          "Titre": "I like the old report format that shows…",
          "Contenu": "I like the old report format that shows different version (Landlord & Tenant). I felt the old report is more easier to read and understand the credit history. I don't really like the payment history section that break down by each month for 3+ years, it makes the report too long and hard to read. I think it might be a good idea to show how the score changes by each quarter or by each year."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Dyer",
          "Nb_Reviews": 1,
          "Date": "2022-11-01T05:20:08.000Z",
          "Titre": "I could get a credit check quickly for…",
          "Contenu": "I could get a credit check quickly for tenant 1.  Tenant 2 had issues that sent here to TransUnion.  We never did figure out what that meant.Tried to change E-mail for Tenant 2, but the system would not let me change it a second time. (1st was to correct typo)Ultimately she had to  show me copies of her credit report another way."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "Landlord woman777",
          "Nb_Reviews": 1,
          "Date": "2020-07-14T20:35:14.000Z",
          "Titre": "It’s good",
          "Contenu": "I have been using the services for a while.I like the convenience of having everything in there such as the profile of my properties, tenants, rent payment, applications, tenant screening, documents etc. I wish the transfer of rent money to my bank Is quicker. The request for signature is convenient. I send lease to my tenants so they can sign electronically and I can sign electronically. It’s free and I love it. The customer service via Chat used to be there which I liked, but they don’t have it anymore. I have to leave a message and wait for a reply. I wish they brought the Chat back. Even the customer service over the phone is better too."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Barbara Herron",
          "Nb_Reviews": 1,
          "Date": "2021-01-31T01:15:38.000Z",
          "Titre": "Good not Excellent",
          "Contenu": "I would have given a 5 Star review except for 1 issue - i wanted a more thorough report but the website did not let me choose the plan I wanted - it just plugged in $28 and I couldn’t change it.  Otherwise happy with service, quick return etc."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Diane Sipe",
          "Nb_Reviews": 1,
          "Date": "2020-09-18T05:28:46.000Z",
          "Titre": "I ordered and paid for 3 credit…",
          "Contenu": "I ordered and paid for 3 credit reports.  Received the 2 from the parents but still have not received the 3rd one nor have I received a refund.  The 3rd report stated he had to upload additional information to you which he said he did, but bottom line...still have not received report."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "XNETRA MILLER",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T18:31:48.000Z",
          "Titre": "Great reports...improvement on CS responses needed",
          "Contenu": "It took quite a while to get a response back from customer service regarding several questions I had. I submitted questions on February 17 and didn't receive a returned response until March 29. That is an unrealistic timeframe when I'm working to verify potential tenants. With that being said, as I was working to create a specific report, an agent contacted me to chat about that and I used that opportunity to get my questions answered. Otherwise, it's been years since I have needed to verify tenants, so I do enjoy the all of the new changes."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marcelo Culqui",
          "Nb_Reviews": 1,
          "Date": "2020-09-27T18:34:45.000Z",
          "Titre": "Could not get in touch with a person…",
          "Contenu": "Could not get in touch with a person for help on a document.  Left a voice mail-message but until now nobody has called me back. Need improvement on this area.  Overall I'm satisfy with the service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eric Craft",
          "Nb_Reviews": 1,
          "Date": "2020-05-29T16:03:33.000Z",
          "Titre": "If it was fully integrated...",
          "Contenu": "if it was fully integrated ( ie. you could send applications,docs, and background checks through that channel instead of outside of it.) with Zillow and the like, it would be perfect.. still needs work there though. so 4 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cecil Hayes",
          "Nb_Reviews": 3,
          "Date": "2020-09-09T16:30:12.000Z",
          "Titre": "This is a Great source for what I am…",
          "Contenu": "This is a Great source for what I am trying to do with my rental home, 100% one stop shopping, The only thing negative that I can say is calling the \"support help line\" understanding because of this COVID 19 things are longer than usual, but I am also a 1st time customer and I have questions on all of the services that this company can provide and mainly how to continue to have my applicants applications continue through the whole process?  I have left my phone number and it takes a couple of days to receive a response and I am still waiting on another response at this time......  :-(  Other than that I LOVE IT!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Judy Jobin",
          "Nb_Reviews": 2,
          "Date": "2021-10-26T18:36:15.000Z",
          "Titre": "I am a Realtor and Use for my Lease Listings",
          "Contenu": "The sight is easy to use! I am a Realtor and only struggle with forwarding/sharing the Completed Reports to my Landlords. THX"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karla M.",
          "Nb_Reviews": 4,
          "Date": "2021-05-13T13:21:16.000Z",
          "Titre": "Overall",
          "Contenu": "Overall, I think the service is fine.I left 4 stars because there is always room for improvement."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bill Steagall",
          "Nb_Reviews": 1,
          "Date": "2021-07-19T13:25:37.000Z",
          "Titre": "im not sure",
          "Contenu": "im not sure, but it seems there is no way to send the results of a background check to the prospective tenant. am i right ?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Howard",
          "Nb_Reviews": 1,
          "Date": "2020-06-03T19:59:02.000Z",
          "Titre": "Experience was positive",
          "Contenu": "Experience was positive, only problem was tenant gave me wrong email and I was unaware until I inquired as to delay of results."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cecil Hayes",
          "Nb_Reviews": 3,
          "Date": "2022-11-03T22:40:31.000Z",
          "Titre": "The Plan and Help Desk personal of the…",
          "Contenu": "The Plan and Help Desk personal of the company.  When you need help and human voice will pick up the phone"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cecil Hayes",
          "Nb_Reviews": 3,
          "Date": "2021-11-02T19:51:14.000Z",
          "Titre": "Everything is great",
          "Contenu": "Everything is great, just the responce time when trying to talk with a human voice."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Yvette Ingram",
          "Nb_Reviews": 3,
          "Date": "2022-03-07T15:58:01.000Z",
          "Titre": "Very confusing on how to send applicant…",
          "Contenu": "Very confusing on how to send applicant copy of report-otherwise very pleased w/service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Appachan Ouseph",
          "Nb_Reviews": 2,
          "Date": "2020-12-03T04:10:04.000Z",
          "Titre": "Good to use",
          "Contenu": "Easy to use and flexible. Tenant have no complaint about using it"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Julie Mickow",
          "Nb_Reviews": 4,
          "Date": "2020-06-26T16:46:12.000Z",
          "Titre": "Helpful with all kinds of information…",
          "Contenu": "Helpful with all kinds of information and checking on new tenants"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mabel Chu",
          "Nb_Reviews": 1,
          "Date": "2022-04-05T16:12:18.000Z",
          "Titre": "It is a easy and fast way for me to get…",
          "Contenu": "It is a easy and fast way for me to get the credit and background check."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ladd Howell",
          "Nb_Reviews": 1,
          "Date": "2020-06-11T19:47:48.000Z",
          "Titre": "Fast",
          "Contenu": "Fast, but disappointed that the report relied on the Tenant's input for much of the credit information."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sam Williams",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T17:36:32.000Z",
          "Titre": "fast response to email inquiry"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amit Grover",
          "Nb_Reviews": 1,
          "Date": "2021-03-25T00:51:37.000Z",
          "Titre": "Like it!",
          "Contenu": "Great platform for landlords for screening tenants"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Appachan Ouseph",
          "Nb_Reviews": 2,
          "Date": "2022-05-13T16:32:10.000Z",
          "Titre": "Good for credit check",
          "Contenu": "Good for credit check. I am using last 10 yrs"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Abe Z.",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T16:43:20.000Z",
          "Titre": "Good communication tool",
          "Contenu": "Good communication tool. Doesn’t notify, though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Candia",
          "Nb_Reviews": 1,
          "Date": "2019-02-25T16:47:10.000Z",
          "Titre": "This was the first background check I…",
          "Contenu": "This was the first background check I conducted through Landlord Station. I was representing the Tenants. Wasn't clear if and how I would be notified when the reviews were completed but sure enough I was. I also thought that a summary page with the scope of the background check would be a sufficient report to share with landlord. Otherwise, it was easy, clear and the report run, thorough"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alice Sandiford",
          "Nb_Reviews": 1,
          "Date": "2017-09-14T21:56:50.000Z",
          "Titre": "Paying more for Less.",
          "Contenu": "I have been using Landlord Station since 2014.It is a wonderful tool for Landlords.  However I feel that the quality and thoroughness of the report was better back in 2014.  In fact it was more than a Credit Report. I got more for $22 per Tenant.  To get similar quality, It appears we have to pay over $35 per Tenant.I like the purchasing in bulk option.  I was able to screen more potential Tenants for this Unit."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Edward A Escobar",
          "Nb_Reviews": 2,
          "Date": "2019-01-16T18:05:23.000Z",
          "Titre": "When we use our complimentary credit…",
          "Contenu": "When we use our complimentary credit report it still asks me for my credit card info. That is really frustrating because I have to deal with identity fraud, so you can imagine the stress of having to put my info out there for something that is free. Your system should recognize if I don't need to pay to not ask for that info."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Trudy",
          "Nb_Reviews": 1,
          "Date": "2017-08-29T18:17:13.000Z",
          "Titre": "The only reason this isn't 5 stars is …",
          "Contenu": "The only reason this isn't 5 stars is because of the criminal records investigation. I received emails stating that my prospective tenants had erroneous criminal records. If you know it's erroneous then I shouldn't receive any notice. If you can't provide correct information because it's not tracked by SSN then you shouldn't offer the service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ryan Fowler",
          "Nb_Reviews": 1,
          "Date": "2017-06-20T16:32:39.000Z",
          "Titre": "Excellent and quick",
          "Contenu": "Excellent and quick.  The only thing that I would change would be tenant verification by phone and text option instead of by email/computer only.  This was an issue back in 2015, but Landlordstation.com may have changed it already.  There may be a security reason to use a tenant's computer and email, which would document their IP address, etc."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ramiro Solano",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T05:39:53.000Z",
          "Titre": "It dose bring out people to see the…",
          "Contenu": "It dose bring out people to see the place I have for rent."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sharon OGrady",
          "Nb_Reviews": 2,
          "Date": "2017-08-05T13:53:00.000Z",
          "Titre": "Glitch fixed quickly",
          "Contenu": "The initial link for the tenant response had a technical problem that didn't allow the authorization to proceed. The issue was reported and Laura responded quickly to let us know the issue was on their end and it got fixed quickly. Nice format to the report and comprehensive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Keith",
          "Nb_Reviews": 1,
          "Date": "2017-10-10T00:40:23.000Z",
          "Titre": "No notification of results",
          "Contenu": "I thought I'd receive an email stating the credit check had been completed.  When I didn't hear anything in a few days, I logged in and found the info was there.  Would be good to receive an update from LandlordStation  otherwise, no complaints."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cynthia McGee",
          "Nb_Reviews": 2,
          "Date": "2018-07-06T04:05:18.000Z",
          "Titre": "I like it but needs some work",
          "Contenu": "I really like the concept and everything it offers.  It's definitely making my life easier but it's not very user friendly.  Deleting things, adding things.  It feels bulky and just isn't even to use.  But overall I do like it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Elizabeth Anderson",
          "Nb_Reviews": 1,
          "Date": "2017-02-09T15:39:35.000Z",
          "Titre": "Quick and easy to use",
          "Contenu": "I love screening tenants on Landlord Station - it's very easy for tenants and myself to use.  The reports are in very fast.  However, my last person I screened told me he had a felony seven years ago, but it did not show up on the report."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Martin",
          "Nb_Reviews": 1,
          "Date": "2017-04-25T01:41:29.000Z",
          "Titre": "No complaints",
          "Contenu": "No complaints.  I found what I was looking for - a credit, tenant history and criminal background check which happened quickly.Of course I have no way of knowing whether or how thoroughly these checks were actually performed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eli Nikolova",
          "Nb_Reviews": 1,
          "Date": "2017-05-02T00:09:35.000Z",
          "Titre": "I like the easy screening process",
          "Contenu": "I like the easy screening process, the only recommendation is to have an option the tenant to pay for the screening at time of completion instead of the landlord. It will streamline the process for out of state applications."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Gallimore",
          "Nb_Reviews": 1,
          "Date": "2019-11-05T15:38:36.000Z",
          "Titre": "Pretty easy for tenants and landlords",
          "Contenu": "Pretty easy for tenants and landlords. only complaint was deciphering the results. I couldn't find any where in the help section to define some of the terminology in the reports."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kevin Ridlington",
          "Nb_Reviews": 1,
          "Date": "2017-07-13T03:06:38.000Z",
          "Titre": "I love the Landlord station",
          "Contenu": "I love the Landlord station, They just need to respond a little better if I click on for example looking for Homeowners insurance, don't get called back or I do like 3 or 4 days later.."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MA",
          "Nb_Reviews": 1,
          "Date": "2019-06-03T17:37:45.000Z",
          "Titre": "It is a pretty thorough report",
          "Contenu": "It is a pretty thorough report. The only thing I would recommend is that they make trying to understand the information and how to navigate through it more user friendly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "A seasoned real estate professional",
          "Nb_Reviews": 2,
          "Date": "2019-05-22T20:54:24.000Z",
          "Titre": "Too much information",
          "Contenu": "I would prefer that all the trade lines not be displayed.  Based on the algorithms for all that is used, a approval or non-approval is really all that's necessary."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carlyle P.",
          "Nb_Reviews": 1,
          "Date": "2017-03-21T19:51:42.000Z",
          "Titre": "Good service",
          "Contenu": "They are good however I had a situation were a tenant was accepted via landlordstation and the person had a criminal history which did not show up in the report."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robin Roberts",
          "Nb_Reviews": 1,
          "Date": "2017-02-08T20:33:31.000Z",
          "Titre": "Good",
          "Contenu": "Good service. Would be nice to have a phone number to contact rather than have to sit on the computer and type when you need help, OTHERWISE Good Service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patrick",
          "Nb_Reviews": 4,
          "Date": "2020-04-07T23:53:23.000Z",
          "Titre": "They've helped me screen and locate…",
          "Contenu": "They've helped me screen and locate tenants in the past before it was cool!I will continue to use them.Thanks, Landlord Station"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sam Nashed",
          "Nb_Reviews": 2,
          "Date": "2020-02-11T18:40:59.000Z",
          "Titre": "The Only issue is the report take…",
          "Contenu": "The Only issue is the report take longer time to be available especially in the weekend Other than that everything is fine Thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "E. E.",
          "Nb_Reviews": 1,
          "Date": "2017-06-19T17:55:52.000Z",
          "Titre": "Website is a little confusing in …",
          "Contenu": "Website is a little confusing in navigation.  Could be clearer for easier user access to product/services explanations and how to's."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Akt",
          "Nb_Reviews": 1,
          "Date": "2017-04-13T18:33:59.000Z",
          "Titre": "Great detailed reports on a timely …",
          "Contenu": "Great detailed reports on a timely manner!Slightly over priced! I've used them for years now as an owner of 5 rental properties !"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Edgar Flores",
          "Nb_Reviews": 1,
          "Date": "2021-04-30T19:05:33.000Z",
          "Titre": "Landlord Station",
          "Contenu": "Easy and quick service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sohail Mahboubian",
          "Nb_Reviews": 2,
          "Date": "2021-07-21T18:24:38.000Z",
          "Titre": "NO phone # to contact"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ralph Westerhoff",
          "Nb_Reviews": 2,
          "Date": "2017-02-18T03:55:49.000Z",
          "Titre": "Good for its purpose",
          "Contenu": "I find the new iteration easier to use. Now it's valuable. Also like the ability to buy bulk credit searches.0"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alexa",
          "Nb_Reviews": 1,
          "Date": "2019-01-10T19:09:27.000Z",
          "Titre": "Great service",
          "Contenu": "Great service! I Wish there was a way to send the link to myClients to pay for their report with my discount."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "R Hamm",
          "Nb_Reviews": 1,
          "Date": "2017-05-17T13:39:00.000Z",
          "Titre": "Quick & efficient service",
          "Contenu": "I received several contacts from my listing and I was able to respond quickly to each with little effort."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brenda Brummett",
          "Nb_Reviews": 5,
          "Date": "2017-06-08T17:08:29.000Z",
          "Titre": "Good turn around time",
          "Contenu": "Good turn around time.  One small blip related to the Tenant Insurance product but quickly rectified."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DOUG",
          "Nb_Reviews": 3,
          "Date": "2018-08-31T00:07:41.000Z",
          "Titre": "I use to screen prospective tenants…",
          "Contenu": "I use to screen prospective tenants every few years.  Smooth process and great information."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christopher Hofeditz",
          "Nb_Reviews": 1,
          "Date": "2019-06-05T23:29:56.000Z",
          "Titre": "I found the process simple and easy",
          "Contenu": "I found the process simple and easy.  The results were better than expected.  Good Job."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alan Wager",
          "Nb_Reviews": 1,
          "Date": "2018-04-08T13:05:29.000Z",
          "Titre": "I paid for a complete background check",
          "Contenu": "I paid for a complete background check, but did not receive any credit scores.  Why not?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Maria Calderon",
          "Nb_Reviews": 1,
          "Date": "2017-03-01T22:38:17.000Z",
          "Titre": "Easy to use",
          "Contenu": "It was easy and fast.  a little technical hiccup but it was solved effectively."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Hunter",
          "Nb_Reviews": 1,
          "Date": "2019-01-17T17:58:45.000Z",
          "Titre": "Good reporting in a short amount of…",
          "Contenu": "Good reporting in a short amount of time. Will continue to use your services"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kelly C",
          "Nb_Reviews": 1,
          "Date": "2017-07-11T16:24:19.000Z",
          "Titre": "We had some technical difficulties but …",
          "Contenu": "We had some technical difficulties but once that was resolved, it was great!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kathleen Schnitzer",
          "Nb_Reviews": 1,
          "Date": "2017-04-19T17:58:26.000Z",
          "Titre": "First Time User...Easy to Navigate.",
          "Contenu": "The online service was easy to navigate and the reporting time was quick."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JAMES RODGERS",
          "Nb_Reviews": 1,
          "Date": "2018-04-04T00:26:51.000Z",
          "Titre": "Landlord Station was helpful but a…",
          "Contenu": "Landlord Station was helpful but a little difficult to get answers from,"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John McGreevy",
          "Nb_Reviews": 2,
          "Date": "2017-06-28T00:00:15.000Z",
          "Titre": "as advertised",
          "Contenu": "as advertised. could use more explanation on criminal findings."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jodi Rock",
          "Nb_Reviews": 1,
          "Date": "2018-10-17T17:57:48.000Z",
          "Titre": "Will use them again!",
          "Contenu": "Resolved any issues I had right away. Will use them again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Susana Meza",
          "Nb_Reviews": 1,
          "Date": "2017-10-25T01:26:47.000Z",
          "Titre": "Excellent and reliable platform",
          "Contenu": "Easy to navigate website with prompt delivery of reports."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dave Borden",
          "Nb_Reviews": 1,
          "Date": "2017-04-30T13:40:26.000Z",
          "Titre": "Good",
          "Contenu": "Good. And decent no problems the realtor very nice person"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Glynis Shortes",
          "Nb_Reviews": 1,
          "Date": "2018-12-04T21:28:20.000Z",
          "Titre": "Quick return",
          "Contenu": "Quick return.  Doesn't seem to print very well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2017-02-10T02:55:19.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use. Interface could be slightly simpler."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Corina C",
          "Nb_Reviews": 1,
          "Date": "2017-10-04T17:15:18.000Z",
          "Titre": "Easy",
          "Contenu": "Easy to use to get a credit report on a tenant."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jay Thompson",
          "Nb_Reviews": 1,
          "Date": "2017-03-09T16:11:42.000Z",
          "Titre": "Fast and friendly",
          "Contenu": "😝 the perfect way to sign up for a home"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tressa Besserman",
          "Nb_Reviews": 1,
          "Date": "2017-03-09T20:43:25.000Z",
          "Titre": "Only use for background and credit checks for rental properties",
          "Contenu": "Very good turn around time on these reports."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "rl r",
          "Nb_Reviews": 2,
          "Date": "2017-03-21T14:22:23.000Z",
          "Titre": "Pricey",
          "Contenu": "Offers key info but can be very expensive"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tiberio Cardona",
          "Nb_Reviews": 1,
          "Date": "2018-11-13T16:28:17.000Z",
          "Titre": "Background check",
          "Contenu": "It was easy and convenient to used."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sharon Venzor",
          "Nb_Reviews": 1,
          "Date": "2017-06-04T11:34:30.000Z",
          "Titre": "Was a good experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Capital Square",
          "Nb_Reviews": 1,
          "Date": "2017-03-02T16:09:27.000Z",
          "Titre": "Landlord Background checks",
          "Contenu": "Easy and quick to use"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shanta Ugalat",
          "Nb_Reviews": 1,
          "Date": "2017-03-28T22:54:16.000Z",
          "Titre": "some times it is long time to get the report i am still waiting for the 23 report i put inl land lord station say completed the report which is not true still pending",
          "Contenu": "fairly it is good"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Julie Orona",
          "Nb_Reviews": 1,
          "Date": "2020-04-26T00:05:03.000Z",
          "Titre": "too expensive"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "sam",
          "Nb_Reviews": 2,
          "Date": "2017-07-11T17:49:50.000Z",
          "Titre": ".............."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "K Barnes",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T20:40:55.000Z",
          "Titre": "I've used LandlordStation for many…",
          "Contenu": "I've used LandlordStation for many years. Easy to use and very fast to return search formation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patty V",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T06:18:22.000Z",
          "Titre": "Great first experience!",
          "Contenu": "Easy to fill out the forms and quick report."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bobbi Burke",
          "Nb_Reviews": 3,
          "Date": "2023-12-06T16:29:51.000Z",
          "Titre": "LandlordStation makes screening an…",
          "Contenu": "LandlordStation makes screening an applicant so easy!  And the information received is extremely helpful in selecting a qualified tenant."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RON RONNEBERG",
          "Nb_Reviews": 4,
          "Date": "2023-11-25T05:23:19.000Z",
          "Titre": "I am happy LandlordStation is adding…",
          "Contenu": "I am happy LandlordStation is adding new features that make my tenant paperwork and communication easier and more efficient. I am happy with the prompt response I receive from LandlordStation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Cofield",
          "Nb_Reviews": 2,
          "Date": "2023-09-29T20:16:10.000Z",
          "Titre": "Great Background Check",
          "Contenu": "We have used Landlord Station for many years.  They handle their research quickly & efficiently.  They also get their return background check in a very timely manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ellen O'Connell",
          "Nb_Reviews": 1,
          "Date": "2022-10-31T01:17:59.000Z",
          "Titre": "Compred to another online background…",
          "Contenu": "Compred to another online background check which I don't  use, landlord station is detailed enough for me that it helps me feel comfortable with a new tenant. I require a trust trust relationship with my tenants. I tell them this after landlord systion has helped me accept them Being this is hard enough without continual problems from a tenant. I will NOT do business with the untrustable or irresponsibile. A peaceful community that does not make. That damages the reputation I have built and causes an unhealthy environment."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "alan pine",
          "Nb_Reviews": 2,
          "Date": "2021-03-15T03:18:30.000Z",
          "Titre": "Invaluable",
          "Contenu": "Invaluable. just wish there were a way to flag bad renters. We had a scam with a criminal neighbor trying to get our guest house to stash contraband.... but after we caught them, there was no way to report her and put other unsuspecting landlords on notice as to her criminal ways."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carol Baker",
          "Nb_Reviews": 3,
          "Date": "2021-05-31T17:59:47.000Z",
          "Titre": "I have used Landlord station for years.",
          "Contenu": "I have used Landlord station for years.  I think they are always looking for ways to improve.I like being able to customize my application for renters.  I like deciding when to send a credit check to prospective tenants.  I like how quickly they get back in the credit checks.I wish that the rent collection system were quicker."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RollTideTerp",
          "Nb_Reviews": 1,
          "Date": "2021-12-07T15:21:24.000Z",
          "Titre": "Have used Landlord Station on and off…",
          "Contenu": "Have used Landlord Station on and off whenever I need them to help me screen a new tenant.  Thankfully, because the screening is perfect to what degree I need, I haven't had to find too many replacement tenants! Much functionality, of which I don't even use, but am glad that it is there if I need it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "A in Arizona",
          "Nb_Reviews": 1,
          "Date": "2021-12-22T01:36:15.000Z",
          "Titre": "So Helpful for Landlords",
          "Contenu": "So helpful as a landlord, would definitely recommend and use again!  I've used them for years and find that doing manual verification myself is quicker, but I have the time to do that. The last report I ordered for just credit/criminal/eviction was back same day!  Thank you Landlord Station!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bobbi Burke",
          "Nb_Reviews": 3,
          "Date": "2021-11-13T03:33:34.000Z",
          "Titre": "I LOVE LandlordStation",
          "Contenu": "I LOVE LandlordStation!  It allows me NOT to have an applicant's SSN because that is incorporated into the applicant's part of the screening process.  Applicants pay the fee during the process so I don't have to pay for the reports then collect the fee.  The reports I receive are exactly what I'm looking for - payments history and criminal events.  I've used LandlordStation for 10 years and have no plans to change.  That's pretty amazing in today's fast-moving technoworld..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arlene Botton",
          "Nb_Reviews": 1,
          "Date": "2021-12-19T14:35:40.000Z",
          "Titre": "We have been using Landlord Station for…",
          "Contenu": "We have been using Landlord Station for years now. We have been happy with the credit, eviction, and background checks portion.  It's the most important part of our application process, and Landlord Station has made this process alot easier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robin H.",
          "Nb_Reviews": 1,
          "Date": "2021-04-08T12:56:45.000Z",
          "Titre": "Quick turnaround for comprehensive reports",
          "Contenu": "I've used your tenant screening service a few times years ago and it's still provides a quick turnaround which really helps me move the process along for prospective tenants. I like that the reports are comprehensive enough to help make the best tenant selection."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Kurt Higgins",
          "Nb_Reviews": 1,
          "Date": "2020-06-11T22:27:05.000Z",
          "Titre": "Overall a good experience",
          "Contenu": "I've used them for years and it's been very helpful managing my handful of rental units. Their support is good and I'm happy to see a feature I've wanted has just been released (having the option of the prospective tenant pay for a background check)."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Samaria Cartwright",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T17:47:09.000Z",
          "Titre": "What made my experience great with…",
          "Contenu": "What made my experience great with LandlordStation is the time in which my tenant screening was done. It was done in less than an hour. That is what I call excelling at service and exceeding expectation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alfonso Johnston",
          "Nb_Reviews": 3,
          "Date": "2021-01-06T20:01:16.000Z",
          "Titre": "I am a real estate agent and have used…",
          "Contenu": "I am a real estate agent and have used the Landlord Station for many years. They have always had fast service on reports and I'm happy with them. Also, once did I have a issue but, that was caused by my applicant. It was handled promptly by Landlord Station to correct the applicants error in filling out his form approval. The are great people to use in Credit Reporting."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan K.",
          "Nb_Reviews": 1,
          "Date": "2022-09-05T19:53:13.000Z",
          "Titre": "Easy way!         I gave landlord station a name and…",
          "Contenu": "I gave landlord station a name and email. Instructions to Bill tenant    I got results back in a couple days!  So easy!  Now I am assuming it’s accurate!Yes this saves me anxiety and grief of trying to get client info!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eugene Taylor",
          "Nb_Reviews": 2,
          "Date": "2021-08-27T19:31:03.000Z",
          "Titre": "These guys are really great",
          "Contenu": "These guys are really great.  Quick and efficient.  The new \"tenant pays\" option saves us having to meet with the tenants another time to collect the credit check fee.  Been using them for almost a decade!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "IJ Properties",
          "Nb_Reviews": 1,
          "Date": "2021-10-08T17:01:58.000Z",
          "Titre": "The service was fast",
          "Contenu": "The credit & background check service was fast. The customer service response to my questions was also fast and thorough. It would've been helpful if they would've provided a scoring range directly on the report in which to reference the resident score though."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debbie B. in Raleigh",
          "Nb_Reviews": 1,
          "Date": "2020-10-06T23:12:09.000Z",
          "Titre": "Longtime, faithful customer",
          "Contenu": "We have used LandlordStation.com since becoming landlords 8 years ago. I am always pleased with how thorough the background check has been. The color reports are easy to read and to share with applicants."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sungjin Kim",
          "Nb_Reviews": 2,
          "Date": "2022-02-17T19:01:28.000Z",
          "Titre": "Nice Customer Service",
          "Contenu": "I am traveling now outside of the States for a personal errand, When I needed to login for tenant screening, I could not login. I did contact customer service and found the reason bc I am outside of the States, I could fully understand the security issue at that time and the customer service unlocked my foreign ip. Now I could do the tenant screening. Thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Win Way Housing",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T01:32:02.000Z",
          "Titre": "Easy to use",
          "Contenu": "I have used landlord station for 10 years. It’s so simple and easy to follow the website. The support is responsive and always solve my problems."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Huizhen Zhao",
          "Nb_Reviews": 2,
          "Date": "2023-06-23T19:14:50.000Z",
          "Titre": "This is very user-friendly system",
          "Contenu": "This is very user-friendly system, easy to navigate and quickly get the results back. I have been used this for many year, and will recommend to anybody to do the screening."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Chang",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T23:56:24.000Z",
          "Titre": "Immediate response",
          "Contenu": "Immediate response. Alway available to help when there are questions. Needed orientation on how to use the app. The screening is very helpful with selecting a new tenant."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "B. Ortiz",
          "Nb_Reviews": 3,
          "Date": "2023-03-28T03:28:48.000Z",
          "Titre": "Landlordstation is reliable",
          "Contenu": "Landlordstation is reliable.  I can count on it to keep track of tenant applicant screenings.  The website is user friendly.  Customer service is also helpful when I need it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter Top",
          "Nb_Reviews": 2,
          "Date": "2023-11-24T05:44:50.000Z",
          "Titre": "Fast service",
          "Contenu": "Fast service . So far , I have one bad tenant that don't want to pay the rent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michele Werbeck",
          "Nb_Reviews": 4,
          "Date": "2022-04-01T14:49:25.000Z",
          "Titre": "A response from Landlord Station was…",
          "Contenu": "A response from Landlord Station was very quick. The potential tenant had incorrect emails and when this was corrected, the report was delivered.Thank you. Contract was signed and move in date is today."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charlene B",
          "Nb_Reviews": 3,
          "Date": "2022-03-07T14:05:40.000Z",
          "Titre": "Excellent service!!",
          "Contenu": "We have been using Landlord Station for many years and it has been and excellent source of information and has helped us make much more informed choices. I highly recommend using this service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George S",
          "Nb_Reviews": 7,
          "Date": "2021-01-11T18:27:22.000Z",
          "Titre": "I was unable to upload a pdf from my…",
          "Contenu": "I was unable to upload a pdf from my computer to LandlordStation. Virginia was able to help me by uploading the document on her end after I sent her a copy of the pdf. I was not able to sign my lease on my computer but was able to do so using my phone. Pharoll was also a big help to me in getting everything straightened out. Regards,George Sibert"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alan Parkhurst",
          "Nb_Reviews": 1,
          "Date": "2022-09-21T23:15:24.000Z",
          "Titre": "Happy with response",
          "Contenu": "Appreciate landlord station they seemed to be getting even better.  Actually got a phone call to resolve an issue that I was having trouble with. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elaine",
          "Nb_Reviews": 2,
          "Date": "2022-09-01T02:05:02.000Z",
          "Titre": "Couldn’t be happier",
          "Contenu": "This was my first experience and I’m very happy with the way everything went. It was straightforward and fast. I’ve struggled in the past with picking tenants. I feel much more confident with LandlordStation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hanif Jenkins",
          "Nb_Reviews": 1,
          "Date": "2021-11-03T17:23:47.000Z",
          "Titre": "I use landlord station to screen all of…",
          "Contenu": "I use landlord station to screen all of my tenants.  Their new streamline process return results FAST.  I highly recommend them to anyone needing a screening service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Monica Sims",
          "Nb_Reviews": 3,
          "Date": "2022-11-28T21:09:29.000Z",
          "Titre": "Nice and easy",
          "Contenu": "The Landlord Station system is very simple.  I use only the credit report system and I get quick responses from tenants.  The reports are easy to read and understand.  Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laura P.",
          "Nb_Reviews": 1,
          "Date": "2021-10-08T10:05:49.000Z",
          "Titre": "Happy with Service",
          "Contenu": "I have been using LandlordStation for 10 years.  The system is quick and easy to use. The report is thorough and the recommendations I receive are on point.  I will continue to use LandlordStation as I have had no issues since becoming a member."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sharon Nations",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T06:49:39.000Z",
          "Titre": "Prompt",
          "Contenu": "Prompt, thorough service time after time.  I have used this credit check service for many years and always get food service and reliable results."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terri Barrett",
          "Nb_Reviews": 1,
          "Date": "2021-04-14T16:52:12.000Z",
          "Titre": "A must for every Realtor",
          "Contenu": "I am a fan. This service is a very appreciated tool as it will not only pull credit, but also background and any former evictions. Knowing that a background would be pulled, I had a few applicants decline this checkpoint and therefore the landlord was able to move to the next applicant knowing that the first likely had something to hide. As an agent, I am unable to pull credit and this allows the tenant to pay direct so you know you are dealing with someone who is truly interested and able to get a clear picture of the applicants background. My landlord was impressed as were the tenants on how easy and quickly the service assisted us all. The end result is easy to read and gives a recommendation with a green/yellow/red recommendation similar to a green light, yellow light or red stoplight. Highly, highly recommended.  Thank you Landlord Station, I will continue to utilize your service each time I represent a landlord (or tenant)."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ANGELA BIGHAM",
          "Nb_Reviews": 1,
          "Date": "2021-07-05T22:34:51.000Z",
          "Titre": "Great Fast service",
          "Contenu": "I needed a credit and background check quickly on this holiday weekend and I got a response back within the hour. It took me a while to learn how to Maneuver through the report. Other than that it looked great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vera Schneider",
          "Nb_Reviews": 2,
          "Date": "2021-08-12T15:53:45.000Z",
          "Titre": "Great service for quick and reliable credit scores",
          "Contenu": "I’ve only used the Tenant Screening feature (credit check) but it is great. I really like the new feature to have the tenant pay directly for credit check.  All you need is name and email! Better for landlord and tenant. Highly highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charlie Castillo",
          "Nb_Reviews": 1,
          "Date": "2022-03-07T01:24:32.000Z",
          "Titre": "Screen machine",
          "Contenu": "I requested two background checks for potential tenants and the process was quick, easy and simple.  Would be great if you could improve on pricing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Polina Sherman",
          "Nb_Reviews": 1,
          "Date": "2022-03-15T04:34:31.000Z",
          "Titre": "The best service",
          "Contenu": "I have been using the landlord station for many years. Very efficient, quick response. Big help in selecting the best tenant. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Reginald Berry",
          "Nb_Reviews": 4,
          "Date": "2022-04-28T15:43:27.672Z",
          "Titre": "Landlord Station's services are…",
          "Contenu": "Landlord Station's services are excellent! The background reports that I received as part of tenant screening were thorough, comprehensive for the areas requested and delivered very fast. They allowed me to successfully screen and approve a long-distance tenant with ease and a sense of comfort."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leslie Brennan",
          "Nb_Reviews": 2,
          "Date": "2021-05-15T15:16:39.000Z",
          "Titre": "Screening made easy",
          "Contenu": "Landlordstation.com has been a great tool in vetting potential tenants. I have used it for 8 years now and it us my go to. Very easy to use. Now that the tenant can pay them directly fir screening it us even better. I highly recommend it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kendall Vela",
          "Nb_Reviews": 2,
          "Date": "2022-08-03T02:04:23.000Z",
          "Titre": "Great Service!",
          "Contenu": "I have relied on LandlordStation to conduct my renter background and credit checks for almost 10 years.  This service is easy to use and reliable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JOSE martelet",
          "Nb_Reviews": 2,
          "Date": "2022-05-23T19:28:30.000Z",
          "Titre": "My Experience with Landlord Station has…",
          "Contenu": "My Experience with Landlord Station has always been a Piece of Maind and Confidence.Thank you for being there for me with me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Landfall Properties LLC",
          "Nb_Reviews": 4,
          "Date": "2022-02-06T18:02:27.000Z",
          "Titre": "good option for credit and background checks",
          "Contenu": "I have used Landlord Station for background checks for tenants fir a while now.Maybe not the cheapest, but a good option and lots of choices for reports and fee points."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MARIE LOPRESTO",
          "Nb_Reviews": 1,
          "Date": "2021-06-18T06:05:03.000Z",
          "Titre": "Using your system was quick and easy",
          "Contenu": "Using your system was quick and easy.  I was a bit rusty and when I asked a question for assistance your staff got back to me quickly. I appreciate this program."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julie Mickow",
          "Nb_Reviews": 4,
          "Date": "2022-09-23T18:39:13.000Z",
          "Titre": "Landlord Station is easy to use",
          "Contenu": "Landlord Station is easy to use, has all the features needed to take care of business with my rental properties."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adam Bernard",
          "Nb_Reviews": 1,
          "Date": "2022-10-03T16:10:27.000Z",
          "Titre": "I meant with a very sweet family on…",
          "Contenu": "I meant with a very sweet family on October 1st at 1:50 bridge Ave she laid all  the rules and regulations"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dee",
          "Nb_Reviews": 2,
          "Date": "2023-03-12T06:50:26.000Z",
          "Titre": "they always answer my questions and get…",
          "Contenu": "they always answer my questions and get the results I need.Ive been with Landlord Station for years and I still love their service.Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rey Valentin",
          "Nb_Reviews": 1,
          "Date": "2020-07-30T15:50:48.000Z",
          "Titre": "Fast and reliable system-service",
          "Contenu": "Fast and reliable system-service. Very intuitive to use. I am glad I discovered it; because a previous system-service was I used did not delivered.Thank you;RV"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cindy Bryant",
          "Nb_Reviews": 4,
          "Date": "2022-01-11T18:40:07.000Z",
          "Titre": "I really like Landlord Station",
          "Contenu": "I really like Landlord Station.  However, I miss the part where you recommend whether to rent to that person or not."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dwayne Hooper",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T22:30:38.000Z",
          "Titre": "Convenient",
          "Contenu": "This was quick and easy for my use. I  will definitely continue to use it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leslie Brennan",
          "Nb_Reviews": 2,
          "Date": "2022-11-17T21:00:56.000Z",
          "Titre": "So easy!!",
          "Contenu": "I like choosing where my credit reports come from. It’s so simple to use! It’s an easy way to check credit and have my tenant pay directly!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janice Burke",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T17:57:45.000Z",
          "Titre": "The report gives enough detail for a…",
          "Contenu": "The report gives enough detail for a landlord to make a decision on the prespective tenant."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "K Barnes",
          "Nb_Reviews": 2,
          "Date": "2022-03-13T05:49:53.000Z",
          "Titre": "Easy to use!",
          "Contenu": "Easy to use. Fast and thorough. I have used landlordstation.com for many years. I highly recommend their service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sebastian Mekkadath",
          "Nb_Reviews": 2,
          "Date": "2022-05-24T21:25:37.000Z",
          "Titre": "I had the fortune to work with Pharoll…",
          "Contenu": "I had the fortune to work with Pharoll Baker; he was prompt, courteous, and was on top of things.  Thanks to Pharoll, the process went pretty smooth."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patricia Waltman",
          "Nb_Reviews": 1,
          "Date": "2020-11-02T17:14:32.000Z",
          "Titre": "I dont use it often because I dont have…",
          "Contenu": "I dont use it often because I dont have a big turn over. Landlord station is allways available to help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bruce Speth",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T18:31:06.000Z",
          "Titre": "Good experience with everything I have…",
          "Contenu": "Good experience with everything I have completed.  Quick response with help on site."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Craig",
          "Nb_Reviews": 4,
          "Date": "2023-07-02T18:38:43.000Z",
          "Titre": "My problem was addressed quickly",
          "Contenu": "My problem was addressed quickly and I received the answers I was asking about."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-10-04T14:20:00.000Z",
          "Titre": "The prospective tenant provided an…",
          "Contenu": "The prospective tenant provided an incorrect address, Landlord Station not only  fixed the problem but also the gentleman helping me stayed on the line with me for quite a while until the tenant gave me a response."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amanda Ponce",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T15:31:28.000Z",
          "Titre": "Easy to navigate and use",
          "Contenu": "Easy to navigate and use. I like the option to pay or have the applicant pay for their report."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Espinosa",
          "Nb_Reviews": 1,
          "Date": "2021-08-20T00:03:18.000Z",
          "Titre": "I enjoy using landlord station and it's…",
          "Contenu": "I enjoy using landlord station and it's affordable, there's is always room for improvement but overall is a good user friendly system..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Antoine DuBose",
          "Nb_Reviews": 1,
          "Date": "2021-11-20T13:53:33.000Z",
          "Titre": "I like Landlordstation.com",
          "Contenu": "I like Landlordstation.com! It helps keep our properties, tenants and prospective tenants in one organized place."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gisela Deen",
          "Nb_Reviews": 1,
          "Date": "2023-04-14T15:19:28.000Z",
          "Titre": "Customer service was very helpful and prompt and efficient in helping me sorting things out.in",
          "Contenu": "Customer service was very helpful and prompt and efficient in helping me sorting things out"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yana Zidarov",
          "Nb_Reviews": 1,
          "Date": "2021-01-04T18:34:54.000Z",
          "Titre": "Easy and fast",
          "Contenu": "Easy to open an account, easy to request report, easy to receive the report with recommendations. thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Allen",
          "Nb_Reviews": 2,
          "Date": "2023-08-22T16:27:14.000Z",
          "Titre": "Long time customer",
          "Contenu": "Long time customer.  Really like their service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alan Cheung",
          "Nb_Reviews": 1,
          "Date": "2020-05-26T23:49:13.000Z",
          "Titre": "The website is very user friendly",
          "Contenu": "The website is very user friendly, but there is still some area needs to improve for organizing and grouping tenants into different properties."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erika Meyer",
          "Nb_Reviews": 1,
          "Date": "2021-06-29T21:16:24.000Z",
          "Titre": "This is a fantastic tool to qualify the…",
          "Contenu": "This is a fantastic tool to qualify the tenant. I am always referring landlords and others to this website."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T23:10:42.000Z",
          "Titre": "Works for me !",
          "Contenu": "Fast, efficient and reasonably priced, Works for me !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dwight Richards",
          "Nb_Reviews": 1,
          "Date": "2023-07-29T03:01:25.000Z",
          "Titre": "Easy to use",
          "Contenu": "Ease of use is awesome and turn around time could not be better."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-09-02T01:02:11.000Z",
          "Titre": "They have always handled my rental…",
          "Contenu": "They have always handled my rental needs professionally and I have enjoyed using their services."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jamie Varin",
          "Nb_Reviews": 1,
          "Date": "2021-10-11T16:53:40.000Z",
          "Titre": "Very easy way to get a credit check on…",
          "Contenu": "Very easy way to get a credit check on a prospective tenant."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "tatiana camargo",
          "Nb_Reviews": 1,
          "Date": "2022-03-02T15:31:46.000Z",
          "Titre": "Great service very straightforward",
          "Contenu": "Great service very straightforward , user friendly and great turn around time !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RODRIGO MUNGUIA",
          "Nb_Reviews": 3,
          "Date": "2021-09-26T17:47:09.000Z",
          "Titre": "Background checks",
          "Contenu": "Fast and confidential for the client and our company, we live it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LH",
          "Nb_Reviews": 1,
          "Date": "2022-06-16T18:50:43.000Z",
          "Titre": "Great customer service",
          "Contenu": "Landlord Station is a great company. Their online options are great, including creating a rental application and ability to download it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barbara Cerra",
          "Nb_Reviews": 2,
          "Date": "2021-04-07T12:18:04.000Z",
          "Titre": "Excellent Background Check Platform",
          "Contenu": "I always trust Landlord Station for all my prospective tenants. Very reliable, accurate and fast!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lorraine Martin",
          "Nb_Reviews": 2,
          "Date": "2020-06-27T03:22:17.000Z",
          "Titre": "It was very easy to use your website",
          "Contenu": "It was very easy to use your website. The tenant report that we ordered was delivered very quickly to us. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Victor Newman",
          "Nb_Reviews": 1,
          "Date": "2022-05-08T15:53:57.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service; received tenant background & credit checks within one day allowing me to determine if they met the standards to be approved."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eloisa",
          "Nb_Reviews": 1,
          "Date": "2022-02-13T18:36:55.000Z",
          "Titre": "It was very easy to use and got my…",
          "Contenu": "It was very easy to use and got my tenants results within seconds!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rebecca Nolette",
          "Nb_Reviews": 3,
          "Date": "2021-02-24T18:07:00.000Z",
          "Titre": "Fantastic",
          "Contenu": "Fantastic, user friendly site.  Quick and effective tool!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 2,
          "Date": "2023-04-13T21:38:34.000Z",
          "Titre": "Super fast reports!!!",
          "Contenu": "Super fast reports!!!Received it within minutes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "kgrant",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T17:17:34.000Z",
          "Titre": "tenant verification",
          "Contenu": "The website is user friendly for both landlord and tenant"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angelica Cardonne",
          "Nb_Reviews": 2,
          "Date": "2022-02-17T18:17:18.000Z",
          "Titre": "Excellente job",
          "Contenu": "Excellente job. It's very easy and so fast process for my and my clients. Thank you so much"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jacquelin Fiallo Negrin",
          "Nb_Reviews": 2,
          "Date": "2021-01-30T23:01:32.000Z",
          "Titre": "Amazing",
          "Contenu": "Amazing this tool it’s a perfect way to help our clients"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alejandra Folch",
          "Nb_Reviews": 2,
          "Date": "2022-10-31T02:08:18.000Z",
          "Titre": "Excelente.",
          "Contenu": "You can make a complete and quick screening of the tenants."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JC Vega",
          "Nb_Reviews": 3,
          "Date": "2022-08-22T21:59:48.000Z",
          "Titre": "It was a great experience and easy to…",
          "Contenu": "It was a great experience and easy to navigate thru it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terri Raridon",
          "Nb_Reviews": 2,
          "Date": "2022-02-15T15:48:14.000Z",
          "Titre": "Easy to Use",
          "Contenu": "Easy to use, gets me the information I need at a fair price/"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vik Malani",
          "Nb_Reviews": 1,
          "Date": "2022-10-07T17:06:07.000Z",
          "Titre": "Easy to use application",
          "Contenu": "Easy to use application, good service on phone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debra Eberhart",
          "Nb_Reviews": 1,
          "Date": "2021-10-01T15:30:05.000Z",
          "Titre": "I've used Landlord Station for over 10…",
          "Contenu": "I've used Landlord Station for over 10 years. They are easy to use and thorough."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rodolfo Zolezzi",
          "Nb_Reviews": 2,
          "Date": "2021-10-18T05:03:24.000Z",
          "Titre": "Quick and easy I love it always useful…",
          "Contenu": "Quick and easy I love it always useful for my business"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Philip Hsiau",
          "Nb_Reviews": 1,
          "Date": "2022-10-26T17:14:08.000Z",
          "Titre": "It is a trust and responsive service…",
          "Contenu": "It is a trust and responsive service all the times."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "HF",
          "Nb_Reviews": 1,
          "Date": "2021-10-10T18:42:33.000Z",
          "Titre": "Tenant Screening",
          "Contenu": "The process is fast and smooth as long as the tenant(s) want to be screened."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill Mitchell",
          "Nb_Reviews": 1,
          "Date": "2021-04-20T13:18:02.000Z",
          "Titre": "Quick & EZ",
          "Contenu": "Quick & EZThey keep adding features.Just used the new Tenant Pay feature!Great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "K I",
          "Nb_Reviews": 3,
          "Date": "2023-03-26T21:40:22.000Z",
          "Titre": "Must use for any landlord",
          "Contenu": "The service is so easy to use, dependable and quick. Makes everything so easy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janet Basellyous",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T20:55:14.000Z",
          "Titre": "Very fast in sending the results",
          "Contenu": "Very fast in sending the results. The website is friendly use"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alton Smith",
          "Nb_Reviews": 1,
          "Date": "2022-06-20T01:55:52.000Z",
          "Titre": "Able to get background checks completed…",
          "Contenu": "Able to get background checks completed in less than 1 hour."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stacey Schwartz",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T22:03:11.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use, quick turnaround time. Very helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jesus Colina",
          "Nb_Reviews": 1,
          "Date": "2021-11-24T06:23:56.000Z",
          "Titre": "Great tool to use",
          "Contenu": "Great tool to use, easy fast efficient very happy about it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Glodowski Paul",
          "Nb_Reviews": 1,
          "Date": "2022-04-05T16:12:35.000Z",
          "Titre": "Always reliable and very easy to use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michelle E",
          "Nb_Reviews": 1,
          "Date": "2022-07-11T03:52:09.000Z",
          "Titre": "Wonderful!",
          "Contenu": "User Friendly and quick response time when I had questions."
        }
      ]
    }
  ]
}