{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.identityforce.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "KayCee",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T20:48:23.000Z",
          "Titre": "30 day free trial, SCAM",
          "Contenu": "Signed up for a 30 day free trial, but woke up the next day to find out I had been charged for a month of the service. My bank account is now overdrawn thanks to this scam of a business.EDIT: Called customer service and was promised that the billing department would call me back that afternoon. I haven’t heard from them at all. The customer service agent said that it was probably just a 24hr authorization hold and would go away, but it’s been over 48hr and it’s still there. Do not trust this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "LD",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T14:17:07.000Z",
          "Titre": "Identity Force NOT worth the money",
          "Contenu": "I found out my phone number was on the dark net through another protection service. We were getting calls and texts regarding this breech. When I called IF I was told they did not catch this and could not tell me why. Will not renew this service, going with a reliable co."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michelle Thompson",
          "Nb_Reviews": 1,
          "Date": "2022-08-28T10:21:48.000Z",
          "Titre": "Please beware",
          "Contenu": "Please beware, you are billed yearly and the service is difficult to cancel with this company. I did not want to renew as I subscribe to identity monitoring under a different company. You are not provided FICO scores but Vantage scores which lenders do not use. A representative called me and I told them I did not want to renew but 2 weeks later and I got charged. This plan is active until the \"next billing cycle\" which is yearly."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dolores Bailey",
          "Nb_Reviews": 3,
          "Date": "2019-08-27T16:15:06.000Z",
          "Titre": "Not impressed with this company.",
          "Contenu": "Not impressed with this company. The customer service individuals you speak to are useless, and have little knowledge of how to resolve your issues with canned responses. Took 6 months to be notified of an email breach. However receive weekly notices about sex offenders in our area, which by the way are of public record on our local sheriff's website free of charge. Our credit reporting information says it is updated monthly and has yet to be updated in the last 8 months. Not a company I feel confident in to protect my identity."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "SSG M",
          "Nb_Reviews": 2,
          "Date": "2019-02-05T17:55:22.000Z",
          "Titre": "Identity stolen 3 times with IdentifyForce coverage.",
          "Contenu": "My identity was stolen 3 times during the time I had IndentityForce coverage and IdentityForce never alerted me to any of them.  I also had all of my accounts set to alert me to any purchases over $200 and any time my credit was pulled.  I was rarely alerted to any purchases over $200.  I made multiple large purchases over $1000 which IdentityForce never caught.  I even took out a loan for $22,000 which IdentityForce didn't catch until 5 weeks later.  I'm confident that this service is one of the worst available as they have proven that they are not actively motoring anything.   Spend your money elsewhere."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Adam Babish",
          "Nb_Reviews": 1,
          "Date": "2018-10-30T16:42:53.000Z",
          "Titre": "I tried to cancel a reoccurring…",
          "Contenu": "I tried to cancel a reoccurring subscription. It was basically impossible to do so per the agents I spoke with. I had to file a dispute with my credit card company. One agent's suggestion was that I cancel my card so they would stop billing me. Multiple agents were unhelpful or condescending and the manager was always out of the office or at lunch when I asked for her."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Debra Longnecker",
          "Nb_Reviews": 2,
          "Date": "2022-08-30T17:44:11.000Z",
          "Titre": "You get what you pay for",
          "Contenu": "I have had no information or help in working with this product. Since it’s a free resource, having had a recent security breach, I guess I shouldn’t complain. But the adage “You get what you pay for” is true."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bob",
          "Nb_Reviews": 1,
          "Date": "2021-12-08T19:18:35.000Z",
          "Titre": "Had Identity Force less than a year…",
          "Contenu": "Had Identity Force less than a year and cancelled.  Customer service is suspect.  They say they’ll check into trouble and contact you back, but after 4 calls to customer service they did not cure the problem and NEVER received a callback.FYI:  It you use any other browser than Chrome or MS Edge, you may have trouble.  I use Safari or Brave for my secure browser and I was told that there product does not work with either of those browsers.  I couldn't get transaction monitoring for the last 4 months and was unable to add accounts.  I paid for what?No refund offered and would never recommend this company, in fact, they cancelled my account after telling me that I would have to cancel it.Go somewhere else for protection."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Chalk",
          "Nb_Reviews": 5,
          "Date": "2022-06-15T16:00:13.000Z",
          "Titre": "Very poor performance",
          "Contenu": "It's June 15th, 2022, and I haven't had a single alert from IdentityForce since October of 2021 although I keep receiving constant reminders of seminars from them. I have their best plan however, I've had three attempts by unknown individuals trying to open credit cards in my name this year alone. I don't need seminars, what I need is protection and I'm not getting it. They are very efficient in charging my credit card on time, however, They really have no effect when it comes to protecting my identity. I canceled my membership today however, they refused to refund the bulk of my payment. The customer service rep told me when I called that she would refer me to a specialist that would call me within the hour. That was four hours ago and still no call. I am filing a complaint with the Better Business Bureau and a fraud case with the credit card company. Be aware that this company is excellent at taking your money and not much else."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-08T02:40:31.000Z",
          "Titre": "I canceled this membership",
          "Contenu": "I canceled this membership, well at least I thought I did but they are still taking money monthly"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 1,
          "Date": "2022-10-15T18:08:58.000Z",
          "Titre": "very poor service",
          "Contenu": "I sent a message on Fri, Sep 23 at 11:56 AM & I didn't get a response.    That is why I rate it horrible."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bob Niles",
          "Nb_Reviews": 2,
          "Date": "2021-09-14T21:02:43.000Z",
          "Titre": "3 Days and I had to Cancel",
          "Contenu": "On Friday, 9/10 I bought the Indentity Force Credit Secure Plus for my family.  I received the activation email and when I tried to set up my account it failed.  I called Identity Force for technical support and all I was told is that there is no support available and they would put in a ticket.  Being rather upset that an online company had no technical support and that I had to wait for a call 30 minutes after purchasing the product I called to cancel.  The customer service rep could only create a ticket.  So less than 3 hours after purchasing a service that I could not access or get support for I had to wait for my refund to be processed by a separate rep.  On Sunday, 9/12 I got a call from a very nice young lady, who tried to help me get logged in.  The first time it failed and with no support the best she could do is cancel and try to create a new account.  We tried again for the second time to log in and it failed.  The best this young lady could offer was to either open a ticket for tech support or cancel.  I chose to cancel.  She told me a platform migration was happening and that glitches were occurring, which I understand.  However, to have no technical support for your product during a migration and known issues is mind numbing and just horrible for the customer and the rep.  Shame on this company for the way they run an online system and the fact there is zero technical support beyond waiting for a call.  I know nothing will change, but if I can't get through the basic account activation, what makes me think you can protect my family and I along with our data.9/14 - As you see by the response from Identity Force, they admit they are openly overwhelmed and the a world class experience is just buzz word.  What would my coming back do if I can't get logged in or technical support is overwhelmed.  I see nothing here to make me want to return as you've offered nothing other than excuses."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "rairmac",
          "Nb_Reviews": 6,
          "Date": "2022-01-14T02:00:00.000Z",
          "Titre": "Don't expect quick resolution assistance",
          "Contenu": "I was a multi-year subscriber to IdentityForce service, and was satisfied with its monitoring and reporting.  While reporting is useful, the primary reason for having the service was to get a rapid response and assistance to understand and resolve a breach or other security-related issue. That type of support tops every other product benefit, because there's no point being alerted to a credit-related or identity-related problem if assistance is not readily available.  Thus the low score.When I called to follow up on an alert about my primary credit card, the agent told me she would send the matter to someone who would respond by phone within 24 to 48 hours.I was shocked that I had to await a phone call for as long as 2 days for details about the problem and how to resolve it, so I made certain I understood what she was saying.  When that process was confirmed, I asked to speak to a supervisor or directed to another phone number.  She said the number I had dialed was the only process available, my only option was to wait for a call.That same day I enrolled in an another identity monitoring service.If you expect to receive prompt assistance for an identity-related problem I recommend searching for a company that actually cares as much about assisting its customers, as it does touting its services in its advertising.  After enrolling I have called my new service numerous times for assistance.   Each time, their 800 number has been answered immediately or within 2 minutes, with US-based agents who are extremely helpful and courteous. I waited awhile to post this review because I didn't want to overreact. I'm doing it because I think the issue is important enough to share my experience with others."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Raymond and Kelly Hirth",
          "Nb_Reviews": 2,
          "Date": "2021-08-08T17:38:46.000Z",
          "Titre": "I signed up with Identity Force a…",
          "Contenu": "I signed up with Identity Force a couple of weeks ago, so far it has been pure frustration I was adding accounts into my identity vault I could not add 2 accounts even though that were in their database, I called I was informed that in 24 hours that a tech specialist would give me a call to fix the problem, I received a call the next day from a employee the same level has the previous employee I explained to her I was informed you were going to be a tech to fix the problem more frustration she was going to escalate this to her supervisor. it has been over two weeks and the problem is still not fixed I am paying for a service I can not fully utilize. instead of going to one place for all my transactions I have to go to 3 different places for all my transactions I am wasting my money at this point extremely  disappointed with this ccompany."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Yonosko",
          "Nb_Reviews": 1,
          "Date": "2018-04-13T18:04:06.000Z",
          "Titre": "Received notification of new inquiry",
          "Contenu": "Received notification of new inquiry.  Went to my dashboard, received authentication code which I used, but when Alerts page listed I was unable to access details.  Continued to receive bar notice at the bottom \"To access your credit services, you must complete authentication\" - which I had already done.  The \"Alert\" box continues to show circling shape for over 5 minutes and nothing.  Frustrating experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joseph M Feyti",
          "Nb_Reviews": 2,
          "Date": "2017-09-26T16:35:31.000Z",
          "Titre": "This company is a fraud",
          "Contenu": "This company is a fraud. They say they're looking for fraud but they don't do it it's just your identity they are not there to protect you or let you know or help you out if someone grabs your credit card or your data. Beware be very very aware.  If you call customer service you're going to be on the phone for an hour and a callback to be hours after that if you leave your number."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jef",
          "Nb_Reviews": 1,
          "Date": "2017-09-20T22:27:38.000Z",
          "Titre": "Can't Cancel!",
          "Contenu": "Same problem as everyone else! I can't cancel my membership! Signed up under the free trial, but this is shady. I understand there's a breach, but if you don't have the customer support staff to be able to sufficiently support your product, you won't last as a business. I've emailed, called, been on hold, tried the call back option, and I've gotten nothing. This is a joke."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rhonda",
          "Nb_Reviews": 2,
          "Date": "2017-09-18T18:13:43.000Z",
          "Titre": "No one answers the phone",
          "Contenu": "No one answers the phone, even after holding for over an hour.  No one calls back if you press #1 or if you press # 2 to cancel the service.  I have emailed, but am unsure as to whether the service will be canceled due to the lack of (or non-existent) customer service.Idenity Force  has sent me numerous notifications and has my email address from the email I sent to them so they should have a record of me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dieter",
          "Nb_Reviews": 3,
          "Date": "2017-09-19T19:15:38.000Z",
          "Titre": "After signing up",
          "Contenu": "After signing up, I was tricked as a added family and updating personal information, they hit me with a double fee where other companies only charge additional $10, these guys doubled up and have no means of canceling at allIn followup, answer below is not correct and nothing was done to satisfy me. It's a typical response. If they really care, they would post upfront single and family prices.  So watch out."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Barbra A Galen",
          "Nb_Reviews": 1,
          "Date": "2018-03-14T22:13:33.000Z",
          "Titre": "1 . Dismal",
          "Contenu": "1. Your alerts are not explicit- I have to call support to figure out what the alerts mean and then they can't answer my questions. 2. Why on earth would I give you my log-in to my credit card, banking, and mortgage companies? I am already a victim of id theft!!!!  I give this information to no one.  Should you not just ask for the account numbers?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Melanie Mumma",
          "Nb_Reviews": 3,
          "Date": "2017-05-10T23:53:53.000Z",
          "Titre": "Do not subscribe",
          "Contenu": "Initially, I was impressed with the service only to learn that I am NOT receiving my FICO scores on a quarterly basis but some OTHER calculation that leaves me exposed to being denied credit and armed with garbage when I go about pursuing rental properties. Not a few points but nearly 100 point variance is not remotely acceptable. Would never renew or endorse IdentityForce"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kellie Mullins",
          "Nb_Reviews": 1,
          "Date": "2017-09-19T17:33:10.000Z",
          "Titre": "I have sent numerous emails and called …",
          "Contenu": "I have sent numerous emails and called numerous times being forced to leave a call back number but never receiving a return call. CANCEL MY ACCOUNT. My credit card should not be charged as I am still within the free trial period. I will be putting a hold on my card against Identity Force and if you try to charge my card I will submit a BBB claim. AGAIN, CANCEL MY ACCOUNT AND SEND A CONFIRMATION TO MY EMAIL THAT IT HAS BEEN CANCELLED."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Craig Whatley",
          "Nb_Reviews": 1,
          "Date": "2017-04-02T02:28:47.000Z",
          "Titre": "The simulator is extremely faulty and …",
          "Contenu": "The simulator is extremely faulty and not giving good results especially when you pick a combination of things. I put in declare bankruptcy along with several other items and the score didn't even drop at all. This is quite a disappointment as I have used other simulators from similar sites that worked reasonably well. Not sure if I can continue to use this site because this one of the reasons I signed up for an account."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "CustomerKC",
          "Nb_Reviews": 2,
          "Date": "2017-04-12T00:59:32.000Z",
          "Titre": "Sorry to see you are shooting yourself …",
          "Contenu": "Sorry to see you are shooting yourself in the foot with eliminating members ability to obtain their monthly credit score.  Every 3 months doesn't get it done for me so I will not be renewing my account when it terminates.  Have already cancelled the auto renewal.  Bad timing on your part when most credit card companies now offer a gratis credit score.  Hope your decision costs you lots of customers and you go out of business."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MEH of NJ",
          "Nb_Reviews": 1,
          "Date": "2017-08-14T22:26:30.000Z",
          "Titre": "When I originally started this service …",
          "Contenu": "When I originally started this service I added many cards I had and now they are no longer showing up on here..  To add an account is very difficult and I have not been successful in any attempt.  When I get an alert from you it is about 5 days after the transaction.  What good is that??I am seriously considering cancelling and finding another company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Courtney Potter",
          "Nb_Reviews": 1,
          "Date": "2017-06-17T11:47:33.000Z",
          "Titre": "The sign up was very deceptive",
          "Contenu": "The sign up was very deceptive. I was able to add my spouse so it seemed as if the price for both of us was $200 a year but then when I entered the account it seemed as if his name had never been added and then it was updating the change to $400. Just be upfront with the cost so I can make an informed decision. I am planning on cancelling my account today."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Frustrated member",
          "Nb_Reviews": 1,
          "Date": "2017-10-08T17:41:59.000Z",
          "Titre": "I have been a member for about 2 hours",
          "Contenu": "I have been a member for about 2 hours.  I signed up and couldn't get the verification to work for my credit reports.  I have no problem verifying my credit reports w/ the credit bureau, but Identity Force rejected my verification.  I've been on hold for 1 hour and 20 minutes trying to talk to someone.  Very disappointed and frustrated."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Conover",
          "Nb_Reviews": 2,
          "Date": "2018-02-11T23:05:16.000Z",
          "Titre": "No help. No return call from support.",
          "Contenu": "Had a tech hack to my computer.  Exposed credit cards and other data. Called Identity Force for help. Told they were very concerned but needed someone higher up involved. I was told I’d get a call back within 24 hrs. Never got a call back or any help whatsoever. Had to handle by myself. This is why I got the policy. Will cancel ASAP."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Choy Choy Cahill",
          "Nb_Reviews": 1,
          "Date": "2018-02-28T18:40:20.000Z",
          "Titre": "You all are fast convincing me that I…",
          "Contenu": "You all are fast convincing me that I should cancel my membership!  I have called several times and each time, have been put on hold for longer than when I called the IRS, which is saying something  --- BAD!Come on, guys, what is the use of my paying all this money to you when I cannot get any kind of help or info. from you all!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "EX customer",
          "Nb_Reviews": 1,
          "Date": "2017-03-02T20:43:19.468Z",
          "Titre": "Customer Service is Rude....",
          "Contenu": "Not good at all....and when you trying to question/explain something pertaining to your package, the customer service reps are RUDE and try to over talk you(the customer) just to prove they're right and you're wrong, making it difficult to even finish a sentence. So I just cancelled my subscription because I can not deal with rudeness."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Duriye C Millik",
          "Nb_Reviews": 2,
          "Date": "2015-12-27T01:13:03.000Z",
          "Titre": "Very confusing and unhelpful website",
          "Contenu": "No consistency between the alert situation of equifax. Your website says my profile is not complete and directs me to activate the fraud alert function, but equifax says I already have fraud alert function. You're sending text message and email to notify about fraud alert, but there is no any explanation about it.  Contact is not available during the weekend."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Leanne F",
          "Nb_Reviews": 1,
          "Date": "2017-10-06T19:45:11.000Z",
          "Titre": "I have emailed 2x and called 2x",
          "Contenu": "I have emailed 2x and called 3x. I have left my number for a call back and maintain my place in the air: however that was a week ago and still haven’t received a call back. Currently on hold for the third time which is going on 20 min (yes I know a higher call volume, but my place in que cannot he still waiting a week later). How am I to trust they will handle a problem if I can get a hold of them. At this point I’m going to cancel if I can ever get someone on the phone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christine Weller",
          "Nb_Reviews": 7,
          "Date": "2018-04-10T10:02:55.000Z",
          "Titre": "Horrible experience",
          "Contenu": "Horrible experience.  I signed up and paid $189.50.  Went through the hoops to register and get a password.  Tried to log in with password and couldn't; was sent an email to get a new password, which didn't work either.  Called 3 times.  Two times the wait was so long I couldn't hold.  The 3rd time I opted for them to call me back.  They never did.  Since I can't reach them in any way, I feel paralyzed.I want my money refunded immediately and to terminate with this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jurgen Holters",
          "Nb_Reviews": 1,
          "Date": "2017-09-08T23:29:49.000Z",
          "Titre": "star provided for 30 day trial option …",
          "Contenu": "star provided for 30 day trial option only.no inhouse ticket systemno opt out options at first sightunable to get through via phone 9.6.2017lots of available services but without opt out they can peddle your info to the highest bidderkudo their sms services can process 21th century voip services, no go via lifelock or identity guardunable to turn off dopple login verification, keep in mind this can profile you via gpsmay consider continuance but not without opt out option"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "LE",
          "Nb_Reviews": 2,
          "Date": "2016-12-08T15:25:47.581Z",
          "Titre": "Constant alerts and customer service sucks",
          "Contenu": "I signed yup for a trail and canceled within a week. They sent constant alerts which were either vague and gave no  information, or were nothing at all. They send the alert in a language that scares the crap out of you, maybe that is part of their game.  I called costumer support I got an attitude. Also the fraud alert they say you can activate on your file is also untrue. I had not problem opening accounts after supposedly placing a fraud alert. Life lock is much better"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jason Shepherd",
          "Nb_Reviews": 2,
          "Date": "2017-07-19T19:18:13.000Z",
          "Titre": "Doesn't Notify of Changes",
          "Contenu": "Someone else's credit got merged on my credit report in the last couple days. Because the accounts were opened years ago, Identity Force doesn't consider these 'new' so they didn't notify me. There is obviously some limitations in their system. I should be alerted to ANY change in my credit."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John J McKeon",
          "Nb_Reviews": 1,
          "Date": "2015-05-23T21:57:51.000Z",
          "Titre": "Confusing and frustrating",
          "Contenu": "I went through the \"delete now\" steps but see no confirmation that anything was deleted.\rDuring the initial setup, I erroneously scanned my photo ID incorrectly, but after emails and phone calls, I still have not been told how to rescan it. It seems like after the initial setup there is little or no followup."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "gregory a pearson",
          "Nb_Reviews": 1,
          "Date": "2017-02-27T19:04:43.000Z",
          "Titre": "You don't pay real attention",
          "Contenu": "I'm already sick of getting too many meaningless alerts.  There was an attempt to make a purchase at Macy's, where my account has been 2 times comprimised, and it was Macy's that alerted me, not you.  Disgusted is the simple term.  I know what bills I get and when I pay them: that's banking, and I don't need alerting for that.  When someone impresonates me, I do need that alert and that's the 1 thing you haven't done.  I was alerted Saturday 2/25 at 11:30 am PST.  You should do better"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "T Harnett",
          "Nb_Reviews": 1,
          "Date": "2017-09-25T16:50:31.000Z",
          "Titre": "Expensive service little value",
          "Contenu": "Expensive service, very little value add over and above anything Credit Karla does for free including your credit scores. Get yourself some basic identity theft monitoring from someone else not looking to charge you $180 per year. Alo not possible to cancel online meaning a long hold with a rep."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JOAN SPENCER",
          "Nb_Reviews": 3,
          "Date": "2017-01-28T22:09:54.000Z",
          "Titre": "DELAYED Notifications",
          "Contenu": "I am not impressed with the response time of their notifications. I made a $2200 purchase on a credit card and the notification was sent to me days later. My bank does a better job than that.I sent a message to customer support about my concern and did not get a response.If you purchase a one year plan, there are not any refunds and you can only change your credit card, not remove it off of the account. They auto bill  your card when it is time to renew.I recommend another service that offers refunds for time not used."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark  C Goranson",
          "Nb_Reviews": 2,
          "Date": "2017-09-15T01:45:36.000Z",
          "Titre": "DOES NOT USE SAFARI. WASTED $239 in minutes!",
          "Contenu": "Had no idea we couldn't use our Safari browser with this program. We don't want to use any other browsers. WE should have been told this BEFORE we had to pay! Just wasted $239 and I am not happy about it.Need to start writing reviews online so this doesn't happen top anyone else."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Beate HillebrechtHarris",
          "Nb_Reviews": 1,
          "Date": "2018-03-25T23:41:53.000Z",
          "Titre": "Needed to talk to an agent - waited forever with no success",
          "Contenu": "Needed to talk to an agent, was waiting in que for 15 min, than opted for the call back offer. Never got a call back. This was Saturday, March 24, 2018.Tried again the following day..same thing.maybe there is only one agent on a weekend?Good thing I like to listen to classical music."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jolyn  Montgomery",
          "Nb_Reviews": 1,
          "Date": "2018-04-24T15:47:52.000Z",
          "Titre": "I signed up and it says to go manage my…",
          "Contenu": "I signed up and it says to go manage my alerts but no where in the site does it say how to do that??? Not sure if I paid $400.00 for nothing??? Also, had to call customer service because the web-site was giving error message. Not a real confidence booster for a protection site."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "unhappy",
          "Nb_Reviews": 1,
          "Date": "2017-10-06T13:11:33.000Z",
          "Titre": "I have accidentally inputted the wrong …",
          "Contenu": "I have accidentally inputted the wrong ss# and you have given me information about whoever that person is... and not myself. I can't change it on-line. I can't change it when I signed up and realized the mistake. I have to call. You charged me anyway, My wife did not complete her registration and you charged her anyway. For a company who is supposed to be protecting people - it seems your platform actually puts people at risk. The wrongly inputted social security number does not match my name in the slightest and yet I have this woman's info now."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Luke",
          "Nb_Reviews": 1,
          "Date": "2017-09-10T12:12:02.000Z",
          "Titre": "I'm a new customer and your website has …",
          "Contenu": "I'm a new customer and your website has many problems and doesn't work right. unacceptable. I can't set up the financial transaction monitoring. or the \"delete now\" identity protection. give me a break. What good is your service if your website is bunk?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Charles Guttilla",
          "Nb_Reviews": 1,
          "Date": "2018-02-24T19:26:11.000Z",
          "Titre": "Rating is for initial setup,  IDK how the system itself runs, I assume much better…",
          "Contenu": "I have only experienced initial account set-up and this rating relates to that experience only.  The system needs cookies on and ad blocking off when using Chrome browser.  Nothing is said about these settings in the online documentation (at least that I could find after hours of looking when tech support was not available).  You cannot get the system to allow you to complete your profile without having several (3) settings correctly set in your browser preferences. I have spent 4 hours with technical support, 1 or more hours on my own and the problem was not solved."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ML",
          "Nb_Reviews": 1,
          "Date": "2017-09-14T00:40:10.000Z",
          "Titre": "Can't find a way to cancel service on …",
          "Contenu": "Can't find a way to cancel service on the website, though it's easy to find the upgrade button.  They don't respond to e-mail to their customer service center, and they have a long wait in the phone queue.  Still waiting for a call back to put in a cancel order."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Conrad Marquard",
          "Nb_Reviews": 1,
          "Date": "2017-06-26T18:26:52.000Z",
          "Titre": "The wait time to reach a live person is …",
          "Contenu": "The wait time to reach a live person is unreasonably long.  I would like to manage my protection in a manner that is not so disruptive to my life.  Currently, I receive notices daily which just adds to my stress.  None of those notices warrant my attention.  As an example, I received a notice that my cell phone was posted on usphonebook.com .  I obviously do not want to receive solicitation calls but there was no remedy.  Just a 'thought you'd like to know.\"  Simple advice:  If you don't have a solution, I don't want to know about the problem."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anthony Driscoll",
          "Nb_Reviews": 2,
          "Date": "2017-09-17T03:56:15.000Z",
          "Titre": "I just signed my son (24 years) up for …",
          "Contenu": "I just signed my son (24 years) up for this security program. He has had fraudulent activity on his USAA checking account and CEFCU credit card. I waiting on the phone for over one hour to report CEFCU credit card fraudulent activity and representative said, \"someone will get back to you within 24 hours). There are NO helpful services for ID theft online that a person could help themselves. Please call (309) 369-1606 Julie Ann Driscoll mother of Anthony M Driscoll. I bought a year with one or two months free; but I think we will cancel this service as it has been NO HELP>"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Babette Stewart",
          "Nb_Reviews": 1,
          "Date": "2017-10-06T14:37:48.000Z",
          "Titre": "I have been trying for days to get …",
          "Contenu": "I have been trying for days to get support to add accounts.  The website isn't working property.  I can't get any assistance.  I have called and emailed.  We are only in our first year and not happy with this.  Never had poor service like this at Lifelock."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Frederick R Jung",
          "Nb_Reviews": 1,
          "Date": "2016-10-06T20:26:27.000Z",
          "Titre": "Your service stinks",
          "Contenu": "I signed up recently for your service and entered my husband's information assuming I would at some point enter my info as his spouse.  When I called your office toda , I was told that was not the case and I would have to purchase a membership in my name to accomplish this. Our accounts are all joint accounts and it would stand to reason that we would want protection for both of us. It is my intention to cancel our account as soon as my husband is available.  I am very disappointed that this is not clearly indicated on your home page when one signs up. Corrine Jung."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gina M corteselli",
          "Nb_Reviews": 3,
          "Date": "2017-05-19T19:25:17.000Z",
          "Titre": "Bad service",
          "Contenu": "I have been trying to activate what were previously active services (phone, bank account, email monitoring) but system won't let me. Notwithstanding the fact that i can't determine  how long my services have been inactive, I am paying for services that I am not getting.   I've called Identity Force 3 times and have a ticket number for tech support but still no resolution. I am on the phone (on hold)  with Identity Force right at this moment to get an update on what the problem is, and a solution.  Absent resolution I will cancel my service before my next billing cycle."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris G",
          "Nb_Reviews": 2,
          "Date": "2017-10-09T23:23:13.000Z",
          "Titre": "Very disappointed",
          "Contenu": "Very disappointed. Identity Force has not responded to multiple emails sent to them. If things do not improve in the next 30 days, I'm just going to cancel (even though I will lose my money).I'm going to take a look again at their competitors."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Suzan C.",
          "Nb_Reviews": 1,
          "Date": "2018-04-11T18:02:46.000Z",
          "Titre": "When I click on the link in the Welcome…",
          "Contenu": "When I click on the link in the Welcome email and try to fill out the information form, it won't let me choose Arizona or enter Arizona in the address field or the Drivers License state fields. So it won't let me complete the form to submit!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "An Identify Force customer",
          "Nb_Reviews": 1,
          "Date": "2017-09-25T14:25:58.000Z",
          "Titre": "Monthly, low-threat nuisance alerts",
          "Contenu": "Stop sending me the same, low-threat alert every month about e-mail and phone number.  Do try to let me know what to do about things like the Equifax breach in a timely mannerReply 9/25:>  To avoid receiving alerts regarding email address and phone numbers you may go into the email address monitoring and phone number monitoring to remove the information if you no longer wish to receive alerts regarding this information.But I do want to receive e-mail and phone number alerts.  That's why I subscribe to IF services.  I should be able to set a threshold since you are assigning threat values already."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gail",
          "Nb_Reviews": 1,
          "Date": "2017-09-20T01:11:01.000Z",
          "Titre": "This is a scam",
          "Contenu": "I am ready to cancel my account because I cannot get through to speak with them. What good does it do to have the protection if you can't get through to talk to anyone?  Seems like a scam to me, they take your money and that's the end of it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "brian hinterberger",
          "Nb_Reviews": 1,
          "Date": "2018-01-25T16:56:03.000Z",
          "Titre": "There is a very serious flaw in your …",
          "Contenu": "There is a very serious flaw in your mail fraud monitor with regard to change of address.  I paid for a service to alert me to mail fraud and you missed it.  Not worth the service and I will share with everyone I know.Sadly,Sad Customer....."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert C Bonneau",
          "Nb_Reviews": 4,
          "Date": "2018-02-17T17:54:01.000Z",
          "Titre": "I had my wallet stolen,",
          "Contenu": "I had my wallet stolen,Have been on hold for nearly 30 minutes & cannot find another # or way to contact you...  Not good to have this happen in time of need...If I do not get help soon I will cancel this service...Please call me ASAP"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert - Idaho",
          "Nb_Reviews": 2,
          "Date": "2017-09-22T17:07:30.000Z",
          "Titre": "I called for initial information and …",
          "Contenu": "I called for initial information and the phone was answered right away by a lady who explained how service oriented the company is, based on that call I purchased the product for me and my wife. On signing up I had some questions. I was put on hold and then placed on a call back wait list (2X). It has been over 24 hours with no call back from either attempt. This morning I called the same line I did for initial information and explained I could not get any assistance and was given a 866 #. I did get a person who was rude and condescending. So far not very impressed with the service as none of my questions were answered."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hoa Tong",
          "Nb_Reviews": 1,
          "Date": "2017-06-22T15:27:14.000Z",
          "Titre": "Lousy response service",
          "Contenu": "Lousy response service, long hold  time at 1100 minutes + wait time   , numerous calls but unable  to get hold of any one , and no return call after leaving message. not much help provided by customer staff on registration process ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Margaret S McFarlane",
          "Nb_Reviews": 2,
          "Date": "2017-06-22T13:47:39.000Z",
          "Titre": "Seems like IdentityForce is very much …",
          "Contenu": "Seems like IdentityForce is very much understaff.  Each call to customer service is extremely long wait and no call has been returned even I chose to have call return.  Not happy at all with ur customer support when customer needed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rickard A Aldrich",
          "Nb_Reviews": 2,
          "Date": "2017-09-07T15:55:28.000Z",
          "Titre": "For the money spent you may want to …",
          "Contenu": "For the money spent you may want to look into having your website upgraded.  When making changes it state Missing Arguments.  Whatever the hell that means.  Cookie do not need to be enabled, there is no reason to track my moves."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Patterson",
          "Nb_Reviews": 1,
          "Date": "2018-04-10T16:34:39.000Z",
          "Titre": "You have the worst website I have…",
          "Contenu": "You have the worst website I have encountered on the Internet in 20 years....It's not functional except for taking payments....you've got broken input code, data scripts, who designed this website..A three year old?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 2,
          "Date": "2018-04-17T01:07:17.000Z",
          "Titre": "I pointed out that you had issues with…",
          "Contenu": "I pointed out that you had issues with the link to your downloadable software for PC's.  I then let you know that I was able to get a copy from another computer and it ran correctly.  I then received a message, not thanking me for helping you troubleshoot your new system, but asking how I was able to install another copy since I only get one for each subscription.  My wife and I pay $400 per year for your service, and I was installing the second license.  For that kind of money your service should work, and you should treat your customers better and not send insulting comments.  I will have to evaluate whether to keep your service or not, especially how you treat your customers."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert D Garrett",
          "Nb_Reviews": 2,
          "Date": "2018-04-11T01:35:58.000Z",
          "Titre": "Hate the new website",
          "Contenu": "Hate the new website, much of the functionality doesn't work. Can't update my credit card for billing and I get errors on the dashboard about credit card not found. Please can we have the previous site back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "unhappycustomer",
          "Nb_Reviews": 1,
          "Date": "2017-06-23T00:24:47.000Z",
          "Titre": "Late response to alerts, no search on your site, no information on your site to cancel my account.",
          "Contenu": "Late response to alerts, no search on your site. I called member services at 4:30pm on 6/22/17 EST and opted for a call back and am still waiting (time is 8:22pm EST). No information on your site to cancel my account."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "js",
          "Nb_Reviews": 1,
          "Date": "2017-09-25T13:54:00.000Z",
          "Titre": "I have a Mac and just signed up for …",
          "Contenu": "I have a Mac and just signed up for your $199/yr service only to find out your software is incompatible with Mac's Safari.  It's not 1999, so I expected far much better interoperability given the price point."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "A",
          "Nb_Reviews": 1,
          "Date": "2017-09-11T19:12:10.000Z",
          "Titre": "Slow, clunky and unable to cancel account.",
          "Contenu": "Slow, clunky and unable to cancel account.Has not been a great experience and as other reviewers have noted, there is no area on the site that allows you to CANCEL your account.  Switching to another service today."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "NA",
          "Nb_Reviews": 1,
          "Date": "2018-04-15T21:38:53.000Z",
          "Titre": "This is a terrible new site",
          "Contenu": "This is a terrible new site. The older one was simple everything; was on a single screen. I have been on this twice and cannot figure out where to renew my fraud alert. This new dashboard is not at all intuitive."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Raymond Samadian",
          "Nb_Reviews": 1,
          "Date": "2017-09-22T01:07:57.000Z",
          "Titre": "I signed up two weeks ago and still …",
          "Contenu": "I signed up two weeks ago and still cant set up to see my credit score, eve-though I paid for ultrasecure +credit. I tried calling many times but could not go through to speak to someone. I even left my number and still didn't get a call. I emailed several times; however, finally I received an email telling me that I should go to Credit Services from My dashboard and I will get a pop up ...Well, there is no Credit Services from Dashboard, at least not on my screen. There is no web based Technical based answers on your website, only about identity theft and what to do if ....., but nothing about how to set up and or navigate your website.Anyways, I'm very much frustrated and disappointed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Darrel Bowen",
          "Nb_Reviews": 1,
          "Date": "2017-09-14T21:20:52.000Z",
          "Titre": "Terrible customer service",
          "Contenu": "I tried out for the free 14 day trial and within 6 days I was charged $129.00 on my credit card. I don't want this service at all and have been on hold for over an hour trying to reach them to cancel it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "natalie h harden",
          "Nb_Reviews": 1,
          "Date": "2018-03-25T22:59:05.000Z",
          "Titre": "All take, no give?!",
          "Contenu": "So far,I gave this program all of the information and it has given me NONE!Does it tell me anything that I don't provide??  What am I missing?  I'm ready to cancel! waste of my time and money!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "DKnight",
          "Nb_Reviews": 1,
          "Date": "2017-09-30T17:44:38.000Z",
          "Titre": "I enrolled for a 30 day trial and my …",
          "Contenu": "I enrolled for a 30 day trial and my credit card was immediately charged for the full amount rather than the normal $1.  I then tried to fill out all necessary requirements to activate my account and being on an Apple device would require me to download a different browser, which I will not do.  Called to cancel and waited for 45 minutes then opted for the call back and they never called back.  This morning I waited on for 95 minutes and gave up.  Still waiting for that call back.  Cannot find a way to cancel on their site.Update 9/29: IdentityForce never did call back but I finally got through with days of persistence whenever I had the spare time.  And what a waste of my time it was!  I would never recommend this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "V. Cheung",
          "Nb_Reviews": 1,
          "Date": "2017-09-05T23:07:28.000Z",
          "Titre": "sign up over the weekend",
          "Contenu": "sign up over the weekend, decided to cancel on the 1st day, customer services not open, call on tuesday because of long weekend. Still needed to charge me for the home month me and my wife. ridiculous."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Angela C.",
          "Nb_Reviews": 6,
          "Date": "2015-08-31T22:06:49.000Z",
          "Titre": "Identity Force crazy bad",
          "Contenu": "I just called (as told by their site) to \"verify\" I am who I say. BUT the only way to do that is to send a photo ID. Even though they confirm cancellation by sending me an email, and even though I am calling from the acct phone number, even though they are prorating the credit card I signed up with, they won't believe who I am without me mailing a copy of a photo ID. The Woman on the phone was loud and close to rude, refused to allow me to speak to anyone else because it is POLICY peroid. The site is pretty worthless, scare tactics, lists dead sex offenders etc. Tells you how many millions of people are victims but then do something stupid like this. Gee, you can't call my home or cell to verify who I am ?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dana Carvin",
          "Nb_Reviews": 1,
          "Date": "2017-11-16T21:08:50.000Z",
          "Titre": "So far I’m not real impressed",
          "Contenu": "So far I’m not real impressed. I called regarding an alert with questions and the person I spoke to was unable to answer any questions. I’m wondering if I’ve chosen the right company to protect me?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Norbert Gasior",
          "Nb_Reviews": 2,
          "Date": "2017-01-22T21:41:55.000Z",
          "Titre": "Difficult",
          "Contenu": "I am a senior citizen trying to navigate registration. Your site is extremely difficult to use.  Evidently, there's also no Customer service on Sundays to ask for assistance.  Very disappointed!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Krista",
          "Nb_Reviews": 1,
          "Date": "2016-07-12T00:46:51.000Z",
          "Titre": "Credit Card Opening",
          "Contenu": "A new credit card in my name was opened two weeks ago and Identity Force never notified me about it. Very disappointed in the service.  I had lifelock in the past and they would notify me right away."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Willard A Emery",
          "Nb_Reviews": 1,
          "Date": "2017-10-15T19:22:55.000Z",
          "Titre": "Called in for help twice and both times …",
          "Contenu": "Called in for help twice and both times it was like going into the Twilight Zone. Your people were unprepared for my questions and when I was finally able to ascertain level of service cancelled."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Susan Dannemiller",
          "Nb_Reviews": 2,
          "Date": "2017-09-17T16:55:28.000Z",
          "Titre": "i find the website almost impossible to …",
          "Contenu": "i find the website almost impossible to use.  it makes me questionthe credibility of your product.  i have spend over an hour already and still don't have it done.  i an ready to cancel."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William L Carter",
          "Nb_Reviews": 1,
          "Date": "2016-06-19T20:28:05.000Z",
          "Titre": "If this had been a credit breach it would have been too late to do anything as this event took place over 2 months ago.",
          "Contenu": "The reason to pay for this service is to keep from having unauthorized access.  If this had been a breach it would have been too late as this took over 2 months to be brought to our attention."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Frustrated in Florida",
          "Nb_Reviews": 1,
          "Date": "2017-09-20T19:06:51.000Z",
          "Titre": "Big mistake!",
          "Contenu": "I am so sorry I signed up for this service.  I had so much trouble with the website.  It kept getting the names mixed up.  Every time I tried to fix the registration info I got a new text with an authorization code.   Every time I responded to the texts I got charged $199.  I currently have $597 pending charges on my credit card.  I can't get in touch with anyone at this company. I've left 2 messages, sent an email and held for hours.  I've been on the phone with my credit card company and they say I have to wait until the charges get posted then I have to go through the dispute process.  What a nightmare!!! If this company can't even do the registration process right I certainly don't want them handling my identity theft.  Fingers crossed I get my money back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vickie Stark",
          "Nb_Reviews": 1,
          "Date": "2018-04-20T21:40:11.000Z",
          "Titre": "I want cancel your service immediately",
          "Contenu": "I want cancel your service immediately. Your new website terrible and customer service terrible too. Impossible to contact. Please send me detailed instructions.Vickie Stark."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gary M",
          "Nb_Reviews": 1,
          "Date": "2017-06-22T21:41:53.000Z",
          "Titre": "I have a question about an alert I have …",
          "Contenu": "I have a question about an alert I have received and cannot talk to anyone.  Message system said wait time would be 794 minutes!  Left message to get a call back, but nothing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lynne F Morgan",
          "Nb_Reviews": 1,
          "Date": "2017-06-22T16:00:13.000Z",
          "Titre": "Unable to reach service",
          "Contenu": "I have been unable to get a call back from Identity Force.  When I need help, especially with identity concerns, I don't want to wait 2 days or more for service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark C Wells",
          "Nb_Reviews": 2,
          "Date": "2017-10-02T15:23:23.000Z",
          "Titre": "I have been holding for customer …",
          "Contenu": "I have been holding for customer support for 40 minutes!  What kind of customer service is this?  Not acceptable and I will voice same when someone finally answers!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "DONNA MANGRUEN",
          "Nb_Reviews": 1,
          "Date": "2018-04-13T00:24:55.000Z",
          "Titre": "I couldn't even select my state from…",
          "Contenu": "I couldn't even select my state from the drop down after several frustrating attempts. It is now not allowing me to select my security question. VERY GLITGHY."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "bonnie",
          "Nb_Reviews": 1,
          "Date": "2018-04-08T22:34:47.000Z",
          "Titre": "I thought i was purchasing something…",
          "Contenu": "I thought i was purchasing something advanced. Wanted to know if anybody had used my name to get a loan, cell phones, etc. Nothing. its a waste of time and money"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Reber",
          "Nb_Reviews": 1,
          "Date": "2016-11-01T00:38:59.000Z",
          "Titre": "A lot of work for nothing",
          "Contenu": "Fill all this crap out then nothing, they asked my whole life history and still was not enough info!!! Just Another bait and switch scam will cancel right away."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shannon W Harris",
          "Nb_Reviews": 1,
          "Date": "2016-02-13T00:52:43.000Z",
          "Titre": "Unable to access credit reports/scores/monitoring",
          "Contenu": "Signed up for credit report/monitoring service on 1/23/16 and was unable to access any credit information. Spoke with Dion in member services on 2/12/16 and asked for a refund since I have been unable to utilize services. He refused to issue refund stating that I had other services available to me (although I never utilized them), and he didn't have the authority to issue a refund. I asked him to cancel service effective TODAY and he stated I would get conf. of cancellation in my email at the end of the call. Also, stated he would have his supervisor, Wendy, contact me on Mon, 2/15/16, regarding the refund. \r Dion was very ROBOTIC and unfriendly. He was very rude and spoke as I spoke. He was very defensive and did NOT offer any other solution. I AM A FINANCIAL CONSULTANT WHO REFERS OTHERS TO COMPANIES LIKE THIS ON A DAILY BASIS. HOWEVER, I WILL NEVER USE OR REFER THIS COMPANY AGAIN!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thomas Ward",
          "Nb_Reviews": 1,
          "Date": "2017-09-20T10:54:21.000Z",
          "Titre": "I've been calling customer support for …",
          "Contenu": "I've been calling customer support for the past 24 hours. No on picks up phone. I even used the call back option. No one has called since yesterday."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert N Francis",
          "Nb_Reviews": 2,
          "Date": "2018-02-11T16:39:04.000Z",
          "Titre": "The system does not allow me to …",
          "Contenu": "The system does not allow me to activate fraud monitoring on bank cards.  Disable pop-ups and have tried everything.  Probably switching to life lock."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "jason king",
          "Nb_Reviews": 1,
          "Date": "2018-04-07T19:22:19.000Z",
          "Titre": "i've tried several times to set up my…",
          "Contenu": "i've tried several times to set up my profile and it has not allowed me to finish. i have tried 3 different browsers, each with different issues."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Karen L Leno",
          "Nb_Reviews": 2,
          "Date": "2017-09-15T00:01:05.000Z",
          "Titre": "Fraud Alert brings me to an OOPs page.",
          "Contenu": "I know you have increased traffic, but maybe a better FAQ for problems setting up Fraud Alert and/or freeze.  Fraud Alert brings me to an OOPs page."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "michael J mcdaniel",
          "Nb_Reviews": 3,
          "Date": "2017-10-02T01:18:27.000Z",
          "Titre": "The issue is 3 items.",
          "Contenu": "The issue is 3 items.1. System cannot grab account balances off of listed accounts. Take Wells Fargo as an example, One login has immediate access to 3 accounts. The system pulls the balance for 2 of the 3. See attachments.2. The system does not pull account balance for 8 of the 18 account 'monitored'. These accounts were all logged into and 'verified' by identity force  and some work fine on the daily transaction pull.3. The system does not pull daily transactions on the Bank and Credit Card Activity report. I am sure all these issues are related.I also would a credit of free month(s) in my account equally the amount of time it takes you to correct the issues. At this point I believe you might have a good system, but not being able to pull the transaction and balance info on my accounts is starting to make me doubt / trust that I am being protected. I mean after all, my  Quicken program pulls this info flawlessly."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Adrienne Ruiz",
          "Nb_Reviews": 1,
          "Date": "2018-04-12T04:48:58.000Z",
          "Titre": "Cancel my account",
          "Contenu": "purchased with groupon that didn't apply. No customer service tab, Click save and it doesn't tried several times. Cancel my account now"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "sara lewis",
          "Nb_Reviews": 1,
          "Date": "2017-09-20T17:44:03.000Z",
          "Titre": "CANT CANCEL SERVICE!!!",
          "Contenu": "I have been trying to call since MONDAY!!!!! I have now been on hold for an accumulated total of over 4 hours. I have emailed TWICE. I have not been able to reach anyone nor has anyone replied to my emailS!!! I understand being busy but, as a professional and legitimate company, that is NOT an excuse. I am going to have to report my card stolen and report this company to the BBB in order to get them to cancel this service. How is that okay? I am going to leave this review on every possible review site to make sure people know what they are getting themselves into. I had plans of signing back up after my financial crisis was over. Not anymore!!!!!****UPDATE- STILL on hold!! 1 hour and 17 minutes added to that wait time.Been holding now for 2 hours and 35 minutes! Just called my CC company and had them cancel my card. After 3 days of holding and emailing and not getting any response in return, I was left with no other options!!!!! Reporting to the BBB."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert J Suarez",
          "Nb_Reviews": 2,
          "Date": "2017-11-18T20:25:18.000Z",
          "Titre": "I am a new member and have been waiting …",
          "Contenu": "I am a new member and have been waiting on hold for 20 minutes.....I am probably going to cancel my account.  You need to hire more people"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ronald M Mattox",
          "Nb_Reviews": 1,
          "Date": "2017-11-08T20:43:16.000Z",
          "Titre": "The website is very unfriendly",
          "Contenu": "The website is very unfriendly, all of the double verification don't work - I don't have time to be calling into fix their problem"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Quinn E Moulesong",
          "Nb_Reviews": 1,
          "Date": "2017-09-25T19:35:22.000Z",
          "Titre": "Completely TERRIBLE service !!!",
          "Contenu": "Emailed questions to support on first day, took over 4 DAYS to get a reply !Offered a 30 day free trial, $199.50 annually thereafter. NO 30 day free trial as they bill you the entire amount immediately. Called customer service to question this and have been on hold for almost 4 HOURS !!! Then they simply disconnected the call !!!!NO OPTION TO CANCEL MEMBERSHIP ONLINE !! and if you don't get through within the \"free trial period\" THEY DO NOT REFUND ANYTHING9-25-2017Wendy, I was misled by the advertisement of the free trial (google) that you apparently offer on the standard plan only.....which it ridiculous. Open the attached photo, in the email I just sent you,it shows option 1 for existing customers, option 2 for cancellation. in the top left corner is the 3 HOUR and 57 MINUTES I was left on hold !! Please cancel the service and process the refund to the card used.Respectfully,Quinn E MoulesongOnce again I am in cue for almost an hour waiting for your call back..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mark Harbold",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T19:40:46.000Z",
          "Titre": "A check got whitewashed",
          "Contenu": "A check got whitewashed, drained some of our account without our knowledge or your knowledge. No protection and no notice from you. We've cancelled our service with you..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Barbara McGuigan",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T22:10:51.000Z",
          "Titre": "My card was hacked and it is listed and…",
          "Contenu": "My card was hacked and it is listed and I heard nothing and so a appeal was made and the credit agencies were notified. I enlisted in this service so this would not happen."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T23:20:38.000Z",
          "Titre": "Response time",
          "Contenu": "Communication and response time needs to be improvedAs of 1/11/23 no one has reached out like your response said on 12/29"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dante",
          "Nb_Reviews": 4,
          "Date": "2022-03-01T19:41:20.000Z",
          "Titre": "Believe the bad reviews",
          "Contenu": "Edit: March 1stFinally received a call. Representative said they will look into it, and send me an email once resolved. We’ll see. I did appreciate the call though, even though it took a week. ——————-I recently signed up, and should have read and believed the warnings. The site is glitchy. I can’t connect my bank account, so it can be monitored. I’ve emailed customer service twice now, with no response; first email being sent on Monday, second yesterday morning. If a site isn’t functional, and I can’t get anyone to respond, it’s doubtful that I should be able to trust the company to protect me. Sickening. I regret signing up, and I want my money back.Edit: March 1,2022:One week from my original email, and still no response. IdentityForce requested info, through Trustpilot, after my original review. I provided my info and member ID, as there wasn’t a reference number. That was Friday morning. So they would have had Friday and Monday (if only counting weekdays) to contact me. That didn’t happen, either. Trustpilot: I have the emails, and I have proof of membership. I would like to show that this is a verified review, if you can let me know how to send the info."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 11,
          "Date": "2018-02-24T05:02:18.000Z",
          "Titre": "What am I paying for?",
          "Contenu": "I just had a credit card with fraudulent charges. My bank caught it right away and shut down the card.  I still haven’t received any alerts for you guys about this issue. I would think that would happen at least after they cancelled the card. Then I get an email today from you saying we have you covered and no alerts. To me that indicates I’m paying for nothing. No protection"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lauren Proctor",
          "Nb_Reviews": 1,
          "Date": "2017-09-09T17:25:31.000Z",
          "Titre": "I'm trying to get in touch with …",
          "Contenu": "I'm trying to get in touch with customer service by phone but the wait is over 30 minutes.  They say that they have your credit report available on your dashboard yet I'm unable to find it.  I apparently have someone that is using my ss# and can't get in touch with anybody.  What is the point of this service if I can't talk to someone?  The alert was helpful, but now I'm stuck."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "uffe hellum",
          "Nb_Reviews": 7,
          "Date": "2017-12-04T17:19:07.000Z",
          "Titre": "I can't figure out how to deactivate …",
          "Contenu": "I can't figure out how to deactivate the pointless sex offender alert. I can't get the password recovery to work. Maybe you have program errors pertaining to extended characters? I don't understand your credit bureau alert. Maybe you really have had nothing to report for a long time, and try to pretend importance by generating pointless fake alerts."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "c smock",
          "Nb_Reviews": 2,
          "Date": "2018-04-28T17:12:36.000Z",
          "Titre": "I guess I have to call to find out if…",
          "Contenu": "I guess I have to call to find out if my spouse is covered, since I cannot tell from the dashboard and was never given an option to put in his info... Now I have to go check my credit card to see how much I was charged, since for some reason you cannot add that to the dashboard... Plus you don't have an option to opt out of auto renewal..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "WILLIAM WILKERSON",
          "Nb_Reviews": 1,
          "Date": "2017-09-16T22:43:30.000Z",
          "Titre": "No call back",
          "Contenu": "I am a new customer and have entered the majority of my information. I do not see where nor can I find a place to enter my stock account or my IRA information. I waited on hold for 20 minutes and hung up. The next day I entered my phone number so that I would receive a call back. No call back. I repeated the process the third day and left my cell number. No call back.I hope your protection service is better than your customer service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stephen M Capogna",
          "Nb_Reviews": 1,
          "Date": "2017-06-23T16:03:32.000Z",
          "Titre": "The Smart SSN Tracker Alert Fiasco",
          "Contenu": "The Smart SSN Tracker Alert Fiasco was very disturbing. I tried calling when I got the email and text alerts and had a 200 minute wait. I couldn't wait so I called the next day and left a callback. No callback. Today I received an email explaining the alert was in error and an apology. This was two days after the problem! I should receive a free month's service for the angst you caused.Stephen CapognaHendersonville, NC"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Unknown",
          "Nb_Reviews": 1,
          "Date": "2018-01-31T03:31:31.000Z",
          "Titre": "Dissatisfied and Uncertain",
          "Contenu": "I'm not sure I am getting enough service for the charge. I noticed my credit card balances are not updated on my dashboard. I do get emails when someone is checking my data. My credit card numbers have been stolen and used but not notified from Identity Force but from the banks. This is only what I have experienced. I am not overly knocking Identity Force but not sure it is worth $200.00 per year. Check out all the companies you may want to go with."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tee52",
          "Nb_Reviews": 3,
          "Date": "2017-02-15T15:19:46.000Z",
          "Titre": "Aggravated",
          "Contenu": "I have not been receiving alerts on my bank accounts and have not since 12/8/2016. I got alerts every time there was activity on any bank or credit card account. They just stopped and I cannot get a valid explanation as to why. Seriously considering cancelling my service as I feel it is a waste of $$ if I get no alerts.EDITED - 15 days later and still NO response."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 2,
          "Date": "2018-04-12T13:03:17.000Z",
          "Titre": "It's ok",
          "Contenu": "It's ok, it fails to pull my credit score and says to contact a representative.  The security software suite won't install on my new Windows 10 laptop, it says \"this app can't run on your pc\", but I have it running on my old laptop. Some things to work on, especially the price I pay per year for this service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "timothy zook",
          "Nb_Reviews": 1,
          "Date": "2017-05-19T13:26:25.000Z",
          "Titre": "not as good as they think they are",
          "Contenu": "not as good as they think they are. i ask for help with the op out services of unwanted credit cards, they say they do this. i asked for help, they said, \"by law\" they can not help, but they gave me a phone number so i could do this myself. still a member at this time, i hope , if needed, the next service will be there.   t zook   indiana."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Alfieri",
          "Nb_Reviews": 3,
          "Date": "2017-09-18T00:44:35.000Z",
          "Titre": "Getting alerts that are not clear as to …",
          "Contenu": "Getting alerts that are not clear as to what they are and leave me not knowing if or how I should take action. There is  NO ONE to contact and I am NOW GETTING TEXT ALERTS AT 4:30 AM !!!! This is NOT GOOD. Have someone call me !!! since I can't get anyone when I call.  There are some good features no doubt, but I hope I see improvement on cust. service and better, more timely alerts ASAP.  Not nearly as happy with I.D. Force as I hoped to be.ThanksJohn Alfieri"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Scott A",
          "Nb_Reviews": 1,
          "Date": "2017-10-23T14:26:33.000Z",
          "Titre": "The credit reports scores you lists on …",
          "Contenu": "The credit report scores you list on my dashboard are so far off my scores from the actual credit bureaus as to be absolutely useless.  Example...my credit score directly from Experian is 841.  But you list my Experian score as 758--an 83 point difference.  What gives?  Scores from the other two credit bureaus are nearly as far off.  How can I rely on the accuracy of your service when you can't even list my credit scores as  anywhere close to what they actually are?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David Dageforde",
          "Nb_Reviews": 1,
          "Date": "2017-09-21T11:35:02.000Z",
          "Titre": "Many initial features did not work",
          "Contenu": "Many initial features did not work - Security question froze and had a hard time starting over - left a call with the help team that was never answered - now the activating the credit card activity does not work two days in a row and yet I have not yet received a call back from the Q and A desk. After reading the rave reviews of this organization, I am surprised at both the problems filling in the initial \"blanks\" to get started and the lack of a phone call return."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Terry A V",
          "Nb_Reviews": 1,
          "Date": "2015-04-20T20:01:29.000Z",
          "Titre": "credit scores wrong",
          "Contenu": "I have identity force and credit karma both and the only one where the credit scores accurately update is on  credit karma.  I had paid off over $20,000 in debt on one of my credit cards all in the last 3 months and according to identity force my scores are unchanged where on credit karma they are now in the 830s.  I am very dissatisfied with the results of identity force and will probably be cancelling my account in the near future."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Maria Hernandez",
          "Nb_Reviews": 1,
          "Date": "2018-04-29T16:27:40.000Z",
          "Titre": "New website page",
          "Contenu": "The website update and changes are not working out for me so well. Credit score does not display, always loading, even if it's the same until the next refresh. The whole page is not well thought of nor easy to check certain items. I'm just not liking it at all. I liked the previous site better, to be honest."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Renee Eurich",
          "Nb_Reviews": 1,
          "Date": "2018-05-05T13:21:29.000Z",
          "Titre": "The account set up does not go…",
          "Contenu": "The account set up does not go smoothly.  Links in the welcome emails do not work and the credit monitoring answers to the questions do not register and instruct you to contact member services.  I am leery about the level of protection I will get from a company that has so many new member account set up glitches."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "michael d pechner",
          "Nb_Reviews": 1,
          "Date": "2018-04-16T14:18:28.000Z",
          "Titre": "On hold for 30 minutes so far to cancel.",
          "Contenu": "On hold for 30 minutes so far.Trying to cancel my account.Not worth $200.No AI,  6 months in I keep getting alerts for the same transactions.Transferring money from checking to the bank CC, is 2 alerts.  Should be NO alert.Update 4/16:Reply to identiryforce reply to this post:Yup after the callback came at 5:46AM!  I called again and got through in a few minutes.  My cancellation, was based on the phone number I called from, with no other significant verification.  Very secure company."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "A Very Happy Customer",
          "Nb_Reviews": 3,
          "Date": "2017-06-23T23:45:32.000Z",
          "Titre": "Identity Force has a very high price …",
          "Contenu": "Identity Force has a very high price tag for very little communication with their customers. I would never renew this service again for the outrageous price of $199. I've received one notification. otherwise I am left to assume all is ok. This service is very overpriced for what they give in return on reassurance."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "abalgir",
          "Nb_Reviews": 1,
          "Date": "2018-02-01T23:59:35.000Z",
          "Titre": "Social media & online PC pratection",
          "Contenu": "Social media : we should set the user id and not be imposed the user id used in Identity Force (they might not be the same)Online PC protection tools does not work with Bluetooth modern keyboard , it disables the keyboard, not useful.For MAC users the PC protection , as the name suggest (PC), is not useful."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Daniel Crocker",
          "Nb_Reviews": 1,
          "Date": "2015-09-07T15:49:45.000Z",
          "Titre": "Not Worth It",
          "Contenu": "There is no real reason to keep this service beyond the free trial period. After you complete the internet scrub in the first few weeks, all they will do is tell you about events where your data crops up because they won't take steps like contact webmasters in China to remove your information. There's really nothing they've done for me since that first month, other than argue with me about the value they provide by sending a monthly email that repeatedly says the same thing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lydia Rice",
          "Nb_Reviews": 1,
          "Date": "2018-03-12T04:42:49.000Z",
          "Titre": "Lots of problems",
          "Contenu": "Lots of problems.  Conspicuously, I just get a spinning beachball with the Credit > Credit Report, Credit > Credit Score, and Credit > Credit Simulator tabs.  The Credit Score Tracker tab worked, but was pretty much useless.  In particular, it told me that it was updated on Mar-1, but the graph ran from Jan-Dec, which suggests that there's a year wraparound happening in the middle of the graph.  If so, why was there no year popup over each month?.  If not, why were the first three months of this year missing?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dennis D.",
          "Nb_Reviews": 2,
          "Date": "2017-09-22T05:19:11.000Z",
          "Titre": "Two Part Authentication to Log In",
          "Contenu": "I've just been playing \"ping pong\" for about 10 minstrying to log in to your site, because I keep on getting an INCORRECT  code error. Going back and forth between TWO windows (My email site and IdentityForce log in window) is breaking up my connection.  There must be a BETTER way."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeffrey M Weber",
          "Nb_Reviews": 1,
          "Date": "2018-01-03T18:44:34.000Z",
          "Titre": "My checking account was hacked and …",
          "Contenu": "My checking account was hacked and between October of 2017 and December, over $3000 was secreted out of the account, mostly in $2-10 increments with two charges of greater than $600. This was missed by Identity Force and without a good explanation, I will cancel the account in the next 2 weeks."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dennis Mcmullen",
          "Nb_Reviews": 1,
          "Date": "2018-02-04T03:30:29.000Z",
          "Titre": "Nothing But Problems",
          "Contenu": "I've been a member for about 24 hours, and I've had numerous problems with your system, and been on the phone with you 4 times (I'm currently on a loooong hold).  Your system has many inconsistencies, and vague directions, and you've made the worst possible first impression."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gaylen Morgan",
          "Nb_Reviews": 4,
          "Date": "2017-09-11T21:01:40.000Z",
          "Titre": "I just joined. So far service terrible.  I need help and can't get",
          "Contenu": "I just joined on line. I cannot activate monitoring if cards and accounts.  Have been in their phone que all day with no call back. Also no reply to email. Busy as they are I am worried I made a mistake after experiencing such terrible customer service. Will cancel if not rectified soon."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Clayton R",
          "Nb_Reviews": 1,
          "Date": "2016-09-29T21:58:36.000Z",
          "Titre": "Always has an excuse for why something is not monitored.  Stop responding.",
          "Contenu": "We bought this service mainly to protect our minor children from ID theft.  I noticed that when I opened a checking account for one of our minor children, using their SSN, no flag ever popped up on this service.  When I inquired, I was first told that it has to be with one of the \"big banks\" that report to them.  Funny, I don't recall seeing that mentioned when we enrolled.  Well, we were enrolled with a huge bank, so they said they would look into it.  Two follows later, no response.I will be terminating this service."
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "AWM",
          "Nb_Reviews": 21,
          "Date": "2017-12-14T23:39:36.000Z",
          "Titre": "Terrible customer service",
          "Contenu": "Wow - I just had a really terrible customer service experience with you.  And it is the first and only time I have called since I spent a fortune and signed my entire family up.  I just got a rude, robotic jerk on the phone.  I am really not happy!  I would appreciate a response."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeff Kemp",
          "Nb_Reviews": 1,
          "Date": "2018-01-09T02:22:10.000Z",
          "Titre": "Can only pull credit report once every 3 months …",
          "Contenu": "Can only pull credit report once every 3 months. Other free credit report services provide daily updates (very important if victim of identity theft).Site times you out before you have time to review report, so you better print it out quickly.The social media alerts aren't helpful because they don't provide a link to the tweet or account were an issue may exist so you can mitigate.Report data not thorough since not showing addresses, which is how I found out I had identity theft through another free credit report service when I saw a foreign address listed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sherry Moore",
          "Nb_Reviews": 1,
          "Date": "2015-11-05T12:15:13.000Z",
          "Titre": "I don't understand the Alerts??",
          "Contenu": "I keep getting alerts and when I go look at them they do not tell me anything.  It lists the account I am disputing but does not say if it was removed from my credit, staying on my credit or what is happening.. What am I to do with this information?  \r Not a user friendly system."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mary Billings",
          "Nb_Reviews": 1,
          "Date": "2017-11-11T23:23:04.000Z",
          "Titre": "Activation frustration",
          "Contenu": "I do not have a desk top computer. I have been trying to put my information in via my I Pad and an I Pad pro. This has been a very discouraging and frustrating experience. Although your technical people have been helpful, I cannot activate bank and credit card monitoring. I would not have even started this process had I known I would not be able to utilize the whole protection plan. I plan to utilize the service for this year only because I have invested a lot of time in this so far. However, I would not recommend the company at this point. It seems I must monitor my accounts  for now."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "j clive jordan",
          "Nb_Reviews": 1,
          "Date": "2017-09-23T15:59:19.000Z",
          "Titre": "So many transactions",
          "Contenu": "So many transactions - so little time.  I did not realize this service would require so much of my time reviewing warnings and deleting emails for my dozen or so accounts.  Also - it would be helpful if each warning mad it clear which account was of concern."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Yvonne Murphy",
          "Nb_Reviews": 4,
          "Date": "2018-10-11T02:50:01.000Z",
          "Titre": "When I first joined Identity Force",
          "Contenu": "When I first joined Identity Force it seemed simple to understand and check. Since you have changed it I have not understood or been able to check my identity I cant find any instructions on what to do. I am totally lost when I go to your web site."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JT",
          "Nb_Reviews": 1,
          "Date": "2017-09-15T18:34:17.000Z",
          "Titre": "I clicked through to sign up for a free …",
          "Contenu": "I clicked through to sign up for a free trial of IdentityForce using their 30 day free trial promotion link. I thought that I had signed up for a free trial, but I was charged right away, and just phoned and was told that the 30 day free trial was only for their Ultrasecure product, not Ultrasecure + Credit. This was extremely misleading, as if only one of the products was available as a free trial, the link should have gone directly to that product. I have cancelled my subscription (I had been trying for several days to get through on the phone), but IdentityForce has refused to refund me. I am very disappointed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Junni",
          "Nb_Reviews": 1,
          "Date": "2018-04-17T21:18:30.000Z",
          "Titre": "New Dashboard is a joke",
          "Contenu": "I tried to renew my freeze on credit file. However, the alert email I received has instructions that I can't do at all. I can perform the duty easily on the old dashboard.Now I can't put the freeze on credit file. very frustration!!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Hells Rebel",
          "Nb_Reviews": 1,
          "Date": "2018-05-02T18:14:18.000Z",
          "Titre": "The format was much easier when you…",
          "Contenu": "The format was much easier when you could scroll down through all of your accounts.  Being able to see everything at a glance and with much less aggravation.  It may cause me to cancel my account and seek something more like you had before."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "George D MacGillis",
          "Nb_Reviews": 2,
          "Date": "2015-10-05T03:51:17.000Z",
          "Titre": "Our date scores 6 months, Bogas info, make me pay to fix your screwups!",
          "Contenu": "Three Credit score from 04/2015, six months old.\rRed Alert, Red Alert! Old information, I move out of state a year ago after selling my house. I keep the phone number from the last state I lived in, I informed you 1 year ago of the change. And you just figured it out.\rYou say my name and number are tied to 2 old address of which only one was mine. I sold it more then a year ago when I lived in Oregon, I have lived in TEXAS for more then a year.\rI have been with your outfit for several years, well that mistake I will be correcting Monday morning.\rGood Bye ID Hello LifeLock they can't be any worse then your company!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeff from Baltimore",
          "Nb_Reviews": 1,
          "Date": "2017-10-02T00:19:44.000Z",
          "Titre": "DON'T HOLD YOUR BREATH !!",
          "Contenu": "After I first signed up for the service, I was repeatedly getting the following message from Identity Force: \"Your account has been marked for manual identity verification.  Additional steps must be taken to authenticate this account.  Please contact member services at 866-897-6278 to complete activation of credit services.\"  While I have no objection to working with their Member Service Center to finish setting up my account, they either keep you on hold for hours or promise to call you back in the order that you called (calling me back never happened).  Good luck getting your new account set up properly and in a timely fashion."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jamie B Pollard",
          "Nb_Reviews": 1,
          "Date": "2015-08-29T03:18:12.000Z",
          "Titre": "Concerned we are not hearing from you",
          "Contenu": "I recently purchased a second home which required me to take a mortgage, run credit reports, etc., and I never heard one time from your service which makes me question what I am paying for since your service says I would be notified if any of those transactions occurred.  Can you explain what I am missing?  The same is true for my wife as she was on the same mortgage, credit reports, etc.   Lastly, our son recently applied for and received his first credit card.  We have him in your service as well and there was never any notification that someone had requested credit cards in his name.   I look forward to hearing from you."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2017-09-15T12:52:22.000Z",
          "Titre": "ARRRGH!!!!",
          "Contenu": "Just enrolled on 9/12 due the Eqifax breach, Had some questions concerning site set up so I called the customer number...after 2 days and NO way to get through via phone or message, I believe the company has just taken the phone off the hook and are playing video games or binge watching Game of Thrones!!! Today after getting up and trying again, with no success, I will try emailing them, I also left my number for a call back, but won't be holding my breath. I realize we are in the Eqifax storm, but after 2 days it is very frustrating. I chose this company after researching all the others and they had great reviews, I hope it's true."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "GRD",
          "Nb_Reviews": 1,
          "Date": "2018-02-22T15:27:53.000Z",
          "Titre": "ALERTS?",
          "Contenu": "ALERT: Bank and Credit Card Activity AlertTransaction Exceeds Limit - 02/22/2018 5:06:15amThis transfer took place Feb. 20. I guess taking two days for an alert is good?Not really knowing why I spent $20 per month for this."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gerard L Saluzzo",
          "Nb_Reviews": 1,
          "Date": "2018-02-26T20:43:09.000Z",
          "Titre": "On Sunday for Enrollment for Patricia Turco at Treasure Island",
          "Contenu": "On Sunday, February 25 at around 7:00AM I tried to assist a 78 year old employee who does not have a computer to enroll. After going thru the process we waited over 20 minutes unsuccessfully to get an authentification code. I then called customer service and was told to try again but DECLINE the Dual authentification which I did. Once again no results. Tried calling back in and was on hold for another 15 minutes then finally left my number for a return call. No call back was received within the next 3 hours before I finally left work and the number I had provided for help. Patricia got a code 4 hours later but the enrollment had expired. So now what do we do?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tara",
          "Nb_Reviews": 1,
          "Date": "2017-09-05T02:50:29.000Z",
          "Titre": "No credit union of america in the Financial Transaction Monitoring",
          "Contenu": "Why is credit union of america not available on financial transaction monitoring? all that came up was credit union of america investments... this is the whole reason i signed up for identityforce! guess i'll try lifelock.."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Amber West",
          "Nb_Reviews": 1,
          "Date": "2016-11-04T17:25:09.000Z",
          "Titre": "Credit score",
          "Contenu": "I think it's crap that even though you pay a monthly fee for this service you still have to pay extra to actually see your credit score. Also think it's dumb that there is not an option for me to cancel my service online!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gary Hansen",
          "Nb_Reviews": 2,
          "Date": "2017-09-10T18:40:28.000Z",
          "Titre": "Setup of account is unnecessarily …",
          "Contenu": "Setup of account is unnecessarily difficult and there is no explanation of some of the monitoring selections.  Also no explanation of family member addition (are they covered, or does each person need to sign up)."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Patrick A Leston",
          "Nb_Reviews": 3,
          "Date": "2018-01-26T18:12:25.000Z",
          "Titre": "WHY CAN'T I GO ANYWHERE ON YOUR WEBSITE …",
          "Contenu": "WHY CAN'T I GO ANYWHERE ON YOUR WEBSITE TO GET A RECEIPT.IS THEIR SOMETHING GOING ON? SOME DECETION? CALLED IN TO ACQUIRE ONE AND YOU THINK I WAS ASKING FOR MONEY.I PAY, I SHOULD BE ENTITLED TO A RECEIPT!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gary Famiglietti",
          "Nb_Reviews": 1,
          "Date": "2017-09-19T19:32:49.000Z",
          "Titre": "Why am I not able to change my password",
          "Contenu": "Why am I not able to change my passwordWhy is there nobody that answers the phoneWhy did I not get a call back on my cell phoneAre all identity protection companies this bad with clients after money received"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Janet N Leslie",
          "Nb_Reviews": 2,
          "Date": "2017-12-13T20:50:41.000Z",
          "Titre": "IdentityForce cleared-up the problems about: Poor performance for this client.",
          "Contenu": "Some of the information you have listed for me is wrong. On the IdentityForce “Dashboard” for my account, I can see nowhere to change preferences, limits, information, etc. There is no good way to find information. And, no, your phone representative said “I can’t do that.”  It would be nice for me, a client, to be able to monitor YOU in relation to my account. You are just about to lose a client and a good reference also. I suppose this is monitored rarely, but some action should be done or I’m gone. ALERT - GOOD ALERT: I was contacted very quickly by the company and am very satisfied with the information I received, with the consideration I was given.  I am pleasantly surprised. This rarely happens!  Now I have a different view of this company."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Melissa",
          "Nb_Reviews": 4,
          "Date": "2018-04-08T19:14:41.000Z",
          "Titre": "I'm a current customer - new dashbaord is not good",
          "Contenu": "I'm a current customer.  Was doing just fine with the old dashboard, but now this new dashboard is very confusing.  For example, I get the Alert that I need to renew my Fraud Alert monitoring with the credit bureaus, and to go to \"My Dashboard>My Services>Identity Protection>Fraud Alert.  Guess what, I can't find anything called \"My Services\".  To be honest, the way the entire dashboard is laid out, everything is spread all over the place that I cannot see a simple list of features I am getting and their status (green/red).  I like the old simple list....much cleaner and all on one page.  Please bring it back.  In the meantime, can you please at least put the \"My Services\" screen on the dashboard like the guidance says?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ANDREW BOTTORFF",
          "Nb_Reviews": 4,
          "Date": "2017-09-19T17:41:51.000Z",
          "Titre": "good luck getting someone to speak to you.",
          "Contenu": "started a 30 day trial and upon further review decided to cancel the service as it does not fit my needs -- customer service is only available 8-5 m-f --- I have bee trying for 4 days and sat on hold for nearly 30 minutes each time - 3 emails have received no response and my credit card was billed the first day of the 30 day trial (not supposed to until after the trial period). perhaps this is unusual due to the equifax breach but if you are considering this service, you might try calling to see if you can get anyone on the phone -- if you are counting on them to fix a problem, might be nice to think that if needed, someone would respond. 2 stars because its got a good looking easy to use site but I dont see the value if customer service is not responsive."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Eric R. - Houston, TX",
          "Nb_Reviews": 1,
          "Date": "2017-10-09T19:58:14.000Z",
          "Titre": "So far sub par",
          "Contenu": "So far, I’ve had an inadequate and unreliable experience with Identity Force.  First, it’s difficult to trust their reporting is accurate.  For example, I subscribe to their sexual offender monitoring report. The report shows 30 registered sex offenders near my address; however, it is  He same 5 people listed 6 separate times. Second, if these reports are incorrect, then what sorts of discrepancies are in their other reports. Third, the base subscription does not provide access to all features and reports. Many reports require additional costs to upgrade for the service to be fully functional. For example, the basic service allows you to monitor credit cards but you are only allowed to monitor five credit cards.  The ability to monitor more cards is an “add-on.”"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joseph S Compofelice",
          "Nb_Reviews": 4,
          "Date": "2016-02-13T02:51:10.000Z",
          "Titre": "Lots of late and irrelevant data",
          "Contenu": "Received 25 alerts at one time built off the concept of \"exceeds credit limits\". All our charge many small three months old. Seems like I will drop this service. Very unfocused"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "michael J mcdaniel",
          "Nb_Reviews": 3,
          "Date": "2017-09-17T19:54:10.000Z",
          "Titre": "Does not pull complete banking / saving …",
          "Contenu": "Does not pull complete banking / saving transactions under the report of Bank and Credit Card Activity. Leaves out Capital One completely and only hit/miss Wells Fargo transactions."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Peter Helfen",
          "Nb_Reviews": 1,
          "Date": "2017-10-04T13:29:28.000Z",
          "Titre": "Location of personal record removal are …",
          "Contenu": "Location of personal record removal are the same months after months. The option of removal is useless. It tells you you have records to remove but then dosent let you do anything."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Scott D Tomatz",
          "Nb_Reviews": 2,
          "Date": "2017-02-20T23:17:57.000Z",
          "Titre": "Monitoring 1 person",
          "Contenu": "I thought I was going to be monitoring my wife and I. I tried driver liscense monitoring and you can only monitor 1 person. I signed up for equifax and it crashed when I was done."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "C. Daujean",
          "Nb_Reviews": 1,
          "Date": "2018-04-16T22:55:27.000Z",
          "Titre": "It's when problems rise that you can truly judge that kind of service.",
          "Contenu": "Today, I received a mail from a Bank with a Credit Card in it. Problem: mail was partially open, and on the envelope, you could see my name \"stamped\" buy pressure with my name on the stamp, like if it was carbon paper. But, Inside I found a random pre-approval no name card. So far, everything point to the scenario of someone opened a account using my name and stole the card from the envelope to replace it by a random one. After, explained that to on the phone to IdentityForce member support, the suport member answer was sort of \"oh, we don't cover that\"quite rudely. No advice, nothing. As much I know, to open a bank account, you must prove your ID... Is that not in their range? Or at least telling me what action I should/could take.Then, so far, bad experience: I'm pretty disapointed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kevin S",
          "Nb_Reviews": 1,
          "Date": "2018-08-30T04:54:07.000Z",
          "Titre": "Disappointed in things missed",
          "Contenu": "At first this company seemed OK.  But the service is not very good. Recently, I had fraudulent activity on  a Visa card. The bank alerted me and I closed that account and opened a new account. ID Force didn’t alert me of the new account, although a free (less robust) service I use alerted me! Also, my wife uses a well known competing service. They actually alerted her about a hacked breach with one of our service providers...BEFORE that company even alerted us themselves! Identity Force, not so much. Unfortunately, I paid for a full year to save a bit. I’m only a few months into it, and wish I had gone month to month. According to their web site, no refunds are available if you cancel early. That’s too bad. Still, the service does provide some peace of mind. But for the price, I’d rather join my wife on Life Lock."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rosalyn Carlton",
          "Nb_Reviews": 1,
          "Date": "2018-04-29T13:35:14.000Z",
          "Titre": "IdentityForce Web Site needs improving",
          "Contenu": "The user interface of IdentityForce is limited. I hope the technology IdentityForce uses to monitor customers' identity is better than the company's web site!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Natalie",
          "Nb_Reviews": 4,
          "Date": "2016-08-19T19:47:57.000Z",
          "Titre": "Waste of Money",
          "Contenu": "Six months ago my identity was stolen, and someone applied for many dozens of loans and credit cards in my name. I manually applied for credit freezes with all 3 agencies using my police report. But I thought, given that I only get 1 free copy of the report per year, that Identity Force's alerts would be helpful to see updates to it. Not so much. Any little change happens and I get a \"red alert\" SMS page and an email. Click through to the site? The notification tells me absolutely nothing of value. Paid off a student loan. I get a red alert notification that my loan holder updated their information on my report. Not what they updated,  just that it changed. My credit freeze is finally implemented 8 weeks after I overnighted it to Experian? Same deal. Experian has updated my account. How? With what? Why? Not the best use of $250/yr."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "lola",
          "Nb_Reviews": 1,
          "Date": "2017-11-15T18:17:28.000Z",
          "Titre": "Since I hired Identity Force",
          "Contenu": "Since I hired Identity Force, I have had my bank account hit ($2000 removed) and my email hacked with all my contacts receiving a bogus letter asking for $$$."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JAY OBERG",
          "Nb_Reviews": 1,
          "Date": "2018-04-24T03:03:35.000Z",
          "Titre": "EITHER UPDATE SCORES OR GET RID OF…",
          "Contenu": "EITHER UPDATE SCORES OR GET RID OF THEM. SEPT OF 2017 REALLY? ALL YOU EVER SEND ARE BANK PAYMENT ALERTS OR THE MONTHLY 83.XX INSURANCE FOR EACH OF US"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Scott D Heflin",
          "Nb_Reviews": 4,
          "Date": "2017-09-10T17:35:11.000Z",
          "Titre": "I hope the service works better than …",
          "Contenu": "I hope the service works better than the interface. I signed up for my wife and myself, and even paying two full subscriptions I cannot get the software to accept the second drivers license number (exceeds max error). Tried to terminate her coverage, but cannot do that online. Online support contains NO help on how to use the program; only offers publicly available advice on what to do if you are a victim of identity theft; I ALSO want to know how to maximize the use of their tools. A number of product services listed on the My Services tab show as inactive, but when I try to activate them, the program indicates they are already active. I don't know if I am being protected or not.  The only thing I know for certain is that they have all my personal data. Come on, guys. This does not give me any confidence that you know what you are doing! Give me some feedback and I will revise my opinion. If not, I am moving on."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alice Lee",
          "Nb_Reviews": 1,
          "Date": "2015-08-25T15:15:14.000Z",
          "Titre": "Didn't get any call or e-mail when someone try to open account with my info.",
          "Contenu": "Just received a new credit card which I didn't apply for it.  Just wish I get some e-mail or call when this person started to apply under my name."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Anthony",
          "Nb_Reviews": 2,
          "Date": "2018-03-22T18:21:32.000Z",
          "Titre": "The original system was much easier to undestand.",
          "Contenu": "The original system was much easier to understand and had everything at my fingertips.  This seems  unnecessarily confusing.  Don't like it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Julie D Stephens",
          "Nb_Reviews": 1,
          "Date": "2016-01-22T14:52:22.000Z",
          "Titre": "Response to emails/questions about account",
          "Contenu": "I have had Identity force for months and get alerts every now and again, which is awesome. But I can not get a response if I have questions. Sad."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "pamela j swanson",
          "Nb_Reviews": 2,
          "Date": "2015-06-22T19:51:11.000Z",
          "Titre": "wrong name",
          "Contenu": "you have on one of your identify thefts.\r    pamela y swanso is not my name and I have never lived in any of those places..\r   how sad .."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 1,
          "Date": "2017-08-09T00:20:47.000Z",
          "Titre": "Why does a Google search of my phone …",
          "Contenu": "Why does a Google search of my phone number shows all my information however Delete Now report does not show these search results"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "AJ",
          "Nb_Reviews": 2,
          "Date": "2017-06-23T00:05:44.000Z",
          "Titre": "This is regarding my recent experience …",
          "Contenu": "This is regarding my recent experience over the last couple of days when I got a mail about some SSN alert. When I tried to log in, my log-in was blocked requiring two-factor authentication - this would have been ok but your system had old phone # rather than the updated one and it didn't give me another option such as using email. I had called several times into your customer service to no avail, and finally when I got through, I was on hold for over 2 hours but didn't get anybody on the call. I did get a call later today when the rep changed authentication to email but suggested \"it's only one-time change to use email for authentication\". It should be up to me as the account owner, whether I want to use phone or email for authentication and my account should not have been set up for phone authentication with old phone #. I hope this doesn't happen again and the experience improves going forward! Also, I am still waiting to have this ticket resolved, which has been open for over a month now."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David N.",
          "Nb_Reviews": 2,
          "Date": "2017-09-13T01:57:31.000Z",
          "Titre": "So far NOT impressed",
          "Contenu": "So far, not impressed.  Set this up the day before yesterday and been working on it since trying to input information.  I've added my wife numrous times, but every time I go on, she's not there.  Secondly, she and I share an email address, but it won't let that happen, so I had to use an email I hardly ever check.  Thirdly, I have several questions so called customer service.  I realize that with the Equifax breach there may be longer wait times, but I've now waited 30 mins and no one has answered.  In addition, it doesn't give you a time frame of how long....if my call is so important to you, as your message says, you would answer.  I'm going to now press 1 for a call back, we'll see if that actually works, it never has in the past for any other company I've done that with, just a good way to get you to hang up and ignore you.  If I don't get a call back, I will be canceling my account as it does me no good if I can't set it completely up, and I can't get answers on how to do it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "A. D. Wade",
          "Nb_Reviews": 1,
          "Date": "2018-04-11T17:25:41.000Z",
          "Titre": "Sex Offender alerts are simply false alarms, as no one has ever used my address for anything.",
          "Contenu": "The Sex Offender monitoring alerts are a COMPLETE waste of my time.  I have asked how to turn such notices OFF, yet I am told they cannot be turned off.  I get one every few weeks and to-date, not a single one has ever lived on my road, or tried to use my address for nefarious purposes.  It's just like the little boy who CRIED WOLF.  The notices are so commonplace now, I just IGNORE such from IdentityForce.  For me, it's a useless, time consuming waste.  When it comes time to renew, if I still cannot turn OFF such notices I will no longer be a customer.REPLY from A.D. Wade\"Please feel free to disregard the notifications.\"  The whole point of my complaint is, you are a notification company hired by me to watch over my information.  WHY should I have even have to review repetative, false-notifications and waste time in doing so?  WHY can I not simply turn off this type of notice?  We put a man on the moon in 1969, almost half a century ago.  Is it too much to ask to be able to simply TURN OFF unwanted notifications??"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mr. Harris",
          "Nb_Reviews": 2,
          "Date": "2017-09-25T19:56:43.000Z",
          "Titre": "IdentityForce was quick to take my …(",
          "Contenu": "IdentityForce was quick to take my money and charge my account when I added my wife to the service.  However, I see no options to enter her social security number or credit cards in her name.  If it's out there, it's very well hidden.  That, in combination with the limited office hours, makes it a bit frustrating to be a new customer.  I called last weekend with a support question.  There was a long queue so I chose the option to leave my number and have them call me back.  They NEVER called me back.Starting to question the wisdom of choosing this service.OK, IdentityForce called me back and informed me that my wife would have a wholly separate account to protect her identity.  I assumed we would have a shared dashboard somehow with both our information.  Not how it works!  My bad.  (interesting that when I posted a negative review I got a call very quickly, but when I called for a support issue I was never called back).  Overall, I'm OK with things now.  My misunderstanding of how the service works led to my above review."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dale R Peay",
          "Nb_Reviews": 3,
          "Date": "2018-01-27T14:39:15.000Z",
          "Titre": "A little disappointed that adding my …",
          "Contenu": "A little disappointed that adding my spouse doubled the monthly price of the plan. Cancelling today and going to LifeLock."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Duane Hansen",
          "Nb_Reviews": 1,
          "Date": "2017-03-09T06:47:56.000Z",
          "Titre": "Lots of Alerts but no help",
          "Contenu": "I get a lot of alerts but no support or help[ on what actions I can take, I can't even find what the alert is about."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert Meyer",
          "Nb_Reviews": 1,
          "Date": "2017-11-16T23:07:02.000Z",
          "Titre": "NO SMARTPHONE",
          "Contenu": "Happen to be someone who does not have a smart phone and having to get a text to login to my account is a real pain."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert Bowles",
          "Nb_Reviews": 1,
          "Date": "2017-12-04T23:28:17.000Z",
          "Titre": "Not receiving alerts or returned phone calls",
          "Contenu": "I have called twice now on the weekends for assistance.  I have pushed 1 on the voice menu to be called back by the first available service associate.  I have never received a call back.  Your weekend coverage is a completely failed service.  Either have your representatives return calls as promised, or find new representatives that will honor your service commitments.  Same has happened with email.  I sent an email requesting assistance on Friday, November 1, 2017, to date never received a call back or returned email.I setup to receive credit card alerts for purchases over $300.  I have made three purchases over $300.  I received alerts on two purchases, but not third purchase.  I called in to report the problem, the customer service representative told me it could take up to 10 to 14 days to find the problem.  Totally unacceptable.  Based on these three charges, the statistics would prove that I am only receiving alerts on 66% of transactions over $300.  Thus I am paying for services that I am not receiving.  I have deleted the credit card account and reestablished it hoping this may resolve the problem."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "RONALD B KUEHNE",
          "Nb_Reviews": 1,
          "Date": "2017-07-26T15:11:18.000Z",
          "Titre": "I have large expenditures over $800 …",
          "Contenu": "I have large expenditures over $800 from various credit cards and you notify me nine days later, are you kidding ."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Josh o.",
          "Nb_Reviews": 1,
          "Date": "2015-08-04T21:13:28.000Z",
          "Titre": "Why Cant you Cancel Easily!???",
          "Contenu": "No way of Canceling Identity Force and do not want to willingly pay for a service I cannot cancel straight forward"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tracy Shepard",
          "Nb_Reviews": 1,
          "Date": "2017-07-11T16:23:57.000Z",
          "Titre": "Cant get our bank in info entered even …",
          "Contenu": "Cant get our bank in info entered even though IT IS the correct pass word.Credit score is hardly ever updated."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lauren Mitchell",
          "Nb_Reviews": 1,
          "Date": "2017-11-11T09:34:03.000Z",
          "Titre": "It has been over 24 hours since paying …",
          "Contenu": "It has been over 24 hours since paying off my car loan and debt consolidation loan but no notifications!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Grumpysgal",
          "Nb_Reviews": 2,
          "Date": "2017-09-11T17:14:38.000Z",
          "Titre": "ISSUES ALREADY-AND UPDATE",
          "Contenu": "Only been member for 2 days and already having trouble with not being able to find alerts and information that I'm being notified for. Alert says click on \"credit bureau dispute form link\" on my credit report which is  no where to be found on my dashboard.  Also having website issues trying to \"verify my account\" so I can activate the delete alert, but can't get a response by email.  Tried to call regarding billing issues, left call back number and was never called back.  On hold for 25 minutes before being able to talk to someone about this so not calling back about that.  Doesn't make me feel very secure if I get notified about a theft issue that I need to discuss with these folks!UPDATE: I got a call today from Identity Force and resolved my issues. Wendy explained that since the Equifax breach they have been inundated with calls, which is understandable. I also found a voice mail returning my request for a call back, albeit 2 days later, but called back. I do think it's sad that the only way I was able to speak with anyone was to leave a negative review, but in light of the Equifax information I'm willing to give this company another try."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "William Clarkson",
          "Nb_Reviews": 1,
          "Date": "2018-05-04T14:28:44.000Z",
          "Titre": "Filled out all the fields and entered…",
          "Contenu": "Filled out all the fields and entered saved only to get an error message and to call customer service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert T Pollina",
          "Nb_Reviews": 1,
          "Date": "2018-04-20T22:27:35.000Z",
          "Titre": "Web site has issues working with both…",
          "Contenu": "Web site has issues working with both Safari and Firefox on Mac.  Submit button does not always work."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "S. S.",
          "Nb_Reviews": 1,
          "Date": "2017-09-13T16:34:21.000Z",
          "Titre": "Very disappointed that Delete Now …",
          "Contenu": "Very disappointed that Delete Now service is not available and am considering cancelling my account."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Salvatore A Grisafi",
          "Nb_Reviews": 1,
          "Date": "2018-03-13T01:53:44.000Z",
          "Titre": "Credit alerts are given with no…",
          "Contenu": "Credit alerts are given with no explination on what the issue is or what you should do about it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joseph  H Hoyt",
          "Nb_Reviews": 1,
          "Date": "2015-08-15T08:56:24.000Z",
          "Titre": "You need an iPhone and iPad app",
          "Contenu": "I find it very cumbersome to navigate your site on my mobile devices where I use 99% of the time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bob",
          "Nb_Reviews": 1,
          "Date": "2018-04-25T15:42:13.000Z",
          "Titre": "I do not like the new dashboard",
          "Contenu": "I do not like the new dashboard. It is to confusing for people my age! It is like a cartoon."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rebecca Young",
          "Nb_Reviews": 2,
          "Date": "2017-06-22T13:10:10.000Z",
          "Titre": "Not user friendly",
          "Contenu": "Not user friendly, pain to work with, can't get ahold of them.  I keep forgetting to cancel my subscription, because I honestly don't think it's helping me with anything.  I used to have a great ID guard that alerted me if somebody was using my SSN to open a bank account or something.  This only monitors existing items, which I already do on my own.  Then when I got an SSN alert yesterday, saying my SSN had probably been compromised, I got a report that gave me no information (literally, just my SSN) and \"If you have questions contact us at _\" and it was blank.  So I tried calling the 1-877 number and four times was immediately put into a \"the number you have called is unavailable.  Please leave a message.\"  There is no way, that sounds more suspicious than the spam phone calls I get.  Finally, I got through and the recording said that my estimated hold time was 56 minutes.  It gave me the option to leave a callback number, which I did, and I did not receive a call back until about 7PM that night, approx. 5 hours later.  I was busy, so I didn't pick up, so I never did resolve the issue.  I'm not dealing with that again.  For $13 a month I expect better service than that.  Now I'm trying to cancel and can't figure out how to do that either!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Creighton T DeSimone",
          "Nb_Reviews": 1,
          "Date": "2018-03-11T20:46:44.000Z",
          "Titre": "Your javascript doesn't always work and…",
          "Contenu": "Your javascript doesn't always work and that's actually frightening. I have been unable to add a bank in \"Financial Transaction Monitoring\" because if I search for my bank nothing happens when I click search. If I hover over one of he provided services (like American Express) I can see the java script it's trying to run: Run script \"invokegotologinform('12')\"Seeing that and not being able to actually find my bank is a bad experience. So is the lack of high resolution images on all your buttons. The 'close window' button as well as the image buttons for 'edit' and 'activate' are low resolution and look bad on my retina display monitor. This is something that was forgivable a few years ago, but in 2018 tells me you don't update your site very often. Even low end computers have high-resolution screens.Oh, I'm also not crazy about using 2-factor over SMS. If you take security seriously you would know that SMS is easily hackable / with a little bit of social engineering and a call to a cellphone carrier. Maybe use something like Authy? I don't know, just spitballing, but I shouldn't have to. Anyway seeing little cracks like this don't actually instill me with confidence in this service. I just signed up for a year of this. Hope to see things improve."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 2,
          "Date": "2017-07-14T00:12:13.000Z",
          "Titre": "Delayed alerts",
          "Contenu": "Started the trial. I get credit card alerts 3-5 days after they happen. Useless."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Anxious in Denver",
          "Nb_Reviews": 1,
          "Date": "2018-04-12T15:10:12.000Z",
          "Titre": "Poor first impression",
          "Contenu": "I'm sorry, but your website is obviously new and I have just paid $240 to debug it for you! You should, at least, offer a discount for the first year of service if you want your customers to tolerate the new \"features\" of your website. My first hint came when I filled out my profile. Near the end of the process you are suppose to acknowledge the \"Terms and Conditions\" but the link didn't work, so I couldn't review them. Then, even if I had the chance the review the \"Terms and Conditions\" the check-off box was apparently invisible. Only after working with Shyesha (sp?) and going thru the profile three times did we realize the \"bug\".BTW - after you give Shyesha (sp?) a raise for her professionalism I suggest you get her a nice, quiet office nearby. When I worked with her it was really hard to understand her because of the lively conversations going on in the background.So far, in the first 24 hours I have received two alerts, of which only one could be read on the website - the other never loads. There are other bugs - to many to mention - especially as a paying client. I had a friend who owned a successful crane company. He use to say that when he arrived at a job site he could tell immediately, based on the condition of jobsite, what an operators financial books looked like. Right now your website is not projecting a good image for IdentityForce. I only hope your website is secure and my personal data is actually protected."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "William Pierce",
          "Nb_Reviews": 1,
          "Date": "2018-04-13T19:23:53.000Z",
          "Titre": "Too many menues saying how good you are…",
          "Contenu": "Too many menues saying how good you are , lots of potatoes little meat"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tom Jelen",
          "Nb_Reviews": 4,
          "Date": "2016-09-23T11:29:06.000Z",
          "Titre": "search accounts window just searches and then closes",
          "Contenu": "search accounts window just searches and then closes nothing happens"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Annette Jaret",
          "Nb_Reviews": 2,
          "Date": "2017-09-09T23:20:29.000Z",
          "Titre": "I am having too many issues and cannot …",
          "Contenu": "I am having too many issues and cannot get customer service"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Karen Vargas",
          "Nb_Reviews": 2,
          "Date": "2018-01-12T17:02:42.000Z",
          "Titre": "I have just started my 30 day free …",
          "Contenu": "I have just started my 30 day free membership, and entered all my information into My Services.  The Fraud Alert Reminder is poorly worded for someone who already has a Fraud alert in effect.  I would like a reminder, but not starting today, because I didn't set my Fraud alert today. But I didn't know that was going to happen.  I clicked the ONLY button available, which was Set my fraud alerts. When I saw that took me to Expedian, I closed that tab (since I already have an alert) and went back and now I had another link I could click on \"I set my fraud alert, remind me in 90 days.\" That is true for me - I did set it - 2 months ago. So I clicked on THAT thinking it would give me a way to enter the date I set my fraud alert. But it didn't - it just says \"okay, we'll remind you in 90 days.\" Well that's not right. So I called the phone number to have the reminder either taken off or made so they could change the date, and the woman I spoke to said she couldn't do that. That it was impossible. I think that's unbelievably lame. I'm sure I'm not the only person to sign up for a new IdentityForce account who already has a Fraud Alert in affect. So far, on my first day, I'm not impressed with the IdentityForce experience because 1) that ought to be easy to fix; and 2) the woman on the phone was just not helpful right up front. Since I previously had an experience with a different identity service, I know what their customer service was like, and this one was much worse. And I switched because the reviews for IdentityForce are much better. If I had known that your customer service was worse, I wouldn't have changed.  It's my free 30 days - I still might."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "erob",
          "Nb_Reviews": 1,
          "Date": "2018-04-07T01:03:25.000Z",
          "Titre": "new dashboard not as informative as…",
          "Contenu": "new dashboard not as informative as prior"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Edgardo A Hernandez Pons",
          "Nb_Reviews": 1,
          "Date": "2016-07-16T18:30:02.000Z",
          "Titre": "Can't reach after hours",
          "Contenu": "Useless if can't reach during eeekends"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "raymond cheng",
          "Nb_Reviews": 1,
          "Date": "2018-05-04T19:21:12.000Z",
          "Titre": "unable to finish registration online"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T04:14:18.000Z",
          "Titre": "McAfee caught my information had been…",
          "Contenu": "McAfee caught my information had been hacked and posted on the Dark Web and you didn’t even notice that I was hacked!    Not a very good feeling about your capabilities."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Olbohunk",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T17:51:50.000Z",
          "Titre": "Satisfied overall.",
          "Contenu": "Satisfied overall.Recent changes that are not being addressed is concerning.Daily alerts are no longer listed in chronological order on the webpage.Also, the regular alerts are being sent 3-4 days AFTER the event."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Scasey",
          "Nb_Reviews": 3,
          "Date": "2022-01-09T15:14:11.000Z",
          "Titre": "Oustanding Representative!  Weak Phone and Website Service!",
          "Contenu": "I would rate the representative, Nicole ☆☆☆☆☆.  She handled my issue professionally, efficiently, and promptly.However, the wait time on hold was long, all three times.  My call was dropped twice.  But I had to wait and call back because the website had not been updated with my credit card information from last year.I appreciate your efforts to improve this aspect of customer service."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Richard Dukes",
          "Nb_Reviews": 31,
          "Date": "2021-03-07T13:29:54.000Z",
          "Titre": "It is difficult to review this service…",
          "Contenu": "It is difficult to review this service since they are continually checking but you only hear about it when there is a problem. Still, it is comforting to know that there is an extra line of defence. The service is certainly not cheap hence the lower than perfect score. It does seem to work though as already had 1 notification."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Vincent Bradbury",
          "Nb_Reviews": 1,
          "Date": "2020-06-05T14:49:35.000Z",
          "Titre": "Right now I am NOT happy",
          "Contenu": "Right now I am NOT happy.  I paid for the service up front for one year.  I presume I am close to being adequately protected as I have had no bad reports, etc.  But I have had one reoccurring glitch that I cannot seem to get worked out and do not feel I am getting the proper support from the company to get resolution.  I feel I am spending TOO much time doing the work to try to get the glitch fixed and not enough time enjoying the benefits of the service (protection, peace of mind) I paid for.  Will keep trying for a limited amount of time, but may then cancel service and look for another provider I feel is more customer friendly if I cannot get satisfaction."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ted Fischer",
          "Nb_Reviews": 1,
          "Date": "2019-06-06T20:24:57.000Z",
          "Titre": "difficult to cancel",
          "Contenu": "difficult to cancel, which always leaves a bad taste in my mouth . . . if you are offering an honest product with honest benefits to the consumer, why make it difficult to cancel?  Also very expensive"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stephen Burkett",
          "Nb_Reviews": 1,
          "Date": "2023-04-18T03:38:50.000Z",
          "Titre": "My transactions have not been monitored…",
          "Contenu": "My transactions have not been monitored for a year - I have contacted them several times and get told that they will get back to me with no response - I think I am paying for a service and not getting everything that I am paying to have"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-12-26T22:16:56.000Z",
          "Titre": "I don’t actually know what you are…",
          "Contenu": "I don’t actually know what you are doing to protect my information.  I pay $10.99 month for what exactly."
        },
        {
          "Note": 3,
          "Lieu": "PH",
          "Pseudo": "Yuri",
          "Nb_Reviews": 1,
          "Date": "2022-02-14T21:42:07.000Z",
          "Titre": "It was a good experience dealing with…",
          "Contenu": "It was a good experience dealing with them. Staff were friendly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tina Smith",
          "Nb_Reviews": 3,
          "Date": "2018-04-24T11:30:53.000Z",
          "Titre": "It was difficult to get started after…",
          "Contenu": "It was difficult to get started after the Equifax breach.  Slow responses from Support.  Then, some area has to use any server other than Safari.  I downloaded Firefox, but still got the same message.  Credit report is not updated automatically.  Now, I see I'll be charged $339.00 when renewal comes up for only myself and my husband.  Won't be renewing with this company."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John  W Coleman",
          "Nb_Reviews": 1,
          "Date": "2017-10-20T15:57:14.000Z",
          "Titre": "Plan content",
          "Contenu": "Disappointed that there isn't a function in this plan that provides overall credit scores from the 3 major credit reporting companies that is accessible in my services.  When I called customer service regarding this service I was advised that that feature was an additional $14.99 a month.  that represents a 74% increase in price for one feature.  I will probably research other companies."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Edward J Dittlinger",
          "Nb_Reviews": 1,
          "Date": "2017-10-01T02:27:17.000Z",
          "Titre": "It takes entirely to long to talk to an …",
          "Contenu": "It takes entirely to long to talk to an agent.  When requested I put my name in que to be called back by the next available agent and it has been 5 days and I still haven't heard from anyone.  Now I'm on hold and it has been over 45 minutes.  Since I already know that my name and SSN have been used for identity theft and I'm looking for guidance these delays are unacceptable."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chris A Simpson",
          "Nb_Reviews": 1,
          "Date": "2017-10-11T19:26:05.000Z",
          "Titre": "Confusing service",
          "Contenu": "Confusing service.  I was under the impression that I was paying for protection and service ... That there would be monitoring (checking) for threats and action initiated if threats were detected.  However, in the \"Frequently Asked...\" section online are instructions on what I should be doing that include monitoring and what I should do/notifications if I detect fraud ....  So what am I paying for????????"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Arlena Tuttle   Harbourne",
          "Nb_Reviews": 2,
          "Date": "2017-09-19T01:30:05.000Z",
          "Titre": "I have been trying to speak to you for …",
          "Contenu": "I have been trying to speak to you for 4 hours! There is no way to cancel my daughter Kimberly Harbourne's membership. I did not know I could not add her for free. There is no where on this web site even to cancel the membership it self. Please send me an email telling me you did this. Thank you Arlena and do NOT show the name Tuttle on my account when it is opened."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Russell Mccallion",
          "Nb_Reviews": 1,
          "Date": "2017-10-25T20:40:53.000Z",
          "Titre": "When I asked Customer Service how was I …",
          "Contenu": "When I asked Customer Service how was I to register my wife for monitoring when she uses my eMail address for her eMail I was told your software stipulated she must have her own eMail address so make one for her. When I asked how she would be monitored I was told via her \"fake\" eMail ID. Doesn't sound right to me! As an aside, the initial contact was unable to use \"please\" when it\"s use was advisable. New world!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patricia  L Bernhardt",
          "Nb_Reviews": 1,
          "Date": "2017-10-09T22:48:24.000Z",
          "Titre": "10 minutes after I signed up with IDF I …",
          "Contenu": "10 minutes after I signed up with IDF I started receiving email from at least 25 sources I never signed up to receive.  It is very annoying to unsubscribe each emailer and takes up a great deal of my time.  I haven't signed up or given my email address to another venue or vendor except you so whoever you sold my info to is sending me all these emails.  Please do not forward my information to anyone else without my permission.P Bernhardt"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Christopher  K Conley",
          "Nb_Reviews": 3,
          "Date": "2016-01-10T16:21:54.000Z",
          "Titre": "Good platform but why go 1/2 way?",
          "Contenu": "This is a good platform , however, there should be the option to re-run credit reports monthly , isn't the idea to stay on top of your credit and all the factors that comprise it? Being able to do this loses a gap that now exists . I am contemplating changing to a service that does this, I believe there is at least 1 and will check it out.  This company should do this ASAP in my opinion."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Scott s Ruderman",
          "Nb_Reviews": 2,
          "Date": "2015-10-09T15:42:06.000Z",
          "Titre": "amex card compromised",
          "Contenu": "recently my amex credit card ending in 3003 was used for fraudulent transactions. American Express contacted me and then declined the attempted fraudulent purchases. cancelled the card and replaced with new card\rNot sure if Identify force should have picked up on this case of attempted fraud. should I have expected some type of notification from Idently force. not sure what I am paying for?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Merle A D'Alba",
          "Nb_Reviews": 1,
          "Date": "2016-01-01T12:47:59.000Z",
          "Titre": "Services don't seem to be working properly",
          "Contenu": "This was my first time logging on. The initial set up has taken about an hour. Everything worked fine except the credit score/credit report. The \"wheel\" has been turning continually for about 30 minutes with no result. I have given up and will try again another day. If it doesn't work again, I will try and contact you by phone. So all in all, a bit frustrating."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shaun J Mullen",
          "Nb_Reviews": 1,
          "Date": "2017-03-15T18:18:12.000Z",
          "Titre": "Average",
          "Contenu": "Its really hard to justify if this service is of any use as all you get are the occasional emails with zero content really pertaining to anything worthwhile.It is possible that everything is done in the backend and without hassling the 'user' but without getting any type of report indicating if your identity/accounts have been tried to be obtained its really hard to say if thats the case.I don't think its bad it just might not be for me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "EW",
          "Nb_Reviews": 1,
          "Date": "2015-07-21T01:43:58.000Z",
          "Titre": "Poor Customer Service - Update",
          "Contenu": "I have been very disappointed with the service I have, or should I say, have not received.  I am cancelling my membership.\r Update: I was contacted by the Member Services Specialist/Manager and am willing to retain my membership on a trial basis for two months.  I have updated to 3 stars and will further update if Identity Force can stand behind their promise to resolve the issues."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Timothy J Shoenfelt",
          "Nb_Reviews": 2,
          "Date": "2015-09-28T22:35:55.000Z",
          "Titre": "Not  very informative",
          "Contenu": "My wife and I want to have the highest quality and service provided. We want the best protection for our credit and security.  So far we feel that the updates and information reporting is lacking.  I believe Alot could be resolved if their were an actual mobile app for quick access to our information. So we are going on the theory that no news is good news."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Vanessa M Smith",
          "Nb_Reviews": 2,
          "Date": "2015-07-04T18:44:21.854Z",
          "Titre": "Trouble with Scrambler",
          "Contenu": "The only issue I have had is the keyboard scrambler interacts with my other internet security program (Webroot) and causes all my typing to be visibly scrambled so that I don't know what I am typing.  I have had to uninstall IDForce from my laptop and have not yet resolved the issue.  Otherwise I am pleased with the thoroughness of the services offered."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mireille Millet",
          "Nb_Reviews": 3,
          "Date": "2016-09-04T20:09:32.000Z",
          "Titre": "Websites with my name",
          "Contenu": "I just googled my name feeling pretty secure that not much would pop up but many professional listings sites came up giving either totally wrong, misleading, or very old information about me. I was not informed that these websites mentioned me. If I could figure that out by googling my name, why didn't IDF find those and alert me?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eric S Hazelrigg",
          "Nb_Reviews": 1,
          "Date": "2015-08-08T16:08:50.000Z",
          "Titre": "account number",
          "Contenu": "When I had an identity theft, I called your number.  You were closed and the recording said to call AIG and gave me a number and a policy number to report to them.  The policy number, according to AIG, was a military number and confused the people there.  I looked everywhere in my account on line and couldn't find any other policy number."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Debra A Watkins",
          "Nb_Reviews": 3,
          "Date": "2017-05-02T17:33:27.000Z",
          "Titre": "I find it difficult to believe that …",
          "Contenu": "I find it difficult to believe that this would be effective when I have transactions over the limit on the 21st and no notification until the 2nd of the following month.  This does not meet my expectations and don't see any preventive value that I would  get from my card providers anyway.  I am thankful that I have not been in need of your services as if it takes this long to notify I cannot imagine what it would take to cure or even delay significant damage to my accounts by outside forces."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "george",
          "Nb_Reviews": 2,
          "Date": "2018-04-11T18:23:51.000Z",
          "Titre": "The new website is terrible",
          "Contenu": "The new website is terrible!  Why did IdentityForce  mess with the previous layout, which was well organized and easy to navigate?The new site makes it very difficult to locate information.  I find that I am spending much more time trying to find and open places in the site.  It's very frustrating."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ron F.",
          "Nb_Reviews": 2,
          "Date": "2017-08-01T15:29:53.000Z",
          "Titre": "Credit scores and information are as …",
          "Contenu": "Credit scores and information are as much as 2 months behind other sites.EDIT:Ok, The following are scores taken from three other credit sites on August 1, 2017. One site is owned by Transunion, one by Equifax and one by Experian.My average credit score from Transunion is 802. Identity Force says it is 742.My average credit score from Equifax is 798. Identity Force says it is 752.My average credit score from Experian is 798. Identity Force says it is 701.Consequently I have canceled my account and moved to another site."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert N Boyd",
          "Nb_Reviews": 1,
          "Date": "2017-09-09T15:47:07.000Z",
          "Titre": "Input Validation",
          "Contenu": "Input ValidationI was careful while inputting my bank account and credit card numbers but the UI provides no validation or verification that what I have entered is valid and being actively monitored. I could have made a mistake, there is no way for me to see that my accounts are protected."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Frank Edmonds",
          "Nb_Reviews": 1,
          "Date": "2018-05-02T22:21:58.000Z",
          "Titre": "Not sure what is going on",
          "Contenu": "Not sure what is going on. New member - tried to get my wifes info put in, I paid for both of us... or at least at sign up I did. I input all my bank account info and it appears to have not taken... when I tried to input again, I got a red bar saying to call customer service but when I tried to click on the call button, it did not work? So I googled and got a CS number - called and was on hold for over 10 minutes... at work so I had to go. Will try to figure this out after work. If I cannot get any satisfactory results, I will cancel tomorrow."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ga2Nc",
          "Nb_Reviews": 1,
          "Date": "2015-08-06T15:31:21.000Z",
          "Titre": "Not what I thought I was signing up for!",
          "Contenu": "I signed up for a plan/coverage after reading and researching for weeks. I read reviews, asked for opinions from friends, etc. I have had my SS# used to open a cell phone account, so I wanted my information monitored. Long story short, all of my research didn't pay off. I had my info used again to open another cell phone account, and it wasn't picked up by Identity Force. Their reason was because I didn't choose the right plan/coverage. Needless to say, I cancelled my plan immediately! Total waste of money!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "LJ",
          "Nb_Reviews": 2,
          "Date": "2018-04-26T13:25:00.000Z",
          "Titre": "Time Delay in Alert related activity",
          "Contenu": "I did a follow up on a credit alert from Equifax concerning activity on a credit card that I did not use in many years.  After spending considerable waiting time contacting Bank of Amer - fraud dept it turns out the card was closed which triggered the alert.  That is good.  However, the card was closed over 3 weeks ago.  Is there anyway Identity Force can put some pressure on these credit monitoring folks to forward this information quicker?  A lot of damage could have been done if the activity had been true fraud.  I did appreciate getting the Alert."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Arlo Bauer",
          "Nb_Reviews": 1,
          "Date": "2017-08-23T16:50:46.000Z",
          "Titre": "Multiple duplicate alerts",
          "Contenu": "You often issue multiple alerts for a transaction. I verify by checking each account including the checking account. Getting to the point where I am ignoring alerts assuming that they are duplicates which I have already checked out. I also receive alerts that are older than 6 months."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eric Thompson",
          "Nb_Reviews": 1,
          "Date": "2017-09-16T01:31:41.000Z",
          "Titre": "I've tried to contact Identity Force …",
          "Contenu": "I've tried to contact Identity Force for 2 straight days to no avail. I have chosen to be called back but have yet to a receive a call back. I've waited on hold for 3 straight hours for 2 days straight. I understand the breach but this is kind of ridiculous. I haven't received any updates to my tri-monthly credit score which should've populated an update as of yesterday. I would appreciate to know what exactly is going on with that. I want to give you guys a 5-star rating but it's hard when no one is available to answer your questions."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ronald Larsen",
          "Nb_Reviews": 1,
          "Date": "2017-09-18T22:12:38.000Z",
          "Titre": "I am a new customer today and already …",
          "Contenu": "I am a new customer today and already have problems trying to input information.   When in \"Add accounts\" it says not compatible with the Safari browser and indicates should download Chrome or Firefox.  I have done so and even in Firefox I still get the same message."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Giovanni Tallino",
          "Nb_Reviews": 4,
          "Date": "2018-03-28T23:47:39.000Z",
          "Titre": "Don't wake me up!",
          "Contenu": "Everything is fine, but I do not appreciate the messages in the middle of the night when a bank or credit card transaction takes place. Last night I was awakened at 2 a.m. by the ding-a-ling of a text message. Can you guys wait until 6 or 7 in the morning (Alabama time)?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JLR - TN",
          "Nb_Reviews": 4,
          "Date": "2017-11-11T14:04:55.000Z",
          "Titre": "Credit scores reported on IF don't look to be up-to-date",
          "Contenu": "I just signed up for IF, after getting a notification from Identity Guard that my new credit scores are available. I decided to see what was the current best reviewed credit monitoring company, after using Identity Guard for the last several years (with no major complaints). After deciding to sign up with IF, I note that my credit scores reported (by Identity Force - after signing up for a new account with them) look to be the old numbers previously reported to me by Identity Guard and not the current ones (which are better). A bit disheartening as a new IF customer."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DC",
          "Nb_Reviews": 1,
          "Date": "2018-02-20T18:30:40.000Z",
          "Titre": "Wendy was very helpful and patient in…",
          "Contenu": "Wendy was very helpful and patient in explaining the details of the Identity report. She took her time and explained things fully. The customer service person I had just before her sounded impatient and condescending. I would give Wendy a 5, and the rude guy a 1!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "matthew magee",
          "Nb_Reviews": 1,
          "Date": "2018-04-01T14:27:18.000Z",
          "Titre": "A few irks...",
          "Contenu": "It would be nice to be able to have all of our family member's information on one account. Instead, we had to split up the account into 2: one for me and my son and one for my wife.Also, how come I cannot activate credit monitoring for my child's SSN?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "WEBCLIENT",
          "Nb_Reviews": 2,
          "Date": "2017-09-21T18:05:21.000Z",
          "Titre": "The information you provide on alerts …",
          "Contenu": "The information you provide on alerts can be confusing and alarming. For example, I received a Smart SSN Tracker Alert and there should be a FAQ page associated with this info. What does \"source header?\" What do the dates mean since many are very old? While your instructions say to notify one of the credit bureaus directly, there is no link on the top of the Identity Force Dashboard for a Credit Dispute Filing and as you know, it is nearly impossible to contact the bureaus by phone currently. Customer service needs to improve especially during the 30 day free trial period!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "R Howard",
          "Nb_Reviews": 1,
          "Date": "2017-09-19T15:09:41.000Z",
          "Titre": "i am a new member and am not happy with …",
          "Contenu": "i am a new member and am not happy with client service.  It took over 24 hours to get a return phone call (while in quench's) and stil have not received a response to two email questions.I cannot find out how to pull actual credit reports - not just scores"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Wmd",
          "Nb_Reviews": 5,
          "Date": "2017-11-22T18:56:51.000Z",
          "Titre": "Credit reports are from 2015 etc.",
          "Contenu": "Credit reports are from 2015.Also whenever I get an alert and go to your website it gives me a way to check the problem by going to another website, but there's always a warning not to click on the website unless I'm sure it's safe. How am I supposed to know if it's safe? Shouldn't that be your job to check that before posting the site?Update... I was told there is a way to update your credit report. It seemed that it should happen automatically from the description on the website.Owner called and was very helpful.Still unable to check if warnings are important."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stephen J Murphy",
          "Nb_Reviews": 1,
          "Date": "2015-08-31T19:44:52.000Z",
          "Titre": "Health Acct monitoring",
          "Contenu": "Currently, the set-up for this service is simply an acct number.  It would be really helpful to have a field for the company / organization and a field fo the Dr.  It would be much easier to understand what I as a Idenity Force customer have set-up.\r Thanks,\rSteve M"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Thomas Krebs",
          "Nb_Reviews": 1,
          "Date": "2018-04-24T01:45:43.000Z",
          "Titre": "A Fraud alert reminder was issued",
          "Contenu": "A Fraud alert reminder was issued. It instructed  me to click on \" my services\".  I looked and looked, but could not find it because \"my services\" had been removed from the dashboard.  Should have told me to click \" credit\""
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Arlene S Sisneros",
          "Nb_Reviews": 2,
          "Date": "2015-09-11T18:10:51.000Z",
          "Titre": "Alerts are unclear",
          "Contenu": "The alerts give very little information and I am unclear as to what I should be doing.  As an example are the last two alerts I got on my phone number.  They show a link that I am uncomfortable clicking on to see what it is since I don't recognize the address."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Abraham",
          "Nb_Reviews": 1,
          "Date": "2017-08-22T03:49:20.000Z",
          "Titre": "I not getting updates like I asked when …",
          "Contenu": "I not getting updates like I asked when I set up my account. Moreover, I canceled my card and I never received a text nor email telling me I ended my services. Therefore, I have concerns about response time of informing me about my personal information."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cheryl Bouffard",
          "Nb_Reviews": 1,
          "Date": "2017-12-12T21:45:46.000Z",
          "Titre": "I think I really like IDF but I get …",
          "Contenu": "I think I really like IDF but I get alerts and have no clue what they mean.  A definition of the alerts would be most helpful.  I cannot seem to find any definition for the alert.  The review tab on my latest alert didn't explain anything at all."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 2,
          "Date": "2017-09-13T13:36:54.000Z",
          "Titre": "Your website does not accommodate …",
          "Contenu": "Your website does not accommodate someone with no work number.When putting your credit card information in it asks for security code but no explanation as to what that is or where to find it.My bank does not use a password but sends a security code"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mitchell A Massey",
          "Nb_Reviews": 2,
          "Date": "2016-12-23T17:50:42.000Z",
          "Titre": "Ambiguous alerts//call to action:",
          "Contenu": "I guess I feel better having implemented this monitoring service. However, when I do get an alert, it's really not clear what I can do about it. I'm concerned about my credit being checked by companies that I do no business with and haven't initiated a relationship with. With this service I get a notification when my credit report is pulled, but there's really no help in preventing this from occurring or determining why it's happening. It's like being you're at risk and then nothing.....Don't really know that this service is actually accomplishing anything or protecting me from fraud."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Glenn White",
          "Nb_Reviews": 1,
          "Date": "2017-11-18T17:52:09.000Z",
          "Titre": "Some of the reports are useful",
          "Contenu": "Some of the reports are useful, but some such as the email monitoring one is pretty useless. The email one lets you see where your email address might be used, but it's extremely, if not impossible, to do anything about it. The web monitoring application is pretty useless since I have other safeguards in place. The Three Bureau Credit Report Monitoring Alert and the Smart SSN Tracker Alert are useful. I was already aware of the contents of each, but it makes it easier to check on a regular basis. Currently, it's too early to tell if this service is the best for my family or if I will select a different one at the end of 1 year."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 1,
          "Date": "2017-09-21T20:00:34.000Z",
          "Titre": "The credit scores in the credit product …",
          "Contenu": "The credit scores in the credit product do not match those that you get from the agencies.  In addition, the credit tool is very weak in how it presents the data compared to other products.  But the key issue is that it is not accurate."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sheryle A Janzen",
          "Nb_Reviews": 1,
          "Date": "2016-07-28T02:17:57.000Z",
          "Titre": "Bank account monitoring FAIL",
          "Contenu": "I've tried various times to add my small local bank to the service and Identity Force can't find it.  If it can't find the bank account and Master Card isn't one of the credit card options it seems to be a waste of my $200."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DEBORRAH A ALLEN",
          "Nb_Reviews": 1,
          "Date": "2017-09-30T17:49:03.000Z",
          "Titre": "your system won't let me put my information in this is serious",
          "Contenu": "I'm  New customer trying to get my information into the system and I'm getting extremely frustrated I'm using Google Chrome for the browser is it suggested I keep trying to put in my information at all took one bank account number and then it kept telling me it wouldn't let me in there because I had to use Google Chrome and I'm using Google Chrome and ready to scream I can't get my info in the system help help help help  today is Sat  1:47 pm wasted about three hours trying to get this to take in the system it's not having any effect I tried to call and got put on a little help call me back   Upset customer 😩"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Claudia Souza",
          "Nb_Reviews": 1,
          "Date": "2018-04-22T22:33:42.000Z",
          "Titre": "No updates since January 2018",
          "Contenu": "No updates since January 2018.  Why isn't my credit being corrected.  I had a credit score of 813 and since we hired you it's only up in the 700's and not at Equifax where the hack was.  I don't understand this."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Denise  D.",
          "Nb_Reviews": 1,
          "Date": "2017-10-07T17:14:41.000Z",
          "Titre": "I am disappointed...I DON'T bank online …",
          "Contenu": "I am disappointed...I DON'T bank online but apparently I must sign up with all my banks online in order to get the alerts. I was under the impressive I could simply list my account numbers in the system to have this done."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dennis H Johnson",
          "Nb_Reviews": 1,
          "Date": "2017-10-04T21:00:40.000Z",
          "Titre": "Lack of support for Apple products such …",
          "Contenu": "Lack of support for Apple products such as Safari or the Mac OS was not apparent when purchasing this product.  This has been a big disappointment and would probably have reconsidered if this was stated in the advertising."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Timothy Frazier",
          "Nb_Reviews": 2,
          "Date": "2017-09-11T20:21:37.000Z",
          "Titre": "So far o good but..",
          "Contenu": "So far o good but... when i try and activate \"delete now\" it says i activated it but the page shows it as not activated and how do I know I really put a credit freeze on? How do I tell it actually happened?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "scolon",
          "Nb_Reviews": 1,
          "Date": "2017-06-21T19:11:29.000Z",
          "Titre": "IdentityForce has room for …",
          "Contenu": "IdentityForce has room for improvements.My review is based on web interface, notifications, and customer service. I have not, yet, needed any type of restoration for identity theft.The web interface is cludgy and difficult to understand. I have used other services to check my credit reports and score and the steps to updating this information is very clear. IdentiyForce has many features, but while I see the features listed, there is no description given before clicking to activate them. Today I received notification of an alert. When I called customer service I was told there was an 80 minute wait time. Of course the notification has me on edge and 80 minutes is just too long to wait."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tina W",
          "Nb_Reviews": 2,
          "Date": "2017-10-05T16:51:40.000Z",
          "Titre": "The Transaction Monitoring function …",
          "Contenu": "The Transaction Monitoring function keeps trying to load something in the right hand side of the screen, so I can't set my alerts on it for anything.  Everything else on the site loaded quickly with no problems."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steffen Urban",
          "Nb_Reviews": 2,
          "Date": "2017-02-06T18:38:55.000Z",
          "Titre": "Service is great, but no mobile app??",
          "Contenu": "The service is great, but I miss apps. Who doesn't have mobile apps these days. When I login on my iPhone, there isn't even a mobile view. How am I supposed to view my dashboard using the full site view."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patrick",
          "Nb_Reviews": 2,
          "Date": "2017-07-10T15:52:38.000Z",
          "Titre": "Beware - need to pay for an additional spouse membership",
          "Contenu": "Really helpful information, easy to setup,  However, I attempted to add my wife after original setup  and was told that I would have to purchase a new membership at the cost of mine ($19.00 x 2 = $38.00)"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shadie Nirou",
          "Nb_Reviews": 2,
          "Date": "2017-06-21T16:54:37.000Z",
          "Titre": "I am surprised that you do not provide …",
          "Contenu": "I am surprised that you do not provide a secure email portal for communication. I do not see the point in having my questions be sent over a public email server which may be breached. Thanks,S. Nirou"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "george",
          "Nb_Reviews": 2,
          "Date": "2017-09-11T04:00:58.000Z",
          "Titre": "I am a new subscriber and am unable to …",
          "Contenu": "I am a new subscriber and am unable to enter any credit card or bank accounts.  The site spins for several minutes and then reports that there is a \"technical\" problem.  Very frustrating!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DARYL L WILT",
          "Nb_Reviews": 1,
          "Date": "2016-03-23T18:17:46.000Z",
          "Titre": "Impossible to link some of my accounts.",
          "Contenu": "I lost count on how many times I tried to link one of my credit card accounts but failed, even though I consistently entered the correct info.\rI give up, and I am thinking about cancelling my service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lisa B",
          "Nb_Reviews": 1,
          "Date": "2016-10-16T19:54:38.000Z",
          "Titre": "A bit frustrated",
          "Contenu": "Some frustration removing my information internet as well as they make you go through all the steps which I could have done without this service as downloading medical ID and bank account information"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MS",
          "Nb_Reviews": 2,
          "Date": "2016-01-16T23:27:55.000Z",
          "Titre": "Spelling Mistake on Family Member",
          "Contenu": "You dont have any way on changing a mistake I made while typing in a family member. This is very important for tracking purposes. If I can't get this corrected I will have to terminate my service"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2018-05-06T23:06:33.000Z",
          "Titre": "Missing some basics",
          "Contenu": "1. No compatible with Safari browser2. Says \"Get More Protection\" and give you a % but then links to a page with zero guidance as to what you need to do to increase your protection."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cynthia  Meek",
          "Nb_Reviews": 3,
          "Date": "2017-05-24T02:40:59.000Z",
          "Titre": "Cannot activate account because …",
          "Contenu": "Cannot activate account because impossible to activate text alerts even though I complete and save the mobile phone info. Only 90% activated. And help line only available during office hours. !"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "The Voice of Outer Space",
          "Nb_Reviews": 1,
          "Date": "2018-04-11T21:00:49.000Z",
          "Titre": "How to delete alerts w/ new dashboard?",
          "Contenu": "The new dashboard design seems to have forgotten to include a way to delete alerts! No trashcan icon or any way to select a group of them to delete or any way I can see to do this any more."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "GS D",
          "Nb_Reviews": 6,
          "Date": "2017-07-22T14:52:09.000Z",
          "Titre": "Some features Do Not Work",
          "Contenu": "Either your website is too slow or your app for monitoring bank and credit card accounts does not work. I have tried repeatedly to \"Activate\" this feature, and it does not respond."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kevin Spinhirne",
          "Nb_Reviews": 1,
          "Date": "2017-09-16T22:14:30.000Z",
          "Titre": "OK, but website access glitchy",
          "Contenu": "Signup was straightforward, and most of the initial account setup went smoothly with one glaring exception. I cannot activate Band and Credit Card Activitty in the Financial Transaction Monitoring section of services. When I click the \"Activate\" button, a window pops up, and I see a list of \"Popular Accounts\" on the left, and on the right I get a spinning \"Retrieving information...\" that never returns. I've let it spin for over an hour. Tried calling tech support, but of course, like everyone else, I can't seem to get through despite waiting for over an hour. Downloaded the app to my phone, hoping to use that, but when I click on the Bank Accounts section, it simply pops up a message telling me to go log in from a computer! C'mon guys, really?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "ilu",
          "Nb_Reviews": 1,
          "Date": "2018-02-03T01:31:13.000Z",
          "Titre": "I really just wanted to point out how …",
          "Contenu": "I really just wanted to point out how difficult it is to cancel a subscription. Logged in I can't find anywhere to do it short of contacting support, which is pretty annoying."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sandra K Masters",
          "Nb_Reviews": 1,
          "Date": "2016-05-03T02:21:55.000Z",
          "Titre": "Poor account info on website",
          "Contenu": "My account information does not include how much my service fee is, when I signed up, and when the billing occurs.  No clear way to end your monthly service with Identity Force."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Susan E Clarke",
          "Nb_Reviews": 1,
          "Date": "2017-12-17T16:29:55.000Z",
          "Titre": "Suddenly receiving sex offender …",
          "Contenu": "Suddenly receiving sex offender monitoring alerts. Don't want them. Not even for my current address. Can't figure out how to turn them off.  Not happy with this."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brandon Burns",
          "Nb_Reviews": 2,
          "Date": "2016-07-13T03:12:59.000Z",
          "Titre": "Not lifelock or even close in 30 days of heavy fraud",
          "Contenu": "I have been in the middle of what I would consider serious identity theft over the last few months.  Within the last 30 days I have been notified by lifelock the same day as inquiries posted while identity force takes several days to notify.  Lifelock has had the issues resolved several times before I am contacted by I.F. When I say contacted I am referring to a email from Iforce saying to check my account and seeing the inquiry.  Whereas my contact from L.L. sprang into immediate action trying to resolve the issue for me and when unable to do so again contacted me to tell me how to resolve the issue and to give me phone #'s for quick contact rather than jumping through the normal hoops of calling companies.  Iforce is not worth the money and thus far has provided about the same information as the free service credit karma."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "TRACY HOPKINS",
          "Nb_Reviews": 2,
          "Date": "2018-02-22T02:03:23.000Z",
          "Titre": "My Online account details",
          "Contenu": "Very hesitant to provide you with all my online account information and login details - I thought I was trying to protect that info not share it on the web?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeffery Sibio",
          "Nb_Reviews": 1,
          "Date": "2017-12-20T17:58:49.000Z",
          "Titre": "account set up entry is very clunky and …",
          "Contenu": "account set up entry is very clunky and redundant. why enter credit card numbers in multiple places as an example? enter once and apply services as needed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Karen  Armstrong",
          "Nb_Reviews": 1,
          "Date": "2017-01-29T23:22:02.000Z",
          "Titre": "Credit Monitoring page is very frustrating!",
          "Contenu": "On the credit cart monitoring page there's no scroll bar. i only see 8 accounts. But the messages says I've entered 10 and can't enter any more."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Judith P Heine",
          "Nb_Reviews": 1,
          "Date": "2017-09-10T12:54:09.000Z",
          "Titre": "I would like information on how to respond to credit alerts",
          "Contenu": "I would like information on how to respond to a transaction that is not mine.  Calling is not helpful when the office is closed or the wait is hours long."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "richard e beaver",
          "Nb_Reviews": 1,
          "Date": "2016-04-12T13:22:39.000Z",
          "Titre": "Whats needed",
          "Contenu": "Everything working as it should so far, You need to support mac osx and an \"app\" for mobile devices would make it a \"complete\" package."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Clarence J Stephens",
          "Nb_Reviews": 2,
          "Date": "2018-02-24T20:19:00.000Z",
          "Titre": "I can't seem to add some important…",
          "Contenu": "I can't seem to add some important account numbers for protection. Such as......401k, IRA, Colleg 529 Savings plan. I'm not happy about that!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tammy Hayes",
          "Nb_Reviews": 1,
          "Date": "2018-04-19T16:01:06.000Z",
          "Titre": "Credit Scores not Current",
          "Contenu": "The website still shows my credit scores from 2016. Since I am currently paying for this service, my credit scores should be updated frequently."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Keith Tate",
          "Nb_Reviews": 1,
          "Date": "2016-05-15T06:27:22.000Z",
          "Titre": "Text Updates",
          "Contenu": "I would like to receive text updates, and I would rate your services higher if I could, but unfortunately it is incredibly inconvenient to not be able to set up a time period during the day in which to receive them.  I do not appreciate receiving the alerts from 11PM to 7AM.  When I contacted customer service to see if adjusting/limiting the time period was possible the CSRep was incredibly unsympathetic and acted as though I was an inconvenience in even bothering to call him with my question and directed me to login and turn them off.  When I asked how to do so he let out a very audible sigh of disgust and then gave me a brief and abrupt explanation of how to do so.  I had no idea that may calling for information and a request from a service that I subscribe to and pay for would be so ill received.  I would recommend your products to others, but I cannot at this time due to the way I was treated by placing a call to your company."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joseph P Russo",
          "Nb_Reviews": 1,
          "Date": "2018-03-15T16:51:43.000Z",
          "Titre": "How can I enter my financial accounts…",
          "Contenu": "How can I enter my financial accounts in ths system when I enter a bank like chase nothing happens.  I cannot get the system to work."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charlotte",
          "Nb_Reviews": 1,
          "Date": "2016-10-04T21:15:45.000Z",
          "Titre": "California Credit Union",
          "Contenu": "I cannot add my California Credit Union accounts located at californiacu.org/to my Bank and Credit Card Activity. Please correct this."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Clifton E Neal",
          "Nb_Reviews": 1,
          "Date": "2017-10-14T22:32:42.000Z",
          "Titre": "i would like to pull a new credit …",
          "Contenu": "i would like to pull a new credit report frequently to review.  Your service appears to only allow a few annually.  This is not good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Richard R Torrenti",
          "Nb_Reviews": 2,
          "Date": "2018-05-19T01:33:41.000Z",
          "Titre": "Your instructions lead to dead ends",
          "Contenu": "Your instructions lead to dead ends.  Says to adjust alerts, go to Dashboard and select My Services, which is no where to be found."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Drew H.",
          "Nb_Reviews": 1,
          "Date": "2017-09-15T17:47:31.000Z",
          "Titre": "Drivers License and Mother's Maiden Name Monitoring Issue",
          "Contenu": "So far, my questions have been answered to my satisfaction by your extremely friendly staff.  However, I called to ask why Driver's License Monitoring and Mother's Maiden Name Monitoring are not showing up on my account or my wife's account, but they do show up on my children's Childwatch accounts...very odd.  Both myself and my wife purchased the Ultrasecure + Credit package, and I was told on the phone those items are not on our account because because we signed up under the Equifax Breech discount.  This is an unacceptable answer because I was purchasing the \"Ultrasecure + Credit\" package, not the Equifax Breech version of the \"Ultrasecure + Credit\".  If I knew that was the case, I would have paid the full purchase price.  It makes me wonder what other services I am missing.  I hope this is just a technical issue that can be resolved easily.  I was impressed with your service at first, and I don't want to start having doubts that I should have went with another provider.  Thank you for you time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "kamlesh sharma",
          "Nb_Reviews": 1,
          "Date": "2016-07-24T19:45:45.000Z",
          "Titre": "Got false positive",
          "Contenu": "Does not do exact match on email address. Even if email address does not exactly match, red flag is generated for alert."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anderson  R Williams",
          "Nb_Reviews": 1,
          "Date": "2015-06-24T19:19:34.000Z",
          "Titre": "Good, but hard to follow for one not in this field.",
          "Contenu": "Why is my latest Dashboard entry dated 5-31 when today is 6-24? Why is my Identity Health Score dated 8-28 of last year?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul Leiss",
          "Nb_Reviews": 1,
          "Date": "2017-06-26T19:17:02.000Z",
          "Titre": "Incorrect Credit Scores",
          "Contenu": "The Credit Scores are not correct for me.  According to Credit Karma abd other sources, my credit scores are over 800."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark J Bauer",
          "Nb_Reviews": 1,
          "Date": "2018-03-02T21:36:31.000Z",
          "Titre": "So far, so good",
          "Contenu": "So far, so good.  I had a problem adding cards and accounts to be monitored with Chrome browser, but IE worked fine."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jb",
          "Nb_Reviews": 2,
          "Date": "2017-09-24T18:41:24.000Z",
          "Titre": "Just signed up",
          "Contenu": "Just signed up.  Found out some of their services not compatible with Apple iMac.  Disappointing.  Not acceptable."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "ShanMcD",
          "Nb_Reviews": 1,
          "Date": "2016-09-03T18:01:01.000Z",
          "Titre": "Good Features, Needs a Mobile App",
          "Contenu": "Sometimes there's a bit too much data without enough explanation.  Popups with further direction would be nice."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert W Bell",
          "Nb_Reviews": 3,
          "Date": "2017-11-03T16:07:44.000Z",
          "Titre": "Activation is not easy",
          "Contenu": "why is signing up and paying for your service so easy yet activating all that you have paid for is so difficult."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Matthew R Love",
          "Nb_Reviews": 1,
          "Date": "2016-04-30T19:26:52.000Z",
          "Titre": "I was hoping for a service with a phone app",
          "Contenu": "I only get notices via email to check my online account.  I want quick notifications that pop up on my phone."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Billy Pritchard",
          "Nb_Reviews": 2,
          "Date": "2018-04-12T01:08:40.000Z",
          "Titre": "I DO NOT like the new website",
          "Contenu": "I DO NOT like the new website.  The old one was MUCH better and easy to understand and easier to navigate."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "tim carlo",
          "Nb_Reviews": 5,
          "Date": "2017-11-18T20:56:01.000Z",
          "Titre": "why wasn't I notified that my credit …",
          "Contenu": "why wasn't I notified that my credit card was fraudulently  used 2 days ago. Citibank called my wife?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kevin Emerick",
          "Nb_Reviews": 1,
          "Date": "2017-01-31T18:28:54.000Z",
          "Titre": "New and unsure",
          "Contenu": "I'm still new and populating information.  Not sure what I'm getting, reading, needing, etc..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ladd Wikstrom",
          "Nb_Reviews": 5,
          "Date": "2018-05-03T16:01:44.000Z",
          "Titre": "The credit scores are wrong",
          "Contenu": "The credit scores are wrong.  My credit scores are in the high 700s. I have even been over 800."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer Joe P",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T14:23:29.000Z",
          "Titre": "As a general rule,I do not give more…",
          "Contenu": "As a general rule,I do not give more than 5 stars.  So far you guys have been great!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer Patti",
          "Nb_Reviews": 1,
          "Date": "2022-12-22T10:45:28.000Z",
          "Titre": "I always have trouble getting to my…",
          "Contenu": "I always have trouble getting to my site. If I call rather than give up trying to reach my site, your people are helpful, understanding, and easy to understand. Too often however I just give up and ignore your alerts. So far, the alerts have been sex offenders and I don't have any children that live here."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patricia H. Singleton",
          "Nb_Reviews": 1,
          "Date": "2022-09-13T22:58:45.000Z",
          "Titre": "I’m giving the 4 ⭐️‘s stars because the…",
          "Contenu": "I’m giving the 4 ⭐️‘s stars because the couple of times I’ve contacted the Identity Force it’s soooooo much to navigate through when all I want is  to understand what’s going, on why and how my situation will be handled. I’ve received several fraud alerts, however, they have been from my bank not IF. Why is this so?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ruth Thomas",
          "Nb_Reviews": 2,
          "Date": "2022-02-24T18:43:47.000Z",
          "Titre": "I am glad to have Identity Force’s…",
          "Contenu": "I am glad to have Identity Force’s protection.  I rated 4 stars only because I had a hard time finding the section of my account information where I needed to edit some finances data.  A more user-friendly website would be welcome, for seniors!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "D.Stadler",
          "Nb_Reviews": 2,
          "Date": "2022-02-24T20:21:44.000Z",
          "Titre": "Great service once we got someone to…",
          "Contenu": "Great service once we got someone to act ( 3 days) on my wife's Identity theft. Kaitlyn was the one who helped us clear up our problem, We extend our thanks to her. All their team members should be as helpful as she was."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Orin Witt",
          "Nb_Reviews": 1,
          "Date": "2020-07-14T17:25:15.000Z",
          "Titre": "Provide immediately visible classification of notifications when they are sent out",
          "Contenu": "I do not care for the sexual predator reporting because it distracts from the financial reporting I need.  When an alert is sent to me, it does not discriminate the type of report being provided."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nadine Deshazor-Mobley",
          "Nb_Reviews": 3,
          "Date": "2019-02-20T05:42:34.000Z",
          "Titre": "Although I am a new customer I do…",
          "Contenu": "Although I am a new customer I do appreciate identity theft. They have been there for us on the phone or get us apart.Xfinity customer service"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "James Pembroke",
          "Nb_Reviews": 2,
          "Date": "2021-06-25T21:51:14.000Z",
          "Titre": "Security",
          "Contenu": "With Identity Force installed,. I have a feeling of security that I hadn't experienced before. I know that if skulduggery is about, Identity Force will intercept and protect me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carole Scheiner",
          "Nb_Reviews": 1,
          "Date": "2019-10-08T01:11:49.000Z",
          "Titre": "I asked a question re credit freeze and…",
          "Contenu": "I asked a question re credit freeze and lock but was only given a short answer not actually answering the question or giving me additional info. Not helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rose J",
          "Nb_Reviews": 2,
          "Date": "2021-10-27T20:51:57.000Z",
          "Titre": "Going elsewhere",
          "Contenu": "On Monday, October 25th I tried to enroll with Identity Force.  I got to the authentication part, and it failed. It would not accept the password that the system suggested for me, so I tried to change the password.  In that process, I was to confirm answers to security questions that I chose.  One of the questions was not one that I chose, so it would not allow me to change my password.  I have been trying for the past 3 days to get this fixed, and every time I FINALLY talk to someone it's not their department and they are going to refer to someone.  I have talked with 3 departments so far. I was only trying to protect myself because on Sunday, someone tried to get a credit card in my name with my social security number. I told them this, and they were going to have that department call me back and help me with this, but no call back.  At this point, I just want my money back and I will go elsewhere. When I told them this today, she told me that department will call me back.  We will see.9-27 - After my review, I received a response from Identity Force and had all issues resolved.  They were very apologetic and helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Claude Rizzo",
          "Nb_Reviews": 3,
          "Date": "2023-01-20T16:39:17.000Z",
          "Titre": "Last Webinar was quite good",
          "Contenu": "Last Webinar was quite good, gentleman was knowledgeable, but why only 15 mins?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Per F. Gjerde",
          "Nb_Reviews": 7,
          "Date": "2021-02-27T00:31:05.000Z",
          "Titre": "It seems great but I have had it for…",
          "Contenu": "It seems great but I have had it for such a short time that I hesitate to say anything more. But so far, so good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rose Wiley",
          "Nb_Reviews": 2,
          "Date": "2021-10-07T19:16:09.000Z",
          "Titre": "The latest material is applicable for…",
          "Contenu": "The latest material is applicable for families; however, we are retired empty nesters and would like information contoured to those needs."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jerry Davis",
          "Nb_Reviews": 8,
          "Date": "2021-05-11T02:42:59.000Z",
          "Titre": "i have no complaints everything is…",
          "Contenu": "i have no complaints everything is working fine"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sandra L Simmons",
          "Nb_Reviews": 1,
          "Date": "2017-09-11T21:52:37.000Z",
          "Titre": "I am giving four stars for the easy to …",
          "Contenu": "I am giving four stars for the easy to understand, logical, and trouble-free yet thorough way ID Force works and the way the information to be monitored can be entered, checked and changed.  ID Force sends understandable alerts and recommendations but does not intrude or become annoying.  I feel protected with ID Force.  Now that Equifax has been hacked, I am recommending ID Force to my friends."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jonathan Forsberg",
          "Nb_Reviews": 1,
          "Date": "2018-05-04T01:44:23.000Z",
          "Titre": "How the heck do I get the free credit report",
          "Contenu": "You guys send me an email about getting a free credit report... I click the link and can't find out how to do it after logging in. I looked everywher, I think, and no luck... What am I missing??It would have been great if the email for the credit report had linked me directly to the free credit report offer.-Jon ForsbergNorthstar Anesthesia"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kevon",
          "Nb_Reviews": 5,
          "Date": "2017-06-04T15:52:51.000Z",
          "Titre": "Couple of complications",
          "Contenu": "in downloading your software it screwed my computer up and had to have an IT person come out so I could use it the next day.Couple times I called into customer support they confused me more than what I had called in for and tried to explain thing to me like I was a computer guru and I had no idea what they were explaining.Now things seem to be ok and we will see out the next couple months go."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christopher Burton",
          "Nb_Reviews": 3,
          "Date": "2017-09-01T00:09:23.000Z",
          "Titre": "One Annoying Aspect Comes With All the Good Things...",
          "Contenu": "I do think your service is excellent in the short time (one week) I've had it, but getting an alert when I pay my CC bill is ridiculous and I cannot see how to change it as preferences only talk about withdrawals and transfers, so since i put most all of my purchases on a single card, it appears I will get an unnecessary notification at least once a month."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Kathryn",
          "Nb_Reviews": 1,
          "Date": "2017-03-04T00:09:37.000Z",
          "Titre": "Confusing- Updated",
          "Contenu": "I received an alert about a statement added because I was a victim of \"True name fraud\" but I have no idea what that means, what I should do or who to call, if anyone. More info would be niceUpdate: I was contacted by customer service and provided an explaination within 24 hrs of my post. I have given them another star for the quick response and great customer service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jennifer D Harris",
          "Nb_Reviews": 1,
          "Date": "2016-10-07T16:58:17.000Z",
          "Titre": "Looks better than LifeLock",
          "Contenu": "For some reason I have more confidence in IdentityForce rather than LifeLock. LifeLock is cheaper and people say it works but it just seems too good to be true and you see it EVERYWHERE on television because of their advertisements. I found that IdentityForce is rated as better than LifeLock but how come IdentityForce doesn't have commercials? Or at least I haven't seen any recently."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Barbara A Keller",
          "Nb_Reviews": 1,
          "Date": "2017-10-10T14:09:13.000Z",
          "Titre": "I wish it were easier to find …",
          "Contenu": "I wish it were easier to find information. On some items that say inactive and have a button tt activate, all I get is that is currently inactive. Does this mean you do not offer this or that I should go to some other part of your confusing website to activate? I updated credit bureau monitoring and received a message that it could not be done since I had already done this with Experian. What about the other 2 bureaus, is this now active or not??"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "M F.",
          "Nb_Reviews": 1,
          "Date": "2016-03-24T15:51:32.000Z",
          "Titre": "Too early to tell, but so far so acceptable.",
          "Contenu": "Still estimating whether I'm getting protection from this service. Will update soon. \rRecently Lost my credit cards and thought I had lost wallet assistance. Still unclear of this feature and if it would help me if I loose my wallet or cc info. \rAlso Has features and benefits other services do not have at present. \rStill trying to figure out if the Credit score simulator works as promised."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eskridge, Matt",
          "Nb_Reviews": 2,
          "Date": "2017-09-20T14:13:11.000Z",
          "Titre": "Useful",
          "Contenu": "As a lot of reviews are pointing out. The bank and credit card monitoring is very delayed and inaccurate. You will get an alert from your financial institution far before you get an alert through IdentityForce.Had concerns and they were fully addressed through email and phone. Believe the Equifax breach has put them far behind but they are coming out of it.Overall, had some concerns at first but they have been answered and the service seems very useful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nancy Burns",
          "Nb_Reviews": 1,
          "Date": "2017-09-15T20:09:51.000Z",
          "Titre": "I found setup user friendly",
          "Contenu": "I found setup user friendly, ran into one problem. On a add SSN, adding the second SSN resulted in 'There was a problem adding the monitor. Monitor count already at max (1).' Also I did not find inforamation on setting up various options for the second  (spouse) id.I found the software easy to use, and  what was docmented was clear."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Willard",
          "Nb_Reviews": 1,
          "Date": "2018-02-03T20:04:56.000Z",
          "Titre": "Seem thorough enough but...",
          "Contenu": "Seem thorough enough, hope I never need it.   Also, I would like to see your phone app with guest login credentials that would only allow me to view alerts w/o giving full access.  I will not use your app with my Account login credentials on a phone that can easily be lost and hacked.  The data you have on file is far too sensitive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "gloria",
          "Nb_Reviews": 4,
          "Date": "2017-09-20T21:30:29.000Z",
          "Titre": "You would receive 10 stars if the fraud …",
          "Contenu": "You would receive 10 stars if the fraud alert portion worked better. I have an existing fraud freeze for previous breaches and the current software doesn't allow a screen to communicate such. I realize this is a frantic time do to the global cyber security issues. Extremely helpful and professional with callback after Equifax breach."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JJT",
          "Nb_Reviews": 6,
          "Date": "2017-09-11T17:19:02.000Z",
          "Titre": "Much difficulty signing up.",
          "Contenu": "I realize that a massive data breach occurred recently, but I spent several hours Saturday trying to enter my information to sign up.  My information was never accepted and I gave up.  On Sunday, my information was accepted immediately.  However, the authentication codes were not accepted.  I tried over and over with six different authentication codes before number seven was finally accepted.  Identity Force's inability to encourage new members is unacceptable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Butch",
          "Nb_Reviews": 3,
          "Date": "2017-04-05T20:03:22.000Z",
          "Titre": "Mobile app???",
          "Contenu": "Very disappointed no mobile app is available.Still getting my feet wet with the service.  Other than the disappointing lack of a mobile app, setup and navigation was easy.UPDATE:  Received a response within a few hours of posting this review.  That alone prompts me to give an extra star.  But on top of that, a mobile app is underway!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "annabelle snyder",
          "Nb_Reviews": 1,
          "Date": "2016-01-25T18:05:29.978Z",
          "Titre": "Helpful",
          "Contenu": "I continue to have information that leads me to believe someone is attempting to open credit cards using my information. I am only notified by the store of this attempt, not by identity force.\rAfter posting a negative review, trust pilot responded appropriately and quickly to rectify the problem and helped me get enrolled into the system."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joshua Baker",
          "Nb_Reviews": 1,
          "Date": "2017-09-06T16:22:22.000Z",
          "Titre": "Pretty good service and nice layout for …",
          "Contenu": "Pretty good service and nice layout for the site. However I am a little concerned about the fact that I applied and got a credit card, and Identity Force had absolutely no idea that I applied and got one? I assumed it would notify me if a credit card was given in my name but apparently it doesn't detect that?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JAY L",
          "Nb_Reviews": 1,
          "Date": "2017-09-25T18:01:00.000Z",
          "Titre": "Positive experience",
          "Contenu": "Like many, I was extremely frustrated by the long wait for customer support due to the data breech of Equifax. However, after contacting the company via email, I received a call back promptly from a supervisor.  She handled my concerns in a professional manner and made the extra effort to make sure I was happy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jason Mumm",
          "Nb_Reviews": 1,
          "Date": "2015-11-30T00:38:57.000Z",
          "Titre": "Impressive First Thoughts",
          "Contenu": "I have used LifeLock in the past and found it to be expensive without much in the category of \"useful.\"  I like your dashboard view very much and the fact that adding children to the account was at a marginal cost to me.  I really like the \"delete now\" feature to remove my personal information from all of the creepy sites that collect that sort of thing.  I'm just now starting but the feature set is impressive and I think it's worth the money already."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "terry rose",
          "Nb_Reviews": 1,
          "Date": "2017-09-09T20:20:00.000Z",
          "Titre": "I am changing my first impression",
          "Contenu": "Although, i was extremely frustrated earlier at the login experience I had and the length of time, as a brand new customer I had to wait to get a call,   I did receive 2 calls today; both explaining the delay and apologizing for the delay.  I feel the company deserves a 2nd chance and have upgraded my rating."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joseph L Lumia",
          "Nb_Reviews": 1,
          "Date": "2017-10-20T22:30:50.000Z",
          "Titre": "Please expand the maximum number of …",
          "Contenu": "Please expand the maximum number of credit cards to be monitored.  A maximum of only 5 credit cards just don't cut it.  Especially when people have multiple bank or credit union accounts, Corporate AMEX, personal AMEX, Health Savings Account Visa, and personal Visa/MasterCard/Discover accounts.The credit score that you give participates is only from one Credit Reporting Company, TransUnion.  Which is the most worthless of the three Credit Reporting Companies.  Give us all three, and stop being cheap about it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 2,
          "Date": "2016-02-15T13:43:10.000Z",
          "Titre": "pretty  good",
          "Contenu": "I like the service  but it is very reliant on the user  updating  each report . I would like to see more automation in the report  updates. Also there  should be a way to notify I'd force if you've  been  notified  that your information  has  been  compromised . This would  make the service  much better ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charles G Amirault",
          "Nb_Reviews": 1,
          "Date": "2017-03-23T11:44:59.000Z",
          "Titre": "Works very well!",
          "Contenu": "All of what it says works wonderfully!   I can check my credit score and what's in my report.  I can find what needs to be corrected.  I get fraud alerts and activity alerts.  All in all a very good product, worth every penny you spend on it, just for the feeling of security alone."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Maria Miller",
          "Nb_Reviews": 1,
          "Date": "2017-07-06T23:38:38.000Z",
          "Titre": "My mom likes to complete surveys for …",
          "Contenu": "My mom likes to complete surveys for $$, free samples, gift cards, etc. Because of this, I fear she’s at a higher risk of a phishing scam – so I went ahead and installed the online PC protection from IdentityForce on her desktop. I just wish I could install them on my own Mac."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wendy",
          "Nb_Reviews": 1,
          "Date": "2016-11-22T12:56:26.327Z",
          "Titre": "It worked",
          "Contenu": "Identity force is the reason that I know that my SS was lifted and that credit cards were opened in my name. One morning I checked my email and received a multitude of blasts from the service - so I caught the issues before any charges had been made to these new cards - so thank you. My only issue is that I have called the service twice - and their customer service associates - both times -were one of the most uninformed and least helpful of anyone I have reached out to. A little more coaching on what they can advise a consumer to do would go a LONG way."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patricia",
          "Nb_Reviews": 1,
          "Date": "2017-06-29T21:01:12.000Z",
          "Titre": "Please add credit unions to bank activity options",
          "Contenu": "Hi. Can you please add America First Credit Union to your list of banks? Although it is a credit union, this is where I do my primary banking.Please add credit unions to your options of bank activity. Otherwise, I may cancel my service since this is important to me. Thanks!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lori S",
          "Nb_Reviews": 2,
          "Date": "2018-04-28T06:53:23.000Z",
          "Titre": "Updated Review (from 1 star to 4)",
          "Contenu": "After having a rocky start, Identity Force has since redeemed themselves by fixing all the issues regarding my account. Only time will tell what the long-term experience will be with this company, and I will post another review when nearing my year’s end, but so far so good. Not yet a 5-star experience because of the rough beginning and needing time to evaluate the service, but things are definitely looking up and based on how hard they worked for the resolution of all things, I think I can now say this company is worth a try. Their price alone is enough to dictate a closer look."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christopher  R Glenn",
          "Nb_Reviews": 1,
          "Date": "2017-08-31T19:45:51.000Z",
          "Titre": "Overall a positive feeling for Identity Force.....",
          "Contenu": "Overall my experience with Identity Force has been positive. However, alerts have popped up at in opportune times of the day and days of the week and they have caused me a bit of anxiety. My anxiety has grown into high anxiety until I've had a chance to speak with a representative of Identity Force which is usually only M - F,  7-7 am-pm EST. The end result has been some very anxious weekends.When I have been able to speak with a Identity Force representative, the anxiety level goes down substantially. The print, 24 - 7 coverage would make for many more satisfied customers."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LAW",
          "Nb_Reviews": 8,
          "Date": "2015-11-22T17:24:40.000Z",
          "Titre": "Heads Up",
          "Contenu": "I received a Credit notice on a credit card that was paid in full and they said it was not paid. Raised the issue since I never got a statement. Card services requested it be corrected. May take 3 months.\rWithout notice from Idenity Force I would not have known.\rThanks!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carol B Lassiter",
          "Nb_Reviews": 2,
          "Date": "2016-02-07T17:31:32.000Z",
          "Titre": "Sunday Services",
          "Contenu": "All of my problems and alerts seem to occur on Sundays, when you are closed and unavailable.  It would be extremely helpful to have a full time, knowledgeable Identity Force representative available for customers nerve control and immediate needs."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LDL",
          "Nb_Reviews": 1,
          "Date": "2018-01-29T21:00:06.000Z",
          "Titre": "Had to call (within time constrants) to …",
          "Contenu": "Had to call (within time constrants) to learn that in order to register all information you have to go to \"My Services\".  It would be nice if that 877 number was monitored 24 hrs.After that everything went smoothly.LDL"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "rico vazquez",
          "Nb_Reviews": 1,
          "Date": "2016-12-06T22:18:02.000Z",
          "Titre": "CHILD WATCH",
          "Contenu": "I ADDED MY CHILDREN UNDER CHILD WATCH BECAUSE THE SOCIAL SECURITY CARDS HAD BEEN STOLEN. I WAS ALLOWED TO PAY FOR A YEAR OF SERVICE AFTER ONLY ENTERING CHILDREN NAME, BUT WAS NEVER PROMPTED TO ENTER SS#. ONLY UPON LOOKING UNDER THE MY SERVICES TAB TO VERIFY THAT THE PERSONAL INFO AND SERVICE WAS CORRECT, DID I SEE THAT NO MONITORING HAD BEEN ACTIVATED. I THEN HAD TO CLICK THE MONITORING SERVICE AND ENTER THE SS# THERE TO ACTIVATE. I AM GLAD I LOOKED, OTHERWISE I WOULD HAVE PAYED FOR NO SS# PROTECTION FOR MY CHILDREN OTHER THAN THERE NAME WAS ON FILE. IF PAYMENT WAS TAKEN I SHOULD HAVE BEEN PROMPTED TO ADD THE SS# SO THAT MONITORING COULD BEGIN"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marsha",
          "Nb_Reviews": 2,
          "Date": "2017-09-09T17:09:24.000Z",
          "Titre": "New member",
          "Contenu": "New member, no real complaints at this time.  Website can be a little jinky or slow to update my input at times, but overall good.  I will report more after a few months.  At this time I do feel better protected.  Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe R",
          "Nb_Reviews": 4,
          "Date": "2018-04-24T17:57:49.000Z",
          "Titre": "Pretty impressive online dashboard",
          "Contenu": "Pretty impressive online dashboard.  Easy to sign up and get started. Two suggestions:1.  The protection status gives you a percentage.  I'm at 87%.  I've added and activated every possible item I can think of (lost wallet, transaction monitoring, bank accounts, etc.) but cannot seem to get to 100%.  It doesn't tell you what else you are missing to get to 100%.2.  The credit scores lack information.  It doesn't tell you anywhere that I can find what model was used to determine the score.  My FICO scores are 821, 829, 831.  These scores came in at 798, 784, 771.  They should provide what information on what types of scores these are (FICO, Vantage Score, their own model, etc.)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Equifax victim",
          "Nb_Reviews": 1,
          "Date": "2017-09-13T22:14:25.000Z",
          "Titre": "Seems like a good service",
          "Contenu": "Seems like a good service; however, I cannot complete my activation... the fraud alert process and the entry of bank accounts etc will not complete. Much frustration when you are purchasing to protect your identity."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dennis R Sibley",
          "Nb_Reviews": 1,
          "Date": "2017-02-22T21:26:26.000Z",
          "Titre": "Not bad at all.  I am happy with the service.",
          "Contenu": "Its a good service that keeps me posted on all matters concerning my credit and ID.  Its a little slow to update my actual checking account(s) balances though, but thats ok, I check with my bank about that anyway."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kathryne J Jacobs",
          "Nb_Reviews": 1,
          "Date": "2017-04-17T22:57:24.000Z",
          "Titre": "Great job!",
          "Contenu": "Identity Force is doing a great job! I like being able to view all three credit scores. I feel secure knowing Identity Force is looking out for me. I'm going to add my credit cards for them to monitor too."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "don selby",
          "Nb_Reviews": 2,
          "Date": "2018-04-23T17:01:12.000Z",
          "Titre": "how to cancel or change service levell?",
          "Contenu": "they don't tell you any way to cancel and I guess it is implied you call them ... I would like something easier.     I am not cancelling but maybe wanted to change my service level [downwards] ..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RA",
          "Nb_Reviews": 1,
          "Date": "2015-07-24T14:14:07.000Z",
          "Titre": "Fraudulent credit card",
          "Contenu": "I've just learned that a fraudulent credit card account was opened last month using my name. IdentityForce had indicated that an *inquiry* was made by that credit card company at that time, alerting me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel  G Lenihan",
          "Nb_Reviews": 1,
          "Date": "2017-01-03T19:45:33.000Z",
          "Titre": "Fraud Alert Reminder tool",
          "Contenu": "After filling out the \"Fraud Alert Reminder\", with all of my info the system had a pop up that said it was currently unavailable and to try again later. Wondering where my info went to."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Nagle",
          "Nb_Reviews": 6,
          "Date": "2018-04-08T14:51:21.000Z",
          "Titre": "There should be an option to \"select…",
          "Contenu": "There should be an option to \"select all\" for the purpose of deleting. I get the alerts via text and email so I have already review them. Thus an easy means to delete would be nice"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "GERALD L SLABAUGH",
          "Nb_Reviews": 1,
          "Date": "2017-09-05T22:31:16.000Z",
          "Titre": "Agent can't  view my screen.",
          "Contenu": "Customer service agent was knowledgeable and helpful. But was not able to view my screen. I am  not sure if that is a good thing or not. It would. Be easier explain if he could view my screen"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William V Pigott",
          "Nb_Reviews": 1,
          "Date": "2015-06-12T03:01:37.000Z",
          "Titre": "Use of more complex passwords  ***UPDATED***",
          "Contenu": "I am trying to make my password more complex and am unable to use \"special\" characters with IdentityForce,  eg, !@#$%^&*()_+. Please change your login protocol to allow these characters.\r    Thanks, Bill Pigott\r***UPDATE*** My new complex passphrase using \"special\" characters does work. When I first tried to change my password (twice), I got a warning (in red) saying something about improper parameters being used.  I assumed that meant that the change of password had failed, but when I tried to log back in, my \"old\" password no longer worked, but my new one did. So now it appears that the only \"fix\" needed has to do with the red warning comment during the process of changing the password.  Thanks,  Bill"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brenda K Helms",
          "Nb_Reviews": 1,
          "Date": "2015-08-25T20:22:04.000Z",
          "Titre": "Phishing Alerts are popping up on everything",
          "Contenu": "The Phishing Alert is showing up on my web site, which is hosted by Network Solutions.  It showed up on Luminosity.  These things are not correct.\r Can I turn off Phishing Alerts?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gin X Zingh",
          "Nb_Reviews": 1,
          "Date": "2017-11-10T17:35:09.000Z",
          "Titre": "It would be very helpful if I could …",
          "Contenu": "It would be very helpful if I could enter my personal information once and it goes out a fetched my accounts.  I realize that this is important, but it is very time consuming."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Yolanda G Lucatero",
          "Nb_Reviews": 1,
          "Date": "2018-02-26T04:54:36.000Z",
          "Titre": "Good",
          "Contenu": "Everything was ok, until I got to the set password, I was getting frustrated. Tried different types of password, then finally after 20 minutes of trying different approaches."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bruce Decker",
          "Nb_Reviews": 2,
          "Date": "2017-09-11T16:57:19.000Z",
          "Titre": "The signup process was confusing",
          "Contenu": "The signup process was confusing.  Not sure if my spouse also has to input the same bank and CC information or not.    THANK YOU FOR CONTACTING ME SO SOON.  YOUR CALL HELPED."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "KATHERINE l EVERETT",
          "Nb_Reviews": 1,
          "Date": "2016-09-28T13:07:25.000Z",
          "Titre": "Mind at Ease",
          "Contenu": "I am very happy with the services of Identity Force. My mind is at ease. If anyone attempts to steal from my account, I truly believe it will be handled accordingly. Thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrew Marrisett",
          "Nb_Reviews": 1,
          "Date": "2022-05-18T19:25:08.000Z",
          "Titre": "It's great",
          "Contenu": "It's great. I only had it for a few weeks. So far, so good. 👍"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chi Town Girl",
          "Nb_Reviews": 2,
          "Date": "2016-04-05T01:19:04.000Z",
          "Titre": "I Like IT!",
          "Contenu": "Great monitoring but there are some things that make no sense (like how to delete public records) and they need to condense the credit report or make a mini  version."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rolando Retana",
          "Nb_Reviews": 3,
          "Date": "2018-03-17T20:24:40.000Z",
          "Titre": "Trial was ok, alert no very fast",
          "Contenu": "I will update my review (previously I complained about they charging me right after the trial period started, but they just were testing the card). Even tho their alerts are not as quick as I wanted to be, they are an ok service, I had to cancel the account because it was not what I as looking for. Their costumer service only work during the day so it was quite dificult to comunicate if you are a busy person during the day, had to call a few times, the good thing is that they work on saturday. Even tho I went one day over the trial period they refunded the money with no too much problem or questions. I decided to test the speed of the alert system by posting some big transactions on my bank accounts, but I received the alerts 2 days after, that what got me a bit worried since I really need something faster.Even tho it did not work for me I think this could work great for many other people."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AV",
          "Nb_Reviews": 1,
          "Date": "2017-09-15T18:18:15.000Z",
          "Titre": "Additional features such as freezing …",
          "Contenu": "Additional features such as freezing and placing fraud alert straight through the site with a click of a button would make this company a 5 star service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David R Lynch",
          "Nb_Reviews": 1,
          "Date": "2017-11-24T12:21:26.000Z",
          "Titre": "Def need to update the credit scores …",
          "Contenu": "Def need to update the credit scores more often quarterly is to long. Other than that it's a great service and very in depth. Highly recommend it."
        },
        {
          "Note": 4,
          "Lieu": "CN",
          "Pseudo": "Jessica",
          "Nb_Reviews": 1,
          "Date": "2017-08-07T20:49:48.000Z",
          "Titre": "i am just a little concerned that now …",
          "Contenu": "i am just a little concerned that now you have all my personal information and what if the information is stolen or leaked or your system is hakced."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Deb",
          "Nb_Reviews": 1,
          "Date": "2018-02-28T19:24:06.000Z",
          "Titre": "I am very new to this",
          "Contenu": "I am very new to this, so still trying to understand how this all works. The service rep was patient with me and helped me maneuver the website."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alan Birsch",
          "Nb_Reviews": 1,
          "Date": "2016-09-25T20:46:18.000Z",
          "Titre": "Closed accounts",
          "Contenu": "Closed credit accounts continue to be shown for all three credit bureaus. Can't they be deleted since they are no longer relevant."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charles T",
          "Nb_Reviews": 5,
          "Date": "2021-11-02T13:59:30.000Z",
          "Titre": "Very good!",
          "Contenu": "It’s very good. It gives me some peace of mind."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "George  T Merriman",
          "Nb_Reviews": 1,
          "Date": "2017-08-31T19:47:39.000Z",
          "Titre": "Ultimately helpful",
          "Contenu": "I've had some frustrations in setting up my account satisfactorily, but my one call to tech support gave me a quick solution."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matthew J Mathias",
          "Nb_Reviews": 1,
          "Date": "2017-09-11T18:42:50.000Z",
          "Titre": "Everything looks great so Far",
          "Contenu": "Everything looks great so Far!  the delete now function is not working though. I will contact IF soon and see if they can help"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "jm",
          "Nb_Reviews": 1,
          "Date": "2017-09-15T21:58:49.000Z",
          "Titre": "Cannot talk to a person to ask a …",
          "Contenu": "Cannot talk to a person to ask a question.Since I posted this, they called me and answered my questions.  I am satisified."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marlon",
          "Nb_Reviews": 4,
          "Date": "2015-11-15T13:48:05.000Z",
          "Titre": "Closing accounts",
          "Contenu": "I think you should have an option under either customer support or manage account in order to close account(s).\r Marlon M."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "michael J mcdaniel",
          "Nb_Reviews": 3,
          "Date": "2017-11-09T15:16:47.000Z",
          "Titre": "No Resolution with Issues (45 days and counting)",
          "Contenu": "I spoke with Tech Support today and I believe we are on the right track to getting my issues corrected!!! I am pleased."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Martin Yellin",
          "Nb_Reviews": 1,
          "Date": "2017-08-09T18:47:11.000Z",
          "Titre": "I would give 5 stars",
          "Contenu": "I would give 5 stars, but your computer software protection does not work with Apple computers. Is there a reason why?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vi-Anh Nguyen",
          "Nb_Reviews": 1,
          "Date": "2016-12-17T14:42:50.000Z",
          "Titre": "There is a false transaction that is not showing up on banking",
          "Contenu": "The rest of the services are fine. There is one recent transaction however that is not showing up on my bank records."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bobby",
          "Nb_Reviews": 2,
          "Date": "2021-12-16T17:00:55.000Z",
          "Titre": "so far so good havent had to use it"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dean Duckwitz",
          "Nb_Reviews": 2,
          "Date": "2017-12-27T02:39:48.000Z",
          "Titre": "No investment account monitoring.",
          "Contenu": "I've been unable to have IdentityForce monitor investment accounts, only banks and credit cards."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "maurice L Hanson",
          "Nb_Reviews": 2,
          "Date": "2017-05-22T16:06:35.000Z",
          "Titre": "Site seems to be protecting me fully",
          "Contenu": "Site seems to be protecting me fully.  I do recall getting attempts from bad sites to hurt my system"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Becky",
          "Nb_Reviews": 1,
          "Date": "2017-11-03T20:20:02.000Z",
          "Titre": "It would be nice if in the text alert …b",
          "Contenu": "It would be nice if in the text alert you identified what the alert is for. Happy with the service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Billy Pritchard",
          "Nb_Reviews": 2,
          "Date": "2018-08-23T04:19:32.000Z",
          "Titre": "New website seems to be improving",
          "Contenu": "New website seems to be improving.  I talked to Austin about an issue and he was very helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Turner",
          "Nb_Reviews": 1,
          "Date": "2018-01-14T00:54:59.000Z",
          "Titre": "I have a Galaxy Note 8 any app does not …",
          "Contenu": "I have a Galaxy Note 8 any app does not work on my phone,  other than that I like the service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donald L Toombs",
          "Nb_Reviews": 1,
          "Date": "2017-04-24T10:20:27.000Z",
          "Titre": "Needs Mobile App",
          "Contenu": "started using last week works better than LifeLock Heeds Nobile app to make it work for me"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "M. Samaniego",
          "Nb_Reviews": 1,
          "Date": "2017-05-13T00:13:21.000Z",
          "Titre": "Pretty great service",
          "Contenu": "Pretty great service.  I have been using it for years.  Love the features and protection."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "cc",
          "Nb_Reviews": 1,
          "Date": "2018-03-21T17:50:48.000Z",
          "Titre": "Damien very helpful he knew exactly how…",
          "Contenu": "Damien very helpful he knew exactly how and where to point me in the right direction."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel P Mccormick",
          "Nb_Reviews": 1,
          "Date": "2017-09-29T13:16:55.000Z",
          "Titre": "It would improve the signup and account …",
          "Contenu": "It would improve the signup and account configuration is you added some mouse-over popups and hint messages on the entry screens.  We had to reason out some of the formats that the entry screens would allow through quite a bit of trial and error.  There were no error explanations to assist us, just an inability to proceed to the next step. For example your password entries on the account tracking allow pasting but reject the use of this without any explanation.  This results in confusion why a valid tracking password is not recognized.  A simple hint would resolve this.  Similarly the tracking account entries do not succeed if the financial institution has your account setup with two-factor authentication since there is not an opportunity to respond to the second validating code needed.  We had to remove the two-factor authentication on our bans and credit unions to allow us to setup IdentityForce.  The use of CLOSE WINDOW to accept and submit entries is a bit confusing since this button is more commonly used to exit a window that accept an entry.  Perhaps a SUBMIT or SAVE labelled button would be better combined with an alternative CANCEL button.We like some of the features and the layout of some of the site.  For example, the Services table is powerful and simple.  It would be improved by the use of hints as mentioned above."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Louis P McDaniel",
          "Nb_Reviews": 2,
          "Date": "2018-02-09T06:43:40.000Z",
          "Titre": "Unable to load fraudulent info",
          "Contenu": "Unable to load fraudulent info. Also your PC protection will not download on my Dell."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bobby R O'Neal",
          "Nb_Reviews": 1,
          "Date": "2015-07-20T00:43:37.000Z",
          "Titre": "No credit report",
          "Contenu": "I don't know why but my credit report never comes up like it's supposed to."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donna J Lloyd",
          "Nb_Reviews": 1,
          "Date": "2015-07-21T02:02:13.000Z",
          "Titre": "I needed to do this for quite sometime.",
          "Contenu": "I registered for the fraud alert twice.  It still isn't showing activation."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephen Peters",
          "Nb_Reviews": 1,
          "Date": "2017-03-09T00:12:17.000Z",
          "Titre": "Credit card number limit",
          "Contenu": "Please increase your credit card number limit past the current 10."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AA",
          "Nb_Reviews": 1,
          "Date": "2017-09-28T18:30:30.000Z",
          "Titre": "They’ve done a great job of monitoring …",
          "Contenu": "They’ve done a great job of monitoring my private information!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marc Oshiro",
          "Nb_Reviews": 1,
          "Date": "2017-09-15T21:25:00.000Z",
          "Titre": "Why don't you have an online chat …",
          "Contenu": "Why don't you have an online chat option for questions?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2018-04-09T21:42:21.000Z",
          "Titre": "Good site.....would like to know how to delete the trash",
          "Contenu": "Good site.....would like to know how to delete the trash."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donald Martineau",
          "Nb_Reviews": 1,
          "Date": "2017-10-07T14:16:11.000Z",
          "Titre": "Your IdentifyForce posts are behind my …",
          "Contenu": "Your IdentifyForce posts are behind my bank posts."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Anderson",
          "Nb_Reviews": 9,
          "Date": "2018-03-06T18:44:33.000Z",
          "Titre": "Maybe better wording on email alerts?",
          "Contenu": "I just started using my trial subscription and will likely continue.  But a few thoughts struck me today...I received my very first two IdentityForce emails on my iPhone while happily shopping with my wife at Costco.  The subject lines read: \"Smart SSN Tracker...\" and \"Sex Offender Monitoring Update\".    I glanced at the \"Sex Offender\" email and saw: \"...while this does not necessarily mean you are a victim of identity theft...\"  OMG!  Immediately, I think: \"Crap!  Someone on the Dark Web stole my SSN and they've dragged my identity into some sort of sex crimes!\"  This hung over my head like a cloud until I could get home and visit the provided links.   How thrilled I was to discover that the \"Sex Offender\" email was to show me a list of sex offenders in our vicinity -- and not that my identity had been wrapped up in some devastating crimes as I'd feared.  My initial panic wasn't due to a guilty conscience.  [OVERSHARE ALERT...] When I got married at age 24, I was a virgin by choice, so...  No illicit encounters in my life.  Ever.  Thus, my panic on the way home from Costco was: \"How will I clear my name if it's really bad?  Hire an attorney?  How costly is that?\"    ALL OF THIS TO SAY:  IdentityForce is obviously a GREAT service -- especially now that I can savor the value of the emails that initially caused me concern.  BUT...maybe on the email banner it should say something like: \"SEX OFFENDERS IN YOUR AREA -- UPDATE\".  That communicates more clearly and mitigates the drama for new customers.And, to a lesser degree of urgency, maybe the other email banner could be something like: \"SMART SSN VERIFICATION UPDATE.\"    Because if you put the two existing banners together, it tends to present a scary snapshot.  Just thought I'd share with you my morning adrenaline."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "George E McClain",
          "Nb_Reviews": 2,
          "Date": "2015-06-18T17:26:13.000Z",
          "Titre": "SEX OFFENER",
          "Contenu": "I NEED TO SEE WHAT THEY ARE SAYING ABOUT ME"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Adam C Webster",
          "Nb_Reviews": 1,
          "Date": "2018-05-05T13:51:56.000Z",
          "Titre": "Should add LinkedIn to monitoring tool."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "THERESA E TYSON",
          "Nb_Reviews": 1,
          "Date": "2016-01-04T18:10:26.000Z",
          "Titre": "Question",
          "Contenu": "Where do we get our passport protection?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alfred  W Grillo",
          "Nb_Reviews": 1,
          "Date": "2018-03-28T21:11:57.000Z",
          "Titre": "Website us hard to use"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-10T20:41:20.000Z",
          "Titre": "My experience with Identy Force",
          "Contenu": "They do what they say when you buy the product. I get absolute confidence that they keep my ID safe. Well worth the money to have peace of mind."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "sid l konicek",
          "Nb_Reviews": 5,
          "Date": "2023-11-09T22:16:20.000Z",
          "Titre": "was confused by an email they sent",
          "Contenu": "was confused by an email they sent, but they responded quickly and cleared it up!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carole R Bryon",
          "Nb_Reviews": 2,
          "Date": "2022-07-15T13:29:17.000Z",
          "Titre": "Final report on 20/20 eye care network data breach",
          "Contenu": "U did an excellent job In notifying me monthly regarding 20/20 eye care network data breach (1/21/2021 notification).U stated each month for 1 free year that no compromising info against me was never used against me.I have an atty representing me in this data breach.  Joseph Lyons Law Firm in Cincinnati OH. He has many other victims as well.  The Hearings have been heard In federal court in Ft. Lauderdale fl. They estimate another year or so 4 court results 4 all victims.  Update my new cell #561 255 4728 4 my records.  Carole Randi bryon"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AZsunfun",
          "Nb_Reviews": 2,
          "Date": "2023-03-08T16:44:32.000Z",
          "Titre": "Members for several years",
          "Contenu": "We have been members for several years.  If we had a concern or needed some help, we would call and always received assistance from someone who would explain everything we needed to solve our dilemma.  We always find them helpful and easy to understand.  Had another company before BUT am much happier with Identify Force."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joan C. Blank",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T19:56:27.000Z",
          "Titre": "I've been contacted when there was an…",
          "Contenu": "I've been contacted when there was an unusual purchase.  They seem to be very much aware and keeping tabs on my account.  I appreciate their constant review of all activities."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lynne Porcell",
          "Nb_Reviews": 3,
          "Date": "2023-06-29T01:06:11.000Z",
          "Titre": "I am in the process of updating all my…",
          "Contenu": "I am in the process of updating all my information. I am just so delighted to have professional people possibly going to help me if I got spammed or lose my wallet. I think the information I am putting into the app will be invaluable to make myself whole again and with help - I'm so thankful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angele Smith",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T20:12:19.000Z",
          "Titre": "My experience is relying on Identity…",
          "Contenu": "My experience is relying on Identity Force) to keep me from those who try to crash my computer with their rotten, illegal and harmful ways has been very good.So far, I am at ease when I boot my computer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Standingribroast",
          "Nb_Reviews": 3,
          "Date": "2023-08-22T18:18:05.000Z",
          "Titre": "Comfort in a frightening society",
          "Contenu": "I read about identity force in a retirement magazine from the office of personal management.I felt comfortable with their annual fee and I have a sense of confidence having them monitor me. I highly recommend Identity Force."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shari Hastings",
          "Nb_Reviews": 1,
          "Date": "2021-10-11T20:15:03.000Z",
          "Titre": "Just a shout out to one rock star…",
          "Contenu": "Just a shout out to one rock star IdentityForce employee- her name is Renarda and she will move heaven and earth to make sure her customers are well taken care of. I hope this company realizes what they have in this woman. Good customer service is a RARE commodity today."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "hm",
          "Nb_Reviews": 1,
          "Date": "2022-01-27T00:16:58.000Z",
          "Titre": "knowledgeable and willing to help",
          "Contenu": "Luna is very knowledgeable and willing to help. She took care of the issue I was having in a professional and timely fashion. I was ready to cancel my identity force plan due to the prior agent’s insistence that she would need to escalate my issue to a group that would call me back sometime in the future. After speaking with Luna, I kept my subscription in place."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank D",
          "Nb_Reviews": 9,
          "Date": "2022-10-25T21:05:42.000Z",
          "Titre": "Peace of Mind",
          "Contenu": "Peace of mind in the world of increasing data breaches... easy to sign up... easy to use website... useful webinar content... free VPN on mobile devices... $1mm insurance fund... monitoring alerts"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laree Weeks",
          "Nb_Reviews": 2,
          "Date": "2023-09-12T17:10:54.000Z",
          "Titre": "They have you covered and protected",
          "Contenu": "I enjoy knowing  that they are looking out for me and that they provide me with emails letting me k ow all is fine"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JW",
          "Nb_Reviews": 4,
          "Date": "2021-03-04T23:00:10.000Z",
          "Titre": "In the past I had used Life Lock and…",
          "Contenu": "In the past I had used Life Lock and got hacked badly. They did not catch obvious activity on my credit cards, other personal info.  Although no one can always catch everything, they didnt catch anything.  So I went with Identity Force about 4 yrs ago.  So far very pleased & I like how they send you your updated Credit scores monthly from the 3 Credit Companies.   No complaints"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deeana Johnson",
          "Nb_Reviews": 1,
          "Date": "2020-08-13T13:24:19.000Z",
          "Titre": "IdentityForce is Excellent!",
          "Contenu": "IdentityForce is the best online identity monitoring service in the country!Their weekly/monthly updates keep me informed to any harmful threats to my personal information. This gives me a peace of mind.Thank You IdentityForce! Keep up the great work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas Jablonski",
          "Nb_Reviews": 2,
          "Date": "2020-05-20T17:02:58.000Z",
          "Titre": "Polite and caring people",
          "Contenu": "Polite and caring people.  Helpful and alert people.  Wathful people who care about my private accounts and keep me posted by alerts if there is something in an account that does not seem right.  Alerts us when accounts need attention.  Always there to protect us.  Best service ever.  Much better than LifeLock!!!!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nathaniel",
          "Nb_Reviews": 3,
          "Date": "2021-12-31T14:36:21.000Z",
          "Titre": "Common Sense Protection In A Digital World",
          "Contenu": "The IdentityForce platform is a wonderful tool to protect you and your loved ones from cyber thieves. The platform is easy to navigate. The protection features are self-explanatory and simple to use. The platform allows you to register for a variety of alerts. IdentityForce makes sense in the digital world that we live in today. I strongly recommend IdentityForce!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janus Hardin",
          "Nb_Reviews": 1,
          "Date": "2021-12-16T04:20:46.000Z",
          "Titre": "Great Job",
          "Contenu": "Great Job, Thank You for your service to keep me from fraudulent activity on my personal accounts, also reminding your customers as myself to change our passwords, again Thank You Identy Force!!! Janus"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "F. Dick Maxwell",
          "Nb_Reviews": 1,
          "Date": "2019-08-20T18:56:08.000Z",
          "Titre": "I was very pleased with the ease of…",
          "Contenu": "I was very pleased with the ease of signing up for protection after being emailed a threatening message with a demand for money.  Identity theft is very disrupting to one's life but the knowledge of knowing you are being looked after is great.  Hope you never have to notify me!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eileen C.",
          "Nb_Reviews": 5,
          "Date": "2022-11-16T00:58:02.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good. I like the app and the fact that I can check it anytime. I purchased IdentityForce after I was notified by credit card companies that an inquiry was made, and I had attempted Identity Theft."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ROBERT OWENS",
          "Nb_Reviews": 2,
          "Date": "2023-08-16T19:35:11.000Z",
          "Titre": "Great protection",
          "Contenu": "Any time there is a questionable event on my credit file, I am notified of it. They give me options to handle any situations."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vicki Lynn",
          "Nb_Reviews": 5,
          "Date": "2019-11-30T08:08:48.000Z",
          "Titre": "I haven't been with IF very long yet, but",
          "Contenu": "I haven't been with IF very long yet, but I'm really liking it so far. Love that I can see all my credit reports and lock/unlock easily as needed. Also love that IF isnt constantly shoving new credit card offers down your throat."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "candybecker",
          "Nb_Reviews": 5,
          "Date": "2022-01-20T19:32:51.000Z",
          "Titre": "Grateful for the security",
          "Contenu": "I have received alerts from IdentityForce that made me aware of items. They wanted to verify they were mine (and they were), but I was grateful to know they were watching closely and notified me right away.  I feel safer knowing they are monitoring things."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joanne   Marin",
          "Nb_Reviews": 8,
          "Date": "2019-10-07T17:43:48.000Z",
          "Titre": "Identity Force told me about the Cafe…",
          "Contenu": "Identity Force told me about the Cafe Press hack in August 23, 2019 and showed me that my info was already on the dark web so I could immediately change passwords and bank info.  From now on, I'll be checking Identity Force once a day to get ahead of any more hacks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Margaret Joyner",
          "Nb_Reviews": 1,
          "Date": "2022-05-18T18:21:41.000Z",
          "Titre": "I am not very good with computers and I…I was connected with a very helpful lady who answered my questions and put my mind at ease. Thank you for having that kind of verbal support available.",
          "Contenu": "I am not very good with computers and I enjoy having the option of speaking with a live person.  I was connected with a very helpful lady who answered my questions and put my mind at ease. Thank you for having that kind of verbal support available."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patricia Keys",
          "Nb_Reviews": 2,
          "Date": "2022-12-23T00:34:50.000Z",
          "Titre": "Identify Force always keeps me informed …",
          "Contenu": "Identify Force always keeps me informed of any breaches.I feel safe knowing that I can breathe a sigh of relief, when I get my monthly report.It has been the best experience and the best decision I've ever made."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carol Hamrick",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T00:23:13.000Z",
          "Titre": "Knowing that I am OK",
          "Contenu": "I can rest easy knowing that IdentityForce is at work 24/7.  IdentityForce has a great way of communicating and keeping me informed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Margaret Anne Sullivan",
          "Nb_Reviews": 5,
          "Date": "2020-05-06T03:38:24.000Z",
          "Titre": "I love the quick information I receive…",
          "Contenu": "I love the quick information I receive from Identity Force concerning my identity profile. It was amazing to me how many areas my information was being sold on the web, etc. Thankful that Identity Force is quick to respond to each threat."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SMc",
          "Nb_Reviews": 2,
          "Date": "2022-07-14T18:47:38.000Z",
          "Titre": "Economically, Precise, Forthright",
          "Contenu": "I've only been with you a short while. Your staff is very forthright in their assessments of your personal situation. You have made it economically favorable Thank you again"
        },
        {
          "Note": 5,
          "Lieu": "SA",
          "Pseudo": "William Barbour",
          "Nb_Reviews": 2,
          "Date": "2021-12-17T16:48:35.000Z",
          "Titre": "Perfect Customer Service",
          "Contenu": "If I could rate the experience more than five stars, I would. Shekia had already resolved my issue before even calling me, which is extremely rare for customer service in itself. Once she had explained what the issue was and how she resolved it, she even waited on the phone at my request while I logged in and double-checked. I am in the Middle East and my internet is extremely slow, and she still waited for me to log in and verify that everything was in order. After that, she also stayed on the call to answer some general questions about Identity Force that I had.I can be an extremely stubborn person when it comes to a company's customer service. I will cut business with a stellar company if their customer service is terrible. If the other representatives are even half as courteous, knowledgeable, and helpful as Shekia, I will be sticking around Identity Force for a long time to come."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "cr",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T22:23:08.000Z",
          "Titre": "Satisfied customer.",
          "Contenu": "All i can say is I have been satisfied with the protection.  They have not hounded me everyday like some companies do.  Just quietly doing the job."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 3,
          "Date": "2021-11-03T01:58:34.000Z",
          "Titre": "Identify Force is my cloud of dreams",
          "Contenu": "In a busy world nothing grabs my attention more than the vulnerability of my family and financial security. Knowing the good folks at Identify Force have my back Is like sleeping on a cloud worry free."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "K R",
          "Nb_Reviews": 8,
          "Date": "2021-12-15T23:07:37.000Z",
          "Titre": "Excellent",
          "Contenu": "Highly recommend  this company to everyone.  I can rest easy knowing Identity Force is on the job keeping track of my accounts.  Always very courteous, friendly and helpful when I contact them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas Jablonski",
          "Nb_Reviews": 2,
          "Date": "2021-02-21T17:23:20.000Z",
          "Titre": "We trust you to keep our identity safe…",
          "Contenu": "We trust you to keep our identity safe and we like the alerts you give when a sex offender comes into our area.  We have had cards compromised and it is good to know that you protect these.  We just feel comfortable with the news letters and knowing you are there to protect us.  Makes us feel safe."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rozanne Timbes",
          "Nb_Reviews": 1,
          "Date": "2020-06-30T19:33:06.000Z",
          "Titre": "Haven’t had any issues",
          "Contenu": "Haven’t had any issues, they are working on a system issue that has for several months not allowed a download of an upgrade. Hasn’t seem to affect function."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deb",
          "Nb_Reviews": 1,
          "Date": "2022-10-04T18:27:35.000Z",
          "Titre": "Piece of mind",
          "Contenu": "It’s the piece of mind that someone is looking out for me and my family. My husband recently died and it is even more important than ever to know that those scammers are being watched."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customerDavid Birdwell",
          "Nb_Reviews": 1,
          "Date": "2022-02-02T20:40:46.000Z",
          "Titre": "It is always very reassuring to see all…",
          "Contenu": "It is always very reassuring to see all the negative boxes on the Identity Force home page.  Thank you so much for your hard work and attention to detail.Dave Birdwell"
        },
        {
          "Note": 5,
          "Lieu": "DK",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-02-16T18:35:34.000Z",
          "Titre": "Customer service is prompt on issues",
          "Contenu": "Customer service is prompt on issues, well informed and keep you up-to-date with changing times. Just wish service would not turn off when IPAD goes to sleep. Thank you for you time and service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-23T11:48:24.000Z",
          "Titre": "I am just another person that is aware…",
          "Contenu": "I am just another person that is aware of the threats out there in cyber land. I have had PCmatic for a couple of years now and since they recommended Identity Force I knew they would good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-05-11T20:41:57.000Z",
          "Titre": "I'm happy with the services provided",
          "Contenu": "I'm happy with the services provided. I have peace of mind knowing that my devices are being monitored by professionals and will tell me when suspicious activity is happening."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patricia Keys",
          "Nb_Reviews": 2,
          "Date": "2023-02-18T20:28:48.000Z",
          "Titre": "I have been with Identify Force for a…",
          "Contenu": "I have been with Identify Force for a few years. I'm happy with  the service they provide.It takes the worry out of wondering if someone is trying to breach your security. It was a wise decision on my part to consider their service,I'm glad I did."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-05-07T01:36:22.000Z",
          "Titre": "I think this is a great way to be…",
          "Contenu": "I think this is a great way to be protected I wish they had yearly plans but it's so far okay and it's the cheapest way to be able to protect your identity I have already looked to see if it was"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angel Gonzalez",
          "Nb_Reviews": 1,
          "Date": "2021-08-09T14:54:29.000Z",
          "Titre": "My son",
          "Contenu": "I had received a letter about my youngest son that his identity could be in trouble cause of some cyber problems and IdentityForce was there to help us with the situation thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "louie genzano",
          "Nb_Reviews": 5,
          "Date": "2022-02-24T16:42:46.000Z",
          "Titre": "Louie's honest reviews",
          "Contenu": "Identity Force is the best ID protection company.  They monitor your social number, driver license number, credit cards, you computer, your credit accounts, and your have the option of 1 million dollars in insurance. The price is very competitive with all competitors and its customer service and insurance people and friendly and knowledgeable. Thank you Identity Force for having the best ID company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donna Bolesta",
          "Nb_Reviews": 1,
          "Date": "2022-01-16T17:01:09.000Z",
          "Titre": "Very Helpful",
          "Contenu": "Luna was very helpful in resetting my email login as I recently changed emails.  She stayed with me to make sure I could log in after everything was reset.  I really appreciated the call."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patrick Boyd",
          "Nb_Reviews": 1,
          "Date": "2021-11-03T12:45:30.000Z",
          "Titre": "I feel very secure with you guys…",
          "Contenu": "I feel very secure with you guys watching my credit gives me something I don’t have to worry about it’s hard enough taking care of my mom so thanks a lot for taking care of my credit"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maria L Richardson",
          "Nb_Reviews": 7,
          "Date": "2019-07-25T16:24:51.000Z",
          "Titre": "The guards of my interest",
          "Contenu": "It is great to have a guardian of your interest in surveillance 24 hours a day. I do appreciate your assistance in these days of insecurity due to the increased security breaches. Thanks for being there."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Raymond and Kelly Hirth",
          "Nb_Reviews": 2,
          "Date": "2021-08-22T23:58:48.000Z",
          "Titre": "I wrote a review regarding Identity…",
          "Contenu": "I wrote a review about three weeks ago regarding Identity Force it was not a  positive one, but it was an honest one. A couple of days ago, I received a hand written apology even the envelope was hand written in business today no one takes the time to hand write any correspondence, when I received the correspondence I was extremely impressed, to the degree that Donna ensued. That,  Donna,  Senior Marketing Officer, would take the time out of her busy schedule to do this for one member, outstanding, that is the essence of \"great customer service\" also there was not a hint of an excuse, speaks volumes of a company culture that exists at Identity Force. I am reserving my final opinion on this trilogy of reviews. I was upset in the beginning of my experience with this company. Because of their actions and attention to details , I am giving them a chance to win me over for good. So stay tuned in for the last chapter, I am hoping for a positive outcome. Raymond Hirth"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LHarr",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T18:58:08.000Z",
          "Titre": "Confidence with IdentityForce",
          "Contenu": "We have serious confidence that IdentityForce is doing their job well based on our experience of the services they provide us. We've used other providers and have always been disappointed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "louie genzano",
          "Nb_Reviews": 5,
          "Date": "2023-05-22T08:39:07.000Z",
          "Titre": "Louie's Honest Reviews",
          "Contenu": "Insurance for Identity theft and not just a \"guarantee\" that others offer. Their insurance company that protects the clients are friendly, knowledgeable and professional. Also, the many features Identity Force offers are better than its competitors."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ted North",
          "Nb_Reviews": 8,
          "Date": "2023-03-01T19:59:35.000Z",
          "Titre": "I like that I receive a monthly report…",
          "Contenu": "I like that I receive a monthly report on monitoring.I also hope I would get a immediate notice if I did have a breach."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen Boyle",
          "Nb_Reviews": 1,
          "Date": "2022-03-09T15:48:41.000Z",
          "Titre": "I can be a \"technically challenged\"…",
          "Contenu": "I can be a \"technically challenged\" person.  Your site is user friendly.  I would never have signed up but my husband told me (he is NOT technically challenged) that I would really like it & he was right.  I am very pleased!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marily Kroh",
          "Nb_Reviews": 3,
          "Date": "2019-12-11T19:47:18.000Z",
          "Titre": "Good Job!",
          "Contenu": "I think Identity Force is doing a good job on guarding my information.I have been with them for approximately 2 years and I have had noproblems with Identity theft. I trust them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sharon",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T01:02:32.000Z",
          "Titre": "I chose identityForce because…",
          "Contenu": "IdentifyForce alerts me to unusual occurrences in my accounts and I can call if I need advise."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susana Garcia",
          "Nb_Reviews": 1,
          "Date": "2020-08-13T15:04:55.000Z",
          "Titre": "You are all wonderful",
          "Contenu": "You are all wonderful! Your staff from Customer Service is very knowledgeable and super nice!Many Thanks for all that you do to protect us."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "louie genzano",
          "Nb_Reviews": 5,
          "Date": "2019-03-20T22:50:01.000Z",
          "Titre": "The people I talked to at Identity…",
          "Contenu": "The people I talked to at Identity force were friendly, knowledgeable and professional. The comparison of IdentityForce with other competitors clearly shows a big edge for IdentityForce. One has to look at the comparison chart by IdentityForce to see the differences. Join IdentityForce and feel secure because what you get is not exceeded by competitors."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arlette Szegfu",
          "Nb_Reviews": 1,
          "Date": "2019-08-20T18:47:05.000Z",
          "Titre": "I’ve only had IdentityForce for two…",
          "Contenu": "I’ve only had IdentityForce for two months.  I chose you because of favorable reviews and competitive pricing.  Time will tell."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Smith",
          "Nb_Reviews": 1,
          "Date": "2022-06-09T02:28:58.000Z",
          "Titre": "I appreciate having someone like…",
          "Contenu": "I appreciate having someone like Identity Force having my back today with the idea of so much fraud going on in world"
        },
        {
          "Note": 5,
          "Lieu": "DK",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-04-12T16:55:05.000Z",
          "Titre": "Transactions",
          "Contenu": "Transactions/credit accounts weren't being active. Luna patiently walked me through the process to get working again, thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alice Price",
          "Nb_Reviews": 2,
          "Date": "2019-05-28T17:37:07.000Z",
          "Titre": "Identity Force has been very reliable…",
          "Contenu": "Identity Force has been very reliable in keeping up with incidents that have appeared on my computer.  Thank You!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "K. Woodman",
          "Nb_Reviews": 2,
          "Date": "2021-11-24T16:40:28.000Z",
          "Titre": "We feel our identities are safe",
          "Contenu": "We feel our identities are safe from scammers who prey on senior citizens and rob them of their life savings. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-08-16T23:17:43.000Z",
          "Titre": "Identify force has given me a peace of…",
          "Contenu": "Identify force has given me a peace of mind knowing someone is watching over my accounts. I LOVE that I get a monthly report."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SE Cinco",
          "Nb_Reviews": 5,
          "Date": "2020-03-11T01:22:08.000Z",
          "Titre": "Since I have used Idenitiy Force I have a feeling like I have a guard dog protecting my information…",
          "Contenu": "Since I have used Idenitiy Force I have had no issues with my personal information and how do you put a price on piece of mind."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 3,
          "Date": "2021-03-19T03:19:50.000Z",
          "Titre": "Peace of Mind",
          "Contenu": "Everyday security challenges can be overwhelming and stressful. Knowing Identify Force is on duty protecting me and my family is a God send."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tony",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T19:36:36.000Z",
          "Titre": "Keeping me well informed and updated on…",
          "Contenu": "Keeping me well informed and updated on my online presence"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James S",
          "Nb_Reviews": 2,
          "Date": "2020-04-21T15:13:55.000Z",
          "Titre": "This was one of the best decisions I…",
          "Contenu": "This was one of the best decisions I have made....left my other company to Identity Force and they have been on top of everything for me.  I finally feel comfortable that I am protected and someone is on MY side for a change!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barbara",
          "Nb_Reviews": 2,
          "Date": "2022-07-01T17:47:13.000Z",
          "Titre": "Great customer service",
          "Contenu": "Yesterday I spoke with a representative, and she confirmed my current coverage and explained the level of protection I am receiving.  She was helpful, professional and gracious.  I am thankful for Identity Force and their work on my behalf."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barbara Helms",
          "Nb_Reviews": 3,
          "Date": "2019-10-07T16:06:27.000Z",
          "Titre": "Thank you so much my order came in fast…",
          "Contenu": "Thank you so much my order came in fast and it was just what I wanted I will order from you again and recommend this company to my friends"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Dana",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T15:45:39.000Z",
          "Titre": "I love that someone knowledgeable…",
          "Contenu": "I love that someone knowledgeable answers to phone whenever I call, and that they answer in a timely fashion."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luanna Layton",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T13:57:59.000Z",
          "Titre": "The don’t have any negative remarks am…",
          "Contenu": "The don’t have any negative remarks am happy with the service I have received"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Berger",
          "Nb_Reviews": 2,
          "Date": "2020-02-11T15:27:47.000Z",
          "Titre": "Evaluation",
          "Contenu": "I am very confident that I am secure with Identity Force. I have has them for several years now and continue to subscribe."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JACK PERDUE",
          "Nb_Reviews": 2,
          "Date": "2020-06-18T20:27:39.000Z",
          "Titre": "I have not had to use them yet for any…",
          "Contenu": "I have not had to use them yet for any violations but I take great comfort that they are on my computer and watching my computer content."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin McElynn",
          "Nb_Reviews": 6,
          "Date": "2019-12-31T16:44:02.000Z",
          "Titre": "I like the updates",
          "Contenu": "I like the updates, and the fact that you are keeping track of my on line activity & advising if anything is suspicious."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elizabeth Banthem",
          "Nb_Reviews": 5,
          "Date": "2022-01-07T22:27:25.000Z",
          "Titre": "Best ever!",
          "Contenu": "I trust IF anytime I have a question they always are there to assure me and explain to me what if anything I need to do!!Very good service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "tujungateri",
          "Nb_Reviews": 21,
          "Date": "2019-12-30T20:50:43.000Z",
          "Titre": "Just started but called several times",
          "Contenu": "Just started but called several times. And they answer my questions. So far I like it better than trusted I'd."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carole R Bryon",
          "Nb_Reviews": 2,
          "Date": "2021-08-21T02:33:26.000Z",
          "Titre": "I was instructed 2 sign up with u…",
          "Contenu": "I was instructed 2 sign up with u regarding my possibility of a data breach and Identity fraud regarding 20/20 Eye Care Network in Syracuse, NY. The data breach caught on 20/20 Eye Care Networks computer systems on 1/11/2021.Their ltr was dated 6/18/2021 and I didn't get it until 6/28/2021.In this letter it stated a secret code 2 enroll with u. Which I did on 6/29/2021; but didn't complete your required application until 7/11/2021.I also signed up with an Joseph Lyons Law Firm in Cincinnati, OH who is now handling my class action lawsuit against 20/20 Eye Care Network.I researched and found there is a location In Hialeah, fl (Miami-Dade cty also). I live in Palm Beach cty (West palm beach, fl.)I was told by Joseph Lyons Law Firm in Cjncinnati OH that since they have so many victims like me In the Florida area, that the 1st court hearing will be held in Federal Court in Ft. LAUDERDALE, FL which is in Broward Cty. South Cty below Palm Beach Cty and North of Miami-Dade Cty.20/20 Eye Care Network that the data breach occurred in more than one standard location. More than 1 location. That's why there r more than various police depts and multiple FBI agencies involved in this tremendous data breach. I am one out of more than 3 million victims.And it will take more than 1 year 2 make settlement 4 all registered and effected victims.IDENTITY FORCE ULTRA SERVICES IS DOING A GREAT JOB IN KEEPING ME ABREAST OF MY FREE 1 YR MONITORING SERVICES. I did respond 2 my 1st 30 day results and I appreciate everything u r doing 4 me and millions or thousands of others in this important matter.I am also a victim of the newly reported T-Mobile data breach just 2 months later (20/20 Eye Care Network).I have already contacted a lawyer mentioned in 2days listing of 5 other law firms handling the T-Mobile breach. My daughter and I r both involved in this one.I just read that now AT&T also has a data breach.When r these data breaches going to end?Who knows.Take care: Carole Randi Bryon561 674 7874"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fred Gifford",
          "Nb_Reviews": 1,
          "Date": "2020-05-06T16:18:08.000Z",
          "Titre": "Very happy with service",
          "Contenu": "Very happy with service, always on top of it, I feel secure with Identity Force watching over my Identity."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harry Yannotti",
          "Nb_Reviews": 2,
          "Date": "2021-11-05T12:14:15.000Z",
          "Titre": "Well my insurance company was hacked…",
          "Contenu": "Well my insurance company was hacked and they thought it best to hire this firm to keep a I on their customers"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "A L .......USMC",
          "Nb_Reviews": 2,
          "Date": "2020-01-13T16:44:50.000Z",
          "Titre": "Just became a member a month a go so…",
          "Contenu": "Just became a member a month a go so far was notified to change E Mail password because it was hacked . Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patricia Love",
          "Nb_Reviews": 1,
          "Date": "2021-11-11T08:42:07.000Z",
          "Titre": "No Complaints.",
          "Contenu": "So far, I have found nothing wrong with IdentityForce. They keep me informed and the cost is very reasonable for my piece of mind."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T00:56:09.000Z",
          "Titre": "I really appreciate Identity Force",
          "Contenu": "I really appreciate Identity Force and what they do. I feel more secure being a customer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-03-18T22:23:11.000Z",
          "Titre": "This week",
          "Contenu": "This week, after accessing my account I was unable to input information.  Austin assisted me to correct the problem.  He was patient, kind, knowledgeable, understanding.  He is a great representative of your company's customer service.  Kudos to Austin!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary Garrett Engman",
          "Nb_Reviews": 2,
          "Date": "2019-09-16T20:18:51.000Z",
          "Titre": "I feel a bit more protected",
          "Contenu": "I feel a bit more protected.  Being a widow and alone I need some help to keep myself safe.  I feel confident that they will keep my ID safe all over the webs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amelia Griffin",
          "Nb_Reviews": 1,
          "Date": "2020-03-26T14:15:53.000Z",
          "Titre": "You're doing a very good job nobody's…",
          "Contenu": "You're doing a very good job nobody's tried to hack me yet are use my birth certificate"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Asghar Ebrahimzadeh",
          "Nb_Reviews": 2,
          "Date": "2019-08-21T10:51:23.000Z",
          "Titre": "I am happy with Identity Force",
          "Contenu": "I am happy with Identity Force. I know that they are always keeping me be safe and not being worried about my accounts.Thank You"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terry Thompson",
          "Nb_Reviews": 1,
          "Date": "2022-03-30T21:03:49.000Z",
          "Titre": "I’m so happy to have this service",
          "Contenu": "I’m so happy to have this service. I’m so worried about cyber attacks.You guys do a great job and I’d recommend to everyone to get this.Terry Thompson"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LINDA SIEG",
          "Nb_Reviews": 1,
          "Date": "2021-12-17T14:26:34.000Z",
          "Titre": "Amazing",
          "Contenu": "I never thought I could afford this kind of protection, thank you for keeping me protected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 3,
          "Date": "2023-07-12T14:56:18.000Z",
          "Titre": "I’m comfortable in knowing that a…",
          "Contenu": "I’m comfortable in knowing that a reputable company is watching and alerting me to activities in my accounts"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Waidl",
          "Nb_Reviews": 2,
          "Date": "2019-06-20T17:08:24.000Z",
          "Titre": "Thoughts From a Client",
          "Contenu": "I am very satisfied and happy with the service from IdentityForce. I am also relieved to have this protection."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Big Paul",
          "Nb_Reviews": 3,
          "Date": "2021-02-19T23:50:47.000Z",
          "Titre": "The service does everything a Id…",
          "Contenu": "The service does everything a Id protection company should do. Always in touch with any threats"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-07-13T19:19:20.000Z",
          "Titre": "I love that I don’t have to monitor…",
          "Contenu": "I love that I don’t have to monitor them and I get a report that tells me what they find. Called peace if mind!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robb Carpenter",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T21:40:39.000Z",
          "Titre": "So far with Identity Force I have…",
          "Contenu": "So far with Identity Force I have experienced computer security and peace of mind."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandy",
          "Nb_Reviews": 2,
          "Date": "2021-06-25T15:21:44.000Z",
          "Titre": "i am utilizing the free offer",
          "Contenu": "i am utilizing the free offer I am not sure what this does, in reviewing my dashboard have nothing reported."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "louie genzano",
          "Nb_Reviews": 5,
          "Date": "2021-11-03T19:00:18.000Z",
          "Titre": "Louie's honest reviews",
          "Contenu": "Identity Force offers a good price, has insurance not just a guarantee, covers your personal cards that are kept in your wallet, watches your social security number, their website is easy to navigate, they notify you if anything is suspicious, you can freeze your financial accounts with just using you computer and their customer service department is excellent. I have been with them for years and they are excellent in every way."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "michael",
          "Nb_Reviews": 5,
          "Date": "2019-05-28T17:41:43.000Z",
          "Titre": "So far so good.",
          "Contenu": "I don't have enough time to truly rate it. However compared to a very well known company I find it alerts me and keeps me in the loop much more often. No complaints so far."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christina",
          "Nb_Reviews": 4,
          "Date": "2022-01-13T21:28:28.000Z",
          "Titre": "Love their customer service and always…",
          "Contenu": "Love their customer service and always helps me so much with my questions!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Glenda Mayes",
          "Nb_Reviews": 2,
          "Date": "2020-01-13T16:00:56.000Z",
          "Titre": "This is a great service I never worry…",
          "Contenu": "This is a great service I never worry about my security with identity force I would and have recommended it to others"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 3,
          "Date": "2019-08-21T04:30:03.000Z",
          "Titre": "Always keeps up with my activity and…",
          "Contenu": "Always keeps up with my activity and informs me often. Helps me feel secure, thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customeTomas Sanchezr",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T15:32:47.000Z",
          "Titre": "My experience way satisfactory because…I did feel protected",
          "Contenu": "My experience way satisfactory because I did fill safehaving this company protecting  me from thieves.."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kenneth Schwarz",
          "Nb_Reviews": 1,
          "Date": "2019-12-30T17:15:10.000Z",
          "Titre": "Everything has been great under the…",
          "Contenu": "Everything has been great under the care, and supervision of Identity ForceThank You,Ken"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom Zentz",
          "Nb_Reviews": 2,
          "Date": "2023-01-20T04:11:25.000Z",
          "Titre": "I get an alert for any suspicious…",
          "Contenu": "I get an alert for any suspicious activity on my accounts"
        }
      ]
    }
  ]
}