{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.pawnamerica.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customerMusic Man",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T22:40:18.000Z",
          "Titre": "BAD PACKING It came on time but the turntable was…",
          "Contenu": "It came on time but the turntable was poorly packed causing the platter to bounce around and destroy the needle! It is an irreplaceable vintage Shure cartridge that there are no original replacement needles available. It is shameful to treat valuable irreplaceable items like that. That needle can only be replaced with questionable aftermarket products and will never have the same sound"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T04:57:57.000Z",
          "Titre": "Better Employee customer service",
          "Contenu": "Employees are rude unfriendly don't know about products they sell"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joel Antonio",
          "Nb_Reviews": 2,
          "Date": "2023-09-27T23:11:30.000Z",
          "Titre": "Received a locked Apple Watch Ultra and…",
          "Contenu": "Received a locked Apple Watch Ultra and had the inconvenience to return it and shop somewhere else for another one, waiting on full refund upon arrival of item sent back. This store should check activation to ensure it is fully unlocked and ready to use before shipping or selling it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-25T19:03:47.000Z",
          "Titre": "Purchased a car amplifier from website",
          "Contenu": "Purchased a car amplifier from website which had to be shipped. it was not even wrapped in bubble wrap or anything just thrown in a box with foam peanuts. Side of amp was dented which could have been avoided. Complete laziness when I was charged 38.00 shipping. Never doing business with these creeps again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Margie",
          "Nb_Reviews": 4,
          "Date": "2023-08-27T21:18:47.000Z",
          "Titre": "Never received  order was hoping it be…",
          "Contenu": "Never received  order was hoping it be here for my son's birthday  which is today I'm heartbroken  because I ordered  it and no show just figured  it's running  late"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JERRY",
          "Nb_Reviews": 1,
          "Date": "2022-12-27T02:23:18.000Z",
          "Titre": "ONE STAR DOSE NOT COVER IT.",
          "Contenu": "ONE STAR DOSE NOT COVER IT.. THEY SHOULD HAVE NEGATIVE 5 STARS.I purchase a product that had a battery included. Parcel arrived without battery. I called customer service right away..... mister Kyle told me that the battery was send along with the machine that I ordered....basically he accused me of laying...I purchased the USED product through them ONLY because it had the battery included. I could of buy brand new product with the battery for same amount of money. Now I have used machine and no battery..... That company has thieves and liars in their shipping quoters. I would never buy anything from them nor I would recommend them to anyone. BEWARE!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Zach",
          "Nb_Reviews": 1,
          "Date": "2023-01-21T19:34:44.000Z",
          "Titre": "Misleading Descriptions",
          "Contenu": "I purchased a tablet from Pawn America online. It was listed with very minimal damage to the screen. But it had several very very deep scratches, and maybe 30 micro scratches. It was listed in a way that made it seem it was almost mint condition but it was far from it. Of course their only solution is just to return it. And of course they have a very very short return window. So basically I will have wasted weeks trying to find and get a working product"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pawn",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T18:36:10.000Z",
          "Titre": "Would not recommend",
          "Contenu": "Would not recommend. I ordered a camera lens for Duluth online and they sent a different lens. They were unable to find the correct one. They gave me options I could send the one back and get refund or keep the one I had an pay with no discount on the lens. Didn’t feel the company really cared it was at there fault that I would have to make a trip to send back the lens an I offered to keep it would have expected that they could have discounted the wrong lens that was sent since it was an error on the companies side. But was offered no such thing. Worst customer service. Not apologetic about the mix up."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Diana Johnson",
          "Nb_Reviews": 2,
          "Date": "2023-07-07T00:52:46.000Z",
          "Titre": "I called this pawn shop in Robbinsdale…",
          "Contenu": "I called this pawn shop in Robbinsdale mn and specifically asked if I could pick up a pawn that had been taken out by my husband.  The customer service agent said that as long as I had my husband ID and that my ID had the same last name and address as my husband then I could pick up the pawned item. I went to the Robbinsdale mn location and attempted to do just that and was being helped by a nice man.  All of a sudden this woman came over and said \"what's up \" I explained that I was paying to retrieve the pawned item and she rudely said that I couldn't unless I had a marriage certificate.  I explained that I had called ahead and was told that I could show my ID and if it was the same last name and address a wife could retrieve the item.  With out looking at the matching address she said they were wrong.  Very rudely I might add. She said to tell my husband to pick up his own stuff.  I left very frustrated. Also I had come there a week earlier to pay $50 on the pawn and they would only let me pay the interest no anything extra.  Horrible service and will never go there again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T15:45:04.000Z",
          "Titre": "I bought a porter cable stapler and it…",
          "Contenu": "I bought a porter cable stapler and it does not work."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jake Lundstrom",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T01:10:16.000Z",
          "Titre": "Left with my item vandalized after being mistreated",
          "Contenu": "Yesterday, I visited a store to sell two nearly unused guitar amplifiers with excellent condition. However, I was taken aback by the online quote they provided, valuing each amplifier at a disappointingly low price of $80. As I needed to contribute to an emergency fund, my options were limited, and I reluctantly proceeded with the transaction. Additionally, I also brought along a snowblower for evaluation.Upon arriving at the store, the staff member informed me that they would only offer $70 for both amplifiers combined, which was a letdown considering the already underestimated online quote. To make matters worse, the staff member displayed unprofessional behavior by rudely shoving the amplifiers back at me when I declined their offer. Although frustrated, I informed them about the snowblower I intended to sell.The staff member then inspected the snowblower and proceeded to search for the serial number. To my dismay, they intentionally wiped off the serial number sticker with their thumb, rendering it illegible. Despite having recognizable traces of ink and mud on their thumb, they asserted that they could not accept the snowblower without a serial number. This deliberate act of tampering with my personal property can be considered vandalism, preventing its sale anywhere else. Importantly, these incidents were witnessed by two individuals accompanying me.As a customer of various establishments for over three decades, I have never encountered such mistreatment and disregard for professionalism as I experienced at this store."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kameron Munger",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T23:52:26.000Z",
          "Titre": "I bought a tag watch never got it they…",
          "Contenu": "I bought a tag watch never got it they said that they would get ahold of the postal service and have it investigated and haven’t heard anything"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Erik",
          "Nb_Reviews": 2,
          "Date": "2023-09-17T19:41:17.000Z",
          "Titre": "I ordered a HomePod from your site and…",
          "Contenu": "I ordered a HomePod from your site and in the description it said working and was tested before shipping.   NOT TRUE.  It does not work as described"
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T16:09:30.000Z",
          "Titre": "I didn't get my package",
          "Contenu": "I didn't get my package, it was delivered on a different adress, different city and state.Eugenia Leticia González Maldonado"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customercatherine",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T03:12:10.000Z",
          "Titre": "The case is sticky and doesn’t work…",
          "Contenu": "The case is sticky?? With something stuck in the lid and one of the earbuds won’t connect. Expensive and not in good shape"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hannah Sonsalla",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T17:59:06.000Z",
          "Titre": "2 days spent on the phone on hold with no answer",
          "Contenu": "I have spent the last 2 days on hold on the phone. They don't answer. I'm not impressed. I bought a ring that needed to be resized that was supposed to be able to be picked up on March 11th, it is now March 16th and I don't have my ring. I'm furious as it is my engagement ring and wedding band."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T18:31:07.000Z",
          "Titre": "The playstation keeps over heating and…",
          "Contenu": "The playstation keeps over heating and turning off I'm gonna buy a colling station for it. Hope it fixes it..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T00:20:12.000Z",
          "Titre": "Item showed up with missing parts",
          "Contenu": "Item showed up with missing parts. Went back and double checked the original pictures and the part was there. When I received it it was missing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jim Storms",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T15:04:31.000Z",
          "Titre": "They sent my PlayStation 3 to me with…",
          "Contenu": "They sent my PlayStation 3 to me with the wrong power cord and controller wire did not match up with console could not plug it into the console had to buy new controller and power cord PlayStation works fine next time they need to take their time packing and making sure correct parts are sent"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-22T23:08:12.000Z",
          "Titre": "Never received item",
          "Contenu": "Never received item, website says order still pending it’s been over a week."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T00:01:29.000Z",
          "Titre": "Didn't even  send the mounting piece…",
          "Contenu": "Didn't even  send the mounting piece for the windshield. Very disappointing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer unhappy",
          "Nb_Reviews": 1,
          "Date": "2023-01-09T16:46:46.000Z",
          "Titre": "The Nintendo 3ds that arrived was…",
          "Contenu": "The Nintendo 3ds that arrived was broken and stuck on high volume. It should have been stated on the description that that was a problem."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-02T04:23:56.000Z",
          "Titre": "The item was a 1/4” torque wrench",
          "Contenu": "The item was a 1/4” torque wrench, the box and paperwork are from a 3/8” torque wrench, and the item listing was for a 1/2”  torque wrench."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T16:53:31.000Z",
          "Titre": "Sold me a non functional wah pedal."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joshua M",
          "Nb_Reviews": 3,
          "Date": "2023-04-09T19:27:42.000Z",
          "Titre": "This nail gun is flaky",
          "Contenu": "This nail gun is flaky. Only works half the time I keep having to take it apart and put it back together just to run 3 nails out if it. I should have bought 1 off Ebay with a return policy."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T15:06:03.000Z",
          "Titre": "The device was non functional when…",
          "Contenu": "The device was non functional when received.  I needed to fix it myself.  Screen and trackpad didn’t work."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T16:18:24.000Z",
          "Titre": "Did not answer any of my emails…",
          "Contenu": "Did not answer any of my emails…. Trash company. Do better"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Orlando Taylor",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T20:55:30.000Z",
          "Titre": "The part was not what was advertised."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vicky",
          "Nb_Reviews": 1,
          "Date": "2022-08-31T03:11:48.000Z",
          "Titre": "I was very disappointed as I have…",
          "Contenu": "I was very disappointed as I have bought several things on your website.  I could not get into my regular account so I tried creating a new one.  I finally got in and placed the item in my cart.  When I went to pay it it said it was no longer available. What?  It was in my cart!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christopher Combs",
          "Nb_Reviews": 1,
          "Date": "2022-07-02T17:56:08.000Z",
          "Titre": "Frustrated",
          "Contenu": "I ordered a ps4 online and when i received the package it didn't come with everything it was supposed to it was missing the conroler and hdmi cable so they shipped me those right away and when i received them i open the package and go to set up the console and noticed the hdmi cable has so much dust or dirt packed in the connections that i dont dare try using it and have to go by a new one and after all that i get the thing hooked up and it doesn't even work it wont read any game disks...SO NOT A HAPPY CUSTOMER?!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sunshine",
          "Nb_Reviews": 1,
          "Date": "2022-05-31T00:37:27.000Z",
          "Titre": "Ugh..",
          "Contenu": "So unfortunately I have to write another review. While the customer service and shipping was great! The product was not. I do know there are risks with purchasing from a pawnshop and I should of been more careful myself. But I purchased a shark hair dryer and it came with bedbugs never again never again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-12T00:27:45.000Z",
          "Titre": "Product wasn't delivered with no…",
          "Contenu": "Product wasn't delivered with no explanation. Refund was issued."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Medina",
          "Nb_Reviews": 1,
          "Date": "2022-10-04T20:17:19.000Z",
          "Titre": "I'm not sure what that is that works…",
          "Contenu": "I'm not sure what that is that works there white hair ugly face but very unprofessional it is and the boss /manager guy well he plays dumb"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andre randle",
          "Nb_Reviews": 1,
          "Date": "2023-02-17T05:10:18.000Z",
          "Titre": "I didn’t get my remote",
          "Contenu": "I didn’t get my controller."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sophat Mean",
          "Nb_Reviews": 2,
          "Date": "2022-01-06T16:03:57.000Z",
          "Titre": "I order Vexilar Flx-28 online and they…",
          "Contenu": "I order Vexilar Flx-28 online and they send me Vexilar Fish Finder Scout IR800 instead. Called them for a return they said the order was mess up with the order customer. So i have to return my wrong item. I do not know how they get mix up with the order. The problem is my receipt is showing vexilar flx28, but i have a wrong item.."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-28T14:22:04.654Z",
          "Titre": "The speaker i orders for 200$ does not stay charge or sound good",
          "Contenu": "The speaker i orders for 200$ does not stay charged and it has a crackling in the sound when playing these were all things I asked about prior to paying for the item I just don’t like to go back and forth I’ll leave a bad review and continue with life"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steven hemingway",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T21:57:11.000Z",
          "Titre": "The PS4 was broke",
          "Contenu": "The PS4 was broke when I got it and won't turn on"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-08-09T18:43:55.000Z",
          "Titre": "Can’t listen to simple instructions",
          "Contenu": "I asked to pick up in store when ordering online. I received a shipping confirmation in error and called store again to hold for pickup till Saturday. Manager said that he would take care. I received the package at my doorstep on Wednesday (luckily it wasn’t stolen).  Wife opened package and a ANNIVERSARY SURPRISE WAS RUINED!!!!! Long time customer is now never again customer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jennifer Olson",
          "Nb_Reviews": 1,
          "Date": "2021-06-10T14:51:58.000Z",
          "Titre": "Rip off artists 🤬🤬🤬",
          "Contenu": "Not impressed at all. Two thumbs down 👎🏻👎🏻 Long story…suffice it to say I had to pay twice what I was given for my item to buy back my own flipping property. Huge freaking mistake on Pawn America’s part. I’ll NEVER go there again. EVER. There are plenty of other pawn shops in this city. Maybe work with the client next time boneheads. *rolling my eyes*"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jim G",
          "Nb_Reviews": 1,
          "Date": "2020-07-23T17:44:12.000Z",
          "Titre": "Had to wait forever to get staff to…",
          "Contenu": "Had to wait forever to get staff to help me with an online order that I was picking. When I did find someone to help me they said” I don’t have access to the warehouse. You will have to find another person”. Note: There were two staff members flying a drone outside the store with a customer. I finally did find someone to help me who I believe was the manager. Once I found a staff member who could help me, they did so quickly."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-19T22:26:08.110Z",
          "Titre": "Poor customer service",
          "Contenu": "Poor customer service. the listing said the ratchet I purchased was red handled. the ratchet I got is orange handled. So I messaged the seller the day it was delivered about this issue I haven't got a response."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steve R",
          "Nb_Reviews": 1,
          "Date": "2020-05-06T21:40:08.000Z",
          "Titre": "Cancelled my order",
          "Contenu": "Had trouble ordering on website. Called customer service and was told \"there's nobody here that can help you\". Finally got order to process. Half day later I get a notice of a credit from Pawn America on Paypal. Next day, I get automated email saying they couldn't find the item that I ordered, and had cancelled order. Won't ever bother with them again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kim Petersen",
          "Nb_Reviews": 2,
          "Date": "2020-01-06T17:36:54.000Z",
          "Titre": "Still waiting for a response on the…",
          "Contenu": "Still waiting for a response on the poor service ( $1400 for a $3000 bracelet we bought from Burnsville and sold back to Burnsville )and wrong info I was given on buy backs, I guess I am being ignored because Pawn America doesn't like bad honest reviews?  We noticed you removed our other review after Pawn America whined enough😩😵😫"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-10-24T02:12:48.000Z",
          "Titre": "Customer service is lacking",
          "Contenu": "They sold the item that I purchased online the next day then say oh we never had it"
        },
        {
          "Note": 1,
          "Lieu": "JM",
          "Pseudo": "Gavin",
          "Nb_Reviews": 1,
          "Date": "2019-10-01T14:09:32.000Z",
          "Titre": "I bought two iPhones from pawn America…",
          "Contenu": "I bought two iPhones from pawn America they were shipped to me in no time at all I was so excited ,its an iPhone xr and iPhone xs max I bought them unlocked . It said unlocked on the website when i put my sim card in it says carrier lock on both of them I was so angry my head was going to burst . What they did was unacceptable and false advertising.."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bill Bobson",
          "Nb_Reviews": 1,
          "Date": "2019-12-21T21:00:42.000Z",
          "Titre": "Products being advertised were not…",
          "Contenu": "Products being advertised were not available. Not one of them. The database isn't accurate at all. The website isn't accurate at all. It's like buying something on Amazon and them saying no we don't actually have anything we advertised. Which is not how Amazon does it. After 2 or 3 attempts to purchase something off this piece of crap site I went to Amazon after all got a better product and better deal. So actually thanks for having a crap site."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brasstacks 54",
          "Nb_Reviews": 2,
          "Date": "2018-10-15T19:16:39.000Z",
          "Titre": "The tool they gave us had parts…",
          "Contenu": "The tool they gave us had parts missing.  We could not exchange for a different tool. Credit had to be issued by the home office ( which was timely ) and we had to go through the order process again. I could handle the credit and sales process, but selling a tool with critical parts missing, lost my confidence in the quality of what is being sold and the value being placed on a particular item."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thurman Jenner",
          "Nb_Reviews": 3,
          "Date": "2019-02-17T12:40:24.000Z",
          "Titre": "Are you kidding me???",
          "Contenu": "Not only did I not get what I ordered because they lost the product and was explained away as \"sold in store\" when I ordered it online after store hours, but it took me 3 days to get my money freed up so that I could go do my shopping somewhere else.To be honest I think they felt like the price was too low on the product and refused to sell it to me... Very shady people to deal with. I will never try to buy from them again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris Oien",
          "Nb_Reviews": 1,
          "Date": "2019-04-13T18:51:30.000Z",
          "Titre": "Very disappointed",
          "Contenu": "Purchased an item on their website for in store pick up. Went to pick it up and they shipped it out and said \"oh sorry nothing we can do about it\" waisted 20 min in the store waiting for them to figure out what happened plus the waisted trip to the store.They can't even get me a tracking number.Update: It arrived in the mail and the item was listed as factory sealed never used but it is NOT factory sealed and very obviously has been used."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Debbie Petersen",
          "Nb_Reviews": 2,
          "Date": "2019-04-21T17:52:24.000Z",
          "Titre": "\"Was Price\"",
          "Contenu": "Why do you change the \"was price\" on your merchandise on your website then say \"10% or 30% off\" when that is not true, An item has been $999.99 in the store months but you raise it to to $1197.00 then say 30% off to make it $8something, thats cheating and just bad business, give us customers that know the prices  more credit then that, do not start being a cheat, do things right, I like Pawn America, but not if it has to play those kind of games!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "UY",
          "Pseudo": "Ana",
          "Nb_Reviews": 1,
          "Date": "2018-04-18T21:03:35.000Z",
          "Titre": "I bought a drone and it was a fake!",
          "Contenu": "I bought a drone on eBay that in the description said that it was perfectly working and it a fake, it had broken parts and the software was wrong so I've never could flown it. Im an international buyer, due to this situation I asked for a refund and they said me that they doesen’t do refund to international buyers!! I don’t recomend this store for nothing!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2019-08-05T17:15:05.000Z",
          "Titre": "Ordered online to pick up in store",
          "Contenu": "Ordered online to pick up in store. Arrived a few hours later to pick up order. Staff had not even begun to process my order and seemed confused about the whole thing. After standing around for 30 plus minutes the manager came out and apologized because they didn’t have the item. Then customer service emailed me telling me I would receive a $20 coupon. I never received it and had to reach out them again to get the coupon. Nonetheless I won’t be using it and I won’t return to this store."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "-Aaron",
          "Nb_Reviews": 1,
          "Date": "2018-08-07T15:56:44.000Z",
          "Titre": "Sent me the wrong knife that I ordered…",
          "Contenu": "Sent me the wrong knife that I ordered and it would seem like they made a mistake on the pricing and didn’t want to let me have the knife for the price listed on the website. So instead sent me a different knife and tried to cover it up and give me a refund so they wouldn’t lose out on the money after they made a mistake on the net."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ian Beavers",
          "Nb_Reviews": 1,
          "Date": "2020-04-25T08:06:22.000Z",
          "Titre": "I ordered a nintendo switch used..",
          "Contenu": "I ordered a nintendo switch used... for nearly full retail price (250$)  It had cigarette smell all over it and was dirty. The left controllers trigger button is broken and the will need replaced. The picture and description used was not accurate as it claimed the switch was fully functional."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jacob Ashford",
          "Nb_Reviews": 1,
          "Date": "2018-05-13T12:47:30.000Z",
          "Titre": "The reason I give 1 Star is because the… failed to provide advertised item",
          "Contenu": "The reason I give 1 Star is because the item described was NOT the item I received. The item I received I have no use for and would not have purchased. I double checked the order and the confirmations etc to make sure I ordered what I was looking for and they did have it listed as that. What they mailed me was not what I ordered."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Scott",
          "Nb_Reviews": 1,
          "Date": "2018-07-22T12:44:00.000Z",
          "Titre": "Pawn America's lack of informing its…",
          "Contenu": "Pawn America's lack of informing its customers that the on site buying and picking up in store, you cant go in on sundays to pick it up. Nowhere on the website does it state they are closed for online ordering pickups even the guy at the store informed me it doesn't state on website they are closed for picking up online orders on Sundays. Also canceling the order the gentleman on the phone in Minnesota was very rude. I will stick with Facebook Marketplace for all my buying needs."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Reiva  Denk",
          "Nb_Reviews": 1,
          "Date": "2020-04-17T02:56:30.000Z",
          "Titre": "I paid for an item online",
          "Contenu": "I paid for an item online, I called to make sure I was going to the correct store for pick up, because it was not listed on our final info/receipt. Luckily I did, because I was informed someone had somehow just walked out with it. Somehow this type of thing needs to be corrected."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mustang Memo",
          "Nb_Reviews": 2,
          "Date": "2018-04-20T23:52:31.000Z",
          "Titre": "I didn’t get what I was promised things…",
          "Contenu": "I didn’t get what I was promised things were missing, but it’s ok karma comes back around. Only reason I kept the Go Pro was because I read the reviews and seen that some people didn’t get their money back. So I was fearing not getting my money back and decided to keep it. Thanks for screwing me over Pawn America"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kim Petersen",
          "Nb_Reviews": 2,
          "Date": "2020-01-25T16:02:01.000Z",
          "Titre": "Poor trade😵",
          "Contenu": "Well I went back on my word and tried Pawn America AGAIN, brought in a beautiful ring I bought from them less then 1 year ago , paid $3299.00 for, first they offer me $800 for it's gold weight, then I say I just want a loan, they tell me it is only worth $1800(!!!!!!!!!!!!!!), then why did I pay $3299.00?  Help me understand this madness?  The moral was so bad at Burnsville Pawn America I thought I walked into a morgue and not a retail store, PA, your failing badly, your prices are outrageous, come back down to earth!  Signed Debbie Petersen"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Badoglio RamosRivera",
          "Nb_Reviews": 1,
          "Date": "2019-12-17T05:08:52.000Z",
          "Titre": "I bought a PlayStation vita on line for…",
          "Contenu": "I bought a PlayStation vita on line for a gift that I should gave to my son a week later That I received, with a little bit of money in my account I spend 147 dollar for the vita and I was exited for the gift, but surprise when I got the PlayStation the PlayStation was locked for the previous owner and no way to unlocked so I when I call customer service they told me to returned and they will give me my money back and with no time and money to buy other one my son was sad the day of his birthday I really screw up his birthday, not happy with all this."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nate",
          "Nb_Reviews": 1,
          "Date": "2022-01-31T22:22:07.000Z",
          "Titre": "Broken joy cons on delivery.",
          "Contenu": "Bought a switch online from the Rochester store. They sent me the switch and the joycons were broken so I had to buy new ones. Might as well have bought a new switch at that point. I ended up paying more."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joshua Amend",
          "Nb_Reviews": 1,
          "Date": "2018-06-20T21:49:22.000Z",
          "Titre": "Customer service sucks to the extent…",
          "Contenu": "Customer service sucks to the extent its my last time dealing with the west allis location. Brought in a tool to pawn was told they don't take specialty tools. (I had a hub grappler) ok and left. Call back to ask what the list of stuff they don't except is. Was told \"a lot\". What are you trying to bring in. I stated im trying to figure that out. What don't you guys take? Wouldn't give me a list of what they don't except. Very lazy and rude in my opinion. Will not being doing business with them ever again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cindy Dumpprope",
          "Nb_Reviews": 1,
          "Date": "2020-01-09T16:20:15.000Z",
          "Titre": "I purchased a game system for a…",
          "Contenu": "I purchased a game system for a Christmas present for someone from another state.  Got it in a timely manner, but just before they left for home, they told me it was broken.  I didn't have time to return it and they took it with them when they returned home, saying they can have it repaired.  Never again will I buy from Pawn America as an online purchase and I will ALWAYS demand to see it fully functional before purchasing in the future.  It was a very low blow and poor business practice.  Thanks a lot for making me waste $200 on a broken game system that I can't even return."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ryan Meidam",
          "Nb_Reviews": 1,
          "Date": "2019-07-23T03:06:36.000Z",
          "Titre": "Visited the Westhill bld",
          "Contenu": "Visited the Westhill bld. store today to purchase a crossbow and while looking it over, I was approached \"rushed\" by an employee in a hostile and threatening manner yelling at me. Apparently this is not a safe place for a disabled person to do business."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Luciano Siragusa",
          "Nb_Reviews": 3,
          "Date": "2022-10-01T05:44:47.000Z",
          "Titre": "They sold me a stolen cellphone",
          "Contenu": "They sold me a stolen cellphone.  According to my carrier the phone was reported stolen 6 months ago"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "emily kohlwey",
          "Nb_Reviews": 1,
          "Date": "2020-03-29T19:40:43.000Z",
          "Titre": "I would give zero stars if possible",
          "Contenu": "I would give zero stars if possible. The east side Madison wi employees were rude and dismissive the entire time I was there. Basically told me they could do nothing about my order and walked away from me. Will never use them again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Claudia",
          "Nb_Reviews": 1,
          "Date": "2018-07-26T23:30:34.000Z",
          "Titre": "We ordered an item on line to pick up…",
          "Contenu": "We ordered an item on line to pick up in store. I went to go pick it up 3 days later. Traveled 3 hours round trip typical it up and I get to the store and they look for it for about 15 min and then tell me they sent it in the mail. Not happy!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-25T09:14:11.070Z",
          "Titre": "Because the pioneer double din I bought…",
          "Contenu": "Because the pioneer double din I bought from is is a piece of crap....it don't function well and there is static on the sound the when f time it's playing.."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Charneatha Bloodsoe",
          "Nb_Reviews": 1,
          "Date": "2020-06-06T14:09:54.000Z",
          "Titre": "Need to get better inventory associates…",
          "Contenu": "Need to get better inventory associates because they don’t do they job right with updated the system that something is sold out. Letting the consumer buy goods that are sold out are pathetic and a waste of time. #DoBetter."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "mechanic",
          "Nb_Reviews": 3,
          "Date": "2018-04-18T23:17:10.000Z",
          "Titre": "Gaming PC",
          "Contenu": "Gaming PC  advertised with a wireless keyboard. Arrived with no keyboard. PC was not fully operational due to a faulty cooling fan. PC had a bootleg copy of windows that could not be updated. Very disappointed. Would not buy from again"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 1,
          "Date": "2019-01-15T22:06:55.000Z",
          "Titre": "Purchased an item",
          "Contenu": "Purchased an item, went to pick it up later that evening and was told the \"online people\" had left.  The next day I checked my account and had a message that there was a mix up and the item I purchased was not available."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alex Albis",
          "Nb_Reviews": 1,
          "Date": "2019-02-14T19:35:33.000Z",
          "Titre": "I had to wait in for 32 mins in the…",
          "Contenu": "I had to wait in for 32 mins in the pawn line and there was an employee that started helping customers in line that got there after I had been in line for so long already. Maybe pay people more so they do their jobs correctly"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "You guys suck",
          "Nb_Reviews": 2,
          "Date": "2018-04-21T15:44:32.000Z",
          "Titre": "Item not as described",
          "Contenu": "Item not as described. Customer service not helpful. Recieved nasty email after leaving  negative feedback. Would not have left negative feedback had customer service been willing to help. EXTREMELY RUDE AND UNPROFESSIONAL."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sue Druan",
          "Nb_Reviews": 2,
          "Date": "2020-05-08T21:00:25.000Z",
          "Titre": "Never received item",
          "Contenu": "Never received item. Never received refund. Now have to fight paypal for refund??? DON'T order online thru pawn america!!!!!!!!I did just contact you. I was told to contact paypal regarding the refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andrea Harris",
          "Nb_Reviews": 1,
          "Date": "2019-11-30T21:55:41.000Z",
          "Titre": "Very disappointed",
          "Contenu": "Very disappointed! I called the other day about extending a loan. And the representative told me that I was able to come in next day and pay xxxx amount of dollars and it would be fine. But when I physically went into the store location to extend my loan I was told something completely different and they needed more money to extend it. Why would one person tell you something and another tell you something completely different? So I was under the impression by what the 1st person told me that my item would be fine. Well guess not and now most likely will loose my item because they would not except the one month interest payment. Ive been going to this pawn America for years, Needless to say I will never return!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Darriel Abbott",
          "Nb_Reviews": 5,
          "Date": "2021-10-24T15:23:13.000Z",
          "Titre": "I shopped in Rochester Minnesota store…",
          "Contenu": "I shopped in Rochester Minnesota store Ted was alot of help an very smart about the merchandise he makes it fun buying chainsaws thanks for your pic of a supervisor  Darriel"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rich Weaver",
          "Nb_Reviews": 1,
          "Date": "2018-04-19T00:18:52.000Z",
          "Titre": "your 10% return policy is absolutely…",
          "Contenu": "your 10% return policy is absolutely ridiculous you went from 30 days cash back to seven days cash back now I have to pay and this will likely cause me to buy very little if anything from you guys in the future"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Blake Neel",
          "Nb_Reviews": 1,
          "Date": "2018-04-18T20:14:14.000Z",
          "Titre": "I purchased a used PC from Pawn…",
          "Contenu": "I purchased a used PC from Pawn America. It was advertised as functional but no network card included. The reason it wouldn’t connect to internet was due to the fact that the windows that was installed was not an authentic version of Windows, which required me to pay for an additional $110 windows kit in order to get the PC to operate. I had to have this P.C. for work so returning the item wasn’t an option. They did offer for me to return the device, but I would have to pay for return shipping. They would not reimburse for any value of the device despite their miscommunication about the product. They only offered a return that I would have to pay shipping for, probably another $50. Overall not a great experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "US",
          "Nb_Reviews": 5,
          "Date": "2019-03-21T04:16:17.000Z",
          "Titre": "Shysters",
          "Contenu": "Shysters! They quoted me 60 to 70.00 cash for my Samsung Galaxy S7 in excellent condition.  Never told me I needed paperwork to prove the phone was paid for. Why would I even think u would need that since all pawn shops run their merchandise thru local police to see if its stolen. I wasnt worried I paid 700. For my phone. But I drove over 45 miles one way down to the closest location only to stand in line for an hour to be told sorry we cant accept your phone. The mgr wasnt even willing to give me 70.00 and have me fax over the receipt the next day on the strength of I was a former customer of the prior owner.  I ended up selling this phone on craigslist for 100.00 so it was their loss. But I wouldn't do business with liars."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Todd Thunder",
          "Nb_Reviews": 1,
          "Date": "2019-02-12T15:53:02.000Z",
          "Titre": "Found an item in the Rochester MN…and they wouldn’t sell it.",
          "Contenu": "Found an item in the Rochester MN store. When they tried to ring it up the item came up as sold. They said come back in a few days. Came back in and no one knew what I was talking about. Next day I called they said maybe tomorrow, I said I’m leaving town today ....sorry come back tomorrow, nothing I can do. I called customer service they said they would cover the shipping and just order it once I got home. Took them a week to put it online . The best part is that it went from $44 dollars to $99 . They dont show you the damage in the picture just a slight mention of a crack. What kind of a business doesn’t sell you an item when you have cash in hand? If you are looking for a good deal on used stuff , this place is not one of them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "cyruswv",
          "Nb_Reviews": 2,
          "Date": "2018-04-19T14:21:45.000Z",
          "Titre": "Terrible seller",
          "Contenu": "Terrible seller. Worst I've encountered in over 20  years as an EBay customer. Incompetent, untrustworthy, and would not honor selling price after sale. Run, don't walk away from this seller!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "George M.",
          "Nb_Reviews": 1,
          "Date": "2018-04-20T15:19:17.000Z",
          "Titre": "First purchase item did not work",
          "Contenu": "First purchase item did not work - damaged internally Second purchase - bought five items from Pawn America one week later found out three items were not available. Refund took another week and a half"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ellis Flack",
          "Nb_Reviews": 5,
          "Date": "2021-11-02T02:56:16.000Z",
          "Titre": "Item was advertised as a complete unit",
          "Contenu": "Item was advertised as a complete unit.  It was missing all of the mounting system which made it completely unusable. Shipping and customer service was outstanding."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "C Carlson",
          "Nb_Reviews": 1,
          "Date": "2020-07-24T01:54:21.000Z",
          "Titre": "Purchased a ring and was going to pick…",
          "Contenu": "Purchased a ring and was going to pick it up on my way by the store and got an email saying the ring was already sold a couple weeks prior but the website had not been updated since then."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Enrique Espinoza",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T05:24:21.000Z",
          "Titre": "Item arrived damaged..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Maria McQuesten",
          "Nb_Reviews": 2,
          "Date": "2020-05-20T16:39:38.000Z",
          "Titre": "Found a crossbow on there website for…",
          "Contenu": "Found a crossbow on there website for sale, ordered it and the next day, they couldn't find it in there warehouse, totally wasted my time and bummed me out. I saved up for weeks."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christian Sorenson",
          "Nb_Reviews": 1,
          "Date": "2018-09-25T13:31:26.000Z",
          "Titre": "I purchased a bow online and received…",
          "Contenu": "I purchased a bow online and received an email saying they sold it after I purchased it. It has taken over a week to receive my money back and I have missed out on hunting this whole time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shelby Martin",
          "Nb_Reviews": 1,
          "Date": "2020-05-22T15:11:22.000Z",
          "Titre": "Lack of attention to website",
          "Contenu": "lack of items listed really hurts your ability to sell stuff. I would buy all the time I could look up the individual store inventory daily. Very sad example of a retail website."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jim Trenkle",
          "Nb_Reviews": 1,
          "Date": "2021-04-20T00:51:54.000Z",
          "Titre": "Necklaces",
          "Contenu": "First let me say that I regularly purchase jewelry from Pawn America and this review only pertains to their necklaces and not all stores but many. It seems almost every time I purchase a necklace for my wife or daughter’s it arrives completely tangled and is unusable until either my wife or daughters spend an hour to two hours untangling their gift. They is not at all how any jewelry should arrive. I’ve made management aware but it still keeps happening. I’m only writing this in hopes that something will change as I do not like spending my hard earned money to receive a tangled mess. When purchasing a necklace I’d advise to send an email requesting it be packaged so that it arrives usable. Lastly, I do want to say I’m very happy with the other jewelry I purchase and this rating does not reflect all stores et cetera. Kindest regards, James"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Logan Vermeer",
          "Nb_Reviews": 1,
          "Date": "2018-12-25T05:13:58.000Z",
          "Titre": "Pawn America Screwed Me",
          "Contenu": "Pawn America Screwed Me! I purchased an item from them, payment went through and I got a notification that it was being shipped, a couple days later, they said the item sold elsewhere!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-03T22:45:52.000Z",
          "Titre": "Was told I would receive a 12.0 battery…",
          "Contenu": "Was told I would receive a 12.0 battery with tool"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Annette Graham",
          "Nb_Reviews": 1,
          "Date": "2022-12-03T15:18:11.000Z",
          "Titre": "horrible people skills.",
          "Contenu": "i had never ordered on line from a pawn shop. there was a gold chain that my husband wanted and it was from the shop in Robbinsdale,MN. i just had a couple questions on how to order it, make sure it wasn’t gold-plated because some say they are. i spoke to a lady her name was Cheyenne, she quickly told me she didn’t have time to help me if i saw it on line just come in and look. i told her i am in MO and she is in MN. i finally asked if she just didn’t want to help me or what. she hung up on me. thought i was being nice for the way i was treated. called back and asked if she meant to hang up on me. she said she sure did. and hung up on me again. third time i asked to speak to a supv or owner she said i could look up corp # myself and hung up on me. i waited an hour called back FINALLY someone else answered Donna. took 2 min i got my answers and i ordered a $750. chain. if my husband hadn’t wanted it i would have went elsewhere. will never order here again. guess she didn’t need my money. no thank you. it’s how you treat your customers. i would like a mens bracelet but not from here. annette graham"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hosey O'grady",
          "Nb_Reviews": 1,
          "Date": "2018-04-18T19:58:59.000Z",
          "Titre": "I've been to many Pawn America's",
          "Contenu": "I've been to many Pawn America's. No deals just used crap for way too much money. i don't even stop anymore. i go to Real Pawn shops who operate like Real pawn shops do."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stephanie Herrmann",
          "Nb_Reviews": 2,
          "Date": "2018-04-18T20:13:50.000Z",
          "Titre": "Rediculous return policy",
          "Contenu": "Rediculous return policy. The item i bought was BROKEN and when I asked for my money back to return i was only offered a switch out even though I REALLY just wanted my money back"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "holliehox9",
          "Nb_Reviews": 3,
          "Date": "2019-01-02T22:37:51.000Z",
          "Titre": "Deceptive",
          "Contenu": "Update 1-2-19 3 out of 3 clerks have lied so far in less than 1 month. This time the clerk insisted that they would not be able to sell a gold/diamond necklace and they would not get anything on resale. Basically, they will loan you $20, turn around and sell your item for $400. Anyone looking in their jewelry cabinet can see this. Give them a bad review, they ask you to contact them...it's useless. They lie on the phone too. Update: 12-30-18 Liars and cheaters. They do not send metals in to be melted down. That's a lie. They resell everything as evidenced by the ugly jewelry they have in their jewelry cabinet.  (0riginal post) They do not purchase items at fair market value and they do not sell merchandise for fair market value. What really got to me was the deception, the lying. Why is that even necessary?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andrew Smith",
          "Nb_Reviews": 2,
          "Date": "2020-01-10T06:19:57.000Z",
          "Titre": "i bought a ps4 and it didn't come with…",
          "Contenu": "i bought a ps4 and it didn't come with cords very annoying i had to take it apart my ps4 because they don't clean them its very simple but i guess they got lazy."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jevon Hart",
          "Nb_Reviews": 2,
          "Date": "2019-04-17T01:11:09.000Z",
          "Titre": "Looked at the item said I did not want…",
          "Contenu": "Looked at the item said I did not want it and they told me I had to take it and go to some website for a shipping label and send it somewhere in order to get my money back"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "align",
          "Nb_Reviews": 8,
          "Date": "2022-05-09T23:10:38.000Z",
          "Titre": "I ordered a diamond ring",
          "Contenu": "I ordered a diamond ring. 75 carat it came in the box was an offer of a lifetime jewelry warrantee for $49.99, I asked how do I pay for it and I was told it was not available on eBay orders, then the story changed and I was told it didn’t exist for over two years and the guy Kyle that apparently oversees the eBay and marketplace orders for pawn America was just rude. I had a choice either send it back or deal with it.. I felt I had a good deal it was a very nice diamond ring and I think they made boo-boo because it was a very valuable diamond ring made by Art Carved. He wanted me to send it back and then get a refund and then re-purchase it at a store over 125 miles away from me. At that point I don’t trust them to do so.. when I called to complain about it they hung up the phone and were told not to talk to me anymore. Seems weird that it didn’t exist for two years even though they included a pre-printed out card that look brand-new to me.. but at first I was told they don’t do it for eBay orders. I wish I could describe how I was treated it was just awful.."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kristina",
          "Nb_Reviews": 1,
          "Date": "2019-11-24T01:55:00.000Z",
          "Titre": "I had ordered a ps3 online and I…",
          "Contenu": "I had ordered a ps3 online and I recieved an email stating that the product I ordered was not in stock. I was to choose 2 different products at no extra charge which was nice. I recieved my ps3 and it was broken the remote was dead and it didn't play any games or DVDs. I felt they knew they gave me a pos from the start. But that was just the beginning I went to my local pawn america to return it cause a pawn america is a pawn america right even though I bought it online. So I walk in and they tell me since it didnt come from their store that they can't refund me my money. But if I want I can buy a ps3 from them, so your telling me I can't  get my money and you want me to purchase another one?? Jeez what a company. Eventually I did get my money back but I will not be back just saying. I hope this review helps someone out there, and if you are offended by said review move along."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jennifer Meuers",
          "Nb_Reviews": 1,
          "Date": "2019-07-30T17:41:12.000Z",
          "Titre": "I never got my two $20 discount emails…",
          "Contenu": "I never got my two $20 discount emails since I tried to buy two rings from u online that had already been sold in stores but was not updated on line."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David E",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T01:41:32.000Z",
          "Titre": "SLOW shipping",
          "Contenu": "One of my items arrived in great condition, though it took 5 business days despite it saying 2-4 business days at checkout. My other item that I ordered at the same time still hasn't arrived, and USPS tracking still shows it to be in Appleton, where I ordered it from. Still hoping I actually eventually receive my other item. Don't expect anything quick from Pawn America."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Consumer",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T00:52:10.000Z",
          "Titre": "Mediocre Shopping Experience….",
          "Contenu": "A lot was great from the delivery time to the checkout process. Except that I received a counterfeit pair of AirPods Max  and I emailed them asking for more photos to which they never replied. Just wish I could’ve received a real pair:/."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Shawn",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T23:20:34.000Z",
          "Titre": "Needed a rebuild and not noted",
          "Contenu": "Would have been nice to know that the ratchet head needed to be rebuilt. Kind of a important detail when buying a expensive tool."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T19:33:43.000Z",
          "Titre": "Look Closely at Photo before you buy",
          "Contenu": "I should have taken a VERY close look at the photo of the tripod head.  It was obviously broken and someone tried to fix it by putting the wrong tripod arm with a bolt on it.  It is jerky when you try to move your camera which is not what you want when you are shooting video.  I don't know if they were given the tripod head like this or tried to fix it to sell it.  Either way I was pretty depressed when I opened the box and found this out.  I looked back at the photos and saw the bolt so my fault for trusting it was in decent shape.  Had the tripod head been in decent shape then that would have been an excellent price."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T19:36:39.000Z",
          "Titre": "I show pictures with the item",
          "Contenu": "I show pictures with the item The item is not working well and ask for 50% refund and she not accetp the bussines"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Shawn",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T20:23:21.000Z",
          "Titre": "The item I purchased is a used orbital…",
          "Contenu": "The item I purchased is a used orbital sander.  It is obvious it has very little life left by the way it runs."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T12:35:25.000Z",
          "Titre": "The pictures were not accurate to what…",
          "Contenu": "The pictures were not accurate to what tge product actually looked like"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael T",
          "Nb_Reviews": 2,
          "Date": "2023-06-07T16:21:34.000Z",
          "Titre": "I ordered a lens and the description…",
          "Contenu": "I ordered a lens and the description said no scratches on the glass. This was incorrect."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-03-14T18:42:59.000Z",
          "Titre": "Transaction was cancelled it's too heavy was too…",
          "Contenu": "Transaction was cancelled item was too heavy for shipping?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-21T21:32:47.000Z",
          "Titre": "Bought a pioneer ddj 400 and it didn’t…",
          "Contenu": "Bought a pioneer ddj 400 and it didn’t come with a charging cable…"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2022-12-12T22:08:16.000Z",
          "Titre": "Customer service is awesome",
          "Contenu": "The shipping was prompt, but the speaker was busted. The sound is really distorted."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Aparky Malan",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T03:50:34.000Z",
          "Titre": "I hope their service can be improved."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-07-22T21:06:18.000Z",
          "Titre": "This is for a McDermott D23 pool cue.",
          "Contenu": "This is for a McDermott D23 pool cue.Very vague description, only 4 pictures and not a word or warning of damage.The leather wrap is about halfway off and one od the shafts has a cracked ferrule.I'm getting it repaired for around a hundred dollars, but, very untrustworthy, almost dishonest business practices... BE CAREFUL around this group..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sandra",
          "Nb_Reviews": 1,
          "Date": "2020-04-23T17:28:00.000Z",
          "Titre": "The nitendo switch",
          "Contenu": "I got my switch but when it came all the other people's info was still on it (I reset the switch) there is a glitch where it goes all the way to the left on the menu and it happens when I'm playing games and it traps me in menus and won't redrawn to me clicking any of the buttons. The only good thing was it got to my home on time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bridgette",
          "Nb_Reviews": 1,
          "Date": "2020-06-30T19:35:15.000Z",
          "Titre": "Pawn America knowingly sells BROKEN items",
          "Contenu": "I bought a pair of Joy-Cons that ended up having buttons that didn’t work at all.. So I returned them, telling the store manager they were broken, and less than 2 hours later, I noticed Pawn America relisted the same pair of Joy-Cons KNOWING they didn’t work! I know they are the same Joy-Cons because it was a mix of two colors you can’t buy, same exact listing, and it was the same store location. So now I know Pawn America (Roseville, MN) knowingly sells broken items. That’s cool..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nyiesha Hall",
          "Nb_Reviews": 1,
          "Date": "2019-11-30T14:06:18.000Z",
          "Titre": "My overall experience",
          "Contenu": "When I ordered my ring it was cheaper on line then in store. When I got to the store they still had my ring in the display box. Also I couldn’t buy the warranty online so they had to return the ring and then sale it back to me for the store price. They didn’t honor the price I paid already. I was also told I had to wait 60 days to get my ring sizes and it would cost 80 dollars without the warranty so I feel like I was forced to by a warranty."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Milw",
          "Nb_Reviews": 1,
          "Date": "2019-03-16T17:01:03.000Z",
          "Titre": "disappointing waste of time",
          "Contenu": "I purchased an item (Apple Watch that turned out to be iCloud locked, though listed as fully functioning) that was not checked by pawn America for operation.  I wasted my time finding and buying it from them, contacting for an RMA, and then shipping it back because they sold useless junk and did not act as a reputable business. At least I didn’t loose what I paid since I was able to return it, but would have been better off not going to their site."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "An unhappy customer",
          "Nb_Reviews": 2,
          "Date": "2019-01-07T05:42:04.000Z",
          "Titre": "Update your stuff",
          "Contenu": "I ordered something from the site. Got a confirmation and money was taken from my acct. The next day I got another email saying they had sold the item and that my money would be credited to my acct. Like what the hell, I ordered that had a confirmation and they sold it on the floor.... WHAT?! Irritating! Update something so you know when things are ordered online as it should be pulled off the floor shelf then!! Not happy with my experience."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 2,
          "Date": "2019-03-08T21:05:14.000Z",
          "Titre": "Description not accurate",
          "Contenu": "The item description clearly stated the tool came with the battery and charger.  Instead I received an extra battery and no charger.  I called customer support and was offered a $15 credit, which I took bc I wanted the tool.  I later realized cost of the charger was more than wrench itself."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-06-05T20:29:49.000Z",
          "Titre": "I paid for a faulty PlayStation 3…",
          "Contenu": "I paid for a faulty PlayStation 3 system that won’t even load games for me to play them. Then I also paid for 2 day shipping it took 4 days to reach my destination."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ted Lupino",
          "Nb_Reviews": 3,
          "Date": "2018-04-18T20:22:51.000Z",
          "Titre": "I am a contractor",
          "Contenu": "I am a contractor and I use to shop at your stores when ever I'm in town, I am always looking for tools and such.  I have noticed that your pricing are  getting a bit to high. When I can invest 5, 10, 15 more dollars for something new, it's not worth stopping in. I know you need to make a profit to stay in business but your buyers need to purchase the merchandise at a lower cost. If you take a little less, you will sell more merchandise and open up shelf space. The pawn shop in Rhinelander WI seems a ton of merchandise because it's priced right. Hope this helps."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-09-13T15:51:21.000Z",
          "Titre": "Sent no shipping info until I had to…",
          "Contenu": "Sent no shipping info until I had to personally reach out. Once I received my package the cábles from the ps4 were missing. Contacted them and they shipped them but one of the cables wasn’t working."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brooke Smith",
          "Nb_Reviews": 2,
          "Date": "2020-09-30T22:23:21.000Z",
          "Titre": "No markings on the piece of jewelry I purchased.",
          "Contenu": "I love buying jewelry here but, I don’t like when I get a piece and there are no stamps to prove it’s gold or what it’s advertised. Now I have two choices and I don’t like either of them. I can take it to a jeweler who will probably charge me to test it or I can send it back. I sent an email to them basically asking if they had anything they could give me guaranteeing it is 14k but was told they don’t have anything but their word. It would be nice if they put in their description there are no markings. If you intend to purchase a piece of jewelry here make sure there’s a marking or email before buying to ask. No one wants to spend time going to a jeweler especially right now."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ray Benefield",
          "Nb_Reviews": 2,
          "Date": "2018-04-19T09:49:49.000Z",
          "Titre": "Pawn America doesn't allow you to bid…",
          "Contenu": "Pawn America doesn't allow you to bid on their items due to a set price. Their shipping cost is also way too expensive. I  purchased one item from them and probably will not purchase from them again due to the reasons I mentioned above."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "DJ",
          "Nb_Reviews": 2,
          "Date": "2018-04-18T20:25:00.000Z",
          "Titre": "The price was right. Product was not functioning at 100%",
          "Contenu": "The price was right.The product was not functioning at 100%My options were pay to mail it back, or repair it myself.Guess who knows how to replace speakers now?Hint - not Pawn America.So glad they asked for this feedback."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Maynard Jones",
          "Nb_Reviews": 1,
          "Date": "2020-08-05T23:44:51.000Z",
          "Titre": "Before Changing to the new web page…Things were okay.",
          "Contenu": "Before Changing to the new web page things were really good, but since then:Pawn America did not email me telling me that I needed a new password because they changed the parameters when they changed the web site. So I changed my password and I got to my account which stated that I had bought a computer in May 2020 which I had tried to buy but it had been sold. I bought a Computer Aug 2020 but it wasn't in my account. They shipped it without telling me and without a password to get into windows 10. I bought a Milwaukee M18 12 ah battery that showed up today after disappearing from account.  I bought an Milwaukee  m12 6ah battery but somehow disappeared from the shelf when they got to processing my order."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chris Miller",
          "Nb_Reviews": 1,
          "Date": "2023-01-01T21:25:53.000Z",
          "Titre": "It looks to be very worn",
          "Contenu": "It looks to be very worn, hopefully it will work."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ken Wright",
          "Nb_Reviews": 1,
          "Date": "2019-02-18T13:26:57.000Z",
          "Titre": "Poor advertising and poor customer service",
          "Contenu": "I ordered something using the Valentine's Day discount.  I tried later to use it again and it was rejected.  Nothing on the website said one to a customer.  I contacted customer service and they NEVER responded."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kevin Skogen",
          "Nb_Reviews": 1,
          "Date": "2018-11-27T00:52:21.000Z",
          "Titre": "Got labtob  at first no battery and…",
          "Contenu": "Got labtob  at first no battery and missing cord called and talked to someone they told me battery and cord was being sent out  now I have cord and still missing battery it's pissing me off"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Cassandra Carr",
          "Nb_Reviews": 1,
          "Date": "2018-04-19T01:06:13.000Z",
          "Titre": "The product I ordered was not the…",
          "Contenu": "The product I ordered was not the product I received.  The listing was for a Sprint tablet. I received a att tablet. Only reason I'm giving this two stars. Is that the return was hastle free."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-09-05T21:42:18.000Z",
          "Titre": "The ring I ordered was really nice…",
          "Contenu": "The ring I ordered was really nice besides the fact that it looks like it has never been cleaned."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-01T21:57:50.000Z",
          "Titre": "Never said one of the 2 rca inputs were…",
          "Contenu": "Never said one of the 2 rca inputs were cut off"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mimi",
          "Nb_Reviews": 1,
          "Date": "2021-11-07T08:03:57.000Z",
          "Titre": "Do you research before purchasing electronics",
          "Contenu": "I didn't do my research on the laptop I purchased and it's pretty much worthless. I bought a really expensive paperweight. 🙁"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Reese",
          "Nb_Reviews": 1,
          "Date": "2019-10-04T22:22:08.000Z",
          "Titre": "Product condition was not as shown",
          "Contenu": "I saw a backpack leaf blower advertised online. It said average wear (which I had no problem with). I looked closely at the pictures and saw nothing alarming (apparently they had used stock photos). So I purchased it. When I went to pick it up, I was stunned. There was electrical tape wrapped around the flex joint. The stuffing was falling out of the shoulder straps and back support. There were still leaves hanging off it. Took it outside to see how it ran. After 6 pulls it finally started but the starter rope recoil failed to wind the rope back up. I refused the product. When I asked about my refund I was told (very politely) that was done through a different store. \"They might not answer the phone though because they are moving\" I did however find the credit had been applied to my card inside of 5 days so that was the bright spot of this transaction."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Carletha Wheeler",
          "Nb_Reviews": 1,
          "Date": "2020-03-29T14:34:06.000Z",
          "Titre": "I knew I was getting a game from a…",
          "Contenu": "I knew I was getting a game from a pawnshop someone could have wrote in the description how bad it was and to let me know that the game was really messed up"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ethan",
          "Nb_Reviews": 1,
          "Date": "2018-11-30T16:00:55.000Z",
          "Titre": "Gave me the wrong charging cord",
          "Contenu": "Gave me the wrong charging cord. Said that the Nintendo was in really good shape like someone had taken care of it but it had a crack down the screen."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer Roosevelt Williams",
          "Nb_Reviews": 1,
          "Date": "2022-10-19T21:31:20.000Z",
          "Titre": "Just left the gift in my mailbox which…",
          "Contenu": "Just left the gift in my mailbox which is open"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Samantha Hrdlicka",
          "Nb_Reviews": 1,
          "Date": "2018-12-02T22:04:20.000Z",
          "Titre": "I bought a wedding ring set and there…",
          "Contenu": "I bought a wedding ring set and there was a diamond misisng. That wasnt in the description. Disappointed to say the least."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Et",
          "Nb_Reviews": 1,
          "Date": "2019-02-27T02:48:35.000Z",
          "Titre": "Description said in good working order…",
          "Contenu": "Description said in good working order was not in working order had broken chassis support broken steering components."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dara Gibson",
          "Nb_Reviews": 1,
          "Date": "2018-12-25T17:04:46.000Z",
          "Titre": "My beats headphones I ordered did not…",
          "Contenu": "My beats headphones I ordered did not come with the cord. It clearly stated in the description the cord was included."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Holly Huynh",
          "Nb_Reviews": 2,
          "Date": "2019-01-15T13:09:24.000Z",
          "Titre": "I bought a camera from them and they…",
          "Contenu": "I bought a camera from them and they didn’t even have it in stock. They sent me a worse quality camera instead."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kendra",
          "Nb_Reviews": 1,
          "Date": "2021-04-06T23:47:58.000Z",
          "Titre": "Wrong name of product online",
          "Contenu": "I bought a surface pro online, it was supposed to be a surface pro 6 but when I got it I realized it was a surface 5. I also called the store to double check about the product asking if there was any cosmetic or internal issue, I was told it looks pretty much brand new and nothing is wrong with it. So I bought it and I will admit there shipping was great, I got it the next day. After using it and setting it up I went to download an app for taking notes for school. That’s when I realized there was no windows App Store on the computer. And even when going to the online website I could t download anything. So I went to the Microsoft website and a tech person took over the computer and messed around for over an hour before telling me they don’t know what’s wrong. They said if I factory reset it, it may work. I did that and it still didn’t work. So it wasn’t a great experience. The only reason I’m not giving it 0-1 stars is because the employees were very respectful and helpful, and the shipping was fast, and because I understand they aren’t really able to test everything when accepting a used laptop. But I was still very disappointed with it having the wrong product listed and things not working great."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "iamsimve",
          "Nb_Reviews": 2,
          "Date": "2019-02-16T05:08:50.000Z",
          "Titre": "Shipping contractor needs improvement. Product purchased not delivered on schedule.",
          "Contenu": "This review arrived ahead of the product I purchased from Pawn America. Am still waiting..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Debbie Petersen",
          "Nb_Reviews": 4,
          "Date": "2019-08-06T23:35:27.000Z",
          "Titre": "Well I again purchased a ring online…",
          "Contenu": "Well I again purchased a ring online and just like before sent it straight BACK.  Are the stores so lazy or stupid that they cannot even clean a ring before they send it out, there was so much tag goop on the ring and crude build up in the ring I am amazed it looked so good in the photos.  Sure I could just went to the store down the road and ask darling Susan if she would clean it up for me , but isn't that what the sending store (Rochester) should have done before even thinking about putting in the box, do they need the sales or the commission that bad they cannot take a few minutes to clean a small piece of jewelry up.  The condition of the ring was fair, although one of the bagette sapphires had been replaced with a stone that did not match, shabby work. I know it is used but the inside edges were pretty pitted out, so lots of wear , not just gently worn.  Good thing I did not use that big $20 coupon on this purchase or I would really be out🙃 So now the question, there another ring online I like , do I drive 50 miles across the city to save myself a headache or take a chance.......I hate headaches.  Don't be in such a hurry to get that sale out the door, look at the product, it that what you want to get in the for your hard earned money🥵😈😓💩"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Roger Diruscio",
          "Nb_Reviews": 1,
          "Date": "2018-04-18T23:14:46.000Z",
          "Titre": "saw does not run as advertised",
          "Contenu": "saw does not run as advertised. I will have to buy a new carburetor to make it work"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "eBay Buyer",
          "Nb_Reviews": 1,
          "Date": "2018-04-18T20:00:39.000Z",
          "Titre": "Poor Customer Service",
          "Contenu": "Poor customer service. We received a defective item & were blamed by the rep."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mike Kreamer",
          "Nb_Reviews": 1,
          "Date": "2022-08-10T05:17:18.000Z",
          "Titre": "I purchased a Oculus Quest 2 that was…",
          "Contenu": "I purchased a Oculus Quest 2 that was advertised as a 256 GB hard drive. About 17 days after I received it I went into my settings to see how much memory I had left after downloading all the games I wanted in uploading my accounts to it only to find out that I in fact did not buy a 256 GB hard drive I actually bought a 128 GB hard drive and of course it was after my 15-day return time unfortunately so a long story short I bought a used Oculus Quest 228 GB which retails for about $250 to $300 for $250 not the Oculus quest to with a 256 GB hard drive that retails for $350 to $400 for $250. I unfortunately feel like I was ripped off and Powerless to do anything about an item I purchased that was falsely advertised prior to buying the Oculus I did not know how to check the amount of memory that the unit had and honestly I didn't think that I needed to because after reading reviews for Pawn America I was confident that I would receive the item that was advertised and unfortunately when I did discover that I had not received the item that was advertised it was passed my 15-day return time period so if anyone else purchases an Oculus or any other item that has a advertised amount of memory you can check to make sure by going in to the settings and going to the storage and there it will tell you how much memory you have used out of the amount of memory you have. Hopefully this will help someone else from the disappointment I experienced. I don't think that I will be doing any more business with Pawn America at least through the website if I do it will be in one of their locations that I can physically go to so I can see and inspect the item that I will purchase to eliminate having to hope that I receive the item that I have thought to have purchased. But on a positive note I did receive the item in a decent amount of time it was packaged great and the item worked great as well unfortunately I only have half the amount of memory I was supposed to have on it and there is no way to add memory to the unit nor can I buy an external hard drive to help with that problem."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "K.Denise",
          "Nb_Reviews": 1,
          "Date": "2019-11-17T23:10:06.000Z",
          "Titre": "Great shipping service...But products not so much",
          "Contenu": "To begin Pawnamerica is very quick as far as making a purchase and then my item shipped the same exact day, so that I will day was very good. BUT, the product I bought... not so much. I did know buying a “Used MacBook” from a pawn shop was kind of iffy to begin with, but I said hey let me give it a shot cause I’ve seen some decent reviews and I only needed the computer for basic functions. To start the computer was the same exact one in the pictures and the description read it was in “Good Working Condition” , not so much.  When I turned on the computer it came on fine but when I started to use it , it kept shutting and restarting when I would click on different apps. I looked up troubleshooting and decided to just bring it to a Apple store because they’d know more than me. Well.... to begin Apple store technician let me know the battery on it would need replacing and that it also needs another new part that would cost about $500 and that was “If they could even send it because the style MacBook was on the older side to where it may be obsolete”. The technician plugged in my computer and ran some diagnostics and found out that the computer was actually obsolete and the product numbers didn’t match. So long story short the previous owner replaced the bottom of the MacBook with a newer cover in order to sell it that shows a different product number (than what the actual computer was saying because the original bottom showed the obsolete product number and it won’t sell). I’m not sure if the store was aware of this before listing it but hopefully no one runs into this problem. I will now be buying a newer MacBook from the Apple Store."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Christina Magee",
          "Nb_Reviews": 1,
          "Date": "2019-12-22T04:55:00.000Z",
          "Titre": "My Nintendo switch Didn't.come with the…",
          "Contenu": "My Nintendo switch Didn't.come with the ac adapter"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Karen Hopkins",
          "Nb_Reviews": 2,
          "Date": "2019-10-25T11:25:55.000Z",
          "Titre": "I wasn’t happy about the product so I…",
          "Contenu": "I wasn’t happy about the product so I sent it back."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Heidi Holden",
          "Nb_Reviews": 2,
          "Date": "2018-10-05T20:46:51.000Z",
          "Titre": "My order was cancelled due to lack of…",
          "Contenu": "My order was cancelled due to lack of availability."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jason Wigle",
          "Nb_Reviews": 1,
          "Date": "2020-04-03T00:18:20.000Z",
          "Titre": "The web description lied",
          "Contenu": "I saw a power washer on the website.  I tried to use the phone link to ask a couple of questions,  but after listening to their Covid response messages (five minutes) I pressed 1 and got \"I didn't understand \" and the message started over.  After three times listening to this I went to the store myself.  No place on the website  does it say the retail sides are closed, nor on the message i got to listen to thee times.   Ok.. I fully understand that these are strange times and unusual situations, nobody had plans for this.  The man at the pawn counter did his best to answer my questions but  informed me I could not pay at the store, it had to be online.  Seemed strange to me but new laws mean new issues.  He gave me a more direct number to the online sales person.  This rep also thought that the store could take payment. He called the manager and the purchase had to be made on the website.   Fine.  I pulled up the site on my phone and made the purchase while standing in the store.  At this point a person I assume is the manager comes out of the back to rather rudely inform me that the purchase must be made online.  I said, \"I understand.  I have just made the purchase. The sales rep said that if you called him he could confirm the payment so I won't have to wait an hour for the normal conformation to come through.  Would you be willing to do that?\"  She said, \"Well who did you talk to?!\"   I replied, \"Sorry, I didn't catch their name.  It is the person you just spoke to about this. \"   She came back with, \"well I spoke with two people!\"  I gave a shrug as I couldn't really help with that.  She walked back into the back area, and after 10 minutes or so returned. \"This is the only time I will do this! From now on you will have to wait the hour to get the item!\"  She gets the pressure washer on a hand truck,  wheels it out to the public area sets it down and says \"here you go.\" So I get to handle the dolly with my bare hands, she had gloves.  That virus message I got to listen to really came back.  I thought she would at least get it to the parking lot.  Ok then... so I load up and head home.  Now for a list of why I wrote this. 1. No information on the retail side being closed.  Online only so no way to check the items before purchasing.  (With all the Corona virus stuff, I give this a soft pass.)2. Phone system messed up.  Come on this can be checked.3. To make a purchase you have to create an account with no way to opt out of receiving offers. What happened to I give money you give thing.4. I give you money and then I have to wait an hour to receive my purchase?  What is the point of a conformation code?5. Attitude of the boss.  Look, I know that this is a messy situation.  I did my best to be understanding, you have to follow the rules.  But I did what was asked and didn't deserve this kind of service.  I have never had this much lip while trying go give someone money.6. The web ad lies.  In the description it was listed as coming with a power broom and soap blaster. It didn't.   This is what I had questions about.  In all the confusion I didn't check.  This is why I wanted to see it before purchase.  Oh well. Lesson learned.  Dont trust the pawn america website. Two stars for the counter person and the phone rep.  They did ther best, and I am grateful for their customer service skills."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T03:55:45.000Z",
          "Titre": "Shipping was quite good",
          "Contenu": "Shipping was quite good. But the electronic items in package was not  protected with bubble wrap or anything. And the careless delivery man threw the package on floor at my front door heavily causing some dents on speakers."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Aaron Layton",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T04:39:41.000Z",
          "Titre": "Box was described unopened",
          "Contenu": "Box was described unopened, the box was indeed opened with signs of partially being installed.  The wires were pinched and severed but I repaired it with soldering and heat shrink. overall because it was working when I was finished a saved a great deal from a new one I can't complain too much. The item was a smart lock. For other people this could have been disappointing. I am happy with my purchase but would advise to open boxes claiming to not be opened to ensure it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "threebikers",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T08:03:03.000Z",
          "Titre": "Could have been great, but wasn't",
          "Contenu": "Expensive milwaukee ratchet was lost in the vast usps network because of questionable packing methods. It went through the end of the small box it was in & I received an empty box. 1 star for that.  Quick, no hassle refund.  5 stars for that. Generous average of three stars, but I would much rather have the wrench..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "RA",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T16:53:12.000Z",
          "Titre": "Item did work properly",
          "Contenu": "The item did arrive in a timely manner.. shipping and packaging was great ..  however, I was disappointed when the battery for my 3/8 impact would not charge .. item came with a defective battery .. this tells me item wasn't tested properly.. I reached out to Pawn America and got no response... 😒"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ruben Longoria",
          "Nb_Reviews": 1,
          "Date": "2022-12-24T20:40:02.000Z",
          "Titre": "Everything is great so far just took a…",
          "Contenu": "Everything is great so far just took a while to ship it out.  It hasn’t gotten to me to even test it out for operation and to see if everything works.  I understand weather delays and holidays just took a while to process the start of shipping. Maybe use a different shipping method other than FedEx"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T08:20:04.000Z",
          "Titre": "Shipping address mistake!",
          "Contenu": "I would love to give 5 stars, but a small mistake on not copying the correct address down for shipping almost cost my wife and I a great deal of time and money that we don't have. We got very lucky that the post office got it on a weekend and couldn't send it back the next day. I scheduled a package hold at the Anderson P.O. and grabbed it Monday morning. Crisis was averted and got back on the road! Thank you for the quick shipping and outstanding tool! The price was phenomenal!Thank you again!C&C Phillips"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-18T15:49:00.000Z",
          "Titre": "Slow to Ship",
          "Contenu": "My only complaint is regarding delivery. During checkout on Friday, the estimated delivery day showed Monday, which was great for my needs so I made the purchase. In reality, the item did not ship until late Monday. I did not receive it until Friday -a 8 days after my original purchase date."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Craig Vacura",
          "Nb_Reviews": 6,
          "Date": "2023-05-04T21:57:11.000Z",
          "Titre": "Sloppy packaging. Missing parts.",
          "Contenu": "Camera and misc accessories were thrown into the original ripped up box. It was missing the manual, cables, and lens cap. I had no means of charging the battery or testing the camera.The good - fair price. Fast delivery."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Owen J Cole",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T21:06:54.000Z",
          "Titre": "Definitely could have been better, but a fine first experience.",
          "Contenu": "Everything worked as described aside from the controller I received alongside the console. The joystick was very loose and it would not connect until I got a specific usb cable for the controller."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chancelur Fudge",
          "Nb_Reviews": 2,
          "Date": "2023-06-04T09:15:22.000Z",
          "Titre": "I ordered online",
          "Contenu": "I ordered online and called to confirm my item was in stock that being said. There is a was price tag of what I paid and a ripped off price tag that was definitely a cheaper price I was never offered the cheaper price over the phone before purchase. But shipping was fast my item was in good condition and works great. Just wish I could have got the updated price since I called first 😕"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alex",
          "Nb_Reviews": 2,
          "Date": "2023-08-14T17:08:30.000Z",
          "Titre": "Pawn America needs to fix their website...",
          "Contenu": "The website is not very useful and I had issues creating an account and placing an order.  I reached out to Pawn America but they did not care to respond.  If I had a better option than them on this order....I would have chose it....but the price was too good to pass.  They had really fast shipping."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 1,
          "Date": "2022-12-25T19:12:33.000Z",
          "Titre": "Product not as advertised.",
          "Contenu": "Delivery of the product was prompt. I bought a bowtech carbon rose for my wife.  The site said it was a right-hand bow, but it was a left-handed bow. Overall, the bow and case are in good shape."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2023-01-10T05:27:19.000Z",
          "Titre": "Seller failed to identify missing brake…",
          "Contenu": "Seller failed to identify missing brake band and broken chain tensioner in their description of the saw. Anyone handling the saw would have known these problems were present.  Saw runs ok.  I will fix the broken parts."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tammy",
          "Nb_Reviews": 2,
          "Date": "2023-07-12T21:19:35.000Z",
          "Titre": "Not the best experience but not the worst!",
          "Contenu": "What I ordered was a present for my son's 17th birthday. He had been wanting this one particular thing for his computer for months but it was very expensive brand new. I found the exact model of what he wanted at Pawn America and it came with the extra component that would have cost an extra $60 to buy.  The whole bundle was very affordable and we were so excited to be able to buy it for his birthday. When it came out was in wonderful condition but it did not include the power cable to actual be able to plug it in to power it on. So my son couldn't play with the birthday present he had been excited for months about.  I was very upset and I called the actual pawn shop it came from and the young lady that answered and addressed my issue was so sweet, there was no way I could of took my frustrations out on her. She explained that they did not have the size power cord needed for my sons gift but that she would explain the entire situation to the district manager and have him call me the next day to discuss what could be done. While I waited for the manager to call, we found a power cord from a printer that worked temporarily and my sister ordered the needed replacement cord from Amazon. So all in all everything turned out OK. I could have showed my butt about the issue with the district manager but I didn't want the young lady from the pawn shop to even remotely get in trouble because of how very kind she was. I would order from Pawn America in the future I'll just be more careful and call to make sure everything needed will be shipped."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Not important customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-09T17:30:13.000Z",
          "Titre": "I’m going to send it back because I was…",
          "Contenu": "I’m going to send it back because I was looking and sure I ordered I totally different drill how I didn’t notice that the invoice said something else I don’t know."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T04:14:23.000Z",
          "Titre": "the nail gun  doesnt work properly",
          "Contenu": "the nail gun  doesnt work properly. it breaks the rack of nails and doesnt shoot them"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alejandro Rengel",
          "Nb_Reviews": 2,
          "Date": "2022-11-24T20:12:15.000Z",
          "Titre": "Good Price...Decent Service",
          "Contenu": "Computer screen came with the price sticker residue still on the screen. Seems like the employee were not able to remove the sticker efficiently."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T20:16:39.000Z",
          "Titre": "Mediocre Online Deliveries W/O Fast Shipping Option",
          "Contenu": "It was pretty average, I ordered online and their shipping address line wouldn't let me input my apartment number, I rolled with it anyways, and despite the estimated delivery date being 2 days after I ordered (free USPS delivery), I got it a week later, all the while worrying I wouldn't get my package anytime soon since I couldn't put my apt number in. I managed to get ahold of my regular mailwoman to make sure I got the package."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customercharles",
          "Nb_Reviews": 1,
          "Date": "2023-01-15T10:01:09.000Z",
          "Titre": "Diamond was smaller than they said. And very low quality",
          "Contenu": "Necklace was greatl but priced to high. Diamond  ring smaller  than what they said poor quality and bad color."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bugger",
          "Nb_Reviews": 1,
          "Date": "2023-02-22T17:28:59.000Z",
          "Titre": "Drill online purchases",
          "Contenu": "Received my dewalt driver and is working as it should ok, after I had a issue also in finding out the status of my purchase, I feel pawn reps could do a better job of communication out to online customers!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Grant",
          "Nb_Reviews": 1,
          "Date": "2023-05-13T17:29:58.000Z",
          "Titre": "The product I received didn't work",
          "Contenu": "The product I received didn't work, but they did give me free return shipping."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-26T18:33:51.000Z",
          "Titre": "The product itself was great",
          "Contenu": "The product itself was great. But the packaging was horrible. It's amazing that the guitar arrived in 1 piece."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-07T22:03:45.000Z",
          "Titre": "Missing piece",
          "Contenu": "The product I ordered didn’t come with what was in the photos. Customer service was very helpful and fast to help fix the problem and see if the item left behind could be shipped out to me. Unfortunately they couldn’t find the part so I returned the item. Very good customer service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-10-26T01:19:21.000Z",
          "Titre": "Bow was true but one thing was wrong…",
          "Contenu": "Bow was true but one thing was wrong the arrow holder was glued with jb weld it was a $20 part that could had been replaced before sending out to a customer i bougjt new part online item should had been more closely inspected before sending out ...."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jav",
          "Nb_Reviews": 2,
          "Date": "2023-09-06T21:44:50.000Z",
          "Titre": "Welder arrived in decent good shape!",
          "Contenu": "Product looked a little more used in person but ok I guess"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T01:34:57.000Z",
          "Titre": "The product was kind of flimsy"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-11-18T19:37:19.000Z",
          "Titre": "Mixed feelings",
          "Contenu": "Happy that I got a Xbox Series X. Just pretty tacky that price was up there with the scalpers. On cash out I paid $53 extra for overnight shipping and it finally arrived after 4 days. Website stated it would be here in 1. Instead of stuffing the box with something useful to prevent damage during shipping, the used a few sheets on construction paper? Overall it was easy to make the purchase and it's working."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Takia l",
          "Nb_Reviews": 1,
          "Date": "2023-01-01T00:29:31.000Z",
          "Titre": "I received a broken..",
          "Contenu": "I received a broken... Power Cord for the Xbox.. I ordered"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-07-23T17:31:40.000Z",
          "Titre": "The delivery time was good however the…",
          "Contenu": "The delivery time was good however the product that I received did not work. I’m attempting a manufacturer warranty but not sure it’ll be acceptable because of where it was purchased."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Benjamen schold",
          "Nb_Reviews": 4,
          "Date": "2021-04-04T06:29:41.000Z",
          "Titre": "Used switch",
          "Contenu": "Hello I ordered a Nintendo switch for 199.99 which would have been an amazing deal but there was no docking system so I had to pay 100$ for that which would put it right around the same price as buying brand new. Also there is a minor scratch on the controllers. It took my order 3 days to be ready for in store pickup as well. For whatever reason."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Wilfredo Morales",
          "Nb_Reviews": 7,
          "Date": "2020-02-14T21:44:26.000Z",
          "Titre": "Weight of item 2 g under actually weight",
          "Contenu": "I received an item that was more than 2 g off the actual weight and I think this is the last time I’ll be doing business with them2-14-2020 Pawn America offered me a full refund upon return of the item but I couldn’t return because it was a gift for my daughter and my daughters happiness means more to me then $$$$"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 2,
          "Date": "2019-07-01T16:26:19.000Z",
          "Titre": "electric guitar",
          "Contenu": "Purchased small electric guitar for grandson.  Was described as having minor scratches and cosmetic damage from playing.  Received guitar and it was obvious guitar had been dropped on a hard surface.  One corner was banged up and paint missing from 2 inch long area.  This was not shown in the pictures.  It did arrive quickly though."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "W.C.",
          "Nb_Reviews": 1,
          "Date": "2018-04-18T20:13:09.000Z",
          "Titre": "Purchase went ok and they delivered as…",
          "Contenu": "Purchase went ok and they delivered as promised. After the fact though I found that the lens was not as described. The listing said it was free of haze and fungus but had some dust. Turns out it had dust, haze and fungus. Fortunately I was able to service the lens to clean it up. I give them the benefit of the doubt since they are not camera lens specialists and would still do business with them again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-02-01T13:12:40.000Z",
          "Titre": "Item received different than what was ordered",
          "Contenu": "I had purchased a trolling motor online. The description indicated the box was opened, inspected, and resealed. This would lead me to believe that the motor that was being advertised was the motor that was in the box. When I received the box I was disappointed to learn that not only was it a different model trolling motor but it was last a different size. There was no issue with returning it other than the actual process of getting the box ready for shipping. Customer service was pleasant and didn't make me jump through many hoops to get it shipped back."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dominique Warren",
          "Nb_Reviews": 1,
          "Date": "2018-12-14T15:27:43.000Z",
          "Titre": "Disappointing at it's Finest",
          "Contenu": "Naturally when you buy from a pawn shop you are buying as is. Here is my issue though. I bought a nintendo switch that came with a dock, and not only was the dock broken but nowhere in the listing did it say that the dock did not work. If it would have stated that i wouldn't have bought it bc i could've bought it $30 more at gamestop with not only a working dock but a joycon controller too. I am very disappointed and will not be shopping there again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anthony H.",
          "Nb_Reviews": 2,
          "Date": "2018-07-26T17:29:32.000Z",
          "Titre": "Was good, now not so much...",
          "Contenu": "Until about 6 months ago I purchased frequently from PA but they changed their pricing for musical instruments and now charge as much as the chain instrument retailers so why buy from a pawn shop? Also, the web site never works right. Most of the time there is some malfunction preventing online shopping which as a remote customer is the only way I have to access their stock. All in all it was good while it lasted but now it's over. Too bad."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nicole Houle",
          "Nb_Reviews": 1,
          "Date": "2021-01-05T18:46:47.000Z",
          "Titre": "Playstation VR",
          "Contenu": "I went to purchase a playstation VR set up. They are pretty good about testing product and cleaning stuff. So me thinking I dont need to check it out it will be fine. I dont really know about the product so did know what to look for. I got home and the power cord is missing and when we tried the the head set it smelled like smoke very bad. I live about hour and half away from the store. I dont make it over there that often. They said they can give me a cord but I am really not sure when I can get back up there. I really wish they took more care in checking stuff."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Aaron Lewandowski",
          "Nb_Reviews": 1,
          "Date": "2018-09-12T00:12:10.000Z",
          "Titre": "It was missing he detail hose and…",
          "Contenu": "It was missing he detail hose and marked at 49.99 on the machine. The machine was not cleaned before it was sent out and as an eBay seller myself it would have been nice to see those things noted. If you’re going to charge me 30 more dollars then you are in store to buy it online, the least you can do is to clean the dang thing up."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 4,
          "Date": "2019-03-09T00:48:20.000Z",
          "Titre": "Very good, little bad",
          "Contenu": "I purchased this ps4 from pawn America online and I received it with a faulty hdmi cord. I found this out when we arrived at our vacation hotel which is four hours away from our house. Luckily the hotel had one we could use. That's the reason I am giving this experience a 3/5. The ps4 is great and works great."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Wes Doyle",
          "Nb_Reviews": 1,
          "Date": "2018-04-18T22:40:50.000Z",
          "Titre": "bought something on ebay from pawn…",
          "Contenu": "bought something on ebay from pawn america. Paid for it, then waited a week before I got an email from pawn america. They couldnt find the item I purchased. Then they just want to refund my money. Maybe they didnt want to sell it for the price I paid. Anyway, took the refund as they didnt want to deal with me on another item."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michele Kennedy",
          "Nb_Reviews": 2,
          "Date": "2019-08-03T05:00:24.000Z",
          "Titre": "Received my PC quickly",
          "Contenu": "Received my PC quickly, but the corner of the frame was cracked in 2 places.  This did not affect the way it operated, but a piece of tape is now holding it together.  If NOT cracked, would have been 4 stars.  If it had been cleaned off & reset, it would have been 5 stars."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-03-22T19:07:32.000Z",
          "Titre": "I only got 1 controller and 2 was…",
          "Contenu": "I only got 1 controller and 2 was advertised but the one controller I did get works and everything seems intact on the console itself  I use it a lot to pass time. I would recommend for certain things but not everything."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Justin",
          "Nb_Reviews": 4,
          "Date": "2019-03-21T19:54:24.000Z",
          "Titre": "Bad experience made better after apology",
          "Contenu": "My initial review was 1 star due to some problems with online pricing vs in store, and then the manager did not want to honor that price.  I did receive an email from a customer service agent and a phone call from someone who I am assuming to be of some kind of importance in the company, I did not ask him specifically his title.  He apologized for my experience and they made things right by offering me the original item free of charge, which quite honestly is very surprising.  The only reason why I can't give more stars was because my original experience was so poorly handled that it really kind of upset me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Richard Bullock",
          "Nb_Reviews": 1,
          "Date": "2018-08-01T16:40:47.000Z",
          "Titre": "Purchased a laptop from the Roseville…",
          "Contenu": "Purchased a laptop from the Roseville Store and I went to return it,  no one in the store had knowledge at that time to return a item purchased on the internet,  sales woman said to return next day or call for Manager (1st Drive to and from Roseville store approximately 40 miles) Next day I called, Manager gave me another number to call, I then called that number, the response was to bring it back to the store to get a refund, returned to store, the total miles driven were 80, The point is, this could have been done all on the first day, a simple phone call by the sales person would have save me time, and money and the frustration."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anthony Pegues",
          "Nb_Reviews": 2,
          "Date": "2018-04-19T12:17:31.000Z",
          "Titre": "The inside slide had a small dent in…",
          "Contenu": "The inside slide had a small dent in it. That causes the slide not to move down. The spit valve needed a new cork on it. If the cork is damage the horn want give a sound. I got it repaired. I had to spend on top of what i paid for it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Wes",
          "Nb_Reviews": 1,
          "Date": "2019-08-21T22:39:51.000Z",
          "Titre": "wrong item pictured",
          "Contenu": "i got a good deal but the item i got was not the exact item pictured. bought a used black leatherman and they sent me a stainless one. happy with the deal but it raises questions in my mind why they had a wrong item pictured."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DAVID RANDOLPH",
          "Nb_Reviews": 1,
          "Date": "2020-04-10T18:06:52.000Z",
          "Titre": "return process was great but......",
          "Contenu": "return process was great , the duluth store that packed my online order did a poor job and probably broke the nintendo wii in the delivery process by using a box that was too big for the item. thanks"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 1,
          "Date": "2019-08-08T20:56:30.000Z",
          "Titre": "Review",
          "Contenu": "Review, how many emails does a company need to send to get a customer to leave a good review?  Ask too many times, they will give a review that you may not like.  Stop spamming for reviews or be blocked."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-18T23:24:31.000Z",
          "Titre": "I received the tool rather quick",
          "Contenu": "I received the tool rather quick. It looks as described but doesn't work properly under a load it runs fine when it's not being used to cut."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jake",
          "Nb_Reviews": 1,
          "Date": "2022-05-07T19:22:11.000Z",
          "Titre": "Room for improvement",
          "Contenu": "Boxes were way to big and no need for peanuts. I also did not receive my invoice with either order. The items were in the described conditions."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MICHELLE VALTIERRA",
          "Nb_Reviews": 1,
          "Date": "2020-07-14T22:15:09.000Z",
          "Titre": "Not very happy",
          "Contenu": "The cord for my laptop was chewed up in one section and then the section where the laptop plugs in is damaged. All things they failed to mention in their description of the item I was buying."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "George Kaye",
          "Nb_Reviews": 7,
          "Date": "2022-10-06T22:02:21.000Z",
          "Titre": "Good products and prices",
          "Contenu": "Good products and prices. BUT don’t allow a shipping service to pick up item."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Vlad",
          "Nb_Reviews": 2,
          "Date": "2018-10-28T21:46:42.000Z",
          "Titre": "Wrong description that did not match the picture!",
          "Contenu": "Wrong description that did not match the picture.I ordered per description and called to verify and was told the picture (bad one) is the item.Asked to refund. Waste of time. Time is money!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marion Pearson",
          "Nb_Reviews": 2,
          "Date": "2018-10-29T20:36:24.000Z",
          "Titre": "I recieved the flashlight quickly and…",
          "Contenu": "I recieved the flashlight quickly and it appears to work properly.  Was under the impression it was a new product but has sighs of wear and not packaged. But still satisfied... thanks"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Heidi Holm",
          "Nb_Reviews": 1,
          "Date": "2019-11-21T15:33:05.000Z",
          "Titre": "Be easier if you could pay to hold…",
          "Contenu": "Be easier if you could pay to hold since online failed twice prior in purchasing. I did figure it out, but it took a number of calls and the store reps disconnected twice."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "L.O",
          "Nb_Reviews": 2,
          "Date": "2021-12-19T23:25:45.000Z",
          "Titre": "Need apprised",
          "Contenu": "I only gave 3 stars until I can get ring apprised Beautiful ring just want to be sure I did not pay more than I should have for it.Thank you."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2020-04-19T15:34:37.000Z",
          "Titre": "It would be nice to post actual…",
          "Contenu": "It would be nice to post actual pictures and not stock pictures of an item.  The item I bought was listed as one size but customized to a smaller size with wrong parts."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alex Hernandez",
          "Nb_Reviews": 1,
          "Date": "2020-03-28T02:19:07.000Z",
          "Titre": "The price on some stuff are higher than…",
          "Contenu": "The price on some stuff are higher than the new ones on the regular stores. Second, some of the tools they put on the shelves are the same model but different prices."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joseph Curtiss",
          "Nb_Reviews": 1,
          "Date": "2019-12-24T09:02:09.000Z",
          "Titre": "bought a used ps4 pro and when i got it…",
          "Contenu": "bought a used ps4 pro and when i got it I didnt get a power cord in the box as it was forgotten and the system was covered in dust as well as the controller don't work right it moves on it's own and it has to be charged after 30minutes of use and when putting a disc in it makes alot of noise when the disc tray begins to load the game it sounds like its grinding really bad..idk I wish I would have just spent the extra 50-70 bucks to buy a new one at walmart cause I'm not the most pleased with my order and it was a Christmas/birthday gift granted pawn america sent me a power cord as soon as they could but still I mean at least send out a good controller and clean the system..probably just buy new counsel elsewhere next time instead used at pawn america and they don't offer an extended warranty online that's kind of bs just saying"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MATT",
          "Nb_Reviews": 1,
          "Date": "2020-01-23T23:37:49.000Z",
          "Titre": "Online listing wasn’t accurate to condition",
          "Contenu": "Online listing didn’t highlight the power cable plug had  been removed from the unit. Return shipping made it easier to get it fixed and pay a little more"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-04-09T15:29:51.000Z",
          "Titre": "The original item  (necklace) I bought…",
          "Contenu": "The original item  (necklace) I bought seems to be missing the chain necklace so we had to redo the order and buy the pendant separately."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kayla Wynn",
          "Nb_Reviews": 1,
          "Date": "2018-10-28T01:46:56.000Z",
          "Titre": "kinda bummed",
          "Contenu": "The item I ordered did not work and I had to send it back. At least the customer service was good but still upset with being sold a broken item."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Angie",
          "Nb_Reviews": 2,
          "Date": "2020-04-07T21:10:58.000Z",
          "Titre": "I guess the 3rd time is a charm 🤷🏽‍♀️",
          "Contenu": "I would've loved to give this 5 stars but it took 3 different purchases for me to finally get the item I wanted.#1. I purchased a watch and was told that it had already been sold. Yet, I was also told that when you purchase an item, the post removes automatically(odd that it was still there for me to purchase). I was refunded and given a discount on the next purchase, for the inconvenience.  #2. I purchased ANOTHER watch and was told again that the item was not there... It was \"lost\". Again, I was refunded.#3 I found yet another watch.. I made the purchase and to my surprise it was a success! Praise the lord they ACTUALLY had the item in their possession.  It was delivered Saturday and it looks ok. There is a scratch on the screen that wasn't in the description. Dont get me wrong the customer service was very good. Now having the item you're looking for in stock?? I dont know..you may want to call or email to make sure before you purchase.  Hope this review helped!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Micha",
          "Nb_Reviews": 1,
          "Date": "2018-06-19T22:43:44.000Z",
          "Titre": "not great, but ok given the circumstances",
          "Contenu": "ok. I placed the order then was told it wasn't in stock and was sold at the same moment or something like that.  offered a resolution"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "paula m",
          "Nb_Reviews": 1,
          "Date": "2018-12-07T21:14:51.000Z",
          "Titre": "Beware of what’s advertised",
          "Contenu": "Purchased as advertised as a 2ct tw diamond, after getting it appraised is actually 3/4 ct tw.  Not even close to what was advertised."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jaser Jalghoum",
          "Nb_Reviews": 1,
          "Date": "2019-07-31T04:51:43.000Z",
          "Titre": "One of diamonds in the bracelet is…",
          "Contenu": "One of diamonds in the bracelet is dropped ! I opened the box and everything was fine until i noticed a blank hole in the bracelet"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Luke Utrie",
          "Nb_Reviews": 1,
          "Date": "2019-01-21T23:04:16.000Z",
          "Titre": "Long wait time to be helped while…",
          "Contenu": "Long wait time to be helped while Person in the front took a long call and organization of movies was lacking"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Debbie Petersen",
          "Nb_Reviews": 4,
          "Date": "2019-05-31T09:47:21.000Z",
          "Titre": "Today I have 3 reviews so I will post…",
          "Contenu": "Today I have 3 reviews so I will post each one separately because they are on different issues/items. Finally, I think I got a great deal from Ivan, he matched an eBay price for me so I could buy the ring in the store and give Susan the credit, kudos Ivan😄.However I think Brad needs to change the name of the store to Retail America, now no layaway, no double up, no trade in, pawn prices are horrible, might as well go to the mall😜🤪🤔.  Those are all the reasons people shop at PA, kiss your sales bye bye.  Then I spoke with Brad weeks ago about phoney pricing, so I go to Burnsville to buy a 18k horsebit bracelet that was $1799, but the website said $22something with 20 percent off making it $1619, wrong, 20 percent off of $1799 is $1419, but to make things worse I was told it was sent out to scrap!! So then I was told they thought they could get it back but I would have to pay $1619 because they paid $1400 for it and they have to make money, HEY not my problem the pawn broker paid to much, bottom line 20 percent off of $1799 is $1419, RIGHT BRAD😀 you said let you know if this pricing thing became an issue, so now it is an issue!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-07-15T01:23:02.000Z",
          "Titre": "The items were not all in the box",
          "Contenu": "The items were not all in the box. It was missing the charger."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Graphic Design",
          "Nb_Reviews": 5,
          "Date": "2021-09-07T16:30:44.000Z",
          "Titre": "Price was good",
          "Contenu": "Price was good, but unit was dirty with clogged vents on the console and power brick."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kaela Tyler",
          "Nb_Reviews": 1,
          "Date": "2019-04-12T09:44:55.000Z",
          "Titre": "Product came quickly but some...",
          "Contenu": "Product came quickly but some idjit got rid of all the Windows 7 files so the laptop is useless."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Garry Wolfe",
          "Nb_Reviews": 1,
          "Date": "2020-05-01T15:19:42.000Z",
          "Titre": "The first item.i bought was fine",
          "Contenu": "The first item.i bought was fine. It was the following item somehow was unable to be found."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Larounda Banks",
          "Nb_Reviews": 1,
          "Date": "2020-12-20T21:48:01.000Z",
          "Titre": "Eli in robbinsdale is over qualified I…",
          "Contenu": "Eli in robbinsdale is over qualified I feel he is a team player thanks again"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jimmy Faulk",
          "Nb_Reviews": 1,
          "Date": "2018-04-18T20:19:46.000Z",
          "Titre": "Didn't have the item in Stock but did…",
          "Contenu": "Didn't have the item in Stock but did have great communication and apologized"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 3,
          "Date": "2018-06-30T15:47:15.000Z",
          "Titre": "Little slow at helping a person that…",
          "Contenu": "Little slow at helping a person that obviously is wanting to look at an item"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bernie",
          "Nb_Reviews": 3,
          "Date": "2019-02-23T02:06:48.000Z",
          "Titre": "staff in the store kinda suck..",
          "Contenu": "staff in the store kinda suck... they act like you are bothering them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marco Gonzalez",
          "Nb_Reviews": 1,
          "Date": "2020-04-30T21:30:55.000Z",
          "Titre": "I thought the item was going to be…",
          "Contenu": "I thought the item was going to be ready when I got there"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-09-08T19:57:20.000Z",
          "Titre": "One of the controllers were broken"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "T lee",
          "Nb_Reviews": 2,
          "Date": "2019-03-12T22:52:45.000Z",
          "Titre": "So I have a mixed review beware of Fridley.",
          "Contenu": "So I have a mixed review, we have done business with them for years. We ordered a ring online from Duluth and it was damaged and the return process was great. The people ( online department and Duluth stores)were friendly and wonderful, Most of the stores are great.Yet your fridley store however is a mixed bag. One of the managers put that anything I buy from them is final sale. I have had returns in the past due to items not working out or not being what I thought. That's the problem with buying used you never know what your gonna get. I have a ring on layaway. That I won't be able to finish paying off and according to them I can't get my money back. I can't even get store credit.I get done telling me I could purchase it and then pawn it/ return. (Mind the fact that I needed to cancel because we don't have money to purchase) then Pawn America will make more money off of me.So they're making over $400 OFF ME either way.. I haven't even technically purchased the item. I understand small restock fee but $400 plus dollars is theft! I can't finish the layaway because I had to buy a new car so I can get to work so all the money had to go to that instead. I feel like this manager has a personal vendetta against me. They make me feel like dirt. They left me on hold for over 11 min.Considering all the money we have spent at pawn America over the years , this is made to feel like a cheap shot at us. You may save money compared to a jewelry store or best buy but save your sanity and do business with people who have some  integrity! They make money off of other people's misfortunes. If you are doing business with them go to any store but Fridley! Horrible horrible experience! If I do need anything it won't be from fridley.Update: They did return my money today, I appreciate that. So this issue was resolved. I do not however appreciate getting a lecture about return policies etc. While I will continue to do business with Pawn America I plan to avoid this store. Thank you for finding a resolution to this matter."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patrick Wright",
          "Nb_Reviews": 2,
          "Date": "2021-03-15T19:29:56.000Z",
          "Titre": "Prices are to way to high."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-03-12T17:11:57.000Z",
          "Titre": "cool..chain seem smaller"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Logan Bushaw",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T19:17:43.000Z",
          "Titre": "It came a day early which was very…",
          "Contenu": "It came a day early which was very helpful and appreciated, the item (Nintendo Switch) was a bit dirty however, nothing that I couldn’t get cleaned w a little cleaning wipe."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lesha",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T19:13:42.000Z",
          "Titre": "Item was as described",
          "Contenu": "Item was as described, and transaction was smooth! My only complaint was the shipping speed, so if you're like me, and when your item is of value you want it within a few days then I would choose express shipping. I live 4 hours away, and still took 6 days to reach me other then that everything was great!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "S",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T17:18:08.000Z",
          "Titre": "Good experience",
          "Contenu": "Accurate description, good price, fast shipping, well packaged."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robby",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T16:16:59.000Z",
          "Titre": "Product met expectations",
          "Contenu": "The product came in a timely manner and the quality is exceptional. The only issue was that the goggles were shattered, but it's not a major issue as I won't be using them often."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T04:09:29.000Z",
          "Titre": "Exactly what they said it was",
          "Contenu": "Exactly what they said it wasIn virtually new conditionCost of item was very reasonableI'm spoiled by never paying shipping, is why I'm not giving five stars 🤷🏻"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pam Isenhart-Tavoularis",
          "Nb_Reviews": 2,
          "Date": "2022-12-28T04:33:52.000Z",
          "Titre": "Delivery",
          "Contenu": "Delivery was a day late, but I'm assuming that was beyond your control because of the weather.  I appreciate receiving it before Christmas, because it was an important gift for my grandson.  Thank you so much!  I was initially concerned, because the camcorder was not packed very well, but, as far as I know, it wasn't damaged, and my grandson was able to use it on Christmas day...very grateful.  Happy New Year!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Annoyed",
          "Nb_Reviews": 2,
          "Date": "2023-09-16T17:36:32.000Z",
          "Titre": "Easy transaction.",
          "Contenu": "They shipped fast, well packaged.  Accurate description.  Only reason 4 stars is because I have bought from pawn shops online in the past and have ALWAYS been able to negotiate price at least a little.  This one says they do in person but not online which was a bit odd to me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-11-10T23:18:14.000Z",
          "Titre": "The ring I purchased is beautiful as…",
          "Contenu": "The ring I purchased is beautiful as shown, was advertised as a 3.5 and is a 4.5 though so I will need to get a smaller band so it fits my fiancee.  Very happy with the ring itself though. Feel free to send me a size 3 band so the ring fits correctly 🫣😉"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ThomBasPhoto",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T18:04:17.000Z",
          "Titre": "Fast response, accurate discription",
          "Contenu": "My order arrived quickly. It was securely packaged and was exactly as advertised. Actually it seems to be in a condition that is a bit better then advertised. I guess the lack of some of the original accessories, lens hood, cds, was the reason for its rating."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim Thompson",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T03:24:05.000Z",
          "Titre": "Great packing job",
          "Contenu": "The packing on the crossbow was unbelievably well put together. I don't think anything could have hurt it on its journey. Although the time it took to get here left a little to be desired."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-06T23:03:32.000Z",
          "Titre": "Item delivered just as described",
          "Contenu": "Item delivered just as described, so I am happy with my purchase and would do buisness with them again. The only reason that I didn't give 5 stars is because it was delivered two days late and was left on the top stairs of my front porch where it could be easily seen by possible thieves passing by and susceptible to the weather not being placed further onto my porch. (Especially being an electronic device) Either of these concerns may or may not be,\"Pawn America's\" fault,but this is how I rated it none the less."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gilbert",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T13:55:54.000Z",
          "Titre": "Website description detailed and…",
          "Contenu": "Website description was detailed and accurate."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe K",
          "Nb_Reviews": 1,
          "Date": "2023-03-12T19:43:58.000Z",
          "Titre": "Great service great item",
          "Contenu": "Processing was fast it shipped out the next day, price was good, item showed up missing two small parts but while it didn't directly list in the description that the 2 items were missing I ordered it expecting them to be missing as neither piece was seen in any of the photos.   And in the description under the contents/ included portion it blisted battery, charger, etc but not those two pieces.   I knew what I was getting into with the purchase but someone without a much knowledge of the item might not have."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jani jan",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T07:22:03.000Z",
          "Titre": "Good customer service",
          "Contenu": "What I purchased online Was not available . I was given a $20 discount on a future purchase. How neat is that. I will try to find something else...I wish there was a way to negotiate  prices online. Otherwise  I  like the online purchase policy for returns as well.!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MK.MIATA Instagram",
          "Nb_Reviews": 1,
          "Date": "2023-01-28T20:05:13.000Z",
          "Titre": "My experience was pretty good",
          "Contenu": "My experience was pretty good. Found an aftermarket car part that a company discontinued. Price was great and shipping only took about 4-5 days. The only down side to the item purchased is that it stated full kit, but was missing 1 of the essential cables. There are a lot of cables that go to these kits so I partially understand how you could miss you. Only hard part is finding someone else to sell it to me since the item is discontinued. Like I stated before though, the whole process went great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "I.G.",
          "Nb_Reviews": 1,
          "Date": "2023-01-13T17:04:07.000Z",
          "Titre": "expectations managed",
          "Contenu": "The items arrived as timely as promised. In viewing the items on the web prior to purchase, the item's photograph failed to reveal a defect (small hole) in the carrying case. The defect was clearly visible upon inspection after it arrived, hence, the fifth star. This notwithstanding, all is well and I am contented with the purchase."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "online customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-18T20:14:33.000Z",
          "Titre": "Great customer service",
          "Contenu": "I had an online order and when it arrived to my house it was missing a couple items from the listing. I was able to contact Kyle at their customer service and he made sure to make it all right for me. The missing items are on the way now and schedule to arrive soon."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-11T17:51:36.000Z",
          "Titre": "Good Product, slow shipping time",
          "Contenu": "I order airpods from them a few days ago, they came they were perfect. I bought usps shipping and it took a week to come even though I expected to come in three days. Other than that, amazing service!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Derek",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T23:05:23.000Z",
          "Titre": "Good Customer Care",
          "Contenu": "Excellent customer service even though I received a bad product. I would buy from them again knowing that they will handle whatever the situation might be promptly and with good customer care."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T16:56:06.000Z",
          "Titre": "Ordered a ring",
          "Contenu": "Ordered a ring.  Wore it twice and one of the diamonds fell out.  I took it to a local Pawn America and they sent it in to be repaired.  Have not received it back as of yet.Not sure what the procedure is for checking jewelry items before it is sold, but I will from this point on take any jewelry purchased to a jewelry store to have it checked out and have it appraised."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul Craig",
          "Nb_Reviews": 3,
          "Date": "2023-03-13T02:26:39.000Z",
          "Titre": "Ibanez Bass Guitar",
          "Contenu": "Bass was pretty close to their description as far as condition.  There were some imperfections I noticed, but they were hard to see.  Shipping was fast."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T17:55:48.000Z",
          "Titre": "switch lite",
          "Contenu": "bought a switch lite but i think it had been stolen, there was still someone’s account on it and a 128 gb sd card in the card slot. other than that the thing works great and is in excellent condition. guy who helped me at the counter was super nice"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Deb Dickie",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T23:27:31.000Z",
          "Titre": "They are really great to work with and…",
          "Contenu": "They are really great to work with and willing to help you In anyway they can. Mankato store I've always worked with and couldn't be happier with the results"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tommy Davidson",
          "Nb_Reviews": 4,
          "Date": "2023-06-15T20:23:55.000Z",
          "Titre": "Good item at a fair price",
          "Contenu": "Good item at a fair price, it could only be better if the customer could get a tracking number after purchase. Thanks."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Melissa",
          "Nb_Reviews": 3,
          "Date": "2023-10-26T23:10:38.000Z",
          "Titre": "Fast Shipping",
          "Contenu": "Fast ShippingGot our item in 2 days.  Bummed that the cords that came with the game unit didn't work- we had to replace those."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T22:30:07.000Z",
          "Titre": "The transaction went smoothly",
          "Contenu": "The transaction went smoothly, and fast shipping. The product was excellent. The only reason didn't give it a 5 star was the product was a little dirty when I received it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dan Lazovic",
          "Nb_Reviews": 1,
          "Date": "2023-01-09T19:01:02.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "The item i purchased unfortunately arrived damaged but customer service was very quick and efficient in solving the problem and issuing me a return label as well as crediting my CC once they received the item back.  Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Danny J Younger",
          "Nb_Reviews": 2,
          "Date": "2023-03-18T22:58:58.000Z",
          "Titre": "The unit was as described and maybe a…",
          "Contenu": "The unit was as described and maybe a little rougher than expected, but still functional. Not a problem."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tyler",
          "Nb_Reviews": 2,
          "Date": "2022-11-12T06:20:27.000Z",
          "Titre": "Good price and was overall pretty…",
          "Contenu": "Good price and was overall pretty happy, would have gave it 5 stars but I bought a PS3 slim with a controller, and at first the controller barely worked and I had to take it apart and fix the issue and now it works fine.  Would have been 5 stars otherwise.  Shipping was fast. overall I'm happy tho, wanted to play my Lego dimensions again lol."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T22:35:44.000Z",
          "Titre": "Shipped quickly",
          "Contenu": "Shipped quickly, and arrived intact. Packaging was a bit sloppy, no padding. Box looked a bit rough upon arrival."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T20:07:22.000Z",
          "Titre": "Smokey",
          "Contenu": "Item was as described but the box that it shipped in punched me in the face with the smell of smoke when I opened it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ben",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T09:56:28.000Z",
          "Titre": "I Got Exactly What I Ordered, and I am Satisfied. Thanks!",
          "Contenu": "I got exactly what I ordered and it was a joy to get it for the price I did. I will definitely be looking here for more things. Thank you for an awesome service!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mr. Eric Holston",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T22:50:07.000Z",
          "Titre": "Recieved my 15' Laptop and was all smiles. It was in perfect condition. Pawn America Fan for Life !",
          "Contenu": "Received my 15' Laptop and was all smiles. It was in perfect condition. Pawn America Fan for Life !"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Antonio",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T16:27:31.000Z",
          "Titre": "Everything was timely and opportune",
          "Contenu": "Everything was timely and opportune, the product was as described, I just have a suggestion please notify customers when the order isshipped."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-19T20:40:15.000Z",
          "Titre": "I bought a ps3 and it was as describe",
          "Contenu": "I bought a ps3 and it was as describe. They mailed it fast and gave me tracking. I recommend buying from them. Good service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Angie",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T19:08:21.000Z",
          "Titre": "Received my purchase in great…",
          "Contenu": "Received my purchase in great condition. I’m very happy with this purchase."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T23:03:23.000Z",
          "Titre": "Received merchandise promptly",
          "Contenu": "Received merchandise promptly. Returns without question. Returns to other Pawn America stores."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-17T20:54:55.000Z",
          "Titre": "Recieved package next day",
          "Contenu": "Recieved package next day. It was taken apart improperly for shipping which was a bit of a problem but was able to fix it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "KAO XIONG",
          "Nb_Reviews": 3,
          "Date": "2023-06-28T03:16:49.000Z",
          "Titre": "Better photos and the ability to offer…",
          "Contenu": "Better photos and the ability to offer best price on some items would make the experience better for returning customers."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T17:57:35.000Z",
          "Titre": "Came on time and the camera is doing…",
          "Contenu": "Came on time and the camera is doing great. Enjoying it very much."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T12:44:46.000Z",
          "Titre": "The item arrived in a very short time…",
          "Contenu": "The item arrived in a very short time in great shape and well packaged."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DG",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T11:33:56.000Z",
          "Titre": "Smooth transaction",
          "Contenu": "Smooth transaction, fast shipping"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer Denise Phillips Smith",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T08:06:25.000Z",
          "Titre": "Very good",
          "Contenu": "They were very helpful to explain the procedure, and very Prompt with the delivery."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shannon",
          "Nb_Reviews": 2,
          "Date": "2022-09-23T16:52:53.000Z",
          "Titre": "The employees are great",
          "Contenu": "The employees are great! The wait was ridiculous, ordered online and might as well have just purchased in the store. I waited 20 minutes to pick up a order I had already paid for, but the employees were awesome!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eddie M",
          "Nb_Reviews": 1,
          "Date": "2022-08-16T02:31:43.000Z",
          "Titre": "Shipped to me quickly, but small issue.",
          "Contenu": "Purchased a used XBOX One XThe DVD/CD drive did not work.This was not mentioned in the advertisement.Fortunately,I did not need the DVD/CD drive to work.I would have probably still made the purchase if this fact would have been mentioned.Just a piece of information that I would have liked to have been provided before purchase.Pawn America did ship the XBOX One X to me quickly. I did like that.I would purchase from Pawn America again, but I will ask more questions before my next purchase."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T00:53:58.000Z",
          "Titre": "Seamless good selection"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ryguy",
          "Nb_Reviews": 1,
          "Date": "2022-11-05T20:04:37.000Z",
          "Titre": "i received my item quickly and looked…",
          "Contenu": "i received my item quickly and looked in better condition then the pictures showed on the site"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T02:01:35.000Z",
          "Titre": "I was happy with my item and fast…",
          "Contenu": "I was happy with my item and fast delivery"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-09-11T19:56:49.000Z",
          "Titre": "Product works and is as advertised",
          "Contenu": "Product works and is as advertised. Minor constructive criticism. The price of the item was $0.01 below free shipping threshold but ended up qualifying for free shipping. Clarifying that would help avoid time looking for additional items to get over threshold. Also, item (as advertised) had some gooey residue on it. It would have taken limited time for you to use some goo be gone on it and made the item more attractive. I can understand the desire not to mar the item but even just using a damp cloth could have probably done it rather than leaving it for the consumer to do themselves. Again it was as advertised so no complain there, just a suggestion.Item was received timely and was packaged appropriately. Would definitely look for similar such items in the future. Great price was definitely a factor in making this purchase!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-26T18:36:22.803Z",
          "Titre": "Very helpful and informative",
          "Contenu": "Very helpful and informative. Offered $100 less for the item and they agreed. Only thing that was not good was waiting at least a week for the item. Was a light weight box and could have shipped it through a better way of getting it to me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-17T15:36:32.000Z",
          "Titre": "Mankato charged my account an extra…",
          "Contenu": "Mankato charged my account an extra &57.88 ?  The purchase was $736.00 and could have almost fit in a padded envelope!! The other P.A. stores shipped for free?  There was nothing on the receipt explaining the extra charge$  I had to track it down through my bank statement!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "KHOLOD ADHEM",
          "Nb_Reviews": 1,
          "Date": "2020-05-08T02:15:01.000Z",
          "Titre": "The item was perfect",
          "Contenu": "The item was great! I purchased a gold chain and it is exactly as shown in the pictures I loved it and very happy with my purchase I will buy again for sure. The only thing is the shipping was first class and it took almost 9 days to arrive! I expected such a delay due to COVID-19 but I wonder if I am buying an expensive item next time would PawnAmerica offer priority shipping? I didn’t see they offer faster shipping"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "R. Perry",
          "Nb_Reviews": 1,
          "Date": "2020-01-24T11:36:20.000Z",
          "Titre": "Packaging could’ve been better by…",
          "Contenu": "Packaging could’ve been better by surrounding the product on all angles instead of just top and bottom to insure a damage free product and better safe handling of item purchased by using fragile stamps on package. Don’t just trust fedex to get it there safe they drop/throw packages daily and my impact sensitive product could’ve easily been damaged after being tossed against my concrete driveway"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brandon Bowman",
          "Nb_Reviews": 1,
          "Date": "2019-09-10T17:50:28.000Z",
          "Titre": "Pretty good the condition was what…",
          "Contenu": "Pretty good the condition was what you'd expect from a pawn shop the bow I ordered was missing a few things but since I'm a Bowhunter I'm still happy with what I paid for it it's was a 2014 PSE so right on the money i love the fact you get what's in the photos and the Bows are priced good but the fully complete ones are pricey but it's a pawn but as far as my order goes I'm happy with it"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DC",
          "Nb_Reviews": 3,
          "Date": "2020-02-25T20:00:21.000Z",
          "Titre": "I was so skeptical that this site was…",
          "Contenu": "I was so skeptical that this site was going to send me a dud! But I am glad to say I was wrong!! The item I purchased was just as pictured and when I took it to get sized (purchased jewelry), they told me that I got a great deal on my purchase for the price paid! Will definitely be purchasing other items from this online store. I gave 4/5 stars because shipping states 1-2 business days and the tracking number was not accurate. It took 6 days to receive my item."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wilfredo Morales",
          "Nb_Reviews": 7,
          "Date": "2019-12-16T17:54:42.000Z",
          "Titre": "Listed as 14k gold... but received 10k gold!!! Honest mistake",
          "Contenu": "I purchased a religious pendant and it was supposed to be 14 karat gold but when I received it it was marked 10 karat gold so please ask questions before purchasing. Updated 12/16/19 Someone from the company did reach out to me and an apology was issued and they gave me a $20 coupon off my next order so I do believe it was an honest mistake therefore I’m changing my review because I have done business with them plenty of times before with no issues."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-04-07T17:08:21.000Z",
          "Titre": "Good experience with return",
          "Contenu": "I would give 5 stars for the customer experience I had with my return. It was a great experience. The reason I’m giving 4 stars is because the description of the item both online and when I called the store was extremely inaccurate. That being said, they handled my return very well"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JS",
          "Nb_Reviews": 1,
          "Date": "2020-07-14T21:16:10.000Z",
          "Titre": "The website is in need of usability improvements, but customer service was good.",
          "Contenu": "The website is okay, but there was difficulty fitting to my phone screen so I couldn’t see a lot at once when navigating. After I added a card for payment, I saw that I must have fat-thumbed the delivery method and I couldn’t go backward in the checkout process to adjust it. Fortunately, there was an email option. A customer service person got back to me immediately and shipped the item right away. Everything else was great, including the condition of the product I purchased and fast shipping."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 8,
          "Date": "2019-03-04T11:18:49.000Z",
          "Titre": "First purchase.",
          "Contenu": "This was my first purchase ever from Pawn America and I bought my camera online.  It was packed very well and I got my camera two days later which was on time.  The camera is in almost mint shape.  I think Pawn America did a very nice job describing the camera and I think the price was good too.I went to register the camera on the company's website.  I wasn't expecting to do this but I was able to do it.  Very pleased with Pawn America."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brooke Smith",
          "Nb_Reviews": 2,
          "Date": "2020-03-29T01:46:59.000Z",
          "Titre": "Jewelry price review",
          "Contenu": "I buy jewelry from here off and on and am usually quite pleased as the pieces are as described and they come polished and in great condition. The customer service is quite good as well. The only problem I see when looking through the selection would be the pricing. About half the prices are in my opinion priced appropriately where the other half are as much as retail new if not more. I think a bit more time on pricing would be a plus as they are pre owned. Overall a great shopping experience though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Veronika Eckerson",
          "Nb_Reviews": 1,
          "Date": "2018-10-09T03:21:54.000Z",
          "Titre": "Pawn America shop in WI is only  3…",
          "Contenu": "Pawn America shop in WI is only  3 hours away  ( driving) from my house in NW sub IL...I was waiting for my ring 4 days..Was shipped 1st class, the cheapest and slowest, and its took 4 days !!!!I can't believe it... The distance from shop to my house 3 hours to drive...Not happy about that.But Ring is Beautiful, I love it..Thanks any way...4 stars...."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anon",
          "Nb_Reviews": 1,
          "Date": "2022-03-06T17:50:39.000Z",
          "Titre": "Associates are amazing!",
          "Contenu": "I’ve had bumpy experience with Pawn America in the past, but the new associates make me want to come back more frequently! In particular, the associate Liz, is phenomenal! She helped me when I really needed it!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Happy customer",
          "Nb_Reviews": 1,
          "Date": "2018-11-06T16:15:14.000Z",
          "Titre": "A ring fit for a queen!",
          "Contenu": "I have never made a purchase site unseen before, especially for the amount that I did from pawn america when purchasing a ring for my fiance. They were very helpful and everything has gone exceptionally smooth, we purchased it online and received it two days later, took it to our local branch to purchase the lifetime warranty which to me makes pawn america just as good if not better than the jewelry stores as the warranty is second to none, thanks pawn america!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ina  Weaver",
          "Nb_Reviews": 3,
          "Date": "2018-07-26T07:59:38.000Z",
          "Titre": "Pictures they advertise are different than what you get (PS4 bundle)",
          "Contenu": "Orderd a PS4 that came with the proper cables and a controll for around 245. Everything was nice, but on the picture that is on the website it showed a controller that had an army print on it, which i thought I’d be receiving with the consule..Instead it was just a basic black controller that has the grips on the sticks ripped off but works totally fine. I mean it’s fine but just don’t expect it to come totally like the picture they advertise for whatever ur buying."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 5,
          "Date": "2018-10-22T21:13:49.000Z",
          "Titre": "The sale and the delivery were as…",
          "Contenu": "The sale and the delivery were as expected and went off perfectly. The item was, as described. Since it was a guitar there were a couple of issues I wish had been pointed out in the photographs. They were not. Also, there is a cap, a black To the toggle switch on the guitar that is not there.  It does appear in the pictures… So?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rev. Kevin Rich",
          "Nb_Reviews": 1,
          "Date": "2018-07-06T20:30:17.000Z",
          "Titre": "I found a really nice laptop at a…",
          "Contenu": "I found a really nice laptop at a awesome price, The only issue I had was ordering/ paying for the laptop. I had to start a PayPal account to purchase the laptop. If it was not for that issue, I would had given them 5 stars. will be ordering more things at Christmas time. thank you Pawn America for the expensive Laptop for cheap. I love it. It does have issues with Fn keys, its used and not a big deal.  for the price I will buy a replacement keyboard. The Laptop is worth it. Great Job Pawn America!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Neumann",
          "Nb_Reviews": 1,
          "Date": "2020-04-28T19:06:36.000Z",
          "Titre": "earring backs missing",
          "Contenu": "I ordered earrings with backs only got earrings no backs also did not receive tracking information until package was delivered. After posting my review I was contacted and the sent out the backs and apologized for not having tracking information available over all I am very happy"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nick Anderson",
          "Nb_Reviews": 1,
          "Date": "2018-12-06T19:06:43.000Z",
          "Titre": "Bought a DJI Mavic Pro from these guys",
          "Contenu": "Bought a DJI Mavic Pro from these guys for $400!! Really good deal. Called them before hand to make sure everything was in working order. Guy was helpful on the phone. Placed my order and received it pretty fast. Came with 2 batteries, one of which was no good but still a really good deal for what I paid."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carl Miller",
          "Nb_Reviews": 1,
          "Date": "2020-04-30T13:51:15.000Z",
          "Titre": "Rode microphone",
          "Contenu": "The product was listed as a Rode NT1 but was actually the NT1-A. I should have known by the picture. The mics are comparable and the price was real good. Purchased new you would get a soft case and a pop filter(missing). For what I needed, this mic will definitely work great"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kisiah Johnson",
          "Nb_Reviews": 3,
          "Date": "2018-12-03T03:43:53.000Z",
          "Titre": "although I have not taken listened to…",
          "Contenu": "although I have not taken listened to my produci it appeared just as described no bangs scratches e.t.c What really impressed me is how soon this was delivered. It arrived several days before the due date ,which will lead me to try ordering again from the company online. I have purchased things from my home store and some things didn't go well, as far as the functioning. due to that i still will purchase things from pawn america but I will be a little bit more cautious.  Overall I still give this company a A rating in my book. Thank You"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Warren Elson",
          "Nb_Reviews": 1,
          "Date": "2019-06-10T18:41:39.000Z",
          "Titre": "Good price, came as expected. Pleasant communication.",
          "Contenu": "The purse I purchased came exactly as described visually, unfortunately there was a scent that was not mentioned that I've had trouble getting out. It was a gift so hopefully it will fade over time. I assume the previous owner was a smoker.Edit:  updating my review to \"great 4/5 stars\" from \"average 3/5 stars\" because of the prompt reply from the seller. Although I don't wish to return the product because a dry-cleaning and a few nights with dryer sheets left the purse smelling pleasant, I do appreciate the offer for a return."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "m88m",
          "Nb_Reviews": 2,
          "Date": "2018-04-18T20:49:40.000Z",
          "Titre": "Snowshoes",
          "Contenu": "Snowshoes were packaged in such a way that part of the binding was bent and makes a noise every time my husband walks, it' driving him crazy. He is trying to bend it back, and to stay bent back, it's proving to be a bit difficult. Maybe more care with packaging."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jamele Mounger",
          "Nb_Reviews": 1,
          "Date": "2019-12-30T16:45:19.000Z",
          "Titre": "Would have given 5-stars / Changes Need to be made to Shipping Policy",
          "Contenu": "Would have given 5-stars, but had to go through extra measures to send gift.Purchased Xbox as a gift for family member out of state.  Chose PawnAmerica because they offered free shipping, shipping info was never requested.  Later had to cancel order because PawnAmerica only ships to buyer address listed on credit card. Changes need to be made to this policy. I canceled my order and sent money to family member to order and have shipped to them.  The next customer may not be as patient....  What if someone else purchases as a gift and wants to have shipped to someone other than themselves?  Changes Need To Be Made To This Policy..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Edward",
          "Nb_Reviews": 3,
          "Date": "2018-04-18T22:10:32.000Z",
          "Titre": "I've only had a couple issues in my…",
          "Contenu": "I've only had a couple issues in my multiple purchases.  One was a dial caliper- which they \"lost\" after I purchased same, and the other was a \"reqiured\" shipping of a tuba that was located only a 10-minute drive from where I live."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Birthday Girl",
          "Nb_Reviews": 1,
          "Date": "2019-03-15T21:28:19.000Z",
          "Titre": "Black Hills Gold Beauty",
          "Contenu": "The ring was beautiful, I loved it! I am was a little disappointed when I called and emailed for additional images of the ring and no one responded. But over all the ring was what was advertised, it was a great price and it came fast. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-10-11T06:38:24.000Z",
          "Titre": "Outside of not being able to find my…",
          "Contenu": "Outside of not being able to find my order on the system, it was a good erperience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brad",
          "Nb_Reviews": 1,
          "Date": "2020-03-07T23:43:28.000Z",
          "Titre": "Colinsia at Pawn America West Allis…",
          "Contenu": "Colinsia at Pawn America West Allis store was very helpful and courteous.  Although I could not rate my visit as a 5 star as I did not get the price I wanted, Colinsia was very professional and made my visit a lot easier"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2019-12-28T02:06:34.000Z",
          "Titre": "Happy Customer",
          "Contenu": "Ordered a Nintendo Switch for my sons Christmas present. The website was easy to navigate with a large selection and price range. The Switch I decided on was very reasonably priced and had a detailed description with multiple pictures. Checkout was easy, and shipping was FREE!!  It arrived a few days later exactly as described (near new condition) and was packed securely in a nice, solid box. The only complaint I have is regarding the shipping information. I wasn’t emailed a tracking number and their website didn’t offer a good/easy way to track my order/package. I’m still not sure which currier delivered it?... Overall  it was a great experience I would be happy to repeat!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bobby Ehlers",
          "Nb_Reviews": 1,
          "Date": "2019-08-30T01:16:23.000Z",
          "Titre": "Overall Pretty Solid",
          "Contenu": "Really good prices and usually solid products.  Unfortunately they sold me a defective PS4, but I returned it within 30 days.  I’m still waiting to be refunded but they did give me a free return shipping label."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-08-28T15:58:25.000Z",
          "Titre": "My online experience was great",
          "Contenu": "My online experience was great.  Easy navigation to what I was looking for. Fair prices as well on products"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kristie",
          "Nb_Reviews": 1,
          "Date": "2020-08-06T04:42:29.000Z",
          "Titre": "Once my item was shipped it arrived…",
          "Contenu": "Once my item was shipped it arrived pretty quick and I loved the way my item was packaged. The only downer was the waiting for my order to be processed. But otherwise awesome customer service!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ross",
          "Nb_Reviews": 1,
          "Date": "2019-08-12T17:03:15.000Z",
          "Titre": "Quirky online software but great once it worked!",
          "Contenu": "Once their online software finally took my card information, it was fine. I tried repeatedly on a Friday after 5 p.m., and it refused to take my credit card. It finally gave me a message that the item I was trying to buy was sold.I suspected it was because I had tried so many times to order it! The online system says they only take orders from 9 a.m. to 5 p.m. Monday through Friday, which seems weird for an online system.On a whim, I tried it again the following Monday and was able to order the same item with no problems. Glad I was persistent. This was a very unusual item and considered as new in the box (Tactacam video camera for gun or bow). They did a nice job of packaging it and didn't charge excess postage (only about $8)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nina",
          "Nb_Reviews": 1,
          "Date": "2018-10-15T09:13:10.000Z",
          "Titre": "Everything came well packaged",
          "Contenu": "Everything came well packaged.There was a bit of a 1 day delay. Other than that everything was in good condition as noted on the site. I will definitely be buying from Pawn America in the near future."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christie Reining",
          "Nb_Reviews": 1,
          "Date": "2019-08-30T18:18:34.000Z",
          "Titre": "Great instrument for the price",
          "Contenu": "Great instrument for the price. However, the ad on website said it was \"new\", and it is very visibly used. However shipping was fast and ordering reliable.  Will recommend to others"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hanah",
          "Nb_Reviews": 1,
          "Date": "2020-06-23T23:20:52.000Z",
          "Titre": "Quick shipping",
          "Contenu": "Quick shipping, product as pictured. The only reason i didn’t give 5stars is because product is not pictured in a mannequin to give it a better idea of product size especially jewelry"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dominic Gonzales",
          "Nb_Reviews": 1,
          "Date": "2018-08-06T22:37:00.000Z",
          "Titre": "Ordered a chainsaw from pawn America…",
          "Contenu": "Ordered a chainsaw from pawn America and it was the same model I bought at another store about 2 yrs ago that is discounted and I’m happy with The purchase spot on for description no issues.."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff Hoefler",
          "Nb_Reviews": 1,
          "Date": "2019-12-12T12:43:52.000Z",
          "Titre": "Only complaint there was no tracking…",
          "Contenu": "Only complaint there was no tracking number for my order.  But the snap on ratchet was in great shape and I’m very happy with my purchase.  Look forward to doing more business with you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tom Rucker and Laura Petry",
          "Nb_Reviews": 1,
          "Date": "2021-10-10T02:27:37.000Z",
          "Titre": "Had a hiccup with the ordering process…",
          "Contenu": "Had a hiccup with the ordering process and internet but emailed them and they took care of it. Just received my 5$ Gold coin I ordered today and its beautiful!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wilfredo Morales",
          "Nb_Reviews": 7,
          "Date": "2020-02-14T20:59:33.000Z",
          "Titre": "PAWN AMERICA Canceled my order",
          "Contenu": "I purchased a necklace that was going to be a gift for my nephew and PAWN AMERICA Canceled my purchase gave me a refund and gave me a code for $20 credit towards my next purchase, Am I supposed to be happy with this?   The necklace I purchase was advertised for sale for $274.99 and after they canceled my purchase they relisted the item for $849.99 I believe that is called bait and switch. (2-14-2020)    I purchased a pair earrings that I thought my nephew would like and I  used the $20 coupon that Pawn America provided, after the purchase Pawn America reached out to me and offered to give me a more expensive pair of earrings for the same price, so I gladly accepted. They try their best to make up for their mistakes, After all we are human and mistakes happen and this is why I’m changing my review."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Crawford",
          "Nb_Reviews": 2,
          "Date": "2019-05-10T10:18:04.000Z",
          "Titre": "Speedy delivery",
          "Contenu": "Purchased a saxophone  the case was from a cheaper brand the sax it self was a student sax but a trusted American brand. Score  and delivery was fast totally happy with my experience"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike C.",
          "Nb_Reviews": 1,
          "Date": "2022-12-01T15:47:33.000Z",
          "Titre": "Order was placed promptly",
          "Contenu": "Order was placed promptly. But delivery was terrible. I paid $45 for 2 day service and received it 8 days later. But, they made good on my side. Overall good experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shaun Campbell",
          "Nb_Reviews": 1,
          "Date": "2019-02-27T20:01:36.000Z",
          "Titre": "Great items",
          "Contenu": "Great items. Wish what was available for online purchase was updated quicker. Although they do an amazing job of making sure you are well taken care of😀😀😀"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bonn Rulloda",
          "Nb_Reviews": 3,
          "Date": "2022-01-23T21:41:23.000Z",
          "Titre": "Great products",
          "Contenu": "Great products, will buy again, look forward for any coupons you send, been buying your products but never receive any promotions discounts."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William Gavalier",
          "Nb_Reviews": 1,
          "Date": "2018-04-18T20:41:41.000Z",
          "Titre": "All fine with the Audiosource Amp 2 i…",
          "Contenu": "All fine with the Audiosource Amp 2 i bought from you except left power meter doesnt work  prob loose connection  will disassemble try to fix  Not sendinh it back for this issue"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dana Wiberg",
          "Nb_Reviews": 1,
          "Date": "2019-06-01T20:33:15.000Z",
          "Titre": "I would highly recommend Pawn America…",
          "Contenu": "I would highly recommend Pawn America for a couple reasons. Number 1 would the way the environment feels at the IGH location. It is just a cool vibe because everyone who works there cares about what they do and they are real cool about it. Daisy, who works at the igh locate especially. I really appreciate her helping me today in cleaning my necklace.Thank you. Another reason I dig it is because of variety. They have some very unique merchandise which makes it cool to just walk around and not to mention they have helped me out with a loan a couple of times. The only knock is sometimes some things are overpriced in my opinion, but then again you will also find some real steals in things being insanely underpriced. So it washes out. Lasty, thanks a lot to everyone who makes coming there as cool of an experience as it is."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Austin Daentl",
          "Nb_Reviews": 2,
          "Date": "2018-06-03T03:00:21.000Z",
          "Titre": "Great job on delivering my order",
          "Contenu": "Great job on delivering my order. Wish you would have clear old the data still left on the Sony playstation 3 from the previous owner. But otherwise my experience was great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Robinson",
          "Nb_Reviews": 1,
          "Date": "2020-01-08T03:24:30.000Z",
          "Titre": "I used the website to make purchases…",
          "Contenu": "I used the website to make purchases for Christmas. Everything worked great and my gifts were available and ready for me when I arrived to pick them up. It was great!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Odey",
          "Nb_Reviews": 1,
          "Date": "2018-08-14T00:01:27.000Z",
          "Titre": "The merchandise up for sale is good…",
          "Contenu": "The merchandise up for sale is good brand stock, I look. at your website nightly, I just don’t like getting kicked out every time I look at a item. 😎😎"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-03-19T13:37:52.000Z",
          "Titre": "The online process was easy and getting…",
          "Contenu": "The online process was easy and getting to checkout. Only problem was I needed the day of but had to travel for the product. (Over hr/30 to location.)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Quentin Johnson",
          "Nb_Reviews": 1,
          "Date": "2020-06-02T22:13:39.000Z",
          "Titre": "Great service great price for my item…",
          "Contenu": "Great service great price for my item and very fast delivery. My item was packaged quite securely in its inner and outer containers in great condition."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian L. Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T23:08:24.000Z",
          "Titre": "I don't remember who I interacted with.",
          "Contenu": "The people  I encountered both in original posting and purchase we were knowledgeable of store policies and explained them to me in very clear language.  It made me feel more comfortable taking a chance of buying used gear.When I had to return the item, I has no problems working with the online person.  I'm sorry that I cannot remember their names  but they were 2 guys.I will definitely be back for more business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:23:59.000Z",
          "Titre": "My 1st purchase, Guaranteed return customer",
          "Contenu": "My 1st purchase, Guaranteed return customer.!Item arrived well packaged and secure, and expeditedI took a chance, glad I did! No sooner item arrived, I started looking on website for future purchases!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Preston",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T20:49:46.000Z",
          "Titre": "Curbside pick up fantastic",
          "Contenu": "Fast service from buying online to collecting, pick was easy as I had sleeping toddlers in the car, called store once arrived they bought out my purchase to my car. Polite friendly staff."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christina",
          "Nb_Reviews": 5,
          "Date": "2023-12-21T01:54:42.000Z",
          "Titre": "Easy to find what I want",
          "Contenu": "I could find what I was looking for easily. They quickly shipped the purchased item in a well-padded container."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T05:54:55.000Z",
          "Titre": "Superior Customer Service",
          "Contenu": "My order was delayed by usps but I was pleasantly surprised with the patience of the staff to resolve the problem. Kyle kept in contact and gave me frequent updates."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary M Lutz",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T22:21:01.000Z",
          "Titre": "Ryan at Burnsville is awesome!",
          "Contenu": "Ryan at Burnsville is awesome!! I sold some stuff and he got me great prices. Anytime I need to sell stuff I always go to Pawn America Burnsville on Grand as the guys there are awesome!!!  Happy holidays!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T19:26:56.000Z",
          "Titre": "Tablet was in excellent condition",
          "Contenu": "Tablet was in excellent condition. Great item would buy from them again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James K",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T00:40:24.000Z",
          "Titre": "The online pictures and descriptions…",
          "Contenu": "The online pictures and descriptions are great! I have purchased items in the past and everything was perfect.Once again, I am giving you (5) “pawn stars”! I look forward to doing business with you in the future!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christin Julia Ford",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T11:39:23.000Z",
          "Titre": "Perfect camera for half the price!",
          "Contenu": "Bought myself a nice point n shoot for concerts, a canon powershot sx740 and the quality is great! No damage at all, perfect working condition and arrived just before my concert (I ordered maybe 1.5 weeks before). Got a perfect camera for half the price originally! I love pawn america"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T00:40:57.000Z",
          "Titre": "Reliable and honest",
          "Contenu": "I ordered a Nintendo Switch and it arrived in described condition and well packaged. The shipping was prompt and I felt the communication was good. I am very happy with my purchase and would buy from here again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T02:02:43.000Z",
          "Titre": "Would recommend",
          "Contenu": "Watch was just as expected. Shipping was fast.  I was pleasantly surprised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lora",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T03:42:29.000Z",
          "Titre": "Superb service",
          "Contenu": "The item was just as listed when it arrived within just a day or two!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T01:31:18.000Z",
          "Titre": "I wish I could give my purchase,s 10…",
          "Contenu": "I wish I could give my purchase,s 10 stars. Beautiful rings for the Me and the Mrs.( Quality jewelry)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DW",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T21:19:50.000Z",
          "Titre": "Great online store",
          "Contenu": "Easy to navigate their items online. Purchased a watch and received 3 days after ordering it. Item was in better condition than the website description stated."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T02:15:39.000Z",
          "Titre": "Good First Experience",
          "Contenu": "Everything was easy, description was accurate, and shipping was pretty fast!  I'll be using Pawn America again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T16:13:23.000Z",
          "Titre": "Pleasantly Surprised",
          "Contenu": "Swift delivery, well packaged, prompt notification. Was pleased to see instant feedback on website. When I purchased the item, it was no longer shown on the site. I can't tell you how frustrating it is to see an item as in stock at a nearby big box store and drive over to pick it up only to find it isn't there."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keith F",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T13:58:25.000Z",
          "Titre": "Outstanding service and price for item!",
          "Contenu": "Item was new as stated .arrived in two days, ecellent service and price for this item. Would shop with them again. Thanks Keith"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jose Luis",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T17:15:20.000Z",
          "Titre": "Item as described",
          "Contenu": "Item as described,   fast shipping . Very happy with the purchase, definitely going to do more business.  Tnks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin Lee",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T14:51:42.000Z",
          "Titre": "Good business done right, right here!!!!!",
          "Contenu": "The whole thing was too easy for real. I picked the speaker I wanted (Sony GTK-XB5) for a third of the price and it was shipped free with no sales tax on top of the price either. And it was in front of me four days later. I haven’t been paid to say this or anything like that. I’m just giving them their stars because it was simple. Just business done right, right here."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T12:05:39.000Z",
          "Titre": "Everything about pawn America was true…",
          "Contenu": "Everything about pawn America was true fast shipping an I got everything an exactly what was in the picture I will definitely buy from them again -arrma typhon tlr owner-"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T01:28:28.000Z",
          "Titre": "Great transaction start to finish!",
          "Contenu": "Great transaction start to finish!Price, seamless online purchase, perfect communication, great s&h!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JJ",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T15:55:44.000Z",
          "Titre": "My order arrived faster than I expected…",
          "Contenu": "My order arrived faster than I expected and the price was the lowest that I could find."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T01:50:39.000Z",
          "Titre": "Excellent Purchase Experience",
          "Contenu": "Item was was as described and in excellent condition. It was shipped out the next day. Excellent purchase experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T01:22:52.000Z",
          "Titre": "My purchase was as shown via the…",
          "Contenu": "My purchase was as shown via the pictures on-line. Shipping and delivery were great too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arthur",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T04:38:11.000Z",
          "Titre": "Easy ordering and fast shipping  thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laiden",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T13:43:52.000Z",
          "Titre": "Good Business",
          "Contenu": "I got a nintendo switch for my little sister.It came packaged very securely, it even survived my mail lady throwing it over out fence. Shipped out fast and got the tracking number as soon as i ordered."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony H.",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T18:51:37.000Z",
          "Titre": "I've purchased from pawnamerica before…",
          "Contenu": "I've purchased from pawnamerica before and have always been more than satisfied. This time was great as always, the item was even better than I expected. Fast shipping and it was well packed. Thanks Pawnamerica."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michele Pignatelli",
          "Nb_Reviews": 6,
          "Date": "2023-12-06T21:34:47.000Z",
          "Titre": "Overall a great purchase",
          "Contenu": "Overall a great purchase. Little scratch on the mini iPad camera, as faithfully reported by Pawn pictures."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Dodds",
          "Nb_Reviews": 3,
          "Date": "2023-12-07T16:37:35.000Z",
          "Titre": "Good place to get clean used computers, good price and service",
          "Contenu": "The people there at Burnsville are great. Good products and services.  I buy quite a few Macbooks and Pawn America is the first place I look.  I've returned a couple (computers were OK, just not what I needed) and it's been no hassle."
        },
        {
          "Note": 5,
          "Lieu": "TG",
          "Pseudo": "AYATEH joan pablo",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T22:02:09.000Z",
          "Titre": "My first time to order a PS4 on this…",
          "Contenu": "My first time to order a PS4 on this site and I can say I'm really satisfied 😁. The item work perfectly and the shipping time was amazing ( 2 days). I'm really satisfied! I recommend it for you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Damein S",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T00:02:14.000Z",
          "Titre": "Skeptical at first but wowed by their customer service.",
          "Contenu": "I was hesitant ordering from Pawn America. I had never heard of it. But I found an item that I couldn’t beat the price on. The day after I ordered I even got an email from them telling me the original box was missing and asked if I still wanted to place the order. I thought this was great customer service and my worry about this place started to decline. Once I got the item. It was completely functional and in amazing condition. I will definitely be offing from American Pawn again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "letsgobrandon",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T23:42:33.000Z",
          "Titre": "Pawn America five stars all the way",
          "Contenu": "Pawn America was professional, accommodating and has fast shipment. Every experience should be as good as the one that I had; five stars all the way!!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 3,
          "Date": "2023-11-24T22:38:50.000Z",
          "Titre": "10 STARS",
          "Contenu": "My experience with Pawn America started when I was a contractor. Always bought my equipment from Pawn America. Received my item in safe packaging . THANK YOU GUYS FOR TAKING CARE OF PACKAGE BEFORE TRANSPORT"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Young",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T21:42:09.000Z",
          "Titre": "The guitar arrived very well packed",
          "Contenu": "The guitar arrived very well packed and protected, nice job. I called and asked them to physically look at the item before buying, and got a really honest answer about its condition… it was spot on. They exceeded my expectations and we’re easy to work with!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T18:46:43.000Z",
          "Titre": "Exactly as described",
          "Contenu": "Came fast, packaged well. Item works perfectly! Description was accurate, all around satisfied with the service and item!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Morgan Hancock",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T00:22:44.000Z",
          "Titre": "Fair price great condition and shipped…",
          "Contenu": "Fair price great condition and shipped quickly. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T04:26:03.000Z",
          "Titre": "Pleased and content",
          "Contenu": "Exactly what I ordered. It was a lot better condition than expected. Very pleased and satisfying experience. Wil purchase again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tjay",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T15:50:19.000Z",
          "Titre": "They were very helpful kind fast and…",
          "Contenu": "They were very helpful kind fast and just all around nice people especially the employee that helped me from start I think his name linard I'm not for sure but great guy all round"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jon",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T12:26:45.000Z",
          "Titre": "Condition of item arrived as described."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Allison Hertz",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T23:33:37.000Z",
          "Titre": "Like brand new perfect working…",
          "Contenu": "Like brand new perfect working conditions my Son wanted a gaming electronics VR and was very pleased with the system the price and the quick shipping this is the third time I have purchased from this company and recommend buying from here and intend on doing future business as well!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T02:58:47.000Z",
          "Titre": "Easy",
          "Contenu": "Easy, Fast transaction and got my order within promised time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mitchell Smith",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T13:05:43.000Z",
          "Titre": "Fair deal, fast shipping, very satisfied",
          "Contenu": "I bought a pretty expensive hunting bow from them and had it shipped all the way to Alabama. It shipped within a day and arrived within a week and it was in perfect condition.  Exactly as described."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shawn Peters",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T16:48:44.000Z",
          "Titre": "Christal is awesome",
          "Contenu": "Christal is awesome. She is always welcoming and  eager to help me each time I come into the Madison store.  I always look forward to seeing her each time I visit Pawn America. I could not be any happier with quality customer service she provides each visit. I will be checking Pawn America in future for pawns and in store purchases.  Thank you all for a pleasant experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ernest Tacsik",
          "Nb_Reviews": 8,
          "Date": "2023-12-01T17:48:27.000Z",
          "Titre": "pleasant, knowledgeable, and helpful staff",
          "Contenu": "pleasant, knowledgeable, and helpful when called ... item arrive fast, well packed, and exactly as advertised and described in the call ...  NO hesitation to recommend !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cliff Hajek",
          "Nb_Reviews": 2,
          "Date": "2023-11-18T03:31:15.000Z",
          "Titre": "The Appleton Wisconsin Pawn America is awesome!",
          "Contenu": "Th experience was very good with the Appleton Pawn America. Actually I got lucky.  Had searched for the item a week prior and it was not there, but checked again, and a week later, and there it was. I made the trip after calling and then paying with paypal before making the quick 30 mile trip and a wonderful young lady had the item waiting. It was all great! Thank you so much! A bass amplifier that I need."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lori",
          "Nb_Reviews": 3,
          "Date": "2023-11-06T16:59:18.000Z",
          "Titre": "I think Pawn America is the Best Place to Shop",
          "Contenu": "I think Pawn America is the best place to shop for jewelry. There is a lot to select from, the prices are reasonable (much more so than the average jeweler), the shipping is free and very fast, you do not pay taxes, and if you have a question, you can call up the store where your merchandise is and ask your question. How could this be any better?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T23:20:56.000Z",
          "Titre": "Fast shipping",
          "Contenu": "Fast shipping. Got exactly what I ordered. No complaints here. :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T02:56:10.000Z",
          "Titre": "Mac Tools ratchet",
          "Contenu": "Item was just as described, at a fair price, with extremely fast shipping! Looking forward to doing business again in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T02:19:46.000Z",
          "Titre": "This place is wonderful!",
          "Contenu": "This place is wonderful!! They ship fast, if it’s something you ended up deciding against they are wonderful at returns. (Sometimes it’s hard to know if you like something until you can actually see, and feel it)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony S",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T22:44:38.000Z",
          "Titre": "Everything is just like it was…",
          "Contenu": "Everything is just like it was described. It arrived sooner than expected and I was satisfied with the overall quality service. I will be doing more business with them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dustin",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T13:43:20.000Z",
          "Titre": "I called the store to make sure the…",
          "Contenu": "I called the store to make sure the item was still available and in the condition the website stated, they were quick & courteous. I ordered the item online, and it arrived the next day. Also it was very nice to have updates sent while it was in transport so I could expect it and have someone bring it into the house. Thanks Pawn America"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Josh",
          "Nb_Reviews": 2,
          "Date": "2023-12-03T03:45:33.000Z",
          "Titre": "Ordered a Nintendo switch game",
          "Contenu": "Ordered a Nintendo switch game online, and I received it quickly. The game works great with no problems. Best of all, even with shipping, the price for the used game was much cheaper than GameStop."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lily Cobham",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T12:25:46.000Z",
          "Titre": "The quality of the watch was great",
          "Contenu": "The quality of the watch was great. The package came to on time. My luck was too small for my wrist. I’m thinking of spending additional $ for a couple of links."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LY",
          "Nb_Reviews": 3,
          "Date": "2023-10-24T05:35:34.000Z",
          "Titre": "So happy I took a chance with this online store!",
          "Contenu": "I was a bit worried about ordering from a pawn retailer because I’ve never shopped in that type of store before. But I’m so glad I took a chance. The items I ordered were authentic and the condition were all as described or better. Shipping was completely free (with a minimum purchase amount) and was super fast too! I will definitely be back!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dongwone Park",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T15:24:00.000Z",
          "Titre": "Hart 40V battery order",
          "Contenu": "The order was delivered on time as promised, and the battery has been working fine so far."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ROCHELLE",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T20:03:41.000Z",
          "Titre": "The controller was in perfect condition…",
          "Contenu": "The controller was in perfect condition and shipping was fast. Thank you Pawn America!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JZ",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T01:25:41.000Z",
          "Titre": "Quick shipping, great deals!",
          "Contenu": "I ordered two separate items from two different locations, and both showed up right away in great condition!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "trujamie",
          "Nb_Reviews": 2,
          "Date": "2023-11-01T03:37:29.000Z",
          "Titre": "Safe online shopping site",
          "Contenu": "I didn’t have to talk to anyone while making my purchase, which was perfect for me. I was a bit nervous spending so much on a website I was unfamiliar with, but the product was exactly as described (cricut maker 3) at an excellent price. Didn’t have to pay for shipping at that price which was a huge plus. Will be shopping this company again."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Tim M",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T20:11:41.000Z",
          "Titre": "The product was better than expected",
          "Contenu": "The product was better than expected, prompt shipping and well wrapped.  I would definitely recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mr Ian Hancock",
          "Nb_Reviews": 2,
          "Date": "2023-11-06T22:35:30.000Z",
          "Titre": "A Great Deal All Round",
          "Contenu": "Fast delivery, well packaged, great price and product was in perfect condition as described. Would highly recommend these guys! This was my first purchase and I will definitely use them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chad",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T04:31:49.000Z",
          "Titre": "Great experience!",
          "Contenu": "Great assistance, fast processing, fast shipping. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T23:34:46.000Z",
          "Titre": "What you see is what you get",
          "Contenu": "This company lists every individual item on their website with pictures, so you can see exactly what you're getting. Got a great deal on a game console and I couldn't be happier!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customerT-Sizzle",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T04:54:27.000Z",
          "Titre": "Truly the\"Deal of the Day\"",
          "Contenu": "Product came with extra items that I wasn't expecting,Wow,what a deal on the camcorder!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 4,
          "Date": "2023-12-12T23:12:54.000Z",
          "Titre": "Easy to order",
          "Contenu": "Easy to order.  Quick shipping, item as described"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Happy Customers",
          "Nb_Reviews": 2,
          "Date": "2023-11-11T22:55:45.000Z",
          "Titre": "We buy from you all the time and your…",
          "Contenu": "We buy from you all the time and your product lives up to it’s presentation. Your prices are fantastic and your shipping and customer service are top notch. I recommend you all the time and remain a happy customer"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "mychal",
          "Nb_Reviews": 3,
          "Date": "2023-12-03T23:43:36.000Z",
          "Titre": "Accurate description of product",
          "Contenu": "Accurate description of product, great selection and great prices. Look no further for quality jewelry."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barry",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T04:13:00.000Z",
          "Titre": "Product was amazing only annoying thing…",
          "Contenu": "Product was amazing only annoying thing is previous owner of the AirPods didn’t remove their iCloud so dumb pops up ever days. Other than that great service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Killian",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T23:01:42.000Z",
          "Titre": "Awesome deal on a Snap-On torque wrench",
          "Contenu": "Bought a Snap-On torque wrench for $250 under the retail price. Thing was brand new, still had shipping oil on the ratchet head. Couldn’t be happier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erin",
          "Nb_Reviews": 2,
          "Date": "2023-10-31T10:38:44.000Z",
          "Titre": "Quick and secure shipping of well…",
          "Contenu": "Quick and secure shipping of well packed item. Great price. Easy to use website and shopping cart experience. Overall, I am pleased and will be checking back regularly for more things to buy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janet",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T01:32:10.000Z",
          "Titre": "Very fast attention given to my return"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wes Waguespack",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T10:25:34.000Z",
          "Titre": "Robert was awesome and so was Kyle.",
          "Contenu": "Robert was awesome.  He took the time to talk through all the questions I had about the camera and the accessories. He pulled the product immediately and it was shipped within two hours.  Kyle was awesome as well. He kept reassuring me that the product was in better condition than I was expecting. The camera and the accessories were all in new condition with no wear, scratches or even fingerprints! When product had been wrapped extremely well and it certainly could not have been damaged in transit.  I could not be any happier with the entire purchase from the service to the condition of the products.  I will be checking Pawn America in future for any online purchases and will not hesitate to recommend them any time the opportunity arises!  Thank you all for a pleasant experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T18:28:52.000Z",
          "Titre": "Very detailed pictures and description",
          "Contenu": "Very detailed pictures and description. Shipping was very quick with a provided tracking number."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T17:23:48.000Z",
          "Titre": "Super fast shipping",
          "Contenu": "Super fast shipping, great product. Thank you!!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa connor",
          "Nb_Reviews": 2,
          "Date": "2023-12-03T22:42:17.000Z",
          "Titre": "My experience with Pawn America was…",
          "Contenu": "My experience with Pawn America was great. I had no problems. Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter Kramer",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T03:49:51.000Z",
          "Titre": "Virtually no lag time prior to…",
          "Contenu": "Virtually no lag time prior to shipping, really well packed, great seller!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Happy Customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T16:59:13.000Z",
          "Titre": "Wow!",
          "Contenu": "Wow. I was not expecting such a seemless and efficient purchasing and shipping operation. That along with the quality product I received means I will be shopping here more often."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jimmy",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T14:07:13.000Z",
          "Titre": "The product arrived as pictured",
          "Contenu": "The product arrived as pictured, and in very good quality too! The shipping for the item was also very fast as well as being straightforward. I would definitely buy something through Pawn America again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thorou",
          "Nb_Reviews": 2,
          "Date": "2023-10-25T04:38:10.000Z",
          "Titre": "Great first experience with Pawn America",
          "Contenu": "After searching online for an Xbox Series S, I came across one from Pawn America that was a good deal. I then called to make sure the details about the item were correct. The call rep I spoke with was pleasant and answered all my questions. He even ensured me that if I had any problems upon receiving the item, to give them a call back and they would take care of it. After making the purchase online, I received a confirmation email that included a tracking number. The item was shipped same day and arrived to me in the exact time frame it was scheduled to be delivered. It came packaged very well with the Xbox in it's original box, packed inside of a larger brown shipping box. The item was just as described and I am very happy with my purchase. I will definitely be doing business with Pawn America in the future after they showed that they do things decently and in order."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cindy Roberts",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T04:35:46.000Z",
          "Titre": "It was easy to place the order and it…",
          "Contenu": "It was easy to place the order and it was delivered a lot quicker than I was expecting. The merchandise we ordered was in great shape and works perfect. Great price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T01:58:46.000Z",
          "Titre": "Fast shipping and well described. Great deal!",
          "Contenu": "It was a truthfully advertised product, at a great price, and shipped quick. What’s not to love?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alex M",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T20:24:41.000Z",
          "Titre": "Awesome experience",
          "Contenu": "Awesome experience! Shipping was fast and the item was exactly as described by the seller. I'll definitely be using pawnamerica again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rose Joseph",
          "Nb_Reviews": 2,
          "Date": "2023-11-06T01:39:18.000Z",
          "Titre": "The camera's quality matched the site's…",
          "Contenu": "The camera's quality matched the site's description, and the packaging was well done. So far, I have no significant complaints, and I hope it continues this way."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Lynn Morris",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T02:40:55.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service.  Quick shipping.  Definitely recommend doing business with them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Taylor Schell",
          "Nb_Reviews": 3,
          "Date": "2023-11-10T03:33:46.000Z",
          "Titre": "They are not like post pawn shops they…",
          "Contenu": "They are not like post pawn shops they aren't focused on getting ur property ill legitimately. Very fair"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "S Matos",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T14:28:30.000Z",
          "Titre": "I have purchased items from Pawn…",
          "Contenu": "I have purchased items from Pawn America and have to say I was very pleased with the items and the speed of delivery. I will definitely be purchasing more from them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Beebe",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T18:40:04.000Z",
          "Titre": "The order was exactly as described and…",
          "Contenu": "The order was exactly as described and packaged very well to protect the guitar. Great price and prompt shipping!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T16:50:54.000Z",
          "Titre": "It arrived fast and everything is set…",
          "Contenu": "It arrived fast and everything is set up....now waiting for Christmas"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Taz",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T04:28:05.000Z",
          "Titre": "Been buying from PA for years",
          "Contenu": "Been buying from PA for years. Price was good the device was in nice condition, and works excellent.  Avoid flea bay, and buy here. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryan S",
          "Nb_Reviews": 3,
          "Date": "2023-11-08T20:27:50.000Z",
          "Titre": "Amazing price that I couldn't find…",
          "Contenu": "Amazing price that I couldn't find anywhere else. The item was as described and came perfectly packaged. Really happy with Pawn America."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T17:38:28.000Z",
          "Titre": "Quick response",
          "Contenu": "Quick response, attentive and rapid delivery. The piece exceeded my expectation!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Don in Savage",
          "Nb_Reviews": 4,
          "Date": "2023-12-10T15:38:54.000Z",
          "Titre": "Good pricing",
          "Contenu": "Good pricing, quick, free shipping & very well packed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mel Arroyo",
          "Nb_Reviews": 6,
          "Date": "2023-11-05T19:51:49.000Z",
          "Titre": "Good deals and great service",
          "Contenu": "I have managed to find what I was looking for on several occasions and at very good prices.  Items are accurately described."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pamela R. Harris",
          "Nb_Reviews": 6,
          "Date": "2023-10-24T01:21:01.000Z",
          "Titre": "I loved the ease of ordering from Pawn…",
          "Contenu": "I loved the ease of ordering from Pawn America. The employees are incredible and helped answer every question I asked. I will definitely order again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William McDowell",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T15:12:25.000Z",
          "Titre": "No problems.",
          "Contenu": "Great product. Carefully wrapped. Arrived in good time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T18:21:34.000Z",
          "Titre": "Excellent experience",
          "Contenu": "Excellent experience. The products were exactly as shown in the picture."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "redblack",
          "Nb_Reviews": 2,
          "Date": "2023-10-23T20:44:09.000Z",
          "Titre": "What a great deal on an apple mouse and keyboard",
          "Contenu": "Found the keyboard in mouse on Google. Was able to retrieve useful information from the website. The keyboard and mouse arrived in fantastic condition in a timely manner. I was completely satisfied.😁"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rich",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T01:19:23.000Z",
          "Titre": "A smooth buying experience with Pawn…",
          "Contenu": "A smooth buying experience with Pawn America. Product was as described and it shipped out fast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "anon but happy",
          "Nb_Reviews": 2,
          "Date": "2023-11-14T21:02:21.000Z",
          "Titre": "Fast shipping, Products as described, Great price",
          "Contenu": "Shipping was pretty fast. Minor issue with one of the products that Kyle helped out with immediately. Products were as described and lots of fun. Thanks dudes!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick S.",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T12:31:54.000Z",
          "Titre": "A very pleasant experience",
          "Contenu": "I found the quality of the item was better than the description and the price was more than fair. I would do business with these folks again. Customer service is spot on !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T00:47:21.000Z",
          "Titre": "Quick and easy…",
          "Contenu": "Bought a ring for my wife online was ready for pickup almost immediately. Fast friendly service. Was a pleasant shopping experience."
        }
      ]
    }
  ]
}