{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.heavys.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Sarah",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T03:31:07.000Z",
          "Titre": "Ordered these in May as a gift",
          "Contenu": "Ordered these in May as a gift. I knew they wouldn’t ship right away. They finally shipped September 26th and as of today (December 18) they are STILL stuck at customs!! Customer service is giving me the run around and refusing to give me a refund and will reship them. I don’t want a reshipment I want my money back! This is ridiculous!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ryan Fuchuck",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T09:00:12.000Z",
          "Titre": "Worst customer service known to the…",
          "Contenu": "Worst customer service known to the business. I ordered them and 10 minutes later decided I didn't want them. Asked to cancel them and they said my order had already shipped from \"Hong Kong\". So what they did was create a shipping label when I asked, because they didn't ship them until 14 days later I asked when my shipment was and then they shipped it... I go to ask to return them after receiving them and nothing?! THIS COMPANY IS A SCAM DON'T USE IT I'D RATE THEM NEGATIVE 100 STARS IF I COULD!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jessamyn Rasmussen",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T15:13:12.000Z",
          "Titre": "Customer service is lacking",
          "Contenu": "The worst experience I’ve had with customer service. The shipping time states 4-6 days. My order took WEEKS to arrive, nearly an entire month."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dean",
          "Nb_Reviews": 3,
          "Date": "2023-11-29T22:56:07.000Z",
          "Titre": "I reported my headphones have NO bass &…",
          "Contenu": "I reported my headphones have NO bass & requested help. All Heavy’s recommended was for me to go & read all the GREAT reviews others have submitted. After I complained about that response they suggested I email them which I did on November 19 2023. Yesterday after they haven’t responded I said in an advertisement their customer service was HORRIBLE. So they BLOCKED me on Facebook & Messenger. My headphones still sound horrible & they are Refusing to help me in any way"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "chad yorio",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T13:43:58.000Z",
          "Titre": "Never received my order ,paid in full…",
          "Contenu": "Never received my order ,paid in full no Christmas present under my tree and I was told to deal with the post office myself to try and get restitution for my loss I can't believe you put it on the customer to go through this process you shipped it it not me All I did was make a purchase it's up to you to get it to me your company is a disappointment and I'm going to let everyone know."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Scott Senius",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T01:50:44.000Z",
          "Titre": "Over-priced,over-hyped.",
          "Contenu": "Over-priced,over-hyped.Get the same or better at the hi-fior gaming shop.Ripped."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Monika Cywinska",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T17:48:05.000Z",
          "Titre": "Package still hasn’t arrived many weeks…",
          "Contenu": "Package still hasn’t arrived many weeks later."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dallan Carly",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T22:12:49.000Z",
          "Titre": "Didnt recieve my shells",
          "Contenu": "Didnt recieve my shells, and the headphones sound like crap. Not not to mention the case zipper came broken. Also the responses ive gotten from heaves on instagram and by email jas not been fruitful, the basically claim that \" other people like them so i do t know why you dont \""
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Joao DeFrias",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T02:31:46.000Z",
          "Titre": "Not happy with the time it took to get…",
          "Contenu": "Not happy with the time it took to get my heavys. I ordered in May and they came in November.I also had to repeatedly mention that I hadn't gotten mine on the Facebook website and communicate numerous times back and forth to get them sent out. When I did get them in the mail my the Canadian post office spelt my name wrong so I had a fiasco there as well and had to pay an additional $80."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tim W",
          "Nb_Reviews": 4,
          "Date": "2023-10-29T18:17:45.000Z",
          "Titre": "Harsh treble, lacking bass, static with Hellblocker mode",
          "Contenu": "I didn't like the sound signature, they were rather harsh in the treble and the bass was lacking, considering the two woofers in each earcup. The Hellblocker mode, or ANC, is rather weak and there's a static sound in the right earcup that you can hear when using Hellblocker. I'm told that there's an app coming that will push through an update to fix that, but there's no ETA for it. So, I'm stuck with headphones I don't like and I cannot sell because they are defective."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mr England",
          "Nb_Reviews": 3,
          "Date": "2023-10-26T21:40:32.000Z",
          "Titre": "Anti climax and poor PR/ Customer service",
          "Contenu": "The headphones I received sounded plain awful. I enquired about a replacement or refund and was told that as I pledged through Kickstarter, I was not entitled to anything. I was quiet an early backer and waited 19 months for the headphones to turn up. Then I found out hundreds of people who paid much much later through heavy’s own website received theirs weeks before early bird backers like myself and they were entitled to refunds/ replacements if faulty. The headphones, just like the company and customer service are bitterly disappointing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "BoJay Labrum",
          "Nb_Reviews": 4,
          "Date": "2023-10-27T01:16:58.000Z",
          "Titre": "Just no",
          "Contenu": "The whole campaign was a mess. The communication on this Kickstarter was awful and extremely misleading. The headphones themselves, when they finally showed up, were near unlistenable and needed immediate EQ to be usable. I wouldn't pay $100 for these, I'm sour that I paid $150, and would never suggest anyone pay retail for these massive pillars of mediocrity to such an awfully ran company. I would give a negative rating if I could and will never recommend anyone use these. Anyone who has any idea about headphones already has a better pair and the company is straight garbage. It would take way too long to recount every bit of ridiculous behavior from start to finish and no one would care if I did."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JdbManalo",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T19:37:21.000Z",
          "Titre": "Can't find any positives.",
          "Contenu": "Delivery of the product was over a year late.  The headphones are very heavy and they are not comfortable to wear for over 10 minutes.  The sound can be described as mushy or muddy.  The voice UI is not only corny but rather annoying and difficult to understand in contrast to the music.  The case both ugly and cumbersome. Even after a full year of delays, this product seems extremely rushed and unpolished."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rollie Layman",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T20:56:39.000Z",
          "Titre": "Heavys does not care about its customers",
          "Contenu": "Heavys does not offer communication to its' customers.  Instead, it opts to keep them in the dark and lie to them about communicating.  Many of the people who initially backed Heavys have yet to receive their headphones, after years of delays and being lied to (we are shipping this month, which is next month, or the month after, or...) - Heavys has not given any update to those Kickstarter backers for three months - just shows Heavys does not care about its customers.  You can buy their new shirts, though, or order headphones through their website, but the headphones customers initially bought and are waiting for have not arrived because, again, this company does not care about its customers.  And the product does not live up to expectations - they sound like mud."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "sean bausert",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T04:46:20.000Z",
          "Titre": "The headphones are terrible",
          "Contenu": "The headphones are terrible. They are very muffled and quite bass heavy. The range is very limited. I expected so much more.  I have a $30 pair of headphones that sound infinitely better. I feel ripped off. The usb cord included is cheap. The headphones are small and uncomfortable on my head. Incredibly disappointed with this inferior product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brode Voigt",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T14:51:45.000Z",
          "Titre": "Customer service was difficult",
          "Contenu": "Customer service was difficult to communicate with and failed to cancel my order before it shipped. Once I received the product everything sounded sludgy and muddled even metal."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vicki Tarbell",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T00:01:38.000Z",
          "Titre": "Nor for everyone. Terrible customer support.",
          "Contenu": "Took a long time to get them, but since it was a new product was understanding. They advertised they put a lot of research into the sound of these headphones, but none into the fit or comfort? I can't enjoy the sound if I can't wear them. They are big and fall off my head with the slightest movement. They are also heavy so that makes it worse. I let the company know my concerns, but nobody got back to me.ETA. After contacting customer support I'm knocking my review down to one star. They absolutely ignored my question and were rude. Too bad I can't return these. I  was excited about the tech, but am totally soured by their customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Taylor Cunningham",
          "Nb_Reviews": 3,
          "Date": "2023-11-02T23:23:56.000Z",
          "Titre": "Still missing items from my order",
          "Contenu": "Still missing items from my order. I wrote to CS and they said they'd send as soon as they're in stock. Looks like they're in stock and nope, still nothing.They're okay headphones. Initially total crap out of the box, but turned out okay after having to turn on equalizers on whatever device I'm listening from. That can stink though because it'll then cap the max volume. The noise resistance is basically non-existent."
        },
        {
          "Note": 1,
          "Lieu": "CL",
          "Pseudo": "Sebastian Fuentes Gonzalez",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T15:18:54.000Z",
          "Titre": "My products have still not arrived",
          "Contenu": "My products have still not arrived, it has been in customs for almost 2 months, no one helps me. I have written to them on several occasions without response or solution"
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Tinna",
          "Nb_Reviews": 3,
          "Date": "2023-11-10T01:07:23.000Z",
          "Titre": "Cheated and angry",
          "Contenu": "I have been waiting for my order [LLQ-SLVTF-630] for 8 months!!!! and it still has not been delivered and they don't answer my emails.  I feel cheated and very angry.Mentira, todo mentira! Refund my money!!Estafadores. Os he dicho mil veces que canceleis mi pedido y me devolváis el dinero! Ya!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Matt Weston",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T02:05:06.000Z",
          "Titre": "Delivery was returned to sender by delivery company, no communication or refund from Heavys",
          "Contenu": "Pre-ordered the headphones, waited a while which was to be expected. Headphones arrive in my country and get held up in customs, long story short i'm waiting on an invoice to pay, i contacted the delivery company and no communication, i contact Heavy's several times to ask them to look into what is going on with this customs charge. after 30 days with no news from Customs or the delivery company the headphones are returned to sender. i contact Heavy's with the provided email for the third time explaining why it is being return asking them to please send them again, no response. via delivery tracking i see the headphones had got back to Heavy's so i send another Email, no response. its been a month now, no response or sign of refund."
        },
        {
          "Note": 1,
          "Lieu": "CH",
          "Pseudo": "Dorfschmied",
          "Nb_Reviews": 2,
          "Date": "2023-10-26T22:41:39.000Z",
          "Titre": "The headphones are really great",
          "Contenu": "The headphones are really great. But the delivery time from order to delivery of three months is definitely far too long. Unfortunately, I had to deal with customer service for days and weeks. But he was very friendly and accommodating."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lee Goltzer",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T06:40:57.000Z",
          "Titre": "Worst headphones I’ve ever had in my…",
          "Contenu": "Worst headphones I’ve ever had in my life. It sounds like children’s $10 headphones. Awful sound quality. Everything you guys say about these headphones is a complete lie. Complete waste of my hard earned money."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "John Parisi",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T16:08:48.000Z",
          "Titre": "After waiting over a month it's just a…",
          "Contenu": "After waiting over a month it's just a useless paper weight,  maximum volume can be compared to a toy headset,  amplify the sound and only get distortion,  complete waste of money, I wish I never clicked on the add."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Adams",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T22:52:52.000Z",
          "Titre": "Took way too long",
          "Contenu": "Took well over a year to get them, and after receiving the headphones, the Bluetooth connection was terrible on a windows computer."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Andrew Lord",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T02:22:47.000Z",
          "Titre": "Never delivered",
          "Contenu": "Unfortunately my order still has not been delivered.  I tried the tracking number, but the website has been offline for months.  Very disappointed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ernie Everett",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T16:53:16.000Z",
          "Titre": "I never received my order",
          "Contenu": "I never received my order. Tried to work with you guys on it was told nothing could be done and I was never refunded."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Christof",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T09:33:57.000Z",
          "Titre": "Ridiculous",
          "Contenu": "Months of delays, deceptive communication, absolutely no transparency for customers and on top of that a horrible product. Pretty brave to then ask for trustpilot reviews. I personally had one of the worst experiences ever in buying a product."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Rafael Cervero",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T22:42:35.000Z",
          "Titre": "so far its been terrible",
          "Contenu": "so far its been terrible, i have been waiting to get the headphones for over 4 months, didnt get anything yet. I got them sent 2 month ago, and i never recived them. No worhty to wait 4 months for headphones"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Idiot for Giving You My Money",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T05:08:49.000Z",
          "Titre": "Your company is shady",
          "Contenu": "Your company is shady. I was sent a notice on August 12 that my item was shipping. Shortly afterward, I received a USPS tracking email. I did not receive my headphones on the day I was supposed to. In fact, the message stated the post office was still waiting to receive the item from heavys. After some back and forth with customer service I was then sent a fabricated screenshot—there were no active links for me to check on the status—stating my headphones would be delivered that day, which was roughly 6 weeks ago. I never got them. When I reached out to customer service again, I was sent a new tracking link that stated UPS was the delivery method, not the USPS: the link pointed me to UPS, but when I clicked on the tracking number it sent me back to my original USPS info, stating my headphones would be delivered by August 23 (that was in the middle of September). I inquired about this and was then told I had to check with customs. But the point of origin was San Leandro: 30 miles from my house. I’m speaking with my credit card company to get my money back and inform them of the company’s shady business practices. This is absolutely one of the most horrible purchasing experiences I’ve ever had."
        },
        {
          "Note": 1,
          "Lieu": "CH",
          "Pseudo": "Laurynas Cukuras",
          "Nb_Reviews": 2,
          "Date": "2023-10-12T09:03:43.000Z",
          "Titre": "Don't expect any support from Heavys",
          "Contenu": "This is not a review of the product, but he company. The reason for that is that more than two years down the line I still have no product to review.My reward was supposedly shipped more than a month ago. I was repeatedly asking for a tracking number and was told that package is in transit and I will receive tracking number in a few days.After a month of waiting - I receive an email saying that Heavys have got a wrong ZIP code. So turns out that my reward wasn't actually in transit.Basically, looks like they have no idea what they are doing and I suspect if anyone needs any support with their product - they will not get any, because the way they runs things now - they will not be around this time next year.Update: 2023-10-12. Still waiting for Heavys to follow it up with me directly."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Justin Comartin",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T17:41:09.000Z",
          "Titre": "Sent them back for replacement over a…",
          "Contenu": "Sent them back for replacement over a month ago. There was a static or white noise in the background of the left ear piece. And honestly was not impressed with the bass at all."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian Mackey",
          "Nb_Reviews": 2,
          "Date": "2023-06-18T03:40:01.000Z",
          "Titre": "Pre-ordered back in December 2022",
          "Contenu": "Pre-ordered back in December 2022, at the time the product was expected to ship in March 2023. March comes and I hear nothing, so I email them and was told shipping was delayed until april. In April they are expecting to ship 10k units. June comes, no word from heavys, I email for an update. Shipping started on april 28th, and I can now expect mine to ship sometime in the next 8 weeks [june-july]. If shipping began on april 28th I'd expect someone to have received these headphones and done a review on them considering how long they have been anticipated.  They are still selling preorder eventhough they are shipping? I imagine they are using the money from preorders to fund advertising to collect more preorders in hopes of never delivering, or not delivering on quality. This company/product is a scam. Do not fall for it. Get your money back before its too late."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Adam Wygocki",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T02:56:00.000Z",
          "Titre": "Stupid crazy delay",
          "Contenu": "Stupid crazy delayWaited several extra months for my headphones.Got sent plenty of email telling me why you're delayed. Guess what, don't care.Too many e-mails, too many \"how'd we do\" emails."
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "Francis Finan",
          "Nb_Reviews": 10,
          "Date": "2023-12-01T13:54:06.000Z",
          "Titre": "Lots of empty and changed promises",
          "Contenu": "Lots of empty and changed promises, one of the first 150 backers on Indiegogo, and still have heard nothing from them in relation to my order, which is already nearly a year later than promised."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dean",
          "Nb_Reviews": 3,
          "Date": "2023-06-30T05:43:48.000Z",
          "Titre": "I ordered 2 sets February 3rd & haven’t…",
          "Contenu": "I ordered 2 sets February 3rd & haven’t received anything at all. No updates on my order status or anything. Very Poor customer service."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Robert St.",
          "Nb_Reviews": 3,
          "Date": "2023-11-08T09:26:48.000Z",
          "Titre": "Getting started seems to be a struggle",
          "Contenu": "Long leadtimes, poor communication and response to questions. Product ist great, never the less"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Mason",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T22:00:47.000Z",
          "Titre": "NO BASS",
          "Contenu": "NO BASS! Fair mid and high range, but no bass. My Bose QC 45's have more bass. Only thing these Heavys may have going for them is more volume than the 45's. And with no bass, the increased volume is not enjoyable. And they are heavier than the 45's as well. Not worth it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Timothy feeley",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T22:58:51.000Z",
          "Titre": "Never received the item",
          "Contenu": "Never received the item. Contacted you as well as the postal service. No answers"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Julian Louis Spaan",
          "Nb_Reviews": 2,
          "Date": "2023-11-18T09:38:02.000Z",
          "Titre": "Never got my order",
          "Contenu": "Never got my order, no feed back or communication, NO CLUE"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Andrew",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T13:09:45.000Z",
          "Titre": "i complete waste of money tottaly crap…",
          "Contenu": "i complete waste of money tottaly crap don't waste your money"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "J B",
          "Nb_Reviews": 8,
          "Date": "2023-10-30T18:48:51.000Z",
          "Titre": "Two stars for the product, minus ten for the customer service",
          "Contenu": "I was one of the early backers on Kickstarter. I will not talk about the process from day one until shipping had begun. This is irrelevant for my review.It took them over 5 months from „your headphones are ready for shipment“ until we actually received them. During that time the pi**-poor communication skills and the arrogance of the so-called customer service showed the sad truth behind heavys: as long as they get their money, those who pay it and their rights or feelings don’t matter. Whatsoever. We didn’t get a functioning tracking number and our package ended up in a holding facility - which resulted in almost 30€ of additional fees. Thank you heavys! On top of customs, not customs as such.The headphones themselves are quite good, although the hell blocker is a non functional joke of a sales pitch. It literally doesn’t do anything. On both pairs we ordered…I have no urge to contact the people at heavys again to be ridiculed and pi**ed off. I will sell mine, I simply do not want to endorse this brand at all. Creating a good product isn’t everything. Throughout their journey the people at heavys have forgotten who they owe their initial success to. Sad quintessence of almost 2 years of waiting.EDIT: Heavy's: your message is the most generic blabla and actually quite appalling. Too little, too late. No one cared when it mattered the most. Why should I waste my time on this now?As I said, I will not endorse your brand anymore and you have lost the faith and support of an entire group of people over here. The people who had the displeasure to be in contact with your so-called customer support on Kickstarter all report the same - as clearly visible on here. I would fire them straight away. If the headphones would work well at least, that'd be one thing but those things are not anywhere near what was promised, way too big and heavy and the most appealing function - for me and my husband - the hellblocker - is just a nice word you implemented. No function.But whatever I am writing here will not change anything anyways. You've \"made it\". Your brand is out there and there are enough people (ohhh wheee: famous ones, too!) endorsing and celebrating you. Congrats. Why on earth should this matter to you at this point?I don't like being held for stupid. You could have helped when I had asked you for help. Instead I was ridiculed and actively ignored. You showed a very ugly face throughout the process. So: no thanks Heavy's. I'm very much done with you."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vicki",
          "Nb_Reviews": 2,
          "Date": "2023-06-16T09:19:08.000Z",
          "Titre": "These headphones have been \"ready to…",
          "Contenu": "These headphones have been \"ready to start shipping\" for over a year now.They have had my money, but I have no headphones. They simply don't exist."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Frank Giunta",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T03:18:37.000Z",
          "Titre": "The sound quality is so poor I think…",
          "Contenu": "The sound quality is so poor I think they may be broken."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Kudos",
          "Nb_Reviews": 35,
          "Date": "2022-09-17T08:31:25.000Z",
          "Titre": "Buyer beware",
          "Contenu": "This is not a finished product. Industrial design was stated as completed in Dec 2021 but they are still prototyping now.I have serious doubts they will meet a Feb '23 delivery perhaps even ever deliver anything and the product has not been released for review to any trusted third party so there is no honest third party feedback.Some comments from their backersKudos2 minutes agoWhen you launched the compaign in January it was with the statement that \"Industrial Design was complete\".In May \"Manufacturing for Headphones + Travel Case is on track\".At the end of June \"We are expecting the first samples with the final CMF to be ready by mid-July.\"In September \"we are in the prototype stage\" but the delay is a \"supply chain\" issue.You don't seem to be able to articulate what is going on and I have no idea what the status of the product is. As far as I can tell you're still prototyping the design.Wes Ewingabout 6 hours agoProgress is progress! Good reminder about supply chain challenges. My prediction is that these may start to ship in 2023 Q1. Only time will tell.Stephen DisneySuperbackerabout 6 hours agoGuys... Cross your fingers for Summer 2023... Calling it.Vulkandrabout 7 hours agoSo are we still on track for November 17th? Because i assumed the delay was to make sure production is done by mid October and they can arrive by mid November, but by the looks of things, full production hasn't even started and we're halfway through September. This is very little time to still be adjusting the hinge and sound and still production done for a November release. We going to get another delay at the start of November?Chris Mascatelloabout 8 hours agoI can't help but be concerned that we are still WAYS away from shipping product. These seem like mid-Beta stage tweaks coming out of the R&D shop via 3D printing. Head-clamp pressure increase via the main headband, modified hinges, and physical EQ plates are not simple adjustments and would certainly need to clear at least one round of QC manufacturing in China before being \"locked\". While these tweaks will be beneficial to the finished product and see us all from getting pre-Beta-grade units as the \"finished\" product, I do think we need and deserve a truthful update on the production schedule.Gerald Habout 8 hours agoThanks for the Update and unfortunately I agree with Chris. You are working on the weakest points, which are the hinges, but also want to change the pressure of the head-clamp, which will make the hinges weak again. Also the video just stopped after 3:46 when Axel was talking about the PCB?!?! November 2022 is very challanging goal for the shipment, also it is black friday and something following on a monday, meaning the chaotic global shipment will get more crazy.Gal Langfordabout 8 hours agoI unfortunately am also agreeing on this. I feel like the updates are not consistent, I understand things change, but I can't help but being skeptical, I backed this project for a promise for an amazing cutting edge product, I hope we will actually get it, I am a little concerned for what our friends are saying here."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "J.S.",
          "Nb_Reviews": 2,
          "Date": "2023-11-05T19:47:10.000Z",
          "Titre": "Not worth the 1,5 years of waiting"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Phillip nett",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T21:48:48.000Z",
          "Titre": "Never received my package"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Ben Stevens",
          "Nb_Reviews": 2,
          "Date": "2023-10-26T22:39:09.000Z",
          "Titre": "The headphones were crap so I sold them👌🏻"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "j.",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T13:26:54.000Z",
          "Titre": "hasn't come after 2 years"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bucket List Restaurant Bar",
          "Nb_Reviews": 3,
          "Date": "2023-10-26T03:46:40.000Z",
          "Titre": "One pair works second has no sound!"
        },
        {
          "Note": 1,
          "Lieu": "CH",
          "Pseudo": "..",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T11:32:54.000Z",
          "Titre": "....",
          "Contenu": "Dont lie!!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "denney fischel",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T15:26:37.000Z",
          "Titre": "The sound is great but there are a few…",
          "Contenu": "The sound is great but there are a few flaws.     Ok the smallest setting, They are a little big for my head.  They also don’t breathe so when I’m done working out there’s almost a pool of sweat inside of them, over time I can see that becoming a problem     Also there’s no marker of how much charge they have.   My previous headphones would say upon turning them on….”40% battery remaining”."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ken Jones",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T14:46:35.000Z",
          "Titre": "Headphones not as advertised",
          "Contenu": "Headphones not as advertised.  These are designed for Rap, not heavy metal. All muffled,  no mids or highs. Symphonic Metal or Progressive Metal sounds really bad."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Summer",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T18:18:29.000Z",
          "Titre": "I had high hopes for these headphones…",
          "Contenu": "I had high hopes for these headphones but sadly they don't sound any better than my old $40.00 JBLs. The volume isn't loud enough unless I turn it all the way up to the \"red zone\" These headphones are very large and bulky. I am an average size woman and if I do any head banging at all (or even running) they would fall off. The Only thing I do like about them is that the ear piece is very comfortable."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "DICK COX",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T20:51:03.000Z",
          "Titre": "HEAVYS?.....more like feather weights.",
          "Contenu": "First off, I was charged for UPS shipping,they arrived via usps without alerting me with tracking no#,left on my door step, miracle they weren't stolen. 2. They're not loud enough,Samsung S7 tablet cranked,still couldn't \"get off \" very disappointed. I will try them with a device with a higher output level. And append my review. Depth of bass, spatial separation,severely lacking, I was expecting the crunchy distorted midrange tones to be emphasized and tweaked because this is where most headphones fall flat, my floyd rose EP150 open box for $30 sound better and have the output to get the job done.  However, they do shine when playing guitar through amp/cab stimulators,   this is where they will find a home with me.  As of yet no one has invented a headset for metal that \"gets us off\""
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "Kalle Brusewitz",
          "Nb_Reviews": 4,
          "Date": "2023-12-21T08:16:53.000Z",
          "Titre": "Allright but not worth the fuzz",
          "Contenu": "The headphones are allright, not that great. The ANC broke down after a week and i'm waiting several months now for an app that will fix the problem. Their communication is very bad and they do not answer or keep saying things like 'this month, for sure'. Month after month. Again and again. For the money there are better headphones. Dont buy them."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Violet Rotella",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T19:42:34.000Z",
          "Titre": "Very Slow Delviery",
          "Contenu": "Our son loves the head phones.  However, we ordered on September 23, 2023 well before his birthday and advised that we wanted them delivered in time for his October 6, day.  However, he didn't receive it until late October.  We traced serveral times for delivery and received nothing but allusive information from Heavys."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ryan Loper",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T05:55:59.000Z",
          "Titre": "No idea how they’re rated so high",
          "Contenu": "I was very excited to get these. I received them today, charged them fully and connected them to my iPhone via Bluetooth.The only way I can describe the way these sound is it sounds like you’re listening to music under water. There’s no highs, minimal bass and nearly all the sound is mids. It’s terribly muffled, bland and just blah. Even turning them up to max volume was muted at best. Unfortunately a very underwhelming experience.Even different EQ settings on my iPhone did nothing to make them sound better.The one positive thing I can say about them is the build quality seems very high on the headphones and the case, but what’s that matter if they just don’t sound good?I replaced a broken (very hard use over years) pair of Skullcandy Hesh 3’s with these. The Hesh 3’s were amazing. These, not so much. I will be returning my Heavy’s and have already replaced them with a new pair of Skullcandy Crusher ANC2’s.The difference is night and day and they come with an app that allows you to customize the sound of the headphones completely.I wanted these to be good, but they just weren’t. MAYBE I got a bad pair? No way to know I guess."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Micah Waldroop",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T14:51:36.000Z",
          "Titre": "They are a huge disappointment as the…",
          "Contenu": "They are a huge disappointment as the sound quality is no better than much cheaper brands of headphones.  The voice when they are turned on/off/HB is super annoying and completely unnecessary.  They definitely aren't worth what I paid for them or the almost year wait to receive them.  The protective case is the best feature for the product though which is why I gave a 2 star rating rather than a 1 star rating."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brickwalker",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T23:39:35.000Z",
          "Titre": "Unimpressed with the sound quality out…",
          "Contenu": "Unimpressed with the sound quality out of the box, expected more out of a \"metal-tuned\" set of headphones. Was hoping for some punchy/deep low end and a crisp high end. I can only describe the experience as generally dull.On a more positive note, they're very comfortable and I love the use of actual buttons & switches for controls. Not a fan of the touch controls on other ANC Headphone options."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nicki Zabel",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T22:14:48.000Z",
          "Titre": "Was extremely disappointed in the…",
          "Contenu": "Was extremely disappointed in the volume level, or lack thereof. The sound quality is good, they were comfortable but my cheap pair of sonys with a dac achieve the same results. I will be returning..."
        },
        {
          "Note": 2,
          "Lieu": "NO",
          "Pseudo": "Tor Erik Hågensen",
          "Nb_Reviews": 2,
          "Date": "2023-11-07T22:06:25.000Z",
          "Titre": "Wow, they came before Christmas",
          "Contenu": "It's been a struggle. Given all my info correct all the way, yet I've gotten email upon email about updating delivery info.Wonder why not all headphones came the way it was pictured from the factory, with foam inside the carton.Bluetooth function could have been more cleverly done.Didn't think I'd receive the headphones, must be the last one to receive them. It's november 7th, 2023.Maybe I'll receive the shells next year.Ear pads very wrinkled, compared to ones other have received. I'll try to use steam to fix problem.I understand the trouble with delivery and the logistics behind this new brand.But the experience of receiving them was not quite as expected."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Thomas Lippstock",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T02:59:47.000Z",
          "Titre": "Customer service and product = So so",
          "Contenu": "I had reached out a few times asking to change my order to add another pair, but after 2 E-Mails, I didnt receive any more replies from customer service.As for the product, the headphones are ok.  But I wanted them for walking.  You really need an equalizer to truly hear the sound quality.  I wish heavy’s had an app that had an equalizer that could see my iTunes library."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Jan Schidlowski",
          "Nb_Reviews": 3,
          "Date": "2023-10-30T08:54:56.000Z",
          "Titre": "As a backpacker it was a time of…",
          "Contenu": "As a backpacker it was a time of complete horrible communication ober news. People now may have No Problems anymore because you fixed your problems. I really thought about 1 star because you made so many angry. Next time tell the truth from beginning. The headphones are Solid build but dont look like they should do from the first picture. Handling ist nice and they fit well. But the great sound and the loudness i miss. Some songs really sound great in HD or ultra HD quality but mostly i am dissapointed"
        },
        {
          "Note": 2,
          "Lieu": "BE",
          "Pseudo": "Remko Eeckhout",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T14:57:26.000Z",
          "Titre": "\"Sound letdown and Price Punch\"",
          "Contenu": "These headphones, they're not living up to the promises and claims. The marketing had me thinking I'd be getting some top-notch sound (for this price-range in headphones), but, truth be told, they've left me feeling a bit scammed. And let me tell you, as a bassist, the disappointment is real.I was pumped about these headphones, thinking they'd give me that high-resolution sound without burning a hole in my pocket. But nope, wrong call. The bass, especially in metal music, is all over the place - messy and muffled. It's like they're missing the memo on what good bass should sound like.And can we talk about the price? It's way off the mark for what you're getting. I was expecting a sweet deal, but now I'm just regretting the whole purchase. The sound quality, especially in the bass, is just not cutting it, and to top it off, it feels like they slapped on an extra cost for no good reason.I was hoping for that perfect combo of affordable and killer sound, but these headphones missed the mark big time. As a bassist, I need that low end to hit just right, and these headphones are nowhere close. It's like gearing up for an epic bass solo and getting a lackluster rumble instead.If you're into music, especially the heavy stuff, these headphones might not be your best bet. The sound quality is a miss, and the price feels like a punch in the gut. Save yourself the disappointment and look elsewhere if you're after a truly immersive audio experience.In general, I think Heavys is more about marketing than really delivering improvement on listening experience for metalheads...Hopefully, @Heavys, can you fix the sound issues with a decent app. I am truly not the only one with this issue... A decent equalizer to balance the sound"
        },
        {
          "Note": 2,
          "Lieu": "ES",
          "Pseudo": "Neil Dodds",
          "Nb_Reviews": 2,
          "Date": "2023-10-30T11:34:47.000Z",
          "Titre": "Good product, delivery conditions poor",
          "Contenu": "Good product, however the delivery method meant I was stung for a 50€ tax demand before the Mail service would hand over my headphones.Mail service said the paperwork had not been done correctly at the despatch point.....quite an unpleasant hidden cost to shoulder."
        },
        {
          "Note": 2,
          "Lieu": "ES",
          "Pseudo": "Jordi Vila",
          "Nb_Reviews": 2,
          "Date": "2023-10-30T17:19:11.000Z",
          "Titre": "- Customs to expensive and the…",
          "Contenu": "- Looks like a brutal headphones, brutal sound, all brutal but at the end is produced out of CEE.- The packaging for a headphones over 350 EUR i ntotal are very poor.- Customs to expensive and the information is not very accesible. If I know that I must pay 87 EUR more and write 1000 papers for customs obviously I wouldn't take the order.- Delivery time to recieve the headphones is about 4 month.- When you leave the Headphones in ON only close the Headphones when the battery finish.- The volume is not acceptable, low at high volume,  and quality can be the same as a good headphones without pay totally 350 EUR."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "phil",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T17:11:04.000Z",
          "Titre": "LATE SHIPPING!!",
          "Contenu": "The super late shipping was a real pain in *** not telling anyone what was going on built a lot a mistrust and impatience from the community for sure. I waited 9 months total 5 more than supposed to. The product itself is not bad for the price I paid for. They are bulky as hell and heavy. I don’t see the difference with or without the hellblocker mode… the sound is great, i feel that it could go a tiny bit louder. The battery is impressive I guess it’s not too much of a surprise considering the size of that thing… over all I’m ok satisfied with the product, the big thing for me was being told : we start shipping next week, we will ship soon, it’s coming soon, just wait a little longer etc.. without any follow up on these promises…. It felt like a big **** *** to all the financial supporters."
        },
        {
          "Note": 2,
          "Lieu": "CH",
          "Pseudo": "A Kickstarter Baker",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T17:21:59.000Z",
          "Titre": "Communication by the company isn’t very…",
          "Contenu": "Communication by the company isn’t very good. The headphones would be fixable but the tuning isn’t really that good out of the box.Edit: It wasn’t just during shipment.There just wasn’t enough communication during the campaign and even now the last update was from July.If you read in the comments of the campaign (THE official place of communication) a lot of replies are apparently happening on Facebook but the company is absent in the comments.The most replies are coming from a backer which payed for the product and is now doing the communication on the  official Kickstarter page, for free!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "erik y",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T18:55:22.000Z",
          "Titre": "Sound great, backing process terrible",
          "Contenu": "This should be two reviews.  My review for the  sound by itself would be 4 stars.  Just regarding the  way the  headphones sound:sound is nice but no better or worse than some high end Sony or Bose. Certainly don't live up to the  unrealistic hype.  The fit is ok not as snug as you would like  they have a tendency to  slide down. The fact they don't include an ac adapter considering how much they got through the backing process seems a bit cheap. Second part of the  review backing process sucked.   All that hype and promise and it took a year to deliver."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Thomas Kratochwill",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T16:27:08.000Z",
          "Titre": "Confusion",
          "Contenu": "Got an email where it said in the next 7 to 10 days its here but in that time  nothing happend then 8 days later i got another email where it said now its on its way to me so good to know but next time send it away after the first email"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "James Lutes",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T18:53:42.000Z",
          "Titre": "Sounds muffled like a cassette with…",
          "Contenu": "Sounds muffled like a cassette with Dolby NR activated. Volume is way too low when wired.  \"Hellblocker activated\" voice sounds childish and I wish I could turn it off"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Emma Hughes",
          "Nb_Reviews": 8,
          "Date": "2023-11-02T23:46:27.000Z",
          "Titre": "Terrible sound and took forever",
          "Contenu": "Terrible sound and took forever. Original backer on KS here and it felt like we were never going to get them. When they arrived they sound awful and muddy. I should not have to use EQ to make them sound halfway decent at this price point. Not worth the time or money."
        },
        {
          "Note": 2,
          "Lieu": "CH",
          "Pseudo": "Laurynas Cukuras",
          "Nb_Reviews": 2,
          "Date": "2023-10-30T20:50:58.000Z",
          "Titre": "H1H review, not the company",
          "Contenu": "So more than two years and 215EUR down the line... the very first impressions are... meh, just meh.- \"The voice\" gimmick pissed me off in the first 5 minutes of use: it's too loud and pointless, just a gimmick, irritating myself and everyone around me.- 3.5 to 2.5 jack change was a dick move.- Why did they even bother with an AUX connection? With power off or on they sound muddy and thick as pig dung (this is not the word I wanted to use, but Trustpilot censored that).- BT is somewhat better. Cycling through different available A2DP codecs the sound is salvageable. Will have to try some EQ or wait for the app.- USB-C (I'm using my own 240W rated cable. Didn't even unpack the one it came with) is comparable to BT.So was it worth the money and the wait? No, not really... in this price range anyone can get a pair of decent headphones that perform as well, if not better, with arguably better \"user interface\" and customer support, and with added benefit of not having to waist 2 years.Update 2023-10-30I've been listening to metal for 3 decades and all of a sudden, according to Heavys, I don't know what metal is suppose to sound like? Well I'm sure metal is not suppose to sound like whatever comes out of H1H, thats for sure."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ronen",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T19:23:24.000Z",
          "Titre": "Disappointing conduct",
          "Contenu": "The headphones themselves have been fine. I expected to be a bit more wowed given the hype, but I suppose that's on me for buying into it a bit too much. Out of the box they sounded pretty muddled, but thankfully they sounded much better after using an equalizer. Still, not what you'd want from a set of headphones supposedly designed for exactly the type of music you're using them for.On the other hand, the way that Heavys conducted themselves over the course of fulfilling their Kickstarter campaign only became more disappointing over time. I'm not even upset by the delays (every campaign these days suffers from them), but rather that they'd only announce them as they missed their own deadlines. At some point (backer update #24 on Kickstarter), they even admitted that the process typically takes 2-3 years, yet for some reason thought their \"optimism\" would make fulfillment within a year realistic. I'm not sure how many crowdfunding campaign runners need to hear it, but backers don't want optimistic timelines, we want realistic ones. I'd rather be told upfront that something will take 2-3 years to happen and be happily surprised if it comes in a little sooner than have the timeline pushed back over and over. Even over the course of shipping they've done so, saying first that everything will ship over the course of April to June. Then the next month for sure. Then the next. Come October 2023, there are still campaign backers who don't have their headphones and there's been no communication from the campaign since July. Not to mention that people who purchased via retail were getting their headphones before many backers. And they refused to give the actual numbers of units shipped/delivered, apparently proprietary information. I've had more than one other crowdfunding campaign (ones that were much larger than this one) able to give updates every 2 weeks (even if there wasn't much to say) and even tell backers how many units were processed and delivered in each region.Heavys could've kept a lot of goodwill by just being honest about the effort it'd take them to develop and ship. They only celebrated successes (that mainly came from early reviewers/people who got lucky enough to actually get their headphones delivered on time), but refuse to face their failures and admit them. The final product is ok (and when's the app coming?), but after this campaign, they sure won't be getting me as a return customer."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Will",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T20:13:40.000Z",
          "Titre": "Where's the Bass",
          "Contenu": "Where's the Bass? That's it. Metal Music has Bass and these fail in that field. Skullcandy is still the best in sound for my experience."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chris Ouellette",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T14:16:48.000Z",
          "Titre": "Gives me vertigo",
          "Contenu": "These headphones make me dizzy. They make me feel nauseous. Can I get a refund or does someone want to buy them from me?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Martin L Alvarado",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T23:56:44.000Z",
          "Titre": "Well I'm still waiting for the second order",
          "Contenu": "Well I'm still waiting for the shells,,,SIMPHONY X,,,I ordered and I don't recibed yet"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Immy Verrocchi",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T02:58:36.000Z",
          "Titre": "When I use the cord instead of…",
          "Contenu": "When I use the cord instead of Bluetooth the sound only comes out of one ear."
        },
        {
          "Note": 3,
          "Lieu": "BR",
          "Pseudo": "Rafael Dezordi",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T15:34:24.000Z",
          "Titre": "This review is not for the product itself, but for the delivery.…",
          "Contenu": "This review is not for the product itself, but for the delivery of it. I purchased the headphones on Black Friday, with the assumption it would be delivered before December 15, day I went abroad for my holidays. On the website, it said 5 to 10 business days. Heavys uses a company called Asendia. Their Honk Kong branch shipped my headphones to France, instead of Canada. Their tracking system is horrendous, without updates for weeks at a time. My headphones have finally arrived in Canada and I’m abroad. I was able to contact Heavys customer service and they have been very helpful, reason why I updated my review from one star to three stars. Once I actually wear it, I will update the review once again."
        },
        {
          "Note": 3,
          "Lieu": "JP",
          "Pseudo": "Lothar",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T16:00:38.000Z",
          "Titre": "- Industry-leading music sound, though some surgery required",
          "Contenu": "- Industry-leading music sound- Active noise cancelling inferior to current products from Sony and Bose - really sad considering the Sennheiser legacy- Surprise about noise cancelling to the outside: people around me complain that too much \"noise\" gets out even when headset volume is moderate- I love the individualization options to my favorite band- Overall a great start- Minor detail: international shipment logistics suck -  upfront fees PLUS post hoc fees from Fedex"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Will Foster",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T22:43:41.000Z",
          "Titre": "Loud but crap sound quality",
          "Contenu": "They are loud, but the quality of sound is not that great. I have $150 headphones that are just as loud and have tons better quality of sound. The customer service is garbage.They first sent me a defective pair, and took a four month war, trashing them on all their social media posts to get a new pair. If you've owned $250-350 pairs of headphones before, you won't want these. They don't measure up, $125-150 at best is all they're worth."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "ABirner",
          "Nb_Reviews": 6,
          "Date": "2023-12-18T20:05:03.000Z",
          "Titre": "The Best ?",
          "Contenu": "no audible effect when turning on the ANC. The parallel television sound, the sound of the lawn mower or a motorcycle driving past, was only subtly muffled. The maximum volume wasn't outstanding either. When it comes to ANC, the Sennheiser momentum 4, Bayerdynamic Amiron or Sony WH-1000XM4 headphones used for comparison performed significantly better. Except for the Sennheiser, the volume was significantly higher on the other two comparison devices."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dennis Head",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T19:32:52.000Z",
          "Titre": "Not impressed",
          "Contenu": "They really don’t seem any louder than the others I have , I actually have some $20 headphones that are louder ??"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Donna Winstead",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T04:54:58.000Z",
          "Titre": "Sound is not what I was expecting for…",
          "Contenu": "Sound is not what I was expecting for \"heavy metal\" music. Sound is flat, there is no feel to the music. I give 3 stars for headphone comfort and quality and for packaging. I liking will be returning them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Taylor Slayton",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T06:41:09.000Z",
          "Titre": "Hopefully the EQ in the App will fix the sound",
          "Contenu": "Sound is super flat, not terrible but not what they make it seem like in the ads, supposedly there is an App coming out that lets you work with the equalizer. Could be a game changer. Also took over 3 weeks to get them in the mail."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charles Luck",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T23:30:01.000Z",
          "Titre": "Love the headphones",
          "Contenu": "Love the headphones, but absolutely no instructions? No information on how to properly charge them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Grant Pederson",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T19:59:15.000Z",
          "Titre": "Nothing special",
          "Contenu": "The quality is what should be expected at the price point.  Sound isolation is slightly better than expected but volume just isnt there.  I have some OG Beats that get way louder and keep the bass relatively clean without much distortion of the sound.I also practically forgot I ordered these things - thought the company was a scam because I kept seeing ad's but never getting a delivery."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "JFM",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T08:12:46.000Z",
          "Titre": "Heavy’s H1H are OK",
          "Contenu": "H1H sounds good, but they are not the expected revolution that would reveal new notes in Heavy Metal songs I listen to everyday. They are good headphones for a 200$ price point. Two issues with H1H : Engaging Hell Blocker mode results in static noises make Hell Blocker unusable. Second, plugging them require a 2.5mm-3.5mm micro cable (like SH Headphoens), it degrades sounds quality vs Bluetooth (?!?) and brings inconsistent sound from left and right until you find the sweet spot for the headphone ends (2.5mm). On mine or it is stopping a bit before the cable can be inserted completely."
        },
        {
          "Note": 3,
          "Lieu": "EE",
          "Pseudo": "Alar Laan",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T11:21:30.000Z",
          "Titre": "Battery lifetime unexpectedly short",
          "Contenu": "Battery lifetime unexpectedly short. I use them to listen music approx 18h a day whit about 80% volume level. Some days they doesn't last even that. The overall rest is good, considering I never had decent pair of headphones to compare."
        },
        {
          "Note": 3,
          "Lieu": "IL",
          "Pseudo": "Vadim Gorodetsky",
          "Nb_Reviews": 3,
          "Date": "2023-10-26T08:52:32.000Z",
          "Titre": "Despite the hype, the experience is far from comfortable or enjoyable.",
          "Contenu": "Despite the hype, the sound quality is nothing extraordinary and even subpar in many cases. Yes, as promised, they are loud and banging, but that's a stigma that metalheads want just that, not really a reality. I was hoping for clarity of sound and wide range of frequencies, where everything isn't drown in bass. Unfortunatelly, that's not the case here, as the bass still swallows everything and the \"being in concert\" feature of spatial sound detracts from the experience more than its worth. On top of that, the earphones are literally heavy on the head, cumbersome and not very comfortable."
        },
        {
          "Note": 3,
          "Lieu": "CH",
          "Pseudo": "Raphael Cordon",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T21:41:03.000Z",
          "Titre": "Nice sound, bad comfort",
          "Contenu": "Speakers are great, battery is very long, but the earphone isn’t comfortable to wear outside. Running or working out is just not doable.I still have my old earphone around, it’s quite weird using two earphones, but… Heavys wasn’t able to fulfill all the aspects I expected."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Don.",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T18:11:46.000Z",
          "Titre": "Alert voice is a piece of trash that pollutes the sound environment",
          "Contenu": "5 stars for Heavys H1H sound, especially for lossy sound like youtube. I almost don't need EQ for that.1 star for its alert voice, It's a piece of trash that pollutes the sound environment but H1H does not have any way to get rid of."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Bryce Galbraith",
          "Nb_Reviews": 2,
          "Date": "2023-11-02T23:23:18.000Z",
          "Titre": "Not cheap for what you get",
          "Contenu": "Good build quality. Decent noise canceling (could be better) great mic for taking phone calls. Sound quality is decent and they don't go very loud. For the cost I'm a little disappointed, was really looking for to some bonecrushing metal to sounds as they say it is supposed to."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bob Stach",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T19:06:26.000Z",
          "Titre": "Not worth 300$",
          "Contenu": "Value for money I don't think these are worth 300$ at full retail. 200$ tops is what I'd spend on these headphones.Sound quality is decent but I think they sounded best via USB-C to PC with a 3rd party audio enhancer like Windows Sonic. Music and movies sound good but as soon as you get to about 75% max volume you get distortions in the audio.The 4 speakers is a little gimmicky to be honest. I've had other multi speaker headphones in the past and they were the same. It's just too hard to differentiate the different speakers with them so close to your ears.You have to be a little carefully when pulling the headset off your head cause the small tweeters can catch your ear.All in all I just can't justify 300$ price point when there are way more feature packed headphones out there for cheaper."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "DW",
          "Nb_Reviews": 19,
          "Date": "2023-11-06T14:49:45.000Z",
          "Titre": "I was curious about HEAVYS' novel approach",
          "Contenu": "I was curious about HEAVYS' novel approach to its design and, as a fan of Sennheiser headphones, backed the project due to Axel Grell's involvement in its design.I must say, out of the box, I found the HEAVYS H1H too dark, with some muddying of the low-end, possibly due to the way it was tuned, affecting the mid and higher frequencies. As such, EQ is essential, and once a relatively flat response with a slight bass shelf is dialled in, the outcome is quite satisfactory - they will also go quite loud! However, not having a dedicated app (for mobile use) with EQ is a bit of a blow.On a more positive note, the user interface is great, they are comfortable, folds to a compact size for travelling, and have superb battery life. The build quality is good too. However, one could do without the power on-off confirmation, which may be replaced by a simple two-tone notification.Is a mobile app (for Android 8.0+ and iOS) on the horizon? Now that will be a very useful feature."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Spencera",
          "Nb_Reviews": 6,
          "Date": "2023-10-29T23:50:58.000Z",
          "Titre": "Just Meh.",
          "Contenu": "HEAVYS look and feel awesome, come with a really nice case and are packaged well. Unfortunately, thats all the cons for me. Way to much bass for my enjoyment. The voice inside that says \"power on\", \"battery high\" etc. is uncomfortably loud. Don't notice any difference with 'Hell Blocker', and the switch is poorly placed sharing a 3-way with the power on/off. Headphone shells always look greasy cause of the matte style plastic. Overall quite disappointed and will be selling them.Sennheiser's have always been my go-to, so seeing a guy like Axel Grell designing these got my hopes up. Oh well.This is review is based my preferences and my hearing, Heavys are not poor quality, but they aren't for me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dean",
          "Nb_Reviews": 3,
          "Date": "2023-10-30T05:03:29.000Z",
          "Titre": "Aggravation",
          "Contenu": "They sound nice & clean but lack any ooomph. I had to but a iFi hip dac amplifier to enjoy them on the road but after 3 songs they go quiet. FRUSTRATING!!! At home they sound Awesome connected to my 2ch receiver but the 1/4” to 3.5mm to 2.5 mm reducing makes shorting sounds so I basically bought 2 sets for $500 that I can’t enjoy"
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "Red Fish",
          "Nb_Reviews": 3,
          "Date": "2023-11-08T19:01:28.000Z",
          "Titre": "Good product, bad company",
          "Contenu": "Product is good for a value of around 150-200 euro’s. Customer service is crap! They abandoned their original backers who are still waiting for their headphones. They lack to respond on kickstarter."
        },
        {
          "Note": 3,
          "Lieu": "BE",
          "Pseudo": "Emanuele Morozzi",
          "Nb_Reviews": 4,
          "Date": "2023-10-30T02:09:43.000Z",
          "Titre": "For the moment, too many issues to be considered a good product",
          "Contenu": "I have received the headphones some week ago. First, I have something to say about the delivery: they shipped to Belgium more or less directly which is not very smart and caused me to pay a lot of import fees - better option would be to import through Netherlands.About the item itself, I have several doubts about the sound quality, that currently IMHO has several issues and I detailed them ... describing the caveats: they told me that when the android application will be ready, the software updates all these problems will disappear, so for the moment I have to wait.I hope so, but for the moment I regret my purchase."
        },
        {
          "Note": 3,
          "Lieu": "JP",
          "Pseudo": "Mabu",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T18:56:09.000Z",
          "Titre": "wasn't to my liking",
          "Contenu": "I'm one of the Kickstarter backers. I think I was able to get some interesting headphones after waiting so long.It's well made, doesn't look cheap, and feels comfortable to wear.I think the ANC effect is appropriate and will not cause discomfort to many people.However, unfortunately the sound was not to my liking.Since it's only for heavy metal, I think you can enjoy the experience of being at a live venue when you play it at high volume. Those who gave it a high rating are definitely correct.However, I feel that the overall clarity is lacking, the sound is cloudy, the resolution is poor, and the presentation is lacking. Even in metal, some songs had mixed instruments that made me feel uncomfortable. This may be a matter of my preference rather than the good or bad of H1H.Active (Bluetooth or USB-C) mode is better, but Passive Analog Mode, which uses an AUX cable, has a noticeable downside.The sounds in active mode and passive analog mode are different. Passive analog mode feels unoptimized. Unlike regular headphones, the H1H has eight drivers, so it may be difficult to demonstrate its true potential in passive analog mode that does not utilize the H1H's optimized built-in DAC.By the way, if I use a third-party equalizer, I can get the sound closer to my preference, but that's a problem because I lose the flavor of the H1H. it's difficult."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Zachary Moradian",
          "Nb_Reviews": 2,
          "Date": "2023-11-23T20:56:55.000Z",
          "Titre": "Amazing yet unforgiving.",
          "Contenu": "I've had my H1H's since September 16, 2023, and have tried to use them regularly and with every kind of music I listen too. I was rewarded these headphones through the poorly mis-managed Kickstarter campaign. Pros: -Great overall range of sound ($150-200 range)-earcup comfort and size is excellent-overall build and materials feel very high quality-Transparent Mode is very good-ability to use it powered or un-powered (w/ aux cord)-Battery life is extremely long, even with high volumesCons: -Size of aviation headset (very large profile)-has significant weight that will tax your neck -imperfect sound profile (muddied sound at times)-Hell Blocker NC is not robust as competitors-Significant sound bleed-out from earcups on higher volumesOverall Impression: Heavys is a new company that fast-tracked the development and production of the H1H and it shows. These clunky, unapologetic headsets are either going to give the sound you want or they are not. If these are the most expensive headphone you've ever bought, they will impress you. If you already have $200-$300 headphones, you might have issues with the sound quality. The battery is robust and will allow you to travel without fear of needing to charge it during long flights, but the weight and design of the headphones can be taxing on your head and neck. Using the headphones for longer than three hours resulted in neck strain and headaches. Recommendation: There are very good headphones in the same price range. Heavys has the gimmick of 8 drivers but that doesn't mean the end-all-be-all to great sound quality. Shop around before settling on these \"still developing\" headphones."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Star",
          "Nb_Reviews": 2,
          "Date": "2023-10-27T01:39:36.000Z",
          "Titre": "The good and bad",
          "Contenu": "The good: Heavys are by far the best-sounding headphones I have ever owned. The forward speakers really add dimension to the sound. I love the way the different frequencies are easily distinguishable. The bad: they are far too big for my head. On the smallest size, there is a gap between the headband and my head so the ear cups rest on my ears rather than the headband resting on my head. All of the weight is on my ears and it becomes very uncomfortable very quickly. They would absolutely be 5-star headphones if I could wear them for more than a few minutes before the pain set in."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "CL",
          "Nb_Reviews": 3,
          "Date": "2023-10-26T01:33:20.000Z",
          "Titre": "Really not a fan of these",
          "Contenu": "After numerous delays, the headphones finally shipped and I’ve really felt little incentive to use them. It’s a subjective thing, but I think they make some of my favorite music (a lot of symphonic, extreme, and black metal) sound worse. They seem to work better for a lot of the industrial music I listen to. Definitely not what I was hoping for but I gave it a shot. I think for the money, there are better headphones out there. I’m just glad I was an early bird backer so I saved a bunch of money. At full retail, I cannot imagine anyone being happy with these as metal-specific headphones. Apparently there is an app coming that will allow EQ tweaks, but for now, there is nothing like that. While the noise cancellation is quite good, I am horribly annoyed by the stupid voice that announces every time I turn the headphones and noise cancellation on or off. It’s loud, intrusive and ridiculous."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Andrew P",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T17:26:50.000Z",
          "Titre": "Decent headphones, but beware",
          "Contenu": "The headphone audio is solid. However, there are a few noteworthy issues. First, my Heavys often produce a \"crackling\" sound - sort of a distortion or feedback, which is very distracting and disorienting while you're listening to music. Feels like a manufacturing fault. Second, the \"doom voice\" that gives spoken status updates such as \"POWER ON\" or \"HELL BLOCKER ACTIVATED\" - while amusing, in a corny way - is always set to the same volume level, which is quite loud. It's so loud that I have to take the Heavys off first before I do anything that will trigger the voice, because it hurts my ears. This is especially noticable if you're listening to music on lower volume (yes, even metalheads do this sometimes!). Ironically, if you turn the volume down TOO low, you will be greeted by the doom voice with a \"MINIMUM VOLUME\" warning that might blow you through the ceiling if you aren't expecting it, and also seems totally unnecessary. (Note: this only happens when using the on-headset volume knob. The same applies for \"MAXIMUM VOLUME,\" but at that point it hardly matters). Lastly, and this may be nitpicking, but the headset is very large. Almost comically large. I feel a bit silly wearing it in public.Overall decent headphones for the price, but buyer beware."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gary Oliver",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T21:26:32.000Z",
          "Titre": "Generally good with some minor concerns",
          "Contenu": "Pros:Great sound quality. Case is good, feels solid and protective. Love that it has many different ways to connect to audio.Cons:It literally is heavy and big with a clunky design. Too big for my head (54yo male) at its smallest setting. Wish the case was shaped differently to fit some cables and maybe a clip for carrying. Lowest sound setting is too loud. The voice alert for turning on/off is FAR TOO loud, should be the same volume as the headset."
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "Ferry",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T02:23:25.000Z",
          "Titre": "Absolutely not what I expected",
          "Contenu": "Absolutely not what I expected. The commercials sounded like you would experience music in a new way. I’m not blast away by it sound. And skip the stupid loud voice telling me what is activated or not. It’s a good headphone, don’t get me wrong. But it is not for me. I rather stick to my Apple airpods pro."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Andy Traves",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T21:39:43.000Z",
          "Titre": "I am not unhappy with my purchase but…",
          "Contenu": "I am not unhappy with my purchase but just expected a little more out of the product. It might just of been wishful thinking on my part. I have numerous headphones and I just thought these would blow them out of the water but instead just seem about the same. When you add the extra cost it doesn't quite add up."
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "Giuseppe Fama",
          "Nb_Reviews": 7,
          "Date": "2023-11-03T22:57:56.000Z",
          "Titre": "pretty good",
          "Contenu": "I own all the main competitors ( Bose, Beats, Parrot and some other ), I compare with this and not with other pro studio ( sennheiser, Sony ).Sound : pretty good is full and rich better than Beats but not as good as the Parrot, even with different range can compete and in some way is better than the Bose qc. My really own personal test song began one of Metallica , with the Parrot Zik you can clearly hear the ghost track of Jason’s bass.The noise reduction is pretty good not as the Bose but better than the others.Design : the main problem to me is here, respecting the name the headphone are heavy, too much heavy .About the design I love matte finish but all looks  cheaper than expected, I hope, I really hope that this material like in some other brands will not become “gluey”in the future.For sure I don’t like the “fixed” battery, while with the other you can find a way to change it I don't know what will happen with theseI’m not disappointed by this headphone but for the moment Bose quiet comfort for various reasons will remain my main one I’ll use heavys for sure at home.At the end the price, is in line with the other but is too high for what they give you"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Leslie Crabb",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T18:30:29.000Z",
          "Titre": "They are acceptable headphones",
          "Contenu": "They are heavy and not made to go small enough to fit my head. Anytime I look down they fall off. While they do sound barely better than my sennheiser I expected them to have more depth since they are for heavy metal. I waited a long time for these and i don't think it was worth it. I do like that the music comes from the front and I do wonder how my old boss John Dunlavy would feel about them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John M",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T18:46:13.000Z",
          "Titre": "I pre-ordered Heavys H1H headphones and…",
          "Contenu": "I pre-ordered Heavys H1H headphones and they sound good. Not the best sounding pair I've owned but I guess what can be expected from a $200 pair.The Bluetooth has good range. The construction is decent. They definitely look cool and the ear cups are big and comfortable. The audio coming out of these is tuned to boost the mids. Bass response is kinda poor as are the high frequencies.I like the headphones but if you are basing your purchase decision on sound quality, I think the normal price of $299 is way too much. I've owned $300 pairs of headphones from Sure and Sony and they both had way better frequency response and clarity compared to the Heavys.Would I buy them again? Not for the $299 retail price.Knock a hundred dollars off and throw in the case and yeah, I'd buy them again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Luis",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T13:39:48.000Z",
          "Titre": "Forgot to send me the shells for the…",
          "Contenu": "Forgot to send me the shells for the heavy’s also sent an email about it but haven’t gotten back to me but the headset was good"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T20:56:51.000Z",
          "Titre": "The product is amazing",
          "Contenu": "The product is amazing! It sounds great with everything I've listened to on every device I've paired it with. It's comfortable with long battery life. I'm hopeful for the \"soon coming\" app, but who knows. The communication for the campaign was very lacking. And it seems to be the same for the app."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "SveWo",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T19:41:16.000Z",
          "Titre": "Shipping and Tracking has to improve",
          "Contenu": "Shipping and Tracking was awful, I had to clear the package from customs without any information from where the package was shipped. I almost had to abandon the package due to a lack of information. Please provide some assistance in custom clearance in giving a decent info where the package originated and some other info that is usually needed by customs."
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "Victor",
          "Nb_Reviews": 7,
          "Date": "2023-10-26T23:23:44.000Z",
          "Titre": "Waited long for the shipping but amazing design/sound!",
          "Contenu": "The shipping was much longer than expected, I ordered before the 15th of april (first shipping) and I got it Around august.I also think that its to expensive, but thats my opinion…BUT the quality is very nice! And the sound is also beautiful!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dean Boley",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T22:56:39.000Z",
          "Titre": "After a year of waiting & all the hype…",
          "Contenu": "After a year of waiting & all the hype about it being so great supposed to be loud it’s just ok not impressed at all I think my Bose headphones are better"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Colin",
          "Nb_Reviews": 38,
          "Date": "2023-10-26T22:52:08.000Z",
          "Titre": "Headphones are good, but Hellblocker isn't.",
          "Contenu": "Headphones are good, but the 'Hellblocker' noise reduction is useless. My previous headphones did a much better job of eliminating background noise than these do. Switching 'Hellblocker' on, the background noise remains the same as it is with 'Hellblocker' off. I expected better for the price and the long wait."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "richard larkins",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T00:45:08.000Z",
          "Titre": "well i haven't been able to use them…",
          "Contenu": "well i haven't been able to use them yet because my current pc doesn't have BT and i haven't found a cord that will work to my pc's audio output."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Mike H",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T23:40:49.000Z",
          "Titre": "I do like the highs and I feel the…",
          "Contenu": "I do like the highs and I feel the midrange is there, but the bass is too much imo, so the mids kinda get lost. Headphones are a bit physically heavy for my liking, but I understand based on the amount of speakers in them. Other than that, very nice. An App with EQ options would be nice :)"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Kieran Bridgwater",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T21:43:59.000Z",
          "Titre": "The product is ok not the best",
          "Contenu": "The product is ok not the best, the headphones are too big even on the smallest setting the sound quality isn't the best and the charger doesn't stay is properly, i love the design though"
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "Francois PRUD'HOMME",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T09:58:26.000Z",
          "Titre": "Good but far from perfect",
          "Contenu": "Good but:- passthrough is not working- buttons are not very good quality- jack is difficult for many wires- informatives sounds are too loud"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Mike Daraiche",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T14:39:08.000Z",
          "Titre": "Not the best base I have have…",
          "Contenu": "Not the best base I have have experienced,I have cheaper 70$amazone and they sound better"
        },
        {
          "Note": 3,
          "Lieu": "IS",
          "Pseudo": "Ragnar F Magnússon",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T22:46:54.000Z",
          "Titre": "Decent try",
          "Contenu": "Product is just ok. Very heavy headphones with way too much bass and silly and loud voice while operating. Smells Chinese which doesn't seem to go away"
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "Pino Fama",
          "Nb_Reviews": 3,
          "Date": "2023-08-26T09:18:59.000Z",
          "Titre": "Review of the headphone",
          "Contenu": "After a really long wait ( not considered in this review) , the headphone are arrived, I own all the main competitors ( Bose, Beats, Parrot and some other ), I compare with this and not with other pro studio ( sennheiser, Sony ). Sound : pretty good is full and rich better than Beats but not as good as the Parrot, even with different range can compete and in some way is better than the Bose qc. My really own personal test song began one of Metallica , with the Parrot Zik you can clearly hear the ghost track of Jason’s bass.The noise reduction is pretty good not as the Bose but better than the others.Design : the main problem to me is here, respecting the name the headphone are heavy, too much heavy .About the design still don’t know if I like it or not, I love matte finish but this looks like a little cheaper than expected, I hope, I really hope that this material like in some other brands will not become “gluey”in the future. For sure I don’t like the “fixed” battery I’m not disappointed by this headphone but for the moment Bose quiet comfort for various reasons will remain my main one I’ll use heavys for sure at home."
        },
        {
          "Note": 3,
          "Lieu": "BE",
          "Pseudo": "Lucian",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T11:19:56.000Z",
          "Titre": "Support Department…",
          "Contenu": "Fast responses from Support Department but the timelines for the delivery were not fullfilled at all."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lex Paul",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T07:18:20.000Z",
          "Titre": "Heavy for sure",
          "Contenu": "I was really stoked when this first caught my attention on kick starter.  It was my first experience with KS.  I was very pleased with the abundance of updates and not at all bothered by the delays in development because I get it.  However, after I informed them I was going to have my mail forwarded (before they actually shipped it) they decided to ship it via a USPS method that sent it around the United States before “destroying” it per the the terms of the cheaper shipping price.  Needless to say I was livid.  However, several weeks later they made it right and shipped another pair that finally made it. For that, I cannot give 5 stars.Now for the product review:The headphones are Heavy literally as well as figuratively.  They are monstrous.  But I guess they need to be to package all of the drivers/speakers in them.  They sound good, but they bring out the bad as well as the good in whatever you play through them.  If a band has a well mastered album, it sounds great.  But if you play a favorite metal album from the 80’s that wasn’t produced by a god, then it sounds muddy. In general, the mids really come through on these.To be fair, I am still getting used to them, but would never wear them in public because they are awkwardly huge.  It is a great idea and lots of good technology going on, just need to make the design more efficient.  Will be following these guys to see what the Gen 2 design brings…."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeremy M Howe",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T19:18:28.000Z",
          "Titre": "Where are my shells?",
          "Contenu": "Well, the headphones are good, but I purchased an extra thing of custom outer shells and never received them."
        },
        {
          "Note": 3,
          "Lieu": "ES",
          "Pseudo": "Borja Garaygordobil Tajada",
          "Nb_Reviews": 2,
          "Date": "2023-10-27T06:59:22.000Z",
          "Titre": "Good product and quality but enormous…",
          "Contenu": "Good product and quality but enormous time of delivery without any news about the order during the process. Absolute lack of information"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Javier Solis",
          "Nb_Reviews": 2,
          "Date": "2023-11-04T02:07:18.000Z",
          "Titre": "Heavys, great novelty, left to be desired",
          "Contenu": "I genuinely appreciate that these are an interesting pair of headphones. It's just that gaming headphones from other competing brands are much better. The sound design of \"Heavys\" aren't what I hear from the other headphones and the drivers from Heavys have too much bass, muddling the audio and you'll need to use an external equalizer like from the Amazon Music app. Using that equalizer actually improved the audio from the Heavys and improved what the headphones are capable.  A great tip on the Amazon Music app for the equalizer settings use \"Classical\" or Custom and then Set the Sliders like this (60Hz is Bass so raise or lower to your like) (230Hz closer to center or lower depending on the other sliders) (910Hz this one seems to control the vocals, lower this to clear up vocals, raising it seems to mix the instrumental too much) (4kHz seems to work much like 910Hz so I just keep it the same as 910Hz) (14kHz is actually what makes the audio sound wider or something clearer? Lowering 14kHz makes the audio worst, so slide up and leave it there) Some nitpicks are on the features of the headphones, there's a loud voiceover when switching through modes very unique but just loud. Apparently the cables are separate from the main buy price of the product which is very ridiculous. The \"tweeters\" on the inside of the headphones provide no audible difference to audio or \"soundstage\" to what I can hear... I have use Phone audio and even CD player audio I thought maybe they provide higher acoustics or improvement on audio from guitars and vocals but nothing to what i can hear. Also, the cables, with the analog cable you can only use the Company own cable, it's a \"2mm into 3mm\" cable. You can't use \"high end\" cables that are \"3mm into 3mm\".Overall the headphones are an incredible build it's just that most people might find the Unboxing result a bit of a let down.Another Note the cable needs to be pressed into the headset until the \"click\" or full stop... Otherwise it's not appropriate working"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dylan Kerney",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T19:32:13.000Z",
          "Titre": "Product is great but the wait was long.",
          "Contenu": "Wait was long and suspenseful but the product is great. I ordered my Heavys in early 2022 and they took until August-September of 2023 to get here."
        },
        {
          "Note": 3,
          "Lieu": "ES",
          "Pseudo": "Gerard Diéguez Garcia",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T09:07:38.000Z",
          "Titre": "Had to pay an additional 42.02€ for the…",
          "Contenu": "Had to pay an additional 42.02€ for the international shipment when I already paid for it when I bought them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Scot Mac",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T13:45:25.000Z",
          "Titre": "The good, the meh, and the bad",
          "Contenu": "I've had my Heavys in hand for a few months now and have used them enough to develop some thoughts. The Good1) The build quality does seem pretty decent.  They feel substantial in the hand and components seem to fit together well.  They don't feel cheap2) Battery life is really good.  I haven't had an opportunity to run them out, but my impression is no one will be complaining about battery charge issuesThe OK1) Overall, the cans fit well with decent clamping force and are reasonably comfortable.  Unfortunately, I'd be happier with a little less clamp.  2) The Optimus Prime announcement voice - cute for the first dozen times, then gets old.  At least turn the volume down on it.The Not So Good1) Sound quality.  I realize we all perceive sound differently and have different expectations of sound equipment, but out of the box these sound terrible to me.  The overall voicing is extremely bass heavy and muffled at the expense of mids and upper registers.  I am surprised the company got the initial voicing so wrong with these.Some seem to love it, some don't - I'm in the latter camp.  The good news is if you are connecting your streaming service through a phone, there are a number of EQ apps that will work to make these sound serviceable. I'm running Poweramp and it is worth the investment in time to bring the sound profile around to something a little more neutral.I'm more of a home audio listener than a headphone guy, but my final impression is that Heavys may be worthy of consideration for other similarly spec'd headphones in this price range.  I'd probably give 3.5 stars, but not an optionEdit - I've cleaned up a number of issues with some suggestions from others and the application of some careful parametric eq bands.  There is still some lack of presence, but still more than acceptable at this price point.  Consequently, I've updated my rating to 4 stars.  Without eq, this would be a one star review.Edit 2:  Going to have to bring this down to a 3 star again.  I'm finding the clamping force on my head is just too aggressive to wear for more than an hour at a time."
        },
        {
          "Note": 3,
          "Lieu": "IL",
          "Pseudo": "Eilon Yanko",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T09:15:15.000Z",
          "Titre": "The sound is very good, ANC isn’t",
          "Contenu": "The sound is really good, but the ANC is really not that great, and the weight of the headphones is a bit too much."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "joaquin green",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T22:42:05.000Z",
          "Titre": "I don't like button set up...not as…",
          "Contenu": "I don't like button set up...not as loud as I thought"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Peter Lavoie",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T00:42:06.000Z",
          "Titre": "I still have Static when I put it in HB…",
          "Contenu": "I still have Static when I put it in HB mode!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "ALBERT REIGLE",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T01:51:49.000Z",
          "Titre": "I didn’t receive my shells yet"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Daniel lutz",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T23:30:13.000Z",
          "Titre": "Not loud enough"
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "FABIEN",
          "Nb_Reviews": 2,
          "Date": "2023-11-01T22:43:12.000Z",
          "Titre": "TOO MUCH BASS"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dealia Deets",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T03:35:01.000Z",
          "Titre": "Personalized response when messaging them really appreciated.",
          "Contenu": "Shipping took awhile and the tracking system wasn't updated (which isn't heavys fault). They did communicate well through messages on facebook and I appreciated that. In an amazon prime world, I think we all get used to 2 day shipping lol"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ed in Haymarket",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T15:51:24.000Z",
          "Titre": "Great so far. Have a few suggestions",
          "Contenu": "So far no complaints. I like the ergonomics of the buttons and volume control knob. They sound great. I would give 5 stars, but waiting for an app to possibly come out that supports the device and it would be great to have a suggested metal music source associated with Heavys. So don't take my rating the wrong way. I see the potential in this product to get even better."
        },
        {
          "Note": 4,
          "Lieu": "LV",
          "Pseudo": "Aldis Butlers",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T03:09:38.000Z",
          "Titre": "connectivity",
          "Contenu": "Conectivity has been the only drawdown. Headphones cant decide its connected or not (2 devices connected).Practicaly it has been anoying as it is loud announcement from headphones when connection is lost. Meanwhile its said in my ears, for secconds I dont hear a meeting.Overall the headphones are excellent by sound performance actually. These small connectivity problems does not bother me so much. Only slightly reminds that these headphones are as shy as their listeners. Except loud CONNECTED”. But keep this up, all good"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Brian Greene",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T02:40:47.000Z",
          "Titre": "Heavys headphones",
          "Contenu": "Finally arrived. Tracking is a joke.The headphones feel really well built.Just been playing with them for an hour now.Sound is very impressive.  Lots of bass.1st impression is very happy with purchase.Got to do a good comparison with a few pairs of sennheiser I have.Great headphone"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Littell",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T22:15:24.000Z",
          "Titre": "Amazing Headphones! Just late",
          "Contenu": "The headphones are amazing and the customer service was even better! However, I received my headphones way later than expected. It said I would get them within 4-9 business days. But, I got them in about 12 business days. This being late was the reason for the 4 stars. Without this they would’ve been a solid 10 stars!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Greg",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T03:18:21.000Z",
          "Titre": "Excellent Headphones",
          "Contenu": "Overall, these are very nice and comfortable headphones. I would recommend them to anyone. Pros:Very comfortable. Excellent noise cancellation. Excellent sound AFTER EQ. Excellent battery life. A few issues or annoyances I have experienced:1. High latency with Bluetooth to PC causing them to be unusable with wireless gaming and video watching. This is not an issue when wired. 2. The 2.5mm jack into the headphones needs to be jammed in to work properly. Not sure if I got an oversized cup or connector, but it’s slightly annoying because I don’t want to break anything. 3. I would recommend buying Dolby Atmos to fine tune the audio to your liking. Out of the box they are just ok. EQ’d and they are pretty amazing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Henry",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T15:29:27.000Z",
          "Titre": "Works for intended purpose",
          "Contenu": "Just got these and am liking them so far. The ear cup material is very soft, and even though these weigh more than other headphones, they don't feel too heavy on my head or cause excess sweating. I wore my Heavys all day yesterday without any ear pain or other issues.I also own a pair of Sennheiser Momentum 3 headphones and will use those for comparison. The Sennheisers have more clarity in the audio, but the Heavys sound louder and more energetic. The Heavys have reduced treble and more emphasis on bass, which I like because it allows you to listen at higher volumes without getting any high-pitched treble screeching in your ears. You aren't getting a \"neutral\" sound with the Heavys, but they are fun to listen to.My only complaint is something that many others might view as a positive: It sounds like the noise cancelling function is on all the time, even when I turn noise cancelling off. Maybe I have a defective pair or something, but I hear no difference at all between noise cancelling and regular mode. The only way I could turn the noise cancelling off was by turning off the headphones completely and using a wired connection.Overall, I'm enjoying these so far and think they will only get better once the app is rolled out."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Darien Brown",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T18:12:24.000Z",
          "Titre": "Lost headphones,reshipped thanks to  amazing customer service",
          "Contenu": "The team worked with me the whole way on reshooting my lost items was friendly and courteous. Heavy’s was great to work with and I’m excited for them to arrive as I’m sure they will be as good as I’m thinking if not better"
        },
        {
          "Note": 4,
          "Lieu": "IL",
          "Pseudo": "Johnathan Jerusalemsky",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T20:27:55.000Z",
          "Titre": "Well it is not standard headphones.",
          "Contenu": "I am not really an audiophile , so I can't hear the tiny difference of the sound, but it is still much more better than I had."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Hagen Schlühr",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T16:11:44.000Z",
          "Titre": "Overall very good headphones",
          "Contenu": "Overall very good headphones. Great sound with lots of details and very punchy, especially the bass. This leads to one thing I dislike about the product: As with most headphones, there is too much bass and not enough focus on the hights -at least for my ears. To me as a Metal drummer I‘d particularly love to hear the cymbals, especially high hat and ride, more in detail."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "James Butterworth",
          "Nb_Reviews": 3,
          "Date": "2023-12-07T01:09:18.000Z",
          "Titre": "Great.. a bit too big",
          "Contenu": "It would have gotten the full 5 stars apart from one probably with mine which I'll go into. So, to start off its well constructed. It feels really solid! The sound us great ans everything works as it should and its easy to use the ear cup dials. Now, onto why i gave 4 stars. The headset i got seems big, as in its loose on my head. Its not a good fit and cant do anything to make it tighter. Sure its very comfortable, but if i look down, or up. It slides off my head, which is annoying if im moving about the house or outside with these on. And i wish something could be done about it. But, overall a solid headset!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brock",
          "Nb_Reviews": 3,
          "Date": "2023-11-28T07:02:19.000Z",
          "Titre": "These are great for the ones who want…",
          "Contenu": "These are great for the ones who want to get out of the skull candy territory with the the same kind of bass. Podcasts and YouTube videos go easily with these headphones and maybe a little music too but really you can get the same with a 50mil driver easy. I love the concept I only hope you expand Heavys!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff Reed",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T18:39:58.000Z",
          "Titre": "They sent frequent updates along the…",
          "Contenu": "They sent frequent updates along the process. There was an issue that the tracking number provided no updates until the day it was to be delivered, but it was delivered nonetheless.The only reason I didn't go with 5 stars is because I purchased the bundle with a custom shell, and I haven't received an update on the shell delivery in over a month or so. It had originally mentioned some time in October they would be shipped, and we're now near the end of November."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T21:53:22.000Z",
          "Titre": "After a few weeks of listening: Really fun!",
          "Contenu": "After a few weeks of listening: The Heavys sound really great and are a lot of fun. Depending on the choice of music the instruments sound like attending a metal/rock concert. Guitars shredding like hell, drums like f*** yeah!ANC is not really necessary, the passive protection from outside is already great.Disadvantages: This direct sound needs some getting used to and can be exhausting. The Heavys are huge and are warming in summer. (Though, no compact gear could deliver this sound.)But overall it was worth the wait. I'm glad I've backed this project."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Zachary Ratliff",
          "Nb_Reviews": 2,
          "Date": "2023-11-13T02:18:04.000Z",
          "Titre": "Overall best headphones for the price point",
          "Contenu": "The sound quality is amazing, the features are amazing and overall I feel the energy of the bands I listen too as if they were on stage. The reason Im giving 4 stars and not 5 is because it did take 5 months to get the headphones and there is something off with the Hell Blocker, like it will give feedback on one side more than the other. I emailed support about this issue and they have stated that there will be an app launched towards the end of 2023 to update the firmware and fix this problem. Once that has been fixed it will be easy to forgive the 5 month wait time and I will upgrade my review to 5 stars!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Travis B.",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T02:18:50.000Z",
          "Titre": "These are fantastic sounding headphones…",
          "Contenu": "These are fantastic sounding headphones and I'm glad I took a shot and tried them. Because I own lots of different headphones and cables, I ordered ONLY the headphones and not the bundle. I was disappointed to learn that to use them wired, requires a 2.5MM cable end, versus the more common 3.5mm cable end –which is not obvious in the least from your website. So I ended up ordering the cable separately anyway. Sharing this in hopes I can save someone else the same trouble."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Collins",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T22:20:30.000Z",
          "Titre": "I am happy with the heavies I received",
          "Contenu": "I am happy with the heavies I received. I am very proud to be one of the first to help with this endeavor. I still have not received the covers I ordered. After using them heavily, my volume knob is spotty. It cuts out and doesn’t get very loud. They are too heavy to head bang with. I also prefer my skullcandy crushers with the adjustable bass knob. Otherwise, they are great the sound is very clear, I am finding they bring out parts of the music I’ve never noticed before!! Great job gentlemen!!!!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Aimee",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T20:29:45.000Z",
          "Titre": "Great sound, poor delivery",
          "Contenu": "Product is as advertised and was happy to wait and support a start up, but delays were terrible and a lot of repeated promises on delivery were missed. I ordered January 2022 as a birthday present for myself expecting to receive by August, and when they missed that I thought oh well Christmas then. I didn’t receive until fall 2023, as they shipped based on location instead of when orders were received which wasn’t cool."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bud",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T17:08:59.000Z",
          "Titre": "Great headphones!",
          "Contenu": "Great headphones! Comfortable, great sound. Love the compact carrying case too! Only complaint is the \"announcer/narrator\" voice (for on/off/noise canceling/bluetooth) is very loud and kind of obnoxious. Would love future functionality to reduce this volume or replace with other voice/sound packs. Maybe even user-created and company-approved custom packs?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Terry Fender",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T06:28:56.000Z",
          "Titre": "Heavys Made For Metal",
          "Contenu": "I was completely sold on the idea of headphones made specifically for heavy metal music and I really like the sound quality and construction of the product. Very good noise cancellation (hell blocker). The only knock is that they make my ears very hot in long listening sessions. Overall, though, I am pleased with my Heavys."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Contatore",
          "Nb_Reviews": 3,
          "Date": "2023-11-03T18:27:29.000Z",
          "Titre": "Horrible wait time from prepaid ordering 3/1 to 9/15",
          "Contenu": "Horrible wait time, however…Over all very happy with the sound quality, the battery life is good but not great, the earpads don’t feel like they are suited to sweating as they really hold in the moisture(and block outside noise) so need to be taken off and wiped down during my recording sessions."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Illia Lavrovskyi",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T10:49:40.000Z",
          "Titre": "Solid product.",
          "Contenu": "No fatigue during the long listening sessions. Sound quality is solid.Voice comments of the actions becomes boring after awhile. So it'll be great to have an option of disabling it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Stumacher",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T18:37:20.000Z",
          "Titre": "Experiencing the 8 speaker system was a…",
          "Contenu": "Experiencing the 8 speaker system was a little jarring at first, especially when I'm primarily listening to symphonic and progressive subgenres. I started listening to bands like Sleep Token, Dream Theater, Symphony X and Nightwish in whole new ways, being able to dissect the voicings in the instrumentation so much more clearly. I can't wait for everything to come. Only thing I would ask is, being I already have a pair, if you could ship it the custom shells a bit more quickly..."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Emil Muller",
          "Nb_Reviews": 4,
          "Date": "2023-11-04T04:54:35.000Z",
          "Titre": "Heavys - Worth the wait",
          "Contenu": "The headphones delivers as promised. Decent battery life. The monster mode voice takes a bit getting used to, but hey....What I didn't quite like was waiting more than a year for them since payment. But, it was a crowdfunding pre-payment deal, so, it was expected."
        },
        {
          "Note": 4,
          "Lieu": "GR",
          "Pseudo": "TRL",
          "Nb_Reviews": 2,
          "Date": "2023-10-29T19:59:54.000Z",
          "Titre": "Great product overall !!!",
          "Contenu": "After 2 days of usage, the product seems awesome (sound & material quality, casing)!!!!The only sad part was that the item was shipped in late August, was delivered to me approx. one month later [had to pay an extra ~100$ for customs which sucks big time] and the limited 1-year warranty states that the countdown starts from the day the item was shipped."
        },
        {
          "Note": 4,
          "Lieu": "DK",
          "Pseudo": "Junghyun Kang",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T18:22:28.000Z",
          "Titre": "H1H headphones are all good in build…",
          "Contenu": "H1H headphones are all good in build quality, sounds, accessories, packages, as I expected.Just need an app (iOS, Android) to control eq, HB (ANC), hear through, etc... Currently, uncomfortable to control by buttons only."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "D-Turn",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T20:38:24.000Z",
          "Titre": "The product is phenomenal",
          "Contenu": "The product is phenomenal! Great sound, comfortable, and honestly works great with almost every genre of music. The one part of the experience I didn’t enjoy was the fact that I wasn’t notified when the product had shipped or what company it had shipped with. I ordered the headphones back when it was still on preorder so I was constantly checking my emails for an updated status and then the headphones showed up out of the blue. Only reason this is not a 5 star is because I wish I would have received an email with the shipping information."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kane Blaum",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T01:56:19.000Z",
          "Titre": "Can't listen passively with cord, but nice otherwise...",
          "Contenu": "Really great sounding headphones that are also very comfortable. I'm very happy with them aside from the fact that right out of the box the cord input for passive listening doesn't have a stable connection. Anytime the cord is touched, one side or the other cuts out until I can move it just right to get both channels to come through. Really annoying considering how good a quality everything else about it is. I considered sending them back for a replacement, but considering I waited a year and a half to receive them, I couldn't bear waiting again, and for who knows how long. I'm pretty satisfied just using the bluetooth method, but still wish I could listen passively when I want. Oh well... I'd still recommend them."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Consumer",
          "Nb_Reviews": 4,
          "Date": "2023-10-27T14:03:11.000Z",
          "Titre": "So grateful to ha been on the ground…",
          "Contenu": "So grateful to have been on the ground level of this wonderful product launch. Best headphones I've EVER had, geared directly to the target genre we all bang our heads to!!!!  Excellent, service, updates, packaging, product and sound quality all superb. I would have included a proper c type charging cord as I was forced to purchase one. Overall, highly reccomended for anyone who loves their metal clear, crisp and bloody LOUD. Thx Heavys, was worth the wait."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Steffen E.",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T16:31:35.000Z",
          "Titre": "nice headphones",
          "Contenu": "sound is great when used via bluetoothwhen used with aux-cable the sound quality and volume were worse for some reason (no clue if thats normal)at low music volume i could still hear some backround noise even with the \"hellblocker\" active noice canceling on. it made no discernible difference to me.they are extremely comfortable to wear. the controls are easily reached and the microphone seems to record at a very good quality too.i am very pleased with these headphones."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nicolas Galindo Moncada",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T22:40:47.000Z",
          "Titre": "The best except for one thing",
          "Contenu": "I love these headphones, really like the sound and being able to distinguish different instruments and notes, like even guitarron in mariachi music sounds much clearer.There is one thing, thiugh, and it is that sometimes, not often, but maybe once a month, the bottom left bass speaker will start some kind of interference noise and it won’t stop until you turn the headset off and leave it for a while.Other than that, they’re great!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MrsBursey",
          "Nb_Reviews": 3,
          "Date": "2023-11-12T22:15:35.000Z",
          "Titre": "The product itself is amazing",
          "Contenu": "The product itself is amazing. The only issue was in the last few months of the kickstarter. I felt that we were no longer a priority. No questions were answered and when people (customers) became upset the company flat out said they would not be answering any \"rude comments\". To me that showed me a lack of a mature company. Once the product arrived most of us didn't care about the wait anymore as the product was amazing. Great bass, clear details you would not have found with a different product. As well as an overall amazing design. Looking forward to an app to go along with the product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ronald Waring Jr",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T23:22:21.000Z",
          "Titre": "These things sound awesome!!",
          "Contenu": "These things sound awesome!!! I have actually welled up a bit listening to some of my favorite songs and feeling that \"first time hearing it\" feeling again. I can hear more layers and details than ever before and these are very worth it for the sound alone. The sound is so good for this level of headphones, that I only take one star away for the so-so build quality/materials, oddball controls, bad sound insulation (everyone can hear what I am listening to), weird aux cable shenanigan's and the extreme shipping delays.That sound tho... chefs kiss!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cedrick Wilkins",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T02:44:22.000Z",
          "Titre": "Great product! Firmware need some",
          "Contenu": "The Heavy’s design for their first headphones are phenomenal! The sound quality is great, with you truly feeling like you are at a metal concert without the music getting so loud it hurts your eardrums. The firmware on the device could use a little bit of work with the polishing. Three examples come to mind;When you turn on the headphones and go to the noise canceling mode as they coined “Hell Blockers” (very rad name in my opinion) the headphones give the message “Hell Blockers Activated”. When you boot the headphones right into the hell blocker mode it will repeat the messages that were shown multiple times. Secondly, when you are at minimum volume it will play the message “Minimum Volume” at a rather high volume, which is a pretty big shock to my ears whenever it happens without me expecting. Thirdly, pretty minor actually, the headphones have a pretty large band on them so if you’re walking around with them on or if you move your head a lot they are pretty liable to fall off and they generally just feel loose while wearing them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JR Remke",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T14:43:28.000Z",
          "Titre": "While I would have loved to have…",
          "Contenu": "While I would have loved to have received them sooner, I understand that things take time.  I appreciated the communication throughout the process.  I like the headphones though I would love to be able to tweak the sound a bit.  My listening preference is a bit more treble-y than the default Heavys tone."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Tigran G.",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T00:33:07.000Z",
          "Titre": "Awesome headphones needs to be thin setup with EQ for a perfect fit",
          "Contenu": "The product is really good, waiting really worth it!Headphones are really solid and fit perfectly on your head, they are absolutely comfortable. Pure bassy sound, which could be improved by EQ and detailed software set up.From the cons: Undefined timeframe for the delivery (but the bakers waited around 2 years, so my case is quite fast). And the most bad surprise: the shipment was sent from Hong Kong and additionally to product's costs and delivery I had to pay 50 euros of VAT&customs duty (because the product came outside EU), these specific numbers are valid for Spain and might vary depending on country. This was really an unexpected surprise. I really enjoyed the sound of headphones, brutal voice if included assistant and especially the Hell Blocker and Transparent modes, which are very useful on outside and on the street/public transport.So if you are OK with these cons and able to set them up precisely for a perfect sound and wait how long's needed, I don't think you can find something nice for such a price. I am using them with Android and BlackPlayer with build-in EQ, but it's only the first day so far. I'll update my review later after I find a perfect set up."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T10:08:31.000Z",
          "Titre": "The headphones sound amazing, but....",
          "Contenu": "The headphones sound amazing. I like to wear them when commuting to work, so I can listen to music loudly to switch off, especially on the way home. But what bothers me is the spontaneous switching off and on of the headphones.  They do reconnect to the source, but it's still annoying...I hope for a solution as soon as possible in the announced app. I assume that the problem can be solved with a software update."
        },
        {
          "Note": 4,
          "Lieu": "LV",
          "Pseudo": "Gatis Graudins",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T07:23:51.000Z",
          "Titre": "HEAVYS... are they really so good as advertised?",
          "Contenu": "The HEAVYS quality of built materials and construction is very good, nice to hold them in your hands. They are like a good massive gadget with small buttons to turn on, turn off, adjust volume etc... but I'm a little disappointed in the sound quality.... 2 large speakers, 2 beepers on each side, but for some reason my old Sony MDR1A headphones sounds  more clearly in High Frequency range. HEAVYS sound is heavy, bassy, but not so clear as I want to hear... Anyway, after a few minutes of listening, the ears adapts to the sound of HEAVYS and it doesn't feels so bad anymore."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Don Hough",
          "Nb_Reviews": 2,
          "Date": "2023-10-27T00:44:42.000Z",
          "Titre": "I received my headphones back at the…",
          "Contenu": "I received my headphones back at the end of august and i had to put them through some tests. like riding bike and just listening to the record player then the true test mowing the lawn on my riding tractor the true test of noise cancelling and i gotta say i'm truly impressed they passed on every level i highly recommend these to anyone"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Max Lobenstein",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T05:21:50.000Z",
          "Titre": "The best headphones I constantly use",
          "Contenu": "I was super excited to recieved my first pair of heavy's Headphones. I am very glad about the audio-quality. The Design is marvelous-metal-fan-ish and has very good ear comfort. I listen to music almost every day 5+ hours with them and They don't push onto the ears. I would recommend these Headphones to any friend who's looking for good over-ear Headphones. \"But why then only 4 Stars?\"Well, I have to admit that my head ist a bit broad, and I am scared that These Headphones May break. And the headpad could be a Bit more comfortable. Anyway, all in all 9,5/10 would recommend this headphones! Stay Heavy!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nick Long",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T23:21:51.000Z",
          "Titre": "Great sound, but takes the heavy part a bit too much",
          "Contenu": "The sound is absolutely amazing in these, they are generally comfortable to wear, and the battery life is great. Only thing I would change is how much the headband can adjust. I have a fairly robust noggin, but even at their smallest size, they are a little bit big on me and tend to slide downs and rest on my ears, which causes pain after around an hour of wearing them. This could also be resolved if there was a way to make them a little bit lighter."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Arjan",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T20:52:18.000Z",
          "Titre": "kickstarter backer",
          "Contenu": "I backed their first headphone on Kickstarter. Although the message was not always what we wanted to hear (read setbacks), they remained honest. With a year of they delivered on their promise. In the end it was well worth the wait: the headphone is sturdy, has a nice fit, and the music sounds really good. The ear pod isolate so well, I do not need to enable the Hell Blocker (ANC). I’m able to hear details in the music I never heard before."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matthew Haenny",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T19:33:42.000Z",
          "Titre": "Great Sound...Sized For Giant Humans",
          "Contenu": "The sound and quality of these headphones is fantastic. I am very happy with those aspects of the Heavy's. However, as the owner of a normal size head, the fact that the earcups hang all the way down to my neck with the headband adjusted to the smallest setting makes these headphones unusable for me. In that way I am terribly disappointment in my Heavy's purchase. Good Luck!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dan Roe",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T21:44:58.000Z",
          "Titre": "Amazing sounding headphones - a little big on the head",
          "Contenu": "These are great headphones that were totally worth the wait from the initial Kickstarter investment. The sound quality is amazing, they are comfortable, and very cool looking - all things that I really appreciate. I almost never wear any other headphones now!My only complaint is that the headband is a little big so the ear cups are not really tight on my head. I have a pretty average/slightly large head so it's not like I'm out of the ordinary here but even with no adjustments to the headband, they slide around on my head. This is fine because I mostly use them sitting at the computer, anyway, but when I want to wear them and do anything else it can get pretty annoying."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kenna",
          "Nb_Reviews": 5,
          "Date": "2023-11-24T19:48:44.000Z",
          "Titre": "These are amazing",
          "Contenu": "These are amazing. Noise canceling and great sound. Had to take the bass down and other equalizer effects but I got it just right I think. Thanks so much for making heavy metal headphones!! Rock on 🤘🏽"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ALEX",
          "Nb_Reviews": 2,
          "Date": "2023-10-25T20:45:39.000Z",
          "Titre": "Best at what they do.",
          "Contenu": "Despite size, super comfy. Loudness tech seems to work - love how not fatiguing these are to listen to. There are times I wish I could have more high end/clarity so I can't call these the best headphones for every song, but nothing I've listened to do better than what the heavys are good at."
        },
        {
          "Note": 4,
          "Lieu": "IL",
          "Pseudo": "Vlad Berlin",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T09:12:53.000Z",
          "Titre": "amazing sound!",
          "Contenu": "the headphones have an amazing sound! they are truly made for heavy metal. the product looks good, and is durable, but the weight is a bit heavy, and the  headphones ergonomics needs to be upgraded a little (when comparing to Sony and BOSE)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anthony Eugene Santa Maria IV",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T23:36:36.000Z",
          "Titre": "Sound is great, But…",
          "Contenu": "Sound is great; however I didn’t receive the \\m/ spike skins I ordered and the power charging cord is defective with both ends with the same connection, blah. Operationally, I’m solid."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Leif",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T23:16:38.000Z",
          "Titre": "100% Worth it",
          "Contenu": "These headphones are simply the best! The sound quality is facemeltingly good, however I do wish that the charger that came with it was already built for standard USB drives. Despite needing to buy an adapter, still 100% worth it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dustin Whittaker",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T01:46:26.000Z",
          "Titre": "Worth the Investment; However, be Willing to EQ",
          "Contenu": "I think the project overall was a success. Received my Heavys faster than I expected. The build quality is exceptional. I expect these will last for many years to come, and I’m excited to have them. After some equalizer work, they sound good to me. My only point of criticism: I thought out of the box the sound was muddy and not well suited for metal. Nothing a little work with EQ can’t fix. Apple has several presets that suffice (e.g., electronic), and even further improvements can be made manually if one is willing to. I’m not the engineer(s) of these headphones, and I’m very ignorant about how sound signatures are developed for out of the box. If they could arrive out of the box sounding more suitable to metal with more clarity, I think some folks would feel less shocked, like I did. These headphones are an investment (and a good one at that), but if they could sound better for metal out of the box, I think that would be an improvement. I’ve read some angry posts on Reddit, but I don’t think they understand that EQ can fix their dissatisfactions. I hope this makes sense."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Blair",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T22:07:00.000Z",
          "Titre": "Heavy’s are a great option for people…",
          "Contenu": "Heavy’s are a great option for people looking for a good solid headphone. They are good for all types of heavy music as well as classical music and jazz. They are comfortable and the noise canceling performs well. The only criticism I have is the weight is a little heavy but after some use I became used to it. I would highly recommend them to everyone."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Ferry",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T09:58:31.000Z",
          "Titre": "Great headphone!",
          "Contenu": "Great headphone!It's a bit big and heavy (what's in a name).Sound is great! I have nothing to compare it to tho, no other headphones.I was one of the original backers from the Kickstarter campaign (feb 22). I contacted the company mid September 23 about the status and surprise, surprise my order was just processed. I got the pair delivered last week after a slow delivery process. Tracking was not up to date most of the time...After I paid the customs last week things went fast.Very happy metal head now \\../"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "The Dude",
          "Nb_Reviews": 3,
          "Date": "2023-10-24T21:49:10.000Z",
          "Titre": "Impressive, most impressive",
          "Contenu": "I was really impressed with the headphones. Not only do they bring out every nuance in the music (bands like Archspire really shine on these things) but they also block out everything else so you can just enjoy the Metal. They took forever, but they were worth the wait.I'm only giving it 4 stars because of the AUX 2.5 jack instead of using the proper 3.5mm. These are sitting in your chair and enjoying your Undeath live album turning on your record player kind of headphones. And using 2.5 feels like a ploy by them so you'll buy their overpriced cords. The latter reasoning making my disappointment more legitimate.Also, I scrolled through some of the negative reviews and found some of the pettiest crap I've ever seen. Some complaining that the voice was 'too loud'. If your ears aren't irreparably damaged from years of listening to Metal, then wth did you buy heavy metal headphones for!?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joshua Hartsook",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T02:07:05.000Z",
          "Titre": "4.5 ⭐. Amazing product with Minor inconveniences",
          "Contenu": "Initially I was upset that they kept getting delayed but the year and a half wait was worth it in the end.  I love having multiple connection options. Bluetooth for the gym and chores, analog and/or digital connections for streaming and gaming.  They are a tad heavy(no pun intended) they tend to slide off of im doing any exercises at the gym that require me to be in anything but an upright position, easy enough to work around that.  Only dropped 5hem once so far in the 2 months I've had them and only a small scuff to show for it.  Sound quality, well nothing to say other than a 12/10.  Great bass without being overpowering.  Love the extra tweeters and their forward relocation. Very big, full sound.  Even does a decent job at making up for the poor sound quality of some audio files and low reception area where your Plex/Spotify streaming might start to degrade. They fit very well for their size.  My biggest concern is the hinge for folding the ear cups, I haven't had any issues but I always feel like I'm about to break something when I unfold them.  Let me be clear, they don't feel \"cheap\" but just something about the way the hinge lock into position.  But for that I took away one star.  I'm careful with my property but I don't like feeling like I have to be unnecessarily overprotective.  I would give 4.5 stars but this survey doesn't allow 1/2 stars.  Great product!! Highly recommend"
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Clive Graham",
          "Nb_Reviews": 6,
          "Date": "2023-11-03T20:39:33.000Z",
          "Titre": "manufactured in china",
          "Contenu": "The headphones are absolutely phenomenal, well made and have a cool voice when turning on, pairing with bluetooth etc. the case is real good quality and the sound quality is the best i have ever had on headphones. the 2 reasons why this is a 4 star review is, it is made in china and so a plug is not included to charge them, also there was a massive import tax for the item as well as having to provide lots of paper work to get the item delivered. I have to say, i was disappointed to discover that it was manufactured in china because of some of the substandard electrical stuff i have encountered from china, but i am hoping that these headphones will stay good for a long time"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Nicolas Cozens",
          "Nb_Reviews": 3,
          "Date": "2023-11-12T00:11:03.000Z",
          "Titre": "I really really love the sound of these…",
          "Contenu": "I really really love the sound of these headphone, really great! The only thing I don’t like so much about them is they are quite big and lose on my head, whenever I put my head down & I have them on, the headphone top part that is on my head goes forward. It would be great to be able to adjust them a bit more to my head size. Maybe I’ll wear a hat simuliez using them around the house."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Terrence Byrnes",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T21:18:35.000Z",
          "Titre": "The headset sounds very good but…",
          "Contenu": "The headset sounds very good but occasionally there is a buzz in one side. That could be Spotify as it's nort constant.  I would have set up the set to fold for storage and the cushions should be replaceable.  Otherwise everything is great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jon Hubbard",
          "Nb_Reviews": 2,
          "Date": "2023-11-14T01:09:03.000Z",
          "Titre": "Service was ok",
          "Contenu": "Service was ok.  I was an early-ish backer, but I seemed to be amongst the last to get my headphones.  Maybe that was because I purchased a case for them?  I don't know.  I didn't get tracking numbers until i emailed, and by the time I got a response, the headphones were at my door."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cory Smith",
          "Nb_Reviews": 2,
          "Date": "2023-10-25T21:20:25.000Z",
          "Titre": "Solid",
          "Contenu": "Solid, explosive bass sound. A bit too big to wear on public outings. Needs more options with an app to control better for people who don't prefer to do things manually."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Olivia Thompson",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T20:36:12.000Z",
          "Titre": "Worth the price for any metal head who values sound quality",
          "Contenu": "Definitely delivered on sound quality, never had better headphones than these. Battery life is also good, my only issue is sometimes I lose the Bluetooth connection for a second or two even when my phone is in my pocket, so the music either gets interrupted with a pause, or the voice cuts in mid-song to tell me it reconnected."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Jithu Sudhakar",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T12:41:26.000Z",
          "Titre": "I say if your audio equipment can play…",
          "Contenu": "I say if your audio equipment can play heavy and extreme metal music without a hitch, it can play anything. The Heavys headphones is a brilliant piece of audio engineering. The headphones, even though a bit heavy from the additional drivers and battery pack, is built sturdy and sits on my large head quite comfortably. The sound is loud and crystal clear with excellent separation of instruments and the connectivity options work flawlessly. It is difficult, if not impossible, to get a product of this quality at this price point anywhere else. There were obvious delays in creating and marketing a complex brand new item from scratch, and of course, there are some minor implementation issues that still need ironing out, but the engineering team behind Heavys has done a magnificent job. It took almost three years for me to receive my Heavys but I'm ecstatic to finally have it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kevin Wimberly",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T20:11:43.000Z",
          "Titre": "The quality of the device is fantastic",
          "Contenu": "The quality of the device is fantastic, from the build to the listening experience. Communication with Heavy's while waiting for my headphones to ship was a little off putting, however I understand it was a pre-purchase, so I signed up for that. I feel there is a bit of a lack of technical documentation or support with regards to using these for digital on a PC, since when it is plugged in, Windows 11 has no clue what the device is as the device does not report what it is to the system. I reached out to Heavy's for a driver and got no response. This could easily be a 5-star rating with a PC driver and an app that lets you get a custom sound profile directly to the headphone as most equalizers in apps are absolutely terrible and distort your sound and degrades the sound quality substantially."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Marvin F",
          "Nb_Reviews": 3,
          "Date": "2023-10-27T06:48:59.000Z",
          "Titre": "Good budget headphone with a few downsides you should know",
          "Contenu": "Testing for a couple of monthsFirst things first:You have to consider, it's the first product and not as complete as established competitors.You'll get a very good headphone with a few downsides.The downsides:- you can't turn this thing low. It's always kinda loud. So if you want to work and listen to music on very low volume, it's just not possible- at the moment you can't play with the audio settings, but am update might come- there is a horrible loud voice narrating everything you do \"POWER ON, CONNECTING, CONNECTED, HELLBLOCKER ON\" it's ridiculous and very annoying and even embarrassing in public- the Bluetooth connection with both of my laptop works, but the audio on my headphones sounds really bad, like if a tin can. No problems with mobile devices whatsoever- you have a move were you can enable the microphones to overcome the noise blocking. The mode works well, but you have to press two buttons at once and don't get any audio feedback of it's turned on or notHope I could help you a bit"
        },
        {
          "Note": 4,
          "Lieu": "IL",
          "Pseudo": "Or",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T10:25:24.000Z",
          "Titre": "Good, but not insane",
          "Contenu": "The headphones are good, but it's not like they are earth-shuttering good. There is definitely a higher than average level of detail, but it's not day and night from your run of the mill headphones. On top of that, they are heavy. Not crazy heavy, but heavy. But aside from that, they are good - ANC is amazing, controls are really good, and sound quality is good. A little high on the bass but it's ok."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kutter McNeil",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T01:11:27.000Z",
          "Titre": "They sound amazing and unlike other…",
          "Contenu": "They sound amazing and unlike other head phones the dont hurt my ears after wearing them for hours.I dont really like how they look where they fold but I never fold them up anyway. Also, I use them for listening to books and movies and when I lay on my side they dont really feel like they can take it. They weight of my head that is. Other than that I really like them. I notice a huge difference in quality when I use other head phones. Heavies sound dynamic, like Im there, where as others sound flat and definitely electronic."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian Tropp",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T16:48:55.000Z",
          "Titre": "good headphones honestly for the hype…",
          "Contenu": "good headphones honestly for the hype thought they'd be better especially for heavy metal music that their promoted for, noise cancellation could be way way better,,, but still good headphones  though"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Austin S.",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T04:35:31.000Z",
          "Titre": "Great headphones",
          "Contenu": "Great headphones. Wish had a better pause/play button. Sound quality is top notch, Can’t complain about battery life. Love these things, hear them all the time to the gym."
        },
        {
          "Note": 4,
          "Lieu": "PE",
          "Pseudo": "Arturo Merino Chavez",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T20:43:02.000Z",
          "Titre": "Good sound and build, very clunky",
          "Contenu": "The sound is good, specially when compared to headphones in the $150 range. They are very atmospheric and clear-sounding (might need a little equalizing first). Feel very sturdy and can probably take a beating. But they are too big for my head, and weight way too much to walk around with them. Also I don't feel the ANC works very well. Solid at-home headphones."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "J Karl Christensen",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T23:57:52.000Z",
          "Titre": "The headphones fit wonderfully",
          "Contenu": "The headphones fit wonderfully. The sound is very good and highlights each instrument and voice. I do wonder how the materials will hold up over time."
        },
        {
          "Note": 4,
          "Lieu": "NO",
          "Pseudo": "Christian Matheus Luperdiga",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T12:41:35.000Z",
          "Titre": "Took a while to arrive but the…",
          "Contenu": "Took a while to arrive but the headphones do the job and beyond. Hope the app development don't take so long and give us a step up experience."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "morganP",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T01:22:06.000Z",
          "Titre": "It’s wonderful",
          "Contenu": "It’s wonderful! I finally found a headset that is happy to give me my music, and I’m happy also!The noise cancellation could be better…I haven’t really test the phoning part.Please HAEVYS continue to make products like this!"
        },
        {
          "Note": 4,
          "Lieu": "SE",
          "Pseudo": "Lidström",
          "Nb_Reviews": 6,
          "Date": "2023-10-29T18:24:52.000Z",
          "Titre": "The sound is brilliant for rock and…",
          "Contenu": "The sound is brilliant for rock and metal. Much better for the genre than my Sennheiser Momentum 4. A bit large. I have a small head an have the headband on minimum. The delivery could have been sooner."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Tony",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T01:53:24.000Z",
          "Titre": "Great Product",
          "Contenu": "Great Headphones, nice Support, but very long waiting time (which happens with crowdfunding projects)Would buy again"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Flash",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T00:39:54.000Z",
          "Titre": "FaRK Yeah!!!",
          "Contenu": "It took me almost 3 months to finally get around to pairing this puppy up, I now regret taking so God dam long. All I'll say is WOW!!! If you are looking for thumping drums, hard riffs and screaming vocals with a new set of headphone's earmuffs vibrating off your head (ALL at the same time) then look no more! Be warned though this product is NOT for crisp treble or smooth relaxing vocal tones (EG: Classical, etc) If you are a serious Audiophile you'll most likely feel let down, yet....Should you be a Heavy Metal / Hard Rock enthusiast you ain't gonna add these to your Headphone collection for anything else other than a 'full on' head banging, devil horns salute  experience. That my heavy metal / Hard Rock friend is exactly what you'll get. I really hope Heavys put this same recipe into a pair of earbuds with 10-12mm drivers for their next venture, I have a feeling it's already on the horizon due to the massive TWS earbud market they'd be silly not to put a little R&D into a future related product with a dedicated App. The only let downs (very minor) and reason for one star less in my review is the fiddly little buttons and knobs placed on the underside of the right ear cup. They could be either slightly larger or have some rubberised or textured grip and spaced a little further apart seeing they are so small. One other thing is the ANC switch design hasn't been completly or thoroughly thought through, the user can easily toggle the headphones off when in Bluetooth mode is switched in the opposite direction. I am sure these minor faults will be corrected for version 2.0 (perhaps move some switches to the upper fork on either or both sides of the ear cups?) That would make the Heavys even more unique and intuitive to everything else on the market. I'd also love to see a flaming Red devils horns hand 🤘 logo on the ear cup as a new earcup design housing either a button styled battery with small toggle on/off switch to power that glowing logo OR a 'glow in the dark' logo powered by UV flashlight or naturally powered by the sun after a few hours using luminescent liquid / material. Attention Heavys R&D....Check out The Voltage Ring (another KS project some years ago) for an example of that technology. I think the later rather than the former may be an easier process? Or perhaps give the Heavys community a say or which they'd prefer if you are considering this option? Anyway to end this review if you are second guessing yourself in picking up a pair of Heavys then don't just do it as you just won't find a listening experience anywhere else in the flooded Headphone market. Cannot wait for the earbuds to drop hopefully in the near future. We'll done to Axcel and his entire engineering crew, hats off to a job very well done! Flash... OUT"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eric Brann",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T00:57:04.000Z",
          "Titre": "Overall a good set of headphones",
          "Contenu": "Overall a good set of headphones. Works very well with Ableton. My biggest issue is the audio loudness when turning on the noise cancelling function."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Luis A Bonilla-Cruz",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T21:36:11.000Z",
          "Titre": "As an original kickstarter backer",
          "Contenu": "As an original kickstarter backer, the reason this is not 5 star is because of the anxiety and a bit of mishandling the delays in production. That said they did deliver a high quality product that is beyond what established companies make."
        },
        {
          "Note": 4,
          "Lieu": "IL",
          "Pseudo": "Benji Up the Irons",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T13:24:30.000Z",
          "Titre": "Best sound ever for Metal",
          "Contenu": "These are the best headphones I’ve ever owned. They sound amazing and each note and instrument is so clear. The blue tooth works great (better than AUX) also when you answer the phone with the headphones on. They are just a bit heavy after many hours of wear but I wouldn’t trade that for the world the way these bad boys sound."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "brandon pawlik",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T21:06:35.000Z",
          "Titre": "Build qualityexellent, software is beta at best",
          "Contenu": "Well built you get quality built, the sound is very good but not great, but it could be and i hope it will be, the haedware is present to be great , the software that controls it is not there yet"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alex Krupnik",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T20:58:19.000Z",
          "Titre": "Excellent Sound, But Super Annoying \"Speaking\"",
          "Contenu": "Pros:Sound is incredible, which is obviously the most important thing. I turned the lower frequencies down just a tiny bit on my EQ, because I found the bass was causing the guitars (in death, black, melodeath, thrash metal) to be a little overshadowed and muddy. But with a small adjustment, it sounds perfect to my taste.The earcups are super comfortable, which is the 2nd most important thing.HB mode works really well, comparable to the active noise cancelling I've had with Bose in the past.The \"listening\" (whatever it's called that lets outside sound in) mode is also good.Cons:The main con is this: The vocal status announcements are LOUD and INTRUSIVE. I think they're a little overkill. But the worst offenders are when you turn HB on/off. The worst part of listening to music, is having a loud interruption that shouts \"HELLBLOCKER (DE)ACTIVATED\". The 2nd thing, which might be even more counterintuitive, is when you roll the volume down to zero, a LOUD voice booms MINIMUM VOLUME. C'mon, I literally am trying to make the volume go lower, I don't need a sudden, much louder than level-1 volume voice yelling at me. Imagine if every time you muted your TV, the TV announces \"MUTING TV!\" This is especially annoying, because I'm often in public, on a train or something, and I need to adjust my volume without looking at my phone, so I'd rather not be startled when I accidentally bottom out. Hopefully, an update can fix that. Or maybe you'll release an app to make adjustments or something."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dan Dorsch",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T12:57:52.000Z",
          "Titre": "The headphones are quality made, but",
          "Contenu": "The headphones are quality made and sound great. The only disappointment is the delay in receiving the product."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Marius",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T10:03:31.000Z",
          "Titre": "Service would be 5 Stars",
          "Contenu": "Service would be 5 Stars, as well as the sound. However it lacks in the comfort department with the Headband, not enough cushioning for the weight"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Gary Florian - QLD Australia",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T12:24:18.000Z",
          "Titre": "Order + delivery",
          "Contenu": "Order + delivery, three weeks to QLD Australia. Tracking was too easy."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Lans Nahrgang",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T18:31:12.000Z",
          "Titre": "They sound good for sure",
          "Contenu": "They sound good for sure, I’m happy with the fit. The on/off button worries me, feels like it wants to break. I’d highly recommend them to a friend. Only complaint is on some older recordings them seems a bit quiet volume wise. If I use a cable and headphone amp they bottom out, so I don’t use one on it. Really happy with them. Highly recommended"
        },
        {
          "Note": 4,
          "Lieu": "HU",
          "Pseudo": "Márton",
          "Nb_Reviews": 2,
          "Date": "2023-11-06T11:55:26.000Z",
          "Titre": "Decent headphones with shipping adventures",
          "Contenu": "I had to wait almost a year (ordered at the end of 2022 november, arrived at beginning of 2023 november). It was a rough ride.Finally i got them, and they are honestly pretty good. Waiting for the app now 😂"
        },
        {
          "Note": 4,
          "Lieu": "IL",
          "Pseudo": "Michael Magruder",
          "Nb_Reviews": 3,
          "Date": "2023-11-07T19:12:06.000Z",
          "Titre": "To be honest I still haven't received…",
          "Contenu": "To be honest I still haven't received them.  They're in transit.  I live in Israel so no telling when I'll get them.  I ordered long before the war so it's taken sometime.   The support staff has been great..."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Maths",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T21:09:42.000Z",
          "Titre": "You delivered.",
          "Contenu": "You delivered a product that really does as advertised, albeit that it took somewhat longer than i would've liked"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Russ Neufeld",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T20:12:19.000Z",
          "Titre": "Awesome product",
          "Contenu": "Awesome product. I would give 5 stars but the delivery delays hurt me a little. I will be ordering accessories and if they come ontime I will be giving 5 stars next time. Thanks again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eric Badeker",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T21:17:20.000Z",
          "Titre": "Heavy’s Are fantastic 🤘🏻😝🤘🏻",
          "Contenu": "First off my Heavy’s Are fantastic! Love em! But… I’m still waiting on my Crowbar Shells for them. I emailed shortly after I received my headphones and they said it would be sometime in August. Still haven’t got them. Please let me know what is the hold up or just please refund my money. Then I will give 5 stars 😁"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Betazed",
          "Nb_Reviews": 2,
          "Date": "2023-10-26T18:08:27.000Z",
          "Titre": "Excellent product, still in early launch",
          "Contenu": "I have had the Heavys headphones for a few weeks now, and I haven't tested all the features yet, but I have been enjoying the headphones a great deal. I do think there are some drawbacks, they are a bit large for my head even in the tightest position (and my head is not small), and they do seem a little too bass-heavy, but they do still have a good enough response that makes metal, and actually other music (particularly some electronic stuff I happened across) shine. They even work well for spoken word content on YouTube. The Bluetooth connectivity seems to be extremely good, in fact too good. I live in a small apartment and the Heavys are paired with an iPad and a MacBook Pro. When I power them on, they will often connect to both if the MacBook isn't completely shut down even if the MacBook is dozens of feet away behind a wall. When this happens, I don't get audio on the iPad. I haven't tested the analog connectivity, or the USB-C connectivity, or the mic. They do seem to last a good long time on a single charge, and they feel like a premium and thoughtfully constructed product. It did take a along time for me to receive them but I'm generally pretty patient with Kickstarter projects because unforeseen things can and do happen. In all, I do recommend the product, but I would probably advocate for holding off until they are fulfilling orders more consistently, and for any pending firmware updates that may improve audio or connectivity."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Oscar C.",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T22:59:08.000Z",
          "Titre": "Almost Perfect!",
          "Contenu": "Fit:The headphones offer a sleek design with a good balance of materials and textures. However, there is a noticeable tightness when wearing glasses, and the ear cups could benefit from a slight enlargement of 1-3mm to accommodate larger ears. The foam lacks sufficient padding for extended wear.Buttons:One area for improvement is the height of the play/volume control button compared to the adjacent buttons. This height difference is not significant, causing difficulty for users with larger fingers. It results in accidental clicks on smaller buttons or a challenge in gripping the center button due to overlap from the shells. It's recommended to increase the height of the center button, change its shape to an oval for improved usability, and make notches the shells around button placements.Audio:While the sound quality is excellent, there is room for enhancement. Adding support for (HIFI) Bluetooth codecs such as aptX Lossless and LDAC/LHDC would allow the headphones to utilize the potential of the eight drivers fully.Cable:The choice of material for the cable's outer jack is less than ideal. Additionally, the cable is too short, tends to tangle easily, and has a less secure connection to the headphones. This can lead to sound issues with even a slight cable tug. My listening experience changed drastically when I replaced the supplied cable with a balanced cable. The difference is night and day!In conclusion, the headphones offer a sleek design and good sound quality but have several areas for improvement, and addressing them would undoubtedly position the headphones as a competitive option with higher-priced headphones."
        },
        {
          "Note": 4,
          "Lieu": "SE",
          "Pseudo": "Kim Gren",
          "Nb_Reviews": 13,
          "Date": "2023-11-03T20:21:55.000Z",
          "Titre": "Everything sounds great except for…",
          "Contenu": "Everything sounds great except for the annoying voice when you turn the device on/off. And they feels quite big as well. But I’m satisfied with them anyway."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mittens",
          "Nb_Reviews": 2,
          "Date": "2023-11-07T23:33:51.000Z",
          "Titre": "Worth the annoying wait",
          "Contenu": "The inaccurate timelines for delivery got old but the product is great and it did eventually get to here"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Aiden Cantrell",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T06:11:11.000Z",
          "Titre": "Great headphones!",
          "Contenu": "Only thing I wish they had was a customizable EQ app, which I think they said they were making soon."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "André Charest",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T00:33:53.000Z",
          "Titre": "I changed my address and the headphones…",
          "Contenu": "I changed my address and the headphones were shipped to the wrong address. HEAVYS sent new headphones and I received them with a delay of 4 weeks. The headphones lived up to my expectations. Thanks HEAVYS"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christopher W",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T22:51:40.000Z",
          "Titre": "Truly a 5 star product having been just launched.",
          "Contenu": "Truly a 5 star product being a newly launched design. Giving 4 stars, as I believe in continual improvement. Keep going, and stand by the values that got you to where you are.What I Love (Pros):4 Drivers per ear, including 2 tweeters - This was my dream for a long time to have the sound stage capability that these headphones have. The foundation is here!Comfort - Yes, yes, yesButtons & Ergonomics - Nicely done, intuitive, excellent feedback from the controls.Noise Canceling - WOW......they nailed it. Some of the best noise canceling I've experienced, and I have A320 Bose for flying planes. I've been using these while mowing the lawn and using other yard products....absolutely amazing.Bluetooth - It connects to two devices, so when I forget to disconnect my phone or tablet I don't have to get up and find where the other device is to disconnect it.....how did you manage that? :). Bluetooth distance - Also wow.What I hope to see added & improved:Software/App to control features:I would like to be able to disable the bluetooth connected light, the only thing that stops me from using these in bed is that the light wakes up my wife.I'd like to be able to control the volume, or disable the \"Power On\" / \"Hellblocker Activated\". Love the metal voice, and it's cool as heck but it's a bit too loud. Equalizer: PLEASE PLEASE PLEASE :) I know Axle is a great sound engineer but everyone perceives sound a little differently, and unfortunately there is no standard when mixing music. I had to pay for and download an equalizer app, but it's not 100% compatible. I would love for the Heavys team to design and offer their own equalizer."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Klant",
          "Nb_Reviews": 2,
          "Date": "2023-11-02T11:23:45.000Z",
          "Titre": "The wait was long",
          "Contenu": "The wait was long. Headphone is great. Really like that you can plug them into a pc with usb so use them wired that way. Personally i dont find the headbamd to comfy. Feels like the foam is a litttle to soft. Overall i am happy"
        },
        {
          "Note": 4,
          "Lieu": "PT",
          "Pseudo": "JOÆO NABAIS",
          "Nb_Reviews": 2,
          "Date": "2023-11-01T13:50:12.000Z",
          "Titre": "A Promising Start for a new Brand!",
          "Contenu": "Despite the delivery delays, they had a proactive communication regarding the whole shipping process, which was specially important during the custom duties.For a first in hands experience in the Headphones segment, the Heavys H1H sound a bit daunting when it comes to weight and size when compared with their peers. The jack input is a bit small to find when you are plugging in with your heaphones already set and it may take some time to search with your fingers until you find it.These are minor turnarounds when compared with the experience of the heaphones - they really live up to their name. The sound depth is amazing no matter what music you are listening to (atmospheric and ambient sounds are a really imersive experience) and the volume does not sound too agressive to your ears. Active Noise Cancellation (ANC) is also available, but the earcups are so robust and good that passive sound isolation is self sufficient for the majority of your use scenarios.In short, the H1H are a good start for a newly created company and a great option if you want to explore beyond the brands already established in the market. The Heavys are also developing an equalizer application that will allow you to adjust your sound settings in the future and allow to explore further the potential output of your headphones - give them a try!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William Carlson",
          "Nb_Reviews": 2,
          "Date": "2023-10-31T18:06:05.000Z",
          "Titre": "excellent product, but the wait...",
          "Contenu": "excellent product. the wait was way too long. you're going to have people cancel and get something more available."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Freemen Norton",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T19:16:31.000Z",
          "Titre": "It took a long time for me to get my…",
          "Contenu": "It took a long time for me to get my headphones, but now that I have them I absolutely love them. Great product! One thing I love about them is the incredible battery life. I haven’t needed to charge them since I got them"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Michael Kennett",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T02:51:27.000Z",
          "Titre": "If you don't mind the waiting, they are awesome set of headphones. …",
          "Contenu": "I got the headphones and they are great. I still haven't received the covers yet. It also took 8 mths to receive the headphones. I'm very happy with the product just took way too long to get it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "kyle",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T23:25:20.000Z",
          "Titre": "The audio quality is great.",
          "Contenu": "The audio quality is great.I'd design the on-off to have a different tactile feel so you can find it in the dark easier. Also put the hell blocker on a different switch like a rocker switch or something that feels more badass Regardless, I'll be wearing these bad boys for a long time"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T15:36:19.000Z",
          "Titre": "Must have for heavy metal enthusiasts",
          "Contenu": "Excellent quality, fast shipment, highly recommend for heavy metal enthusiast. Tip: remember the audio can only be as good as the source.. use a high quality source like a (DAC)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edward Rising",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T14:46:08.000Z",
          "Titre": "These are by far the best headphones…",
          "Contenu": "These are by far the best headphones I've ever owned, completely blocks out all outside noise when I'm working out so I can focus, battery life is amazing, connects in seconds, and very comfy"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lance Kirby",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T20:47:29.000Z",
          "Titre": "Well balanced sound!!",
          "Contenu": "I am very happy with Heavys headphones. The music is very well balanced through the songs. I can put any rock from Chuck Berry to rage against the machine to 1812 overture, not to misplace country but ya that's good too. I am almost legally deaf, and have struggled to find headphones that can tolerate turned up full blast all day,needless to say they don't last long. So my point is I hope they can run all day for more than a couple weeks. Spectacular sound!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erin Russo",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T14:37:36.000Z",
          "Titre": "Wonderful sound and leveling.",
          "Contenu": "They came so quickly and I loved the financing options and the carrying case. My husband ordered some from the kickstarter and when I tried them I really liked them. Glad I got a pair finally!  They are awesome with Egyptian music too by the way."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Doland",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T04:54:53.000Z",
          "Titre": "The sound is fantastic",
          "Contenu": "The sound is fantastic! This is the best pair of headphones I've ever owned. The build quality is great. I'm less than an hour into my listening experience, and can't wait to keep putting these cans through their paces."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julie Taylor",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T15:32:42.000Z",
          "Titre": "A+ Customer Service",
          "Contenu": "These were shipped in a reasonable amount of time (especially for the holidays). It did get held up for a bit during shipping, but customer service was very quick to respond and to look into it. They are a christmas gift so I can't review the sound quality yet."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terry Forkell",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T18:02:30.000Z",
          "Titre": "Love em!",
          "Contenu": "Love em!! Using them for mixing and music production and of course casual untethered listening around the house."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Treyton S.",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T19:19:55.000Z",
          "Titre": "Customer service was great",
          "Contenu": "Customer service was great, I haven’t received my headphones just yet. I wasn’t aware how long standard shipping would take so I’m crossing my fingers that the wait and anticipation will be worth it next week."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christian Cairy",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T17:32:10.000Z",
          "Titre": "Love the dynamic range",
          "Contenu": "Really like the quality of the headphones! The sound is very well balanced, and I live the way they bring dynamic range to the table for listening experience. Out of the box these headphones sound good. I would like to see an app come out so i am able to play with the mix a bit for more of s custom listing experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dale",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T05:51:42.000Z",
          "Titre": "Great product for the Hardcore jamz!",
          "Contenu": "Awesome! May need to go to equalizer on whatever playform you have and adjust to liking but sound badass!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ragnar Cummins",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T05:59:34.000Z",
          "Titre": "Amazing",
          "Contenu": "Finally received the headphones, as soon as I powered them up and started playing my music they just blew me away! The sound quality is mind blowing and they keep on getting better and better!Thank you Heavys!!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Toni",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T14:44:31.000Z",
          "Titre": "Great, comfy headphones",
          "Contenu": "I love my new headphones. My only complaint is that the headphones are a little big on my head. They slide down a bit sometimes. But beside this issue the headphones are great, the soundproof option is also very good :)"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Sem",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T15:35:21.000Z",
          "Titre": "Worth the wait!",
          "Contenu": "Product sounds absolutely great! Great customer serviceWorth the wait for sure, highly recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Cooney",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T21:26:26.000Z",
          "Titre": "Heavys are awesome",
          "Contenu": "Very impressed with these headphones, especially the richness of the bass. I would highly recommend to anyone that loves listening to rock and roll."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cameron Maki",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T05:26:09.000Z",
          "Titre": "Amazing product, and even better experience",
          "Contenu": "The people of the company gave me updates on all of the things that my product was going through. When the product came I have never put them down since"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tay Von",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T18:15:26.000Z",
          "Titre": "Not a Heavy Metal Guy",
          "Contenu": "Not a Heavy Metal guy, but these headphones have been perfect in my experience. Excellent sound, nice design, quality build and material. I have had headphones that I could only wear for a couple hours before my ears began to ache, and I can happily say I have worn these for 4-5 hours at a time with no issue! They fit perfectly over my ear with a comfortable yet snug fit. Highly recommend for ANY type of music lover! These are absolutely worth the price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dustin Carter",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T20:32:43.000Z",
          "Titre": "The Heavy H1H headphones really deliver!",
          "Contenu": "Whomever is running their IG account has been awesome with communication and answering my questions, always prompt to get back with me."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Michelle Fleur Button",
          "Nb_Reviews": 3,
          "Date": "2023-12-15T04:07:21.000Z",
          "Titre": "Best sound I’ve ever had",
          "Contenu": "Fast delivery! Headphones are amazing! Immediately played Arch Enemy- Nemesis, sooooo smooth to listen through these:) would absolutely recommend to all."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Don Scheirer",
          "Nb_Reviews": 5,
          "Date": "2023-12-19T16:42:58.000Z",
          "Titre": "Awesome set of hesdphonez",
          "Contenu": "These headphones are solid! Very nice quality, sound is very clear, loud and just awesome!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr.M.Jno-Baptiste",
          "Nb_Reviews": 5,
          "Date": "2023-12-15T14:36:16.000Z",
          "Titre": "Ordered and delivered as advertised.",
          "Contenu": "Ordered and delivered as advertised. Worked almost straight from the box. They work and sound amazing. All the controls are easy to find and have a great feel to them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin Mattern",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T23:25:21.000Z",
          "Titre": "These guys are AWESOME",
          "Contenu": "These guys are AWESOME! ordered last friday, got em wed, great shipping experience. I got the bundle with case and cord. very nice case. i got a pair of shells and putting them on was a lil hard but you just gotta pull hard. the headphones are the best i have ever had, I have been jamming for 30 years and these are the best headphones. I did find however if you download a equalizer app to make the headphones really come alive. Finally I have a pair of headphones i cannot turn all the way up, THANK YOU HEAVYS CREW!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "tony jarmond II",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:09:21.000Z",
          "Titre": "Can’t wait to receive my Heavy’s",
          "Contenu": "I haven’t gotten my Heavy’s yet but so far so good. Can’t wait to get them and try them out🤘🏾😈🤘🏾"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ben",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T04:46:17.000Z",
          "Titre": "Original backer, forever fan",
          "Contenu": "I'm an original backer and I've had my Heavys for about 2 months now and I can honestly say they're fantastic. Best headphones I've ever had. Thunderous sound quality when blasting the metal, and crystal clear mic for doing conference calls at work. They feel great, they sound great, they're comfortable as hell. I even smile every time the \"hellblocker\" voice activates. 10/10"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Ayube",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T15:38:10.000Z",
          "Titre": "Great quality and sound.Does exactly…",
          "Contenu": "Great quality and sound.Does exactly what it was designed to do."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "donn Robinson",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T19:58:43.000Z",
          "Titre": "They took 3 weeks  to get them I am…",
          "Contenu": "They took 3 weeks  to get them I am beyond expressed  I like them  boom boom booom"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jennifer n findley",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T13:33:04.000Z",
          "Titre": "They are better than I expected",
          "Contenu": "They are better than I expected. Music makes you feel like back at te concert hall"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marvin Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T04:42:39.000Z",
          "Titre": "Received my headphones quickly and…",
          "Contenu": "Received my headphones quickly and loved them! Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "T Vrancken",
          "Nb_Reviews": 7,
          "Date": "2023-11-22T00:21:05.000Z",
          "Titre": "Love on first kickstarter?!",
          "Contenu": "It caught my eye on social media. I clicked on the kickstarter, and after reading the introduction and the background story, I was sold. 100% Great product because it's made by generic enthousiasts that love metal! And you CAN actually hear that with these headphones!"
        },
        {
          "Note": 5,
          "Lieu": "CO",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-24T19:23:07.000Z",
          "Titre": "WOW....... FINALLY ....",
          "Contenu": "Robust.... all spaces are filled.... great bass.... excellent experience..... Finally a way to experience Metal as it should beDon´t hesitate.... yours get yours right awayCarlos Restrepo"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Welsh",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T16:37:19.000Z",
          "Titre": "Best headphones I’ve owned, and I’ve owned a lot.",
          "Contenu": "Great sound and the Hellblocker noise reduction is excellent. I fly a lot and these are the first headphones that completely eliminate the jet noise. Battery life is outstanding. I will admit I thought they’d be louder from the advertising. I won’t take away a star because they still sound great and I may have had unrealistic expectations. I did download a bass booster which increased my volume somewhat. Overall the best headphones I’ve owned. And I’ve owned a lot."
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "Nina Wohlgemuth",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T17:08:17.000Z",
          "Titre": "Amazing sound experience for all types…",
          "Contenu": "Amazing sound experience for all types of music, especially rock and metal music. I tested and compared the sound quality and listening experience between my apple air pods and Shure Headphones and the heavy’s with or without a EQ present and the compassion was incredible.Great job !"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Melanie Koetsveld",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T05:39:44.000Z",
          "Titre": "I can finally listen to my music…",
          "Contenu": "I can finally listen to my music without distortion and I didn't have to spend ages fiddling with sound settings either.I will never be able to go back.Plus, every time I turn them on the voice makes me laugh."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Tom P",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T05:24:26.000Z",
          "Titre": "Started Headbanging Again",
          "Contenu": "Absolute golden sound quality for heavy music. Noticed small nuanced trills and melodies in songs I've been listening to for literal years. Held on great to my kitchen headbangingCranking the volume doesnt hurt my ears, just straight vibes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brady E",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T18:35:29.000Z",
          "Titre": "It was a long wait but worth it!",
          "Contenu": "It was a long wait for the Heavys, but WELL WORTH IT. They are hands-down the best headphones I've worn. The sound at all frequencies are clear and crisp. The lower frequencies (heavy metal) are clean and. The low freqs drive and completely immersive. Quality of the headphones is everything I'd expect from a high-end headphone. Only one small critique is that the fold mechanism can pinch if you are not careful.  Would 100% recommend to people that appreciate great sound and specially the lower end of the frequency range."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric Burrell",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T01:30:20.000Z",
          "Titre": "I am a Kickstarter original backer",
          "Contenu": "I am a Kickstarter original backer. It took a while to finally get them, but definitely worth the wait. These headphones sound amazing. Unfortunately I’ve never owned a pair of Beats or any other high end brand to compare them to. I am extremely happy with my purchase and so glad I decided to back these."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mel",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T09:31:53.000Z",
          "Titre": "Musical bliss",
          "Contenu": "I've tested these headphones through a bunch of different music genres, and I'm thoroughly impressed with the sound. I've let others sample them and everyone has said they've never heard anything like them. I'm glad to be a happy supporter through the Kickstarter program."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Meshwell Boschmann",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T15:51:28.000Z",
          "Titre": "Rock on Heavys!",
          "Contenu": "After a long delay going into production, Heavys more than made up for it by sending excellent quality headphones. From design, to built and sound, no corners have been cut short. Albeit their heavy weight, they are very comfortable. Their over the ear deep cup design provides great sound isolation on its own, making the active noise cancelation unnecessary in most environments. Their 50 hours battery autonomy, 40 hours with ANC, is also excellent. Combining them with an equalizer app really shows their awesome potential. I am looking forward to Heavys releasing their own app. They do sound more dynamic at medium to loud volumes than they do at low volumes. Overall, I am really impressed by this product and very glad to have backed such an awesome project! Rock on Heavys!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Doublestout42",
          "Nb_Reviews": 14,
          "Date": "2023-11-03T19:40:11.000Z",
          "Titre": "Full blooded, fully featured, massive sounding headphones",
          "Contenu": "Absolutely awesome sounding headphones. These lack nothing in acoustic delivery, whether you are ripping out Motorhead or jumping around to the Prodigy, these deliver it all. I signed up as Kickstarter backer over 18 months ago and received my Heavys a few weeks ago. The wait was worth it. As a new product, I am yet to find any teething issues. Build quality is rock solid, the function buttons are firm and are very comfortable to wear. The \"hell blocker\" active noise cancelling is a genius touch. The delivery packaging completed the feeling that these are something special. No complaints, looking forward to the case arriving."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brett Blanshan",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T12:37:45.000Z",
          "Titre": "Hands down the best headphones I’ve…",
          "Contenu": "Hands down the best headphones I’ve ever purchased. Absolutely no regrets, I’m planning on buying a second pair for my brother who also loves metal. Rock on my fellow metal head, guy, girl or anything in between, heavy’s are the best 🤘🏻"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Riley",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T01:19:59.000Z",
          "Titre": "Worth the Wait",
          "Contenu": "I was one of the original backers of this project and I won't lie there were times I was frustrated by the two year wait.  When I finally got them, I realized that the wait we endured allowed Heavys to created a damn good set of headphones.  Having been a metal fan going back to 6th grade and now being over 50 I thought I had heard all I could listening hard music most of my life.  First thing I did was play my favorite song and it was like hearing it for the first time all over again.  They are comfortable and quality.  Glad I backed them. The product they produced rocks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Donohue",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T03:44:22.000Z",
          "Titre": "Best headphones I ever used to listen to heavy metal",
          "Contenu": "These headphones were the best I have used to listen to my kind of music. Blind guardian songs were so clear and impactful like I was really there. Other heavy metal music also sound amazing on these headphones. No matter what people say these are definitely better then the other noise cancelling headphones that I have used. That is also including ones like auditechnica and the like. I highly suggest this to all and every metalheads."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeffery Lee",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T04:48:56.000Z",
          "Titre": "Order with confidence",
          "Contenu": "Between my Bose, Apple Pro Max, and Heavys, the Heavys currently win out. Not for every situation, but for rock music it’s a winner and the Hell Blocker noise cancellation might be best in class."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Abrahm Dufort",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T02:13:51.000Z",
          "Titre": "Being honest.",
          "Contenu": "So to be honest, I had some trepidation after I ordered these because I came across a lot of negative reviews, the shipping time was incredibly fast, about 7 days total. As far as the headphones themselves, I am using them right out of the box and I am happy with the sound quality, I am no expert at all but I am satisfied with the product so far. The quality and detail is impressive. I use over ear headphones during my workday and am looking forward to seeing how these do! The fit is a little large, but it works for me!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Steve “Stealth” Davis",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T08:55:39.000Z",
          "Titre": "The extensive marketing paid off!",
          "Contenu": "I was taken in by the marketing of these a good 2 years ago and ended up backing them early on Kickstarter. I've got to say it was worth the wait and worth the time for me to bother with a review. Super happy with these and think they punch well above their weight (and price range). Battery life is awesome, they sound great, plenty of distortion free bass with decent mids and highs. I find the volume to be the perfect amount for me - any higher would be fatiguing. I wear these on the ride on mower mostly and they almost cut out the sound of the engine completely with the noise cancelling activated.Only recommendation for future improvement would be to allow for an extra 10-20mm of travel in the head band to increase clamping pressure for my skinny head. Definitely not a deal breaker but it does mean it can slip forward when I look down while doing activities around the house.Super happy and 100% recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kyle Willis",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T23:03:32.000Z",
          "Titre": "Worth the wait!!",
          "Contenu": "I had to wait close to a year for these headphones, but worth every penny.They are built extremely well and provide nice acoustics, but also deliver heavy freaking sound!  Clean crisp & would definitely recommend to family and friends!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marcus Sherwin",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T05:21:51.000Z",
          "Titre": "Wonderful headphones",
          "Contenu": "I've used nothing but high quality Sennheiser headphones for nearly thirty years and these exceeded my expectations in terms of sound, build and fit. Truly wonderful headphones!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "T. Clark",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T22:05:02.000Z",
          "Titre": "Heavy on quality",
          "Contenu": "Packaged and shipped incredibly well and the headphones themselves are super high quality and comfortable. Very nice detailed sound with all the bottom heavy goodness you could ask for. Horns up! \\m/"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LUKE MILLER",
          "Nb_Reviews": 2,
          "Date": "2023-11-18T04:23:54.000Z",
          "Titre": "Superior to any in-ear pair",
          "Contenu": "I have a decent set of air buds and have had to change a good bit of setting through my phone to get them to sound good when Headbanging. The first time I used the HEAVYS I couldn't believe how great they sound just after turning them on! I have already recommended them to friends and will keep doing so."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T21:08:53.000Z",
          "Titre": "They sound awesome",
          "Contenu": "They sound awesome for all types of music.They weigh quite a bit but that's probably understandable considering the amount of tech in them, isn't a problem at all. Great headphones. Will probably buy a pair for my sister's birthday."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bradzilla",
          "Nb_Reviews": 2,
          "Date": "2023-11-11T02:11:10.000Z",
          "Titre": "Quality that was worth the wait.",
          "Contenu": "Although it took a long time waiting for development and production, the Heavys crew kept updating the backers each step of the way so we could keep track of every bit of progress.  All that development paid off in a set of headphones that was just as described.  The sound is clear and full, obviously suitable for heavy music but good for listening to any style.  The built-in Hellblocker noise cancellation works well for keeping rumbly sources from interfering and I could see these being a good option when traveling.  The bluetooth range is excellent, and having a passive option is really nice too, as well as the ability to use them as a DAC to plug directly into the computer.  They're also very comfortable to wear for extended periods, and they seem to have a long battery life.  The voice when changing options is a nice touch too."
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "AVGERINOS AVGERINOS",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T23:16:52.000Z",
          "Titre": "Powerful Headphones",
          "Contenu": "Heavy helped me on every stage of the order process and these headphones are such a pack a punch, Im using them everyday listening to all types of metal. I like it when I find music that can make them tremble as well as having goosebumps when they do, it makes the listening experience so much awesome!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "José Angel Díaz Salgado",
          "Nb_Reviews": 2,
          "Date": "2023-11-08T03:57:41.000Z",
          "Titre": "These headphones are really great",
          "Contenu": "These headphones are really great! The sound quality is exceptional. Not only for hard rock and heavy metal, but for any other musical genre. Materials seem durable and sturdy and they are comfortable to wear."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Mark Holbrook",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T06:47:09.000Z",
          "Titre": "After trying my sons I bought a pair…",
          "Contenu": "After trying my sons I bought a pair within five minutes. Wireless, brilliant sound, fantastic battery life, easy control and pairing. The only negative was waiting to get them… Would be more than happy to recommend them and already have."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LEVI YOCKEY",
          "Nb_Reviews": 2,
          "Date": "2023-11-12T22:56:27.000Z",
          "Titre": "Heavy AF",
          "Contenu": "The Heavy’s experience is unlike any I’ve had, since I started living in my headphones at a young age. You can hear each and every aspect, as it is intended, and not distorted. 666/10, would recommend 🤘"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tommy G",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T04:23:42.000Z",
          "Titre": "Great Customer service",
          "Contenu": "Great Customer service Headphones are the best, I’ve ever had. And being a Rock Musician I have had, and used several different types of headphones."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "MK",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T18:49:22.000Z",
          "Titre": "Heavys - A new sound experience",
          "Contenu": "A great dealer with a new, innovative product at an amazing price-performance ratio. The buyer is always informed about the current status of the purchase. There is also detailed information about the company, the operation and the development of the product. The Heavys headphones have an amazing powerful and detailed sound. Punch and range are awesome. Bluetooth connectivity is very quick. Wearing comfort and operation are great. But the headphones are big, so I will not wear them outside, but that’s just a matter of taste. With a head circumference less than 56cm the headband is at it‘s minimum position and shaky while headbanging. In total these headphones can easily keep up with much more expensive headphones from known big brands. So my overall result is 8,5 of 10 points, just based on the sound 10 of 10 points. Well done heavys!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T16:18:28.000Z",
          "Titre": "Excellent experience and product!",
          "Contenu": "The entire experience from pre-order to delivery has been exceptional. Regular updates were provided for shipment dates and once shipped it was delivered in a timely manner.Now the product itself is spectacular. The sound quality is everything promised and I would highly recommend these to anyone who may be on the fence about purchasing them!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kyle Sweeney",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T18:24:12.000Z",
          "Titre": "Best headphones 🎧 i've ever owned",
          "Contenu": "Best headphones 🎧 i've ever owned . Nothingface rips! R.I.P. Matt Holt."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alex S",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T15:32:26.000Z",
          "Titre": "Beautifully crafted headphones…",
          "Contenu": "I have had these for about 2 weeks now and I have to vouch for these headphones. The sound quality is beyond any I have owned in the past. Hell blocker mode puts you into a solid sound proof room where you can hear each song on a different level. The beauty of these headphones it allows you to hear the imperfections of each song which gives you a different take of the actual songs and the true talent that the musicians have. I feel these headphones are not just for heavy metal, they make EDM, pop and rock sound solid. The bass really stands put and is smooth with very nice clears and mids. They don't have the option for modifying the low mid and high range at this time but I don't feel that is a deal breaker for me. Over all for the price these headphones are worth it in my opinion but I'd commend you to try them for yourselves."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stuart Griffin",
          "Nb_Reviews": 2,
          "Date": "2023-11-13T17:17:09.000Z",
          "Titre": "Heavy Headphones Are Great to Listen to Heavy Metal and Other Types of Music",
          "Contenu": "The headphones were designed to listen to heavy metal. Thus, the name. Heavy metal does sound good on them. I have also used them to listen to pop, alternative, EDM, and other music. They sound good through the headphones too. I can hear the various elements of the music through them. The headphones are really well built. They are a bit heavy in weight so I wouldn't recommend them for wearing on a daily walk or when you are moving around. They are best used when you are sitting at home listening to your favorite music. I use them when they are connected through Bluetooth to my phone. They have also included a jack and cable in case a person wants to physically connect the headphones to a sound source. This is a nice touch as many companies have done away with physical connections."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ted P.",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T16:50:02.000Z",
          "Titre": "Nothing compares. Not even close.",
          "Contenu": "These are easily the best headset for music I've ever owned. Clarity, thundering bass, outstanding sound quality overall. Plus, hearing that hilarious voice saying, \"Hellblocker terminated\" give me a laugh every time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert A Thiffeault",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T03:12:15.000Z",
          "Titre": "Throw out your old headphones, ya wont need em anymore.",
          "Contenu": "I had my doubts upon pre-ordering the HEAVY'S headphones as i been let down time and time again by companies saying they have the most clear and loud headphones on the market just to be disappointed and out hundreds of dollars in my hard earned money. Not anymore...these headphones were the best purchase i made in audio. I've had the major top brands, from traditional cup earphones to earbuds,  and HEAVY'S is the one clear winner. The headband and cups are strong and durable, the hardshell case offers great protection when not in use, the battery life is perfect, and overall construction is unlike anything else ive had for personal audio. No matter what genre you like (even though they are designed for heavy metal) the sound quality / clarity and loudness of these are perfect for any genre you enjoy. From death metal, grindcore, hardcore punk, all the way to country, hip hop, rap, classical, spoken word, jazz / blues, these bad boys deliver EXACTLY what you want in headphones. The bluetooth connection is simple and easy and even make great headphones for gaming and taking phone calls. The battery life exceeded my expectations even at high volume. If you're looking for durability, clarity, loudness, and good battery life - look no further. HEAVY's is all you need for personal audio to be fully immersed in the sounds you enjoy the most in life. Take your audio pleasures to a new level with HEAVY'S."
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "André Sá",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T17:37:37.000Z",
          "Titre": "I love the sound of the Heavys…",
          "Contenu": "I love the sound of the Heavys headphones.But I found that although you advertise LHDC support on your website, my Nothing Phone (2) doesn't detect it on Heavys but it works perfectly with LHDC on Nothing Ear (2) earbuds on the same phone."
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Pierre",
          "Nb_Reviews": 2,
          "Date": "2023-11-05T19:45:57.000Z",
          "Titre": "The headphones are great",
          "Contenu": "The headphones are great, well constructed. The sound is great, the battery life is great. Slightly missing on the bass side, but should be fixed with the heavys app, or directly on the phone adjusting equalization."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan Vu",
          "Nb_Reviews": 2,
          "Date": "2023-11-14T02:05:16.000Z",
          "Titre": "Worth the Wait!",
          "Contenu": "Took a bit of a wait, but it was worth the wait. It's so comfortable. Especially wearing for long periods of time, I've had experiences where the head band bothers my head. Quality is great. Everything feels solid, and I absolutely love the case that it came with. Thank you guys!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ROBERT",
          "Nb_Reviews": 2,
          "Date": "2023-11-10T20:43:43.000Z",
          "Titre": "They sound amazing",
          "Contenu": "They sound amazing! I did a comparison to all of my wireless headphones and earbuds. These are definitely superior to anything I've used in the past! My quest to find the best wireless over the ear headphones may be over!!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Chris G.",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T22:19:13.000Z",
          "Titre": "Highly Recommend for all music types",
          "Contenu": "Sound is great, comfort is great, battery life is exceptional. These are my new every-day headphones for all types of music and couldn't be happier to Kickstart these. Well worth the money!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GREG",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T10:03:28.000Z",
          "Titre": "BEST HEADPHONES I'VE EVER HEARD",
          "Contenu": "Greatest pair of headphones I've ever owned or heard, amazing immersive sound, punchy bass, great treble, but the mids are the best, also the noise cancelation is PHENOMENAL, would strongly recommend, definitely worth every penny!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Ioan Rogers",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T01:30:26.000Z",
          "Titre": "Great sound quality",
          "Contenu": "Great sound quality. Very comfortable. Controls took a little getting used to for me. Decent noise reduction. Only thing I am missing is a method to update the firmware."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Carsten Schmidt",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T10:29:14.000Z",
          "Titre": "Eargasm",
          "Contenu": "Worth the wait and worth every penny. Whether you listen to \"Nothing Else Matters\" by Metallica or \"Deathbound\" by Get The Shot, you won't be disappointed. 🤘🤘🤘"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael See",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T04:59:31.000Z",
          "Titre": "Hell yes!",
          "Contenu": "Hell yes these headphones are amazing! I am hearing stuff in songs that I've never heard before. Highly recommend"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Erben Moerman",
          "Nb_Reviews": 3,
          "Date": "2023-12-01T11:21:26.000Z",
          "Titre": "Good quality product, good communication from company.",
          "Contenu": "Product has excellent quality. I was a Kickstarter and the order was delayed a few times, but there was excellent communication throughout the process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Caden duverger",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T23:46:50.000Z",
          "Titre": "A great gift for someone special to me",
          "Contenu": "They were a gift to my girlfriend and she's told me how much she loves them so I think you guys did a fantastic job. I regret not getting myself a pair in pre-order there 1000% worth it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lionel Robert",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T01:04:02.000Z",
          "Titre": "Excellent headphones, highly recommend",
          "Contenu": "I have seen these headphones for a while now in ads. I was always skeptical of them. Finally got them and they're the real deal. They may not meet audiophile standards, but for everyday users, these headphones are excellent and sound great out of the box. There is no app to adjust the equalizer yet, but I believe there is one in the works. I love these headphones and use them daily. I use them for gaming and YouTube as well and they sound great. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "nightcore night's",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T17:48:59.000Z",
          "Titre": "Good shiiit",
          "Contenu": "Just got mine today it's amazing the sound is so clear I can focus on any instrument without a problem. It's also easy to operate so that's nice as well"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fuck You",
          "Nb_Reviews": 2,
          "Date": "2023-11-09T20:54:46.000Z",
          "Titre": "I was skeptical.",
          "Contenu": "I was skeptical . . . at first.  Now I'm a believer.  These are what I was looking for in a pair of headphones.First off, I'm finally getting the volume I was missing in other headphones.  It's such a relief knowing that I don't have to max out the volume and still be wanting more.Secondly, they sound GOOD!  Really good!  Having said that, do I wish that there was an app with an EQ?  Yes, I do.  I love having options and sadly, these don't provide any.  Hopefully that will be rectified in the near future.Another concern is the waterproof/water resistant rating.  As far as I know, they don't have one.  Meaning, don't wear them in the rain or working out.  Even walking my dog during the afternoon can make me sweat, and I'm wary of wearing these.Other than these two gripes, these headphones are perfect for me.  Due to an allergy to nickel, I can't wear wireless earbuds without developing severe ear infections, so headphones are basically my only option.  And these deliver.  Big time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arthur Amos",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T20:43:14.000Z",
          "Titre": "Awesome",
          "Contenu": "Took a while to receive mine. But wow they are super high quality. Great for any kind of music but of course I had to crank morbid angel first. Also they are super comfortable right out the box. My absolute favorite feature is the volume knob! Oh that knob feels so nice gives me retro vibes. Only thing I didnt like was the voice when you power it on and off"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-11-17T09:43:47.000Z",
          "Titre": "Highly recommended",
          "Contenu": "The whole shipping process went smoothly and the goods were well packed. The parcel tracking was a little odd, but that's more a thing of the parcel company. I highly recommend Heavys and their products."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Raul Soto",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T18:57:53.000Z",
          "Titre": "It was late the answer of my purchase",
          "Contenu": "It was late the answer of my purchase, I had to write to the company to know if my order was successful. At the end the waiting valued. I’m really enjoying the sound, it’s beyond what I expect"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Luke Schultz",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T14:43:06.000Z",
          "Titre": "Feel the power",
          "Contenu": "The pure raw power I get when I put those headphones on. I love the Hellblocker one of my favorite additions. But the most favorite I have is the quality of sound played through them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lily",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T15:07:50.000Z",
          "Titre": "worth the preorder wait",
          "Contenu": "took forever to show up, but I preordered so I knew that they were going to take a while. They were very transparent about their process of building and shipping and they sent me updates so I never doubted that they would show up. now that I have then they’re amazing ! worth the wait and the money"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Claudio Lassala",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T18:29:27.000Z",
          "Titre": "Great experience from kickstarter to the headphones I now enjoy daily",
          "Contenu": "The whole experience through KickStarter was great; the company kept providing updates throughout the process. The amount of care that went into the process and keeping the backers updated was superb. Release units in batches, incorporating feedback, and improving the product was an excellent approach and the quality shows."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Sturm",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T16:58:19.000Z",
          "Titre": "USPS messed up the shipping",
          "Contenu": "So in a way it’s more the fault of the usps, but I still have not received my pair yet. I will say that I never received a tracking number from you guys until it was too late. I’m currently working with your staff to resolve this situation.Edit: worked with the fine staff to get the situation resolved. Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Håkon Engvig",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T17:23:01.000Z",
          "Titre": "Heavys are METAL",
          "Contenu": "Heavys are METAL! comfortable, amazing sound quality, and a lot of great control options right at your fingertips. The best part though is the voice. It's so awesome."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicholas Hollingsworth",
          "Nb_Reviews": 2,
          "Date": "2023-11-05T19:49:08.000Z",
          "Titre": "Always quick to respond to inquiries",
          "Contenu": "Always quick to respond to inquiries. I've had some issues getting the shells I ordered, but they always answer me the next day. Very professional. And the headphones are amazeballs!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lusty",
          "Nb_Reviews": 2,
          "Date": "2023-11-09T03:17:56.000Z",
          "Titre": "Simply worth it",
          "Contenu": "I needed a few weeks to give an honest opinion and damn… these headphones truly bring metal to life. Especially watching a music video. I cannot be more impressed and happy to own a pair of these masterpieces. HEAVYS brings a sort of live concert feel to your pocket. They are also very comfortable and seem to be very durable and have a nice weight to them. They don’t feel cheap in your hand. There are only 2 issues I have with these headphones. 1. The audible recording you get when you turn them on and when you turn on the “hell blocker” noise cancellation. While the deep menacing voice it rather cool it does get bothersome after a while and I wish there were a way to turn it off. 2. The active noise cancellation itself is not that powerful. It does help quiet some unwanted white noise while jamming out to your favorite set list or band, but at the same time it just isn’t powerful enough to block out background noise and nearby conversation. Overall, these headphones crushed it. I’d give them a solid 4.5 out if 5. Definitely worth the wait, the hype, and the money!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Martinelli",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T20:38:13.000Z",
          "Titre": "I had been looking forward to these…",
          "Contenu": "I had been looking forward to these Heavys for a good minute, and they did not disappoint. Super comfy, amazing sound; they really delivered on all of their promises. Overall I'm stoked on my Heavys"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Pereg ArBagol",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T20:49:38.000Z",
          "Titre": "Wouldn't go out without them !",
          "Contenu": "I bought those headphones after a very unsatisfactory experience with expensive Bluetooth earbuds that I had to buy to compensate for the lack of mini-jack port in my new phone. I hated them, they kept falling, the sound was crap, cutting when I ate/drank etc.. I was so p****, I decided to try those Heavys instead, even though they weren't out. I simply stopped listening to music for 8 months.And then they arrived...I'm immensely satisfied by those headphones and have talked about them all around me.It's crazy the way you can hear all kinds of details in the music that you just couldn't hear before.Plus, even though I use them every day, I need to charge them once or twice a week. I've used them on the plane and at the gym and the Active noise control is awesome. Love them, and I'll have to buy a set for my GF since she uses them all the time too.Well done metalheads."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joshua Joyner",
          "Nb_Reviews": 3,
          "Date": "2023-11-14T11:26:28.000Z",
          "Titre": "Great customer service",
          "Contenu": "There was a problem with shipping Usps lost the headphones. Great customer service they took care of it and sent a replacement pair out fast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arnaldo",
          "Nb_Reviews": 5,
          "Date": "2023-11-11T06:09:03.000Z",
          "Titre": "From start to finish",
          "Contenu": "From start to finish, heavy’s has kept in constant contact with me and keeping me in the loop on each stage of development. It was a long wait but DEF well worth it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kyle Frovarp",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T01:00:41.000Z",
          "Titre": "Loving the new musical experiences",
          "Contenu": "Headphone that really sound how they should!  Love hearing songs how they were meant to be heard vs just an bass boost or variable eq settings.  These headphones are built like a tank, sound wonderful and the battery life is great!  Love em so much I have two pairs in my household!"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "cliente",
          "Nb_Reviews": 2,
          "Date": "2023-11-05T22:30:45.000Z",
          "Titre": "The best headphones",
          "Contenu": "These are the best headphones I've ever had, the vocals sounds amazing, the balance of frequencies is perfect, and the volume so much louder than the others. 10/10."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carolyn Rinne",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T01:20:04.000Z",
          "Titre": "The explosion of sound will not disappoint.",
          "Contenu": "I didn't have to wait too long to receive the headphones, and I've been enjoying them for days now. The sound is incredible. I have no regrets about buying this product!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Sharon Golomb",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T15:23:55.000Z",
          "Titre": "The best headphones i ever had!!!",
          "Contenu": "These are the best headphones I have ever had. The sound is amazing!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andres Bermeo",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T06:04:57.000Z",
          "Titre": "The only thing I can say is that…it sounds very good 🤘🏽",
          "Contenu": "The only thing I can say is that listening to heavy metal with my heavys headphones 🎧 is a unique experience.. each sound is completely detailed and I enjoy it a lot.. 🤘🏽🤘🏽"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Devin Musser",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T17:57:23.000Z",
          "Titre": "Hell Yeah Heavy's",
          "Contenu": "These headphones go above and beyond what I was expecting. They bring out pitches and sounds in songs that I have never heard before. Rock on Heavy's Family!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Max",
          "Nb_Reviews": 2,
          "Date": "2023-11-07T22:12:54.000Z",
          "Titre": "Heavy by name, Heavy in sound!",
          "Contenu": "The BEST headphones, the ONLY headphones you need to listen to the best music out there. I was a little sceptical about these headphones when I saw the Kickstarter campaign, but I have been blown away with everything they have to offer and am so happy I backed them.The comfort, the style, the sound!Obviously when buying headphones, the first thing you want is the best, clearest quality, and loudest sound and Heavys deliver 200% on that. I have listened to rock/metal from the 70s to the current day to get an idea of the range and quality these headphones offer and am hearing things I hadn't before on songs I've listened to a million times. The comfort is another key aspect and because they are so robust and strong it makes them probably slightly heavier than other headphones, the padding/cushioning makes them incredibly comfy on the top of the head and around the ears which negates the slight heaviness. I've had these headphones for 3 months nearly and used them every day for at least 30 minutes up to 3 hours and the padding has kept its shape.If anyone is considering buying a pair or two or three, of Heavys headphones, I cannot recommend them enough, you will not be disappointed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chelsea",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T19:44:59.000Z",
          "Titre": "The sound quality is amazing and the…",
          "Contenu": "The sound quality is amazing and the headphones themselves have a great solid feel. I particularly like the voice that's used to indicate it's on and other features."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Jonathan Pardo",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T13:45:51.000Z",
          "Titre": "Tone knob?",
          "Contenu": "Great tone and volume.Wouldnt mind a tone knob tho"
        }
      ]
    }
  ]
}