{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.superlogics.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "dave",
          "Nb_Reviews": 1,
          "Date": "2022-10-07T03:13:24.000Z",
          "Titre": "broken systems sent",
          "Contenu": "SuperLogics sent us broken systems with motherboards that could not properly power the processor leading to massively reduced performance."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2019-01-10T20:53:14.000Z",
          "Titre": "DO NOT BUY FROM SUPERLOGICS",
          "Contenu": "The only reason I am giving this one star is b/c I have to choose something.  Otherwise this would receive a 0.  SuperLogics is by far the worst vendor to deal with when it comes to resolving questions, inquiring existing or past due orders.  SuperLogics is eager to confirm orders and then drop the ball on delivery.  I do not recommend using SuperLogics."
        },
        {
          "Note": 1,
          "Lieu": "AE",
          "Pseudo": "Hossam",
          "Nb_Reviews": 1,
          "Date": "2016-11-29T21:10:50.000Z",
          "Titre": "Shipment is missed",
          "Contenu": "Dear all , Greating from dubai .Once our order ready to ship it's 2 box .. And we are shocked to recive just one box after contact to your team we find the other box is still in your factory .. This point is reduced the shipping cost . Thank you"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Matt",
          "Nb_Reviews": 1,
          "Date": "2018-06-13T18:31:14.000Z",
          "Titre": "Impossible to get something ordered…",
          "Contenu": "Impossible to get something ordered with any kind of rush.  Send Purchase Order and wait multiple days for a response.  If you need something done in a timely matter, I would go somewhere else."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sarah Lussier",
          "Nb_Reviews": 2,
          "Date": "2023-10-23T20:05:38.000Z",
          "Titre": "Responsiveness is lacking",
          "Contenu": "Responsiveness is lacking; it is very hard to get in touch with someone for a quote. This has not been just one time but several. We reach out to existing sales members that we have worked with in the past. Last year we ended up purchasing from a different company! Also the week lead time for a n order acknowledgement is ridiculous!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-02-16T21:57:12.000Z",
          "Titre": "I ordered a rack mounted computer with…",
          "Contenu": "I ordered a rack mounted computer with the accessories I needed, After paying for Expedited Build $100.00, I had to call after 5 days to find out you hadn't even started to build it for some reason that still doesn't make sense to me.. I was told that a part was back-ordered but that part had nothing to do with my order.  Not going to happen again. Not happy at all!!! Refund me the $100.00"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Byron",
          "Nb_Reviews": 5,
          "Date": "2020-09-23T19:19:12.000Z",
          "Titre": "Upon receiving the product I notices…",
          "Contenu": "Upon receiving the product I notices that the keyboard drawer rackmount flange had been bent."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Applied GeoSolutions",
          "Nb_Reviews": 1,
          "Date": "2014-10-02T16:17:19.000Z",
          "Titre": "People : Nice .  Warranty and Next Day Service : Non Existent",
          "Contenu": "\" One year onsite warranty , Next Business Day Service \" ?  \r3 Month old server crashes : \rNo one comes on site . No one answers the phone. Next day means they will call you back in 24 hours. \rThen they send you to call their outside support . \rTotal down time = 14 days .  \rThis purchase was an experiment to see if we could move away from Dell's higher prices and their actual Next Day Service . \rWe can't."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2019-04-16T15:00:21.000Z",
          "Titre": "The computer was received not ready to…",
          "Contenu": "The computer was received not ready to use. I had to go into the bios and change it in order for the operating system to start. This wasted a day of my time going back and forth with the technician from your company."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 1,
          "Date": "2019-10-14T12:31:10.000Z",
          "Titre": "Noisy Power Supplies",
          "Contenu": "After purchasing two systems for CRITICAL infrastructure support we discovered that the power supply (PS) noise was too too loud. After a lengthy discussion SuperLogics agree to replace one pair of the supplies. It took weeks to get the returned acknowledged. The it took two more weeks to find out that the new supplies were being held up for $28 (increase cost of PS and shipping). The new supplies finally came but without the proper mounting brackets or instructions. Overnight shipping was promised on Wednesday. It is now Monday and no brackets have arrived. It has been over four weeks since this all began and our mission CRITICAL system is still offline. SuperLogic computers are superb, Customer Service not so much."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Laurie",
          "Nb_Reviews": 1,
          "Date": "2019-02-01T20:34:27.000Z",
          "Titre": "Late Without Proper Communication",
          "Contenu": "Order was almost 2 months late to their quoted lead time and almost 2 weeks late according to their promise date provided at time of order acknowledgement."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Unsatisfied Customer.",
          "Nb_Reviews": 1,
          "Date": "2020-06-25T17:38:24.000Z",
          "Titre": "Not follow PO instructions."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Live Cell Solutions LLC",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T03:07:40.000Z",
          "Titre": "Unit received with a non-functional…",
          "Contenu": "Unit received with a non-functional high end graphics card. Had to run to Best Buy to purchase a new one.  Real inconvenience."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dennis Rochon",
          "Nb_Reviews": 2,
          "Date": "2022-10-31T15:24:48.000Z",
          "Titre": "This material does not seem to adhere…",
          "Contenu": "This material does not seem to adhere well to wood stoves. Goes on nicely but tends to flake off."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Neil Ayyar",
          "Nb_Reviews": 1,
          "Date": "2019-07-12T11:55:25.000Z",
          "Titre": "The PC I got had an issue with PCIe…",
          "Contenu": "The PC I got had an issue with PCIe slots alignment with respect to the back vertical mounting plane. When inserting a PCIe card on one of the PCIe slots it seems to go well until you try to align the cards vertical mounting plate to the back panel of the PC which seemed to have a larger angle than 90 relative to the PCIe slot.  This causes the card to come up and almost out of the slot."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2020-01-03T23:47:11.000Z",
          "Titre": "Where's the manual I need?",
          "Contenu": "While delivery of the product was not particularly fast (2 weeks), it was what they promised.  The manual for the computer only described how to assemble various modules on the motherboard.  It provided no information suitable for the consumer who must use the computer.  Makes me wonder if they slipped the wrong manual into the box."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Snarl Greywolf",
          "Nb_Reviews": 2,
          "Date": "2017-10-05T18:41:20.000Z",
          "Titre": "Decent overall, but case assembly issues exist.",
          "Contenu": "Overall, the product was fine. It operated as expected, was clean and built well - except for one element. The rack case assembly was sloppy. The top case seam was not straight and had odd bulges - like it was press-fit together and not everything fit inside - but they made it. I'd order from them again and give them one more shot, but if the quality is the same, never again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Customer :",
          "Nb_Reviews": 1,
          "Date": "2015-05-21T19:11:27.000Z",
          "Titre": "Wrong/missing part",
          "Contenu": "I needed to add a ethernet card to a superlogics computer we have but we were missing the PCI-E 1X right angle connector.  I called superlogics on the phone and they directed me to order a specific part.  It came quickly but unfortunately it didn't work for the case we had in that there was a 1\" gap between the card as installed in the case and the right angle connector.  I ended up modifying the case to get it to work."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "saundersb",
          "Nb_Reviews": 3,
          "Date": "2017-01-03T04:38:30.000Z",
          "Titre": "some confusion",
          "Contenu": "Got a quote very fast after contact. Picked from the list. Communication was a bit rugged and response was slow. No follow up when the unit ordered did not arrive and could not get a hold of anyone. Weeks passed and no product. I was finally told computer would be ready after Thanksgiving, finally got the system late December. This has caused us a system delivery in 2016, forcing us to ship late. Have to remove wrong order entry items. For a potential order of 40 systems I would think the company would pay more attention."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Waited",
          "Nb_Reviews": 1,
          "Date": "2019-12-16T21:55:02.000Z",
          "Titre": "We paid for it 11/20",
          "Contenu": "We paid for it 11/20, a UPS label was created on 12/6, 12/10 I emailed to find out why the label hadn't moved and got a reply on 12/11 that it was in transit and finally received it 12/16.It just seemed like a lot of waiting for something in stock!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2017-04-14T22:16:27.000Z",
          "Titre": "Poor QA",
          "Contenu": "The computer touch screen did not work, a bad wire was installed to begin with, then the wires were wired wrong when I got the unit. The support staff very patient and friendly but the unit was not plug and play ready. I may pause before buying again, not sure."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Christopher",
          "Nb_Reviews": 3,
          "Date": "2019-02-22T14:01:25.000Z",
          "Titre": "Order Processing,",
          "Contenu": "Order Processing,Ordered in December and didn't receive touch screen till February after numerous delays and contacts by me.  Nice screen once it did arrive but don't be in a rush..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Customer :Automation Industries Corporation",
          "Nb_Reviews": 1,
          "Date": "2015-08-28T18:39:46.000Z",
          "Titre": "Hardware ok but computer setup and sales experience poor",
          "Contenu": "Sales refused to enter the list for purchase I sent them.  Demanded that I search their materials and fill out purchase list from shopping cart so I was forced to enjoy their sales cost myself.  We ordered the product shipped FEDEX second day...they shipped it ground \"because they shipped before their projected delivery\".  Why did they think I requested 2nd day FEDEX?\rIn starting the computer up, someone had selected \"external monitor\" instead of \"monitor\" and for two hours, we tried to get icons to appear on the desktop because of this.  Our software guy, an ex Bell Labs guy, called vendor's service department and Microsoft and neither had a solution.  We discovered this ourselves by accident.  Then, in order to load our software, we were forced to connect to the internet and download 147 updates and install them.  All this made a 6 hour, 2 man job out of a 30 minute job.  We would not recommend this outfit.  Hardware seems ok."
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "GERALDINE",
          "Nb_Reviews": 1,
          "Date": "2016-05-19T07:55:08.000Z",
          "Titre": "ESTIMATED SHIPMENT DATE",
          "Contenu": "Wrong estimation of estimated shipment.No information given for 2 different shipments.No shipment notification."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 1,
          "Date": "2017-12-14T17:57:26.000Z",
          "Titre": "PC configuration was not as expected",
          "Contenu": "PC configuration was not as expected. Motherboard specs were not clearly explained in online documentation"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2018-03-19T19:03:55.000Z",
          "Titre": "I received excellent service and the…",
          "Contenu": "I received excellent service and the person handling my request was very considerate."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Premanand",
          "Nb_Reviews": 1,
          "Date": "2017-04-27T02:03:39.000Z",
          "Titre": "I had a grievance on the supply and …",
          "Contenu": "I had a grievance on the supply and addressed to different people. No replies."
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "Daniel Rincon",
          "Nb_Reviews": 1,
          "Date": "2019-03-01T20:59:43.000Z",
          "Titre": "Lead time too long."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T19:29:15.000Z",
          "Titre": "Good customer service",
          "Contenu": "Good customer service.  Fair prices. Easy purchase process."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gregory A Friedman",
          "Nb_Reviews": 5,
          "Date": "2023-05-11T18:11:10.000Z",
          "Titre": "From Order to Delivery and Install",
          "Contenu": "From Order to Delivery and Install, everything has been perfect.  My only criticism is that SuperLogics does not provide a single disc recovery solution to permit the buyer to restore the hard drive or restore / fix windows conveniently. They give you what you need after the fact if you request it.. Curious. Great box!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dmitri",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T18:15:43.000Z",
          "Titre": "Some issues",
          "Contenu": "The PC looks good, hopefully it will be stable and last long. I gave four stars because of two issues:1. There was neither my name nor phone number on the address label; the box was just left at the doors of the building. There was no way to understand who should be notified about the delivery;2. I chose Ubuntu as an OS. A note came with the PC with a user and root passwords, but the root password was actually never set and, of course, did not work."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ray",
          "Nb_Reviews": 2,
          "Date": "2021-10-07T19:56:50.000Z",
          "Titre": "I was not aware of the rack size…",
          "Contenu": "I was not aware of the rack size represented by the initial part number such as 2U, 3U, etc. I purchased a computer with a PCI slot BUT the PCI card will not fit in the slot due to the case not being tall enough to accept it. I found a PCI to Mini PCI adapter which allowed me to install a mini PCI card into a regular PCI slot withtout enough to install a PCI card."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dwight",
          "Nb_Reviews": 2,
          "Date": "2020-08-28T16:06:32.000Z",
          "Titre": "Great Equipment, Communication could be better",
          "Contenu": "Once the servers arrived everything was in proper working order and we were able to deploy them in a couple of days after receiving them. No issues with the hardware upon initial setup. Time will tell if they stay defect free. Only issue is that the motherboards for each were on backorder. Would have appreciated more communication from the sales department that the order was delayed. I had to contact them after shipment didn't happen as expected (delayed 1 week+)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Industrial user",
          "Nb_Reviews": 2,
          "Date": "2021-02-17T21:19:26.000Z",
          "Titre": "Good solid product",
          "Contenu": "Good solid product. Nice heavy bezel for industrial application. Screen brightness and clarity very nice. Overall a nice product. The comments below are just a wish list.Port layout not very convenience. HDMI cable from CPU to touch screen very heavy and cumbersome. Would like to see a more flexible cable with perhaps one end at 90 degrees. Also not crazy about having to used two power supplies. One for the CPU and another for the LCD screen. It would be nice if you supplied single power supply with two leads, one for each."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Julia Carvalho",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T16:55:54.000Z",
          "Titre": "Considerate",
          "Contenu": "The person who helped me was supper considerate and solved everything quickly. It was a great experience and I hope to do business with SuperLogics again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2021-09-25T01:12:54.000Z",
          "Titre": "Good website and ordering",
          "Contenu": "Good website and ordering Would have appreciated some more updates on the order- basically you order, see the order is “processing “ for over a week then suddenly it shipsI like the computer, and everything is what I ordered.  The fans are a bit loud."
        },
        {
          "Note": 4,
          "Lieu": "MV",
          "Pseudo": "toy",
          "Nb_Reviews": 2,
          "Date": "2023-03-23T11:27:53.000Z",
          "Titre": "Good searchability and variety",
          "Contenu": "Good searchability and variety. Also it's great that there are little notes here and there about long production cycles and so on. Always my go to to build a custom server."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Guy",
          "Nb_Reviews": 1,
          "Date": "2021-06-10T20:00:03.000Z",
          "Titre": "Came Through When It Was Needed.",
          "Contenu": "The original order had a leadtime. Unfortunately, it was too long for me to wait. I was provided with an optional device which met my criteria. They took the lead and offered a resolution, did not add to the problem. Great service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2021-09-02T21:25:10.000Z",
          "Titre": "Service is great but a few case oddities",
          "Contenu": "Overall I am very happy with my experience. The server is working great and came quickly (I paid for rushed production). I had never built a server before and the staff member I spoke with online was very friendly and helpful.There are 2 disappointing things about the server however, which is why I couldn’t give them 5 stars.1. The machine came with a 3D printed back plate that contains the network ports and standard connections. It’s not even a thick 3D printed plate and I’m slightly concerned about it heating up and warping over time as the server sits in the rack. I was assuming that for $2500 I wouldn’t end up with 3D printed parts.2.  The rack ears are about 1/8” wider than standard rack ears. This means the server won’t fit in my off-the-shelf rack case that I need to use it in. Right now it’s just sitting in there, but I’ll eventually need to take a grinder to the ears to get them to fit.So to recap, very happy with the core of the server and the service I received from SuperLogics, but a bit disappointed by the build itself."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jaret Peery",
          "Nb_Reviews": 2,
          "Date": "2023-04-25T17:18:05.000Z",
          "Titre": "They have great products and are…",
          "Contenu": "They have great products and are willing to help fulfill your needs. They are fairly responsive too."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JK",
          "Nb_Reviews": 1,
          "Date": "2020-01-27T21:37:29.000Z",
          "Titre": "Had a problem getting the order filled…",
          "Contenu": "Had a problem getting the order filled correctly, but they were quick to fix the problem."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2020-03-06T22:54:10.000Z",
          "Titre": "Small problem with installation",
          "Contenu": "Small problem with installation. Great customer service helped fix it quick."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Terry",
          "Nb_Reviews": 1,
          "Date": "2020-09-30T13:16:35.000Z",
          "Titre": "Provide more information on expected…",
          "Contenu": "Provide more information on expected ship date and notification when the product is shipped."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "D. Hansen",
          "Nb_Reviews": 5,
          "Date": "2019-11-19T19:07:42.000Z",
          "Titre": "SuperLogics' response to orders is…",
          "Contenu": "SuperLogics' response to receiving and processing orders is great. We've used them several times. For the first time, I needed to return my last order, and the process to get an RMA was delayed a couple weeks due to a series of unfortunate events. Tech Services was swift to correct the issue when they learned of the complication.I appreciated the tone of their acknowledgment and quick resolution of the problem."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 3,
          "Date": "2016-12-15T23:41:03.000Z",
          "Titre": "Very small correction needed",
          "Contenu": "All went very well with the purchase and the product itself. On a shipping notice, this appeared  \"Please note the TRACKING NUMBER IS AT THE BOTTOM OF THE BODY TEXT OF THE INVOICE FOR YOUR REFERENCE.\" It wasn't. Small point but since I like to schedule my work, not knowing when it would arrive was noticed. If that had been there, this would have been a five star review."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer :Jim Regan, PCD AV Integration",
          "Nb_Reviews": 1,
          "Date": "2015-06-25T20:10:45.279Z",
          "Titre": "Great People to Work With",
          "Contenu": "Nice site with plenty of options to enable you to build just the machine you need. Calling for clarification or customization is easy-peasy. Build time is reasonable and expedited shipping is supported. \rWe have ordered several systems through SuperLogics in the past few years and will keep them on our short-list."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "J. Nuss",
          "Nb_Reviews": 2,
          "Date": "2019-07-30T12:08:59.000Z",
          "Titre": "Good product selection at good prices",
          "Contenu": "Good product selection at good prices.  The rack mount keyboard is working nicely and appears to be of good quality.  It replaced a twenty year old one that was no longer compatible with current technology.  I hope and trust that we will get twenty years of use out of this one."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nikolai",
          "Nb_Reviews": 2,
          "Date": "2017-06-23T18:01:24.000Z",
          "Titre": "It is getting better",
          "Contenu": "I bought 3 multi PCI slot PCs from SuperLogics.  The first one I got in 2010 and it did not last long. I had multiple problems with it and finally replaced it with new machine (2011) which lasted for 6 years. I replaced it recently (2017) just because it was Windows XP and was not supported anymore. The new machine works fine so far. I have it only for about a month now. My experience with purchasing was very satisfying.  I received good advises for selecting the correct backplan and components for my needs. The price is also very compatible."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T23:19:33.000Z",
          "Titre": "The response time could be improved.",
          "Contenu": "It was exactly what I ordered."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer :Gemini",
          "Nb_Reviews": 1,
          "Date": "2015-02-13T20:43:07.000Z",
          "Titre": "Good with a couple of issues.",
          "Contenu": "The servers arrived with the CD/DVD drives mounted but the connectors to the motherboard were not there. Ou tech took about a day to figure out what the issue was. This was the case on all 3 servers we ordered. \r The servers were ordered around the time of the snow storms out East. I understand this is uncontrollable but did not receive any shipment updates through out the period (until we contacted sales). \r Though we had these issue we have several Super Logics throughout our company and have had few issues.We will continue to order."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brad",
          "Nb_Reviews": 2,
          "Date": "2018-04-09T19:07:28.000Z",
          "Titre": "They for sure kept me informed on the…",
          "Contenu": "They for sure kept me informed on the status of my order.  They were very prompt in answering preorder questions.  They shipped pretty much on the projected ship date.  They must have had to get the part from a supplier since it was a couple weeks from order to ship."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer : legacy manufacturing",
          "Nb_Reviews": 1,
          "Date": "2015-11-19T19:30:57.998Z",
          "Titre": "Hooray for legacy machines with ISA slots and can run XP",
          "Contenu": "The PC runs great so far.  The front USB jacks even work now (on our older units those are miswired). I forgot to order a DVD drive, I wish the sales guy had asked me if I want to supersize anything when I requested the quote :-)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2018-03-16T06:55:40.000Z",
          "Titre": "I think your service is top knock And Recommend Them 100%",
          "Contenu": "I think your service is top knock but your sales of computers customized has something to be desired.  Overall, I'll give it a great rating of the whole experience with Superlogics!!  I definitely recommend them."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "CHRISTINA",
          "Nb_Reviews": 2,
          "Date": "2018-08-10T17:21:14.000Z",
          "Titre": "Response Time",
          "Contenu": "The order was late.  As I later found out the ball was dropped on our application for credit.  The situation was rectified immediately.  An account was set up and the order was shipped overnight prepaid."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer : Tony A.",
          "Nb_Reviews": 1,
          "Date": "2015-12-17T19:11:41.790Z",
          "Titre": "Great Ordering and Delivery",
          "Contenu": "It was easy to order and the delivery was quicker than anticipated.  The only issue was loose hardware for 1 chassis out of 39.  Waiting for a response to have the 1 chassis returned for inspection/repair."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ben",
          "Nb_Reviews": 6,
          "Date": "2019-03-25T21:24:08.000Z",
          "Titre": "SuperLogics responded quickly to my…",
          "Contenu": "SuperLogics responded quickly to my request for assistance and Support helped me through to the solution. The cost of sending in the out-of-warranty server and having it analyzed was reasonable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stewart",
          "Nb_Reviews": 1,
          "Date": "2019-04-02T17:47:23.000Z",
          "Titre": "The ordering process was great",
          "Contenu": "The ordering process was great. The item was delivered in a timely fashion. My only real complaints are very little documentation is provided, and the fan on the unit we bought is very load."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2018-02-26T22:08:46.000Z",
          "Titre": "Good value for the $$$",
          "Contenu": "Good value for the $$$.  The configuration tool seemed to have been changed since I last used it so I got confused creating a custom configuration.  However a chat session cleared everything up."
        },
        {
          "Note": 4,
          "Lieu": "SV",
          "Pseudo": "ALEXANDER",
          "Nb_Reviews": 5,
          "Date": "2019-09-30T23:12:20.000Z",
          "Titre": "Very pleased with Superlogics.",
          "Contenu": "Online selection and purchase was very easy and without any trouble. Just had a little delay with the delivery date, but nothing which impacted our project. Very good equipment! Thanks."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nathaniel",
          "Nb_Reviews": 1,
          "Date": "2016-05-22T20:13:06.000Z",
          "Titre": "Great Product, Slow Delivery",
          "Contenu": "Love the product, but it took two weeks for the order to be processed and delivered. I also recommend buying accessories after market as the 'upgrades' on the website are overpriced."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sterling Systems & Controls, Inc. (Res)",
          "Nb_Reviews": 1,
          "Date": "2014-10-02T15:28:50.000Z",
          "Titre": "Faster delivery times",
          "Contenu": "We have no major problems. we would like the turnaround time a little quicker \rwithout having to pay for it. unfortunately that is the nature of our business we need\reverything right away."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CL",
          "Nb_Reviews": 1,
          "Date": "2018-05-22T17:44:43.000Z",
          "Titre": "4.75 stars!",
          "Contenu": "We have never yet had any problems or issues with SuperLogics. They have always been helpful, on-point, prompt with accurate shipping/delivery, great customer service (such as when we need a last-minute change to an already placed order) and just about anything else we could ask for. The ONLY reason this isn't a 5-star review is because of the markups on some add-ons. The markups aren't awful or unreasonable, just a little bit more than what I can get elsewhere, so on *some* items like RAM (though the ECC RAM is as well-priced as anyone else's, somewhat to my surprise) and expansion/extra NIC's, PCI risers, etc., I wind up having to order them separately from other suppliers.Otherwise, working with SuperLogics has been great, and we will definitely be continuing to order from them as a happy customer!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Larry",
          "Nb_Reviews": 1,
          "Date": "2017-11-07T20:53:16.000Z",
          "Titre": "SuperLogics makes great computers and …",
          "Contenu": "SuperLogics makes great computers and provides super service!  Only reason not 5 stars is initial problem with display.  Quick response to repair, so all is good!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Byron",
          "Nb_Reviews": 1,
          "Date": "2020-02-11T22:36:40.000Z",
          "Titre": "Good Timely Service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 2,
          "Date": "2017-10-12T21:35:58.000Z",
          "Titre": "The SUPERLOGICS delivery was on time",
          "Contenu": "The SUPERLOGICS delivery was on time. One component was not up to standards. The Trustpilot terms and conditions are unwieldy and not conducive to trust."
        },
        {
          "Note": 4,
          "Lieu": "SV",
          "Pseudo": "ALEXANDER",
          "Nb_Reviews": 5,
          "Date": "2018-07-31T02:42:15.000Z",
          "Titre": "Very good estimate of actual shipping…",
          "Contenu": "Very good estimate of actual shipping date. Sales People kept in touch to update delivery date. Products were received in good condition and complete."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "John M",
          "Nb_Reviews": 1,
          "Date": "2014-10-06T05:33:07.000Z",
          "Titre": "Great products, great service",
          "Contenu": "I have used SuperLogics on a number of occasions and have always found both the products and service to be very good. I highly recommend Super Logics."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 2,
          "Date": "2019-02-18T13:37:41.000Z",
          "Titre": "Product designs are excellent",
          "Contenu": "Product designs are excellent; service is responsive.  I wish the motherboards were more reliable.  We have had a rather high failure rate."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 2,
          "Date": "2016-05-01T19:42:54.000Z",
          "Titre": "The web page did not make it clear that SL would have installed Fedora 23 for me.",
          "Contenu": "The web page did not make it clear that SL would have installed Fedora 23 for me.  The web page makes it look like SL will only install windows."
        },
        {
          "Note": 4,
          "Lieu": "AE",
          "Pseudo": "Mohammad",
          "Nb_Reviews": 1,
          "Date": "2020-05-04T17:53:59.000Z",
          "Titre": "Good service.",
          "Contenu": "Good service.Fast Delivery"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2017-04-05T18:48:38.000Z",
          "Titre": "Superlogics has always been a great …",
          "Contenu": "Superlogics has always been a great vendor.   I receive excellent treatment from John Toto.   He's very responsive and supporting."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Giresh",
          "Nb_Reviews": 1,
          "Date": "2017-02-15T14:06:14.000Z",
          "Titre": "Very good & professional service",
          "Contenu": "I had a good experience with my purchase from Superlogics. They were professional and delivered the product on time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Juan Felipe Vallejo",
          "Nb_Reviews": 1,
          "Date": "2014-10-08T13:48:41.000Z",
          "Titre": "Great products and service",
          "Contenu": "Superlogic is a good company, with great service, always available To support with prompt and effective answered."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer : Erin",
          "Nb_Reviews": 1,
          "Date": "2015-04-27T19:16:25.000Z",
          "Titre": "Okay",
          "Contenu": "We received a dud computer and still working on exchanging it. I've had good experiences in the past."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tectonic Technologies",
          "Nb_Reviews": 1,
          "Date": "2014-10-02T15:55:16.000Z",
          "Titre": "Consisten,t promp,t supplier with good customer support.",
          "Contenu": "Good computers at a good price. Good pre-sales support to help pick out features and configurations."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Osama Farooqui",
          "Nb_Reviews": 5,
          "Date": "2020-03-29T16:46:42.000Z",
          "Titre": "Great products",
          "Contenu": "Great products, customer service and delivery performance!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LAB",
          "Nb_Reviews": 1,
          "Date": "2019-12-02T21:51:16.000Z",
          "Titre": "Solid product",
          "Contenu": "Solid product.  It took 2 weeks to make (custom order). Overnight shipping. Great support"
        },
        {
          "Note": 4,
          "Lieu": "AE",
          "Pseudo": "Emilyn",
          "Nb_Reviews": 1,
          "Date": "2017-04-19T07:32:26.000Z",
          "Titre": "Had a good experience dealing with …",
          "Contenu": "Had a good experience dealing with them. Timely responses and good customer service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2016-06-16T22:07:10.000Z",
          "Titre": "No problems",
          "Contenu": "I only purchase products  and don't pick them out but, had no problem ordering"
        },
        {
          "Note": 4,
          "Lieu": "ID",
          "Pseudo": "Willy",
          "Nb_Reviews": 1,
          "Date": "2019-10-22T23:07:40.000Z",
          "Titre": "Response and delivery are fast",
          "Contenu": "Response and delivery are fast. However, download section need improvement."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2019-02-08T16:26:50.000Z",
          "Titre": "Everything was quiet fine but in my…",
          "Contenu": "Everything was quiet fine but in my opinion the shipping took a little long."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2017-05-12T20:00:00.000Z",
          "Titre": "Required minor technical help",
          "Contenu": "Required minor technical help. Got it. Ordered the part. Got it promptly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer :",
          "Nb_Reviews": 1,
          "Date": "2015-03-18T16:06:09.000Z",
          "Titre": "Computer great, shipping time not so good",
          "Contenu": "was led to believe that I would receive sooner than it was received."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "xoxoxo",
          "Nb_Reviews": 1,
          "Date": "2017-08-19T01:02:10.000Z",
          "Titre": "Overall good but got some slow …",
          "Contenu": "Overall good but got some slow responses to voicemails and emails."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Tuttle",
          "Nb_Reviews": 1,
          "Date": "2017-03-09T02:38:00.332Z",
          "Titre": "Great experience ordering and receiving the product",
          "Contenu": "Good customer service. We will use them again in the future"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charles",
          "Nb_Reviews": 1,
          "Date": "2018-10-05T19:00:49.000Z",
          "Titre": "On-line order was processed as expected…",
          "Contenu": "On-line order was processed as expected with no issues."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Mayers",
          "Nb_Reviews": 1,
          "Date": "2018-09-26T18:57:16.000Z",
          "Titre": "Finally I can get a configuration that…",
          "Contenu": "Finally I can get a configuration that meets my needs!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2016-03-25T01:05:03.000Z",
          "Titre": "Got the right stuff",
          "Contenu": "We received the right / correct stuff that we ordered."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kim",
          "Nb_Reviews": 1,
          "Date": "2019-05-07T18:39:00.000Z",
          "Titre": "Very easy to do business with",
          "Contenu": "Very easy to do business with, prompt fast service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer :Paramed USA",
          "Nb_Reviews": 1,
          "Date": "2015-02-02T22:38:33.000Z",
          "Titre": "Good service",
          "Contenu": "Once I got the order in, it was smooth sailing."
        },
        {
          "Note": 4,
          "Lieu": "EG",
          "Pseudo": "Yehia",
          "Nb_Reviews": 1,
          "Date": "2016-07-04T20:45:36.000Z",
          "Titre": "good sevices",
          "Contenu": "nice services"
        },
        {
          "Note": 5,
          "Lieu": "SA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T10:13:39.000Z",
          "Titre": "IT WAS A GREAT EXPERIANCE TO DEAL WITH…",
          "Contenu": "IT WAS A GREAT EXPERIANCE TO DEAL WITH THIS GREAT COMPANY, MANY THANKS FOR LIAM FOR HIS KIND SUPPORT"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T14:03:19.000Z",
          "Titre": "Computer arrived just as order",
          "Contenu": "Computer arrived just as order.  2 month in service still working."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Edgar Pulido",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T16:24:20.000Z",
          "Titre": "PO was easy to follow up and items were…",
          "Contenu": "PO was easy to follow up and items were on time"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AMR PRODUCTIONS",
          "Nb_Reviews": 2,
          "Date": "2023-08-29T03:33:59.000Z",
          "Titre": "Hassle-Free and Easy",
          "Contenu": "Our purchasing process from start to finish was easy, well managed and hassle-free. The website is concise and very easy to navigate. Our Computer arrived in a very timely manner (EXACTLY) as we designed it. Thank You SuperLogics... we will definitely be working with you again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kelly B",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T15:35:05.000Z",
          "Titre": "Glenn and Rich with SuperLogics are…",
          "Contenu": "Glenn and Rich with SuperLogics are FANTASTIC.We placed an order for a few LCDS and wanted to set up payment with Purchase Order. Rich was an excellent resource, following up with the credit department around a holiday weekend. He made sure we did not feel forgotten about! When Glenn sent the invoice, he jumped in to assist me in making sure all of our tax exempt documents were loaded into the system and applied to our invoice. I highly recommend SuperLogics, and will definitely be a returning customer thanks to Rich Constantini and Glenn Ritchie!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 3,
          "Date": "2023-08-29T23:18:09.000Z",
          "Titre": "Great Experience Again  !!!",
          "Contenu": "Very critical on meeting our specifications, exceeded our delivery time and also pro-actively advised of the computer movement.  Great to work with.   Thank you, Rich C., for the help as always."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BC",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T21:55:47.000Z",
          "Titre": "Dell/Lenovo/HP overhead is high & won't meet custom needs.",
          "Contenu": "Superlogics is one of the last companies out there that will build custom configs for you at a good price."
        },
        {
          "Note": 5,
          "Lieu": "BB",
          "Pseudo": "Rick McGlock",
          "Nb_Reviews": 1,
          "Date": "2022-05-03T03:39:53.000Z",
          "Titre": "Great hardware Great service",
          "Contenu": "We came across SuperLogics o line when we were loooku g to get 4 systems for streaming. We had some questions,  called and hapen to get Liam who promptly answered all our question and .made suggestion. At the end of the convo we asked him to send us a quote which was sent in a rimely manner. We did have a delay in the making the order and in that time the hardware became unavailable but Liam again came in like superman and gave us a suitable replacement, constantly updatng us and we should be getting out shipmentshortluy. It was super easy dealing with SuperLogic and the interaction was excellent..There will be out goto now for certain Hardware"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sam Trexler",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T18:25:02.000Z",
          "Titre": "Superlogics team knocked it out of the…",
          "Contenu": "Superlogics team knocked it out of the park. We were on a tight timeline, and they exceeded goals. This company's service continues to impress."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Miguel",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T08:13:08.000Z",
          "Titre": "Great product, even better customer support",
          "Contenu": "Great product, even better customer supportTheir customer support was fantastic to deal with. Very proactive and very prompt to provide assistance. Their products are fantastic as well and hit way above their price point."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dwight",
          "Nb_Reviews": 2,
          "Date": "2021-03-02T21:23:37.000Z",
          "Titre": "Excellent service and good pricing",
          "Contenu": "Excellent service and good pricing. Very satisfied with our experience in buying equipment to meet our needs. We now have 10 servers in use for our video surveillance system. We plan to purchase more as we add additional capacity. Also love the easy to install mounting system for our service rack. It simply \"snaps\" in place, so easy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Randall",
          "Nb_Reviews": 1,
          "Date": "2022-03-22T17:03:06.000Z",
          "Titre": "I am impressed and will recommend them anytime.",
          "Contenu": "First the bad: I think I may have received my shipment a day late, but it was a rush order, shipped completely across the country, and logistics have been a nightmare for a while now.The good: Everything else.  I wasn't paying attention and misordered extra rails. They called to verify what I intended to do. They also said that they had a different part available that exceeded the specs for what I needed from the system, thus giving me some wiggle room... at a reduced price, and would I like to have them make a substitution? Wonderful service on the phone after as well."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Benn",
          "Nb_Reviews": 1,
          "Date": "2021-03-31T06:32:56.000Z",
          "Titre": "I have bought a 1U Atom based PC for a…",
          "Contenu": "I have bought a 1U Atom based PC for a project.  Communication was excellent, always responded quickly and was always helpful.  The PC build quality is very good.  We even had it customized and had extra com ports added.  The price of the PC is very competitive to UK prices beating them hands down.Will be working with this company again and would mostly definitely recommend a look at the very least."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-14T15:27:35.000Z",
          "Titre": "I ordered the wrong computer",
          "Contenu": "I ordered the wrong computer, but did not realize it for a few months. I contacted SuperLogics about this and they advised me on what I should order and gave me credit when I returned the wrong computer. I am happy with their equipment and their service."
        },
        {
          "Note": 5,
          "Lieu": "SV",
          "Pseudo": "ALEXANDER",
          "Nb_Reviews": 5,
          "Date": "2020-07-09T19:26:46.000Z",
          "Titre": "Great experience for several years.",
          "Contenu": "I've been a customer of Superlogics for several years. Each purchase has been processed without any problems and until now I've never had to return a product for warranty reasons. The variety of products is very good and allows me to acquire what is necessary for most of our projects with a single supplier. Thank you very much Superlogics."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 2,
          "Date": "2022-10-04T20:42:48.000Z",
          "Titre": "ineed a fast PC",
          "Contenu": "SuperLogics guided a non computer guy in a direction that best fit our teams needs. We received the PC got it hook up to our machine and all of the problems with data transfer are gone. A fantastic job SuperLogics!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Electexp",
          "Nb_Reviews": 3,
          "Date": "2022-01-20T21:18:33.000Z",
          "Titre": "I've bought and sold electronics for all long time. These guys are good!",
          "Contenu": "I've bought and sold electronics for over 40 years. Every once in a while you luck into doing business with a company that goes above and beyond. This is one such company. John Toto, the director of sales, knows what he's doing and does it right. Great experience in every facet."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Campbell",
          "Nb_Reviews": 1,
          "Date": "2021-06-28T19:06:44.000Z",
          "Titre": "Superb Service, Pricing and Deliverable",
          "Contenu": "The SuperLogics crew got our PC ready 2 days early as it was an urgent need.The PC was just as we ordered and installed without a hitch. We are using this PC in an industry semiconductor tool and we are confident that it will last many years. We  would highly recommend SuperLogics.Oh and the Price is great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gilfoyle's Anton",
          "Nb_Reviews": 1,
          "Date": "2022-01-14T21:40:10.000Z",
          "Titre": "Top Of The Line PERIOD!",
          "Contenu": "Build quality is the real deal, along with options to put what you want inside. Recommend for any Wireline Truck Open/Casedhole, other guys better watch out. WONT BE DISAPPOINTED!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 2,
          "Date": "2021-07-13T22:03:17.000Z",
          "Titre": "It was the first time that I ordered a…",
          "Contenu": "It was the first time that I ordered a custom-built computer from Superlogics. Some parts I didn't know what they were and ended up ordering a redundant item, to which they kindly corrected before assembling the unit.I waited to see if the unit would still be working well after a few months before reviewing as I have had units break down early on before, but Superlogics put together an excellent machine with great parts.Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christian Ryan",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T18:36:06.000Z",
          "Titre": "I recommend SuperLogics!",
          "Contenu": "SuperLogics has been a great company to work with. There are so many vendors out there that fail to even provide basic service, so it has been nice to buy from one that responds quickly and does what they say they will do. Liam Fitts has been there from beginning to end."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 3,
          "Date": "2021-12-15T22:50:26.000Z",
          "Titre": "Hexagon Manufacturing Experience",
          "Contenu": "I have been working with Rich Costantini on assorted projects, his experience and speed to react is excellent. He always works through the issues and helps to define best specifications and delivery lead time.Sincerely,Bill Cocroft"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tracy",
          "Nb_Reviews": 1,
          "Date": "2021-02-09T23:08:40.000Z",
          "Titre": "SuperLogic is awesome",
          "Contenu": "SuperLogic is awesome! I experienced prompt, knowledgable and professional service. I was treated like I was their most important customer and I was only buying one computer. I’m very satisfied with the product and will be purchasing from them again. Thank you for all of your help SuperLogic!Tracy"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 2,
          "Date": "2021-03-01T19:04:26.000Z",
          "Titre": "A strong tradition of quality",
          "Contenu": "This is the 3rd SuperLogics computer I've purchased, the first almost ten years ago.  All have functioned flawlessly and I am extremely satisfied with the quality, service and timely filling of the order.  Thanks again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "EUVT",
          "Nb_Reviews": 1,
          "Date": "2022-04-04T17:24:59.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "PC build was quick and followed our requests. Great packaging and excellent cable management. We unfortunately had a fried motherboard and SuperLogics quickly replaced it under warranty.Great customer service. Will do business with them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Arthur - Creosphere",
          "Nb_Reviews": 2,
          "Date": "2022-12-07T18:33:28.000Z",
          "Titre": "A small client who feels important.",
          "Contenu": "I always receive support like I'm a big client, and I only order a single PC every couple of years. These folks are professional and accommodating, and their commitment to quality can't be matched."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sean Johnson",
          "Nb_Reviews": 1,
          "Date": "2021-07-02T23:22:56.000Z",
          "Titre": "Very prompt in responding to shipping…",
          "Contenu": "Very prompt in responding to shipping issues with UPS. Excellent service. They called the Monday after the order to confirm both the order and details. Stayed in communication regarding product details and options.  Product arrived exactly as ordered, and even with a better performing cooler than the Intel stock cooler, which I was not expecting."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sam",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T14:44:06.000Z",
          "Titre": "Quiet AV System",
          "Contenu": "Great build quality, rack mount PC perfectly fits my Audio Workstation needs, quiet, cool running, plenty of processing room."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dbj Automation Inc.",
          "Nb_Reviews": 2,
          "Date": "2022-10-07T00:22:30.000Z",
          "Titre": "Very happy",
          "Contenu": "I’ve ordered dozens of computers over the last few years from Superlogics and everyone of them is functioning perfectly without a single failure yet. Knock on wood!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trevor Chase",
          "Nb_Reviews": 1,
          "Date": "2022-09-09T01:19:05.000Z",
          "Titre": "Great service",
          "Contenu": "Great service. Got a confirmation call to ensure my order had everything I needed. One of the rack ears was bent during shipping, but no effect on the functionality."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ron",
          "Nb_Reviews": 2,
          "Date": "2021-12-01T14:19:23.000Z",
          "Titre": "Excellent",
          "Contenu": "Excellent service, this is the second server I ordered, quick, excellent customer service, this is the place to go for servers, rack mounted PC's, all in one place,Keep up the great work"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Warren",
          "Nb_Reviews": 1,
          "Date": "2021-01-14T19:42:13.000Z",
          "Titre": "I had never heard of these guys but…",
          "Contenu": "I had never heard of these guys but needed a 1u form factor computer.  I love this machine.  It came with better defaults set up in windows than most windows computers come with and was absolutely free of any spam, crapware, and the like.  I wish I had bought my desktops from them"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nick",
          "Nb_Reviews": 1,
          "Date": "2022-05-11T20:48:12.000Z",
          "Titre": "Great Customer Support",
          "Contenu": "Emailed SuperLogics about fan issues and was given a response right away that was extremely helpful. Helped resolved the issue quickly and without causing any further problems."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Service Coordinator",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T21:20:27.000Z",
          "Titre": "The sales rep new exactly what I…",
          "Contenu": "The sales rep new exactly what I needed. The information from the old unit was documented very well. A replacement was found and shipped quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 2,
          "Date": "2021-09-13T19:16:44.000Z",
          "Titre": "1U Keyboard/Touchpad",
          "Contenu": "1U Keyboard/Touchpad, SL-RMKB-TOUCH-USB-2. All is well with this purchase, from customer support to verify website stock to shipping, very well done."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Advanced Wireless Technologies",
          "Nb_Reviews": 1,
          "Date": "2020-12-20T15:18:05.000Z",
          "Titre": "Custom PC and Server Hardware Extremely Well Built",
          "Contenu": "We have purshased both custom PC and Server Hardware from this firm, both for our data center and our clients for more than 8 years.  Every piece of hardware, regardless of price range has been very good value for the money, extremely reliable, built and supplied exactly as specified, and all hardware we purchased remains in service today.  Some of that hardware is approaching 8 years old.  We have never experienced a failure or an operational or maintenance issue.  Our clients include government, law firms, and other institutional organizations, and are all very happy with the Superlogics hardware we have provided.  Simply stated, this is a Class A supplier and everything we have purchased has exceeded our expectations."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-22T14:48:31.339Z",
          "Titre": "Loading up software, so far so good",
          "Contenu": "I am just getting started loading up the system with my software.  So far so good,  Very fast system in comparison to my I5 I have been using.  Nice footprint.  Fan can be heard but not very loud."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KEITH",
          "Nb_Reviews": 1,
          "Date": "2020-10-28T19:48:16.000Z",
          "Titre": "They had what I needed for my project",
          "Contenu": "They had what I needed for my project, they shipped it faster than ups suggested it would arrive, and it was exactly what I asked for. Thethey followed up to make sure I was happy Thanks for great service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nikolai",
          "Nb_Reviews": 2,
          "Date": "2021-07-12T18:34:19.000Z",
          "Titre": "Very impressed with the online tech support",
          "Contenu": "When I got a problem with my older computer from SuperLogics I called them and they helped me to fix it through online communications. It was fast and efficient. I am very impressed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JW",
          "Nb_Reviews": 8,
          "Date": "2021-05-27T16:56:33.000Z",
          "Titre": "First Order",
          "Contenu": "It's been a little over 2 weeks since I took delivery of the computer. All I can say is GREAT!! simply GREAT!! The last 5 computers I bought were from either Dell or HP and I had trouble on all of them from the start. One I had to send back. I can't believe how quiet this thing is. I love there web site and the ability to save different configurations. John in customer service and Gabriel in support were both very helpful in giving me advice. This is my first rackmount computer but not my last. If they keep this up they have a customer for life."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2021-05-11T19:23:32.000Z",
          "Titre": "John was very helpful in putting…",
          "Contenu": "John was very helpful in putting together a rush order. Also rather impressed with the value on the inside / relatively plain packaging concept.Excellent value overall."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "R Johnson",
          "Nb_Reviews": 1,
          "Date": "2022-09-27T13:51:25.000Z",
          "Titre": "wanted you to know that we are very…",
          "Contenu": "wanted you to know that we are very pleased with the quality of service your company provides. Thank you for the timely deliveries and consistently excellent service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 3,
          "Date": "2021-12-16T23:31:57.000Z",
          "Titre": "Great products",
          "Contenu": "Great products, great staff, and good pricing.  They always have a great set of solutions, recommendations, and guidance for our needs as an AV Integrator."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Todd",
          "Nb_Reviews": 4,
          "Date": "2023-04-05T23:42:33.000Z",
          "Titre": "Great Service",
          "Contenu": "Great Service! Fast shipping! Excellent phone support on ordering.  The PC was exactly as described and well packaged for shipping. 100/100"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harold Cannon",
          "Nb_Reviews": 1,
          "Date": "2022-04-19T16:45:40.719Z",
          "Titre": "Smaller",
          "Contenu": "Smaller, Lighter and more powerful than the other Superlogics I have owned and has given me Zero problems for almost 4 years. Well Done."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kirk",
          "Nb_Reviews": 1,
          "Date": "2020-08-18T01:26:34.000Z",
          "Titre": "Panel PC Order - Excellent Services",
          "Contenu": "I recently ordered 2 SuperLogics panel PCs. I promptly received a phone call from SuperLogics confirming the specific details of the order (e.g. memory, HD capacity, OS, etc.). And then we received the order in about a week. Wonderful. We've successfully deployed SuperLogics panel PCs in tactical/operational settings since 2009. Very reliable products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2021-08-03T12:01:18.000Z",
          "Titre": "Superlogics is great to deal with",
          "Contenu": "Superlogics is great to deal with. Very straight forward website that is easy to navigate. Shipments are always on time. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PT",
          "Nb_Reviews": 1,
          "Date": "2021-04-28T19:22:56.000Z",
          "Titre": "Great from the Get-Go",
          "Contenu": "The whole process from start to finish was a pleasure, and the finished product is running happily in my data center. John was exceedingly helpful in guiding me toward a suitable system based on my specifications."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ken T.",
          "Nb_Reviews": 2,
          "Date": "2020-09-08T21:46:45.000Z",
          "Titre": "I have been looking for a Windows 7…",
          "Contenu": "I have been looking for a Windows 7 desktop to replace my old one for a long time. I searched and searched and, at last, discovered this company. The ability to customize was very important to me and, on this site I could. The people who I was able to chat with on line were all very knowledgeable and very helpful. I am very happy with my new desktop."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 2,
          "Date": "2021-11-17T20:40:56.000Z",
          "Titre": "15 Custom PC's",
          "Contenu": "I placed an order for 15 custom built PC's. they were able to deliver within a month. I am very pleased with the speed of delivery and performance of machines."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Toby",
          "Nb_Reviews": 1,
          "Date": "2020-11-10T22:08:59.000Z",
          "Titre": "5 years of great service",
          "Contenu": "We have been using SuperLogics for about 5 years.  They have been easy to work with, willing to make special configurations, quick to quote, and quick to deliver."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Central Communications Systems",
          "Nb_Reviews": 1,
          "Date": "2022-04-13T10:44:07.000Z",
          "Titre": "Terrific Support",
          "Contenu": "Gabriel from the support team was a great help from the first: troubleshooting to PC drop off and the same day repair under warranty. Thanks again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Parker Integrated Robotics Kenai Alaska",
          "Nb_Reviews": 1,
          "Date": "2020-07-10T20:27:07.000Z",
          "Titre": "Loyal Customer",
          "Contenu": "I highly recommend Super Logics as a company that goes the extra mile for its clients from configuration, pricing, shipping and technical support. Their custom made fanless PC’s are top of the line, rugged and easily installed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Spencer",
          "Nb_Reviews": 1,
          "Date": "2021-09-09T11:21:22.000Z",
          "Titre": "Great Product & Company",
          "Contenu": "Great product, great service, excellent order lead times given the current supply chain issues surrounding PC components. Saved my company huge production delays when our existing supplier's lead times bloated to 6+ months."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T20:42:28.000Z",
          "Titre": "The service was great",
          "Contenu": "The service was great. They helped me upgrade our current computer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ernest",
          "Nb_Reviews": 3,
          "Date": "2021-11-05T10:07:11.000Z",
          "Titre": "Great product with prompt shipping",
          "Contenu": "Great product with prompt shipping. I had to call to finish the order after trying and failing to check out online. Customer though, was great and got my order in."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chuck Woodbury",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T22:53:52.000Z",
          "Titre": "Liam Fitts and Sales Staff",
          "Contenu": "Mostly, Liam Fitts, but when Liam is not there, whoever steps up takes care of us well also."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patricia Reis",
          "Nb_Reviews": 4,
          "Date": "2020-09-28T14:30:10.000Z",
          "Titre": "My rack-mountable keyboard & tray…",
          "Contenu": "My rack-mountable keyboard & tray arrived ahead of schedule and has been a game changer for my home studio."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 3,
          "Date": "2021-01-14T21:10:18.000Z",
          "Titre": "Tech department was great to work with…",
          "Contenu": "Tech department was great to work with in finding the best system, paid for the expedited shipping and received it on time and it works great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joel Martin",
          "Nb_Reviews": 1,
          "Date": "2022-04-01T13:05:22.000Z",
          "Titre": "Reliable Machines and a great company",
          "Contenu": "This is the 3rd of many rack my PC's I will be ordering. The site is great because I can build around the parts they have in stock and know a true time for when I will be receiving the device. The machines came loaded and I have not had one issue. Very happy so far."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dbj Automation Inc.",
          "Nb_Reviews": 2,
          "Date": "2023-05-11T01:02:16.000Z",
          "Titre": "I bought many many PCs from you guys…",
          "Contenu": "I bought many many PCs from you guys and I only had issues with one of them and your guy fixed it immediately over the phone. I can’t ask for better than that. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T01:24:16.000Z",
          "Titre": "Computer was fast and correct",
          "Contenu": "Computer was fast and correct. Windows install was set up nicely. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "SV",
          "Pseudo": "ALEXANDER",
          "Nb_Reviews": 5,
          "Date": "2023-05-10T00:12:41.000Z",
          "Titre": "Great Service and Products",
          "Contenu": "Customer service, delivery, price and quality of the Panel-PCs as always great and on time. Thanks !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "FIFI",
          "Nb_Reviews": 1,
          "Date": "2021-03-23T21:28:02.000Z",
          "Titre": "For a First-Timer",
          "Contenu": "For a First-Timer, I received one of the best customer service this country has been lacking. I will recommend it others!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryan",
          "Nb_Reviews": 1,
          "Date": "2020-12-22T12:38:29.000Z",
          "Titre": "Top Notch!",
          "Contenu": "They offer the best brands of equipment along with great service and fair pricing. I would highly recommend to anyone!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phil",
          "Nb_Reviews": 1,
          "Date": "2021-06-24T17:24:57.000Z",
          "Titre": "Always a good experience with SuperLogics",
          "Contenu": "Always a good experience with SuperLogics.  They give us a quote in a timely manner and ship promptly."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Cory",
          "Nb_Reviews": 1,
          "Date": "2020-12-25T20:13:20.000Z",
          "Titre": "Always a pleasure working with Liam",
          "Contenu": "Always a pleasure working with LiamI am, and will continue to be, a repeat customer... Because of Liam and SuperLogics products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nancy",
          "Nb_Reviews": 3,
          "Date": "2021-01-05T15:46:31.000Z",
          "Titre": "They are quick to confirm orders back.",
          "Contenu": "They are quick to confirm orders back.If there is an issue, quick to respond with a resolution."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer :VIdestra",
          "Nb_Reviews": 14,
          "Date": "2023-12-06T14:20:34.000Z",
          "Titre": "Excellent service and super reliable!",
          "Contenu": "SuperLogics has been an excellent and consistent supplier."
        },
        {
          "Note": 5,
          "Lieu": "EG",
          "Pseudo": "DCS TELECOM",
          "Nb_Reviews": 1,
          "Date": "2021-05-27T10:26:13.000Z",
          "Titre": "Fast shipping & dedicated support",
          "Contenu": "Liam, was extremely helpful and fast in response.shipment was done at the promised date.Thank you, and will do business again soon"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Timothy",
          "Nb_Reviews": 3,
          "Date": "2021-03-16T13:15:56.000Z",
          "Titre": "Great Company",
          "Contenu": "Great Company! Have been using Superlogics for several years now. Great people, great service and great product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Josef",
          "Nb_Reviews": 1,
          "Date": "2020-06-28T02:27:47.000Z",
          "Titre": "As expected",
          "Contenu": "The item was shipped at the expected time and arrived with no issues.  Time will tell whether the unit holds up or not.  We shall see.  I have every confidence that it will."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 1,
          "Date": "2021-01-07T13:49:33.000Z",
          "Titre": "Really great experience from start to…",
          "Contenu": "Really great experience from start to finish. Super knowledgeable sales staff. Delivered ahead of schedule."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greg Speir",
          "Nb_Reviews": 4,
          "Date": "2022-12-29T18:32:12.000Z",
          "Titre": "Ordering was simple",
          "Contenu": "Ordering was simple, build time was good and communications was also good.  I will order again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2021-02-10T21:51:44.000Z",
          "Titre": "I have been a customer of SuperLogics…",
          "Contenu": "I have been a customer of SuperLogics for more than 20 years and they're among the best in the business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T21:55:34.000Z",
          "Titre": "Great support and communication",
          "Contenu": "Had a minor issue with shipping but they took care of it quickly and everything was perfect!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tony",
          "Nb_Reviews": 3,
          "Date": "2020-08-26T13:46:00.000Z",
          "Titre": "Contented Purchaser",
          "Contenu": "Sincerely satisfied with purchase and indeed, this seller complies with its vow and impressive assurance of all their electronics.I sincerely have to highly commend SuperLogics and their staff for the issuance of excellent services.  I also highly recommend SuperLogics to anyone requiring any assistance with the purchasing of computers or electronics."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DOYLE",
          "Nb_Reviews": 6,
          "Date": "2023-05-12T15:02:47.000Z",
          "Titre": "DIN rail mounted fanless 24vdc 1TB computer",
          "Contenu": "helpful advice from technical support; equipment has a small footprint; software was installed at factory; multiple connection types are populated on the side of the DIN rail mounted 24vdc fanless 1TB +4TB system with UPS power supply; received the package of parts is safe condition."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob H",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T06:32:14.000Z",
          "Titre": "Received my part incredibly quickly",
          "Contenu": "Received my part incredibly quickly, and I was helped over the phone, even though it was after hours."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Darcy",
          "Nb_Reviews": 1,
          "Date": "2021-02-16T19:50:03.000Z",
          "Titre": "Great experience with your team",
          "Contenu": "Great experience with your team! From ordering to shipping!Very smooth and quick.Great job!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T17:41:52.000Z",
          "Titre": "Our company can be demanding on…",
          "Contenu": "Our company can be demanding on configuration and purchasing. Superlogics has always worked with us and exceeded our expectations."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Regis Carvalho",
          "Nb_Reviews": 2,
          "Date": "2022-05-16T22:14:21.000Z",
          "Titre": "Second unit purchased from Superlogics",
          "Contenu": "Second unit purchased from Superlogics. Great service and product, as the first time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T01:21:04.000Z",
          "Titre": "Great service",
          "Contenu": "I received great service."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Kelly Hunter",
          "Nb_Reviews": 3,
          "Date": "2021-11-29T06:53:38.000Z",
          "Titre": "Great service as always",
          "Contenu": "Great service as always. Their team has always done exceptional on every account."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 1,
          "Date": "2020-09-22T20:44:22.000Z",
          "Titre": "We had a tight deadline and they met it…",
          "Contenu": "We had a tight deadline and they met it despite several problems. They delivered."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PCM IT Corp",
          "Nb_Reviews": 6,
          "Date": "2023-01-17T22:09:28.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "Great Customer Service, solid products. Highly recommend and will do business again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luis",
          "Nb_Reviews": 1,
          "Date": "2021-03-19T20:31:08.000Z",
          "Titre": "Excellent Server on a Budget",
          "Contenu": "The SuperLogics server we purchased for our gaming startup functioned well with excellent noise and heat characteristics.  We are using Proxmox as a hypervisor and would purchase this server again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Omega Medical Imaging, LLC",
          "Nb_Reviews": 2,
          "Date": "2023-10-02T16:21:14.000Z",
          "Titre": "Great customer care from Rich…",
          "Contenu": "Great customer care from Rich Costantini."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer :VIdestra",
          "Nb_Reviews": 14,
          "Date": "2022-06-24T15:58:59.000Z",
          "Titre": "Absolute best for any business needing…",
          "Contenu": "Absolute best for any business needing a consistent and well-built BOM.They pay attention to detail and deliver a very consistent BOM - which is important if you are building a deliverable solution either internally or externally."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lou Ford",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T23:44:45.000Z",
          "Titre": "Product Quality",
          "Contenu": "We received the product in the time promised.   The computers are specific to our manufacturing environment.    And the original order from November 2021 have not experienced any issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2020-08-14T23:58:43.000Z",
          "Titre": "Very easy to work with",
          "Contenu": "Very easy to work with.  Even got same day delivery.  Well done SuperLogics!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 2,
          "Date": "2022-01-05T21:56:44.000Z",
          "Titre": "All is well with SuperLogics",
          "Contenu": "All is well with SuperLogics. Quick shipping, good pricing, good product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "WECT Television",
          "Nb_Reviews": 3,
          "Date": "2022-04-21T14:46:04.662Z",
          "Titre": "I was on a tight timeline and…",
          "Contenu": "I was on a tight timeline and SuperLogics delivered! I am very pleased with the price and quality of product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jodi",
          "Nb_Reviews": 1,
          "Date": "2020-07-23T20:12:31.000Z",
          "Titre": "CACI FEMA order",
          "Contenu": "Wonderful service.  Lliam was very courteous and provided a quote very quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Timothy",
          "Nb_Reviews": 3,
          "Date": "2020-07-17T11:49:25.000Z",
          "Titre": "We love superlogics here at certainteed…",
          "Contenu": "We love superlogics here at certainteed keep up the good work!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2021-03-04T21:46:41.000Z",
          "Titre": "Y'all  rock",
          "Contenu": "Y'all  rock!  Thanks for the prompt delivery as well as the communications."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Austin",
          "Nb_Reviews": 1,
          "Date": "2020-09-15T18:57:08.000Z",
          "Titre": "Very fast and knowledgeable service",
          "Contenu": "Very fast and knowledgeable service, excellent product at a great price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer :VIdestra",
          "Nb_Reviews": 14,
          "Date": "2022-10-04T00:55:34.000Z",
          "Titre": "Superlogics is a great company to…",
          "Contenu": "Superlogics is a great company to partner with if you are a manufacturer and need a high quality and consistent BOM."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Mario",
          "Nb_Reviews": 2,
          "Date": "2022-01-27T12:51:02.000Z",
          "Titre": "Good service as always",
          "Contenu": "Good service as always.  parts available and shipped in a timely manner"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brent",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T22:50:07.000Z",
          "Titre": "Easy to work with",
          "Contenu": "Easy to work with, fast, good products, professional."
        }
      ]
    }
  ]
}