{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.on1.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Peter Gregory",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T10:32:23.000Z",
          "Titre": "I used to have no problems with ON1 and…",
          "Contenu": "I used to have no problems with ON1 and have used it successfully to resize the prints we make for customers with Photoshop on my Mac.  Since I purchased the update I find that when I return from AI Resize into Ps 9the images are distorted and I don't know how to fix this serious problem"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jay Wintermeyer",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T21:43:11.000Z",
          "Titre": "Photoshop Crasher",
          "Contenu": "Installed the new ON1 Photo RAW MAX 2024. It crashed Photoshop will not open now, even after uninstalling ON1 and reinstalling Photoshop. I've tried uninstalling and reinstalling both software multiple times and Photoshop continues to crash. ON1 has wasted far more of my time troubleshooting than I paid for it. Thanks for nothing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cedric",
          "Nb_Reviews": 6,
          "Date": "2023-12-09T02:59:52.000Z",
          "Titre": "The Great Program that Never Works",
          "Contenu": "Everytime I open the program, it shuts down automatically. I contacted support. They told me to reload the program. They also told me to send them the log file, for which they gave me a web address. When I tried the address, I got \"FILE NOT FOUND.\""
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard Sobie",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T00:48:41.000Z",
          "Titre": "Customer Disservice sucks",
          "Contenu": "Customer Disservice sucks. I have not received a response from the online email \"help\" desk for over four days. I cannot active my On1 RAW 2024 upgrade.There is no available telephone contact for any customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Gerry",
          "Nb_Reviews": 3,
          "Date": "2023-11-23T21:18:47.000Z",
          "Titre": "While following your instructions",
          "Contenu": "While following your instructions, I am unable to download a copy of the program that works. I’ve given up trying."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Gerry",
          "Nb_Reviews": 3,
          "Date": "2023-11-06T17:07:40.000Z",
          "Titre": "I purchased the wrong product",
          "Contenu": "I purchased the wrong product, due to your descriptions and menus being very in-complete.  I tried over and over to contact the company, and was never able to get a response.  Your customer support is non-existent!!!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "SANFORD HERSH",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T20:38:20.000Z",
          "Titre": "Slow Customer Service",
          "Contenu": "Can you imagine dealing with a company where it's impossible to successfully do upgrades? In order to an upgrade you have to go on their web site that assumes what region of the world you're in. You can't change it! That means that if I live in England but ON1 thinks I live in Italy, I will be charged in Euros and not pound sterling. What could be stupider than that? Well, there's more. When I finally did an upgrade, I used a different email address than I used when I bought previous versions of their software. Because of that I was unable to use the software that I downloaded. There is no way of telling them to change the purchase to a different email. If I try to it, it says that the email is already being used. What about customer service? There is none. The only way of contacting them is through a \"Submit a request\" form. When I detailed my frustration including the invoice number, it responded by a bot that gave me an inane suggestion. There is no phone number and no way to speak to a human. I still am unable to use their software. If you have nothing else to with your time, buy their software otherwise don't bother.My update issue was finally resolved several days later! Now all they have to do is fix the region issue. They told me that when you get to the the pay for order page there is some way of changing the region. It is too late. It should be an immediate option like the language option."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Bryan Williams",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T03:25:36.000Z",
          "Titre": "If you have an integrated system, it won’t work !",
          "Contenu": "No one has gotten back to me when I had questions, I did receive the usual high volume, our reply will take longer etc. I wasted 3 nights downloading, til the system told me each time there were errors, what specifically they didn’t say, would have loved to talk to a live person. I have requested a refund , my computer though 3 years old does not fit the system. Still no acknowledgment. Very disappointed, I really wanted the product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian Gray",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T21:35:12.000Z",
          "Titre": "Frustrated …",
          "Contenu": "Every time I attempted to use ON1 software I’m stymied by one issue or another. I’ve owned various levels and tried your videos but you never see the cursor placed or feel it’s fully explained."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Glenn Soltes",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T21:24:29.000Z",
          "Titre": "I have a pretty good gaming PC that…",
          "Contenu": "I have a pretty good gaming PC that runs Lightroom 6.14reasonably well.Only way I could justify the switch from Lightroom 6.14 is if oen1 raw .. perform significantly better than Lightroom.Didn't ..... In the left hand pain under Library there is a date field where you can look at all your photographs sorted by date .. doesn't work takes forever and then crashes.Then there's the thumbnails that take forever to load and there's no way to pre generate them for your entire Library....I really wanted to make your product work because I don't like Adobe and I'm dreading when my digital camera breaks and it's not supported by Lightroom 6.14 anymore"
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "Sem",
          "Nb_Reviews": 6,
          "Date": "2023-12-04T15:56:51.000Z",
          "Titre": "ON1 effects 2023",
          "Contenu": "Il software ON1 effects 2023 non funziona ... è inutilizzabile"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "DEREK DEROSIE",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T23:58:47.000Z",
          "Titre": "Shouldn’t have to pay to learn your…",
          "Contenu": "Shouldn’t have to pay to learn your product by purchasing tutorials…. Shame on you!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rodney Speed",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T14:31:00.000Z",
          "Titre": "I can't get a download of this app",
          "Contenu": "I can't get a download of this app. I keep receiving an 'unconfirmed crdownload' error. I tried the link from your secondary site, and the app manager does not work on my computer. I am using Windows 11 on an HP desktop. I tried using Chrome, Firefox, and Edge with the same results. Your tech service addressed my concern once but failed to follow up on my continued inability to get this app. At this point, I would like a full refund of my purchase as I no longer have an interest in this product."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Ibn Sina",
          "Nb_Reviews": 9,
          "Date": "2023-06-07T00:12:42.000Z",
          "Titre": "Purchased this after trial...teceived…",
          "Contenu": "Purchased this after trial...teceived an email offering one off purchase with no subscription, which was a good offer...i bought it for the photo staking function for macro photography and few other useful intuitive features for landscapes...very disappointing that it keeps crashing on Windows...and I have a high spec computer that meets the software requirements and the latest windows...I don't think I will use it much as originally intended....very disappointing"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Benjamin McLaurin",
          "Nb_Reviews": 1,
          "Date": "2023-07-30T21:11:30.000Z",
          "Titre": "A very long time member with the On1…",
          "Contenu": "A very long time member with the On1 Pro. I discovered that On1 plus is better for me I asked if I could change my subscription. Nope but I can get my current subscription to go towards On1 Plus which is too much for me and over kill. I then purchased upgrade to Resize right before I discovered that there was a sale. No point asking for any sort of refund since I will get the middle finger. At the end of the year when my subscription expires going to do a complete review of my needs and probably move on."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "David Harley",
          "Nb_Reviews": 2,
          "Date": "2023-11-08T00:20:00.000Z",
          "Titre": "I can’t download it after many tries",
          "Contenu": "I can’t download it after many tries. All previous versions including 2023 were not a problem."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Davis",
          "Nb_Reviews": 1,
          "Date": "2023-05-28T00:27:05.000Z",
          "Titre": "What did I buy?",
          "Contenu": "I thought I was buying some video courses, but when I received a welcome email I found I had joined Photo Plus or something like that.  I have no idea what that is and wonder what I got my self into - perhaps some sort of photo club that has continuing costs?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "George Kibler",
          "Nb_Reviews": 1,
          "Date": "2023-06-11T22:48:39.000Z",
          "Titre": "Software unusable because of crashes",
          "Contenu": "On1 latest update version takes a full minute to load on my computer.  Once loaded it is not usable because of constant crashing.  My computer is within your specifications so this should not happen.  Before the update it worked ok, and was my editing software of choice.  How do I get help to get it running again?"
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "Geraldine Powell",
          "Nb_Reviews": 43,
          "Date": "2023-02-14T20:35:36.000Z",
          "Titre": "ON1 is a scam",
          "Contenu": "ON1 is a scam. Although it can be a useful program the way they market it should be illegal. Their advertising practices are completely misleading. I ended up paying lots of money to upgrade only to find out that I did not get the experience promised and then to be pestered monthly with continual offers to upgrade again and again and again. Also they did not unsubscribe me when I asked."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "J Jones",
          "Nb_Reviews": 1,
          "Date": "2021-10-20T02:36:52.000Z",
          "Titre": "Very buggy software",
          "Contenu": "Very buggy software.  Often, \"upgrades\" break important features that have previously worked fine.Support is the worst.  Non-existent.  You have to wait days for a response and if/when they ever respond it's only to send you links to help pages that have nothing to do with the issue you are asking about.ON1 has been very successful at scrubbing any negative reviews about their company or software."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "lal singh",
          "Nb_Reviews": 2,
          "Date": "2023-04-18T03:34:02.000Z",
          "Titre": "I bought Raw 23 that mentioned that…",
          "Contenu": "I bought Raw 23 that mentioned that Resize was a part of it. Now I discover to my horror that it is not. Your ethical standard is dismal. This is continually being pranced by On1.I keep paying regularly but find that you can never be trusted.I regret using On."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Paul Maher",
          "Nb_Reviews": 19,
          "Date": "2022-02-27T12:52:48.000Z",
          "Titre": "Screwing Customers For More & More Money",
          "Contenu": "Unfortunately this company has gone down the route of trying to screw as much money out of customers as possible including making the stand-alone app and plug-ins two separate purchases.Careful what you wish for ON1 money grabbers, when you take your customers for granted and think you can milk them for all they're worth, you may find they won't be your customers any more!Goodbye!"
        },
        {
          "Note": 1,
          "Lieu": "PH",
          "Pseudo": "barry fletcher",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T23:59:12.000Z",
          "Titre": "I've had to load the software twice…",
          "Contenu": "I've had to load the software twice already, then when go back next day to do editing it no longer on screen, so now this going to be the third time, so can't keep reloading it every other day ."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mr E",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T10:42:36.000Z",
          "Titre": "Permanent Means Temporary",
          "Contenu": "Based on my experience, their 'permanent licence' is not as it seems. I bought ON1 Photo Raw 2022 not long after it came out, and as of December 2022, it now refuses to function when my computer is connected to the internet. In fact, when I opened it today, it had logged me out, and was saying I was using a 'trial' version, and recommended renewing my licence. I logged back in, and now it inexplicably crashes every time I start the program... But only when connected to the internet. Appears my license has been deactivated."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Monica van Kleef",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T11:22:48.000Z",
          "Titre": "Disappointing",
          "Contenu": "1 i can not switch beween texture and portrait. Is was possible in the older version after export from Photoshop. Now two actions.2 i want to do all the changes by myself. I do nog like the choices on the left site. 3 i miss the cataloque feature from lightroom!!!!!!!! Essential . I wouldn’t switch without That feature."
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Rob Oborn",
          "Nb_Reviews": 1,
          "Date": "2023-06-18T02:34:54.000Z",
          "Titre": "Refunded product due to crashes",
          "Contenu": "Refunded product due to crashes even on low res images when using any presets. When opening another image it returns to the last used preset screen and crashes again."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "ALAIN LOSTANLEN",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T00:17:23.000Z",
          "Titre": "Very Poor and integration with Capture…",
          "Contenu": "Very Poor and integration with Capture One not fine. I will not recommend ON1 products."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marc",
          "Nb_Reviews": 4,
          "Date": "2023-11-11T23:31:13.000Z",
          "Titre": "Paid $127 and can't open either as a…",
          "Contenu": "Paid $127 and can't open either as a stand alone app or as a plug in inside Lightroom. Running Windows 11"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Arik Ardrey",
          "Nb_Reviews": 1,
          "Date": "2023-06-03T02:37:10.000Z",
          "Titre": "Not user friendly at all",
          "Contenu": "I can’t use the app from my Apple pictures to edit, the only way to edit is to open the app itself, then having to save and rename to whole other location, not very user friendly at all. I feel like I waisted my money on this."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Kim Poehnell",
          "Nb_Reviews": 1,
          "Date": "2023-08-06T22:07:05.000Z",
          "Titre": "Purchased product under email .....",
          "Contenu": "Purchased product under email .....Signed-inProduct works - slowCannot access your web siteCannot sign-inSays my email does not exist"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Craig",
          "Nb_Reviews": 2,
          "Date": "2023-06-24T04:14:23.000Z",
          "Titre": "I didn’t get any documentation on how…",
          "Contenu": "I didn’t get any documentation on how to use it or it was impossible to find. I was lead to believe this would work with Lightroom. No mention of it once I bought it. I’m not going to throw away my time on something that won’t work with Lightroom etc."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Ernst Wenzel",
          "Nb_Reviews": 11,
          "Date": "2023-10-11T21:53:23.000Z",
          "Titre": "It's to slow",
          "Contenu": "It's to slow, it takes too long to start the application. It's like stepping in glue...sorry, there are so many powerful parts in the program! Please fix it soon!!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Customer",
          "Nb_Reviews": 3,
          "Date": "2023-06-03T13:52:43.000Z",
          "Titre": "Have just purchased software and…",
          "Contenu": "Have just purchased software and haven't had much time to learn with it but still being bombarded with emails to purchase a new license.Bit annoyed.."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thaer",
          "Nb_Reviews": 2,
          "Date": "2023-08-03T15:45:36.000Z",
          "Titre": "No life support I keep trying to solve…",
          "Contenu": "No life support I keep trying to solve a problem with new order I made no one can help it keep sending me links"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Keith",
          "Nb_Reviews": 5,
          "Date": "2023-11-14T19:52:49.000Z",
          "Titre": "Crashes galore",
          "Contenu": "Constantly crashing. Bye On1it's back to Photoshop."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Carsten Ortlieb",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T21:56:53.000Z",
          "Titre": "The image recognition is just bad",
          "Contenu": "The image recognition is just bad. On the picture there is a wolve an the tag is \"sheep\". OK, bot mammals with fur, but there is a \"slight difference\"."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Martin Yaslowitz",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T19:22:27.000Z",
          "Titre": "the program(keyword AI) stopped…",
          "Contenu": "the program(keyword AI) stopped launching and it's been day since I requested technical support and still have not heard anything."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Phillip Grove",
          "Nb_Reviews": 2,
          "Date": "2023-04-26T14:38:55.000Z",
          "Titre": "I have been a user since the beginning",
          "Contenu": "I have been a user since the beginning. However, since the new version of ON1 does not support my graphics card, I can no longer use this software. Good luck with the new AI version of ON1."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bruce",
          "Nb_Reviews": 3,
          "Date": "2023-05-04T16:53:44.000Z",
          "Titre": "You say you have plug ins for LR and PS…",
          "Contenu": "You say you have plug ins for LR and PS but they do not work.  You find that out after buying and then contact you and your techs say they know and it will be in the bug fix.  If I wanted it to be standalone I would of waited, this has happen before wit ON1 products"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Burnell  Yow",
          "Nb_Reviews": 4,
          "Date": "2023-06-22T00:21:55.000Z",
          "Titre": "I've been using On1 for several years",
          "Contenu": "I've been using On1 for several years. I don't understand why it sometimes takes minutes to fully launch."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Larence",
          "Nb_Reviews": 4,
          "Date": "2023-05-03T23:38:53.000Z",
          "Titre": "full version does not even download…",
          "Contenu": "full version does not even download correctly to my MAC. I canceled my subscription and paypal immediately.what a joke."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Walter de Groot",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T03:22:04.000Z",
          "Titre": "frustrating",
          "Contenu": "I had ON1 2018 on my computer that quitI can’t seem to get it back.  Can some one please help me???"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Deborah Kuykendall",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T16:51:43.000Z",
          "Titre": "Any good customer service includes the…",
          "Contenu": "Any good customer service includes the ability to SPEAK to a rep of that company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 3,
          "Date": "2023-11-03T13:10:24.000Z",
          "Titre": "Can't download",
          "Contenu": "Can't download. Can't install. Server can handle volume."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "BOB BAINES",
          "Nb_Reviews": 11,
          "Date": "2023-06-25T13:22:41.000Z",
          "Titre": "Not happy with this program at all.Very…",
          "Contenu": "Not happy with this program at all.Very slow even when working on one image.The only keyword it keeps adding is vivid,doesn't matter what the photo is.I think a total waste of money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Deborah Taylor",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T01:44:44.000Z",
          "Titre": "Wasn't good for me !",
          "Contenu": "Latest download doesn't work and when I watch your videos I don't even have the noise option at all.  I can't crop and I can't merge photos.  :("
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T19:29:20.000Z",
          "Titre": "New verson won't work without mystery…",
          "Contenu": "New verson won't work without mystery file.  Money gone, program useless.  I'm done with on1."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "JOHN MCILWAINE",
          "Nb_Reviews": 2,
          "Date": "2023-06-13T12:05:42.000Z",
          "Titre": "I downloaded the update and then was…",
          "Contenu": "I downloaded the update and then was told I might need to update by my video card. Had I know that in advance I would not have paid for or downloaded it"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "RAY MARSH",
          "Nb_Reviews": 2,
          "Date": "2023-04-16T21:47:14.000Z",
          "Titre": "Not at all user friendly for those of…",
          "Contenu": "Not at all user friendly for those of us that are not geeks - still don't worry about it cos we are a dying breed!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ramona Aguerrebere",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T22:53:56.000Z",
          "Titre": "The software disabled the ability to resize images",
          "Contenu": "The software disabled the ability to resize images, which was the sole purpose for purchasing this software."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Winger",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T18:43:52.000Z",
          "Titre": "I purchased upgrade for $49 for my…",
          "Contenu": "I purchased upgrade for $49 for my iPhone app. I’ve downloaded the upgrade but it doesn’t go to my app. I asked for support but it did not help. $49 down the drain."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark Chauvin",
          "Nb_Reviews": 4,
          "Date": "2023-04-14T21:30:52.000Z",
          "Titre": "You opened this ticket",
          "Contenu": "You opened this ticket: ON1 Support Request 343147.  I have not heard back, and it's been more than 48 hours.  Please advise."
        },
        {
          "Note": 1,
          "Lieu": "NO",
          "Pseudo": "Jan Petter Gudahl",
          "Nb_Reviews": 1,
          "Date": "2023-04-21T06:29:24.000Z",
          "Titre": "I have minimum hardware Intel I5 2G",
          "Contenu": "I have minimum hardware Intel I5 2G. You should say M1, maybee."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ian vinje",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T02:08:21.000Z",
          "Titre": "I can not find the app",
          "Contenu": "I can not find the app. Where is it? I thought I had downloaded it, but it is hidden somewhere? Oh, well I probably just go back to photoshop"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard Armstrong",
          "Nb_Reviews": 3,
          "Date": "2023-08-09T22:48:36.000Z",
          "Titre": "I asked a simple question with no answer.",
          "Contenu": "I asked a simple question. Exactly which of your products am I eligible to use?No answer"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "David Murray",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T03:09:27.000Z",
          "Titre": "I still don't have the link for the…",
          "Contenu": "I still don't have the link for the purchase  What goes? I even sent emails about it and NO RESPONSE  GREAT SERVICE"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eagrphotos",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T21:54:15.000Z",
          "Titre": "Slow and crashes frequently"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Lars Friberg",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T04:46:51.000Z",
          "Titre": "I still haven't get to work or login"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeffrey",
          "Nb_Reviews": 3,
          "Date": "2023-08-01T19:49:21.000Z",
          "Titre": "Photo raw not a plug-in for Photoshop"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "George Pelletier",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T04:04:05.000Z",
          "Titre": "LOST EVRYTHING....",
          "Contenu": "COULD NOT INSTALL THE UPDATTE... LOST EVRYTHING ..."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "robert maidment",
          "Nb_Reviews": 2,
          "Date": "2023-09-25T07:44:53.000Z",
          "Titre": "Still waiting!!"
        },
        {
          "Note": 1,
          "Lieu": "CH",
          "Pseudo": "bh",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T20:09:03.000Z",
          "Titre": "does not work with lightroom"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JT",
          "Nb_Reviews": 1,
          "Date": "2023-05-27T02:59:40.000Z",
          "Titre": "it does not seems to make an impact"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Manfred Jessee",
          "Nb_Reviews": 1,
          "Date": "2023-07-09T00:24:34.000Z",
          "Titre": "It freezes up a lot and is slow."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Claude Beauchemin",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T04:18:49.000Z",
          "Titre": "Impossible to get my pictures from my…",
          "Contenu": "Impossible to get my pictures from my ON1 Photo RAW 2023.5Impossible to use my regular password (except I can go to my file and the forum) It is possible my time is over with the use of the ON1 Photo RAW 2023.5. / BUT MY PICTURES BELONG TO ME. --------- My trust with you is gone.Please Help me in French. I know very little in English to understood."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Shannon",
          "Nb_Reviews": 3,
          "Date": "2023-11-19T23:09:11.000Z",
          "Titre": "Super frustrated that I already…",
          "Contenu": "Super frustrated that I already purchased it and that version no longer works and so I needed to purchase again. If it does happen again I will be looking at other programs because I won’t continue to have to pay for new upgrades"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bob Simoneau",
          "Nb_Reviews": 3,
          "Date": "2023-11-17T17:15:38.000Z",
          "Titre": "I am experiencing a memory leak during…",
          "Contenu": "I am experiencing a memory leak during Cataloging on both my Windows 11 and Mac Mini Pro M2 machine. I am forced to run without catalogs"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mr Daniel Pels",
          "Nb_Reviews": 2,
          "Date": "2023-10-25T20:28:13.000Z",
          "Titre": "I've been an On1 user for over five…",
          "Contenu": "I've been an On1 user for over five years. Unfortunately, because of exceptionally poor customer service that relationship will now end.On 1 has joined the long list of companies that have chosen to \"automate\" their customer support and isolate themselves from customers. No phone number or physical address is listed on the website. Why is that? Well, on paper, it probably looks good for the bottom line, but as a result, however, they lose touch with their customer base. Answering basic questions and resolving simple problems shouldn't shouldn't take 48 -72 hours. I don't have that much time to waste."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael Amatucci",
          "Nb_Reviews": 5,
          "Date": "2023-11-08T05:33:02.000Z",
          "Titre": "2024 vs 2023",
          "Contenu": "I sesm to be having much more trouble with 2024 than I have had with 2023.For some reason now it takes minutes to finish opening a file.I'm having with the watermark part.There seems to be a lack of indepth instruction. What there is is hard to find."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Bill R.",
          "Nb_Reviews": 2,
          "Date": "2023-08-05T20:20:55.000Z",
          "Titre": "Poor marketing information.",
          "Contenu": "I purchased the current version because of the AI keyword generator. When I tried to use it, it didn't really work. On contact with support, they indicated that feature was currently only available in the US. As I live in Canada, it doesn't work. It would be helpful in decision making if limitations on the new features were noted."
        },
        {
          "Note": 2,
          "Lieu": "ZA",
          "Pseudo": "Alan Samuels",
          "Nb_Reviews": 1,
          "Date": "2023-06-25T16:01:29.000Z",
          "Titre": "Should be a great programme, if you can get it to work",
          "Contenu": "Had issues as system ran for a few days after installation and no AI keywords seemed to generate (have approx 39k photos). Reran with 35 photos and same thing happened. Struggled to see what issues could be (new to On 1) as help and information not easily available. Left for a few days and trying again ( seems now I have to check if system compatible - non-technical so going to be a challenge). Hopefully that will work as see real benefit in programme."
        },
        {
          "Note": 2,
          "Lieu": "SE",
          "Pseudo": "Inge Nöjd",
          "Nb_Reviews": 2,
          "Date": "2023-07-24T16:02:15.000Z",
          "Titre": "Currently not working with Apple photos",
          "Contenu": "I have been happy with on1 nonoise ai 22 and so I paid for the upgrade to  the 23 version. Unfortunately  it turns out there is a bug that prohibits this edition to work as an Apple photos extension wich completely disrupts my work flow. Whish that info had been available to me before the purchase."
        },
        {
          "Note": 2,
          "Lieu": "SG",
          "Pseudo": "Anthony ONG",
          "Nb_Reviews": 2,
          "Date": "2023-05-29T19:10:00.000Z",
          "Titre": "Apparently it is a little lagging in…processing speed.",
          "Contenu": "Apparently it is a little lagging in process speed. I’m using the Mac M1 with 16 gig RAM and 1 T storage. And my pics are in JPEG .Also, although there are features improvements from the 2022 s/w that I already own, however herein are some areas that I hope ON1 can improve,1) the crop extension with the fill in the blanks, it not accurate, meaning I still need to touch it up there after.2) I like to have the focus stack & pano stitch functions3) the effects tab are generally antique, as in Luminar , the sun rays are moveable and Luminar Magiclight is able to capture multiple light points altogether , while in ON1 I have to individually add on those effects.Hopefully the June updates have justifiable improvements, otherwise I might have to get a refund and continue with Luminar NEO. Many thanks.RgdsOngToni"
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "Hamish C",
          "Nb_Reviews": 3,
          "Date": "2023-08-15T03:46:04.000Z",
          "Titre": "Not sold on ON1, yet…",
          "Contenu": "Well, I can’t give a review on customer service yet because I haven’t had any. I paid money, I received your product. I then get emails offering further guides and videos , only to find I have to pay more money to view them. No thanks.Having used ON1Raw for only a week, it’s very overwhelming in terms of having too many micro editing ‘tools’. Video tutorials are only partially helpful, as the videos don’t actually show you how to edit an image from start to finish, the Keyword AI isn’t helpful as it’s not picking up anything in my 1000 images other than ‘high key’ and…there’s no face or people detection? Really? Google has it, for free.On a positive note though…I do like the Super AI Mask function! I will need to find help how to refine the mask when it bleeds onto other parts of the image.I’ll preserve for another week or two."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dina Wild",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T18:27:28.000Z",
          "Titre": "The program itself works fine",
          "Contenu": "The program itself works fine, but this latest update is extremely “clunky” as far as transporting images between Lightroom. Used to be a really easy click an “edit in” button, image transferred into On1 and then transferred back with ease. I thought this was supposed to be a plug-in to use in conjunction with Adobe. I don’t know if it’s an On1 or an Adobe issue, but having a .cr2 file, then a .psd file, then a copy-.pds, then a .jog and FINALLY a copy-.jpg is a pain in the ass."
        },
        {
          "Note": 2,
          "Lieu": "CH",
          "Pseudo": "Peter Pan",
          "Nb_Reviews": 4,
          "Date": "2023-08-10T14:56:36.000Z",
          "Titre": "Cool for single Picture edit usage, unusable for professionals",
          "Contenu": "ON1 Photo raw is a cool software, however it is not made for heavy duty use and professional things. If you want to make a timelapse or edit big batches of photos, the software comes to its limits. For example: I wanted to edit a timelapse with 4000 photos, which I know is a lot. First, I didn't work at all, always crashed, etc. I divided the photos in to 10 Folder to edit them better, but to my surprise this doesn't really work either. If you want to sync your edits (and I only did small edits) it's gonna be impossible with more than 10 photos.If you want to edit not more than 100 Raw photos you're going to be satisfied, everything over 100 raws and the software is unusable (it's literally unusable I just want to point out what the limits of the software are) If I knew that I would've never bought it, but here we are..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ross",
          "Nb_Reviews": 2,
          "Date": "2023-06-06T01:41:22.000Z",
          "Titre": "the recent upgrade to .5 has not been good",
          "Contenu": "the recent upgrade to .5 has not been friendly. it is slower in many areas (such as file save) than its previous versions, it crashed often and sometimes the cursor gets lost. the software is really beta and not ready for GAHaving gotten a response from on1 saying my video card is causing their software to crash and save files slowly I felt I needed to lower their rating because they took a system (2023.1) that was working well and blamed their new  problems on someone else. Have to wonder if they even know what is going on?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Keith",
          "Nb_Reviews": 5,
          "Date": "2023-11-08T00:13:23.000Z",
          "Titre": "Not ready",
          "Contenu": "Many times it froze up and had to be shut down. Some items did not work as well as had hoped. Basically, it was a let down after so much hype."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "JRK",
          "Nb_Reviews": 2,
          "Date": "2023-07-08T09:10:14.000Z",
          "Titre": "Confusing and uncomfortable",
          "Contenu": "Compared to other software the GUI is very confusing. I waste a lot of time by searching functions. I also dislike the \"hidden\" EXTRAS folder. Installing extras is also very uncomfortable."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "HarpyG",
          "Nb_Reviews": 54,
          "Date": "2020-07-12T09:00:31.000Z",
          "Titre": "Too many reliability issues",
          "Contenu": "I've owned this software for around three years. Year by year I can honestly say that for each yearly version, it has only worked as it should for around one to two months. While it works it is brilliant. But each and every time a new iteration is released, the bugs and failures of core features dominate over any new features. Testing appears to be non-existent and consistency is not a feature."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jan Lee",
          "Nb_Reviews": 2,
          "Date": "2023-06-21T18:49:51.000Z",
          "Titre": "You did away with half oh your good stuff",
          "Contenu": "You did away with Develop; therefore you no longer have Transform.Resize and Transform were the only 2 really useful things about On1.  Now, you are down to one.  Your Portrait module is moderately ok."
        },
        {
          "Note": 2,
          "Lieu": "EE",
          "Pseudo": "Aivar Pihelgas",
          "Nb_Reviews": 2,
          "Date": "2023-05-06T12:39:14.000Z",
          "Titre": "I can't run the new version of the…",
          "Contenu": "I can't run the new version of the software because of the video card. New drivers cannot be loaded for this type of video card. Years older Effects worked flawlessly.Aivar PihelgasPhotoplanet OY"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 2,
          "Date": "2023-06-23T13:01:21.000Z",
          "Titre": "Not your fault",
          "Contenu": "Not your fault for the one star.  I read the hardware concerns, thought mine would work, but it would not.  I'm just not techie enough.  Too bad you don't have the program like Windows that would check first.  Anyhow, I will save it in case I update my hardware in the future.I received  email from On1 that I can obtain a refund. I moved this review to two stars and will update further when I receive the refund.  I have been a loyal longtime user of On1 software."
        },
        {
          "Note": 2,
          "Lieu": "DK",
          "Pseudo": "Per",
          "Nb_Reviews": 85,
          "Date": "2023-06-09T10:37:17.000Z",
          "Titre": "Problem with Color and Profile in LRC",
          "Contenu": "I bought NoNoise product and I wanted to use it with LRC classic.And the color is way off and there is also a problem that the profile is missingI have contacted ON1 Support and they are nice and polite and send it to devolop department. But at the end I have a product that is useless for me in LRC."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ricardo Michelena",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T23:44:13.000Z",
          "Titre": "I am not able to update the software",
          "Contenu": "I am not able to update the software, on1photo raw 2024"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Ian Douglas",
          "Nb_Reviews": 74,
          "Date": "2023-06-25T18:04:28.000Z",
          "Titre": "Product just did not work as promoted",
          "Contenu": "Product just did not work as promoted and advertised so I ahd to recover my payment.  This was a hassle but happened eventually."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T21:15:08.000Z",
          "Titre": "Always a new problem, always trying to get more money out of you.",
          "Contenu": "I'll start off by saying I've used On1 products for over a decade (back when they were \"OnOne\") and generally enjoyed them! Make a purchase, use the software, everything was great. But over time they kept trying to do more.. They were never \"the best\" at anything, but they kept adding more tools and features and tried to be a replacement for Photoshop or Lightroom rather than just a plugin. This, over time, created a slower and less-performing program than the earlier releases (which I loved).Over time, they shut down their authentication servers (so no older versions of the software could be reactivated if you had a new computer or fresh install). They replaced these legacy versions with a newer version which again ran slower and worse than earlier versions. It also did not work at all on any Mac computers. The solution: Buy the new versionSo I did. And now rather than a base application and plugins, everything is split into multiple purchases. Buy twice. So I did. And again with updated, the plugins continue to run poorly even on a powerful editing desktop. Customer service has been terrible. I assume their response to this will be \"Submit a ticket!\", which is pointless. I've tried, I've purchased and re-purchased and then repurchased again (not learning my lesson) and nothing ever gets fixed.Despite buying, I constantly get bombarded with their \"Best sale.. EVER!\" emails every day. For someone who just bought the software, I don't need 3 emails a week telling me to purchase it. I've unsubscribed but continue to receive them.Don't bother. Look at Luminar, Topaz or even Nik instead."
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "T M",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T08:23:19.000Z",
          "Titre": "I am finding it a hard programme to…",
          "Contenu": "I am finding it a hard programme to learn. It is not as easy as Lightroom, which is what I am trying to move away from."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Julie Boos",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T21:01:17.000Z",
          "Titre": "The no noise app keeps freezing and…",
          "Contenu": "The no noise app keeps freezing and quitting. I have plenty of storage and RAM.  All my other apps run fine."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jacob A Fitch",
          "Nb_Reviews": 1,
          "Date": "2023-04-30T16:01:10.000Z",
          "Titre": "The user interface",
          "Contenu": "The user interface, even with videos, is very frustrating to figure out."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Steven Barkan",
          "Nb_Reviews": 2,
          "Date": "2023-06-07T22:34:38.000Z",
          "Titre": "better instructions",
          "Contenu": "need more basic instructions to launch new stuff in on1 RAW"
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "Rabos",
          "Nb_Reviews": 2,
          "Date": "2023-05-24T09:57:30.000Z",
          "Titre": "Translation into Dutch can be improved",
          "Contenu": "Translation into Dutch can be improved. A lot!"
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Michael Fischer",
          "Nb_Reviews": 6,
          "Date": "2023-06-06T21:49:08.000Z",
          "Titre": "Not for Mac",
          "Contenu": "On MacOS to slow, 32 Gb RAM are Minimum"
        },
        {
          "Note": 2,
          "Lieu": "EE",
          "Pseudo": "Aivar Pihelgas",
          "Nb_Reviews": 2,
          "Date": "2023-06-10T11:19:38.000Z",
          "Titre": "I used before Effects 2019",
          "Contenu": "I used before Effects 2019. It was better."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Jacki Starr",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T23:55:06.000Z",
          "Titre": "Very slow to respond",
          "Contenu": "Very slow to respondHave had issues with on123"
        },
        {
          "Note": 2,
          "Lieu": "CZ",
          "Pseudo": "Michael Kucera",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T09:51:21.000Z",
          "Titre": "Too complicated for me."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "William Pesci",
          "Nb_Reviews": 2,
          "Date": "2023-08-06T12:33:26.000Z",
          "Titre": "have not had a program that crashes as…",
          "Contenu": "have not had a program that crashes as much as this"
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Bianca Sasse",
          "Nb_Reviews": 1,
          "Date": "2023-06-25T09:00:47.000Z",
          "Titre": "I can't start the program",
          "Contenu": "I can't start the program. Don't know what's wrong."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "david",
          "Nb_Reviews": 4,
          "Date": "2023-04-19T04:28:28.000Z",
          "Titre": "Mediocre",
          "Contenu": "Mediocre! Not accurate results."
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "Patrick Fenemor",
          "Nb_Reviews": 2,
          "Date": "2023-05-15T03:29:58.000Z",
          "Titre": "..............................."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anna B.",
          "Nb_Reviews": 3,
          "Date": "2023-12-17T06:56:38.000Z",
          "Titre": "Complicated to Learn!",
          "Contenu": "ON1 seems to enable beautiful photos, but it is a whole lot more complicated to learn than what I had expected from the advertising I had seen. I have watched some of the tutorials, but I have not gotten very far. Maybe it's expected that I would have more previous experience in Photoshop and Lightroom? I'm feeling confused and frustrated!!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lawrence Bartasavich",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T19:38:29.000Z",
          "Titre": "I like that you offer a limited use, but dislike fees for learning videos",
          "Contenu": "I like that you offer a limited, free trial of Effects. I used the application and decided to buy it based on that experience. However, I have a problem with the fees you charge for your learning videos. No one knows the application as well as you, yet even after collecting money from users through a purchase you charge them even more to learn the nuances and intricacies of your product. Seems to me since you want to grow your market you would make it as easy as possible for new users to learn and grow with the application. Charging for videos discourages the very thing you want - more users. Makes me hesitant to buy anything else from ON 1."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jim Cummings",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T04:22:07.000Z",
          "Titre": "Processing",
          "Contenu": "i regularly get the message that it is \"processing\" so it can't close. the only way to close up is by \"ctrl+alt+del\". the photo i was working on has disappeared."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Domingos Rodrigues",
          "Nb_Reviews": 4,
          "Date": "2023-12-04T02:40:08.000Z",
          "Titre": "I love ON1 and have had their programs…",
          "Contenu": "I love ON1 and have had their programs for a few years and did not have a problem with any of them, but for some reason, I'm having a problem with this last version, ON1 Photo RAW 2024.I love the service department which has been helping me until now!But, the problem is that this version was not ready for release yet. It has quite a few bugs and some of the sliders are missing on my version of this program.When I try to follow some tutorial videos, I have to stop because some sliders are unavailable, etc."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Paul Holland",
          "Nb_Reviews": 3,
          "Date": "2023-12-01T17:08:35.000Z",
          "Titre": "Nice but needs work",
          "Contenu": "The release of this product was poorly done. So much hype and then so many issues to install and run a licensed copy.  AI Brilliance is not what it is cracked up to be, frequently missing the mark. Personal presets within Lightroom are far more effective and on the money.  Photo Raw Max will not allow imports from Lightroom to open as layers in On1 anymore and is the prime reason I leave Lightroom to go to ON1.  I find the interface is more complex than it needs to be.  AI masking really only handles the simplest of images and I nearly always have to go back to the brush. The brushing, if complex, hangs and becomes jerky after numerous brush strokes.  So, lots of room for improvement and Lightroom will remain at the heart of my workflow."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cindy",
          "Nb_Reviews": 3,
          "Date": "2023-11-30T14:10:13.000Z",
          "Titre": "Fabulous outcome, just have to dig for user information and guides.",
          "Contenu": "All the information, help, and tutorials are buried on the site. Before purchasing something of this liking I prefer to see real life examples of the software, including menus, tools, and how to.  There is not much on You tube (from you as a company) with these examples either. The one for noise is years old, and not informative.  It leaves a lot of your customers wondering and digging for information on how to get all the tools to show, the top menu is locked out when using in PS or LR, but yet no one explains this in the videos you have. Making a user dig for this information is not a plus. I have been in photography and graphic design for over 14 years, and found this confusing, I can bet there are more users feeling the same. There are other software providers that go more in depth and have that information up front and visible, hence my 3 stars instead of 5."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert McCutchan",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T01:15:38.000Z",
          "Titre": "Still a bit cumbersome",
          "Contenu": "I've been using Luminar for a while,  and their interface is so much simpler, plus  they put quick masking brushes in every tool.   I routinely edit thousands of pictures at a time,  so I need a fast editing workflow.  I use large dodge and burn brushes on most photographs, so quick acces to those brushes is important to me.   On1 is getting better,  but the interface is still a bit cumbersome,  especially when using brushes.  The effects module is a bit awkward and i usually don't use it. The perfect software would be Luminar Neo editing interface with On1 file management."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tony",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T22:15:03.000Z",
          "Titre": "It may be great software but…",
          "Contenu": "It may be great software but, if you are new to using it you have very few resources for learning how to use it to your best advantage. What is a good work flow? Where do you start? So many questions and so few answers."
        },
        {
          "Note": 3,
          "Lieu": "CH",
          "Pseudo": "Schneider",
          "Nb_Reviews": 3,
          "Date": "2023-10-26T07:59:25.000Z",
          "Titre": "I enjoy the the easy handling and…",
          "Contenu": "I enjoy the the easy handling and workflow to get beautiful images out of my raw files. This works fine on the computer, but there‘s a huge drawback on the mobile platform: no possibilities to get the images out of the cloud sync either on the apple nor on the windows side (all software are updated). If this cross over would work then it is a superb package."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Margery Elder",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T02:28:50.000Z",
          "Titre": "Well that is hard to put into words",
          "Contenu": "Well that is hard to put into words, when I first joined ON1 it was when you first got going and surprise it cost nothing then, I can't remember what photo editing platform I was with then and ON1 took over, so I have been with ON1ever since, and like everything it costs more every year, sometimes it becomes too expensive, sure I understand you all have be rewarded for all your time and effort may I say it wonder work that you do THANKS . Money get tight sometimes."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Crogem",
          "Nb_Reviews": 2,
          "Date": "2023-10-30T15:22:53.000Z",
          "Titre": "Poor customer setvice",
          "Contenu": "Have had two accts for years because of an error made setting up Acct. Cannot get it corrected so it is very difficult to access the program or use it!!! Have made multiple calls but no results!!! Cust service seems only a sales dept."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Colin Neatherway",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T07:26:39.000Z",
          "Titre": "I am bulk processing a thousand photos…",
          "Contenu": "I am bulk processing a thousand photos from a sports photography shoot.  After rating and processing, I identified around 450 photos for upload to social media.  The actual upload is taking over two hours.  Seems an inordinately long time for process to be completed.  The program is now unusable while the upload is completed.  Not an efficient or effective use of the program. I find the interface confusing (not having a Lightroom background.  With on going usage, processing less bulk upload should become more familiar. Provide an update once skills and knowledge has improved."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Robert Taylor",
          "Nb_Reviews": 4,
          "Date": "2023-11-28T00:54:26.000Z",
          "Titre": "Everything seems to work OK except…",
          "Contenu": "Everything seems to work OK except Denise which crashes straight after loading."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bengt",
          "Nb_Reviews": 3,
          "Date": "2023-08-17T15:08:38.000Z",
          "Titre": "I'm a long time customer, but!",
          "Contenu": "I'm a long time customer, over 10 years and not an everyday user. For some reason I have a problem using the software due to all twists and turns regarding the user interface which change sometimes dramatically when a new release is introduced. Ok you have teaching videos but sometimes they make me even more confused as I don't always have the background from previous versions. Wish I could get some easy way into using on1 from start to end."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Judy Guenther",
          "Nb_Reviews": 7,
          "Date": "2023-09-19T16:17:12.000Z",
          "Titre": "I Love ON1 (except when I’m having a technical issue)",
          "Contenu": "I love ON1. But I’m having a technical issue that makes the software useless. I thought installing the upgrasded ON1 Effects would solve the issue. I’m working with your technical team but as of now, I can’t use it which distresses me. My entire work flow has been disrupted."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cedric",
          "Nb_Reviews": 6,
          "Date": "2023-08-27T16:48:28.000Z",
          "Titre": "Just Beginning",
          "Contenu": "I just started working through the program, which I intend to use in conjunction with Adobe Lightroom, because I'm intrigued by some of the extra effects you can get with ON 1. However, it's really complicated, and the layout isn't exactly intuitive. Sometimes you use panels on the right for effects, sometimes the tools at the left, sometimes you hold down the mouse key and a panel pops up, sometimes you go to the tool bar at the top. I'll you know when I'm more comfortable with the program"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Denis-Carl Robidoux",
          "Nb_Reviews": 2,
          "Date": "2023-08-02T07:11:01.000Z",
          "Titre": "It works with some quirks.",
          "Contenu": "It works, it helps but there are quirks:-It does not support all image file types, -It does not support all picture encoding methods-It gets confused between the metadata's thumbnail and the actual picture.-it can't handle monochrome files (1 channel). -It would be a better tool if it was able to recognize and filter out jpeg compression artefacts-And my main itch: It doesn't work on Linux"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Andy",
          "Nb_Reviews": 6,
          "Date": "2023-08-17T17:45:31.000Z",
          "Titre": "ON1's response to problem did not solve it",
          "Contenu": "I puchased ON1 Photo Raw following a trial and, in addition, received some bonus content as presets. Despite following the instructions in the manual I could not load them into the software. I contacted ON1 via a Facebook message and received, the next day, what looked like a stock response that really did not solve the problem. With a bit more experimentation I found I could load the presets (in Windows 11) only if I right-clicked on the file and selected \"open with\" ON1 Photo Raw as long as Photo Raw was not running. Thus I had to close the software before loading each preset!"
        },
        {
          "Note": 3,
          "Lieu": "CH",
          "Pseudo": "Martin Langenegger",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T21:02:22.000Z",
          "Titre": "Catalogues: Room for improvement",
          "Contenu": "Catalogues can't be saved to another volume. There is only one catalogue and it's on your startup disk. In CaptureOne or Lightroom (or even Photos for macos) I can create several catalogues and save them where ever I like.This means that if you have a lot of photos you can only work in Browse mode …"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Valued Norton Customer B",
          "Nb_Reviews": 2,
          "Date": "2023-07-26T18:31:49.000Z",
          "Titre": "Upgraded after several years - OK but not great",
          "Contenu": "Upgraded after several years. It has become complicated and more difficult to use and no longer easily intuitive. Charge extra for most video learning courses. Those that are available are tedious and do not answer the question directly but are more personal reflections from the person making the vide. Resize for example offers a few buttons but does not really provide information on what other things are available and how to use them like PS that has popup information when you hover. Masking is another thing that has become very difficult to use. When it works it is great but if you want to step back and figure out how to get what you want you are stuck UNLESS YOU PAY DOUBLE SO YOU CAN SEE THE VIDEO OF HOW TO USE IT."
        },
        {
          "Note": 3,
          "Lieu": "PL",
          "Pseudo": "Andrzej Folwaczny",
          "Nb_Reviews": 2,
          "Date": "2023-06-07T19:07:10.000Z",
          "Titre": "The programme has a lot of potential…",
          "Contenu": "The programme has a lot of potential and many great features. But I miss the basic Tutorials, which would show the new user all the functions step by step. Especially since some of the tutorials are out of date after updates. In addition, the programme sometimes closes itself or does not save files - which I have reported via the help."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 7,
          "Date": "2023-04-18T17:56:09.000Z",
          "Titre": "The Good and Bad",
          "Contenu": "What I like: Sky replacement: not perfect but better than PS, compares favorably with Neo. SkySwap AI with some manual masking works very well, especially with PurePixel.Transformations work well.What I would like to see improved:Processing speed -- operations appear to bog down after certain operationsBrowsing through catalog images really slows down after edit operations -- very annoying. Takes a while to bring up a single photo ... switching between layers can also be slow, also annoying. I have a Ryzen 5800X processor and AMD RT 6600 GPU, 64 GB RAM.Better HDR and more HDR presetsI find the UI confusing at times. Probably because I am a longtime PS and Lightroom user.Thank you for listening ... I do like the product and am looking forward to improvements."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bluegoldwing",
          "Nb_Reviews": 8,
          "Date": "2023-07-16T19:51:59.000Z",
          "Titre": "Great Webinar, poor getting to it!",
          "Contenu": "This review is in reference to the Summer Photo Editing: Elevate Your Creativity with ON1 Photo RAW!, webinar.I started out trying to log into Zoom, which kept asking me for a PASSWORD, whic was NEVER given to me in any of your correspondence. Then I waited till it ended to attempt to follow your instructions to see it on either YouTube or you webpage. None of the links you posted, in the follow-up email would work. I sent emails to customer service, complaining of my experience, yet nothing they sent me would work. I wound up going through every link on your web page and finally found it in the Video Library."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "ChrisF",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T04:22:07.000Z",
          "Titre": "Decent software but shouldn’t have to pay for tutorials",
          "Contenu": "Decent software with some unique capabilities…but from someone coming over from LightRoom I feel the support is lacking.  If On1 is invested in my success with their software, then tutorial videos should all be free.  This Ala Carte approach is just a hair away from the subscription model which drove me away from LR. I'm giving it a year and if I can't get my productivity back to where I was with LR, I may bit the bullet and go back."
        },
        {
          "Note": 3,
          "Lieu": "DK",
          "Pseudo": "Gunni Grahn",
          "Nb_Reviews": 31,
          "Date": "2023-06-22T06:38:37.000Z",
          "Titre": "Normally i am very excited for on1s…",
          "Contenu": "Normally i am very excited for on1s products and the new keyword ai brings promise. But after trying other software that does the same its unfinished, slow and not producing usable results. When it does at some point, they will get 5 stars as usual."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carol from small-town Alaska",
          "Nb_Reviews": 3,
          "Date": "2023-06-13T09:59:17.000Z",
          "Titre": "While the technical bugs in audio remained unfixed, our host was terrific.",
          "Contenu": "I liked the examples our host provided, to further explain the ways to use the various products in ON1. What I wasn't happy about was the amount of audio problems that consistently covered up his words as he spoke. I therefore felt that I missed a lot of what he was trying to say. Still, it was worth my time, as I was unfamiliar with most of the subject matter he discussed. He clearly cared about his work, and often apologied for the technical trouble."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bill G",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T18:54:05.000Z",
          "Titre": "Not a simple transistion from Lightroom 5",
          "Contenu": "It is difficult to find some of the tools that I use in lightroom.  The help feature does provide the answers, but not on the first or second try.  You must keep digging to find your correct answer.Selecting \"foreground\" isn't 100% effective, and I've yet to learn how to adjust that."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 7,
          "Date": "2023-04-23T00:05:03.000Z",
          "Titre": "Slow, Crashes, Tech No-Support",
          "Contenu": "Slow, crashes without warning, \"tech support\" no real support at all, just gives stock answers blaming the hardware. There are plusses about the application but the minuses outweigh them. I wouldn't / can't use this in a professional workflow environment."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "George McMennamy",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T17:46:52.000Z",
          "Titre": "Crashes to much",
          "Contenu": "Crashes to much. The constant increase in size causes it to be progressively slower and slower. Must have at least 32 gigs bytes of memory to operate at descent speed. As it gets bigger it requires constantly up dating your computer. Besides that it’s a great program."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Craig",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T05:51:28.000Z",
          "Titre": "Essentials all there but performance is poor",
          "Contenu": "I shifted from Lightroom / PS to the ON1 platform, I was prepared for the clunky transition of re-learning where all the menu, buttons and options were - it's a bit different but all the essentials seem to be there. What's really let me down is how slow it is, I'm running a reasonable system with Intel i7 processor and IRIS graphics card and all files are stored on an internal SSD but still I'm getting lag between most actions.  Sometimes clearing the cache helps a bit but not long later and the lag and waiting is back, really frustrating when trying to edit lots of RAW images in one session."
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "Patrick",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T13:30:07.000Z",
          "Titre": "User of the 2023 plugin version from LR",
          "Contenu": "User of the 2022 plugin version, I was hoping with the new 2023 that some faults would be solved. Unfortunately not !!From LightRoom, the creation of a .dng file leads to new keywords at the root on LR, not taking into account the structuring of LightRoom keywords !! It's to bad !! I hope for a next release !"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tom Birrenbach",
          "Nb_Reviews": 1,
          "Date": "2023-06-24T19:50:54.000Z",
          "Titre": "The program has unlimited potential but",
          "Contenu": "The program has unlimited potential but. Sometimes the training videos are hard to follow and I have not been able to save some of them. Also I resent being asked to pay an additional fee to get the plus features."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "CB",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T00:10:25.000Z",
          "Titre": "Liked curves and effects filters",
          "Contenu": "Liked curves and effects filters, ease of use. Noise reduction needs work DXO has more refined process, ON1 2023.5 too many geometric artifacts."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Russell Jackson",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T15:56:32.000Z",
          "Titre": "Great product, but horrible support ruins it.",
          "Contenu": "I really like the product and the idea that I could do all of my work in a single product, but tethering with my Z9 would not work. I tried working with support to resolve the issue, but I would only get one reply per day at first, and then after sending in my log files, I did not get a reply for four days. During that time, I asked for a response several times and asked for a phone number to call support. The first reply I received was just a link to a 4 year old page about why they don’t have phone support. I replied immediately asking about my issue and log files. They took another hour to reply to say everyone that could help was on vacation and I would need to wait until they returned. At that point, I had to give up and request a refund. I can’t afford to rely on a product/company where I cannot get reasonably quick help for issues."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Denis Chabot",
          "Nb_Reviews": 5,
          "Date": "2023-05-12T15:19:47.000Z",
          "Titre": "Difficult to learn when you are not…",
          "Contenu": "Difficult to learn when you are not used to  work on ON1 general application.Linear workflow where you can't go back on a prior adjustment without loosing your work.Workflow tutorial very superficial, Refining the masks can be a painful."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alexander Brenner",
          "Nb_Reviews": 1,
          "Date": "2023-07-09T12:54:12.000Z",
          "Titre": "Good program, wrong purchase.",
          "Contenu": "I was disappointed with what I go an what I expected. I tried the one with all the bells and whistles but bought the cheapest one.  My fault for not looking at the selections better. I ended up buying a bunch of plugins and got pretty good results but wish I had purchased the the next level up with most everything. All was not lost as I can use the plugins with Adobe Elements.After a year if I am still around I may purchase the upgrades. I am 87 so is kind of iffy,"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Berninger",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T17:37:33.000Z",
          "Titre": "Still waiting",
          "Contenu": "It is mildly disappointing to pay for a product and then wait two weeks (and counting) to receive it."
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "Heer  Alvarez",
          "Nb_Reviews": 18,
          "Date": "2023-07-08T12:04:25.000Z",
          "Titre": "To be honest",
          "Contenu": "To be honest, I dislike it.  One of the several shortcomings is that the zoom to zoom in is not enough.I respond to your answer: I bought the ON1 raw 2023 and you cannot set the zoom, while you really need it on a phone screen.  I have indeed requested a refund."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stan McQuown",
          "Nb_Reviews": 3,
          "Date": "2023-05-31T05:48:53.000Z",
          "Titre": "Each time I open it can’t show all of…,",
          "Contenu": "Each time I open it can’t show all of my catalogued folders, there are 3 so sometimes it 1 sometimes 2, very rarely shows all three without a close and reopen. No ono on one service from the tech support team!"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Michael Tan",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T20:27:11.000Z",
          "Titre": "System requirements",
          "Contenu": "System requirements require a huge upgrade in order for me to run ON1 2023.5 Photo Raw, so I never got to experience the wows reviews talk about."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Denis Desilets",
          "Nb_Reviews": 2,
          "Date": "2023-06-04T18:28:17.000Z",
          "Titre": "the software doesn't work on my…",
          "Contenu": "the software doesn't work on my computer. The software available is for Intel only and I have an AMD platform. Your tech group cannot help, I will request a refund."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "EDMUND \"EQ\"",
          "Nb_Reviews": 3,
          "Date": "2023-04-24T17:20:34.000Z",
          "Titre": "ON1 captures all  my photos without…",
          "Contenu": "ON1 captures all  my photos without permission and blocks/ covers the image with a large blue ugly \"gear\".How do I prevent this from happening?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Walter Owens",
          "Nb_Reviews": 1,
          "Date": "2023-08-27T21:22:31.000Z",
          "Titre": "The uploading should be made a lot…",
          "Contenu": "The uploading should be made a lot simpler and mine has crashed twice just searching for a file. The editing is sweet no problems with it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jack Tompson",
          "Nb_Reviews": 5,
          "Date": "2023-05-24T01:59:08.000Z",
          "Titre": "Need Vulkan",
          "Contenu": "After i downloaded 2 of the programs i was instructed i would need Vulkan 1.1 or later. there were no instructions or links where i could get the appropriate Vulkan-whatever that is.I felt like i wasted my money for an item i really want.Jack Tompson"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "N HOWE",
          "Nb_Reviews": 2,
          "Date": "2023-08-13T22:03:11.000Z",
          "Titre": "The purchase downloaded as I was so…",
          "Contenu": "The purchase downloaded as I was so keen to update ..I made a mistake and forgot to look at technical specs .,for the moment I have to wait till update my pc"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carmen W",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T01:12:01.000Z",
          "Titre": "ON1 will deactivate licenses to force customers to upgrade.",
          "Contenu": "UPDATE 3/29/23 I have changed my review from 1 star to 3 because almost four months after my initial review (see below) and after seeing that review, ON1 unexpectedly made things right with my licensing issue. The reason I did not change to 5 stars is because of the experience I initially had with tech support and how they handled the situation with a \"too bad\" attitude.  The tech support rep didn't seem to care about resolving the actual issue to keep a long time customer.  A poor review shouldn't be the reason to make things right, when it could have been handled before a review was even posted.ORIGINAL REVIEW-Had started using ON1 Photo and ON1 Photo Raw in its beta days (2016).  Liked this software and decided to purchase it.  It had been great for me,  until the company decided to deactivate/expire my license in order to force me to upgrade to new version.  The version I was using met all of my photography needs, I did not see a need to upgrade.  Contacted support with absolutely no help, basically told me I qualify for a discounted upgrade price.   This is how they treat longtime customers."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Wolfgang Gabriel",
          "Nb_Reviews": 1,
          "Date": "2023-04-21T18:41:48.000Z",
          "Titre": "ON1 is easy to use and you will get…",
          "Contenu": "ON1 is easy to use and you will get fast results.For most of the customers is this enough.I think, your app has no chance against PS or Affinity Photo. The last one is much cheaper than yours.Nice in ON1 is the development of the raw-files"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Janice",
          "Nb_Reviews": 2,
          "Date": "2023-06-15T22:53:51.000Z",
          "Titre": "Disliked that there was no thought for…",
          "Contenu": "Disliked that there was no thought for enlarging works of art ..Just photos....Since the tools will be improved with time, and I've invested $200..I'll stick by you for a few months!!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dan Trinh",
          "Nb_Reviews": 2,
          "Date": "2023-07-30T07:53:12.000Z",
          "Titre": "Doesn’t connect to photoshop",
          "Contenu": "Doesn’t connect to photoshop. Not my working flow. I have to pay extra to get to on 1 from photoshop which is frustrating to me. I ended up not using it that much."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Clive Kingsley",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T16:38:47.000Z",
          "Titre": "I like the programs… but sadly the…",
          "Contenu": "I like the programs… but sadly the latest update to photo raw won’t work on my computer . Until then everything was excellent."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "daltenloh",
          "Nb_Reviews": 2,
          "Date": "2023-07-21T03:35:04.000Z",
          "Titre": "Effects and capability -- Excellent… BUT!!!",
          "Contenu": "Effects and capability -- Excellent when I wait the time.  I am a novice to the program.  BUT, I am very competent in WIN and Computer stuff.  ISSUES:  Speed of loading -- slow.  It takes too long to load.  It uses too much memory and too much of the CPU and using 4G memory.  Task Manager is pegged out!  And I have a Win10, I7 system.   Power usage Very High, Memory - 4G!  I think it is wasting time in scanning folders -- so what ever, make it only respond when I need it to.  Making a change in the picture and preview -- TOO SLOW.  I hit several buttons to change the photo and it takes forever!  And I actually locked it up. Had to try to close and reopen and it too forever to actually get the WIN 10 system to respond normally.   ALSO -- DAMN-- File Menu:  PLEASE ADD a simple CLOSE File and SAVE AS when I am done to conform with standard WIN menu.   I finished the editing and couldn't figure out how to simply save to a different folder -- I used \"EXPORT\" -- why can't I find the option \"SAVE AS\"?  And then CLOSE the file I was editing?  I was never able to actually close the file I was editing.  I like the capabilities, but..... incorporate some of the standard menu options.  In my opinion, you need to incorporate the usual expectations in the menu options and really improve on the speed.  I. e. don't make the program appear to be scanning my computer and wasting my time waiting for it to load and make it available for actually doing the work. Ass I learn the system, I am sure I will have more issues!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Linda McCurry",
          "Nb_Reviews": 3,
          "Date": "2023-09-26T03:29:51.000Z",
          "Titre": "I'm just disappointed that On1 Resize…",
          "Contenu": "I'm just disappointed that On1 Resize isn't part of the On1A1 thing."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Matt",
          "Nb_Reviews": 2,
          "Date": "2023-06-02T19:18:47.000Z",
          "Titre": "The version I was using ran OK  bu the…",
          "Contenu": "The version I was using ran OK  bu the latest update of Photo Raw 2023 won't run on my computer. I have to be honest I feel really let down."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "David Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T19:51:51.000Z",
          "Titre": "I bought the Plug-in bundle",
          "Contenu": "I bought the Plug-in bundle.  However, I thought I was buying ON1's 2023 software BUNDLED with the Plug-ins.  In fact when I first contacted ON1's technical help, the helper (Stevie) did NOT advise me differently - He gave me instructions about how to get rid of the error -4.  He replied to my help request within 24hrs. However, when I replied to Stevie again (several times), he did not respond for 6 (six) days.  I had sent notes about my \"discoveries\" as I spent many hours trying to install it.  He finally replied (6 days later) and advised me that I had NOT purchased \"ON1 Photo Raw 2023.5\"!  Well, that solved the issue!  Since I could not use the plug-ins with my version of Photoshop, I requested a refund and it has been issued by ON1.  I quoted my contract # ID: ON1230801-4113-39716 on the first line of my first ask for help.  If Stevie had looked this up, the issue would have been immediately resolved.  However, why was I confused in the first place?  Well, I saw the word \"Bundle\" on ON1's \"sales\" promotion page and I thought, \"Great!  I can buy the whole package!\"  But, as the page told me, \"I gotta do it today to get the sale price.\"  So I did.  I recommend making the page less confusing unless the confusion is your intent.  I recommend a promotion that says, \"Download a free trial of ON1 2023 and IF you purchase the software within the trial period, you can purchase the Plug-in bundle for 50% off!\"   I also recommend that helpers check the customer's contract before proceeding with any help!!  I wish you success in your business.  I did try the ON1 Raw 2023 software in the free trial.  Unfortunately the file extensions were not recognized.  However, the main issue was that I could not figure our how to \"save\" my adjusted photos!  Why is that so difficult?  In Photoshop it is just under file/save or save as.  Thanks for the refund.  Dave, 250 493 4228"
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "INTERNULLO ROSARIO",
          "Nb_Reviews": 1,
          "Date": "2023-04-16T14:28:02.000Z",
          "Titre": "As I open the program It stops",
          "Contenu": "As I open the program It stops, asks me if I want to report the problem and if I say no it keeps working."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Janet Ortega",
          "Nb_Reviews": 1,
          "Date": "2023-04-26T22:57:56.000Z",
          "Titre": "A problem every time I sign in",
          "Contenu": "I have not used the software yet but every time I try to sign in it’s telling me I need to buy the software before I can sign in. That doesn’t make me feel good!"
        },
        {
          "Note": 3,
          "Lieu": "PT",
          "Pseudo": "Sergio Duarte",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T13:17:13.000Z",
          "Titre": "User experience",
          "Contenu": "I missed the capacity of easily being able to move photos from one place to other and also sort them by several criteria options."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Harvey Dale",
          "Nb_Reviews": 2,
          "Date": "2023-06-18T20:52:54.000Z",
          "Titre": "When ON1 Sky Swap AI works well",
          "Contenu": "When ON1 Sky Swap AI works well, it's excellent, but it's slow on starting up as a Photoshop plugin (between 10 and 40 seconds of lag time), and it sometimes hangs up completely (and will not start at all), and sometimes -- even once it has started up -- some of the choices in the menus fail to be selected even after clicking on them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Fred Pais",
          "Nb_Reviews": 4,
          "Date": "2023-04-05T21:43:11.000Z",
          "Titre": "I purchase their software 4 months ago…",
          "Contenu": "I purchase their software 4 months ago when I didn't have any real estate work using it for social media and similar needs. Recently the market picked up and I needed to put it to work. Keeping in mind that I already own 3 other pro-software editing packages, I like the navigation and the features and took the plunge for the most expensive editing software I ever paid for figuring for the beter... now wrong!That all said, for those in the real estate side know that photos, at least on the east coast, have to be uploaded by the real estate agents to MLS PIN, which is the lsiting service for at least 3 or 4 states in this area. They are not seen by the prospect if you don't.Bottom line, there is some sort of glitch in the software that MLS PIN catches and rejects the uploaded .JPG photos. The problem stems from the On1 Photo RAW output file. These images are in .JPG for this service. It makes no difference the title number of characters, the long edge pixel count or the dpi or any combination of! I almost lost several clients due to this. The kicker when I went back to my other software, I was able to load all the images to MLS specifications and even exceeded the limits 250% without any issue or rejection!There is no chat, no phone, and no answering emails. In other words, no customer or technical service. I sent two emails and marked them urgent...So what!  Lost over $250 for the stuff I bought including the 2022.1 version of their elite software. Suggestion: look somewhere else.As an update 04/05/2023, although I love the software otherwise, it is not conducive to the New England MLS for real estate which in itself is strange. However, using other software (three in all) for the same purpose has no issues. The problem continues to point to ON1 with no resolution to date."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Rodney",
          "Nb_Reviews": 3,
          "Date": "2023-06-07T21:33:28.000Z",
          "Titre": "I loved the old version",
          "Contenu": "I loved the old version, and I’m slowly getting used to the 2023. The changed filter and preset drop downs aren't as user friendly now now."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Amnon",
          "Nb_Reviews": 4,
          "Date": "2023-08-29T21:34:49.000Z",
          "Titre": "I NEED MOORE TIME",
          "Contenu": "I NEED MOORE TIME , AS TODAY IT'S BETTER  FOR ME WITH Skylum Software L.NEO .,YES I SEE ALL YOUTUBE ON 1 .THANK YOU"
        },
        {
          "Note": 3,
          "Lieu": "JP",
          "Pseudo": "Hiroshi Ishibashi",
          "Nb_Reviews": 5,
          "Date": "2023-10-06T03:49:15.000Z",
          "Titre": "Upgrade unclear",
          "Contenu": "Eligibility and procedure for an upgrade need to be more clearly described."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeffrey",
          "Nb_Reviews": 2,
          "Date": "2023-07-24T15:21:52.000Z",
          "Titre": "No phone assistance available",
          "Contenu": "No phone assistance available. too much trouble fixing issues"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert Wheatley",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T18:02:12.000Z",
          "Titre": "Good features but difficult to log-on…",
          "Contenu": "Good features but difficult to log-on without getting repeated requests to buy - which as I have bought the application is very annoying."
        },
        {
          "Note": 3,
          "Lieu": "PL",
          "Pseudo": "Andrzej Folwaczny",
          "Nb_Reviews": 2,
          "Date": "2023-04-23T15:55:33.000Z",
          "Titre": "The programme is good",
          "Contenu": "The programme is very good although the interface is a little complicated. However, the selection and edge detection function during selection lowers the product rating considerably."
        },
        {
          "Note": 3,
          "Lieu": "BR",
          "Pseudo": "EUCLIDES DUTRA DE MORAES",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T22:08:44.000Z",
          "Titre": "O programa On1 RAW só funciona como…",
          "Contenu": "O programa On1 RAW só funciona como standalone."
        },
        {
          "Note": 3,
          "Lieu": "PT",
          "Pseudo": "Jo Lemoine",
          "Nb_Reviews": 7,
          "Date": "2023-08-06T19:53:11.000Z",
          "Titre": "Not a great improvement compared to 2022",
          "Contenu": "I had the plug ins 2022 ans I thought that 2023 ones would be a great improvement. It is not but price was ok"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tonda McKay",
          "Nb_Reviews": 1,
          "Date": "2023-05-14T22:28:15.000Z",
          "Titre": "I thought it would be much much better…",
          "Contenu": "I thought it would be much much better than what is already inside PS"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark Orpen",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T19:50:43.000Z",
          "Titre": "Difficulty learning to use program",
          "Contenu": "I find it difficult to learn to use this software"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Greg",
          "Nb_Reviews": 2,
          "Date": "2023-09-05T02:37:00.000Z",
          "Titre": "Slow Processing",
          "Contenu": "Just to slow processing. Can’t use it right now.  Maybe next version."
        },
        {
          "Note": 3,
          "Lieu": "ZA",
          "Pseudo": "JOHAN GEYER",
          "Nb_Reviews": 4,
          "Date": "2023-05-21T12:20:42.000Z",
          "Titre": "Very hardware dependent and not…",
          "Contenu": "Very hardware dependent and not industry leader, very expensive compared to better products."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "CJPictures",
          "Nb_Reviews": 3,
          "Date": "2023-08-10T18:32:17.000Z",
          "Titre": "I am getting a lot of no response",
          "Contenu": "I am getting a lot of no response. I hope this can be fix"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mike Gavin",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T22:27:25.000Z",
          "Titre": "I just got it",
          "Contenu": "I just got it. Get back with me. I want to use the 2023 ON1 before I rate it."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Theodore Peters",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T00:21:17.000Z",
          "Titre": "A teacher should never apologize",
          "Contenu": "A teacher should never apologize. . . ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "steven schnur",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T16:10:01.000Z",
          "Titre": "It’s a great tool",
          "Contenu": "It’s a great tool, easier than other platforms, allows me to be more productive.Great online learning content"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Steve",
          "Nb_Reviews": 5,
          "Date": "2023-12-08T17:49:13.000Z",
          "Titre": "I trialed this and Topaz",
          "Contenu": "I tried this and Topaz. There wasn't a huge difference between the two but if I was forced to pick one I would say I thought ON1 was slightly better at noise reduction without softening the picture too much and it was slightly cheaper too."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bruno ippolito",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T04:45:44.000Z",
          "Titre": "Definitely a lot quicker",
          "Contenu": "Definitely a lot quicker. I'm still not convinced that brilliance AI is material better than auto AI"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Philip Ashmore",
          "Nb_Reviews": 13,
          "Date": "2023-11-02T12:55:38.000Z",
          "Titre": "Having Been a Photoshop Camera RAW User",
          "Contenu": "Having been a Photoshop Camera RAW user for some years. Having looked at other editing suits and not been inpressed, it came has a bit of a shock when i took a look at the pre-release video of ON1 2024 and i was completely 'blown away'.I imediately downloaded ON1 and only having used it for a few days, I cannot wait for the release of ON1 2024, I feel sure it will be my go to RAW aditor, using it in conjunction with Photoshop."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "T Michael Wall",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T20:10:52.000Z",
          "Titre": "I have used ON1 software as far back as pre ver. 10.5",
          "Contenu": "I have used ON1 software as far back as ver. 10.5.  I usually upgrade every few years.  The last upgrade was to PhotoRaw 2021. Given all the advances, I decided to upgrade to 2024.  Since I have an older computer (2010, HP 170t), I tried the one month trial of  PhotoRaw 2023.  It worked well, so I decided to upgrade to 2024 hoping that it too would work on my old computer.  At the end of the install process, I received an error message saying that my version of DirectX 12 was not compatible.  Surprisingly, though, it appeared on my desktop and I tried it.  Although I really like the new interface, the Brilliant AI did not work, nor did some of the masking features.  Also, I noticed that my older processor was constantly ramping up to warp speed, as should be expected given some of the new features of AI.  So, I have installed 2023 and am going to use that version until I upgrade my computer, which I am dreading, not so much for the expense, but for the labor in transferring, installing, etc.  So, once I get established on the new computer, I will do a more thorough review.  I am an amateur photographer who enjoys editing digital photos, but who is also digitizing a large slide and color negative collection.  I would like to suggest that some information, or perhaps videos on how PhotoRaw could be utilized to accomplish this endeavor would be useful.  I believe ON1's emphasis on customers' needs is paramount in its growing base of users.  As a former resident of the Portland area (only about 5 miles from your office) I wish you well.Michael WallDavisburg, Michigan"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jack Blackstone",
          "Nb_Reviews": 2,
          "Date": "2023-10-14T18:01:03.000Z",
          "Titre": "Adobe and ON1 user",
          "Contenu": "I’ve been using ON1 for a number of years. My primary software is Adobe LRC/PS as I cut my teeth on Adobe products. Adobe and ON1 complement each other very well. I’m comfortable recommending ON1 to others as their primary editing software if they are not already heavily invested in Adobe products."
        },
        {
          "Note": 4,
          "Lieu": "UA",
          "Pseudo": "OLEKSIY",
          "Nb_Reviews": 3,
          "Date": "2023-10-24T03:07:55.000Z",
          "Titre": "Problem with basic features and interface consistency.",
          "Contenu": "On1 pros is a big variety of filters and AI selection options. But in the same time, on1 is far not the best RAW. Main function as RAW converter in not as flexible as competitors, not allows to change significantly image highlights, remove image haze. Curves, levels, vibrance, haze control should be a part if basic image adjustments menu. Images generated from RAW for editing on the screen looks not sharp (maybe because on1 wants to increase speed and responsiveness of user interface). Some Effects tools particularly double each other, like for example color adjustments. I would like to see mask intersection and subtraction options. I need possibly to create mask based on color and tone simultaneously in combination with gradient and brush tools. Album function, not as flexible as collections in Lightroom. So, as a conclusion, on1 should work on basic functionality and tools quality and consistency."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "ben bennett",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T14:44:43.000Z",
          "Titre": "Very good colour from the raw files…",
          "Contenu": "Very good colour from the raw files with my Nikon cameras which I can never quite get from adobe. The noise ai plug in also works much better and faster than Lightroom and has a jpeg option unlike adobe which I find slow and bloated producing large dng files. I will now be using this alongside adobe in my professional raw workflow."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gwinn Nelson",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T18:33:24.000Z",
          "Titre": "Sky Swap",
          "Contenu": "I'm writing with regard to the \"Sky Swap\" app. The number of choices using Sky Swap is great. However, up to this point using blur to soften the noise appears more like a move blur rather than a gaussian blur. I hope development of the No Noise app AI will continue to improve. It's certainly competitive with Topaz and DxO. I want to thank you for your follow through when a member/customer is in need of assistance."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Rolf",
          "Nb_Reviews": 3,
          "Date": "2023-08-16T17:20:45.000Z",
          "Titre": "Vulcan essential - Grafic Card necessary (Vulcan)",
          "Contenu": "Adjusted after installation of a grafic card - now ON1 runs! I have to get used to it and will watch provided training videos.=> Check program before purchase would be helpfull.BEFORE:28.07.2023: No active usage possible until now, because I had to recognise that I need to buy an extra graphics card for my elder pc. Vulcan does not run with my existing configuration. Next week I will get the extra component and then I can check ON1 - but not until now."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "MrJohnOldfield",
          "Nb_Reviews": 26,
          "Date": "2023-06-12T15:55:57.000Z",
          "Titre": "ON 1 is a useful editing program",
          "Contenu": "ON 1 is a useful editing program, however it is not perfect. The AI masking tools work well with some images, identifying the sky, background and foreground with good accuracy. With some images it fails completely identifying the whole image as foreground. The Auto sharp feature is generally too harsh and needs to be manually toned down to achieve the desired effect. I would describe it as a work in progress. I still find that I use other programs to further adjust images after using ON1. When it is on offer it's worth buying but at full price I would not purchase the program."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wing Sang Cheng",
          "Nb_Reviews": 4,
          "Date": "2023-08-25T16:23:00.000Z",
          "Titre": "I don’t like the software has to use…",
          "Contenu": "I don’t like the software has to use too advanced video card that my laptop cannot catch up, though my desktop still can. For any other software, I don’t have problem yet. If situation goes on when my desktop failed to install the ap. I will definitely give up subscribing further."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Domingos Rodrigues",
          "Nb_Reviews": 4,
          "Date": "2023-06-11T16:17:35.000Z",
          "Titre": "The ON1 Photo Raw 2023 is a wel built program. My opinian of course.",
          "Contenu": "As a Photoshop user, I find many differences between these two programs and because I have been using Photoshop for many, many years, I favor Photoshop of course.First because I'm used to Photoshop and I know where everything is already, nevertheless, ON1 Photo Raw 2023 has new modern things that make editing photography easier.Second, I have to go looking for those tools and that makes me loose a little more time.Anyway, thanks to the team at ON1 for all the video tutorials available to us.My honest opinion, of course."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ronald Tan",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T23:46:14.000Z",
          "Titre": "The software is definitely good BUT",
          "Contenu": "The software is definitely good - But customer support can be very much better. Like in having the ability to talk to a real person to resolve issues instead of having to wait 24 to 48hrs and even more to get an issue resolved thru emails only. If phone customer support is available, I will give ON1 6 stars. Yes 6 stars."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mr Michael Durkin",
          "Nb_Reviews": 12,
          "Date": "2023-07-10T07:02:20.000Z",
          "Titre": "Great product.",
          "Contenu": "ON1 has an enthusiastic team behind it that believes in it's product and supports it's customers. The product works well, albeit with a few glitches which is only to be expected in this new version of the product. However, I'm confident that with the frequent new updates - free to subscribers, these will be fixed as they go forward."
        },
        {
          "Note": 4,
          "Lieu": "HR",
          "Pseudo": "feine-pixel",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T08:21:50.000Z",
          "Titre": "good but slow",
          "Contenu": "Good: usability of the pagetutorialscapability of the programLess good: resource hunger of On1photo processingnote: Capture 1, Lightroom, Affinity, photoshop, Gimp - everything runs faster on my MacBook pro i5 than On1 Conclusion : Great program, which might become the best of the crowd if it would receive an update regarding usage of computing resources instead of new features."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "GARY HICKS",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T04:45:47.000Z",
          "Titre": "Hope the performance of the next…",
          "Contenu": "Hope the performance of the next version of ON1, will allow me to upgrade.  I have too many performance problems with the last minor release.  Great that I'm getting the next release, even though it's a major release, free."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Thomas",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T08:37:05.000Z",
          "Titre": "Same qualaty as other apps I use"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Ratliff",
          "Nb_Reviews": 2,
          "Date": "2023-08-04T01:31:15.000Z",
          "Titre": "Lots of good information",
          "Contenu": "Lots of good information, especially with ON1 Plus.  Some things can be harder to find:  The download links for owners, figuring out which videos, etc are the latest applicable file."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Bernard Lee",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T11:20:12.000Z",
          "Titre": "It is a very good alternative to…",
          "Contenu": "It is a very good alternative to Lightroom, especially for user like me who are not using such software for professional work. Your tutorials via YouTube is a great help for me to work on your software in the beginning and later in details. I recommend others to purchase it too."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "AlbertoD72",
          "Nb_Reviews": 3,
          "Date": "2023-08-08T12:33:56.000Z",
          "Titre": "Great progress in AI and easy to use…",
          "Contenu": "Great progress in AI and easy to use but the command related to AI in sharpening... letteraly destroy the image. That is the only command I wuolud like to try that does not work inmy installation, all the rest is quite superb"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Sam Perry",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T22:08:58.000Z",
          "Titre": "ON1 Photo RAW 2023 & Plugins - Comments",
          "Contenu": "Dear ON1,Very happy for the new 2023 release, with the six plugin bundles, which makes the ON1 Photo Raw application, more user-friendly, including their own presets.I upgraded from 2021, hoping that with the 2023 Portrait AI, i will be able to change/swap studio portrait backgrounds and keep the subject hair without loosing any details. But is’t not obvious, to do so, and the Portrait AI, doesn’t seem to be dedicated for changing the background ;o(, until now, I’m using Photoshop CS6 to do so.Also note that ON1 Photo Raw 2023 is compatible with Photoshop CS6, the plugins are all included in : PS6 File/Automate and also in PS6 Filter/ON1To conclude:- Hope that the Portrait AI would include and easy way to swap backgrounds and allow an easy way to keep the subject hair into a new background ;o)- ON1 Photo Raw 2023 plus the individual plugins is a great improvement, compared to the older versions, especially version 2021 ;o)- I propose to all ON1 Users to upgrade to the latest version, and include the six plugins.Keep on your great work ;o)SamQuébec City"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Andres Villamuez",
          "Nb_Reviews": 6,
          "Date": "2023-05-28T17:53:45.000Z",
          "Titre": "The software in theory is great BUT",
          "Contenu": "The software in theory is great, it has sooo many amazing features, BUT,  the performance of every feature is not good.ON1 is slow and laggy when opening images or even moving through browse to edit. I REALLY WANT TO LIKE ON1, believe I do, I have tried it so many times. I want to wait until the next update and give it another try.UPDATE...I have done a factory restore to my M1 MacBook Pro (32 gb Ram), although ON1 performance has increase  is not as close to Capture One. I am going ti keep using ON1 hoping to get better with 2023.5"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim Dueker",
          "Nb_Reviews": 4,
          "Date": "2023-08-01T10:25:14.000Z",
          "Titre": "My new review.",
          "Contenu": "I have watched  your beginner tutorials. They leave something to be desired. 1. the instructor does not share his screen enough, making it difficult to know what he is doing.2. the instructor does not explain which app he is using. That can be determined by viewing the screen after he is 4 minutes into the tutorial. But it would be nice to know which app he is using from the beginning.3. I have questions, but don't know where to get the answers. IE. which image type to use, *.jpg or *.psd or *.tif or *.pdf or others. Apparently, it is obvious but not to me.4. Should the ON1 apps be loaded into photoshop? The instructor knows the answer, but he is not forthcoming with that information.the above is but a sample of my questions,"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Glen Barrington",
          "Nb_Reviews": 1,
          "Date": "2023-05-07T07:52:36.000Z",
          "Titre": "I REALLY hate the user interface",
          "Contenu": "I REALLY hate the user interface, coming from ACDSee, it seems obtuse and unintuitive.  That being said, it's a fun puzzle to solve.  and some of the tools are rather neat.It offers very good value, if you can get past the UI, but I'm finding it difficult.  I think I'd have been happier with the plugins, frankly"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stan McQuown",
          "Nb_Reviews": 3,
          "Date": "2023-04-14T00:10:23.000Z",
          "Titre": "Bought this in December 2022 and got refund, current version seem to work!",
          "Contenu": "Bought this in December 2022, couldn’t get it to work at all, git a full refund b4 the 30 day free trial was up!Now that there has been 3 versions of updates it installed and ran as advertised. The noise and sharpen are horrible on jpg images from cell phones and too goddie on Raw images."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "HoovGold",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T20:30:46.000Z",
          "Titre": "It is a great product overall, but Resize and Tack Sharp need improvement.",
          "Contenu": "It is a great product overall. But the AI Resize did not work well for me, actually the result is terrible. I tried to resize an old picture of a person with trees behind him, after AI Resize, the trees are mixed in his face.Tack Sharp AI never worked for me either, the results are always grainy, not natural."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 7,
          "Date": "2023-05-04T20:38:33.000Z",
          "Titre": "Like any piece of software it needs…",
          "Contenu": "Like any piece of software it needs work but its sky replacement and masking tools are very good. The digital asset management (DAM) tools are good but a bit confusing. The UI takes a little (well, more than a little) getting used to) but I'm sticking with it, who knows, given the promised improvements (promises, promises, LOL) in 2023.5 it may replace Lightroom in my professional workflow.Customer service and Tech Support are good, normally they do get back to you within their stated timeframe. After dealing with tech support I repurchased the software after I had requested and received -- without a problem a refund -- due to some technical issues which they helped me with."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MH Benton",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T11:49:20.000Z",
          "Titre": "I love the workflow in On1 Raw",
          "Contenu": "I love the workflow in On1 Raw.  It allows me to quickly work to a finished exposure for print.  I do think there is room for improvement with the low-level aspects of the application, like memory management and the way data files become huge with use."
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "Marc Caers",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T16:13:09.000Z",
          "Titre": "Focus stacking has its limits",
          "Contenu": "Focus stacking has its limits. (would like to stack up to 30 pictures)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrew Kurchey",
          "Nb_Reviews": 1,
          "Date": "2023-06-04T04:35:40.000Z",
          "Titre": "I received a email from a member of my…",
          "Contenu": "I received a email from a member of my camera club and it had a ad for ON1, so i checked it out and was looking for just what they were offering. The price was with in the price range and they also had an other program that i was interested in so i purchased it.I find one of the programs is a bit different then some of the others i use, but i think in time it will satisfy all my needs."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "angelo",
          "Nb_Reviews": 2,
          "Date": "2023-06-05T21:52:17.000Z",
          "Titre": "Great news",
          "Contenu": "Hello I have recently started using On1 again I had stayed with version 2021 and you have made great strides congratulations. I specify that I use it for hobby and I retouch few photos (Family, Holidays). My rating is definitely unprofessional but, if I find flaws I will send you another report. I used a translator Greetings Angelo"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Michael Corristine",
          "Nb_Reviews": 6,
          "Date": "2023-11-20T13:59:49.000Z",
          "Titre": "ON1 gets a lot right in terms of…",
          "Contenu": "ON1 gets a lot right in terms of features and the new AI Tech, good tutorials and masses of presets, only down side it still feels a little clunky, and slow I'm on an i9 PC with 64GB Ram with 16GB Ram on dedicated Graphics card and its still slow compared with Lightroom which just feels slicker i would like to do the jump to ON1 but still currently slide back to LR for the workflow start up"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Sunny Pratt",
          "Nb_Reviews": 2,
          "Date": "2023-06-02T02:46:57.000Z",
          "Titre": "I purchased the ON1 program outright.",
          "Contenu": "I purchased the ON1 program outright.it loaded fast and worked as advertised.The only problem I have encountered thus far is that some of the tabs load slowly. This may well be attributed to my computer getting on a bit. All in all, an excellent easy-to-use photo editing program."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Allan Newman",
          "Nb_Reviews": 2,
          "Date": "2023-05-15T16:33:32.000Z",
          "Titre": "ON1 MINI REVIEW",
          "Contenu": "Seems like a solid program but also runs a little slow compared to other programs I have tried. Not a deal breaker but slower than others. Will see what version 2023.5 does hopefully that issue will be resolved."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 4,
          "Date": "2023-08-05T04:12:56.000Z",
          "Titre": "Recommended for raw files but jpegs.",
          "Contenu": "I would still have purchased Sky Swap but it would have been nice to know in advance the file limitations. It is excellent with full frame and APSC raw files but poor with jpegs. I've not yet tested it with M43 raws, hoping for good results."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-05-06T17:18:35.000Z",
          "Titre": "Excellent, but be alert to early bugs.",
          "Contenu": "I like the ON products, but in my experience, they are often released too early, and have many bugs. They're usually taken care of in a reasonable time, but in the meantime, me, the Valuable Consumer, has wasted a lot of time."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Glenn Cameron  Dusty nickname",
          "Nb_Reviews": 2,
          "Date": "2023-07-05T03:08:12.000Z",
          "Titre": "my age limits",
          "Contenu": "Even though my age limits my understanding of what this product can achieve I find that there is always help and videos to solve misunderstandings, thank you ON1 team for a great product. Dusty"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sd Press",
          "Nb_Reviews": 4,
          "Date": "2023-07-24T19:39:06.000Z",
          "Titre": "Good product but I still believe…",
          "Contenu": "Good product but I still believe Lightroom is more functional and better organized despite what Scott Kelby thinks..Given the two I would choose Lightroom"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Chris Tjong Ayong",
          "Nb_Reviews": 4,
          "Date": "2023-07-18T20:14:43.000Z",
          "Titre": "I am not an experienced user of On1",
          "Contenu": "I am not an experienced user of On1, and trying to edit raw files took me a bit time. One did well, while another not as I expected, though using the program went smoothly.I think the fault was with me.Great User Interface"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "janice",
          "Nb_Reviews": 3,
          "Date": "2023-08-15T05:28:20.000Z",
          "Titre": "Everything was going well until…",
          "Contenu": "Everything was going well until tonight. All of a sudden I couldn’t complete the denoise and sharpening. After choosing adjust the page was too big and I couldn’t find submit. Don’t know why."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Ulf",
          "Nb_Reviews": 4,
          "Date": "2023-07-04T10:32:19.000Z",
          "Titre": "There are lot of good tools",
          "Contenu": "There are lot of good tools, that help to overwork photographs quick, with a high quality.One star less, because the offers often double, and I get new offers of tools I downloaded already."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "BERNIE GELLMAN",
          "Nb_Reviews": 3,
          "Date": "2023-11-06T20:49:55.000Z",
          "Titre": "When I downloaded the app it wouldn’t…",
          "Contenu": "When I downloaded the app it wouldn’t let me login with my password & email.  I went to On1 page and changed my password that worked."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Guardsman",
          "Nb_Reviews": 5,
          "Date": "2023-05-02T09:42:45.000Z",
          "Titre": "Top three editing software.",
          "Contenu": "You have so much available to achieve excellent results with your work. Suggest that LrC & Photoshop are falling behind as leaders  in editing skills."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Dennis",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T16:44:47.000Z",
          "Titre": "New to Photo Raw And Liking It",
          "Contenu": "So far very impressed with the Photo Raw software.  Very powerful compared to what I was using previously.  So much to learn but I am trying to bite it off in small chunks.  Super that you are creating \"how to videos\" with tips and examples.  Keep up the great work."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Paule Hjertaas",
          "Nb_Reviews": 4,
          "Date": "2023-10-06T20:21:09.000Z",
          "Titre": "It doesn't link to flickr where I have…",
          "Contenu": "It doesn't link to flickr where I have all my photos and I am still not entirely satisfied with the noise rediction."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "GERARDO GONZALEZ DIAZ DE COSSI",
          "Nb_Reviews": 1,
          "Date": "2023-04-30T23:19:54.000Z",
          "Titre": "I who’d like that wile I’m editing in…",
          "Contenu": "I who’d like that wile I’m editing in tow monitors I can have a full version of my photo in the secondary monitor. You can make a loupdeck ct profile so we can work with it."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "RH",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T08:00:29.000Z",
          "Titre": "Missing clear pricing for existing users",
          "Contenu": "Pricing for existing subscribers for update to 2024 too high. Had to cancel existing subscription and book an new subscription to get a better price!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Gentry",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T17:02:38.000Z",
          "Titre": "Complicated purchase",
          "Contenu": "Typically when I have purchased something from On1 I am taken directly to a link to download my purchase. This time I had to go to two different sites and chose from multiple links to find the items I purchased."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Andy",
          "Nb_Reviews": 6,
          "Date": "2023-08-19T16:42:39.000Z",
          "Titre": "ON1 Photo Raw 2023.5 - very useful tool in the toolbox",
          "Contenu": "After trying out ON1 Photo Raw on a couple of occasions, I finally purchased version 2023.5 in late July 2023. It's not the only piece of photo asset managing and editing software I have and it is a matter of choosing the preferred tool for a particular job. A Swiss Army Knife may have a lot of attachments but sometimes, say, a specific screwdriver is needed.A really good feature of Raw 2023.5 is the development of raw files. I have both Nikon & Sony cameras and the developed output from NEF and ARW files is great. It's very easy to adjust the tonal rendering and the AI settings are a good starting place - sometimes nothing else is needed. That being said, the AI noise adjustments, particularly on high ISO files from the small sensor on the Sony, are less good and I prefer the classic method. (Another bit of software I have does it better without saying it is \"AI\" but the colour rendidtion is less pleasing!)On some tests, the focus stacking feature gave quite good \"out of the box\" results despite being limited to 15 images. On macro subjects I would normally take over 40 images so I would have to have a multi-stage process.I am not bowled over by the AI keyword feature but the auto look-up of location names from the GPS stamp saves a little bit of time.In summary, I will use Raw 2023.5 for development of raw images including various adjustments and colour grading. I do not intend to use it for managing my photo assets nor for more intricate adjustments such as blending several photos.If I didn't have the other software, I would be happy to use most of Raw 2023.5's rich features. It is good value for money."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "dwayne traill",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T23:22:23.000Z",
          "Titre": "I have been using an older version of…",
          "Contenu": "I have been using an older version of PS on my 13 yo imac. Now have a new laptop and  decided to choose ON1 after a lot of looking. I love the RAW in ON1 as I could not use it in PS !!!! It's going to be a bit of a learning curve but the tutorials are a great help and all the new presets, filters are exciting ! I'm an avid armature shutter bug at 71 yr old. The price was great  so MANY THANKS for that !!!  YES, i would RECOMMEND ON1. Dwayne."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Mark Shapiro www.markoshapirop",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T11:21:05.000Z",
          "Titre": "I have been using On1 Resize since it…beginning",
          "Contenu": "I have been using On1 Resize since it first existed. I live near the resort of Verbier Switzerland where I sell large sized wall art to the one percent. I have just up graded to the latest up grade. It works great."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Rajih Al-Shibli",
          "Nb_Reviews": 2,
          "Date": "2023-06-12T20:48:59.000Z",
          "Titre": "Adding more features and improving on…",
          "Contenu": "Adding more features and improving on tools.But would like to see more masking precision. Guess this will come in future versions"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "jackbauer",
          "Nb_Reviews": 4,
          "Date": "2023-05-19T18:44:14.000Z",
          "Titre": "Fair price with very good performance",
          "Contenu": "Fair price with very good performance. Integration in Capture One f.e. is better solved than by other vendors."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Paul Richardson",
          "Nb_Reviews": 5,
          "Date": "2023-06-17T00:34:08.000Z",
          "Titre": "On1 software has always been great…",
          "Contenu": "On1 software has always been great software to use for many years and I have always got great results from using it. I would always recommend it to people I meet"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Andreas M.",
          "Nb_Reviews": 1,
          "Date": "2023-06-03T20:10:40.000Z",
          "Titre": "I am very happy with the ON1 Service",
          "Contenu": "I am very happy with the ON1 Service. However the speed of some Video tutorials are quite high and sometimes for me as an foreign user hard to understand."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Larry R",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T15:05:03.000Z",
          "Titre": "On1 did well",
          "Contenu": "On1 did well. Unfortunately, the upgrade could not activate since my graphics  card was not adequate. No hassle refund was appreciated."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Donald Round",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T19:36:11.000Z",
          "Titre": "love the program and have used it for…",
          "Contenu": "love the program and have used it for years. I think Scott Davenport would do a lot better in your tutorials than Dylan K. Dylan is boring and disjointed. Just a thought."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Travis Mandenberg",
          "Nb_Reviews": 19,
          "Date": "2022-08-16T17:35:27.000Z",
          "Titre": "Great product, 4.5 stars overall.",
          "Contenu": "About 2 years ago I stopped using Adobe and wanted to find an alternative. I explored ON1 and was impressed with the product. While it doesn't offer EVERY feature that lightroom or photoshop does it's an interesting combination of both that provides enough functionality for the vast majority of photo-editing, even including some layering and masking abilities. In my time working with ON1 I've cataloged or edited about 10,000 photos without a problem. I've used the last two versions of ON1 and have noted significant improvements in functions and abilities from one to the next. Also ON1 uses less resources than lightroom making it perfect for those of us who don't have an M1 or M2 MacBook. (yet)they also offer free tutorials on using their project which is similar enough to adobe in front-end accessibility to make the transition quick.The only complaint I have is that sometimes, and I mean just that, not always, but sometimes the company does fall behind on customer service issues. But they have always gotten back to me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David --",
          "Nb_Reviews": 16,
          "Date": "2023-05-28T15:52:13.000Z",
          "Titre": "It works great except that it recently…",
          "Contenu": "It works great except that it recently crashed and I had to re-install. Had a lot of trouble re-installing for some reason but finally got it to work. Took me about 6 tries."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Rien",
          "Nb_Reviews": 22,
          "Date": "2023-04-20T18:13:42.000Z",
          "Titre": "Overall my experience with on1 is…",
          "Contenu": "Overall my experience with on1 is great; but there are some annoying bugs: After starting (2 screens) the photo on the left screen stays blurry until I select another one; zoom does not always work."
        },
        {
          "Note": 4,
          "Lieu": "PL",
          "Pseudo": "Janusz Piotrowski",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T20:53:00.000Z",
          "Titre": "Kapitalny program ON1 NOISE AL do…",
          "Contenu": "Kapitalny program ON1 NOISE AL do odszumiania zdjęć jak ma się stary aparat Nikon D3."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "C porter",
          "Nb_Reviews": 3,
          "Date": "2023-09-27T10:22:58.000Z",
          "Titre": "Good features but software startup on a…",
          "Contenu": "Good features but software startup on a powerfull PC is still very slow"
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "Ronald Ausloos",
          "Nb_Reviews": 4,
          "Date": "2023-06-02T19:51:01.000Z",
          "Titre": "I am having a delay when I use the…",
          "Contenu": "I am having a delay when I use the program not with lightroom before I use it  on a iMac 4 years old with 24 ram memory"
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Marzio Pennisi",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T20:08:49.000Z",
          "Titre": "Great tools",
          "Contenu": "Great tools. NoNoise AI Is astonishing! Just sometimes the software Is a little bit sluggish."
        },
        {
          "Note": 4,
          "Lieu": "LK",
          "Pseudo": "mahinda hemapriya",
          "Nb_Reviews": 3,
          "Date": "2023-06-25T15:40:14.000Z",
          "Titre": "One purticular concern",
          "Contenu": "When it comes to LOCAL area processing , i do not see an option to change the brush size. It is a huge shortcoming in my point of view. Sorry if that is my lack of awareness  in that."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "chris stewart",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T14:37:28.000Z",
          "Titre": "The download was fast and simple",
          "Contenu": "The download was fast and simple, although my folders from the previous version of on1 were not transferred over."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "chris",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T00:57:14.000Z",
          "Titre": "On1 works really well, user interface could be improved",
          "Contenu": "On1 works really well, the User interface could be easier to use, the full functionality is not immediately obvious but once you get your head around it the results are good."
        },
        {
          "Note": 4,
          "Lieu": "NO",
          "Pseudo": "Stj",
          "Nb_Reviews": 5,
          "Date": "2023-08-15T07:22:10.000Z",
          "Titre": "My second version",
          "Contenu": "My second version. Still very satisfied with the results. Are using a 2019 MacBook Pro."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Lucien Chocron",
          "Nb_Reviews": 27,
          "Date": "2023-08-08T15:06:28.000Z",
          "Titre": "I used ON1for many years",
          "Contenu": "I used ON1for many years , it is always my preferred edition programme for photoshop"
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Mauro",
          "Nb_Reviews": 11,
          "Date": "2023-06-13T14:45:29.000Z",
          "Titre": "It's a great software",
          "Contenu": "It's a great software. it only needs to improve speed and reliability with large photo archive"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Trevor Stanton",
          "Nb_Reviews": 2,
          "Date": "2023-09-28T23:47:32.000Z",
          "Titre": "I’m pleased with On1 and looking forward to the next update thanks",
          "Contenu": "The experience was straightforward as always no complaints from an eighty year old😀"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Louis Dubeau",
          "Nb_Reviews": 1,
          "Date": "2023-04-23T03:17:48.000Z",
          "Titre": "I love it",
          "Contenu": "I love it. I would suggest some workflow improvements on the right side of the screen. It would be great to detach windows. To me, it is a bit messy on this side of the screen. On1 is a very good software. I use Lightroom, Photoshop and On1. But my goal is to use only On1 one day. Maybe with your next version. I hate suscription. Great job!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Victor Larsen",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T17:45:36.000Z",
          "Titre": "Enjoy it all",
          "Contenu": "Enjoy all the video, and the product sales is straight forward easy to understand"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Chris Smith",
          "Nb_Reviews": 4,
          "Date": "2023-06-05T14:54:06.000Z",
          "Titre": "Discounted pricing was good",
          "Contenu": "Discounted pricing was good. New version.  I am a novice looking to set up 50 years of photos"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Martin Sykala",
          "Nb_Reviews": 11,
          "Date": "2023-07-19T10:26:15.000Z",
          "Titre": "Already own this software but needed to…",
          "Contenu": "Already own this software but needed to put it onto a new laptop - was forced to buy a new version. Not happy - I own Lightroom and it moved across with ease."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "pat stikk",
          "Nb_Reviews": 5,
          "Date": "2023-04-29T22:51:35.000Z",
          "Titre": "Well I just upgraded to the latest Version.",
          "Contenu": "Well I just upgraded to the latest version. I will say it seems faster the then 2022. which is helpful, jobs in the background do not seem to slow my photo editing down. I waited for the best price before I upgraded. I will say I own a few versions. 2018,2019,2020,2022 now 2023. It is nice that you do not have the annual fee like light room but to get any improvement you have to buy the next version. I owned light rm 6 and I received updates for a few years. This is 1 thing I do not see with ON1 very few if any upgrades to older versions. I still have glitches with ON1. Like when I want to just whip through the thumbnails to pick the photos I want to edit, sometimes it will take time to load the photo other times the photos load real quickly. I shoot raw 25 meg.  I have it set for quick view. I still am waiting for a factory lens correction for my Mavic mini pro 3 drone, those are DNG files. I have 1 made but not perfect. So it takes time to correct them. The auto AI masking is OK. But there are times (many) that I go to manual selecting because the AI picks large areas. Exporting images seem to be faster as well. I am using a MAC book Pro."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Said",
          "Nb_Reviews": 2,
          "Date": "2023-05-14T13:38:45.000Z",
          "Titre": "Had issues with application…",
          "Contenu": "Had issues with application installation My computer graphics card fits within parameters but application is not working (Vulcan 1.1 application requires update but none available) It is frustrating Application though is working well on second desktop I have"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "James Sharkey",
          "Nb_Reviews": 6,
          "Date": "2023-08-11T17:45:35.000Z",
          "Titre": "good program takes a bit of learning to…",
          "Contenu": "good program takes a bit of learning to use if not worked with layers etc."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "SHANTANU SHEOREY",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T07:36:27.000Z",
          "Titre": "Ease of use",
          "Contenu": "Ease of use - in one word. I was a Lr / Psd user and have switched four years ago. Very happy with ON 1. Expecting more filters etc. in the future.SHANTANU SHEOREY"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "PBM",
          "Nb_Reviews": 3,
          "Date": "2023-08-24T15:58:43.000Z",
          "Titre": "Service is great",
          "Contenu": "Service is great, Stevie gets back to me right away and always knows the answer"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Unhappy Control4 Homeowner",
          "Nb_Reviews": 3,
          "Date": "2023-05-23T21:27:23.000Z",
          "Titre": "Very good software",
          "Contenu": "Very good software.  Easy to use. The instructional videos are really helpful."
        },
        {
          "Note": 4,
          "Lieu": "HT",
          "Pseudo": "Dominique Simon",
          "Nb_Reviews": 4,
          "Date": "2023-08-21T16:42:41.000Z",
          "Titre": "An easy experience",
          "Contenu": "It was a good experience. Dealing with your web site is really easy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Young",
          "Nb_Reviews": 2,
          "Date": "2023-06-27T19:28:32.000Z",
          "Titre": "Deep and wide array of artistic tools and presets which expands creativity.",
          "Contenu": "Love the tutorials. Even after being away for a while, it can be like you never skipped a beat."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "N Ratcliffe",
          "Nb_Reviews": 31,
          "Date": "2023-05-12T17:01:01.000Z",
          "Titre": "Quick ,easy payment",
          "Contenu": "Quick ,easy payment, range of options to suit all skills and requirements. NR"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Deborah Kiarsis",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T16:09:33.000Z",
          "Titre": "Just learning I'm sure going to get…",
          "Contenu": "Just learning I'm sure going to get better as I go"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "JC Vrensen",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T11:04:51.000Z",
          "Titre": "I choose ON1 for the price and the…",
          "Contenu": "I choose ON1 for the price and the preformance. A minus is the lac of presets as in TOPAZ DENOISE AI.Maybe you can ad them to ON1"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "scott fessenden",
          "Nb_Reviews": 4,
          "Date": "2023-08-04T00:22:43.000Z",
          "Titre": "Fast reply on issues I was having",
          "Contenu": "Fast reply on issues I was having. Resolved with satisfaction."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "James Howard",
          "Nb_Reviews": 2,
          "Date": "2023-11-07T02:05:10.000Z",
          "Titre": "At first use",
          "Contenu": "I have found the auto Portrait a bit false.and the brush tool hard to use ."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Hans-Joachim Krause",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T17:29:05.000Z",
          "Titre": "Some Parts in the exposure Modul can be…",
          "Contenu": "Some Parts in the exposure Modul can be netter."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Jonathan Kimmitt",
          "Nb_Reviews": 5,
          "Date": "2023-04-19T19:02:53.000Z",
          "Titre": "This program seems to offer a variety…",
          "Contenu": "This program seems to offer a variety of powerful facilities, however like many similar offerings the number of options and menus and tabs is overwhelming at first."
        },
        {
          "Note": 4,
          "Lieu": "FI",
          "Pseudo": "Peluri",
          "Nb_Reviews": 2,
          "Date": "2023-06-12T12:39:55.000Z",
          "Titre": "Dxo photolab dngs wont open",
          "Contenu": "Dxo photolab dngs wont open, some weird lines. Luckily you can open Dxo photo lab tiff files."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 5,
          "Date": "2023-06-27T22:40:21.000Z",
          "Titre": "Would have rated 5 but…",
          "Contenu": "Would have rated 5 but downloads/updates have been very slow lately."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Anja Heid",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T08:30:59.000Z",
          "Titre": "Service is great",
          "Contenu": "Service is great. Had an answer less than 24h....perfect"
        },
        {
          "Note": 4,
          "Lieu": "FI",
          "Pseudo": "Jary Högnabba",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T04:49:55.000Z",
          "Titre": "A lot of space for a reasonable cost."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "NA",
          "Nb_Reviews": 4,
          "Date": "2023-07-04T14:56:03.000Z",
          "Titre": "OK with latest experience",
          "Contenu": "OK - just OK.  Could be more interactive"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Emkay Wheatley",
          "Nb_Reviews": 3,
          "Date": "2023-09-21T17:35:52.000Z",
          "Titre": "Long time user",
          "Contenu": "Long time user. Member of NAPP/KelbyOne."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Glen Towner",
          "Nb_Reviews": 3,
          "Date": "2023-04-24T15:26:26.000Z",
          "Titre": "Occasionally a tool or action may not…",
          "Contenu": "Occasionally a tool or action may not do as expected."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Franz Scheurer",
          "Nb_Reviews": 5,
          "Date": "2023-08-07T07:23:02.000Z",
          "Titre": "Great program",
          "Contenu": "Great program, unfortunately they do not support Hasselblad raw files 🥵"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Doug Dickin",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T02:06:03.000Z",
          "Titre": "Good Investment",
          "Contenu": "Impressed with how ON1 renders photos."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom Hobbs",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T23:57:31.000Z",
          "Titre": "Powerful but yet easy to use",
          "Contenu": "I screwed up this year and let my subscription lapse while I was traveling. Renewed it as soon as I returned and am so happy I did.  The latest version, On1 Photo Raw 2024 is the best yet.I have been a On 1 user/member/subscriber since almost the beginning.  I think it was right after the genuine fractals days. Stayed with it because of the easy to use indexing system and photo editing tools.  Dylan’s and Dans instruction videos have helped me keep up with the advancements and newest tools. On1 360 is an excellent program and example of your constant efforts to stay ahead of this ever changing photography world.Keep on keeping on, you are doing great.Tom"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Hill",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T17:05:46.000Z",
          "Titre": "New face recovery feature",
          "Contenu": "I have been a big fan of resize for years.  I especially like the new face recovery setting that automatically fixes peoples faces it finds in the photo. I am getting wonderful results without having to manually alter the original photo."
        },
        {
          "Note": 5,
          "Lieu": "CO",
          "Pseudo": "A.BUSBY",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T00:07:23.000Z",
          "Titre": "The ease of developing the pictures…",
          "Contenu": "The ease of developing the pictures using AI as a starting point. Sometimes that is all the pic needs.I haven't used all the available options as yet but liking it so far. I had been a On1 member in the past but hardly used it as I had lost some interest in photography as I had other priorities at the time.I have since gotten back in my photography."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "WALT A.",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T16:27:54.000Z",
          "Titre": "A MUST HAVE for POST processing !!",
          "Contenu": "So many reasons: PROFESSIONAL, KNOWLEDGEABLE, FRIENDLY, COURTEOUS, EXCELLENT LISTENERS!, EXTREMELY AFFORDABLE, and LOADED with very USEABLE FEATURES that are easy to use."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Daniel Lamarche",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T14:40:43.000Z",
          "Titre": "Very good application",
          "Contenu": "Very good application, lots of stock, need more practice for my self. Lots of tutoriels, i like it."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Brian Gibson",
          "Nb_Reviews": 5,
          "Date": "2023-12-12T20:54:51.000Z",
          "Titre": "ON1 Effects 2023 is a worthy upgrade …",
          "Contenu": "ON1 Effects 2023 is a great upgrade from the previous version. Really enjoy using it including the new AI masking."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mrs Gill M Brooks",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T14:51:48.000Z",
          "Titre": "Transaction was quick and easy"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "G B",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T18:59:08.000Z",
          "Titre": "Good support and training",
          "Contenu": "The order process for on1 RAW 24 and On1 Plus is well organized. Support is adequate and responsive.Lot’s of support info, very good training video’s for as well this product and photography in general.Translation in Dutch is in many cases very poor, so I prefer the english version, as that makes more sense then some translations in my local language that are only confusing in stead of helping."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "G Cornwall",
          "Nb_Reviews": 22,
          "Date": "2023-11-10T02:20:41.000Z",
          "Titre": "Amazing S",
          "Contenu": "Pre ordered Photo Raw 2024 stand alone and had a bit of a wait but that was not a problem as I wanted top notch software and I was not disappointed,  Photo Raw 2024 is a massive speed boost and workflow dream.Download was quick install was great and I couldn't be any more pleased with my shopping experience with On1."
        },
        {
          "Note": 5,
          "Lieu": "EE",
          "Pseudo": "Harri Rinne",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T18:16:31.000Z",
          "Titre": "Fast and accurate.",
          "Contenu": "Not only is noise reduced to almost zero, but it is done very, very fast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tony M",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T22:49:51.000Z",
          "Titre": "Very Patient and accurate",
          "Contenu": "Support crew were very patient, delivered spot-on responses to my issue of not being able to get the 2024 version certified and tracing down my order in the wrong typo email address.  This during a time of heavy load during the new version issuance was impressive.  Thanks again guys"
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Dirk",
          "Nb_Reviews": 9,
          "Date": "2023-11-25T14:08:38.000Z",
          "Titre": "When launching ON1 RAW 2024 there was…",
          "Contenu": "When launching ON1 RAW 2024 there was an issue when I tried to activate the package. Issue was solved within one day, awesome service, thank you ON1 team👍👍"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kamissa Barry",
          "Nb_Reviews": 6,
          "Date": "2023-12-01T05:58:55.000Z",
          "Titre": "Fabulous plugins!",
          "Contenu": "I love how fast the apps load by themselves or as plugins loaded with excellent tools and options!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Duncan",
          "Nb_Reviews": 6,
          "Date": "2023-11-28T10:24:06.000Z",
          "Titre": "Prompt and excellent assistance over a holiday weekend.",
          "Contenu": "I have been a customer of ON1 for more than ten years and their customer assistance has always been excellent, certainly the best in their market and in my experience among the top five in any market. Customer assistance is the back bone of any company, the unsung heroes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donna",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T00:08:57.000Z",
          "Titre": "Great communication",
          "Contenu": "Great communication. Quick response to problem I had. I like the new controls added to 2024. Just need to learn when all the controls are now!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "neil devers",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T07:24:17.000Z",
          "Titre": "You can do a lot more than I thought",
          "Contenu": "You can do a lot more than I thought. I am glad I purchased it. A few more training videos would be good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TERUO OTSUKA",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T23:06:56.000Z",
          "Titre": "It is easy to use for my daily work.",
          "Contenu": "It is easy to use for my daily work.The finished product is also much better than I expected.I'm enjoying using ON1.Thank you,"
        },
        {
          "Note": 5,
          "Lieu": "HU",
          "Pseudo": "Bela Magyar - Citygraph",
          "Nb_Reviews": 3,
          "Date": "2023-11-10T21:37:00.000Z",
          "Titre": "High quality",
          "Contenu": "High quality. I have compared it to Photoshop's resize (enlarged with hundreds of percentages in more steps), and ON1 gives better quality. It gives better results than Rebelle 6's nano pixel resize."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gordon Cato",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T19:39:13.000Z",
          "Titre": "Easy and hassle free to order",
          "Contenu": "Easy and hassle free to order. I originally signed up for a subscription but then wanted to buy the software instead."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Graham Dunn",
          "Nb_Reviews": 13,
          "Date": "2023-11-25T10:44:58.000Z",
          "Titre": "ON1 No Noise AI",
          "Contenu": "ON1 No Noise AIRescued some images taken recently in error with ISO 6400. Simple excellent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cindy",
          "Nb_Reviews": 3,
          "Date": "2023-12-04T17:51:27.000Z",
          "Titre": "Great software",
          "Contenu": "Great software with lots of features to enhance my photography and a great value"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Hans-Guenter Loeh",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T10:33:33.000Z",
          "Titre": "Experience with ON1 Sky Swap Al 2023",
          "Contenu": "I have tested Sky Swap Al as a standalone app and as a plug-in for Lightroom 5. The replacement of skies with Sky Swap Al is very quick and gives good results.The skies included with the app are very nice, but in same cases to dramatic. To keep a personal style is it better, to use then own sky replacements.German users can find video tutorials in german language, also the german edition of ON1 Photo RAW 2022 is a help. Unfortunately there is no german issue of the ON1 Sky Swap Al 2023 User Guide. This Guide-book contents many informations about the program."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Rejean Tremblay",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T03:12:14.000Z",
          "Titre": "ON1 Everything Subscription…",
          "Contenu": "I had an ON1 Everything Subscription 200 GB per year. My mistake was upgrading to ON1 Photo RAW MAX 2024. I contacted customer service for a refund. Less than 1 day later, the refund was made. We took the time to clearly explain the difference between upgrade and subscription. This is the 2nd time I have dealt with customer service. Always fast and courteous service."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Robert Ryan",
          "Nb_Reviews": 1,
          "Date": "2023-09-17T00:25:19.000Z",
          "Titre": "Love It",
          "Contenu": "I have had ON1 for some years the learning videos are critical to the experience helping you to get the most out of the product. Recent developments into AI, No Noise and Sharpening help you obtain the best from your photo. Resize I believe could do with further development. The requirement to save it separately adds an unnecessary step to the workflow. Also resize recently has begun turning the DNG file into JPEG. I am looking forward to ON1 RAW 2024. Please don’t go to monthly charging. I enjoy the concept of ownership of the version you sign up for. The continuous development throughout the year and major update annually provides incentive enough to renew each year."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Betty",
          "Nb_Reviews": 8,
          "Date": "2023-08-20T20:09:43.000Z",
          "Titre": "Good tutorials & Conference playback on Kelby",
          "Contenu": "As a new ON1 subscriber, I like the helpful email/tutorials very much. On another issue....I don't know if this is yours or Kelby's issue, but on the ON1 Photographers Conference playbacks from your presentations which I access on KelbyOne, the slider panels (etc) are very blurry. I have checked my internet speeds--not sure that is applicable, but my download is 56.88 & upload 20.01, and the blurriness is same on my iMac & my MacBook Pro. Should those speeds be sufficient if indeed that does influence? Any suggestions that either through you or Kelby this is being addressed?"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Paul Fielding",
          "Nb_Reviews": 14,
          "Date": "2023-11-06T21:41:45.000Z",
          "Titre": "It's in the details",
          "Contenu": "Pre-purchased RAW2024 and the weeks up until release I recived a lot of helpful vids and info prepairing me for the new software.Very helpful and great service. Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Theresa F.",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T17:22:43.000Z",
          "Titre": "Easy to upgrade to latest software and…",
          "Contenu": "Easy to upgrade to latest software and intro videos gave me a head start with little to re-learn or hunt for anything. Love the keywording software especially- makes it super fast to catch up on a few years of keywording image files. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Garry Bryant",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T04:20:09.000Z",
          "Titre": "Update of a fine product.",
          "Contenu": "First: What I love about ON1 is it is not destructive. Second: I have enjoyed the monthly loyalty rewards, many I won't use, but the gesture is nice and help me be creative. Third: Nice that ON1 still gives the option to own or subscribe to the software. Fourth: Constantly pushing to be better with upgrades. Haven't used 2024 yet, but am looking forward to the updates that will help me be a better photographer. Customer service is fine too."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "andy gray",
          "Nb_Reviews": 3,
          "Date": "2023-11-05T21:12:15.000Z",
          "Titre": "Photoraw 2024 you one stop shop to…",
          "Contenu": "Photoraw 2024 you one stop shop to improving your images. Can be used simple or as complex as you want to go. Loving thidls version"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Glenn Cameron  Dusty nickname",
          "Nb_Reviews": 2,
          "Date": "2023-09-12T09:07:06.000Z",
          "Titre": "To all who are interested in a great…",
          "Contenu": "To all who are interested in a great editing program, I regard ON1 photo Raw up there with the best if not the best! On1 is constantly upgrading the product to give you the best application possible, There are youtube videos that will help you understand and teach you all what is available in the app, The best part is that you are not forced to a subscription you can OWN IT and at a great price. Glenn"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Otto",
          "Nb_Reviews": 6,
          "Date": "2023-10-25T06:31:02.000Z",
          "Titre": "On1 Stands Behind Their Products",
          "Contenu": "Recently upgraded my subscription. Had a few questions so I contacted On1 Support. My questions were answered in an efficient and complete manner.Easy to contact, easy to work with!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ronny Light",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T05:34:43.000Z",
          "Titre": "Great customer service",
          "Contenu": "I bought On1 a few years ago but didn't currently have it installed and couldn't find my install software. I sent a message to On1, not expecting to hear from them until after Labor Day. On Labor Day, less than 24 hours after I sent my email, they responded and fixed my problem.Great appreciation for On1's quick response and for solving my problem...in less than 24 hours."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JOE ZAO, DDIV",
          "Nb_Reviews": 3,
          "Date": "2023-11-05T00:59:47.000Z",
          "Titre": "Pro Max 2024 is magnificent",
          "Contenu": "Pro Max 2024 is magnificent. The entire program is full of everything I could ask for. The convenience of final photographs with so advantages that usually take an infinite amount of time and then post editing with PhotoShop to add a few extra; layers to layers and the final touches of a genuine photograph are astounding. I will say that I have a unique photographic skill, one is simple snap shots as a child with a $6.00 Kodak Camera that I bought working at .25 an hour. (Lot of money in those days) and then moving to California to document my journey. While in California I had a total loss of identity because of family. An arms length transaction. In the meantime, I was partially professionally photographing Playboy Style Photography and then getting some nice photographs. As they say, a photographer is recognized for maybe 50 photographs if it goes to a gallery. (1/125 of a second is 250 photos right?) in my life, I have hundreds of photos some miserable and some very well composed. The clarity of a good lens and a nice camera offer total post-production. At 70 years of age, Photography is as good as the \"Wasteland\" by T. S. Eliot, and as they say \"A photograph is worth 1,000 words\". In contract space and a contract dollar, I leave the middle ages of a plague and enter the light of the western hemisphere. Something of the feelings of the great photographers and their helpers in the 1840s. Anyway, this program answers it all. Love wins it all. \"Beautiful Mind\" Russel Crowe + AI (Albert Einstein)"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Ewa Korczynski",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T23:05:40.000Z",
          "Titre": "Feedback on your Service",
          "Contenu": "Service was very good, however, I’m not a tech savvy person and have struggled a bit with the terminology you used but got there at the end. I’m using MAC and somehow your screen shots were different to mine and after downloading program finding that .dmg file was rather difficult but eventually I got there. Your responses were quick and I appreciate it very much."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "ChristineB",
          "Nb_Reviews": 12,
          "Date": "2023-10-14T04:23:19.000Z",
          "Titre": "An essential editing program",
          "Contenu": "I've always used Lightroom but love the flexibility that ON1 gives with it's ability to choose levels of adjustment.  Great training videos and resources too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve LeBlanc",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T17:04:18.000Z",
          "Titre": "Let's Hear it for ON1!",
          "Contenu": "The ON1 team definitely takes personal pride in their passion for developing a versatile, made-in-America photo editing software platform.  Innovation requires talent, vision, and dedication.  ON1 is on the mark for all three of these.  Just as our photos should stand out and be dynamic to tell our unique personal stories, ON1 stands out in its dedicated passion to make their software platform a great tool for visual storytellers.  Thanks ON1 team!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patrick",
          "Nb_Reviews": 2,
          "Date": "2023-08-29T21:40:26.000Z",
          "Titre": "Still using on1 software.…",
          "Contenu": "I have been using on1 software for quite a while now, long before on1 RAWI. I have used the effects and presets and love them. I currently bought the new version and used the resize feature, it worked beyond my expectations. I bought a subscription this time and I am looking forward to the new updates."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donna Easler",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T19:36:56.000Z",
          "Titre": "Professional Plugin Bundle 2023 Upgrade ROCKS!",
          "Contenu": "I upgraded to a new plugin package, mainly for the new AI denoise/sharpening feature, as I had not been entirely pleased with the other brands' products...the quality and realistic effect of the ON1 product just blew all other competitors out of the water! Plus, several other very useful plugins were included in the upgrade and the upgrade price was much better than the other purchase prices. ON1 was an all-round no-brainer!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T16:27:45.000Z",
          "Titre": "Shea did exactly what I needed quickly…",
          "Contenu": "Shea did exactly what I needed quickly and without any issues. I used the wrong email address for my upgrade purchse and Shea quickly found my current subscription account and transferred my purchase over to it. Simple problem fixed quickly. No hassles"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "andy",
          "Nb_Reviews": 9,
          "Date": "2023-09-08T10:20:35.000Z",
          "Titre": "easy purchase even though i was not in…",
          "Contenu": "easy purchase even though i was not in my home country at the time......managed to purchase in my native currency and dloaded said items, i really cant wait till the 2024 update is released.please On1 add the Sony A6700 to your supported cameras"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 3,
          "Date": "2023-09-15T18:31:34.000Z",
          "Titre": "In General",
          "Contenu": "In General, Everything is easy to understand.  A bit confusing in the area of signing up or renewing. I did end up signing up for 2 different programs and ended up cancelling one of them. Subscription and Yearly.I cancelled Subscription.Other than that, tutorials and previews are very informative and helpful."
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "Mark Loeffler",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T20:02:29.000Z",
          "Titre": "ON1 helps to reduce my working time",
          "Contenu": "My wife invests a lot of time in photo workshops and courses for Photoshop and Lightroom. I myself continue my education with the help of ON1's excellent video tutorials. The result is the same. I feel very comfortable with ON1's excellent videos and ON1 tutors. ON1 helps to reduce my working time."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Sergio Bonfrate",
          "Nb_Reviews": 4,
          "Date": "2023-08-15T14:25:32.000Z",
          "Titre": "My experience goes back ten years with PPS 8",
          "Contenu": "My experience goes back ten years with Perfect Photo Suite 8 which I loved until a fortnight ago. I had always neglected ON1 Photo RAW because its interface, different from that of PPS, seemed complicated to me. Now I'm using it and appreciating: GREAT!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob D",
          "Nb_Reviews": 8,
          "Date": "2023-09-26T19:42:05.000Z",
          "Titre": "On1's \"RESIZE\" saves the day!",
          "Contenu": "Was in a quandry - needed to upsize an image. The software I was using at that time wouldn't do the job. Taa Daa!!!My email that day included an offer for a free 14 day trail of On1's AI gem called \"RESIZE\". I took advantage of the offer and  \"RESIZE\" did the job. Problem solved. Now I'm the owner proud owner of this baby. Try it - it won't disappoint."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lloyd Rosen",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T01:35:52.000Z",
          "Titre": "On1 is very impressive...",
          "Contenu": "On1 was easy to install and seems to be doing pretty much everything I need it to do so far. I am aong to adobe user and am pretty impressed with the capabilities I have here. I especially like that my photo organization and manipulation is all under one roof."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Glen Davies",
          "Nb_Reviews": 2,
          "Date": "2023-08-07T09:15:09.000Z",
          "Titre": "Impressed with the Ai features",
          "Contenu": "set up on an imac was easy and straightforward and the Ai features work very well. Its a minor issue but very onerous on my older version of LR is the need to import  which leaves it onerous to manage movement of your library of photos to a new location as everything has to be done in LR which I didnt find is a very user friendly file manager."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Bill Vallins",
          "Nb_Reviews": 7,
          "Date": "2023-08-18T21:14:06.000Z",
          "Titre": "On1Raw - in a word - Fantastic!",
          "Contenu": "I wouldn't have thought there would be a better platform than Adobe PhotoshopOn1Raw surpasses Photoshop and is just getting better and betterThe number of features is just amazingKeep up the excellent work team"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Andreas S.",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T16:16:16.000Z",
          "Titre": "Very good overall impression.",
          "Contenu": "I have been editing my photos digitally with various popular programs for about 20 years and did not expect that testing a software could surprise me so positively. In addition, an inquiry after the purchase was answered by the support team very quickly, very friendly and purposeful. It remains a very good ON1 overall impression."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Bradley Munro",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T23:10:42.000Z",
          "Titre": "The responses are fast and fair",
          "Contenu": "The responses are fast and fair. The products works wonders and is well documented in videos and text."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andre Robert",
          "Nb_Reviews": 2,
          "Date": "2023-08-07T21:19:08.000Z",
          "Titre": "Loving On1",
          "Contenu": "No problems with this company. I have always enjoyed my relationship with On1. My computer is not able to run PhotoRaw, it will not open, says I need Vulcan something... Not sure what all that is about but I keep the latest on1 so that when I can afford a new put eristic be ready to go. Meanwhile I keep up with videos that teach me how to use the latest. Thanks again for your wonderful products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DAVID",
          "Nb_Reviews": 3,
          "Date": "2023-10-31T07:29:09.000Z",
          "Titre": "On1 is a great stand alone photo app…",
          "Contenu": "On1 is a great stand alone photo app and has great customer service. Their training videos are very useful and easy to follow"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Peter Valcarcel",
          "Nb_Reviews": 4,
          "Date": "2023-12-03T12:26:14.000Z",
          "Titre": "ON1 Thumbs up",
          "Contenu": "super dupa software navigation flows tools and add on fabulous"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Pascal Longlade",
          "Nb_Reviews": 8,
          "Date": "2023-11-03T14:08:10.000Z",
          "Titre": "Great app!",
          "Contenu": "Great app!I’m a long time user of ON1 suite of softwares, and have to admit this lat one is by far the best version I’ve ever used. It’s very intuitive and user friendly. Kudos to the developers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Danny G Smith",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T22:51:04.000Z",
          "Titre": "The customer service goes the extra…",
          "Contenu": "The customer service goes the extra mile to make it right.  My only regret is I didn't go max to begin with, I now keep adding on bit by bit, but I will get there.  Yes I would buy again and recommend to a friend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael  Cryer",
          "Nb_Reviews": 8,
          "Date": "2023-10-28T23:12:56.000Z",
          "Titre": "The software is very intuitive",
          "Contenu": "The software is very intuitive.  On1 communicates planned changes and offers details about how the new additions can be used."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julie H",
          "Nb_Reviews": 2,
          "Date": "2023-08-09T20:14:45.000Z",
          "Titre": "I learned so much",
          "Contenu": "I learned so much, and have been busily putting that new knowledge into my work.  Its a process. I just keep tying new things, the goal to making my photography better and making post-processing faster.  Thank you so much"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Naghma Sahar",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T10:07:58.000Z",
          "Titre": "Very smooth",
          "Contenu": "Very smooth , fast and improved experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "bruce curry",
          "Nb_Reviews": 2,
          "Date": "2023-10-11T01:10:11.000Z",
          "Titre": "On1 works",
          "Contenu": "The program works well with and in many cases excedes what other programs that I have do as well as working as a stand alone program."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patrick Brennan",
          "Nb_Reviews": 2,
          "Date": "2023-09-25T20:11:19.000Z",
          "Titre": "Always helpful and instructive",
          "Contenu": "I have been with ON1 since the very beginning, and I always appreciated all that they offer.  ON1 has made a big difference in the quality of my pictures, and I always look forward to their very helpful and instructive videos and support."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Kevin O'Neill",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T10:11:54.000Z",
          "Titre": "The ON1 experience",
          "Contenu": "I was in search of a software program that would support my camera raw files. After trying 3 other program trials I chose ON1. The more I experiment with ON1 the more I grew to appreciate this amazing program"
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Marek",
          "Nb_Reviews": 2,
          "Date": "2023-09-07T16:58:26.000Z",
          "Titre": "Very fast and professional service.",
          "Contenu": "Very fast and professional service. Since I purchased older version just prior to release the new one I was offered free update! Strongly reccomend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ralph  J Nicolay",
          "Nb_Reviews": 12,
          "Date": "2023-09-05T08:30:59.000Z",
          "Titre": "ON1 is a great tool for photography and…",
          "Contenu": "ON1 is a great tool for photography and electronic art. They consistently update their software to match the demands of todays users. I like the simplicity and design."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Nico Trap",
          "Nb_Reviews": 2,
          "Date": "2023-08-10T18:49:02.000Z",
          "Titre": "Software is great, aftermarket sales excellent",
          "Contenu": "Software is great, intuitive and functional, also for a serious nonprofessional photographer like me. I switched from the too expensive Adobe Lightroom to ON1, and I am very happy with the overall performance of ON1 Photo Raw 2023. In my enthousiasm I  also purchased ON1 Professional Plug-in Bundle. But it appeared that all of these plug-ins are already embedded in Photo Raw 2023! I contacted helpdesk and, to my surprise, I was refunded the same day! In summary, very good product and excellent aftermarket sales!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "richard meseroll",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T12:37:45.000Z",
          "Titre": "I had a billing issue and contacted…",
          "Contenu": "I had a billing issue and contacted customer service via ON1's website. I  expected it would take several days to hear back with any kind of an answer but, to my delight and satisfaction, the issue was addressed and resolved inside of 48 hours. And I reached out on a Saturday over the weekend. Now that's customer service ! I've been an ON1 user for nearly 10 years now, or just about since the company came to market here in the US, and have watched their amazing evolution of their product lines and love their program having now switched over to ON1 from my beloved Aperture v. 3 ( remember those guys ? ). To be honest I was reluctant ( fearful ? ) to let Aperture go as I used it for so long for my business but the latest iterations of 0N1 have made me forget Apples A3 quickly. If you are looking for a processing program to switch over to like I was, look no further. Not only is ON1 \"Everything\" simply amazing on every level I can now vouch for their customer service as being top notch and super responsive and for me that speaks volumes about the company and where they are taking it to theprofessional consumers like me. Thanks ON1 and bring on ON1 2024 \"Max\", can't hardly wait ! - Richard Meseroll -"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Armstrong",
          "Nb_Reviews": 2,
          "Date": "2023-11-06T06:51:45.000Z",
          "Titre": "I use Corel and this is a nice Addition…",
          "Contenu": "I use Corel and this is a nice Addition to the  editing program I already have - actually it is easier to use and very intuitive - I am still pushing buttons but I haven't found  one yet I wouldn't  push again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Allen Melser",
          "Nb_Reviews": 3,
          "Date": "2023-12-03T21:01:24.000Z",
          "Titre": "On1 Upgrade",
          "Contenu": "It was easy to download and upgrade. I have no complaints."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Doug D.",
          "Nb_Reviews": 2,
          "Date": "2023-08-12T15:26:36.000Z",
          "Titre": "ON1 Raw2023 is an excellent product…",
          "Contenu": "ON1 Raw2023 is an excellent product with powerful tools that matches or exceeds it's rivals at a superior price point."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristen Pierce",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T21:31:05.000Z",
          "Titre": "Glad I found you, ON1.",
          "Contenu": "I was looking at the sneak peek videos for the 2024 ON1 RAW. The site is easy to navigate and has so much in the way of tutorials and videos to educate. LOVE IT!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chuck",
          "Nb_Reviews": 9,
          "Date": "2023-10-16T07:06:47.000Z",
          "Titre": "On1 is definitely important!",
          "Contenu": "On1 is a required part of my photography workflow. I can't imagine creating my photos without it!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Tog",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T17:24:52.000Z",
          "Titre": "Prompt and efficient response from the…",
          "Contenu": "Prompt and efficient response from the ON1 support team. Sorted my self inflicted account problem out without fuss."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Perry Kirkpatrick",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T17:35:17.000Z",
          "Titre": "I had a connection issue related to…",
          "Contenu": "I had a connection issue related to signing in and a confusion over the proper email addresses. A representative from ON1 took initiative and solved my problem. Then everything was good."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Hans-Jürgen Schöning",
          "Nb_Reviews": 15,
          "Date": "2023-09-07T19:11:29.000Z",
          "Titre": "As usual straight forward to order",
          "Contenu": "As usual straight forward to order . Have not installed the SW yet .But the order process and instand confirmation is a treat."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Ben Abeln",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T17:43:36.000Z",
          "Titre": "Perfect program",
          "Contenu": "Perfect program, I use it multiple year's"
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Marcus",
          "Nb_Reviews": 15,
          "Date": "2023-11-04T22:24:37.000Z",
          "Titre": "Love the software and my photos have…",
          "Contenu": "Love the software and my photos have got a big lift. The support is fast and very helpful. I recommend ON1."
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Rita Verduyckt",
          "Nb_Reviews": 3,
          "Date": "2023-11-27T14:05:34.000Z",
          "Titre": "Extensive photo editing options.",
          "Contenu": "Extensive photo editing options.So many filters, possibility to mask, etc..."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Astrid Rosenloecher",
          "Nb_Reviews": 10,
          "Date": "2023-09-08T06:48:33.000Z",
          "Titre": "Fantastic products at realistic prices",
          "Contenu": "Fantastic products at realistic pricesThese apps fit so seamlessly into my existing workflow that I purchased the standalone version too!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Gerry Hierzer",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T21:55:25.000Z",
          "Titre": "Customer service",
          "Contenu": "I had some problems with a subscription. After sending an email to their customer service, the response was virtually immediate and the problem was resolved within two days. I could not be happier with the friendliness and efficiency of their customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Dietzler",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T18:39:43.000Z",
          "Titre": "Your agent explained the situation and…",
          "Contenu": "Your agent explained the situation and my need to renew annually and did so with courtesy."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Neil Jackman",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T07:25:33.000Z",
          "Titre": "Process was quite easy and fast"
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Pascal.",
          "Nb_Reviews": 7,
          "Date": "2023-08-29T18:48:05.000Z",
          "Titre": "Incredible software!",
          "Contenu": "Incredible software to update the resolution of my 'old' picture to get a new one for a 90*110cm print!Tx a lot!!!"
        },
        {
          "Note": 5,
          "Lieu": "DK",
          "Pseudo": "Martin Tvedt",
          "Nb_Reviews": 26,
          "Date": "2023-08-08T12:08:18.000Z",
          "Titre": "A great simple to use software at a…",
          "Contenu": "A great simple to use software at a fair price :-)(unlike all the expensive subscription software solutions out there.)"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Alejandro Gamez",
          "Nb_Reviews": 3,
          "Date": "2023-11-11T01:56:22.000Z",
          "Titre": "Try it",
          "Contenu": "It´s an exceptionally good app, I enjoy editing with it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janice Myers",
          "Nb_Reviews": 2,
          "Date": "2023-11-09T16:13:29.000Z",
          "Titre": "Very responsive and helpful when I had…",
          "Contenu": "Very responsive and helpful when I had trouble signing in."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "ARMANDO NOGUEIRA E SILVA",
          "Nb_Reviews": 8,
          "Date": "2023-09-21T20:14:56.000Z",
          "Titre": "The professional way in work !",
          "Contenu": "I love the fact we have all in one software in an interacting  professional way.That's all !!!"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Luis Gellon",
          "Nb_Reviews": 7,
          "Date": "2023-09-11T00:51:15.000Z",
          "Titre": "Great customer support.",
          "Contenu": "Great customer support.A strong alternative to lightroom, Modules can be used as an add-on too."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Fran",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T11:20:31.000Z",
          "Titre": "ON1 better than ever",
          "Contenu": "ON1 has known how to endure and overcome, now they have understood what was not right and have taken a good direction, like all the rest of the competitors they are not going to make it easy for them, but if we stick only to the processing of the photographs it hardly exists in the market a more complete and functional application than ON1, with added values continues to grow in the generation of resources (filters, processed, etc.), of course the purchase of the fully functional app without subscriptions, something that today gives a meaning of full trust to the end user, not being tied to the app by a subscription, I use the app and buy it because its work flow and its resources are useful enough and are at the forefront of current times. It can be improved and should be improved, but now they have turned in the right direction."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank Salvatini",
          "Nb_Reviews": 7,
          "Date": "2023-10-06T16:21:30.000Z",
          "Titre": "The upgrade to on1 2024 is great",
          "Contenu": "The upgrade to on1 2024 is great. your team created an interface that blows Photoshop away."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Martin Lennon",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T03:07:28.000Z",
          "Titre": "Customer service and value for money…",
          "Contenu": "Customer service and value for money are excellent."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "David Cusselle",
          "Nb_Reviews": 8,
          "Date": "2023-09-11T15:43:59.000Z",
          "Titre": "On1 is my image processor of choice",
          "Contenu": "On1 is my image processor of choice. Have always liked the On1 AI technology improvements."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jill Guest",
          "Nb_Reviews": 21,
          "Date": "2023-09-01T16:05:47.000Z",
          "Titre": "Very easy to sign up online …very good…",
          "Contenu": "Very easy to sign up online …very good website everything explained clearly. Very good customer service."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Linda HARRIS",
          "Nb_Reviews": 4,
          "Date": "2023-08-31T03:45:18.000Z",
          "Titre": "Learner loving how easy ON1 is to use.",
          "Contenu": "I am a beginner with ON1. It has been easy to learn, I mainly got it for the Resize, but I am going to have some fun with the rest of the program, once I figure it out. You have some easy to follow videos. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Karl-Gottfried Vock",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T11:24:02.000Z",
          "Titre": "Very easy to use",
          "Contenu": "I used for my first test old pictures  from the year 2010-2016.  The results where great. I thought i have taken the shots with new camera."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "marcelo rodrigues",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T03:12:15.000Z",
          "Titre": "Make a better experience improving  the user guide and tutorials!",
          "Contenu": "I think the software is a fair price, but the user guide and tutorials should be better explained."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Robert Martin",
          "Nb_Reviews": 1,
          "Date": "2023-08-27T14:07:20.000Z",
          "Titre": "Fast and secure delivery service for an…",
          "Contenu": "Fast and secure delivery service for an application that each year surprise me on the new stuff they add"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RL R",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T02:59:55.000Z",
          "Titre": "Super customer service from On1's Shea",
          "Contenu": "Response within 48 hours which included very courteous interaction and complete resolution of inquiry to my benefit. Shea responded quickly and understood my problem and was able to resolve it with one contact!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Astrid Rosenloecher",
          "Nb_Reviews": 10,
          "Date": "2023-09-08T06:46:17.000Z",
          "Titre": "Great products at amazing prices!",
          "Contenu": "Great products at amazing prices and a very prompt and knowledgeable pre- and post-sales service!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Andrew Scoggins",
          "Nb_Reviews": 20,
          "Date": "2023-11-02T08:28:29.000Z",
          "Titre": "Easy to use website meant for a…",
          "Contenu": "Easy to use website meant for a straightforward purchase."
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "Franz Bachinger",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T18:28:24.000Z",
          "Titre": "Great Service"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr Trevor Greenwood",
          "Nb_Reviews": 47,
          "Date": "2023-09-07T15:44:18.000Z",
          "Titre": "Great software easy to purchase after…",
          "Contenu": "Great software easy to purchase after reading all options. Subscription to services was immediate after purchase and was kept informed."
        },
        {
          "Note": 5,
          "Lieu": "DK",
          "Pseudo": "Ole Andersen",
          "Nb_Reviews": 22,
          "Date": "2023-10-03T19:46:49.000Z",
          "Titre": "Quick response",
          "Contenu": "Quick response, in the meantime I figured it out myself, error 40. and wrote they could close the thread. Quick and good response."
        }
      ]
    }
  ]
}