{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.twigby.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T04:17:38.000Z",
          "Titre": "Had phone stolen four days ago",
          "Contenu": "Had phone stolen four days ago, and have had \"chat\" with multiple associates in this time period.  Twigby said they sent Port Out Pin # to my email, however, two days later they repaired their email system and I received a # that did not work. Decided to go with Verizon, and have been waiting for Port Out Pin # that works properly.  Twigby has sent three different #'s now and Verizon says Twigby has to Remove the Delay Status.  Some one has to make this right and have some intelligence.  Obsurd business practices"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike D",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T22:12:06.000Z",
          "Titre": "Bad service and scummy business practices",
          "Contenu": "I live in a major metropolitan area with excellent cell reception and this is the only service I've ever had drop out for minutes at a time multiple times. In addition, they don't make it clear that autopay is the only payment option. If you sign up, you're signed up for good. You must contact support and go through a bunch of rigamarole to cancel. I threatened to charge back the payment since it wasn't made clear I was signing up for autopay and they threatened in return to charge me $30 for doing the chargeback. It's true that they have my payment information and could try it, but if they do, I will report them to the BBB and FTC. Companies should not be able to threaten their customers with random charges for doing chargebacks. On top of having scummy business practices, like I said, their service stinks. I'm outta here."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "mashmanim catering",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T19:20:52.000Z",
          "Titre": "they canceled my number for no reason",
          "Contenu": "they canceled my number for no reason.with only a one time notice.was not willing to help me get my number back to port it out to another provider.i would recommend that if you want to save your number make sure to take your number out today there are some more good companies with the same great prices and better service.i tried to chat but nobody helped me.i sent a few emails no repliesupdate for 10/31/2023 they helped me reactivate so i can port out but if i pay for unlimited really it should be unlimited but i can get my number out."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JON",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T20:29:58.000Z",
          "Titre": "I attempted to switch my service to…",
          "Contenu": "I attempted to switch my service to your firm and to this date, no one has contacted me with anything but a form email saying your firm needs help. Your firm MUST need help!PostScript this into my review: yes, you sent me automated emails 7 or 8 (I don't care if it's 100) times. What does it communicate to me when I can't receive a PHONE call from a company I'm supposed to be receiving PHONE services from? And as a prospective customer, I'm an afterthought!! What the heck will I be when I have committed to your company? You've got to be kidding."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "General_Ydna",
          "Nb_Reviews": 3,
          "Date": "2023-09-04T05:10:33.000Z",
          "Titre": "BUYER BEWARE",
          "Contenu": "Absolutely useless.  They kept bumping me to 2G speeds even though I had 20 gigs of data. I had to contact them 4 times in under 3 weeks to fix it and there are constant issues.  Finally went to them today and they told me they couldn't fix the problem because they were experiencing \"carrier issues\".  These people clearly don't give the data speed as advertised. Also note: there is no phone number to call, it's all s chat and you can't contact them over a holiday if you desperately need data.  Didn't care enough to fix the problem. Absolutely useless. I went to Red Pocket instead"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sunny Jim Rees",
          "Nb_Reviews": 3,
          "Date": "2023-07-28T16:32:31.000Z",
          "Titre": "Leaving Twigby Soon",
          "Contenu": "Twigby sold me a phone that doesn't even last they day.  When I told them the battery health was only 85% they said they could send me a new phone but couldn't guarantee it would be better.  I'll be switching from this company momentarily.Edit:  Their response is that their phones go through rigorous testing, so rigorous in fact that the phone won't even last the day.  That should tell you everything you need to know about their refurbished phones."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "nomadlander",
          "Nb_Reviews": 3,
          "Date": "2023-03-27T08:04:27.000Z",
          "Titre": "There is no active customer service plus poor incentives",
          "Contenu": "There is no active customer service, just written questions posed to no-name, no-faced CSRs. They hide in fine print that the rewards for someone else signing up excludes family members which is hugely counterproductive to building a customer base. All in all, Twigby is too raw and not very well thought out. I am already looking for another provider."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christopher Myers",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T17:24:31.000Z",
          "Titre": "The service was great until I hit the…",
          "Contenu": "The service was great until I hit the 20GB data limit.  The \"throttle\" on speed was more like an emergency brake.  None of my apps would work properly (on a Galaxy Note9, mind you, not a new phone), including a browser I wanted to use to chat with customer service!  The throttle needs to be less severe."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stephanie Fox",
          "Nb_Reviews": 2,
          "Date": "2023-05-24T16:53:31.000Z",
          "Titre": "I dealt with Twigbys sketch service for…",
          "Contenu": "I dealt with Twigbys sketch service for a year. Then,  fed up with growing bills and worsening service I switched service to Verizon who is supposed to somehow be affiliated. They're NOT! Do not be deceived by good reviews or their bogus come ons. As they explain,  they're an \"internet based\" company.  That means you never deal with a human. Only bots. And if you cancel their service they can still continue to dip into your payment source and take money.  Try making that stop.  The phone numbers provided are only for bots! They direct you to sign in online,  but you can't if you've canceled their service.  And their chat doesn't work because they don't recognize you as a customer.  BUYER BEWARE! DON'T USE TWIGBY!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Charles Schultz",
          "Nb_Reviews": 1,
          "Date": "2023-01-28T17:44:46.000Z",
          "Titre": "Chat with a Human",
          "Contenu": "You do not have any place on your site where a person can enter into a chat with a live person to ask questions,Your actual phone service is great, but if one cannot get answers to questions when needed, it matters not how good your service is."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "DCD",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T00:41:20.000Z",
          "Titre": "Lame customer service through chat…",
          "Contenu": "Lame customer service through chat only, and then when problem was not fixed, you switched communication to email only!  Took forever to get problem fixed, had to turn it over to Verizon because Twigby is clueless!  Unable to do any out-going calls for weeks!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ZK",
          "Nb_Reviews": 2,
          "Date": "2023-03-07T00:42:00.000Z",
          "Titre": "Frequent low or no signal in Chicago",
          "Contenu": "Frequent low or no signal in Chicago. Deceptive regarding \"unlimited\" plan as they split it across accounts and it is limited to 20gb (after which drops to 2g). Poor experience compared to other cheapo MVNOs."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "egcayucan",
          "Nb_Reviews": 6,
          "Date": "2023-02-04T05:12:08.000Z",
          "Titre": "WIFI CALLING UNAVAILABLE ON TWIGBY!!…",
          "Contenu": "When I signed up with Twigby I was NOT informed that the service did not support WiFi Calling.  I live in a neighborhood with very poor Verizon reception and I ABSOLUTELY require WiFi Calling on my mobile phone.  I was shocked to learn it was not available and I feel that the absence of this feature should be stated very clearly at the time of sign up for those who require it.  I have had to jump through many hoops to get back my prior service and I would not have this challenge if Twigby had been up front about it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gail Tonnesen",
          "Nb_Reviews": 1,
          "Date": "2022-12-26T21:53:03.000Z",
          "Titre": "I'm not able to call certain phone…",
          "Contenu": "I'm not able to call certain phone numbers, including my office. Opened a ticket to investigate but no response yet.  Also, lack of wifi options is a major limitation in my area with poor cell coverage."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gunasekaran Umapathy",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T20:41:36.000Z",
          "Titre": "Poor reception in reno and international calling to free countries listed not working",
          "Contenu": "poor reception in reno, nv. calls getting disconnected. international calling to india says free but i am unable to connect. overall, google fi and mint was way better than twigby (verizon)."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "D L",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T18:37:57.000Z",
          "Titre": "Poor coverage, dishonest customer service",
          "Contenu": "I contacted this company after they responded to my review. Their response was all show. They did absolutely nothing to remedy the situation. See review below.The phone I purchased from this company was advertised as unlocked. I was with Twigby for three months and left due to spotty coverage in the urban area I live in. I tried to activate this phone with Tmobile and was told it was locked to Sprint SIMS only. I now have a worthless phone that I only used for three months. I have filed complaints with the better business bureau and the FCC, but have never received a reply from Twigby. They could care less about their customers."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lasha Ross",
          "Nb_Reviews": 5,
          "Date": "2023-03-28T17:15:42.000Z",
          "Titre": "Poor service",
          "Contenu": "I ordered SIM cards without setting up an account (cause I have NO PHONE # yet) and I have not yet received my SIM cards.  So I tried to connect with the chat help and they can't assist me because I don't have some 4 digit code.  I don't have a code because I haven't activated account because I need SIM Cards to do so.  So I went to another service that was willing to help me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steven Kirby",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T17:15:41.000Z",
          "Titre": "Paid money to you",
          "Contenu": "Paid money to you. NEVER GOT PRODUCT TO WORK. NEVER!!Did installation three times.NEVER WORKED. COULD NEVER GET ANY CUSTOMER SERVICE.Request FULL REFUND.818-665-6153"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kate Nichols",
          "Nb_Reviews": 2,
          "Date": "2022-12-30T02:53:07.000Z",
          "Titre": "No number so no phone plan usage.",
          "Contenu": "I have yet to use it the plan.  Waiting on a porting of my landline phone number.  I have not received any correspondence on the matter or offered a new phone number.  Guess they are just collecting money for nothing.  I am not presently living in my house where the landline is, so I have zero phone access."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Diane Brecher",
          "Nb_Reviews": 1,
          "Date": "2022-12-11T01:13:36.000Z",
          "Titre": "We got Twigby because it used Verizon…",
          "Contenu": "We got Twigby because it used Verizon towers. As we discovered it doesn't use all Verizon towers and we had no service in our home. When we tried to use wifi calling, we were told that Twigby was not setup for that yet. After about 15 minutes with Twigby we decided to return to our old carrier. When we tried to pinout, we ran into a lot of trouble. First the people in the department we needed were not there after 6 Eastern Standard Time, then they weren't there on weekends.  Then they didn't have the name correct. It ended up taking four days to switch back and we didn't have cell service during that time. You get what you pay for with Twigby."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Taylor",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T04:09:15.000Z",
          "Titre": "I live in the heart of the city and had…",
          "Contenu": "I live in the heart of the city and had nothing but connection issues from day one. They did their troubleshoot and it didn't help. They offered again but I have no faith or trust in them. The fees on their promo were ridiculous. It felt more like robbery than a deal. Lastly, what an idiotic name. I had to check my email each time to remember what brand of company I was using."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michelle Carnal",
          "Nb_Reviews": 1,
          "Date": "2023-03-25T17:06:05.000Z",
          "Titre": "I kept getting the run around for…",
          "Contenu": "I kept getting the run around for weeks.  Constantly told to chat back. It took 21 days to get my issue fixed and I ended up finding it out not the support.  I found out on Twigbys page the data had been turned off.  If I hadnt found that out then I was being instructed to contact again in another 3 days."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paul B.",
          "Nb_Reviews": 3,
          "Date": "2023-07-24T21:48:26.000Z",
          "Titre": "Not the greatest business practices...",
          "Contenu": "Re, Response: I reviewed the time that the order was placed and found it was within 10-15 minutes of the designated timeframe. To, again, offer expedited shipping and to NOT ship on Saturdays and Sundays is utterly ridiculous and highly uncompetitive. This EXACTLY why outsourced business are winning in this country. Shameful. I paid for expedited SIM shipping. They not only waited until Monday to ship it, but they never refunded that amount both after delaying SIM shipping and did not refund that amount after I left. 3 stars removed for that. It ended up taking a week for an expedited SIM shipment to be received, and that is entirely unacceptable. I only have to wait 1-3 days with anyone else. They use VZW, which is a very problematic network in most of the country. They cover my area well but their data network is atrocious, so I couldn't stay. Also, when I signed up, it turns out my area code was out of numbers!! I couldn't find this out until I talked to a rep, and while they were able find and figure this out, I do not understand how getting a number is this difficult, and why it did not show any sort of error on my account (in my case, the process was just halted after activating the SIM and I had no idea what I was waiting for). If I did not contact support right away, I would've been waiting for nothing and not have known why."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jerry Venable",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T23:53:08.000Z",
          "Titre": "Although we checked the coverage maps…",
          "Contenu": "Although we checked the coverage maps we are unable to talk on the phone to anyone.  We need to cancel the service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jimmy",
          "Nb_Reviews": 1,
          "Date": "2023-06-10T21:29:38.000Z",
          "Titre": "Charged $29.54 without providing service",
          "Contenu": "They charged $29.54 for a service that I never used, and when I caught the charges on my credit card, they said \"sorry, you're outside of the 30-day refund period.\"  30-days for what?!  I never even activated the service!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kevin Mccarthy",
          "Nb_Reviews": 1,
          "Date": "2023-06-11T14:27:04.000Z",
          "Titre": "They wouldn't port me out . Cheats",
          "Contenu": "They wouldn't port me out so they could change me for another month. Got the port out code and contacted them repeatedly. Wouldn't port to my new carrier. Stay away from them"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gary L Cabot",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T19:34:43.000Z",
          "Titre": "It turns out after an hour plus on the…",
          "Contenu": "It turns out after an hour plus on the phone with one of your reps we found my phone was not compatible. your screening process for BYOP needs some work. Not a happy customer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David spitzer",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T20:00:56.000Z",
          "Titre": "I tried to refer 2 people and they were…",
          "Contenu": "I tried to refer 2 people and they were both declined.one they tried giving me a reason the other one they didn't even give me a reason."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "marcel taflinger",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T22:36:08.000Z",
          "Titre": "I recieved the phone but when I tried…",
          "Contenu": "I recieved the phone but when I tried to sign in my password was rejected as well as the new one one I applyed for . A request for help I sent weeks ago has yet to be answered."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steven",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T21:57:31.000Z",
          "Titre": "Happy until I needed support",
          "Contenu": "TLDR; you can be on the same network, spend about the same amount, get more data, and receive much better customer service from Visible. If you want to be on the Verizon network, Visible is better than Twigby.Twigby had a great deal: $10/month for a 2 GB plan. That promo lasted 6 months, then it turns to $20/mo. I signed up. Within a month, the same priced plan turned into a 3 GB plan, but my plan was still 2 GB. I messaged to see if I could get mine changed. The answer was No, not unless I wanted to give up my $10 promo. I was bummed, but whatever. I still felt like I was getting a good deal.A few months later, I notice Visible has a promo for unlimited data at $15/month (normally $30/mo at that time, but now $25/mo) for 12 months. Twigby is also on the Verizon network. I told Twigby. They said that they couldn't match the deal. I decided to switch to Visible.At this point, I still had a good impression of Twigby. They weren't amazing, but they were cheap. I'll deal with a fair amount of bologna to save money.I tried to cancel my service. They delayed canceling my service until after they charged me for a full month. Legit, we are talking minutes later.I brought it to their attention. They refused to reverse the charge even though I didn't use their service at all that month. I had to file a dispute with my credit card.I couldn't be happier with Visible. I pay $25/month flat (that includes all taxes and stuff). My $20/month plan with Twigby came out to almost $23/month after taxes. For an extra $2 each month, I get unlimited data instead of 2 GB.I haven't tried to cancel with Visible yet. They might pull shady stuff like Twigby, but I doubt it. When I left the country for Japan, I asked them about suspending my service. Visible was like, \"Just don't pay your bill.\" I followed their advice. When I landed in the US, I paid my bill. My service restarted and my new billing date was a month after that. It was really easy.In short, you can be on the same network, spend about the same amount, get more data, and receive much better customer service from Visible. If you want to be on the Verizon network, Visible is the way to go.I hope this review helps. I don't hate Twigby. They just annoyed me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Matt Phillips",
          "Nb_Reviews": 1,
          "Date": "2022-11-17T19:31:12.000Z",
          "Titre": "Chat bots that lie and tell you they…",
          "Contenu": "Chat bots that lie and tell you they are a real person to start.  Then said bots trying to convince you that you are wrong with a download from the internet that was absolutely false.  Regarding esim.  My Motorola razr uses esim.  There is no external sim but had to argue with chat bot.  Finally got help and refunded."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lee Lindley",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T05:47:31.000Z",
          "Titre": "Reliance on USPS is a deal breaker.",
          "Contenu": "Reliance on USPS is a deal breaker.Refusal to refund on a non-delivered phone because your supplier, the USPS, has not returned it to you yet is NOT MY PROBLEM! [[The response from Twigby is factually correct with two exceptions. 1) I did not agree to send my 84yo mother to the post office to deal with the issue, nor did Twigby offer a telephone number. USPS tracking shows that USPS returned the package. The fact that the supplier hired by twigby, USPS, did not perform as the company expected is not my problem.2) USPS is the primary shipper for Twigby AND it is the only option. Expedited USPS is your only choice if you run into a problem, and that resulted in 6 business days or more delivery time in my case, twice, to a good address. That service is supposed to be 3 to 5 business days. Good luck with that.]]Subsequent delivery of non-functional sim, followed by still undelivered replacement (USPS again) is another example of why relying on USPS will kill your company.Customer service has been given a script that they stick to. Unfailingly polite, but offering no way to escalate other than cancel the contract. That's what we did. [[Both sides of this explanation, mine and Twigby customer service, mostly align. My conclusion is that Twigby's reliance on USPS may introduce delays to your experience, and if there are technical issues, can result in extended delays and possibly outage of your service once you do a number transfer. This made the service unacceptable in my case and I am fully responsible for the mistake in selecting the service. The company offers the service they advertised with the exception of handling of a non-deliverable package by their selected supplier. My conclusion is that this level of service involves risks that I failed to appreciate and that others may find themselves in a similar situation if they choose Twigby. ]]"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Martin Silva",
          "Nb_Reviews": 7,
          "Date": "2023-03-28T17:30:41.000Z",
          "Titre": "I canceled at the first of the year Jan…23",
          "Contenu": "I canceled at the first of the year Jan 23. It is Mar n they are still billing me. I no I closed the account of mine n my husband's.  They first said last month I needed to pay a month for when I first got Twigby. Now they r saying I never canceled. Going to cut my debit card n get a new one. Sick of dealing with them!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Adam Steele",
          "Nb_Reviews": 1,
          "Date": "2023-02-19T23:22:25.000Z",
          "Titre": "Hard to leave and rude customer service",
          "Contenu": "The service while I was with them was fine. Not great, just fine. Everything is virtual, so getting a human if there is an issue is nearly impossible. Also, the cost of went up significantly over time because of fees and upgrades that were added to the account without my knowledge. That said, it was still a little bit cheaper (at the time) than other services.Porting into the Twigby was fine, but porting out has been a nightmare. It requires a person to port your number out to another carrier, which is fine, but those people don't work weekends. It can also take up to 4 days to get it done, I am told, though it says nothing to that effect anywhere on the site. Customer service just kept repeating that they recommend 4 days, like it was all my fault that this was happening to me. Then I asked if they could at least pro-rate my final month of service since I would only be on for 1 day of the new billing cycle while the porting was taking place and they said no. I was going to be billed for an entire month and there was nothing I could do, even though I started the process 3 days before the end of the cycle. The customer service rep I had was rude and unhelpful. I am glad I am leaving this company. Good riddance. My new plan is about half of the cost of Twigby and without all the hassles (at least so far). Save yourself a future headache and go with someone else."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "VESELY/CHARLES HENRY",
          "Nb_Reviews": 2,
          "Date": "2023-06-12T00:25:57.000Z",
          "Titre": "Twigby service reps online chat & defective BLU phone",
          "Contenu": "Just purchased a BLU smartphone with Twigby, 6-11-23.  When I try to do the set up settings, the phone would not let me reboot to recovery settings & the keypad would not show on the screen.  The manual that comes with the phone is VERY INCOMPLETE!  Was on the chat online with several reps WHO STATED THEY R TECH SUPPORT.  None of them could resolve the issues I was having.  After wasting several hours, I ask for another phone since this one has issues, defects, problems.  Jon response was, WE CAN EXCHANGE IT,BUT U WILL BE CHARGED A $15 EXCHANGE FEE!  I informed Jon the following,  I WILL NOT PAY ANY FEES BECAUSE OF POOR PHONE SERVICE, TIME LOST, PHONE ISSUES, PHONE NOT WORKING LIKE ITS SUPPOSE TOO.  I ALSO STATED U WILL BE HEARING FROM MY BANK, FCC & THE ATTORNEY GEN ON THIS MATTER.  I should have received a manual that was complete/should not have to go to website for another incomplete manual , should have received a phone with no issues, like keypad not showing up or phone will not reboot.  Then they wonder why people get upset/mad & write negative comments!                               After writing this review, I have this happen.                     I received this email for $10 off next phone purchase.  Had problems today with your new BLU View 3 phone, with the following; won't reboot, keypad does not show up on screen.   WASTED SEVERAL HRS WITH THE FOLLOWING REPS; Annie, Jon, Harry, & Jon the manager.  NOTHING GOT RESOLVED.  Had problems on your web site to order another BLU View 3 phone since the one Twigby sent me is defective!   I also went to your web site for a more complete manual.  Since the manual with the phone I received IS INCOMPLETE, JUST AS THE WEB SITE MANUAL IS!I've also told your reps I am NOT PAYING FOR ANY FEES, EXCHANGE FEES ETC.  I ALSO REQUESTED MY $10 CODE BE APPLIED TO EITHER MY CREDIT CARD OR MY ACCOUNT, SINCE YOUR REPS WOULD NOT APPLY IT TO MY PURCHASE OF A NEW BLU VIEW 3 PHONE.  ALL I GET FROM YOUR REPS IS EXCUSES & NO RESULTS!I also inform your reps, I will be filing a complaint with the FCC, Attorney General & my bank if I'm charged with any exchanged fees & do not received the $10 off like this email states!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Adam Vaughn",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T19:24:05.000Z",
          "Titre": "Service didn’t work in my area which…",
          "Contenu": "Service didn’t work in my area which you said it would.Never received any refund for no service .😡"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "aMan",
          "Nb_Reviews": 2,
          "Date": "2023-06-20T22:31:15.000Z",
          "Titre": "The thru me off for (non)excessive use",
          "Contenu": "The thru me off for excessive use. I am using this as a home phone, I did not use any data at all and not sure why they are doing it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Isaac D.",
          "Nb_Reviews": 1,
          "Date": "2023-03-08T18:30:22.000Z",
          "Titre": "First of all I hate the fact that you…",
          "Contenu": "First of all I hate the fact that you don't have phone customer service, sometimes we understand each other better via phone (if I would have known before porting I don't know if I would have ported to you).Second of all, I have a issue that the voice mail notification envelope, does not show up on my phone when I have a voice mail, it's definitely a service provider issue, and after spending a lot of time on chat, for 2 days in a row, it still isn't fixed, it seems the reps just don't know how to fix the issue."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Fred Hendra",
          "Nb_Reviews": 1,
          "Date": "2023-02-13T19:34:41.000Z",
          "Titre": "Hate the chats",
          "Contenu": "Hate the chats.  Spent hours doing it and got no where.  One phone call would have cleared it up.  I can't imagine how long it would take to reestablish service if it went out."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "______",
          "Nb_Reviews": 2,
          "Date": "2022-11-03T03:30:55.000Z",
          "Titre": "\"Full refund within 30 days\"  A TOTAL LIE",
          "Contenu": "Bought F4L and immediately disliked it. Traded it back for a full refund and bought the blu view.  They refunded half the cost, and charged me $15 for a charger I know I sent back. They don't delineate any of your purchases or plans or parts or anything. So, you never know what cost what. That's a very easy way to cheat someone, and they did.  They don't care, and blame a supervisor."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Your name",
          "Nb_Reviews": 5,
          "Date": "2022-11-03T03:10:10.000Z",
          "Titre": "Another \"We're here to help you\"  LIE.!",
          "Contenu": "Said I didn't send back a charger.  I say I did.  Either way, $15 should not have been deducted for a piece of plastic everybody has dozens of.  Never got to the other charges, but when they say \"Full Refund\"  they are lying.  And, when you try to talk about it, nobody cares, because somebody else did the deed.  The mysterious supervisor who can't even explain his actions."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark Desmarais",
          "Nb_Reviews": 4,
          "Date": "2023-06-12T17:52:19.000Z",
          "Titre": "Never Heard from anyone regarding my…",
          "Contenu": "Never Heard from anyone regarding my activation, After I paid and received a Sim card."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steven Oswalt",
          "Nb_Reviews": 1,
          "Date": "2022-10-18T03:59:56.000Z",
          "Titre": "Requiring credit number to use PayPal",
          "Contenu": "You required me to use my credit card before you would allow me to use my PayPal for the first time. That seems to eliminate the safety of using PayPal doesn’t it? I would like someone from management to call or email me about my concern. The more I think about this TWIGBY IMPOSED breach of my security the more upset I get. If I had it to do all over again, I would have not chosen Twigby. Not using my credit card is the reason why I have a PayPal account in the first place.Steven Oswalt"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Myra Nicholas",
          "Nb_Reviews": 2,
          "Date": "2023-02-04T15:43:45.000Z",
          "Titre": "Have been unable to boot up phone from…",
          "Contenu": "Have been unable to boot up phone from twigby to activate it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Porter",
          "Nb_Reviews": 1,
          "Date": "2022-10-07T19:05:40.000Z",
          "Titre": "Don't trust their service map",
          "Contenu": "I was told I would have service where I live. I double check with an online agent. Got the phone and as I'd suspected it did not work. Was told sometimes it takes up to 24 hours for phones to connect to service. Followed all directions and it still didn't work. Had to pay $15 shipping to return it and was not refunded 100% of the purchase."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Josh L",
          "Nb_Reviews": 1,
          "Date": "2022-11-09T06:54:49.000Z",
          "Titre": "They don’t tell you beforehand that you…",
          "Contenu": "They don’t tell you beforehand that you need to return SIM cards to receive refund. Poor quality service and Customer service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joseph Jurado",
          "Nb_Reviews": 1,
          "Date": "2022-12-17T22:01:25.000Z",
          "Titre": "Didn't get 1st 3 months free.",
          "Contenu": "When I signed up, I read that I would get 3 months for free. After only one month I'm already being charged."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MIchael P",
          "Nb_Reviews": 1,
          "Date": "2022-09-14T22:04:12.000Z",
          "Titre": "I inquired about service for a certain…",
          "Contenu": "I inquired about service for a certain area, was told that it would work, paid for the Sim and when it arrived discovered it did not work in the area. I tried to process the \"30 day refund\" and they told me have to send original sim back at my expense to get a refund. a lot of empty promises."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rod Villa",
          "Nb_Reviews": 1,
          "Date": "2022-09-06T19:20:27.000Z",
          "Titre": "So far, very dissatisfied.",
          "Contenu": "You send the sim card with no instructions on what to do next.You never told me the number hadn't been ported.If I had known you have NO customer service phone number I would not have used you. I may still end it.Trying to find your Chat on the website is near impossible. Tried your app. Can't get past the create an account. Should have just paid more and stayed with verizon.Oh, Tracfone and Target suck too.Had this phone for 3 months with NO service thanks to them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marybeth Wohlers",
          "Nb_Reviews": 2,
          "Date": "2022-09-06T22:48:51.000Z",
          "Titre": "BE WARNED!",
          "Contenu": "BE WARNED!! Dangerous and irresponsible business practices. ! On Labor Day, I was notified by email at 7:00 am that my auto payment didn’t go through, and at 8:00 am I was emailed that my service was suspended.  When I checked my email at 9:00 am,  I changed the card info immediately, and the payment went through. My service was not restored  because no one was working because it was a holiday!! So, my phone service remained off for 24 hours!!! Terrible. And frightening.  I’ve already switched providers."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "d. young",
          "Nb_Reviews": 4,
          "Date": "2022-09-01T19:33:57.000Z",
          "Titre": "Love the idea of being able to create…",
          "Contenu": "Love the idea of being able to create your own plan. I unfortunately was not able to get the mobile data to work. Many chats with very nice representatives and even IT involvement did not resolve the issue.   I changed to US Mobile (also a Verizon network) and the mobile data was immediately available. No problem at all. I did see other reviews that indicated the same lack of data availability on Twigby.  If I knew the data issue was resolved, I would consider using Twigby in the future."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "PAUL BIANCHI",
          "Nb_Reviews": 1,
          "Date": "2022-08-24T00:27:14.000Z",
          "Titre": "I tried to transfer my number and Cant",
          "Contenu": "I tried to transfer my number, followed the process on your website and ordered a SIM card, and paid a month of service.Also, I tried your chat and it seems like my phone number is unavailable to transfer According to the person I spoke to....and Now I dont know what to do to get service. I could not find a customer service number and I need to speak to someone.How do I get a new number if my number cannot be transfered??"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 3,
          "Date": "2022-08-24T15:52:59.000Z",
          "Titre": "I want my money back",
          "Contenu": "I want my money back.  The phone was supposed to port over in 3 business days (normally 3 hours).  No port over occurred.  Retried the port again, three days later no port over for the second time.  You can't call customer service to resolve issues. Only chat, which is clunky and doesn't resolve problems like this one."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "R T",
          "Nb_Reviews": 1,
          "Date": "2022-08-11T23:10:00.000Z",
          "Titre": "Timely and Twigby: two words you'll never use in the same sentence",
          "Contenu": "This review is for a request I just received to review a purchase made over a year ago:Asking a customer to review a 'recent' purchase that actually took place a year ago is:1 - An annoyance2 - An excellent way to make your customer think their account has been hacked3 - A great way to lose a customer4 - All of the aboveThe correct answer is 4."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Mead",
          "Nb_Reviews": 2,
          "Date": "2022-08-12T00:38:51.000Z",
          "Titre": "Steadily increasing fees a BIG disappointment",
          "Contenu": "Called about my steadily increasing monthly bill - thanks to a slow steady incremental increase in fees occurring about every other month. They said - with no trace of disappointment - that I of course was not bound by a contract and could switch to another provider. My reply to them was \"thanks for nothing\" and I ended the chat."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Melissa",
          "Nb_Reviews": 1,
          "Date": "2022-10-03T19:54:14.000Z",
          "Titre": "Customer Service is nonexistent",
          "Contenu": "I cannot rate customer service since there is no customer service. There is only a bot. There is no live phone or chat support, so if I could give it no stars, that's what it would be."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cor Graham",
          "Nb_Reviews": 1,
          "Date": "2023-04-15T21:39:12.000Z",
          "Titre": "Very sorry company with promo and price…",
          "Contenu": "Very sorry company with promo and price related"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Shannon",
          "Nb_Reviews": 1,
          "Date": "2022-08-02T21:04:47.000Z",
          "Titre": "Horrid",
          "Contenu": "Horrid. My phone, on my home WiFi network, with mobile data turned OFF, somehow chewed through half a gig of data within minutes. It didn't stop, until I chose a much higher priced plan, with no changes made to my phone. SHADY. I am getting away from Twigby ASAP. Let's see if they honor their 30 day money back guarantee. Also, it seems like the default is set to blocking your number. Tried to call my vet, and got a we don't take calls from blocked numbers message. BEWARE!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Luis Contreras",
          "Nb_Reviews": 1,
          "Date": "2022-08-22T05:38:37.000Z",
          "Titre": "I haven't able to activate the service",
          "Contenu": "I haven't able to activate the service, so I am stuck with SIM card cost and no service, I sent 2 emails no answer, please refund the cost of the simcard , I will send it back if needed, thanks, if the mobil service is like customer care then we are in trouble."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "cayenne woods",
          "Nb_Reviews": 14,
          "Date": "2022-07-24T23:12:19.000Z",
          "Titre": "This is a mess",
          "Contenu": "This is a mess. Trying to use it to get out of xfinity, just a bigger mess.Have filled out the entire process 5-6 times now, no luck.No validation, something wrong with the number I'm trying to port but no idea what - keeps letting me get to the end, then saying there's an issue but not what it ischat is hellish - they keep telling me off for 'refusing to cooperate' even tho they are not answering my questions and keep breaking things worse"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Smally Waters",
          "Nb_Reviews": 1,
          "Date": "2022-08-08T12:41:00.000Z",
          "Titre": "Avoid this Service",
          "Contenu": "Nothing worked correctly. I attempted to transfer my number. I provided all the information in my initial application. When I finally received the sim card (with NO ejector tool, even though one was promised), I had to go through the SAME process to transfer my number AGAIN. It didn't work. Even if it had, I would have had to wait another three days for my service to start. Given the glitches, I canceled immediately. I am now involved in the process of obtaining a refund. Avoid this company! There has to be a more competent service available."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rajarajan Chellamuthu",
          "Nb_Reviews": 1,
          "Date": "2022-07-21T04:30:46.000Z",
          "Titre": "Terrible Experience, Poor Service",
          "Contenu": "Terrible Experience, Verizon Deprioritize Twigby customers / Accounts all the time. Customer Support is just ok. Data Drains really fast support is Always trying to justify. Super Slow Data speed , funny thing is saying i used 10 GB Data in 20 Days Never used that much in my entire history ,I will try to get money back and see."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "geo cou",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T00:09:19.000Z",
          "Titre": "Terrible service awful customer service…",
          "Contenu": "Terrible service awful customer service wouldn’t recommend to anyone inflated data numbers"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Victor Palomino",
          "Nb_Reviews": 2,
          "Date": "2023-03-22T07:04:45.000Z",
          "Titre": "I ordered the SIM card on 2/28",
          "Contenu": "I ordered the SIM card on 2/28. Today is 3/21 and I have not received it yet.Very poor service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Suzi Snow",
          "Nb_Reviews": 1,
          "Date": "2022-08-23T19:54:27.000Z",
          "Titre": "Where is it?",
          "Contenu": "I never received the sim card.I had it sent to my brother's house in Nevada because that's where I was going to be. Well, I was there for almost a week- nothing!This is way passed the 7-10 days I was expecting."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gary",
          "Nb_Reviews": 4,
          "Date": "2022-08-14T18:45:57.000Z",
          "Titre": "Easy to sign up but signal is poor in my area",
          "Contenu": "It was very easy to sign up for the service and it went well. My number transfer was completed almost immediately. However, the coverage in my area is poor and my signal is almost always low enough to disrupt my calls."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Maria Carnemolla",
          "Nb_Reviews": 1,
          "Date": "2022-07-15T19:33:25.000Z",
          "Titre": "It's going on 3 weeks and still no sim…",
          "Contenu": "It's going on 3 weeks and still no sim card or response to email, I'm wondering what your customer service is going to be like, you withdraw money fast then no communication, if you don't get in touch I will not due any business with you"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kcracra",
          "Nb_Reviews": 1,
          "Date": "2022-04-16T21:15:07.000Z",
          "Titre": "Very poor coverage. Suspicious data charges.",
          "Contenu": "Very poor coverage. Supposedly uses Verizon network. I transfered from a Verizon carrier and have had horrible coverage with Twigby. Also, with my former carrier, I averaged 2-3 Gb/mo. Since I rarely can use my Twigby service, I can't figure out why my usage is suddenly 15 times higher than with my former carrier. They said thru chat that they cannot help. Something isn't right with Twigby."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 1,
          "Date": "2022-04-05T19:14:40.000Z",
          "Titre": "Twigby is Both Good and Bad",
          "Contenu": "Low price for service provided. Seldom any dropped calls. Good coverage. But, jus too many unwanted sales calls from various companies. Also and most important: I would get 3-5 spam, hang up, or I'd answer but get \"dead air\". It was very hard to cancel also. I'd advise not to bite on it unless you don't mind all of the unwanted calls. Oddly enough, no unwanted calls on Sat & Sun."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Heitner",
          "Nb_Reviews": 2,
          "Date": "2022-04-06T01:29:22.000Z",
          "Titre": "Can not make outgoing calls.",
          "Contenu": "I have had twigby for a month and all went well until today, when I can no longer make outgoing calls.  I chatted for 45 minutes, but they were unable to help, but 'network services' would get back to me in 24 business hours or 3 days.  It says my service is active and I owe nothing.  I still receive all my incoming spam calls though.  A phone service where you can not make phone calls and they can not fix it is no good."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Lewis",
          "Nb_Reviews": 2,
          "Date": "2022-06-08T23:33:59.000Z",
          "Titre": "Took more than 72 hours to port my line…",
          "Contenu": "Took more than 72 hours to port my line over, multiple chat sessions with responses like \"there's nothing I can do \".  I finally filed a FCC complaint and it ported the next day.  If I have any other trouble I'll seriously consider changing providers."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jessica Garlow",
          "Nb_Reviews": 1,
          "Date": "2022-03-11T23:25:03.000Z",
          "Titre": "....",
          "Contenu": "I purchased a phone through the company and now that they are switching to another network, my phone is not compatible and the best they can do is tell me that I need to buy another phone. Completely ridiculous to think that people can just afford to buy phone after phone. When I spoke with someone through chat, she was completely unhelpful and rude. I 100% do not recommend using this for your phone service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jamie",
          "Nb_Reviews": 1,
          "Date": "2022-07-19T21:41:22.000Z",
          "Titre": "I contacted service several times and…",
          "Contenu": "I contacted service several times and was told to do the same things over and over again after I told them they weren’t working. I also paid for a service that wasn’t working for 2 months and they gave me a $5 credit for it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tiffany Ross",
          "Nb_Reviews": 1,
          "Date": "2022-03-12T21:05:43.000Z",
          "Titre": "Sprint to Verizon backer, GOOD to AWFUL.",
          "Contenu": "The switch from Sprint to Verizon has been awful. I had good service through Twigby via Sprint with strong signals and few issues (DFW). Now... if there is a cloud in the sky, sometimes when there isn't... I have a consistent 0-1 BAR! Getting a replacement Sim card for my daughter was a pain after it got lost in the mail and I FINALLY got another order through after over a month without service. I will be searching for an alternate provider."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "April Zee",
          "Nb_Reviews": 1,
          "Date": "2022-10-17T21:38:49.000Z",
          "Titre": "1 star kuz my sim card dent work & i…",
          "Contenu": "1 star kuz my sim card dent work & i wasted a whole months worth of cell service. wud b nice ta b reimbursed"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2022-11-10T19:48:08.000Z",
          "Titre": "Can't receive text messages",
          "Contenu": "Can't receive text messages. Goes out of range frequently."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jim Nealon",
          "Nb_Reviews": 1,
          "Date": "2021-08-26T18:27:16.000Z",
          "Titre": "They get one star for the cost",
          "Contenu": "They get one star for the cost. All else is sub to no standard. Crap phones that don’t work, no option to return, or get credit. They say go to the manufacturer. Good luck there. Calls drop all the time. Can’t get through to numbers I could before ( no explanation). Out of work and I need cheap. They just went to the Verizon network ( was Sprint ). Will see if that changes things."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Linda Aaron",
          "Nb_Reviews": 1,
          "Date": "2022-05-25T21:02:20.000Z",
          "Titre": "I used all 10 gigs of data a few days…",
          "Contenu": "I used all 10 gigs of data a few days before the end of my billing cycle. I expect that the speed drops when that happens and it did. However, once my new month kicked in, my speed should’ve gone back to normal and it did not."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christopher Norris",
          "Nb_Reviews": 1,
          "Date": "2022-05-25T21:35:13.000Z",
          "Titre": "My voicemail stopped working",
          "Contenu": "My voicemail stopped working.   Website was useless trying to figure it out.  Can't seem to reach a tech either.  I know this is budget service but atleast provide some guidance instead of no customer service whatsoever."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "buggy crazy",
          "Nb_Reviews": 14,
          "Date": "2023-06-20T02:36:04.000Z",
          "Titre": "Big waste of time and money",
          "Contenu": "Big waste of time and money, rip off company"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Loretta Jordan",
          "Nb_Reviews": 1,
          "Date": "2023-04-24T07:30:47.000Z",
          "Titre": "I have not received my phone yet.",
          "Contenu": "I have not received my phone yet.Please tell me where my phone is."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "nada nada",
          "Nb_Reviews": 1,
          "Date": "2021-09-02T22:51:06.000Z",
          "Titre": "Awful service",
          "Contenu": "Awful service. Currently holding my phone number hostage and refusing to allow me to leave them as a provider in direct defiance of federal law. I have both a BBB and a FCC complaint active about this now.Because they are holding my number hostage I tried to switch to twigby's Verizon network to at least get better service. It failed. I am now paying for a service that does nor work. I am told I need to call collect or get a prepaid card whenever I try to dial out.I literally just paid my bill on time, today, like usual. So not only are they holding my number hostage but I don't even have service anymore."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "marie Snow",
          "Nb_Reviews": 1,
          "Date": "2020-07-13T14:18:51.000Z",
          "Titre": "Crooked AF",
          "Contenu": "I purchased a phone from twigby because they said that mine wasn't new enough of course. I screwed up and forgot the screen lock pattern. How the phone got wiped out and because they weren't able to get back into my phone I had to pay to have it fixed. I ended up with two phones now and once I leave my house I have no GPS and no data. I just drove to San Diego and was unable to use my phone in most areas. Now I find out that both of the phones cannot be used with any other carrier. How can this be legal? I want out. These guys are horrible"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "c_c",
          "Nb_Reviews": 3,
          "Date": "2019-08-03T01:28:19.000Z",
          "Titre": "DO NOT USE THESE CROOKS!!!",
          "Contenu": "DO NOT USE THESE CROOKS!!!They will charge you for overages when you have overage protection ON and say you turned it off when you didn't...And forget the 30 day try and if you don't like refund guarantee...they won't give you that back either...CROOKS total & complete CROOKS!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric B",
          "Nb_Reviews": 4,
          "Date": "2021-07-17T23:46:05.000Z",
          "Titre": "Poor customer service",
          "Contenu": "Poor customer service.  I would not refer anyone here, unless you never need customer service.  We tried to return a faulty phone, and they wouldn't accept it back, just offered me a credit so what, I could buy another phone from them???"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ellis Greene",
          "Nb_Reviews": 1,
          "Date": "2020-09-17T14:53:07.000Z",
          "Titre": "can not receive paypal txt",
          "Contenu": "After use their service, figured out they could not receive txt from paypal. Have to change to a different carrier otherwise I will not be able to log on to paypal.The porting procedure took forever. Very difficult to leave Twigby, once some thing goes wrong in the porting it is impossible to get hold of any one in their porting dept. The customer service person called Dave was very rude. There was a rejection on the porting application, but he refuse to let me know. and the rejection was not passed through to verizon, causing a countless delay in the porting procedure."
        },
        {
          "Note": 1,
          "Lieu": "MY",
          "Pseudo": "Barry List",
          "Nb_Reviews": 1,
          "Date": "2019-07-19T14:38:08.000Z",
          "Titre": "Twigby - Just Bad News",
          "Contenu": "I  tried Twigby because it was one of the cheapest out there. What a mistake. 10 months later and numerous complaints to the BBB they are still charging my credit card every month. Promise to cancel and next month they charge again. Customer service is nonexistent and available by chat only. They will just cut/paste an irrelevant answer that has nothing to do with your inquiry and if you call them out on it or ask for your query to be escalated they become abusive and downright rude.Do not even consider Twigby, you will regret it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "BRAD",
          "Nb_Reviews": 4,
          "Date": "2022-06-09T22:44:59.000Z",
          "Titre": "Can't get any service out of the chats",
          "Contenu": "Can't get any service out of the chats. Only one person was able to give any assistance. But the communication from this business is extremely poor to non existent."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike Kammer",
          "Nb_Reviews": 1,
          "Date": "2019-12-08T19:36:49.000Z",
          "Titre": "Just had the worst interaction with…",
          "Contenu": "Just had the worst interaction with Doug from Twigby chat.  I was so appalled with his accusatory statements that I screwed up my sim card by not following directions.  I followed instructions to the letter of the law and somehow \"It was my fault\" that it locked!! If I could attach screenshots of rudeness and crass of Doug I would.  Just steer clear of this \"Cheap Option\" for cell service!!! You obviously GET WHAT YOU PAY FOR HERE.  Rude, arrogant, condescending, unprofessional and disrespectful is my experience.  Will be posting screenshots of exchange to social media for sure..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric B",
          "Nb_Reviews": 4,
          "Date": "2020-07-23T23:36:28.000Z",
          "Titre": "Phone service is okay, but...",
          "Contenu": "Phone service is okay. Just don't buy any phone from them they don't back them up. I would encourage you to buy an unlocked phone elsewhere. because they don't back up their products I am unable to give them more than one star."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Peter Olivia",
          "Nb_Reviews": 2,
          "Date": "2019-05-23T01:03:47.000Z",
          "Titre": "Twigby won't make it right",
          "Contenu": "Twigby sent me a defective device and will only send me a replacement if I buy a new one or ship back the defective one without service for an undetermined number of days.  I took the device to the Apple store and they validated that the \"refurbished\" device had a faulty screen.  They didn't state that they were selling me a refurbished device when I bought it, and when I end up getting a defective one, they make the customer sacrifice for their error.  If I'm at fault, then I will willing pay the price.  When Twigby is at fault, I WILL ALSO PAY THE PRICE.  That's terrible customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Estelle Crayton",
          "Nb_Reviews": 2,
          "Date": "2022-08-05T17:41:25.000Z",
          "Titre": "Misleading payment amounts change monthly!",
          "Contenu": "If -0- stars was an option that's what I would give. Each month the amount changes alone with the excuses. I'm supposed to pay $12.50 per month plus taxes and please don't let them have access to your payment account because they will tell you, you must provide it! In July I prepaid my bill and then received notice that it was an additional .20 more. I said okay let's see what happens next month. Sure thing I overpaid for August by an additional .20 more than last month and my phone is off because now they want an additional $1.64. They first told me it was for taxes and sent me a screenshot then when I told them $12.50 and the taxes came to $15.72 but I was being charged $17.53 I was told no I wasn't. When I stated I had already paid $15.89 and now my phone is off for an additional $1.64  which amounts to $17.53 I was told they recently included an administrative fee to defray costs from vendors/partners. I told them I was filing a complaint with the FCC and that's exactly what I did!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tom Balazs",
          "Nb_Reviews": 1,
          "Date": "2020-03-25T22:58:00.000Z",
          "Titre": "Did not honor 30 day return, poor customer service, poor phone, lots of spam to my child",
          "Contenu": "I purchased a Sonim phone for my son through Twigby. The phone was okay at first, but then after I set up parental controls, I was not able to alter the phone, add numbers, etc because it would no longer accept the passcode. I tried to return the phone using the 30 day guarantee but they wouldn't accept the phone back if the pass code didn't work. On top of that, they gave me a recycled phone number and my son was bombarded with spam texts despite the parental controls I put in place.They actually threatened to charge me an additial $15 if I returned the phone without unlocking it (despite that I couldn't unlock it and that was the reason I was returning it)."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Korey Zweifel",
          "Nb_Reviews": 1,
          "Date": "2022-07-20T16:44:29.000Z",
          "Titre": "Data is expensive to add and it doesn't…",
          "Contenu": "Data is expensive to add and it doesn't add right away if purchased. Took a week to port number. Didn't like the service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric B",
          "Nb_Reviews": 4,
          "Date": "2022-03-20T14:02:02.000Z",
          "Titre": "As long as you don't need anything",
          "Contenu": "As long as you don't need anything, Twigby is great.  Low prices are hard to beat.  But when you need customer service, they are terrible.  Be careful!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Laura Wilson",
          "Nb_Reviews": 2,
          "Date": "2022-07-20T17:35:13.000Z",
          "Titre": "Cannot use the phone I have it will not…",
          "Contenu": "Cannot use the phone I have it will not activate. Contacted customer services and no refund for a service I cannot even use"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tiffany Johnson",
          "Nb_Reviews": 1,
          "Date": "2021-12-19T01:46:20.000Z",
          "Titre": "Used to work great",
          "Contenu": "Used to work great. Ever since they migrated, circuits are busy, connections are bad, and calls drop all the time. Will be moving to a new provider."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kathy Rhea",
          "Nb_Reviews": 1,
          "Date": "2022-08-02T22:57:59.000Z",
          "Titre": "I have not recieved my SIM card",
          "Contenu": "I have not recieved my SIM card. I contacted a rep and was told to wait to report it..  Still nothing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Johnson",
          "Nb_Reviews": 3,
          "Date": "2022-05-25T20:30:38.000Z",
          "Titre": "NUU phonecis crap",
          "Contenu": "NUU phonecis crap. Orhers are too expensive.Couldn't use my old phone / no.Have to have WiFi to get good service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "marcelo bermann",
          "Nb_Reviews": 1,
          "Date": "2022-08-21T23:19:12.000Z",
          "Titre": "unless i get decent help activating my…",
          "Contenu": "unless i get decent help activating my phone i will quit the service, so far impossible!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mark Rider",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T16:16:50.000Z",
          "Titre": "Glitches in their website's and Slow SIM Delivery",
          "Contenu": "Glitches in their website's IMEI caused problems with the initial set up, but glitches can happen. They acknowledged it and said they'd address it. Ok. But then after two full weeks, the (two) SIM cards have not arrived. I chatted again with an agent to resolve, but this time I got an argument about it's 6-10 business day--no problem solving here. Still don't have the SIM cards. We're not off to a good start."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T22:29:58.000Z",
          "Titre": "I attempted to bring my phones to…",
          "Contenu": "I attempted to bring my phones to Twigby and made several checks on compatibility, confirmed in chats. Then when I could not get to the mobile date network to register, after trying for a month, I was told the phones were not compatible. I then had trouble porting them back. So I decided new phones directly from Samsung, and was told they could not confirm if they were compatible without the IMEI. I bought them and went to a service that said any unlocked phone from Samsung dirctly is compatible.So today, I finally have functioning phones through another service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "tom fisher",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T14:08:19.000Z",
          "Titre": "don't get old",
          "Contenu": "i grew up where people talked to people, not machines or AI ( absolutely insane). if i wanted something i was told to ask for it, not \" we are going to do this or that unless you tell us not to\" $1.00 a month spam filter $2.75 a month caller id ? never discussed or requested"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robbie Martell",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T17:08:09.000Z",
          "Titre": "Twigby",
          "Contenu": "Twigby has almost zero customer service. Everything is self-service. Kind of like those confusing self checkout lines at the grocery store."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tom Omann",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T02:09:07.000Z",
          "Titre": "LOW REVIEW BASED ON DETAILS",
          "Contenu": "The plans offered were my reason for interest ing having an account with Twigby.  The deal stopper was the insistence on having a credit card number when PayPal was an alternative payment method.  I would still request an account with Twigby if that 'requirement' is waived.  The other concern I found was contact.  The only means I was able to access was the chat with a live assistant, who was patient and quite considerate.  My emails explaining objections to providing a credit card number were not apparently received (lack of contact access.) and were not time well spent as such. P.S. required T&C conditions below are NOT okay for review."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nicholas Marks",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T07:20:54.000Z",
          "Titre": "Very Frustrated",
          "Contenu": "It is now almost one month and one of my phones still cannot call out. Before switching to Twigby I was assured my existing phone would work. First I had to wait for a SIM card adapter, now the phone will not call out and I had to buy a new phone, all because of incompatibility. (Can you say Bait & Switch) Customer service (online only) is a problem. Only staying with them because I already bought a new phone for our second line, and I need their service (Verizon)."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "T hee hee",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T14:01:26.000Z",
          "Titre": "Not worth it",
          "Contenu": "The speeds aren't as advertised, at night typically after 7:00 I'm being throttled to ~1Mbps or less, while in the daytime the speeds are 20+ Mbps. I've seen speeds up to 70Mbps on 4G only.I won't be staying with Twigby for very long, the inconsistency in service is irritating."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Frank Gallagher",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T20:38:52.000Z",
          "Titre": "Ordered & paid for plan and sim card +…",
          "Contenu": "Ordered & paid for plan and sim card + Expedited delivery.  NINE DAYS LATER I finally got the card.  WHY? Because you sent it USPS GROUND ADVANTAGE.  Not sure why, since it is the SLOWEST way to send.  Did I mention I paid for Expedited Delivery?Since I had no service at the time, had to visit the Verizon store to get any service.  Very Expensive- also ironic, since high prices are what both of us are trying to avoid. Still have the sim card & may activate at some point, but DUDE, I'm not too happy about things.Yes, we can put some blame on the good,old Post Office - BUT out of all the choices you had, you chose the SLOWEST.IF you wish to make it right, how about you REFUND the Expediting fee, plus the first month of service???UPDATE - They just refunded expediting fee. Awsome!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Elio Furlano",
          "Nb_Reviews": 2,
          "Date": "2023-04-17T23:06:13.000Z",
          "Titre": "Your Tech Team couldn't fix the recent…",
          "Contenu": "Your Tech Team couldn't fix the recent problem of not receiving texts from some Verizon users.  I tried a different phone and even did a factory reset on another.  Didn't have a problem for years with you guys.  You couldn't fix YOUR problem, so I left you."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dominique Plattel",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T03:28:37.000Z",
          "Titre": "Really bad connection",
          "Contenu": "Really bad connection. Lots of dropped calls, generally only one or two bars. Siri won’t work if there’s no WiFi available. Not happy with this service at all."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Boomer",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T17:30:37.000Z",
          "Titre": "For some unknown reason",
          "Contenu": "For some unknown reason, I used over 2gb of data in about 5-6 days on Twigby. With all my years with Total Wireless and even a few months with Tello, I had never gone over 2 gb of data in any month. I only check email and browse web pages. No videos or music. I just don't understand it, but it showed me that I had to move to another carrier. Maybe they are somehow counting my wifi data. I have now been with my new carrier for about a week and have used about 200 mb. There is NO way that I would have used 2 gb."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kim Demke",
          "Nb_Reviews": 1,
          "Date": "2023-01-26T22:28:11.000Z",
          "Titre": "Texting often doesn’t work and calling…",
          "Contenu": "Texting often doesn’t work and calling doesn’t always either. I might need to switch carriers bc I want to be able to communicate with my kids who use this phone. Disappointing"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "cayenne woods",
          "Nb_Reviews": 14,
          "Date": "2023-04-29T18:39:27.000Z",
          "Titre": "Not worth it as extra phone, and no way to cancel without chatting",
          "Contenu": "I got it to see if verizon reception was available when my at&t was not.It is not - no extra places where this kicked in.I also thought it might be useful for out-of-country visitors to have a local phone, but I've not used it.It's not a bad idea, and a good deal, but not worth it to me.Hiowever, the cancel process is a pain. You can NOT do it yourself, but have to chat. And you have to remember to do it before a billing date - they will not cancel for future, so have to chat again before next one. Not ideal"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Don Anderson",
          "Nb_Reviews": 2,
          "Date": "2022-12-05T22:29:31.000Z",
          "Titre": "Had chat and thought all was completed",
          "Contenu": "Had chat and thought all was completed, waited a few days and went on chat again to find out that I had been left hanging in the wind, now my time was up for an easy exchange, quoted $15.00 so I said OK, chatter came back with $27.00, I had two say OK, today is 12/5 still no return authorizationDon Anderson 88819"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 3,
          "Date": "2023-09-17T08:38:21.000Z",
          "Titre": "Everything about setting up my 3 phones…",
          "Contenu": "Everything about setting up my 3 phones was so time consuming and awkward. Nothing went smoothly."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mike Yanecko",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T05:08:24.000Z",
          "Titre": "Inconsistent speeds are very…",
          "Contenu": "Inconsistent speeds are very frustrating. I have the unlimited plan and still my download speeds are not being met. Won't be with them for long."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MM",
          "Nb_Reviews": 38,
          "Date": "2023-05-23T20:44:35.000Z",
          "Titre": "Refused to work with our (major) VPN",
          "Contenu": "Twigby offers service in our area so we thought we'd give it a try. We've been with them now for about two years. Neither of us uses a mobile phone to call or receive calls. Nearly all our communication is done via texting apps, email, or IM services like Signal. The few times we were out and about and wanted a map software service working via our mobile data plan, this wouldn't work for us. Twigby couldn't help us. Recently, for the first time in over a year, I tried to use my mobile phone to make a call. It \"failed.\" I remembered Twigby is my provider so I went to the website to see if there's a problem with my plan. Nope. I finally contacted a Twigby support rep who had me go through a series of settings. The problem? We use VPNs on our phones for privacy and to minimize corporate data harvesting. Apparently, this disrupts Twigby. We were asked to disable the VPN to use our mobile plan.We opted to terminate service with Twigby. Our privacy is worth far more to us than a spotty mobile plan, especially when the great bulk of our communication is already through other means. Very suspicious that a telecom company requires the ability to track users beyond what they already do--constantly monitor the IMEI/unique phone identifier. Two stars for pricing. But very disappointed Twigby won't work with our VPN.*******Reply to Twigby's Response********Since we don't use our phones other than in emergencies, we keep Airplane mode on. Whenever we've needed mapping software to guide us to an unfamiliar location, the software--including the OS-native mapping software--has failed. We recently tried to enable wifi-calling (the day I couldn't get Twigby to work). My iPhone threw a message that to enable wifi-calling, I'd have to contact Verizon. So that's not as simple as simply enabling the function in settings.Yes, Verizon has historically been rated highest on US coverage. But Verizon itself has told us that it deprioritizes network connections to its non-Verizon customers such as those using a service that has an agreement with Verizon to use its towers. The brief while we had Verizon in our neighborhood, our connections were flawless. As soon as we switched to Verizon-shared companies, our connection quality and reliability plummeted. And, respectfully, it's still unsatisfactory that to have a reasonably reliable connection to Twigby, we have to disable one of the few tech protections our family has to mitigate un-wanted data collection on our devices."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Anna E",
          "Nb_Reviews": 1,
          "Date": "2023-04-30T02:47:16.000Z",
          "Titre": "Received poor quality \"certified\" phone",
          "Contenu": "*Update: Did finally receive an email from Twigby. Sad that it took a review to get that to happen opposed to replying to the email sent directly to them days prior to the reveiw. The customer service is quite slow in getting a response via email so I am still waiting to see how it ends. I will try to update once it is completely resolved. I ordered a phone from Twigby to begin service with them. The phone I ordered was supposedly a \"certified\" phone. It was a Samsung S10e. When the phone arrived the back of the phone was not adhered as it should be. I contacted Twgiby customer service and was told to send pictures of my phone to a managerial email. It took several business days to get a response. the response accused me of having tampered with the phone and claiming that is would never have been shipped in the condition I recieved it. \"...We can tell from these pictures that someone has tried to remove the backplate from the phone.  We review all of our Certified phones and hold them to the strictest standards; so, the phone would not have left our warehouse in this condition.  \" This is wholly untrue. I received the phone in the condition I contacted them about - with the back plate being open. It has been five days from my response to them and I have yet to get a further response from Twigby after informing them that the phone was received in the condition I contacted them about. To make matters worse while I was waiting on replies from Twigby about what there were going to do about the phone, due to the loose back it got dropped and cracked, then dropped again and rendered completely useless. I had not yet purchased a case and cover as I was waiting to see what was going to be done about the phone. The situation is what it is, a little customer service would have gone a long way instead of accusing me of damaging a phone that I recieved from them in damaged condition. Their \"certified\" phones mean nothing pertainging to the quality you will receive. Extremely dissappointed and will now be looking for a new carrier to move all 3 of our phone numbers over to as we will no longer be using Twigby. Hoping others have had a better experience."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "William Kennedy",
          "Nb_Reviews": 1,
          "Date": "2023-02-19T00:23:29.000Z",
          "Titre": "Activating difficulty",
          "Contenu": "I have not been able to activate my service. The procedure is not working for me."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Billy Crouse",
          "Nb_Reviews": 3,
          "Date": "2023-01-11T04:21:51.000Z",
          "Titre": "Verizon phones will not work unless…",
          "Contenu": "Verizon phones will not work unless they are lte/g4"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Leo Lawhorn",
          "Nb_Reviews": 2,
          "Date": "2023-01-05T22:11:53.000Z",
          "Titre": "Hire more people to man their",
          "Contenu": "Hire more people to man their  chat lines.  It takes entirely too long to resolve an issue."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "BOBBY",
          "Nb_Reviews": 2,
          "Date": "2023-03-02T08:33:43.000Z",
          "Titre": "communication Communication this is the…",
          "Contenu": "communication Communication this is the first thing I’ve heard from new people is a survey"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mark P, PhD",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T21:10:02.000Z",
          "Titre": "I had overall negative interactions with many of your CSRs in the same day due to Verizon's service being down in my area for more than 24 hours",
          "Contenu": "I had overall negative interactions across multiple messaging experiences with four of your CSRs, two of those occurring with the same CSR. I got so frustrated at the argumentative behavior of all your CSRs except the first, who I would give 5 stars, the rest 2 stars. I had to ask repeatedly about not having service, and suspecting problems with Verizon's network particularly that a person who has Verizon directly was at my home and did not have service and needed to use a VOIP on my laptop to call his wife as my cell (via Twigby) was down also. My cell was down more than 24 hours in all. Those interactions were so challenging because of your CSRs and I messaged in multiple times, and your CSRs, who typically are very responsive and not gaslighting, were just the opposite in the chats I copied, with zero cause coming from me though due to their behavior, I got frustrated to which your CSRs exacerbated their behavior and escalated the gaslighting, and did not de-escalate, all because Verizon's network was down. And I have received zero credit on my account for not being able to use my cell for those more than 24 hours and wasting so much time messaging with your CSRs when the cause of the problem should have been proactively communicated to me and any other Twigby customer so impacted. I am otherwise grateful to have Twigby not offshore their CSRs... thank you for that corporate decision. Mark S. Pirie, PhD6/23/2023: In response to the reply from Twigby-You would think that I would be notified if I received a credit on my account or I could see the amount of the credit if I logged into my account and looked at the billing history; I was not notified and there is no history of a credit that I could find. And this credit came weeks after the event. I had a credit on my account already, and if I subtract that from the current negative balance, I can calculate that $14 something was the amount of the credit, for about three hours of my time that I had to force your CSR to contact Verizon, that he initially refused to do which put your CSR and I on a negative tract from that point forward. Fourteen dollars credit for wasting hours of my time with contentious CSRs who do not see me, who gaslit me, who did not want to help me, who did not inquire about how long I would be without service, and who eventually hung up the chat on me--not a fair exchange, and I hope this is not how your company always treats its customers. The Verizon outage was not Twigby's fault... was it mine? Was Twigby put out by not having cell/text service or me, and did Twigby get CSR responses that were fully inappropriate to the situation or was that me, your customer who did? You have this backwards, sir/madam, I am your customer who was put out and your CSRs and you could not care one bit... typical corporate response. My loss of hours with rude CSRs in exchange for $14 and somehow Twigby is not responsible for their CSR behavior with customers and I should overlook the impact of my being without service for more than 24 hours, because weeks later, you credited me without telling me about your $14 credit. Did you even read the hours of messaging history before you so blithely apologized to me?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MICHAEL WHITE",
          "Nb_Reviews": 1,
          "Date": "2022-09-30T19:19:28.000Z",
          "Titre": "I had high hopes",
          "Contenu": "I had high hopes; but I never got cell data to work, even after chatting with a Twigby agent. She had to surrender after trying everything she knew. I even did a hard reset, to no avail. I could make and receive calls and texts, and get online with Wi-Fi, but no cell data. I was afraid it might be my phone, although it had worked fine with my previous carrier. I took it to Verizon, where they put their SIM card in it; and it immediately started receiving cell date. I have no clue why it did not work with the Twigby SIM card. To make matters worse, I forgot to get the Twigby SIM card back from Verizon; so I could not take advantage of the money-back guarantee from Twigby. Y"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sarah Klemuk",
          "Nb_Reviews": 1,
          "Date": "2022-10-16T16:41:14.000Z",
          "Titre": "The verdict is still out",
          "Contenu": "The verdict is still out.  While I do get good coverage for phone calls, my data plan is messed up.  Upon initial startup with Twigby, they claim that I used 4GB of data in a matter of 10 minutes.  Result is having no access to data for the remainder of my first month with Twigby.  I messaged them about this.  Their response is that they just record what the towers report to them.  I have not ever used data to this degree.  It seems impossible to accrue this much data usage in such a short time.  They did not correct the problem.  We’ll see what happens in month 2 of the introductory period.  As of October 16, the data speed is back up after restarting my phone. The online customer service was very helpful with this. Things are looking better. I’ll wait another month and see how this goes before changing my overall rating."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chatterbox",
          "Nb_Reviews": 2,
          "Date": "2022-06-18T11:06:45.000Z",
          "Titre": "A Little Pi**ed",
          "Contenu": "Honestly, I have not received my sim card yet to give an opinion about the actual cell service. What my review is about is the fact that your 30 days of service starts from the day you place your order, NOT the day that you actually activate your service. To me, this is a rip off! It is going to take 7-10 days to just receive my sim card, therefore, those are days of service that I had to prepay for, but I DO NOT get to utilize them. What kind of scam is this? This may just be my first and last month with Twigby!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lucy Dilley",
          "Nb_Reviews": 1,
          "Date": "2022-06-10T15:09:52.000Z",
          "Titre": "The process of figuring out a…",
          "Contenu": "The process of figuring out a warranty/return/refund is very confusing. The customer service reps who helped me did a good job. It's just that all of the twigby rules are complex. I am still unsure if it's more worth it to just buy a new phone, rather than go through this process (I've already paid more than I paid for the phone). Plus, who keeps the original box that phones come in?? I can't believe you're going to charge me $5 because I'm returning it without the box."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert Key",
          "Nb_Reviews": 1,
          "Date": "2022-06-02T21:01:11.000Z",
          "Titre": "There are things you could do to improve service.",
          "Contenu": "1. It takes far too long to get the sim card and have the number ported, there must be a way to expedite the process. If the card goes out the day it is paid for, it should arrive in three days or so, not two weeks or longer.2. It would be important to inform page plus customers that their account number is their IMEI. Page plus will not tell you that, and unless you know that, your number will not be ported. We are still waiting for my son's phone to port, it has been a couple of weeks now."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "RICHARD",
          "Nb_Reviews": 1,
          "Date": "2022-06-22T14:45:29.000Z",
          "Titre": "Contacted twigby about bad sim card",
          "Contenu": "Contacted twigby about bad sim card. Phone unusable with bad sim card. Twigby service/help very good as usual. My only problem was new sim card was sent USPS PRIORITY mail which took 4 days to recieve. Overnight FedEx would have been better since phone was unusable for 4 days."
        },
        {
          "Note": 2,
          "Lieu": "MX",
          "Pseudo": "Rodolfo Zarate",
          "Nb_Reviews": 1,
          "Date": "2022-05-26T15:10:56.000Z",
          "Titre": "Poor agreements. Data sometimes works, other just don't.",
          "Contenu": "It's terrible that you have to dial a number for international calls before actually dialing the real number. It's also not working outside the US. No roaming agreements with anyone? Not even Canada or Mexico? And the Service at the Miami airport was less than poor. No data was coming in."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bob Pruden",
          "Nb_Reviews": 1,
          "Date": "2022-06-19T00:06:39.000Z",
          "Titre": "It is extremely difficult to navigate…",
          "Contenu": "It is extremely difficult to navigate thru your sight in trying to enroll in a plan and buy a phone. It was very frustrating and I chatted with two different chat people and neither were very helpful in assisting me. It took me probably 3 hours to get this accomplished"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Maron El-Khouri",
          "Nb_Reviews": 2,
          "Date": "2022-08-10T23:53:03.000Z",
          "Titre": "Poor incoming text photo quality",
          "Contenu": "The incoming text message picture quality is awful on this company's most popular phone, the TCL A30. They refuse to look into it, even after contacting support 3 times over chat. Cut-rate prices only get you so far - you have to be willing to fix technology issues in order to be proficient in what you're offering. If you go with Twigby, you'd better bring your own device! Incoming text photos work fine for those of us using Twigby on iPhones. Otherwise, be prepared for an antiquated photo resolution of 240x180 and file sizes of less than 25 kb (that's right, KILOBYTES). They have obviously set up this model's profile incorrectly on their carrier's network as a feature phone."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Del Davis",
          "Nb_Reviews": 1,
          "Date": "2022-09-06T16:23:04.000Z",
          "Titre": "Ive been trying to get my LTE data and…",
          "Contenu": "Ive been trying to get my LTE data and mms pics working but my attempts have been unsuccessful. Ive contacted the chat 4 times and no resolve. Can anyone help resolve the issue?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Don Frost",
          "Nb_Reviews": 5,
          "Date": "2022-05-25T21:07:07.000Z",
          "Titre": "My wife doesn't have service inside the…",
          "Contenu": "My wife doesn't have service inside the grocery store ten miles from us!I keep getting all kinds of garbage from google and others that I hate and don't want!I'm not up on phones and there is very little customer service!I never used data before and this service is telling me I've used a lot for some reason!I think phones are for talking on and computers are for looking things up on!I can't figure what I've used data for unless it's those unwelcome,unwanted messages I keep getting!If that keeps on I'll be changing to another company!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sarah Gore",
          "Nb_Reviews": 1,
          "Date": "2022-05-26T03:31:48.000Z",
          "Titre": "I like the price of Twigby but I have…",
          "Contenu": "I like the price of Twigby but I have to go outside of my home to talk on the phone. I had Verison before and never had to gooutside to talk on the phone. I was paying more for Verison but I thought Twigby used the same towers as Verison."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brian Perez",
          "Nb_Reviews": 1,
          "Date": "2022-08-15T20:35:02.000Z",
          "Titre": "Very poorly handled",
          "Contenu": "Very poorly handled. Agent wouldn't provide return mailing address, instead and I had to wait for an email that never came until I asked again for it several days later."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "john sommer",
          "Nb_Reviews": 1,
          "Date": "2022-09-16T17:06:54.000Z",
          "Titre": "Phone return. I did everything I knew how to do. Including a factory reset and it was still rejected!",
          "Contenu": "Phone return I did everything I knew, including a factory reset and it was still rejected!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "RRGG",
          "Nb_Reviews": 1,
          "Date": "2022-07-14T03:32:07.000Z",
          "Titre": "I received my SIM card in a damaged…",
          "Contenu": "I received my SIM card in a damaged package missing the iPhone SIM card remover tool that was supposed to come with it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 2,
          "Date": "2022-05-27T00:37:40.000Z",
          "Titre": "I like the price but not the quality",
          "Contenu": "I like the price but not the quality.  They have told me they don't support 5-digit messaging which is what most companies use for 2-factor authentication.  This causes a huge issue for me as I have several sites which require 2-factor.  Some have the option of text vs a phoe call but some do not.  Sometimes I get the text message but about 50% of the time I do not.Also, there have been times when incoming calls evaporate into cyberspace...the caller thinks my phone is ringing but it's not.  Twice I've worked with tech support on this to temporarily resolve the issue but the bottom line is that there is uncertainty as to whether calls will come in or not.  This problem NEVER happened on this phone before switching from Verizon to Twigby so I know it's not the phone itself.I had high hopes for Twigby but unfortunately I must move on.  I have USMobile on a backup phone and that seems to work fine.  I plan to stop Twigby and get a 2nd line on USMobile, not because I have any hard feelings but rather because I need more reliability."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Donna Boyd",
          "Nb_Reviews": 1,
          "Date": "2022-08-10T21:49:46.000Z",
          "Titre": "Keeps charging me every time talk…",
          "Contenu": "Keeps charging me every time talk minutes is exceeded until new unlimited talk plan kicks in."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ken S",
          "Nb_Reviews": 118,
          "Date": "2020-02-12T13:25:46.000Z",
          "Titre": "A Chat Session Was The FInal Straw",
          "Contenu": "The Motorola G7 is listed on Twigby's site as a phone that supports WiFi calling.  Because of that, I bought two Motorola G7 Power phones.  Well, guess what?  WiFi calling didn't work - the phone didn't have the settings shown in the how-to-enable-WiFi-calling article.  So, I had a chat session with one of their tech support folks.  Completely unhelpful - all they wanted to do was argue about my use of the word \"incompatible\" - they stated (repeatedly) that my phone was NOT incompatible, while also stating that SOME Moto G7 Powers don't have \"the right firmware\" to support WiFi calling, and basically informing me that I was out of luck.  That's what I call \"incompatible\", but then again, I only have a Master's degree in Electrical Engineering - what do I know?!?!?p.s. I switched to Republic Wireless, and WiFi calling works great - using the exact same phone."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Hersch Grunwald",
          "Nb_Reviews": 1,
          "Date": "2022-07-19T21:51:47.000Z",
          "Titre": "no costumer service",
          "Contenu": "no costumer serviceneed to dial to Canada only with a calling card"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David Hughes",
          "Nb_Reviews": 1,
          "Date": "2022-10-03T19:14:57.000Z",
          "Titre": "They had a hard time transferring my number",
          "Contenu": "It was impossible to transfer my number effectively from my old carrier. I lost my old number in the process, and though blessing it turned out to be, Twigby was unable to perform its job properly. I give two stars because it could also have been the fault of Mint Mobile, my previous carrier, but I can say that 100% of my experience with Twigby has been sub-optimal. One thing that stood out to me as particularly awful was that they refused to process my refund until I mailed them back- at my expense- the SIM card they sent. Besides this, when I got a refund, they didn't refund all of my purchase.EDIT: Twigby claims they refunded the cost of my SIM card and service, which is probably true. However, when I asked if all of my purchase, including shipping, would be refunded, the representative said yes. Just in case I'm wrong, I challenge Twigby to pull the audio from the call and I will gladly type a retraction. My bank records indicate I paid Twigby $20.84 to expedite me a SIM card that failed to do me any good, that I paid $7.74 for shipping with tracking, and that Twigby refunded me $9.46. A company with integrity would have written off the negligible cost of the SIM card and issued me a full refund rather than blaming the out-transferring carrier and sticking me with the cost.EDIT: Twigby claims that Mint Mobile would not provide a correct account number to allow transfer of my number. While I cannot verify whether it's Twigby who is at fault or Mint Mobile, Mint Mobile repeatedly claimed that they provided the correct information. I challenge the two carriers to duke it out themselves; until then, I'd advise against both of them, but given Twigby's approach to a \"refund\", I'm inclined to trust their tech savvy less than Mint Mobile's, which at least provided me almost acceptable service for a couple of years."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Pedram",
          "Nb_Reviews": 1,
          "Date": "2022-05-26T17:10:33.000Z",
          "Titre": "1-2 stars at most …",
          "Contenu": "I have zero or barely any speed on your LTE network."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Frank D",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T19:48:39.000Z",
          "Titre": "Bad signal reception",
          "Contenu": "Bad signal reception. Easy activation."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bruce Ducker",
          "Nb_Reviews": 2,
          "Date": "2022-05-28T00:44:37.000Z",
          "Titre": "5 days later I’m still trying to connect"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2022-05-25T22:55:19.000Z",
          "Titre": "Where not able to port my number."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "DO NOT VIEW THIS CHANNEL PLEAS",
          "Nb_Reviews": 9,
          "Date": "2021-06-28T16:04:10.000Z",
          "Titre": "Not good",
          "Contenu": "Cellular data is bad"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "rich buxton",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T18:05:45.000Z",
          "Titre": "Cheap rates nice.",
          "Contenu": "Cheap rates nice.But twigby misrepresented what they sell, unlimited is really 20 gb limit.  When twigby kneecaps your Internet speed for using to much, then you can barely send email. Web sites become unusable.  This they do not state in marketing.  If advertised appropriately,okay. Twigby did not do that."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Diana",
          "Nb_Reviews": 2,
          "Date": "2023-09-18T21:35:42.000Z",
          "Titre": "Piggybacking Towers Q'able",
          "Contenu": "Ive been using Twigby 2 weeks now. Setting my phone up with Twigby was relatively easy for this Luddite who hates tech. I like the cost savings to be sure, but today I noticed I did not get the same amount of bars (0-1) while traveling back roads to our destination that my friend did (full bars). She is on Verizon whose towers Twigby uses. I couldn't get a GPS signal. She could. Hm. That is disappointing. I still only have 2 bars and we are back to town. I'm traveling away from home where the towers may not be as strong, so...time will tell after i get back to the big city."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ed Burrows",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T19:42:10.000Z",
          "Titre": "Data slow & phone service  bad"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marshall Gregory",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T17:17:05.000Z",
          "Titre": "Rating",
          "Contenu": "Twigby has NOT corrected the issue with their chat after several months that effectively blocks phone number port-in because a ”Google Review” covers the chat window. Twigby has been timely with SIM and that is my only experience so far."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ann Marie",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T16:52:18.000Z",
          "Titre": "We were looking forward to the switch",
          "Contenu": "We were looking forward to the switch and saving money.  Unfortunately, days after the switch I had horrible reception in my house. I dropped calls, business calls.  Next day everything was fine.  Then, just recently while visiting family almost an hour away, we both had no reception in an area we used to have reception with our previous carrier.  Disappointing…."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Adam Massens",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T18:02:31.000Z",
          "Titre": "I like the service and support, software is underdeveloped",
          "Contenu": "I like the service, price and overall setup was easy once I got past the ordering.   I also like that bandwidth is throttled and not autocharged on overuse.  I dislike the ordering process having to validate every phone with a website that is underdeveloped.  Also, there are many restrictions on the app.  I cannot login easily as it keeps dropping my password.  Also most of the time I cannot paste in the field, and the keyboard doesn't show up, so I can't type it either.  Very broken from my experience.  Only the primary account holder can check data usage, quite annoying.  Besides the flaws, overall I am satisfied with the service (product and people), they were helpful and understanding and most of all patient with me even when I was not."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pauly Gee",
          "Nb_Reviews": 1,
          "Date": "2022-11-18T04:25:38.000Z",
          "Titre": "Have been a customer of Twigby's for…Several years, not exactly sure how many but think around 5 years.",
          "Contenu": "Have been a customer of Twigby's for several years. Overall very happy with my experience.  Only one issue, since they switched to Verizon as their carrier my data usage has gone way up, when nothing has changed on my end.  I rarely use data, yet they say I am using 5G rather quickly. So now I can't do much of anything or I go over"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Wayne Corley",
          "Nb_Reviews": 1,
          "Date": "2023-02-09T21:34:49.000Z",
          "Titre": "Tried Twigby Verizon Service",
          "Contenu": "Tried Twigby to see if their Verizon signal strength would be stronger than the AT&T signal we currently use.  Found it wasn't the day I got the sim card and cancelled the service. Did not get any refund even though I cancelled immediately after I tried service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cheap Worker",
          "Nb_Reviews": 1,
          "Date": "2023-01-01T21:44:35.000Z",
          "Titre": "Can I get government WPS on my number?",
          "Contenu": "I have the government WPS priority service on my number at Verizon before I ported it.  I was not able to confirm if it will still work or how to add the government program to my number before porting.   In the end the service is fine, but I cannot get WPS.   Twigby did offer to port my number to another provider, but I am electing to stay with them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "HJM",
          "Nb_Reviews": 2,
          "Date": "2023-05-10T17:57:46.000Z",
          "Titre": "Your complex international call system…",
          "Contenu": "Your complex international call system is a joke and it was not properly put forth/published before i sign up with you. That certain countries cannot reach me except on landlines is another unacceptable issue in the year of 2023. hjm"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Maria Manahan",
          "Nb_Reviews": 1,
          "Date": "2023-08-06T23:41:07.000Z",
          "Titre": "Instructions on how to transition were…",
          "Contenu": "Instructions on how to transition were quite “light.”  Thanks to my brother-in-law for filling in the many blanks."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Maron El-Khouri",
          "Nb_Reviews": 2,
          "Date": "2022-12-22T03:36:58.000Z",
          "Titre": "Twigby overlooks huge flaws in their flagship devices",
          "Contenu": "There is a good value for the service and coverage, while not as good as Verizon's prepaid, is fairly decent. However, their Support and Engineering refuse to review an issue with their best selling phone, the TCL A30 - even after I've brought it up several times and opened tickets about it. All text photos come in extremely low resolution and high compression, usually limiting their file size to less than 100kb. Forget trying to read text in a screenshot someone texts you, or the ability to see any level of detail in a photo you receive by text. It leads me to believe that they set this model up as a \"feature phone\" on Verizon's network instead of a smartphone. This is a flaw that will likely lead me to cancel service for myself and my family in the near future."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gordon Marston",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T21:52:44.000Z",
          "Titre": "Where did the data go?",
          "Contenu": "I was experiencing slow data downloads for a couple of days. I chatted with your service representative and he said the slowness was due to the fact I had used 1.2 GB of data. I asked him why the app said I still had 192 MB of data left. He told me it takes a couple of hours to update your data usage. I asked him why I went a couple of days before with slow service then. He never answered the question, but did offer me another gigabyte of data for the rest of the cycle. After he gave me that gigabyte of data Yep still said I had 1.112 MB of data. It would be nice to know what happened to the data."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T00:09:23.000Z",
          "Titre": "Beware of NewPhoneMall !!",
          "Contenu": "If I had not had to deal with NewPhoneMall I would give Twigby 5 stars . I feel they recommended NewPhoneMall so I knocked off 2 stars. NewPhoneMall is very slow delivering their phones  to start with . The phone I purchased from them was defective. To replace the defective phone from NewPhoneMall would have taken 2 weeks after I paid return shipping . Long story short thankfully I used PayPal to purchase from NewPhoneMall they helped me get a refund. Horrible experience. I did order a new phone from Twigby that experience went smoothly. In the end I did not get the phone I wanted. The Twigby customer service was first class they got me up and running . I went without a phone for 2 weeks so I was not happy about that . Twigby is ok now that I am up and running ."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "chatzi lieberman",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T22:13:04.000Z",
          "Titre": "not a bad service but the intl calls…",
          "Contenu": "not a bad service but the intl calls are a bit of a scam u dont get told that you cant call direct its only thru a access number and they limit the amount of numbers u can call"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "KM",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T20:52:57.000Z",
          "Titre": "Mostly good",
          "Contenu": "Mostly good, and good in the end.  However, the first attempt at set up left me with outgoing SMS but incoming went to my old phone.  Waited overnight.  Another support chat and that finally got fixed, which in the end I was very grateful for."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Donna Cullen",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T15:40:23.000Z",
          "Titre": "Communication could have been better",
          "Contenu": "Communication could have been better. To sign up I used chat and that went well. The Sim card said to go yo the website for directions. Seems to me they could have been included with the card. Then,the website said that you would send and email and tell me when to swap the Sim card. Still haven't got that email. Makes me wonder if I am also missing other information."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Walter",
          "Nb_Reviews": 1,
          "Date": "2022-11-22T20:06:43.000Z",
          "Titre": "No wifi calling",
          "Contenu": "Good network, low prices. Website not intuitive, a little hard to figure out the exact process to sign up. No wifi calling was a deal breaker for me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Moses Moye",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T03:22:18.000Z",
          "Titre": "Spotty service",
          "Contenu": "Spotty service. Many texts never go through. Probably going to have to suck it up and go back to Verizon. Bummer"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sami Uso",
          "Nb_Reviews": 2,
          "Date": "2023-01-30T20:49:36.000Z",
          "Titre": "It's great for what it is.",
          "Contenu": "You can tell it's just kind of a cheaper alternative. Older phones and not the GREATEST service.  But,  i enjoy it for what it is. I'll continue using it!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nina Hall",
          "Nb_Reviews": 1,
          "Date": "2023-03-11T22:23:17.000Z",
          "Titre": "Great prices for monthly phone service",
          "Contenu": "Great prices for monthly phone service. 20 GB unlimited data is not adequate for a month if you like to stream movies etc. once used data slows so much you might as well have none."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "George Swall",
          "Nb_Reviews": 1,
          "Date": "2023-04-21T21:14:06.000Z",
          "Titre": "Uncertainty regarding Moto G Pure…",
          "Contenu": "Uncertainty regarding Moto G Pure phone. Bad connection, intermittent and complete failure of connection, issue are, being addressed by your customer service through manipulation of Wi-Fi and Airplane mode and complete reset of phone. Possible poor quality microphone or poor quality transmission of outgoing voice will be addressed when and if intermittent connection issue is resolved."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael L.",
          "Nb_Reviews": 3,
          "Date": "2023-01-03T22:27:51.000Z",
          "Titre": "The service is fine but no wifi calling",
          "Contenu": "The service is fine but they don’t offer wifi calling. I wish I knew that ahead of time as I live in a low signal area and my office is in the basement. Now I miss calls"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Megan Grimm McDonald",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T13:07:38.000Z",
          "Titre": "My daughters phone is compatible but…",
          "Contenu": "My daughters phone is compatible but she can not get on the internet….  Was not told that…."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kathleen Pettorsson",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T05:12:34.000Z",
          "Titre": "I like the price and mostly like the…",
          "Contenu": "I like the price and mostly like the service except when in Sasabe, AZ when no service at all except when on WiFi. This was from December 8th - 11th, 2022"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anon",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T17:07:16.000Z",
          "Titre": "Sometimes I have service",
          "Contenu": "Sometimes I have service, sometimes I don't. Sometimes it is very slow. So far, I'm not impressed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul Brown",
          "Nb_Reviews": 4,
          "Date": "2022-11-08T02:03:12.000Z",
          "Titre": "Wrong mobile backbone.",
          "Contenu": "After requesting a SIM, I learned that Twigby operates on the Verizon system. I don't get good service from my present T-Mobile carrier, so experimented with another Verizon MVNO. At my location, AT&T has a slight edge on coverage. Twigby won't help me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Kirk",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T22:08:50.000Z",
          "Titre": "I was thinking with the Verizon…",
          "Contenu": "I was thinking with the Verizon platform my audio quality would be superb but I have issues with call quality with my parents in TN and some others saying they cannot hear me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dan Austin",
          "Nb_Reviews": 1,
          "Date": "2022-11-01T17:09:16.000Z",
          "Titre": "Good for simple talk and text, not so much for data.",
          "Contenu": "Very low pricing, though phone was a little expensive, for the features you get. Very simple, easy-to-understand: Products, Plans, etc. A little slow on shipping for my taste, and data seems a little un-reachable/usable, when I am inside city limits? Which I don't understand, since this happens, even when I am on a Restaurant's wifi? Other network Carriers, didn't have this problem with my comparably-priced competitor phone(s). I'd say ok for someone needing just bare phone/text, and not reliable data."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ed Hayhurst",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T05:13:22.000Z",
          "Titre": "NEED AN INSTRUCTION BOOK ON HOW TO USE…",
          "Contenu": "NEED AN INSTRUCTION BOOK ON HOW TO USE THE PHONE."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sheila Gustafson",
          "Nb_Reviews": 1,
          "Date": "2022-11-04T20:00:09.000Z",
          "Titre": "Value for cost",
          "Contenu": "Took almost 72 hours to set up and the connection is occasionally spotty or slow. That said, it works ok and is fine for a low cost service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Don Flake",
          "Nb_Reviews": 2,
          "Date": "2022-09-23T22:05:14.000Z",
          "Titre": "i tried to tell u i had not recieved my…",
          "Contenu": "i tried to tell u i had not recieved my sim a number of times. finally u r sending me a replacement sim. now it was not ur faught i dont think . the u.s,mail probably dilivered it to the wrong address . but not my faught either. but u charged me 10 dollars  to another sim. r also charging me from the time i paid . r r u waitingb till im start using??????"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steve Looney",
          "Nb_Reviews": 1,
          "Date": "2022-11-05T03:07:36.000Z",
          "Titre": "New, but happy",
          "Contenu": "I have only had a Twigby account for a month but has been good so far. My sim card was received in just 2 days. Thank you."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2022-09-20T15:56:12.000Z",
          "Titre": "Good online support",
          "Contenu": "Good online support.  My phone seems to lose connection with the network fairly often and needs re-booting.  It also seems that you keep raising your prices, so I am not sure how long I will stay after this promotional rate."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gary Guenther",
          "Nb_Reviews": 1,
          "Date": "2022-08-29T19:20:10.000Z",
          "Titre": "Reality did not meet expectation",
          "Contenu": "The screen said to reboot the phone and receive installation info.  I received NOTHING. The phone became functional but I was not even given my number -- that came in an email.  I was left not even knowing anything had happened at all.  Very disappointing.  For me, that was a FAIL. I contacted your chat and got NO HELP.  The chat was worthless.  Your rep just told me \"that's the way it is\" regardless of what your screen promised.  Booo Twigby.  FAIL. I don't give an even lower rating because the phone does work, after I figured it all out for myself."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JOHN KRAUSE",
          "Nb_Reviews": 1,
          "Date": "2022-08-15T23:49:52.000Z",
          "Titre": "I felt the set up instructions where inadequate.",
          "Contenu": "I bought replacement Samsung phone for iPhone 6 that had a failing battery that was overheating within a few minutes of turning the phone on. I felt the instructions for setting up the new Samsung were barely adequate, and left many confusing details for me to figure out. And it was stressful. The iPhone 6 was still active and the texts went to iPhone for one day and did not go to new Samsung purchased to replace iPhone for the SAME phone number."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "RNJ",
          "Nb_Reviews": 1,
          "Date": "2022-08-13T02:46:22.000Z",
          "Titre": "Frustrating",
          "Contenu": "Yes, TWIGBY has great prices, but I think it really lost something that is vital to a communication company…customer service. I’ve found it extremely frustrating to contact them when there Is no phone number and I can’t “chat” because my problem is I got locked  of the website!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Phillip Jones",
          "Nb_Reviews": 1,
          "Date": "2022-08-14T16:58:51.000Z",
          "Titre": "I got a phone that never did work",
          "Contenu": "I got a phone that never did work, spent lots of time with their customer service, still can’t get it to work. Sending it back for my refund. I wasted a lot of my time for nothing & wish I had never tried it. I will stick to Verizon, cheaper is not usually better."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Erica Martini",
          "Nb_Reviews": 1,
          "Date": "2022-09-27T20:24:59.000Z",
          "Titre": "Never worked for me",
          "Contenu": "I could never get this to work with my phone for whatever reason. I'm going to have to cancel. Giving 3 stars because the customer service is good, they really did try to help."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jerry P",
          "Nb_Reviews": 1,
          "Date": "2022-08-02T00:58:27.000Z",
          "Titre": "good phone, terrible getting it authorized",
          "Contenu": "I recently got a replacement phone [which is good] and I kept my old phone number. Getting it authenticated was a (totally unnecessary) frustrating, enraging experience.  Twigby put a SIM in the phone - they knew the IMEID, they knew the sim card number.  After hours of annoying wasted time, I found I just needed to supply those numbers WHICH THEY ALREADY KNEW AND SHOULD HAVE JUST FILLED THEM IN.  They would be wise to improve the program - and then they could boast about their simple easy changeover to a replacement phone."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patrick Fisher",
          "Nb_Reviews": 7,
          "Date": "2022-06-19T02:37:56.000Z",
          "Titre": "The Twigby cellular service is mediocre at best.",
          "Contenu": "The Twigby cellular service is mediocre at best.  The service is great while I'm at home however as soon as I travel the service is unavailable.  I was only able to receive 2 phone calls after being hospitalized and had to use text messages to communicate.  I will cancel Twigby as soon as my month expires and if you're considering switching to Twigby I strongly suggest you find a different provider."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Troy Seeds",
          "Nb_Reviews": 1,
          "Date": "2022-07-21T18:13:55.000Z",
          "Titre": "Customer service was great when we…",
          "Contenu": "Customer service was great when we needed it but the phone service and/or phone isn't behaving like I think it should. Lot's of times where texts & phone calls couldn't go through. This phone is my daughter's. I need to be able to get a hold of her & her I."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carol Bish",
          "Nb_Reviews": 2,
          "Date": "2022-07-09T02:54:48.000Z",
          "Titre": "Not having someone to talk to when I…",
          "Contenu": "Not having someone to talk to when I got confused was a bit frustrating.  I didn't realize I still had an account with you since I canceled it in 2018. I was looking to get a phone and service for someone else and the computer apparently had me using my account.  Very confusing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mary G.",
          "Nb_Reviews": 2,
          "Date": "2022-05-28T01:38:27.000Z",
          "Titre": "You can't directly call numbers abroad!",
          "Contenu": "I bought the 10G with unlimited calls plan. Their 5G Internet speed is amazing. However, coverage isn't, specially when you need to make our receive a call, but that's almost as good as I had with another service provider. The worst of my experience using Twigby is when calling abroad, there's is no way to dial directly, first you need to dial a number in Texas and then you dial the number you want to call, totally inconvenient."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2022-05-27T03:57:56.000Z",
          "Titre": "High hopes",
          "Contenu": "I really like the service overall and appreciate the prices but last month when I went over my internet plan and then called in and paid for more i didn't receive more. I'm out that money and didn't have internet until my new month kicked in. I don't know if this was a mistake or if it is a way to get your money on the back end but it was a great inconvenience for me. If it ever happens again I will just switch back to Verizon and pay the extra money for the flawless service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Iris Benton",
          "Nb_Reviews": 1,
          "Date": "2022-09-25T01:34:36.000Z",
          "Titre": "Signing up was not as easy process.",
          "Contenu": "Signing up was not as easy process.The flip phone my husband purchased has a minimal 17 page of instructions and unable to get a more complete manual."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brandan Smith",
          "Nb_Reviews": 2,
          "Date": "2022-10-14T11:07:59.000Z",
          "Titre": "Three cheers for twigby not five.",
          "Contenu": "#1Usually, when I have a problem the first thing I do before talking to Twigby is I provide my information that’s necessary and I ask the specific question that I need answered. What happens next as I get a few more questions from customer service that don’t seem to have anything to do with what I’m asking. I get answers they don’t seem to have anything to do with what I’m asking again. Who knows how long this goes on 20 minutes or longer. After getting more and more and more and more specific or just plain, repeating myself, I finally get a straight answer, and then I can get on with my life that’s not a good thing. #2The worst thing is that there’s no Wi-Fi calling. That just doesn’t make any sense to me - I don’t get it.#3 I give ⭐️⭐️⭐️ stars because otherwise it is affordable if you can afford to buy the phone which is possible now thanks to PayPal; thank you for that. #4Thank you for the affordable service despite some frustrations. I’ve been with Twigby since 2019. If I could find a better carrier, I would leave Twigby! I’m still l👀king. 👍👍"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rosella Royer",
          "Nb_Reviews": 7,
          "Date": "2022-05-26T22:16:52.000Z",
          "Titre": "The phone service has been acceptable…",
          "Contenu": "The phone service has been acceptable so far.  The phone its' self leaves a lot to be desired.  In an effort to be totally different from other service companies phones they have made it extremely difficult and time consuming to navigate through the options/menu"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kris Hunter",
          "Nb_Reviews": 1,
          "Date": "2022-06-08T20:44:19.000Z",
          "Titre": "I had to enter my IMEI number 9 times…",
          "Contenu": "I had to enter my Indian number 9 times before it finally let me off the loop.  I paid for 3-5 day business days shipping, I will be interested to see how long it takes to get here.  Not having a customer service call center is a big point against."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joan",
          "Nb_Reviews": 2,
          "Date": "2022-08-13T02:24:32.000Z",
          "Titre": "I lost my phone as was hoping Twigby…",
          "Contenu": "I lost my phone as was hoping Twigby could 1) help locate it via GPS, 2) recover my contacts, and 3) burn the phone to make it unusable, but you couldn't do any of that."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brandan Smith",
          "Nb_Reviews": 2,
          "Date": "2022-08-10T23:17:09.000Z",
          "Titre": "Was better before they went to Verizon…",
          "Contenu": "Was better before they went to Verizon now I have a hard time sometimes with signal. Wi-Fi calling would be great if they would offer it. Other than that it's all right."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kathryn Briant",
          "Nb_Reviews": 1,
          "Date": "2022-08-10T21:19:23.000Z",
          "Titre": "Not enough coverage at my home.",
          "Contenu": "I thought I would have great coverage with Twigby since they use Verison towers. Sadly I only get one, sometimes two dots of coverage at my house and at the grocery store."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sherri McNary",
          "Nb_Reviews": 1,
          "Date": "2023-03-17T00:54:47.000Z",
          "Titre": "I am having a lot of trouble with…",
          "Contenu": "I am having a lot of trouble with dropped calls."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Damon Harries",
          "Nb_Reviews": 2,
          "Date": "2022-08-12T07:57:36.000Z",
          "Titre": "I purchased a Moto G phone",
          "Contenu": "I purchased a Moto G phone. I liked the phone, but it's a little bit too technical for me. I will wind up trading it in for a different phone asap."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gerald",
          "Nb_Reviews": 4,
          "Date": "2022-05-25T19:36:33.000Z",
          "Titre": "Disappointed no wifi calling",
          "Contenu": "Your info I read said wifi calling is included. After I transferred they told that was your old carrier. I need wifi calling for areas with bad service and when traveling out of country."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kristi Brugman",
          "Nb_Reviews": 1,
          "Date": "2022-05-25T23:59:49.000Z",
          "Titre": "The price was good",
          "Contenu": "The price was good, but I was looking for a very simple basic cell phone for my mom who has dementia. Even your \"basic\" phone is complicated to use!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DEAN",
          "Nb_Reviews": 3,
          "Date": "2023-01-24T21:38:22.000Z",
          "Titre": "No WiFi connection"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "NLap",
          "Nb_Reviews": 1,
          "Date": "2022-08-18T16:15:00.000Z",
          "Titre": "Ordering was easy- phone never lasts…",
          "Contenu": "Ordering was easy- phone never lasts more than a year/ this will be the last phone purchased"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "BRAD ANDERSON",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T17:13:20.000Z",
          "Titre": "Price is good",
          "Contenu": "Price is good.  Service is spotty at times"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Melissa",
          "Nb_Reviews": 1,
          "Date": "2022-06-24T17:03:21.000Z",
          "Titre": "Pleased with the service, not the shipping speed",
          "Contenu": "Switching to Twigby from my previous provider was quick and easy.  Customer service was very helpful when I had a small issue (it was me, not Twigby).  Cell service has been better than what I had, but with no increase in price.  The reason Twigby did not get 5 stars was because of the shipping.  I ordered on a Saturday and paid $18.50 for the fastest shipping.  My SIM card did not arrive until Thursday.  I think it would have arrived the same time if I had chosen the slowest shipping since it was just by USPS and came from TN to SC.  I'm really disappointed I paid the extra shipping fee for no real benefit.  Maybe not specifically Twigby's fault, but they could have been more forthcoming about who they used to provide their shipping.  It may have changed my mind. I was especially desperate because my phone was not working well with my previous provider and I was missing a lot of important texts.UPDATE:  Ordered a SIM card for my son the Saturday after I received mine.  I went with the free shipping and it took only one day longer to arrive than mine did when I paid for fastest shipping.  And that day could be accounted for by the federal holiday on that Monday.  So, do NOT pay for the expedited shipping.  It was a total waste of $18.50."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "frank ballard",
          "Nb_Reviews": 1,
          "Date": "2022-08-26T02:44:22.000Z",
          "Titre": "Verizon towers i only got one bar to…",
          "Contenu": "Verizon towers i only got one bar to none, and twigby did not have wifi"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lig",
          "Nb_Reviews": 1,
          "Date": "2022-05-25T20:46:38.000Z",
          "Titre": "Hotspot?",
          "Contenu": "I still can’t use my phone as a hotspot. The chat said twigby does support this feature."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "K M",
          "Nb_Reviews": 1,
          "Date": "2022-05-26T23:19:58.000Z",
          "Titre": "average",
          "Contenu": "average; after promo period look for other carrier otherwise Verizon network is great."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Julia Ottley",
          "Nb_Reviews": 1,
          "Date": "2022-06-03T12:49:35.000Z",
          "Titre": "The services can be weak at times and…",
          "Contenu": "The services can be weak at times and calls are dropped ."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Linda Christensen",
          "Nb_Reviews": 3,
          "Date": "2022-07-14T18:52:01.000Z",
          "Titre": "Mixed results with customer service",
          "Contenu": "I just started service transition went relatively smoothly.  Detailed instructions need chat.  I have service and voicemail right now.  I gave 3 stars due to 1. A misunderstanding via chat that cost me some $ (Unlike Mint, you cannot insert a trial sim or use your Twigby sim on a trial basis without discontinuing your old service and losing your number.  Must go through full activation and port number.)  2. As a result of #1, I did not receive the full 50% discount promotion I signed up for.  Because I actually transferred my phone number, they will now give me the additional 25% discount on my plan but will not refund proportionate taxes and fees.  That brings me to #3.  Twigby's e.g., $15 plan is nearly $2.50 (in my county) more expensive than my former $15 RedPocket plan because Twigby charges administrative fees that are not specifically disclosed out front and are on top of the usual taxes and fees.  Also, they will refuse to give exact quotes including taxes and fees out front.  Their generic $3.50 quote significantly undershot my actual charges, which significantly overshot taxes and fees for my old plan.  I had to badger a rep to get a real breakdown of my actual statement charges (which is how I know about the admin fees).  I will give them a full trial of at least 6 months, barring other problems, but I am not inclined to do business with a company that is secretive about what they actually charge me.  Also, not refunding my overpaid taxes and fees is, I think, not legal.  I chatted with Scotty and Leah about the tax & fee issue.  Apart from the above, chat service was fast, reasonably polite and responsive.  As usual, you are stuck with the limitations of their training and knowledge and may need to ask the same question multiple times or ask for more detail when they give instructions.  No one offered to connect with a supervisor regarding my issues, so I don't know what would happen if, as with my last service, I am left without service or some other major issue.  We'll see.  Caveat emptor."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chris Harms",
          "Nb_Reviews": 4,
          "Date": "2022-08-11T22:51:37.000Z",
          "Titre": "what did you do is the question..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charles A Bender Jr",
          "Nb_Reviews": 1,
          "Date": "2022-05-27T21:46:15.000Z",
          "Titre": "Service is still not as good as Verizon!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mario Kessels",
          "Nb_Reviews": 1,
          "Date": "2022-09-01T19:36:23.000Z",
          "Titre": "Not enough 5G in my area"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "sam c",
          "Nb_Reviews": 1,
          "Date": "2022-06-29T15:04:40.000Z",
          "Titre": "Took to long to receive SIM card."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JAB",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T16:56:57.000Z",
          "Titre": "Website is nice and simple",
          "Contenu": "Website is nice and simple, but we also use Tello and their site is a lot more simple.Coming from Verizon I can say both sites are 10 times more easy to navigate than Verizon"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Candy",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T13:31:40.000Z",
          "Titre": "Almost 100% pleased",
          "Contenu": "Your price is fantastic and I shall be recommending Twigby to friends. Your customer service representative I spoke with was so very patient with me helping me eject my old SIM card and inserting the new one. (I’m a senior citizen and very much a non-techie). But I’ve noticed that since switching to Twigby sometime my call gets dropped after being on the phone less than 10 minutes or so. After reconnecting then all is well for the rest of my conversation. Overall very happy I switched,"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carolyn",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T20:23:40.000Z",
          "Titre": "Twigby no service clitch?",
          "Contenu": "I use Twigby for my mobile service. My husband uses another provider similar to Twigby. We both are on the Verizon network. We live in a rural area in Arizona. One Friday in August my phone experienced a 1-2 hour period of no service while my husband's phone worked flawlessly. Any explanation?Other than that single incident, my service has been fine."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paula Olson FatGrandmaFinds",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T18:30:45.000Z",
          "Titre": "Customer service was very helpful",
          "Contenu": "Customer service was very helpful. Their billing can be wonky when you first start out but it gets worked out if you contact them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rob Fall",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T20:41:32.000Z",
          "Titre": "Customer service is great",
          "Contenu": "Customer service is great. I have only had 1 rep that had no idea what was going on or how to solve the issue. All the others are VERY knowledgeable!! Only other is is when you run out of \"high speed data\" it drops to the speed of old 2g service. Less than 1by1mbps. Can't even track my kids phones on that speed. BUT the unlimited is $35 and gives 20gb of \"high speed data\" whether your on 4g LTE or 5G. Other than that it works well on Verizon network. If they could just up their \"low speed data\" to 3g speeds it would be the best and the cheapest (least expensive) on the market."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Annette Whited",
          "Nb_Reviews": 1,
          "Date": "2023-01-27T22:38:53.000Z",
          "Titre": "Pretty easy to switch services",
          "Contenu": "Pretty easy to switch services, & so far coverage area is good.  Only hitch was more from our previous provider who seemed to have trouble porting one prepaid number.  I chose Twigby data plans for each phone that should have been enough for each user based on our usage the previous 3 months, but for some reason on Twigby we ran out of data before the month was up."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ariel K",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T19:12:49.000Z",
          "Titre": "Easy to order, but shipping was delayed",
          "Contenu": "Ordering my sim card was very easy and straight forward. However, I paid for express shipping for the sim to arrive in 2-3 days, and it took 7 days to arrive which created some difficult situations."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "SuperSoul",
          "Nb_Reviews": 1,
          "Date": "2023-02-03T00:29:12.000Z",
          "Titre": "I make a couple of calls and texts a…",
          "Contenu": "I make a couple of calls and texts a week and needed a reliable and value for money carrier operating on the Verizon network. Twigby fits the bill perfectly. Service since signing up four months ago has been excellent.A point was deducted only because they allocated me an old number belonging to a guy named \"Brad\" and 99.9% of incoming calls are spam. I'm not paying extra for an app to filter calls, so this has caused me - and continues to cause me - a lot of grief."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "argyre",
          "Nb_Reviews": 2,
          "Date": "2023-01-03T21:59:14.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "Great Customer Service  -- chat service works wonderfully  -- Really helpful and waited on chat until port from old company was completed -- and this took approx an hour to do.   Only downside is that they do not offer WiFi calling.  This would help in homes w/o great signal strength."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Frank Valliant",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T22:04:49.000Z",
          "Titre": "How easy it is to transfer to Twigby from your current carrier.",
          "Contenu": "The sign-up process for Twigby was straightforward, and Sim card came quickly thru the mail.  I have limited use with the phone as a hot spot (although that is the main reason in choosing Twigby.  Next month we will be taking a long trip and will know how effective the reception will be, and how much data I will use.  If OK, I'll probably post with 5 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Deborah Vinopal",
          "Nb_Reviews": 1,
          "Date": "2023-06-17T00:16:12.000Z",
          "Titre": "Ordered a replacement phone thru…",
          "Contenu": "Ordered a replacement phone thru customer service. Fast and polite to work with.  Phones are reasonably priced, service is reasonably priced and functions same as any other carrier. Very pleased with Twigby! Highly recommend."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "KEESHOND LOVER",
          "Nb_Reviews": 7,
          "Date": "2023-03-28T20:55:04.000Z",
          "Titre": "Twigby is a good value…",
          "Contenu": "Great price and signal has been excellent. The only hiccup was that for several days, I could not get automated texts. Supposedly, Verizon was blocking the texts until they entered my phone number into their database. ?? It meant I couldn't logon to several accounts that had double verification. Other than that, Twigby has been excellent. The customer service staff dug into the issue I was having, and I received an answer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John John",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T20:20:51.000Z",
          "Titre": "Items received as ordered",
          "Contenu": "Items received as ordered.  A little disappointed because delivery was a little slower than hoped after I paid for expedited.Switching carriers to Twigby was a little harder than planned but not real bad.Service is really good and even displays as Verizon.  So far very happy we made the switch!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Schecterson",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T23:24:27.000Z",
          "Titre": "Real Customer Service",
          "Contenu": "If it's one lesson in life I've learned, my dad used to say \"Get a guarantee\". Twigby honored their 30 day guarantee today when I received a refund for the phone I returned. Additionally, their customer service is excellent and has gone above and beyond my expectations. It's always a pleasure to chat with any number of advisors to answer my questions. Everyone has been professional, knowledgeable, friendly, and sometimes showing a good sense of humor. I'm saving $60 bucks a month for 2 lines compared to the big 'V', and the cell phone service is better. No hidden costs or extra charges. I deducted one star because they don't have wifi calling which would be helpful in my rural, mountainous area. But I can live without it. Bottom line...Twigby service is affordable, reliable, accessable, and most importantly hassle free."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Moto Diva",
          "Nb_Reviews": 1,
          "Date": "2023-01-02T16:06:47.000Z",
          "Titre": "Wi-Fi calling is a must to gain 5 stars",
          "Contenu": "Switching to Twigby looked perfect until it wasn't. (We rely on making Wi-Fi calls at home.) Frantically, we texted Twigby to cancel our switch. They made this happen efficiently and with understanding."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Don Beekman",
          "Nb_Reviews": 1,
          "Date": "2022-11-22T19:32:14.000Z",
          "Titre": "The initial sign up seemed very complicated.",
          "Contenu": "The initial sign up seemed very complicated, I had to run through it at least 6 times to complete. The customer service chat people were helpful but still it wasn't easy to do. I am very happy with the actual phone service. Uses Verizon network, reliable and inexpensive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Emmanuel",
          "Nb_Reviews": 1,
          "Date": "2023-01-26T19:31:09.000Z",
          "Titre": "Great service overall",
          "Contenu": "Great service overall. We get reception mostly everywhere fine. We just don't get service in some buildings in our area. Very important as those buildings include our place of work."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Pethick",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T17:04:28.000Z",
          "Titre": "Everything went well after a small…",
          "Contenu": "Everything went well after a small glitch in changing to a new phone. Both lines on account were changed to the new phone type for some reason, shutting down my wife's number until it was corrected."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "jojo",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T20:10:35.000Z",
          "Titre": "low price and good customer service…",
          "Contenu": "low price and good customer service through the online chat.  the coverage isn't as good as I hoped, but I think that's because of changes to verizon coverage."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lila",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T17:37:27.000Z",
          "Titre": "Service issues",
          "Contenu": "I have some difficulty with service in my office. I work in town, in a metal building. Somehow, one side of the building is worse for reception of phone calls. No voices can be heard even when the phone rings. Texting, though does work."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brenda Medley",
          "Nb_Reviews": 2,
          "Date": "2023-03-17T21:05:22.000Z",
          "Titre": "I really wanted to love it and do love it",
          "Contenu": "I really wanted to love it, and for the most part I do!! But I never received the first sim I ordered, I did contact customer support and they were extremely helpful, knowledgeable, and quick. He shipped me another sim and even expedited the shipping for free and it arrived 2 days later. They have an amazing customer support team! However I live in Mississippi and I can make and receive calls and texts, but I cannot use my mobile data too much, it is extremely slow. I imagine it may be because of my location in the country. But I really do recommend them, it's cheap, it works beautifully in the city and even some rural areas. unfortunately I'm having to cancel my Twigby and go with Metro. I still would recommend Twigby to everyone I know!!!!!  I only rated 4 stars only because my mobile data is so slow and laggy, but I believe it's only because of my rural location. Other than that everything is awesome and the customer support team is wonderful, you can tell they care about their customers!!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve M",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T17:45:54.000Z",
          "Titre": "Chat-only customer service, but low rates",
          "Contenu": "As long as you are comfortable with chat-only customer service, Twigby works well. The price is right and it uses the Verizon network, which is the best in my region."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Debbie",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T13:39:21.000Z",
          "Titre": "Great customer service,  but just one thing…",
          "Contenu": "Great customer service and so far, the cell service has been just like before when my provider was Verizon. Would have given 5 stars except for process of unlocking my phone with Verizon before transferring my number over to Twigby. I made the mistake of activating and received a porting issue error note. Spent 30+ minutes with Verizon customer service after my account was suspended with them to request my phone be unlocked. They eventually obliged but had to wait awhile. Twigby could help by emphasizing the importance of unlocking your phone with the previous carrier BEFORE trying to activate new service with them. I’m sure I am not the only one who missed this step in the process!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Todd",
          "Nb_Reviews": 2,
          "Date": "2023-01-20T21:25:21.000Z",
          "Titre": "Great service",
          "Contenu": "It’s a great service although there is no service where I live it works all around me. My only gripe, I live on disability and the easy pay plan through pay pal has the payments due too fast. My next is due on January 29th 5 days before I get paid. I’m still trying to figure it out."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kandy Hamel",
          "Nb_Reviews": 1,
          "Date": "2023-07-17T14:42:50.000Z",
          "Titre": "The price is awesome and service good...",
          "Contenu": "Update- Travelled from N. Carolina to Wisconsin and never lost service which surprised me.  Very happy with Twigby and the significantly lower price than Verizon.  Thanks so much!  Customer service has been excellent minus the one glitch mentioned below. upgraded rating from 3-4:) What made me bring rating down is that I did not see you all sent me a $20 discount email if I signed up.  I did not see it until right after I signed up and when I chatted to ask if I could still receive it I was told NO.  If you offer it and it is before your first 30 days is up, you should still honor it.  The set up person I chatted with was great and very patient while I talked with Verizon.The last person I chatted with about bad LTE service told me to reboot my phone.  Not quite sure how he thought rebooting my phone was going to keep him in the chat.  Obviously when I rebooted the chat had been dumped. I am still on the fence about keeping service.  I will know in about two weeks.  The trial will be keeping service while on a 17 hour road trip.  Never had a problem on Verizon so we will see"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Randi Domino",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T04:17:29.000Z",
          "Titre": "Terrific service",
          "Contenu": "Terrific service. No dropped calls. Always great reception. Price just right. What's not to like!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "April Manno",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T20:33:40.000Z",
          "Titre": "We are very thankful that this new…",
          "Contenu": "We are very thankful that this new service allows us to have much better coverage than our last service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Martin Skalski",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T00:09:25.000Z",
          "Titre": "Visual Voicemail doesn't work with Twigby",
          "Contenu": "Visual Voicemail doesn't work with Twigby.  You can change that and make it easier for me to get and listen to may voicemails."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daralynn Gilliam",
          "Nb_Reviews": 3,
          "Date": "2023-07-10T05:10:53.000Z",
          "Titre": "I only gave 4 stars because I am a new…",
          "Contenu": "I only gave 4 stars because I am a new customer. So far so good. Anytime I have needed help someone in the chat has helped me . When I set up the phone I had a very patient customer service rep."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jerry Wyatt",
          "Nb_Reviews": 1,
          "Date": "2023-01-09T19:54:09.000Z",
          "Titre": "I’m still waiting on a message about a…",
          "Contenu": "I’m still waiting on a message about a phone I returned to see how they handled that before I can really say just how good they really are"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 2,
          "Date": "2023-08-04T23:37:29.000Z",
          "Titre": "Simple account creation",
          "Contenu": "Simple account creation.  Pain in process of migration was all induced by the carrier I was leaving."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sandra B",
          "Nb_Reviews": 24,
          "Date": "2023-07-14T17:20:37.000Z",
          "Titre": "I love Twigby",
          "Contenu": "I love Twigby, but this last time I went to order a new phone, I found it very difficult.  I had to get on chat several times to work my way through it.  Gave up once and decided to try again the next day.  Used to be so easy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Susie Watson",
          "Nb_Reviews": 2,
          "Date": "2023-02-23T22:14:13.000Z",
          "Titre": "No wifi calling",
          "Contenu": "Tyvm!Customer service has been helpful...jus disappointed in coverage at home esp with no wifi calling."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Hollifield",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T23:34:26.000Z",
          "Titre": "My experience with Twigby was good",
          "Contenu": "My experience with Twigby was good.  I only left because my phone died and I went with a different carrier."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "D. Richards",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T21:47:59.000Z",
          "Titre": "No reasonably priced Android 13 Phones",
          "Contenu": "No reasonably priced Android 13 Phones. Coverage map is not localized to areas of operation, just the USA map."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Smith",
          "Nb_Reviews": 1,
          "Date": "2023-01-20T02:39:53.000Z",
          "Titre": "Pretty good service I have had no…",
          "Contenu": "Pretty good service I have had no service in a couple places I’ve been but over all I’m satisfied"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vicki Reeve",
          "Nb_Reviews": 1,
          "Date": "2022-11-28T16:14:28.000Z",
          "Titre": "Received SIM card finally!",
          "Contenu": "I still have not received my SIM card!  I have been waiting 21 days!  I let Twiggy know & another card was sent out November 3rd.  Still waitingUpdate-Finally received SIM card - Kudos to Twigby. However, followed instructions carefully and card would not activate. I was told to reset my phone, which I wouldn’t do. Later got on a chat and got someone who knew immediately what was wrong. She activated the SIM card at her end and the phone number was activated immediately. Great service finally!!!  Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Margaret Gormley",
          "Nb_Reviews": 1,
          "Date": "2022-11-18T18:25:47.000Z",
          "Titre": "Good so far",
          "Contenu": "I haven't had Twigby very long. So haven't tested it traveling but it have had no troubles so far.Hopefully they will add Wifi calling and roaming soon."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joshua Fleming",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T03:12:23.000Z",
          "Titre": "It just works",
          "Contenu": "It just works. Don't have to worry about anything. So far, I haven't experienced any issues."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kathy Carney",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T01:20:23.000Z",
          "Titre": "Signup and transfer went smoothly and…",
          "Contenu": "Signup and transfer went smoothly and fast. EXCELLENT SERVICE SO FAR!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "bruce samuelson",
          "Nb_Reviews": 1,
          "Date": "2023-01-21T07:15:28.000Z",
          "Titre": "Chat in Two",
          "Contenu": "Chat people tried to get my two lines working.  One did. The second did not.  After two days, a chat person found a step missing at the Twigby end and I am connected now."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joseph",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T17:21:44.000Z",
          "Titre": "Newby impressed",
          "Contenu": "After a couple of weeks I am impressed with coverage and speed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chantalr",
          "Nb_Reviews": 3,
          "Date": "2022-10-26T14:26:10.000Z",
          "Titre": "Purchase and setup was fairly smooth…",
          "Contenu": "Purchase and setup was fairly smooth and quick. I've just encountered a strange issue where I can no longer receive SMS notifications from Duo Push, which I contacted Twigby about and have no resolution. I also tried sending an MMS text and it failed. Otherwise, it's been a good experience so far (a few weeks in)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AV",
          "Nb_Reviews": 2,
          "Date": "2022-11-19T01:30:33.000Z",
          "Titre": "It is reasonably priced and perfect…",
          "Contenu": "It is reasonably priced and perfect plan for my son’s first phone."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Whatley",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T06:12:54.000Z",
          "Titre": "Simple and easy",
          "Contenu": "Moving over to Twigby was smooth and simple.  So far the service has been just fine."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alan Mitford",
          "Nb_Reviews": 1,
          "Date": "2022-12-08T02:13:40.000Z",
          "Titre": "Took a little while to get my order in",
          "Contenu": "Took a little while to get my order in, but as well following."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karen E.",
          "Nb_Reviews": 1,
          "Date": "2022-10-19T03:35:23.000Z",
          "Titre": "A Review",
          "Contenu": "Twigby, please give the customer the choice of buying more than one extra GB. Perhaps offered with a tiered cost incentive. The one extra GB is a major usage problem currently when someone buys more than one. I speak from frustrating experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ron N.",
          "Nb_Reviews": 1,
          "Date": "2022-10-07T02:39:22.000Z",
          "Titre": "Great service!",
          "Contenu": "I was going to write a review and I had a Dropped call. Also a couple times no service within close proximity of WIFI. Believe part of problem being more devices recently accessing router. I  NEVER give full 5 star reviews on anything, so 4 is very good. Satisfied with first month's service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Cohen",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T02:08:34.000Z",
          "Titre": "The customer service chats work well",
          "Contenu": "The customer service chats work well. Setup was easy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "FRANKLIN EDWARDS",
          "Nb_Reviews": 1,
          "Date": "2022-09-21T15:39:51.000Z",
          "Titre": "Pretty good customer service…",
          "Contenu": "Pretty good customer service experience. The only bad thing was that the LG V20 phone I was trying to use was considered obsolete by Verizon, so getting it to register never happened, no matter what was tried during the port process. I had to go out the next day and buy another unlocked phone that would work before completing the port."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Margaret C",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T14:20:19.000Z",
          "Titre": "I love the price for the service I am…",
          "Contenu": "I love the price for the service I am receiving."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Keith Williams",
          "Nb_Reviews": 1,
          "Date": "2022-09-17T01:03:08.000Z",
          "Titre": "From a short time Twigby user . . .",
          "Contenu": "I've been a Twigby user for a couple of weeks now. I'm a light user of the phone service.It works as advertised. I'm satisfied. The few instances where I've had problems might not have been due to Twigby.It works far, far, better than Mint Mobile, which I tried first and who, so far, refuses to make an exception to their 7-day trial period so they can give me a refund. We'll see!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Yvonne Laurye",
          "Nb_Reviews": 1,
          "Date": "2023-03-11T20:06:49.000Z",
          "Titre": "All calling when I'm town is great",
          "Contenu": "All calling when I'm town is great, but i need wifi calling at home. When will i have this?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Corona",
          "Nb_Reviews": 1,
          "Date": "2022-09-19T17:20:34.000Z",
          "Titre": "The change over from Verizon easy",
          "Contenu": "The change over from Verizon wasn't that easy, but mainly because of the hoops I had to jump through to get Verizon to let go of my phone number.The only other comment is the increased amount of Spam I am receiving.  The phone service itself and the online chats are great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William Norquist",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T20:50:06.000Z",
          "Titre": "The phone I ordered is great",
          "Contenu": "The phone I ordered is great, but the case I ordered with it didn't fit the phone."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 2,
          "Date": "2022-09-06T22:32:29.000Z",
          "Titre": "I gave a four-star rating because one of some misinformation by an agent.",
          "Contenu": "I gave a four-star rating because one of your agents seemed to be curt during our chat time.  I stopped the chat and just followed the easy instructions on the website and all went flawlessly.We had Twigby before and I knew it was a company with good service, plans, and phones; otherwise, due to the agent's perceived rudeness, I would have gone elsewhere."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Larry Finch",
          "Nb_Reviews": 1,
          "Date": "2022-12-08T20:39:23.000Z",
          "Titre": "Easy to sign up and understand the…",
          "Contenu": "Easy to sign up and understand the pricing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rennie",
          "Nb_Reviews": 4,
          "Date": "2022-08-14T17:21:44.000Z",
          "Titre": "My husband and I are happy overall",
          "Contenu": "My husband and I are happy overall. The calls we make do cut out sometimes, but thankfully not too often. It’s a relatively good deal, but I have noticed that since moving to another state the tax charges are much higher. It does make me curious about whether there might be a better deal elsewhere, but as I said at the start, for the most part we’ve been pretty happy with the Twigby service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Frances Eddy",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T18:55:23.000Z",
          "Titre": "Some functions are not working since I…",
          "Contenu": "Some functions are not working since I changed over."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mel",
          "Nb_Reviews": 2,
          "Date": "2022-08-07T22:50:54.000Z",
          "Titre": "Great service! Good signal in rural areas!!",
          "Contenu": "So far, Twigby has been great! I have only had the service for a couple of weeks, but I have had a better signal with Twigby in some areas where my other phone service had a very poor signal and would drop my calls. I am very happy with the phone service and signal for the time I have been using it. Thanks so much for having an affordable and reliable option for phone service available!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ralph",
          "Nb_Reviews": 1,
          "Date": "2022-08-08T23:06:35.000Z",
          "Titre": "Worked fine",
          "Contenu": "I paid for rush shipping but when I received the phone on a Thursday then my previous carrier took 3 days releasing my number. I would recommend requesting the Pin from your old carrier 2 days before you get the phone, then start the porting process from Twigby 24 hours before you are supposed to get the phone. Verizon took 4 days to release my number."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Lentz",
          "Nb_Reviews": 1,
          "Date": "2022-11-13T19:18:21.000Z",
          "Titre": "Everyone was helpful with getting…",
          "Contenu": "Everyone was helpful with getting questions answered and an account set up."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cindy Alexander",
          "Nb_Reviews": 1,
          "Date": "2022-07-28T21:23:17.000Z",
          "Titre": "You guys should have a step by step…",
          "Contenu": "a step by step written instruction sheet with our new SIM cards would have helped us. We left Verizon after 10+ years, so we never had to set our phones up ourselves. Frustrating to use chat, constantly starting over with new person after timing out.We finally got a gal who was extremely knowledgeable and got us taken care in short order. New phone works great. Coverage is identical. Way cheaper. Thanks Twigby."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kenneth Stahl",
          "Nb_Reviews": 1,
          "Date": "2023-01-26T22:54:57.000Z",
          "Titre": "Ease of use",
          "Contenu": "Ease of use; chat help is quick and efficient."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 5,
          "Date": "2023-09-28T04:17:18.000Z",
          "Titre": "simple answers"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Moore",
          "Nb_Reviews": 1,
          "Date": "2022-08-12T17:58:44.000Z",
          "Titre": "I recommend Twigby",
          "Contenu": "Getting Twigby was one of my better decisions. It has saved me so much money and works as well as the expensive mobile phone companys. The only thing is that you can’t speak to a person. If you have questions you need to chat on their account."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Susie Watson",
          "Nb_Reviews": 2,
          "Date": "2023-03-07T00:27:54.000Z",
          "Titre": "Update",
          "Contenu": "Update: now have wifi calling! Tyvm twigby!😊"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sylvee Crockett",
          "Nb_Reviews": 2,
          "Date": "2022-11-14T20:42:42.000Z",
          "Titre": "looking forward to wifi calling",
          "Contenu": "looking forward to wifi calling! wish I had 4 bars MORE often!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "El Cid",
          "Nb_Reviews": 4,
          "Date": "2022-07-21T08:49:16.000Z",
          "Titre": "So far, so good!",
          "Contenu": "So far, everything as expected. Minus one star for no after hours chat support. During business hours, the chat room helped guide me through a couple of glitches on transferring my second phone. Now, all is well, and I cannot tell the difference between Verizon and Twigby."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Hart",
          "Nb_Reviews": 1,
          "Date": "2022-06-02T04:09:04.000Z",
          "Titre": "I was told by another provider that if…",
          "Contenu": "I was told by another provider that if I switched to them I would have 5G... wrong but they were generous enough to have a money back guarantee unfortunately it was not a phone back guarantee because I traded 2 perfectly good phones in for the new ones. Long story short I was stuck with them because of the new phones. That is where you came into play. Your phone works perfectly at my location and is very affordable"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jay Stell",
          "Nb_Reviews": 4,
          "Date": "2022-11-19T18:37:35.000Z",
          "Titre": "Twiggy is a value cell plan service …",
          "Contenu": "Twiggy has really been a good switch in value cell service plan."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stacy Conners",
          "Nb_Reviews": 1,
          "Date": "2022-07-21T22:46:37.000Z",
          "Titre": "Satisfied thus far",
          "Contenu": "Had some difficulties - minor in nature - navigating Twigby's site to activate one of my accounts. Purchased 2 phones for my household, then ordered another for a relative. Managed to activate all 3 phones and am happily satisfied with the one I use daily."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tom G",
          "Nb_Reviews": 1,
          "Date": "2022-06-04T02:37:26.000Z",
          "Titre": "Problems transporting my number.",
          "Contenu": "I transported my number from Consumer Cellular. The tech support from Twigby was ok and very quick to respond. I had to contact CC after putting in my 4th transport request so they could manually accept it. CC stated my name wasn’t in the request which of course Twigby said it was. After the manual acceptance the process went smoothly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard J",
          "Nb_Reviews": 1,
          "Date": "2022-05-25T19:24:57.000Z",
          "Titre": "Less Expensive, Better Customer Service",
          "Contenu": "We were searching for a less expensive plan that gave us similar coverage and better customer service when compared to our prior carrier. Twigby made the transition easy and the service so far has been great. My only wish was that we had Wi-Fi Calling, which we learned Twigby didn't provide AFTER we signed up for service. This is why I am giving them a rating of 4 stars as this is a very common option with other providers."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anthony",
          "Nb_Reviews": 4,
          "Date": "2022-05-26T20:47:06.000Z",
          "Titre": "Great Service",
          "Contenu": "Very courteous customer service, answers to the point. I have not had issues with the calling service or dropped calls. The only thing i suggest is to change the Parking Plan policy, I was planning to go outside the country and called to Park, but they said it has to be done only from the cycle start date. Otherwise all are very good"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nancy A Plemmons",
          "Nb_Reviews": 2,
          "Date": "2022-08-05T20:02:51.000Z",
          "Titre": "I recently had an issue with a smart phone.",
          "Contenu": "I recently had an issue with a smart phone purchased from Twigby. The chat agent, Ariel, expedited shipment of a replacement phone, as it was under warranty. Since I had no printer for email return shipping label for the old phone, she had it included in the box with the new replacement. I have been a customer of Twigby for approx four years and have found the chat agents to be patient, helpful, and professional. My only problem with the chat service is that the session sometimes ends before business is completed. When I log back on, I am unable to continue where I left it. Perhaps I am not electronics savvy enough to know how to perform this task."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Honz Zondorgh",
          "Nb_Reviews": 1,
          "Date": "2022-06-16T17:33:54.000Z",
          "Titre": "From the website information",
          "Contenu": "From the website information, it was not clear to me that purchase of SIM card and transfer of service from my old cellular provider were separate and distinct.  So I had to chat with your representative to clarify that point.  I suggest you make it explicit for a new transfer customer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "C. B.",
          "Nb_Reviews": 3,
          "Date": "2022-05-26T16:46:31.000Z",
          "Titre": "It's okay",
          "Contenu": "I'm happy with the service I have and how affordable it is. I noticed however that there were some unexpected charges on my last bill that increased it more than I signed on for. It's still cheap enough but I hate hidden fees. Customer service has been helpful. The only thing I don't like is the phone I bought- Google Pixel 2XL no longer has security updates available because it's such an old version. I paid a bit to get the phone and it was even refurbished. Just a tad ghetto."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Caldwell",
          "Nb_Reviews": 1,
          "Date": "2022-10-07T22:37:19.000Z",
          "Titre": "So far…",
          "Contenu": "So far,  everything has gone well. It’s unusual making such a purchase sans human interaction.  The ability to ask questions would be a plus."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2022-06-09T22:01:15.000Z",
          "Titre": "Not what i had hoped for",
          "Contenu": "Not able to port my number to my phone, so I had to wait a week and buy a new phone. In a desparate situation and thought this would be the answer. Time will tell. Still waiting on the phone and it will not get here in time, even though I paid for the fastest shipping."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JERRY BULLABOY",
          "Nb_Reviews": 1,
          "Date": "2022-11-09T00:40:57.000Z",
          "Titre": "Twigby is working great for me in NC",
          "Contenu": "Twigby is working great for me in NC. Cut my AT&T bill by 75% !!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 5,
          "Date": "2022-07-20T14:18:24.000Z",
          "Titre": "quick shipping",
          "Contenu": "quick shipping. the phone is low quality - but for no good reason, all current flip phones are cheap and low grade. service so far is good. I wish twigby new more about how to use the phone when I have tech questions"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Fred P.",
          "Nb_Reviews": 2,
          "Date": "2022-08-10T22:26:28.000Z",
          "Titre": "Twigby has been good all around",
          "Contenu": "Twigby has been good all around.  Switching to them was easy, start up went good. They have Verizon coverage which covers my areas very good.  Can't complain about them"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "sujatha",
          "Nb_Reviews": 1,
          "Date": "2022-11-27T03:19:24.000Z",
          "Titre": "good deals and coverage"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jerry Waddell",
          "Nb_Reviews": 2,
          "Date": "2022-08-12T02:31:51.000Z",
          "Titre": "I used to think Twigby was the best",
          "Contenu": "I used to think Twigby was the best, but since they switched to using Verizon, the service has been a bit slower and I was forced to not be able to use my iPhone SE 2016."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nathan MO",
          "Nb_Reviews": 1,
          "Date": "2022-07-10T04:56:18.000Z",
          "Titre": "Bad SIM card, but phone replaced",
          "Contenu": "Twigby sent us the iPhone SE and it had a SIM card but the card did not work.  They sent us another phone and now we are sending the first phone back.  Except for that hiccup, so far so good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 6,
          "Date": "2022-09-22T23:04:18.000Z",
          "Titre": "Uses Verizon network. Switch is easy.",
          "Contenu": "The only thing that was lacking was sim card download. Had to get one mailed, but that might be an I Phone thing. Switch was easy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eric Schierl",
          "Nb_Reviews": 1,
          "Date": "2022-08-10T23:13:12.000Z",
          "Titre": "A little trouble with moving the wifes…",
          "Contenu": "A little trouble with moving the wifes number to Twigby but eventually it got figured out and the service has been fine every since. Location is Northeast Wisconsin"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cody",
          "Nb_Reviews": 1,
          "Date": "2022-07-26T00:50:37.000Z",
          "Titre": "50% off somewhat misleading",
          "Contenu": "Works great overall. The offer for 50% off the first six months is actually 25% with an application for a verizon credit card carrying a balance for the remaining 25%."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Erican GPX",
          "Nb_Reviews": 2,
          "Date": "2022-06-11T01:12:31.000Z",
          "Titre": "So far I like Twigby",
          "Contenu": "So far I like Twigby. I only wish in the future I may be able to contact customer care and talk to a live agent/or customer representative. Apart from that, I have no complaints. 😊"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rachel",
          "Nb_Reviews": 1,
          "Date": "2022-01-24T13:52:55.000Z",
          "Titre": "Switched and love it",
          "Contenu": "I switched my family from Tmobile to Twigby. Signal is much better. Bill is about 40% less a month and we don't have to have a contract. We were also able to use our phone numbers which was simpler than I imagined it would be."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steven",
          "Nb_Reviews": 1,
          "Date": "2022-08-12T17:05:47.000Z",
          "Titre": "Saves you money!",
          "Contenu": "I must say I have loved Twigby since I started the service. I am a low user of my cell phone and it has saved me a lot of money. However, I couldn't give five stars because after the switch to the Verizon network, I have had very spotty service at my home. I am not alone and neighbors that have Verizon also complain of the same thing. We are in some sort of a dead zone in Los Angeles. While Verizon's weak signal is not Twigby's fault or problem, it is inconvenient when I can't get text messages to send. I also just discovered that the plans had changed. I don't know if we were informed about it in an email, which admittedly I never look at emails but that was a surprise. The other surprise was the administrative fee. I can usually deal with anything if I know about it but I didn't know why my bill had gone up a small amount and that was why. The customer service chat has always worked well and has been very helpful. I just hope that the Verizon signal improves."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "lance m",
          "Nb_Reviews": 1,
          "Date": "2022-09-14T23:12:32.000Z",
          "Titre": "Pretty easy to get my new phone and…",
          "Contenu": "Pretty easy to get my new phone and number transferred.  The chat feature really helped me through the process."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 1,
          "Date": "2022-10-03T22:04:02.000Z",
          "Titre": "Very happy so far",
          "Contenu": "Had a bit of trouble adding 2nd line but the online support was great, Now we are very happy"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tom Watson",
          "Nb_Reviews": 1,
          "Date": "2022-08-10T21:50:13.000Z",
          "Titre": "my review",
          "Contenu": "You folks do a great job, love your service, just don't care for a lot of continued  ads or I would have marked the 5 star"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Terry Butler",
          "Nb_Reviews": 1,
          "Date": "2022-09-28T20:19:23.000Z",
          "Titre": "So far I have not used the network very…",
          "Contenu": "So far I have not used the network very much but I will update my review after some travel time"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Edgar Kinon",
          "Nb_Reviews": 1,
          "Date": "2023-03-04T21:30:11.000Z",
          "Titre": "Very good service from the email chat…",
          "Contenu": "Very good service from the email chat agents!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brad C.",
          "Nb_Reviews": 1,
          "Date": "2022-08-16T16:41:23.000Z",
          "Titre": "Big savings",
          "Contenu": "Service has extremely reliable. Savings of 40% over my previous AT&T service. Billing is a little confusing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lawrence Dean White",
          "Nb_Reviews": 1,
          "Date": "2022-06-18T17:18:36.000Z",
          "Titre": "Your website is confusing fir new…",
          "Contenu": "Your website is confusing fir new customers bring their own phone, ie you have to select order sim card twice to place the order"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carolyn E",
          "Nb_Reviews": 1,
          "Date": "2022-12-29T20:20:44.000Z",
          "Titre": "transition was easy"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cisci",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T01:50:59.000Z",
          "Titre": "Real people, real resolutions, and real fast.",
          "Contenu": "Every time I have a problem with my phone, Twigby has a real person ready to help, and quickly solves my problems.  They also allow me to choose an actually personalized plan.  PLUS, their radio towers reach more remote places in some cases than my friend's provider's radio towers do.  Good job, Twigby!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicki Havel",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T04:58:26.000Z",
          "Titre": "Great everything!",
          "Contenu": "Harry, with customer support was very helpful and very fast at answering my questions and completing an order for me that I was having issues with. That was super simple and so quick! I love Twigby's service, prices, and now, customer support!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "scott kessler",
          "Nb_Reviews": 5,
          "Date": "2023-12-21T20:08:46.000Z",
          "Titre": "customer service VERY prompt and…",
          "Contenu": "customer service VERY prompt and thorough. could not be more please with the activation process at this time"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SteveG",
          "Nb_Reviews": 3,
          "Date": "2023-12-14T18:45:28.000Z",
          "Titre": "Twigby provide great service at a good price.",
          "Contenu": "Tech support chat was very helpful. They answered my question quickly and efficiently. My wife and I have used Twigby cell phone service for several years and are very happy with their service and phones. Our phone bill went from $125 month with Verizon to $45/month with Twigby for the same service. That saves us $960 per year."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Imirol",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T19:25:46.000Z",
          "Titre": "have no data with new sim card",
          "Contenu": "Have had no cell data. The online call center fixed the problem in minutes!  If you change phones - go into your account and manually update the new information. It is not updated by the company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter F.",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T04:59:03.000Z",
          "Titre": "Glad we Switched",
          "Contenu": "We are switching our family members one at a time to Twigby. It is only working for the phones that are not esim.  The network service is great - we don't notice a difference compared to Verizon. And it costs about half as much. What really stands out though is how good the customer service is.  Each of the 3 phones I've switched have not immediately worked with the new SIM cards (i didn't know what a SIM card was when we started this). The chat feature is staffed by real people who really know what they're doing and have gotten us set up each time.  Very nice to deal with - nothing like Verizon."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "T A",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T22:22:29.000Z",
          "Titre": "Great affordable cell service.   Great cell phone service.",
          "Contenu": "Great cell phone service, answers all questions, easy to port your number in, Great directions 👍 if I can do it anyone can.   Best of all affordable. Very very pleased 😀"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "C J Griffith",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T23:47:31.000Z",
          "Titre": "Wonderful Service",
          "Contenu": "The service rep was very polite and helpful.  Most of all they were very patient with this 80 year old person"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Raymond Gallagher",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T22:41:58.000Z",
          "Titre": "Prior hours of frustration with Tracfone resolved !",
          "Contenu": "After hours and hours of frustration dealing with Tracfone Customer Service without any results, it was an absolute pleasure to work with Annie at Twigby this afternoon."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Akabosan Smith",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T19:22:28.000Z",
          "Titre": "The Twigby Agent",
          "Contenu": "The Twigby Agent, 'Annie' was remarkable in helping 'lil ole me' with my dilemma today.  Thank you Annie and all of the folks at Twigby support.  THE reason I am a customer.  I hope all you folks have the Happiest Holiday Season EVER!  GB"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ruth Dust",
          "Nb_Reviews": 3,
          "Date": "2023-12-12T16:33:32.000Z",
          "Titre": "The techs who helped answer my…",
          "Contenu": "The techs who helped answer my questions when I was considering Twigby AND those who helped my with issues when I activated my phone were fantastic!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Akabosan Smith",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T20:20:46.000Z",
          "Titre": "Jon and his crew were very proficient",
          "Contenu": "Jon and his crew were very proficient, friendly and professional while helping me today.  I am now... Re-Twigbied.  GB"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phoenix Kiernan",
          "Nb_Reviews": 3,
          "Date": "2023-11-30T23:22:49.000Z",
          "Titre": "trading phones & got great help!",
          "Contenu": "I was trading phones and could not quickly/easily find a self-directed way to do this on the website. Started a chat with Jon and he got me so far but I was called away. I reconnected my chat, with Annie, and she restarted or reset my phone line while I tried the same things as with Jon. Now my new phone works! Thank you all!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "M & H Hoke",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T23:22:09.000Z",
          "Titre": "I was skeptical that coverage would be good…",
          "Contenu": "I was skeptical that coverage would be good but I am pleasantly surprised! I live in the middle of nowhere, in the mountains where most services are just dead zones and I get 4g service at home and 5g in town! I put it to the test today driving down the mountain where there's usually NO service but I had service for about 90% of that trip. I hit 2 dead zones but they were short and service restored pretty fast! Twigby is amazing!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janice Balzer",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T17:55:20.000Z",
          "Titre": "easiest set up of phone…",
          "Contenu": "That was the easiest set up of phone service ever!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Itzo",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:59:26.000Z",
          "Titre": "Agent got right on my questions",
          "Contenu": "Agent got right on my questions. Good service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Isabel Carrillo",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T21:43:52.000Z",
          "Titre": "Annie",
          "Contenu": "Annie, was sympathetic and took care of my request very quickly. Thank you Annie 😊"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lawrence Anderson",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T20:14:39.000Z",
          "Titre": "Great service.",
          "Contenu": "Prompt, easy to understand, response to my need."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Kelly",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T22:31:34.000Z",
          "Titre": "I regret leaving Twigby for Mint…",
          "Contenu": "I regret leaving Twigby for Mint Mobile. The service and coverage is so much better with Twigby. And now, their new plans are equally priced as Mint! I'll be coming back to Twigby once my promotional period concludes. Only downside is that Twigby doesn't do international calling."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Enedina Andrews",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T23:20:17.000Z",
          "Titre": "Harry was great!",
          "Contenu": "Harry was great! He gave me a wonderful deal, I’ve only had great experiences with Twigby, very happy with the service this company provides."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Ruhoff",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T02:57:01.000Z",
          "Titre": "Twigby chat assistance is the best",
          "Contenu": "Twigby chat assistance is the best. Always quick, reliable and friendly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cynthia",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T23:26:55.000Z",
          "Titre": "Customer service is stellar",
          "Contenu": "Customer service is stellar. My data needs are not static. I have three phones and they patiently help me to chose appropriate plans for my current needs. Accomplished everything in a few minutes of chat. Fast, efficient, and budget friendly!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carl Shokes",
          "Nb_Reviews": 3,
          "Date": "2023-11-11T02:19:57.000Z",
          "Titre": "Happy Customer",
          "Contenu": "To begin with, I'm a techno idiot, and very old. i had a flip phone before my current smart phone. this rep as well as the previous one was extremely patient with me and answered all my questions. the service was fast and thorough--2 things that don't often happen at the same time. i'm a happy customer!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T21:36:39.000Z",
          "Titre": "My Chat Experience With Twigby Today",
          "Contenu": "A young man, by the name of Jon was above and beyond in his service to me as an employee of Twigby (which I have found to be THE BEST online provider of my experience since before it became WWW.  Yes, some of us were around before pictures, and the fellow who provided my service today was one of my best ever experiences since the late 90s.  Thank you, Jon.  And thank you Twigby for providing me with stellar service.  Sincerely, Michael  GB"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul S.",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T01:47:57.000Z",
          "Titre": "Annie explained my option(s) and set up…",
          "Contenu": "Annie explained my option(s) and set up a new plan for me, which I appreciate."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sama",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T01:12:14.000Z",
          "Titre": "Good service and customer service",
          "Contenu": "Good service Twigby"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stantely T.",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T00:16:50.000Z",
          "Titre": "Great cheap plan",
          "Contenu": "I have been using them for about a  year, very reliable services in Boston and  New York, If you need a cheap phone service. They are the best!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sara",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T15:33:30.000Z",
          "Titre": "Fantastic Curtious Service",
          "Contenu": "I just want to say your chat customer service has been fantastic!! Both the automated version and when I connect with a person! Very curtious, to the point to address a concern. Thank you. Very Pleasant experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda Saponka",
          "Nb_Reviews": 4,
          "Date": "2023-10-06T20:36:39.000Z",
          "Titre": "GREAT Company!  GREAT Price!  GREAT Customer Service",
          "Contenu": "We got Twigby because with our other phone company we couldn't get service where we worked.  Twigby using Verizon towers was the reason we switched.  It's Verizon without the big cost.  The customer service reps are always easy to work with, patient, kind and courteous.  GREAT COMPANY!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa Winfree",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T21:30:25.000Z",
          "Titre": "Another great Twigby experience!",
          "Contenu": "Jon was courteous and knowledgeable, helped me figure out the best deal for all 3 of our lines when all I was seeking was help on 1 line!  Thanks so much, because of reps like Jon, I recommend Twigby to everyone!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Danielle Poorman",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T21:03:24.000Z",
          "Titre": "I cannot say enough wonderful things…",
          "Contenu": "I cannot say enough wonderful things about our Twigby service. We switched over from a major carrier and Twigby helped us navigate a stressful situation and made it more pleasant. Their chat service was also wonderful in helping us set up our phones!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vincent Hubanks",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T16:50:10.000Z",
          "Titre": "Link was very informative",
          "Contenu": "Link was very informative, resourceful in continuing the chat 💬 regarding my iPhone 6s+ not being able to transmit MMS/SMS text messages to non iPhone users (iMessage usually used between iPhone owners).  He was polite and industrious in additionally looking at other plans now offered that may suit the transfer of my other iPhone over to Twigby.  Thank you Link for all your help this morning.  Best, Vincent"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Abra Cadabra",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T18:19:31.000Z",
          "Titre": "I want to put in a good word for CS Rep…",
          "Contenu": "I want to put in a good word for CS Rep Annie.   I live in cell phone hell.  After porting over to Twigby my phone would not connect to either Twigby's network or wifi calling.Annie gave me detailed instructions which involved leaving my home for about half hour to fiddle with phone settings.  I'm online.  Finally.Both Annie's instructions and patience were excellent.  Please THANK HER for me.NOTICE TO TWIGBY MGT: Give this woman a raise (AND a promotion)!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patricia Black",
          "Nb_Reviews": 3,
          "Date": "2023-12-05T22:11:42.000Z",
          "Titre": "Very quick to respond",
          "Contenu": "Very quick to respond. So nice to have a real person answering the questions. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeffrey S",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T03:19:21.000Z",
          "Titre": "phone set up issue",
          "Contenu": "Bot was able to recognize my problem and resovlve it quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MJ M",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T01:04:05.000Z",
          "Titre": "A live person answered immediately",
          "Contenu": "A live person answered immediately, was very polite, knowledgeable and very helpful!  Very good first impression!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dawn-Mishele McIlravy",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T18:26:36.000Z",
          "Titre": "ABSOLUTELY the BEST service and value on the market!",
          "Contenu": "I had some questions and actually chatted with a real person who was so kind and helpful to me! Everything about our new phones and service went off without a hitch. The cell coverage is amazing! The price is the most incredible part! It's also nearly effortless to change the amount of data that you purchase- you're never locked into one set payment/data level. Twigby is the BEST!! I wish I could give them TEN STARS!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jerry Miller",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T19:16:04.000Z",
          "Titre": "Great service and saves money",
          "Contenu": "I've had five lines with Twigby for several years. I've used chat several times, sometimes for troubleshooting, and sometimes for billing and plan assistance. It's always been quick and easy to get responses and they have always been able to resolve any issues.  We've saved a LOT of money over the years by using Twigby."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Victor Tejeda",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T22:43:19.000Z",
          "Titre": "Worked perfectly for my alarm system",
          "Contenu": "After getting their SIM card for my alarm system, I've been very pleased. The SIM card works flawlessly and has ensured a reliable connection for my alarm system. It's a relief to have such easy and dependable service. I'm glad I chose Twigby. If you're looking for a reliable MVNO on the Verizon network, give Twigby a try!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sammy",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T21:53:48.000Z",
          "Titre": "11/10!!!",
          "Contenu": "I had an exceptional enjoy with Twigby and their amazing customer support, and Jon has been surely superb with his help. I’m honestly pleased that Twigby takes such satisfaction in presenting advanced customer service. Switching from T-Mobile to Twigby has genuinely been a choice I’m grateful for, and it’s all thanks to devoted employees like Jon."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Summer",
          "Nb_Reviews": 3,
          "Date": "2023-11-28T02:02:26.000Z",
          "Titre": "Andy",
          "Contenu": "Andy, the person assisting me, was lightning fast in diagnosing and helping to solve our phone issue!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dawn Rhoden",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T13:59:07.000Z",
          "Titre": "Use less, pay less, easy to switch",
          "Contenu": "We are older, dont use our phones much and are not tech saavy so switching to a another carrier in order to pay less bc we use less just made sense. We put it off bc the process seemed daunting but Twigby made it a breeze. MUCH APPRECIATED! Best of all, we have noticed zero difference in performance."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mr. Smith",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T02:59:04.000Z",
          "Titre": "Finally,  an honest company!",
          "Contenu": "We received an email today from Twigby letting us know that we'd not been using all of the data we'd been paying for.   I used the very convenient Twigby chat to confirm this and switched to an even less expensive plan. What companies let you know you can pay them LESS?! We've had their service for many months now and are incredibly happy with every aspect. THANK YOU TWIGBY!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alice J.",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T02:31:15.000Z",
          "Titre": "Best Cell Phone Provider Ever",
          "Contenu": "Each and every time I have contacted Twigby, I have been treated with the utmost respect - even before I became a customer!  All of the associates I have dealt with are very helpful, regardless of how minor or major my questions are!  My cell service has vastly improved since I switched to Twigby.  I am also very happy with their plans and pricing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carl Shokes",
          "Nb_Reviews": 3,
          "Date": "2023-11-02T00:38:30.000Z",
          "Titre": "Answers to questions about Twigby, using GPS, and data cost.",
          "Contenu": "I several specific, and probably unusual, questions about a phone I wanted to purchase and how much data I needed to use the phone for gps navigation on a bike and how much it would cost me. The support person was very professional and knowledgeable, and I was very impressed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Barnes",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T01:30:10.000Z",
          "Titre": "Twigby Surpasses Other Providers",
          "Contenu": "My wife and I have been with Twigby for years. Their customer service is head and shoulders above the rest. We had 5GB plans but because of my job, I needed more. Twigby also has 8GB and 20GB plans. Jon looked at my usage. He could easily have said I needed 20GB, but he didn't try to gouge me and said the 8GB should suffice. He made the change right away and offered to put my wife on a new 5GB plan which was less. End result - our account now has a credit! Honest and helpful, fantastic customer service...Twigby is a keeper."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathy",
          "Nb_Reviews": 3,
          "Date": "2023-10-12T16:51:23.000Z",
          "Titre": "My chat experience was fantastic",
          "Contenu": "My chat experience was fantastic. I'm new to smartphones and had an abundance of questions.  The chat was quick to respond and stayed with me until all my many questions and concerns were answered."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Norma",
          "Nb_Reviews": 3,
          "Date": "2023-08-23T18:57:51.000Z",
          "Titre": "Happy Customers",
          "Contenu": "The live chat was phenomenal. The person on the other end was polite, extremely helpful and stayed right with me during the switch over. We’ve also noticed that we are using Verizon towers so the service has been great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Raleigh Brecht",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T20:39:14.000Z",
          "Titre": "The service is top notch",
          "Contenu": "The service is top notch. They’re operate as if they are a real phone carrier, and everything just works. Recently had issue with my SIM card that resulted in getting a new one, and was here as soon as it could be shipped to me and was able to still take advantage of this low cost phone service. They are excellent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Co",
          "Nb_Reviews": 3,
          "Date": "2023-08-07T19:03:59.000Z",
          "Titre": "After getting new sim cards for new…",
          "Contenu": "After getting new sim cards for new service for my two transferred and ported iPhones, I experienced some tech. issues.  I went to the instant messaging on twigby.com where I dealt with Aubree.  Not only was she kind and not rushed but she understood my issues well and guided me step by step how to resolve my issues.  She was extremely helpful and patient.  I wanted to give a loud shout out regarding her and her excellent customer and tech service, as all issues were resolved on both phones!  Bravo Aubree and bravo Twigby!  I will stay with you indefinitely, if this is the great customer service and results I will experience going forward.  I recommend you enthusiastically."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeannine S.",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T13:19:02.000Z",
          "Titre": "Excellent and affordable!!!",
          "Contenu": "My phone arrived quickly after I ordered it.  The support for set up and transferring my phone was amazing.  I worked with 2 different support representatives who were beyond patient and helpful.  The value of the phone and Twigby service is beyond exceptional.  I am grateful for the savings in today's economy.  Thank you Twigby"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Diane Hayes",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T21:48:41.000Z",
          "Titre": "My service transferred seamlessly from…",
          "Contenu": "My service transferred seamlessly from my old carrier to Twigby. Cell service is great, no dropped calls. Needed help from customer service to port my number to Twigby and customer service was polite and extremely helpful. So far I am loving Twigby."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen Vandermeer",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T18:54:32.000Z",
          "Titre": "I'm new to Twigby and so far I've had…",
          "Contenu": "I'm new to Twigby and so far I've had no problems whatsoever after transitioning from a more expensive cell phone carrier.  Very pleased so far."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Weirum",
          "Nb_Reviews": 4,
          "Date": "2023-11-07T21:29:33.000Z",
          "Titre": "It's been quite nice not paying Verizon…",
          "Contenu": "It's been quite nice not paying Verizon so much for almost the same service. Went from $150 down to $70 for three lines!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary Gossard",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T02:22:41.000Z",
          "Titre": "I have been using Twigby for about five…",
          "Contenu": "I have been using Twigby for about five years and you simply cannot beat their service and price! I almost switched to Xfinity mobile and quickly switched back when I realized what a horrible has it was to deal with a mega corporation! Way to go Twigby for keeping it real!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Raber",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T16:33:03.000Z",
          "Titre": "Fast Service",
          "Contenu": "Responded quickly to my questions to get my service transferred. I could tell that Harry (agent) was knowledgeable and he responded professionally to my questions. I recommend Twigby!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "steve Parker",
          "Nb_Reviews": 2,
          "Date": "2023-11-25T21:00:41.000Z",
          "Titre": "Wish I would have switched sooner,Saves…",
          "Contenu": "Wish I would have switched sooner,Saves me a headache dealing with terriable service from other carriers"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Douglas Ford",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T22:49:58.000Z",
          "Titre": "Been with Twigby for years - 5 Stars",
          "Contenu": "Been with Twigby for years. Always great service. Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brenda R Freeze",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T03:30:27.000Z",
          "Titre": "Signing up with Twigby for 2 phone lines and getting questions answered.",
          "Contenu": "Signing up with Twigby for 2 phone lines, keeping both numbers and my existing phones.  The first one I signed up for is what I call my \"back-up phone\", and the 2nd is my \"primary phone\".  The agents that helped me with both phones and my questions today were very cordial and helpful.  What sold me to change to Twigby was that you use the Verizon network. What I needed today was to be sure I was set up on auto-pay through PayPal for the upcoming bill and how to use Twigby Voice mail."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa Krebsbach",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T18:15:51.000Z",
          "Titre": "Jon helped me out and eased my mind…",
          "Contenu": "Jon helped me out and eased my mind with my issue.  Great experience"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SHARON",
          "Nb_Reviews": 2,
          "Date": "2023-10-04T15:04:57.000Z",
          "Titre": "New satisfied customer!",
          "Contenu": "I just changed from another phone service to Twigby.  The whole process of changing was simple and easy... from transferring my old phone number to registering for new service with Twigby."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "StopElder Cleansing",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T22:08:19.000Z",
          "Titre": "This company is clearly destined to grow exponentially",
          "Contenu": "This company is clearly destined to grow exponentially (with time) having rates lower than even those of a certain fine sounding company with a People magazine Man of the Year winner with a perfect family as well and he is Canadian and American now.  Compare the two if one must but I bet you might go for the one HQ-ed in Murfreesboro, TN even if you are UF alumni like me.Twigby for now is small enough to strive to do everything right and the only thing I see as wrong is that I thought I was promised a cover for the phone which I do not see.However I am sure when I broach that issue, unlike the big carriers,  I will have a real person to solve and to correct it.  And if I am thinking of some other company whose ads I reviewed and overrode for the final choice of Twigy, it will turn out that way in time as regardless Twigby itself is the best cover I could have for my new cell phone!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jacob Garrett",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T02:22:30.000Z",
          "Titre": "Efficient, fast, friendly, and looking out for the customer",
          "Contenu": "Customer service was efficient and helpful in upgrading our plan to our needs. They quickly found the answers to multiple questions I had regarding my account. Much needed. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joshua Wintin",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T16:29:41.000Z",
          "Titre": "The agent was able to fix all of my…",
          "Contenu": "The agent was able to fix all of my issues in quick order! Thank you! Great service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "HappyClient",
          "Nb_Reviews": 2,
          "Date": "2023-11-11T21:37:17.000Z",
          "Titre": "The online support agent",
          "Contenu": "The online support agent - Annie, helped with changing the plan for two lines that I have with Twigby. So efficient and quick. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Cramer",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T21:56:47.000Z",
          "Titre": "Couldn't Connect but a Good Experience",
          "Contenu": "All though I could not use your services, your customer service people were wonderful in trying to get me connected.  They initiated a prompt refund of all fees and left a really good impression.  Good company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessie",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T18:56:56.000Z",
          "Titre": "Customer service was knowledgeable and…",
          "Contenu": "Customer service was knowledgeable and patient. She helped me pick out a new phone that works with all my medical devices. Very satisfied with it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jw",
          "Nb_Reviews": 2,
          "Date": "2023-09-27T20:29:18.000Z",
          "Titre": "Great Support!",
          "Contenu": "The chat support people worked hard on my issue with my wifes number porting just all around great support.It so easy really I didnt have to go to an office and listen to all the sales pitches."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jaycob Dean Brulé",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T00:19:06.000Z",
          "Titre": "Persistence was key.",
          "Contenu": "I chatted with two fellows, one after the other. The first was a man named Harry and he wasn't helpful at all. He ended the chat very quickly and swept me away without care. The second was a man named Link and he was phenomenal! He answered all my question with love & care and helped me find the right plan for me. He also gave me a code for a free $10 credit to make the first month free! I'm glad I tried again with the chatting system. Hopefully I will be a long term Twigby customer from now on."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rachel Range",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T23:09:12.000Z",
          "Titre": "Customer service is AWESOME",
          "Contenu": "Customer service is AWESOME! no transferring from this dept to that dept, everything handled in a matter of minutes. the best customer service I have every had for a phone service. highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Parvati Yuhas",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T18:10:47.000Z",
          "Titre": "I had to cancel due to restrictions on…",
          "Contenu": "I had to cancel due to restrictions on unlimited plan and they were so awesome about the cancellation no desperate trying to get you to stay tactics. They are so real and understanding, it was again a real person chatting, and they had me taken care of swiftly. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Old Man Matt",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T23:15:40.000Z",
          "Titre": "Great customer service",
          "Contenu": "The representative was quick, courteous, and professional. Helped upgrade my plan within minutes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan Dickson",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T03:20:32.000Z",
          "Titre": "Quick efficient and they know what they…",
          "Contenu": "Quick efficient and they know what they are talking about!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lawrence F. Longsworth",
          "Nb_Reviews": 2,
          "Date": "2023-07-27T06:21:55.000Z",
          "Titre": "Everything went smooth at Twigby's end",
          "Contenu": "Everything went smooth at Twigby's end. AT&T presented some problems getting a transfer number request and they locked my phone for a long time. I was told that I should have requested to unlock my phone prior to switching my service. Very happy I switched over."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harold Seeley",
          "Nb_Reviews": 4,
          "Date": "2023-09-20T22:58:32.000Z",
          "Titre": "Ariel helped me out the best I had a…",
          "Contenu": "Ariel helped me out the best I had a few others  that wouldn't hang with me long enough they were also helpful  I think this carrier has great support"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Anderson",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T17:03:36.000Z",
          "Titre": "Easy process",
          "Contenu": "The process to get our number ported to Twigby was very easy.  There were no glitches in the entire process.  I am a senior citizen and was very pleased.  I contacted the help through chat and email prior to porting and they were quick in their responses and very helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Virginia",
          "Nb_Reviews": 2,
          "Date": "2023-09-13T16:41:18.000Z",
          "Titre": "Best customer service I've ever had…",
          "Contenu": "Best customer service I've ever had from a phone company. It's fast, convenient, and they don't read a bunch of scripts at you that waste your time and tick you off. Just humans who listen and quickly solve the problem. (In my case, two plan changes.)Not to mention great prices and reception. Twigby is just so easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Randal Jensen",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T01:49:47.000Z",
          "Titre": "I got another replacement phone",
          "Contenu": "I got another replacement phone (for the replacement, that was not working properly). Evidently the original replacement is defective (somehow). It would call out and hang up, then answer and hang up, ut access to data, messages and the internet worked fine. I was originally told by Twigby tech support that the phone was 'locked' I took it to a Verizon store and verified that it was NOT 'locked'. Verizon network technical support directed me back to Twigby Support and told me to ask for Twigby network support. I got a bit salty with the Twigby rep (on chat, sorry about that), when the rep told me that the phone was 'broken' (before it was 'locked', but I could not get confirmation of the 'locked' status, until I took the phone to a Verizon store) So call me 'salty', if now the phone is 'broken' (again, sorry about that). Anyway, after transferring, everything to the 'new' phone, it is now working (yea and whew). I was told by the Verizon rep that the phone could not be 'locked', because it could send and receive data and send and receive phone calls (just not pickup and connect, phone calls). Perhaps, it would be helpful if Twigby support had some way to tell the difference between a 'locked' phone and a 'broken' phone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Liz Holmes",
          "Nb_Reviews": 2,
          "Date": "2023-09-08T21:47:08.000Z",
          "Titre": "Twigby is the BEST",
          "Contenu": "Twigby is the BEST.  Great low costs.  Excellent customer service with a REAL HUMAN Customer Service rep who has all the answers you will need.  I love Twigby!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shirley Hebert",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T13:59:31.000Z",
          "Titre": "As a senior citizen",
          "Contenu": "As a senior citizen, I was very nervous about changing carriers.  However, when I had a problem with anything the chat box helped me immediately in terms that I found easy to follow.  It was a very, very smooth and quick change.  I find the the service to be flawless.  So glad for the change!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marty OBrien",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T02:04:56.000Z",
          "Titre": "Great Service and Great CustomerService!",
          "Contenu": "Been with you guys for a few years now and it has been great with no problems and great service! I recently upgraded my phone through Twigby and once again everything with the change over went perfectly!  Customer service is great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gregory Anderson",
          "Nb_Reviews": 2,
          "Date": "2023-11-25T23:29:47.000Z",
          "Titre": "Twigby Support Helpful",
          "Contenu": "Twigby online support very helpful.  Easy to contact."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fabrizio Passalacqua",
          "Nb_Reviews": 3,
          "Date": "2023-08-21T16:31:13.000Z",
          "Titre": "The patience of all agents",
          "Contenu": "The patience of all agents. As a proof I will have a new TCL 30xl phone unlocked and will contact twibgy to sign up again, eliminating my tracfone subscription. Few more days to wait."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T17:31:48.000Z",
          "Titre": "Only been with Twigby for 2 weeks",
          "Contenu": "Only been with Twigby for 2 weeks but pleasantly surprised at how good the service has been so far.  Switching was much faster and easier than I expected.  Highly recommend so far.  Great service and great price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T00:33:04.000Z",
          "Titre": "I had a great time talking to Annie",
          "Contenu": "I had a great time talking to Annie,she knows her job. She answered every question I had, gave me advice on my current carrier as far as the very short time I have left on a promo phone. She was great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jill Wood",
          "Nb_Reviews": 4,
          "Date": "2023-07-27T17:19:16.000Z",
          "Titre": "Twigby customer service made the difference",
          "Contenu": "I had some problems getting untangled from my former cell phone company. Twigby’s customer service agents stuck with me which was a real challenge. They made all the difference. Without them I doubt I could have made the switch to Twigby."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LOUISE  PERI",
          "Nb_Reviews": 2,
          "Date": "2023-09-09T22:22:54.000Z",
          "Titre": "Twigby was easy to set up and I like…",
          "Contenu": "Twigby was easy to set up and I like the savings each month.  I have not had any problems with the service and do not anticipate any.  Its as tho I haven't even changed carriers.  Same service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan Egan",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T22:50:12.000Z",
          "Titre": "Easy to setup and save money",
          "Contenu": "It was easy to get a SIM card and set up the account. I’m getting the same data for less. My voicemail didn’t have to be change from my previous Verizon MVNO."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 3,
          "Date": "2023-11-14T00:21:06.000Z",
          "Titre": "very helpful",
          "Contenu": "very helpful, fast response, no trauma, no drama. highly recommend. thanks Jon and Twigby! good job."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul S",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T15:38:37.000Z",
          "Titre": "Twigby support is always top notch and…",
          "Contenu": "Twigby support is always top notch and today's issue was resolved by Ariel in a timely, professional, and pleasant manner.  I wish more companies would follow this support model."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robin Lowney",
          "Nb_Reviews": 2,
          "Date": "2023-09-08T01:17:07.000Z",
          "Titre": "Twigby has proven its great service in…",
          "Contenu": "Twigby has proven its great service in all departments. I’m really impressed with how quick and easy it is to sign up, troubleshoot, questions answered, everything is well done. Thank you for the great service and great prices!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris sizemore",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T17:45:34.000Z",
          "Titre": "Great company",
          "Contenu": "Twigby has the best prices of any other company and they exalent customer support.I highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "REX A MINKE",
          "Nb_Reviews": 2,
          "Date": "2023-07-18T22:31:34.000Z",
          "Titre": "I have yet to run into the areas of no…",
          "Contenu": "I have yet to run into the areas of no service that I experienced from my former provider. This service has been flawless, so far."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Hoffman",
          "Nb_Reviews": 2,
          "Date": "2023-08-08T03:09:11.000Z",
          "Titre": "Great pricing",
          "Contenu": "Great pricing, great coverage, easy transfer. Keep up the good work Twigby.  Keep prices low.Very pleased. Recommending to friends."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LWS",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T21:04:03.000Z",
          "Titre": "Phone switch, no problem!",
          "Contenu": "Jon made the switching around of household phones as painless as possible!  And straight line to the solutions. 😁"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "mildred walker",
          "Nb_Reviews": 2,
          "Date": "2023-09-26T21:14:58.000Z",
          "Titre": "Simple and cost effective service",
          "Contenu": "Easy to sign on.  The entire process of purchasing the phone and availability of services was easy to follow."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Quinn",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T17:52:20.000Z",
          "Titre": "Great coverage",
          "Contenu": "I get great coverage in my area and doesn’t appear that Verizon is throttling during heavy usage times."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Co",
          "Nb_Reviews": 3,
          "Date": "2023-11-09T19:29:38.000Z",
          "Titre": "great tech",
          "Contenu": "great tech. help and rapid customer service!Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T22:38:10.000Z",
          "Titre": "I had the good fortune to chat with Aubree",
          "Contenu": "I had the good fortune to chat with Aubree about my problem with the completion of my order for service.  One day before I requested to use Twigby as my mobile carrier and I thought I had done everything I needed to do on my end, but I never received an email confirmation with a tracking number, an additional service offered with a small fee attached.  Aubree pulled up my account and immediately offered to complete my order, which I accepted and appreciated.  She was very knowledgeable and able to quickly complete my order.  While we were still actively chatting, I received an email with a capture of my order and a second email informing me that the package with my sim card had been shipped.  I was so happy that Aubree was so good at her job and so helpful.  I researched so many mobile carriers before choosing Twigby, which is not a well known company, but I believe they will be a leader with employees like Aubree.  I look forward to a long relationship with Twigby.  I'm excited to get my sim card and start using the iphone that was gifted to me by a kind friend who was getting a new phone.  The company I had chosen before sent me the incorrect size of the sim card, so I didn't renew with them and didn't bother to bring the error to their attention.  I'm really looking forward to using the iphone and Aubree's great customer service will allow me to do so.  I asked Aubree if she could tell me where I might leave a review and she emailed this link to me.  THANK YOU AUBREE for your knowledge, your help, and your kindness.  YOU are appreciated!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dennis",
          "Nb_Reviews": 2,
          "Date": "2023-10-05T02:15:41.000Z",
          "Titre": "Our experience with Twigby continues to…",
          "Contenu": "Our experience with Twigby continues to be pleasurable with product and your support team….as such we continue our relationship Twigby !"
        }
      ]
    }
  ]
}