{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.scalahosting.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Johan BOER",
          "Nb_Reviews": 4,
          "Date": "2023-05-27T12:26:48.000Z",
          "Titre": "Spanel is Not Stable + ask to pay for support for their own bugs",
          "Contenu": "Spanel is not stable they offer an interface that doesn't properly work, for example we use Spanel for email and apparently certificate doesn't renew automaticaly support doesn't want to correct and investigate the issue because they say we need to pay for advanced support. We'll switch to cpanel, they don't get the business plan there. Terrible enterprise."
        },
        {
          "Note": 1,
          "Lieu": "BA",
          "Pseudo": "Samy",
          "Nb_Reviews": 4,
          "Date": "2020-09-02T09:24:04.000Z",
          "Titre": "3 times I try to register a domain and…",
          "Contenu": "3 times I try to register a domain and everytime they Homepage make Problems. Very very very bad. And all the positive reviews I think they are the player of scalahosting"
        },
        {
          "Note": 3,
          "Lieu": "OM",
          "Pseudo": "Mohammad Al-Ali",
          "Nb_Reviews": 2,
          "Date": "2022-12-10T11:06:01.000Z",
          "Titre": "Good support bad product",
          "Contenu": "I like your support, but the product itself I'm not satisficed because the speed of the server not okay so that I downgrade my vps from $110 to $49.95 at the end both of them are same."
        },
        {
          "Note": 3,
          "Lieu": "NZ",
          "Pseudo": "Logan",
          "Nb_Reviews": 5,
          "Date": "2022-06-17T21:23:28.000Z",
          "Titre": "VPS is the way to go",
          "Contenu": "I initially had a bad experience with their standard business email packages (which btw are on a shared server) due to downtime and getting blacklisted. I opted to upgrade to their VPS hosting, which included email. This had some additional features which I could use, but also provided a much better service for my customers."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charles McLane",
          "Nb_Reviews": 4,
          "Date": "2021-07-19T13:08:52.000Z",
          "Titre": "Online Staff Helpful - - Supporting Documentation Not So Much",
          "Contenu": "Online staff are quick to respond (que times are short), and they ask you to explain your question / problem to target a response. BUT then they just give you one piece of the puzzle. It would be more helpful if they could say \"Oh you are trying to do X. Have you seen our great \"how to\" writeup on that at http://blahblahblah?\" And the reason they can't do that is there isn't one. Wix and other similar service providers have great articles and videos on for example hosting with ScalaHosting while you keep your domain name and email somewhere else. Scala just wants you to switch everything to them ($$$) and are not helpful with other scenarios. Bad on them."
        },
        {
          "Note": 4,
          "Lieu": "NG",
          "Pseudo": "Scott Wellington",
          "Nb_Reviews": 2,
          "Date": "2023-09-27T07:15:42.000Z",
          "Titre": "Reliable and Fast",
          "Contenu": "Antonio I. was very profession and patient in dealing with my issue. I like their service. They transparent and respond to chats quickly.Edited: If you are looking for a reliable and fast server, Scalahosting is great. Their support is efficient at resolving and responding to ticket very fast.But I had to leave when the refused downgrade migration. They demanded I pay $40 and later $20 to migrate my sites to a lower plan. But they migrate free if I was transferring from a different hosting or upgrading. I suppose they do this to prevent customers from downgrading but that's a dumb move because they will end up losing customers that would have stayed loyal for years on a plan they can afford. They forget their price is high and there are competitions with far less prices and efficiency than them. My sites weren't earning so downgrading was necessary for me. If they ever change this policy in future, I will return."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mr. D",
          "Nb_Reviews": 2,
          "Date": "2023-02-14T08:23:07.000Z",
          "Titre": "No down-time at all",
          "Contenu": "No down-time at all! My website is always \"ON!!\"Even though my website is not an eCommerce website, but I will truly know how powerful ScalaHosting is when I bring in two (2) eCommerce websites coming very soon.If you still prove yourself, then I will give your service \"5-STARS\" review next time-ok!!!"
        },
        {
          "Note": 4,
          "Lieu": "DZ",
          "Pseudo": "MALEK CHELIH Abdelssamad",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T00:01:42.000Z",
          "Titre": "Insightful Review: What's Essential to Know About ScalaHosting",
          "Contenu": "I've been with ScalaHosting for over a year now, and I'm genuinely pleased with the hosting services they provide. From my experience, they deserve a solid 4-star rating.Pros:1.Reliable Uptime: One of the standout features of ScalaHosting is their exceptional uptime. My website has rarely experienced any downtime, which is crucial for my online business. This reliability has boosted my confidence in their services.2.Speed and Performance: My website loads quickly and smoothly, even during high traffic periods. This has undoubtedly contributed to a positive user experience for my visitors.3.Customer Support: I've had a few technical queries along the way, and the customer support team at ScalaHosting has been a great help. They respond promptly, and their representatives are knowledgeable and friendly.4.Easy-to-Use Control Panel: The control panel is user-friendly, making it easy to manage my website settings, domains, and other features. Even for someone who's not tech-savvy, navigating the control panel is a breeze.Cons:Pricing: While the service quality is excellent, the pricing is slightly on the higher side compared to some competitors. However, considering the reliability and features they offer, I believe it's worth the investment.Overall, I'm quite satisfied with my experience with ScalaHosting. The minor drawbacks are outweighed by the top-notch service and support they provide. If you're looking for a hosting company that prioritizes uptime, performance, and customer assistance, ScalaHosting is definitely worth considering."
        },
        {
          "Note": 4,
          "Lieu": "PT",
          "Pseudo": "Sue Lerena",
          "Nb_Reviews": 3,
          "Date": "2023-01-07T14:24:29.000Z",
          "Titre": "Good experience",
          "Contenu": "Their customer service is very responsive and helpful.  I found their billing confusing.  I changed packages and ended up with 2 invoices - other than that no problems at all."
        },
        {
          "Note": 4,
          "Lieu": "MY",
          "Pseudo": "SYAIFUL AZHAM YUSOFF",
          "Nb_Reviews": 3,
          "Date": "2023-07-05T13:19:01.000Z",
          "Titre": "Antonio and George T very exceptional support",
          "Contenu": "Thanks to Antonio and George T. Exceptional support! The representatives was highly responsive, patient, and persistent in resolving my issue. Kudos to them!"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Richard Baker",
          "Nb_Reviews": 1,
          "Date": "2022-07-19T12:32:15.000Z",
          "Titre": "Best Hosting Provider",
          "Contenu": "This is one of my fev hosting provider and i like it so much"
        },
        {
          "Note": 4,
          "Lieu": "AT",
          "Pseudo": "Peter",
          "Nb_Reviews": 2,
          "Date": "2023-09-06T16:29:37.000Z",
          "Titre": "Ivan provided quick help"
        },
        {
          "Note": 4,
          "Lieu": "CL",
          "Pseudo": "Ivan Vilches",
          "Nb_Reviews": 9,
          "Date": "2021-08-12T17:25:04.000Z",
          "Titre": "I have a few months using it",
          "Contenu": "I have a few months using it, the support is honest and great, my only concern ins on how they manage the servers sometimes rhe server down and was because a mistake of a tecnician on configuration, they fix that things but i dont want keep writing to support for the server problem, for that i cant move more serious bussiness to scala.Still for me for medium size bussiness is good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark S.",
          "Nb_Reviews": 1,
          "Date": "2022-03-05T23:27:39.000Z",
          "Titre": "Small email upgrade and domain transfer help.",
          "Contenu": "I had been using a small email hosting and decided to transfer my domain to Scala as well. The online chat help operator (Valentin N) was very helpful as we navigated this change. He also helped me obtain a discount on my upgraded email hosting.I'd recommend you offer promo pricing to current customers who upgrade their plans. This would help retain them and gain an advantage over those competitors who offer incentives to leave Scala. Valentin was able to help, after a long chat session, and we are now happy to stay with Scala. The 24/7 online chat support made the difference between staying with Scala and leaving to one of their competitors."
        },
        {
          "Note": 4,
          "Lieu": "PT",
          "Pseudo": "baileycarole76",
          "Nb_Reviews": 1,
          "Date": "2019-10-03T06:34:14.000Z",
          "Titre": "Any time we have any problems or any…",
          "Contenu": "Any time we have any problems or any need for anything these guys get right on it. They have given us support for every problem in less than an hour and have gone so far our of their way to ensure we are satisfied with their services. Compared to the others, Scala give more bang for the buck in their different hosting packages. Other web hosts limit how many domains you can use and then give you great amount of bandwidth."
        },
        {
          "Note": 4,
          "Lieu": "EG",
          "Pseudo": "tkhamis77",
          "Nb_Reviews": 11,
          "Date": "2019-11-08T12:15:00.000Z",
          "Titre": "I am a ScalaHosting client since May…",
          "Contenu": "I am a ScalaHosting client since May 2019. Overall I give them 5 stars for support and instant response.But they need to invest more in shared hosting because its availability is not good and there are a lot of downtime almost daily for 2-5 minutes some other times 10-15 minutes which a big number.Thanks."
        },
        {
          "Note": 4,
          "Lieu": "PL",
          "Pseudo": "Piotr B.",
          "Nb_Reviews": 1,
          "Date": "2019-05-27T08:25:25.000Z",
          "Titre": "the best for over 10 years now!",
          "Contenu": "been with ScalaHosting since early 2009 - and must admit, that thru these years, among all tested hostings, this is the one I trust and like the most :) there were some minor issues from time to time, but also were quite quickly solved with a hint or help from the staff which can answer blazingly fast no matter when you send a support ticket.so why the -1 star you'll ask? well, I believe that even perfect things can still be better, so I just leave room for another great innovations that ScalaHosting would apply in the future! :)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "jonc",
          "Nb_Reviews": 1,
          "Date": "2020-07-02T20:29:01.000Z",
          "Titre": "Documentation could be better but support ticket turnaround time was outstanding",
          "Contenu": "Documentation is a bit lacking, however, I was having trouble logging on to my new vps this morning, submitted a ticket and it was resolved in minutes. Fantastic!"
        },
        {
          "Note": 4,
          "Lieu": "PE",
          "Pseudo": "Fredy Alvarez",
          "Nb_Reviews": 4,
          "Date": "2019-11-11T13:58:55.000Z",
          "Titre": "I have 2 considerations:",
          "Contenu": "I have 2 considerations:Domains have shared folder, backup is for all not for every domain.I have to wait 48 hours or more to update DNS."
        },
        {
          "Note": 4,
          "Lieu": "AE",
          "Pseudo": "Olufemi Opeyemi",
          "Nb_Reviews": 1,
          "Date": "2022-03-18T15:42:57.000Z",
          "Titre": "Awesome support from the team…",
          "Contenu": "Awesome support from the team especially IVAYLO T. So gentle and helpful !"
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Montse",
          "Nb_Reviews": 1,
          "Date": "2023-04-25T12:31:53.000Z",
          "Titre": "Good experience solving my problem with email",
          "Contenu": "Good experience solving my problem"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer Don L",
          "Nb_Reviews": 4,
          "Date": "2020-04-02T15:53:46.000Z",
          "Titre": "tech support is fast to respond and has…",
          "Contenu": "tech support is fast to respond and has been very patient with me as a new user."
        },
        {
          "Note": 4,
          "Lieu": "SA",
          "Pseudo": "Shorouq",
          "Nb_Reviews": 1,
          "Date": "2022-07-21T16:18:49.000Z",
          "Titre": "great help",
          "Contenu": "thank you for your help"
        },
        {
          "Note": 4,
          "Lieu": "GH",
          "Pseudo": "WiseWorks LLC Team",
          "Nb_Reviews": 1,
          "Date": "2022-02-10T22:38:41.000Z",
          "Titre": "Good support.",
          "Contenu": "Good job. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mel",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T20:42:44.000Z",
          "Titre": "The quality of service and support is…",
          "Contenu": "The quality of service and support is better than any other hosting provider I have ever dealt with in the last 37 years I have been in the tech business.  Their various departments, such as billing and tech support, coordinate seamlessly to resolve any issue quickly.  I am most pleased and continue to recommend them to my clients."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicholas Verrett",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T20:26:04.000Z",
          "Titre": "Awesome site absolutely love it, gets better and better",
          "Contenu": "Thus far, everything has been very understandable, and the further I get along, the more I learn and the funner it gets. This site is amazing, THANKS"
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Jer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:24:47.000Z",
          "Titre": "Maria very smoothly helped my issue",
          "Contenu": "Maria very smoothly helped my issue.  I had issues with migration and back-ups. Maria gave clear advise. Thank you Maria!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J. W.",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T23:22:08.000Z",
          "Titre": "Fantastic customer service and product",
          "Contenu": "Fantastic customer service. Fantastic response. Fantastic product. Fantastic people. I can't say enough great things about this company. We were with a hosting provider for over 11 years and were too scared to switch. After doing research we found Scala hosting and switched. Dimitar, one of their techs is super knowledgable and patient in answering questions and walking you through tech steps. We feel like this will be our forever home."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Huckleberry Ulbricht",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T07:43:02.000Z",
          "Titre": "Best customer Service",
          "Contenu": "Best customer Service.  Very Patient and understanding  not to mention very helpful in taking care of setup and issues I run into.  They take their time to make sure you have everything just as you want no matter how long it takes.  One of the best companies I've had the pleasure of dealing with, with outstanding support I've not found anywhere else."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Anthony H.",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T09:16:05.000Z",
          "Titre": "ScalaHosting Support A-OK",
          "Contenu": "First up, it's such a pleasant change to be able to communicate directly with a person and not be pressganged into helping to train a bot. Also, the help I have received so far has been unfailingly helpful (important!), courteous and knowledgeable - all my queries have been resolved in short order. A pleasure to deal with support like this"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Caleb Isaacs",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T13:02:58.000Z",
          "Titre": "Phenomenally responsive and useful support",
          "Contenu": "I've used a lot of different hosting providers over the last decade or so and I have never been as consistently impressed by the support i receive at Scala. Big shout out to Dimitar and the team! I've never waited more than a few minutes to get really helpful, above and beyond, intelligent support via the chat.They just get on and help without treating me like the idiot I often am.Really great stuff team!"
        },
        {
          "Note": 5,
          "Lieu": "CY",
          "Pseudo": "Quentin",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T12:47:35.000Z",
          "Titre": "Scalahosting - my experiences with Cloud VPS hosting",
          "Contenu": "I switched to Scalahosting Cloud VPS recently after years of shared hosting with a different hosting provider.There are lots of hosting companies out there and I had to make a decision between several and eventually I went to scalahosting. What was good: Smooth and easy transfer of >20 domains for free, contacted the service many times already and quick responses. Currently setting up CDN and Dimitar helped me more than once already but I have to say that the whole stuff of support is doing a great job.If you are looking for a great solution for your (Wordpress) Websites and you are fed up with shared hosting, the Cloud VPS is definitely worth a try."
        },
        {
          "Note": 5,
          "Lieu": "RS",
          "Pseudo": "Vojin Petrović",
          "Nb_Reviews": 4,
          "Date": "2023-11-21T16:08:22.000Z",
          "Titre": "Scala Hosting is maybe not the cheapest…",
          "Contenu": "Scala Hosting is maybe not the cheapest one hosting service provider, but it is the most affordable one. Their support is unmatchable with others. I never waited more than 15 mins for any problem I had at any time of day, any day of year. Mr. Valentin N. gave me excellent support - as expected!"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Gilia P.",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T23:17:29.000Z",
          "Titre": "Patience & Kindness",
          "Contenu": "I wish I could remember ALL the individuals that I have spoken to in all my time on Scalahosting. What names I do remember is Rali M. and Valentin N. They have been extremely patient, kind, and very helpful. Despite my guilt in asking stupid questions as a long day of work can make your brain turn to mush, they have not been judgemental and rather very supportive. Super straight to the point and FULL of information. Thank you to ALL that I spoke with!"
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "putu ari",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T03:44:18.000Z",
          "Titre": "Web Site alaya resort ubud down",
          "Contenu": "service is very friendly and fast, can help solve problems that occur, I think it is very good, thank you Dimitar"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jason Cartledge",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T13:06:20.000Z",
          "Titre": "Simply the best",
          "Contenu": "The Scala team are second to none, from their sales specialists to the support team. Their platforms are simple and straightforward to use and set up."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Utkarsh Mishra",
          "Nb_Reviews": 2,
          "Date": "2023-11-10T19:00:16.000Z",
          "Titre": "The support is exceptional",
          "Contenu": "The support is exceptional! I have always had my issues resolved in the first discussion and they always take time to check issues in detail even if it takes 1-2 hours. They never stall. My website was down due to bot attack and Maria from scalahosting did her best to help out and ensure that the website was up and running. It really makes it easy to manage business issues when tech support is available so easily."
        },
        {
          "Note": 5,
          "Lieu": "MT",
          "Pseudo": "Freenguello Lo",
          "Nb_Reviews": 9,
          "Date": "2023-11-10T19:50:15.000Z",
          "Titre": "My experience with Maria was 5 stars…",
          "Contenu": "My experience with Maria was 5 stars because, unlike some of her male colleagues, she took over the situation and she resolved my problem while I was panicking, instead of merely posting a link with instructions on how to deal with it.It would have sufficed that she gave me some guidance but she went the extra mile and beyond.Very grateful and I must say I was already looking for another hosting provider. People like her should be the standard rather than the exceptions."
        },
        {
          "Note": 5,
          "Lieu": "ET",
          "Pseudo": "Biniam W",
          "Nb_Reviews": 3,
          "Date": "2023-12-04T11:36:25.000Z",
          "Titre": "MQTT configuration completed",
          "Contenu": "Since the problem I encountered today involved a new feature of our project, the Scala support team was able to respond to it quickly and expertly, which was the best experience I've had thus far."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lester Chastain",
          "Nb_Reviews": 8,
          "Date": "2023-11-15T23:55:40.000Z",
          "Titre": "Dimitar at Scalahosting is incredibly…",
          "Contenu": "Dimitar at Scalahosting is incredibly helpful and patient with assisting you with technical issues. He spent well over an hour making sure everything was right and this is not the first time. ScalaHosting give this man a raise!!!!!!!!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "A. Guy",
          "Nb_Reviews": 2,
          "Date": "2023-11-05T01:28:34.000Z",
          "Titre": "Best hosting out there",
          "Contenu": "I have had several hosts (all big name top 10 hosts) over the last decade.  ScalaHosting has, without question, the best tech support I have encountered.  Migration was easy and when there was an issue (do to a configuration mistake I made) they quickly came to the rescue.  I have dealt with multiple tech people  at ScalaHosting and they are all excellent.  Most recently Todor P. saved the day for me when I made a configuration mistake that he quickly figured out and fixed.  Todor was very knowledgeable, patient, and quick to respond.  Thanks again ScalHosting!  I will be migrating my other domains very soon!  You guys rock!"
        },
        {
          "Note": 5,
          "Lieu": "ET",
          "Pseudo": "Biniam W",
          "Nb_Reviews": 3,
          "Date": "2023-11-26T15:30:51.000Z",
          "Titre": "The greatest experience I've ever get…",
          "Contenu": "The greatest experience I've ever get is the support!For the past year and half, the sales and technical support teams have been incredibly responsive and helpful."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Saamipya Home Health",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T07:40:02.000Z",
          "Titre": "It was an excellent timely support",
          "Contenu": "It was an excellent timely support. Thanks a lot"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Quora Forum",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T11:42:04.000Z",
          "Titre": "Scala Hosting Managed VPS is an…",
          "Contenu": "Scala Hosting Managed VPS is an exceptional service. The support is available within 2 seconds and responds  efficiently to challenges.Today Maria from Support took hours to resolve server side issue for a custom built website.The support has also helped me understand what actually was wrong in script , and we took right and informed decisions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Day Bros RV Sales",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T18:45:09.000Z",
          "Titre": "5 Star Support and Services",
          "Contenu": "My support agent Antonio I. Went above and beyond in helping me with SpamAssassin! I am forever grateful  and my heart is full of thanks. I would suggest Scala's services to anyone. Their 24/7 support is worth it alone. May favor be at your doorstep o wonderful Scala!"
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Tom Webb",
          "Nb_Reviews": 3,
          "Date": "2023-10-25T18:33:18.000Z",
          "Titre": "In a word - excellent!",
          "Contenu": "Every interaction I've had with the support team, has been exceptional. If you need a hosting partner that has your back, when the support is needed, look no further.Fast, reliable hosting service paired with outstanding 24/7 support when you need something sorted - is a match made in heaven."
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "Elena Margas",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T15:14:27.000Z",
          "Titre": "Excellent support!",
          "Contenu": "Great support from Dimitar! I needed his help twice in 2 days and he helped in not time. The best support i had so far with a hosting company. Well done, recommended!"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Luis",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T00:51:48.000Z",
          "Titre": "They always reply quickly and are…",
          "Contenu": "They always reply quickly and are helpful to fix the issues that come up. Recommend 100%"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Rahul Mookerjee",
          "Nb_Reviews": 6,
          "Date": "2023-11-06T09:39:34.000Z",
          "Titre": "Again, absolutely superlative service!",
          "Contenu": "I've written tomes about how this company is the very best - both when it comes to ther infrastructure, but most importantly their support! Customer suport has deteriorated to alarming levels these days - copy and paste basically - even for the biggies - and I've spoken a lot against this ie a human touch is what its all about. Over the years, Scalahosting has delivered just that - the right mixture of empathy, understanding and practical advice in terms of their customer service! I am truly grateful to these guys, and would gladly any day recommend their services over biggies like AWS etc. My third review for the company so I'll end here - Angel was the agent that helped me this time and many times in the past - - and, it's truly angelic,the help,.coming at exactly the right \"divine\" time as it were. A huge thank you to Angel and the whole team at Scalahosting yet again. So much appreciated!Very gratefully -Rahul Mookerjee"
        },
        {
          "Note": 5,
          "Lieu": "CZ",
          "Pseudo": "Boris",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T19:25:22.000Z",
          "Titre": "The best company I've encountered in my 10 years of working with VPS hosting",
          "Contenu": "After a four-day experience, I can confidently say that this is the best company I've encountered in my 10 years of working with VPS hosting. The swift and professional customer support helped me resolve a multitude of issues related to site migrations during this time. What really stands out is the human touch in their customer service. As a result of my four-day interaction with their support team and complete satisfaction with the server's performance, I've upgraded my subscription from an annual plan to a three-year commitment."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stan",
          "Nb_Reviews": 2,
          "Date": "2023-10-26T02:29:19.000Z",
          "Titre": "Scala Hosting is BEST Hosting company",
          "Contenu": "Scala Hosting is BEST Hosting company. I was working with 20+ hosting companies in my 35 YOE including NameCheap and GoDaddy. GoDaddy was ok 2 years ago before they were sold by $2 billion and now they have only Indian Support. Scala has Real Support. They were helping me 10+ times with WordPress. It was not their responsibilities. But they DID it! It is small \"family\" company and you can be sure that real 24/7/365 you will receive help and be able to use your hosting. Thank you guys!"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Trancewerk",
          "Nb_Reviews": 3,
          "Date": "2023-11-23T20:11:08.000Z",
          "Titre": "We had (again) connectivity issues",
          "Contenu": "We had (again) connectivity issues. Ross from support quickly investigated and fixed the issue. Very happy with the fast and professional support."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Tensoralytics Team",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T07:08:13.000Z",
          "Titre": "Scalahosting has a Fantastic Tech Support Team!",
          "Contenu": "Both Antonio & Todor from Scalahosting.com have been super knowledgeable, kind and very helpful!We are lucky to have them helping us today!!"
        },
        {
          "Note": 5,
          "Lieu": "MA",
          "Pseudo": "produsat",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T13:46:49.000Z",
          "Titre": "I am a costumer with scalahosting since…",
          "Contenu": "I am a costumer with scalahosting since 2015really having a best services  i which you a long life"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Liam Doherty",
          "Nb_Reviews": 2,
          "Date": "2023-11-05T23:19:48.000Z",
          "Titre": "Been with Scala for a few months now…",
          "Contenu": "Been with Scala for a few months now and it's been awesome. Website speed is up, I like the dashboard, and support has always been quick and effective, especially with attentitive agents like Ross."
        },
        {
          "Note": 5,
          "Lieu": "GH",
          "Pseudo": "nii",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T22:24:56.000Z",
          "Titre": "Great tech support",
          "Contenu": "I have been deploying a web app recently... had lots of issues but all tech support staff were amazing. From Maria to Antonio to Kaloyan to Valentin to Kliment and more ... whether night or day... awesome support.Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lester Chastain",
          "Nb_Reviews": 8,
          "Date": "2023-11-29T22:30:12.000Z",
          "Titre": "George at scalahosting is always…",
          "Contenu": "George at scalahosting is always helpful and attentive to clients. All the staff there is ALWAYS great!"
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "George Kalantzopoulos",
          "Nb_Reviews": 3,
          "Date": "2023-11-08T02:46:49.000Z",
          "Titre": "Still great and fast support",
          "Contenu": "Still great and fast supportThey are always answering fast, they are knowledgeable and always helpful. Never had to wait in line more than 1 minute for my problem to be solved or answered"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Business Owner",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T22:07:38.000Z",
          "Titre": "Wonderful customer service with full explanations!",
          "Contenu": "Dimitar was wonderful to work with!  I needed help setting up my Wordpress and I was given full explanations as well as different options to achieve the outcomes I needed for setting up my Wordpress site.  It was quick and easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sony",
          "Nb_Reviews": 2,
          "Date": "2023-10-16T17:30:07.000Z",
          "Titre": "I was having trouble accessing my email",
          "Contenu": "I was having trouble accessing my email and webpage.  I contacted the ScalaHosting chat feature, and Dimitar solved my problem in less than five minutes. He was able to ask the relevant questions to address the situation quickly. I am so thankful because his intervention saved me a lot of headaches and stress since it involved sensitive information from my email at work. Thank you, Dimitar, for solving my issue as efficiently as you did and, on top of it, being so nice. Great customer service!"
        },
        {
          "Note": 5,
          "Lieu": "NP",
          "Pseudo": "Sanjeev Das",
          "Nb_Reviews": 2,
          "Date": "2023-10-31T09:24:14.000Z",
          "Titre": "Exceptional Service and Swift Support from Scalahost!",
          "Contenu": "I must commend the outstanding service I've received from the Scalahost team. Their responsiveness is truly remarkable, and I am thoroughly impressed with the efficiency of their support. Throughout the setup of my VPS, they've been there to provide invaluable assistance and guidance. I wholeheartedly appreciate the level of service they've offered and highly recommend Scalahost to anyone seeking top-notch VPS hosting."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Abe",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T03:58:12.000Z",
          "Titre": "Antonio I.",
          "Contenu": "Antonio I. helped me configure my .htaccess file to make my Drupal site work inside the (Drupal default) /public_html/web folder."
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Ionut Iustin",
          "Nb_Reviews": 3,
          "Date": "2023-10-16T21:44:16.000Z",
          "Titre": "Great Hosting Company",
          "Contenu": "Great Hosting Company. I like everything about scalahosting. The servers quality and speed, the prices are good and the customer service, man, it's greatest of all time and I do not exaggerate. Dimitar and his teammates always helped me"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Guillermo Ogallar",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T13:45:16.000Z",
          "Titre": "Perfect customer service",
          "Contenu": "We have many servers with Scala Hosting, and customer service is very efficient. I usually talk with them via chat (today I talked with Dimitar) or ticket, and they always help me or try to find a way to help me."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T16:23:14.000Z",
          "Titre": "Incredible speed and competence!",
          "Contenu": "Incredible speed and competence every time I need help. Support is beyond awesome! Everything just works. Dimitar on the support team is a rock star."
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "Dokmai",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T13:03:30.000Z",
          "Titre": "They were able to take care of my DNSEC questions.",
          "Contenu": "They were able to take care of my request so fast. No excuses, No waiting, I highly recommend them for their fast response time and quality service."
        },
        {
          "Note": 5,
          "Lieu": "KZ",
          "Pseudo": "Artyom",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T17:52:18.000Z",
          "Titre": "SSH access to my VPS",
          "Contenu": "Had problems with SSH access to my VPS. Online chat support (Dimitar) was fast and helped instantly! Thanks)"
        },
        {
          "Note": 5,
          "Lieu": "CM",
          "Pseudo": "Ivan Namme",
          "Nb_Reviews": 2,
          "Date": "2023-10-27T11:55:04.000Z",
          "Titre": "Revolutionary support service",
          "Contenu": "I was having issues logging in to my server because I always got an error message saying, \"my connection was not private\". When I contacted Sala hosting, it took Dimitar seconds to have the issue resolved. Thank you scala hosting. your support service is really revolutionary."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lynne Moses",
          "Nb_Reviews": 2,
          "Date": "2023-11-04T16:42:13.000Z",
          "Titre": "Great customer service",
          "Contenu": "I needed my PHP updated to support all my WordPress websites and Ross in ScalaHosting's customer service took care of it all quickly and efficiently via chat. I was really impressed with the professionalism and expertise. I've been very happy with ScalaHosting ever since switching to them when I wanted a dedicated server to protect the integrity of my outgoing email."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Richard Thomas",
          "Nb_Reviews": 14,
          "Date": "2023-10-20T13:57:13.000Z",
          "Titre": "Ross gave me great support",
          "Contenu": "Ross gave me great support.  Firstly, sorting out an issue with a template, then kindly and gently pointing out my own mistake.  I just love Scala Hosting - brilliant service, and great support."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Nerd Superb",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T13:37:00.000Z",
          "Titre": "Amazing Customer Service",
          "Contenu": "Just had my first experience with Scala hosting and the customer service live chat is amazing! Dimitar was online in seconds and sorted my questions."
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "Dimis Kat (filmnavigate)",
          "Nb_Reviews": 4,
          "Date": "2023-12-06T13:48:38.000Z",
          "Titre": "Thank you",
          "Contenu": "Thank you, ScalaHosting, for a decade of outstanding service. Here's to many more years of successful collaboration!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lester Chastain",
          "Nb_Reviews": 8,
          "Date": "2023-12-11T19:47:46.000Z",
          "Titre": "Tencho T",
          "Contenu": "Tencho T. at scalahosting is always attentive with attention to patance with clients. Highly appreciated!!!"
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Tensoralytics",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T04:57:44.000Z",
          "Titre": "Tencho was superb!!!",
          "Contenu": "Tencho was superb, he gave us an accurate assessment of our situation within minutes and resolved it immediately!! 10 STARS out of 5!!!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Melanie",
          "Nb_Reviews": 2,
          "Date": "2023-10-22T18:36:37.000Z",
          "Titre": "Excellent pre-sales & technical advice",
          "Contenu": "Their super fast response to my questions. I need to move hospting as current provider's service has deteriated rapidly. The tech person Dimitar was excellent. Explained everything in great detail. The hospting offers 100% better service and support compared to my current one who don't prove support for servers."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Raghavan Sundaragopalan",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T10:43:49.000Z",
          "Titre": "Great support",
          "Contenu": "Any support waiting time is less than 30sec also customer support is great.. they will do whatever possible to solve the problem and will be done ASAP ."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Laurence",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T17:41:03.000Z",
          "Titre": "Sub domains and SSL",
          "Contenu": "Dimitar, very quickly answered my support question and also how to go about doing what I needed. i.e create sub domains with SSL on our entry cloud package."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Yasin Mushtaq",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T19:47:52.000Z",
          "Titre": "Scala Support is always exceptional",
          "Contenu": "Scala Support is always exceptional. I always have a great experience with these guys.\"Dimitar Guided me in the right way to solve my issue\".Many Thanks Again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Liz",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T21:20:39.000Z",
          "Titre": "Fast Response and Resolution",
          "Contenu": "Fast Response and Resolution.  I used chat support for my questions and got situated quickly."
        },
        {
          "Note": 5,
          "Lieu": "PE",
          "Pseudo": "Rommel Andaluz",
          "Nb_Reviews": 2,
          "Date": "2023-10-22T17:07:38.000Z",
          "Titre": "Excellent support!",
          "Contenu": "They have an excellent support: they are gentle, fast, and effective. My problem was solved in a few minutes.Thanks a lot, Dimitar and Stan!"
        },
        {
          "Note": 5,
          "Lieu": "CN",
          "Pseudo": "Henry",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T10:35:53.000Z",
          "Titre": "The support from Antonio was just AMAZING",
          "Contenu": "The support from Antonio was just amazing - LOTS of patance but ALL the staff at ScalaHostingis AMAZING!!!!!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Pervez Ali",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T09:38:37.000Z",
          "Titre": "Radostina",
          "Contenu": "Radostina! I'm impressed with your work. I appreciate."
        },
        {
          "Note": 5,
          "Lieu": "OM",
          "Pseudo": "Ali",
          "Nb_Reviews": 3,
          "Date": "2023-10-26T15:14:51.000Z",
          "Titre": "amazing support",
          "Contenu": "amazing support, especially Spanel is a game-changer, I am in love with it.  thank you Scalahosting for such an amazing panel."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wendy",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T18:13:15.000Z",
          "Titre": "super quick help with an email delivery…",
          "Contenu": "super quick help with an email delivery issue. They fixed the problem within 5 mins."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T21:02:37.000Z",
          "Titre": "Dimitar was able to quickly and clearly…",
          "Contenu": "Dimitar was able to quickly and clearly help me find what I needed.  Soemtimes tech support can be so complicated and hard to understand.  Not the case here."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Tanya",
          "Nb_Reviews": 3,
          "Date": "2023-11-24T14:29:23.000Z",
          "Titre": "Brilliant assistance",
          "Contenu": "Brilliant assistance, and solved my problem in record time. Thank you Antonio I."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T00:35:43.000Z",
          "Titre": "Exceptional Customer Service!",
          "Contenu": "Dimitar ... was fast and efficient, as always, the staff is always extremely responsive, and there when ever a need arises."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lester Chastain",
          "Nb_Reviews": 8,
          "Date": "2023-11-05T20:38:26.000Z",
          "Titre": "The support from Antonio was just AMAZING",
          "Contenu": "The support from Antonio was just amazing - LOTS of patance but ALL the staff at ScalaHostingis AMAZING!!!!!"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Paris User",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T13:10:21.000Z",
          "Titre": "Highly Recommend this Person!",
          "Contenu": "He/She took a great deal of time to talk me through my first use of FileZilla and the FTP program. Very helpful, very patient, and very successful.  Highly recommend this person!!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Outlines Design",
          "Nb_Reviews": 3,
          "Date": "2023-11-22T10:55:28.000Z",
          "Titre": "Dimitar made my job easy and I got it…",
          "Contenu": "Dimitar made my job easy and I got it done fast. I appreciate the support"
        },
        {
          "Note": 5,
          "Lieu": "ZM",
          "Pseudo": "edward",
          "Nb_Reviews": 3,
          "Date": "2023-10-24T09:11:43.000Z",
          "Titre": "I had a fantastic experience with Scala…",
          "Contenu": "I had a fantastic experience with Scala Hosting. Their excellent support team really stood out, providing timely and efficient assistance whenever I needed it. I highly recommend them"
        },
        {
          "Note": 5,
          "Lieu": "EG",
          "Pseudo": "mark michil",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T11:32:09.000Z",
          "Titre": "Dimitar was very helpful and response…",
          "Contenu": "Dimitar was very helpful and response to solve any issue thanks a lot"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MillionMakers.com",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T02:05:21.000Z",
          "Titre": "Managing our website MillionMakers.com",
          "Contenu": "They have been managing our website MillionMakers.com very well.Amazing Support!"
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Evelyn Ting",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T05:20:24.000Z",
          "Titre": "Prompt and Valuable Assistance from Dimitar: A Smooth and Efficient Experience!",
          "Contenu": "Assistance from Dimitar was prompt and invaluable! Quick response and helpful guidance made the experience smooth and efficient. Grateful for the support received!"
        },
        {
          "Note": 5,
          "Lieu": "DK",
          "Pseudo": "Anton Brix Torø",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T14:01:38.000Z",
          "Titre": "Dimitar gave me great support on where…",
          "Contenu": "Dimitar gave me great support on where to place my files and how to move my exixting website."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Duncan",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T19:48:12.000Z",
          "Titre": "I was migrating emails over and had…",
          "Contenu": "I was migrating emails over and had some connection issues and we were able to work through so I could complete my migration timely."
        },
        {
          "Note": 5,
          "Lieu": "MT",
          "Pseudo": "Ben",
          "Nb_Reviews": 11,
          "Date": "2023-11-10T14:46:34.000Z",
          "Titre": "I recently had the pleasure of…",
          "Contenu": "I recently had the pleasure of experiencing top-notch support from ScalaHosting.com, and I couldn't be more impressed! The level of service I received from their support team, particularly from a remarkable individual named Dimitar, has set a new standard for excellence in the hosting industry.I encountered a significant issue with the performance of my VPS due to its location being too far from mine. Frustrated and unsure how to proceed, I reached out to ScalaHosting.com's support team. From the moment I initiated contact, The Scalahosting team demonstrated an unparalleled commitment to resolving my technical difficulties.What truly stood out was the proactive approach taken by Dimitar and the entire ScalaHosting.com team. Rather than offering generic solutions, they took the initiative to understand my specific needs and concerns. The migration process was nothing short of impressive. ScalaHosting.com handled all the complex tasks on my behalf, ensuring that I experienced minimal downtime and zero data loss. The level of professionalism, expertise, and efficiency displayed by their support team exceeded my expectations."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kate",
          "Nb_Reviews": 2,
          "Date": "2023-11-06T20:18:06.000Z",
          "Titre": "Fast and useful help that covered what…",
          "Contenu": "Fast and useful help that covered what I needed.  Dimiter was very clear in communicating"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Richard S",
          "Nb_Reviews": 2,
          "Date": "2023-10-18T19:13:04.000Z",
          "Titre": "First class support",
          "Contenu": "First class support, good prices.  Helped by Dimitar today, who as has been the case with all the team, was excellent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Ascher",
          "Nb_Reviews": 3,
          "Date": "2023-11-06T20:10:08.000Z",
          "Titre": "Support from Dimitar was friendly and…",
          "Contenu": "Support from Dimitar was friendly and focused. Quickly understood the nature of my problem and made excellent suggestions for figuring out the cause. My problem was identified (\"user stupidity\") and fixed immediately."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Del",
          "Nb_Reviews": 5,
          "Date": "2023-10-18T22:53:14.000Z",
          "Titre": "Dimitar was a great help",
          "Contenu": "Dimitar was a great help.  Never cloned a server domain before and Dimitar told me exactly what I needed to do.  Great service & help."
        },
        {
          "Note": 5,
          "Lieu": "LK",
          "Pseudo": "Support",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T12:27:37.000Z",
          "Titre": "Great team and good service always",
          "Contenu": "Great team and good service always. Today I have an issue with e-mail and Dimitar sorted very quickly"
        },
        {
          "Note": 5,
          "Lieu": "LK",
          "Pseudo": "Shiran Sabar",
          "Nb_Reviews": 7,
          "Date": "2023-11-01T08:52:50.000Z",
          "Titre": "Thanks a million Todor P",
          "Contenu": "Thanks a million Todor P. for sorting out my server issue. you did an amazing job."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Danny Brampton",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T19:05:35.000Z",
          "Titre": "Support rep Dimitar responds quickly…",
          "Contenu": "Support rep Dimitar responds quickly and is knowledgeable. Solves my issues in no time!"
        },
        {
          "Note": 5,
          "Lieu": "LB",
          "Pseudo": "BUDEVCO",
          "Nb_Reviews": 8,
          "Date": "2023-11-18T21:15:59.000Z",
          "Titre": "Dimitar the best",
          "Contenu": "Exceptional Support Experience with Dimitar at ScalaHosting! Dimitar provided the best support I've ever experienced. His response was incredibly fast, and he went above and beyond to resolve my issue. His expertise and dedication truly set ScalaHosting's support apart. I highly recommend ScalaHosting, and kudos to Dimitar for delivering top-notch assistance!"
        },
        {
          "Note": 5,
          "Lieu": "MY",
          "Pseudo": "Jay Choo",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T08:34:25.000Z",
          "Titre": "I had an excellent experience with…",
          "Contenu": "I had an excellent experience with Dimitar from the support team. What impressed me most was the promptness in responding to my queries, ensuring efficient and effective resolution of my issues.Dimitar's helpfulness stood out, and I highly recommend Dimitar for anyone in need of quick and reliable assistance."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Amir",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T22:23:59.000Z",
          "Titre": "The support was amazing",
          "Contenu": "The support was amazing. Fast and to the point, so compassionate! Dimitar was so lovely!"
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Joshua Jacobs",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T12:06:43.000Z",
          "Titre": "A Deep Dive into My Stellar Journey with Scala Hosting",
          "Contenu": "Setting Sail in 2016: A Leap into the UnknownIn the tumultuous world of web hosting, Scala Hosting emerged as my guiding light in 2016. Disenchanted by the letdowns from redacted, redacted, and redacted, I took the leap into the unknown. Little did I know, Scala Hosting was about to redefine my expectations of what a hosting provider could be.From Shared to Reseller Bliss: More Than Just PlansStarting with shared hosting and eventually delving into the reseller program, Scala Hosting seamlessly facilitated my transition. It wasn't just about acquiring hosting plans; it was about establishing a robust and mutually beneficial hosting relationship. Their reseller program not only met my needs but exceeded them, offering not just services but an ecosystem of support.Cloud VPS Upgrade: When Things Got ViralThe turning point in our journey together occurred when one of my main accounts experienced an unexpected surge in popularity, demanding more resources. Scala Hosting didn't just wait for me to react; they took the proactive step of suggesting an upgrade to a cloud VPS account. What sealed the deal for me was their commitment to transparent pricing – no hidden fees, just honest service. The migration process was not just smooth but reflective of a hosting provider that truly understood the value of a hassle-free experience.Reseller Program Magic: Beyond the BasicsExpanding my VPS to accommodate all client sites was made not only possible but surprisingly easy with Scala Hosting's support team. What set them apart was their willingness to go above and beyond, migrating shared accounts at no extra cost, even those beyond the Scala Hosting umbrella. This level of commitment is a rare gem in an industry often characterized by a lack of personal touch.Tango with Malware: Support to the RescueIn a moment of oversight, I unintentionally uploaded a null theme, leading to a malware infection. Scala Hosting's scanning service not only detected the issue promptly but provided a secure channel for me to rectify the situation. The support team proved to be true heroes during this crisis, locating the source of the malware, guiding me through the resolution process, and transforming what could have been a nightmare into a manageable situation. Their assistance was not just technical; it was human.Learning the Ropes: Support Beyond the Call of DutyWhile I wasn't a complete novice, Scala Hosting's support team played a crucial role in elevating my understanding of hosting intricacies. They patiently imparted knowledge and extended their assistance to issues that extended beyond their immediate responsibilities. It was not just about fixing problems; it was about empowering me to navigate the hosting landscape with confidence.SPanel Game-Changer: Innovation in ActionWhen cPanel's licensing became a hurdle, Scala Hosting responded with SPanel – a game-changer that not only matched cPanel's features but surpassed them. The support team showcased their commitment to innovation by manually implementing a solution for a missing feature, demonstrating their dedication to ensuring their services evolve to meet user needs.The Inbox Chronicles: 778 Emails and Still SmilingWith 778 emails exchanged, a significant portion being support tickets, Scala Hosting has consistently demonstrated unwavering dedication to fulfilling my demands. Despite being a demanding customer, I have never experienced disappointment. Each interaction reinforced my confidence in Scala Hosting's commitment to customer satisfaction.Final Act: Scala Hosting - The Hosting Fairy GodmotherIn a nutshell, Scala Hosting isn't merely a hosting provider; it's a partner in my digital journey. With competitive prices, cutting-edge features, and a support squad that transcends technical assistance to become a tech fairy godmother, there's simply no incentive to explore alternatives. Scala Hosting has not just met but exceeded my hosting expectations, and I eagerly anticipate continuing this seamless and fulfilling journey.Cheers to hassle-free hosting,"
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Tom Webb",
          "Nb_Reviews": 3,
          "Date": "2023-10-30T06:26:20.000Z",
          "Titre": "Dimitar helped tweak server settings to…",
          "Contenu": "Dimitar helped tweak server settings to customise it to a New Zealand readable format for me. Great hosting support staff!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T16:56:53.000Z",
          "Titre": "Great and responsive support",
          "Contenu": "Great and responsive support. Dimitar was fast and thorough like all of the support folks."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "richard anoniem",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T02:04:18.000Z",
          "Titre": "like all support agents there doing  a…",
          "Contenu": "like all support agents there doing  a great job!! so helpfull and kind. my last agent was Antonio I. great job!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vincent Maiello",
          "Nb_Reviews": 2,
          "Date": "2023-10-30T22:20:52.000Z",
          "Titre": "Another outstanding support session…",
          "Contenu": "Another outstanding support session with Antonio. The entire team at Scala is great, and their support is second to none. Recommended!"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Nabeel Hassan",
          "Nb_Reviews": 3,
          "Date": "2023-10-31T12:06:04.000Z",
          "Titre": "Scala support is always best",
          "Contenu": "Scala support is always best, Maria resolved my issue on time and she was very cooperative"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Del",
          "Nb_Reviews": 5,
          "Date": "2023-10-20T19:50:58.000Z",
          "Titre": "Maria sorted the issue immediately",
          "Contenu": "Maria sorted the issue immediately!  Really appreciate all that the support team have done.  Many thanks."
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "Sakis Hammer",
          "Nb_Reviews": 2,
          "Date": "2023-10-24T12:23:49.000Z",
          "Titre": "Trust",
          "Contenu": "Quick response for support. Great customer service. (Antonio I ) Easy install cms & forums. Product was just as advertised and expected!"
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "I & N Shipping",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T20:02:30.000Z",
          "Titre": "Dimitar was really helpful.",
          "Contenu": "Dimitar was really helpful. I had a lot of questions and he helped with all."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Dods",
          "Nb_Reviews": 3,
          "Date": "2023-11-07T22:46:18.000Z",
          "Titre": "Great! Awesome.",
          "Contenu": "Great! The representative was very good and very knowledgeable.Follow up to my previous review...I intended to came here on this Trustpilot site not to add a rating or withdraw a rating I had previously given. Because my experience in my previous inquiry was that the representative answered my questions well. What I lost on my previous inquiry is I had misinterpreted their product offering, especially the premium features they claim. That is what I want to make an emphasis it now.In fact, they offer no Free Domain or Real Time Malware Protection. Even the other Hosting companies that sell this type of product. Check and think carefully about what they say the Free Domain of their current price now with the premium features they offered. Ask how much the price will be after the renewal rate upfront for 1 year if you intended it for a year only.I purchased from ScalaHosting their product WP Start with the amount price of $5.95/mo the total amount for 1 year is $71.40. I think I got that the less price, but the whole thing was that it didn't have the features. They just subtract all its features, and they do as a feature for their premium price. If you can't check the true price the trick there is you will go after the product because of the features, the Free Domain and Real Time Malware Protection, and this is indeed I fall into my wrong interpretation.Regularly, the price of WP Start after renewal is $11.95/mo the total amount for 1 year is $143.40. It probably includes what they say is Free Domain and Malware Protection. If you do the computation of the full total price for 1 year of WP Start product, there is really NO Free Domain and Malware Protection as they claimed in their promo. That's just only part of their marketing strategy to get more sales.Even the other hosting companies that sell this type of product the kind of features they offer really don't exist. Since, I just started with ScalaHosting, let's just see their hosting performance if it's good before the end of the month comes. And I hope I'm not wrong in my choice of choosing ScalaHosting."
        },
        {
          "Note": 5,
          "Lieu": "EC",
          "Pseudo": "Jorge Iván Hernández Trávez",
          "Nb_Reviews": 5,
          "Date": "2023-11-04T21:14:19.000Z",
          "Titre": "Great service as always!",
          "Contenu": "When I initially contacted Scala Hosting, I was immediately greeted with genuine warmth and professionalism. The customer service representative went above and beyond to make me feel valued as a customer and ensured that my concerns were attentively heard. What truly set Scala Hosting's customer service apart was their commitment to going the extra mile. Not only did they promptly address my initial concern, but they also took the time to provide additional guidance and suggestions to optimize my overall hosting experience. This dedication to surpassing expectations showcases their genuine interest in the success and satisfaction of their customers."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Tom Webb",
          "Nb_Reviews": 3,
          "Date": "2023-11-04T19:27:02.000Z",
          "Titre": "Ross in support",
          "Contenu": "Ross in support, helped resolve an issue for me, quickly and first time up, so greatly appreciate the knowledgeable and quick resolution to problem I was facing!"
        },
        {
          "Note": 5,
          "Lieu": "BD",
          "Pseudo": "Union Multitech Corporation",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T12:50:37.000Z",
          "Titre": "recover email last 7 days",
          "Contenu": "best support but not recover my email your team for utcbd.net,"
        },
        {
          "Note": 5,
          "Lieu": "OM",
          "Pseudo": "Ahmed Saif",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T11:55:49.000Z",
          "Titre": "an excellent experience",
          "Contenu": "I had an excellent experience with ScalaHosting, and I wanted to express my gratitude, especially to Mr. Dimitar, the support agent. Dimitar provided outstanding assistance, and his expertise was invaluable in resolving my issues. I highly appreciate the level of service and support I received from ScalaHosting, and I look forward to continued satisfaction with your services. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "GH",
          "Pseudo": "DAVID MADON",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T08:50:32.000Z",
          "Titre": "Valentin N",
          "Contenu": "Valentin N. is a professional. I really enjoyed my experience with him. Kudos"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Designtight Media",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T21:04:45.000Z",
          "Titre": "Customer service",
          "Contenu": "Their customer service is really fast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sotir Koev",
          "Nb_Reviews": 2,
          "Date": "2023-10-30T18:50:58.000Z",
          "Titre": "Antonio is amazing and very…",
          "Contenu": "Antonio is amazing and very knowledgeable, he helped me with my calendar questions, showed me tutorials and videos on how to resolve the issues!"
        }
      ]
    }
  ]
}