{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.goschock.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Patrick Phelan",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T21:09:10.000Z",
          "Titre": "I was told you would arrive between…",
          "Contenu": "I was told you would arrive between noon and 2 pm and the driver would call 1/2 an hour before arrival.  Driver arrived at 11 am, I was not there because the office was closed. I never saw the driver and I have no idea how well the work was done ."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Laura",
          "Nb_Reviews": 2,
          "Date": "2023-04-24T04:33:37.000Z",
          "Titre": "They committed to a date to pick up…",
          "Contenu": "They committed to a date to pick up shipment and was going to call first but no call or  notice.  Had to reach out to them to reschedule but again not flexible with date and if there is late charges I'm holding them responsible."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris P",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T18:44:32.000Z",
          "Titre": "Lack of communication",
          "Contenu": "I was supposed to be notified with a pick up time two days before. Didn’t get a call until the after 5 the night before. Driver shows up and asks for paperwork which I had for him, I then said I’d need a receipt. He said OK. He proceeded to remove the copy machine and when he was done asked me to sign a receipt. The receipt was for him. I asked for mine and he said I could take a picture? What the heck? You just took away my copy machine, if you didn’t have a receipt for me we could have made a copy BEFORE you removed the machine."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-14T20:39:37.000Z",
          "Titre": "Well I cant really submit a review…",
          "Contenu": "Well I cant really submit a review because they have yet to pick up my shipment.  It has been a week and we are getting nowhere with whom they outsourced the shipment to."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Janella",
          "Nb_Reviews": 2,
          "Date": "2020-08-24T18:49:05.000Z",
          "Titre": "Our copiers were not picked up",
          "Contenu": "Our copiers were not picked up.  I'm still waiting to be notified as to when they will reschedule."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Devin",
          "Nb_Reviews": 1,
          "Date": "2019-04-26T22:27:54.000Z",
          "Titre": "Poor planning and communication",
          "Contenu": "Schock Logistics was to pickup and deliver a copier from one of our buildings. I made arrangements and had added in the notes to give a 24 hour advance call to coordinate having staff available to open the door for them. Driver called when they were at the building, and stated that they would just come back the next week as they are only in the area once a week. I let the driver know that the next week wasn't an option as we were moving buildings and needed to have all equipment out. I called the Schock representative who stated that it would be an additional $123.00 charge to pick it up the next day between 9:00 am- 3:00 pm. reluctantly I paid the additional pickup fee and arranged to be available between the times they listed for pickup. I called representative at 2:30 pm and asked for an update as it was getting close to the expected pickup time. Representative called the contacting company truck driver (two different companies involved) and they told me they wouldn't be there until 5:00 PM. At 4:30 the truck driver calls and states that it will not be until after 6:00 pm. I called the dispatcher directly and they were able to get another truck to come and pick up the equipment. I spoke to a Schock supervisor and he stated that he would correct the problems and follow-up with me the following morning, which he did not. Schock was very unhelpful at scheduling (I had to go straight to the dispatcher of the contracting company) and making the pickup correctly. Will not be using this company in the future."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customerShiawassee YMCA",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T19:06:08.000Z",
          "Titre": "They havent picked up our copier",
          "Contenu": "They havent picked up our copier. We paid invoice 10 days ago."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "TY",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T23:01:29.000Z",
          "Titre": "Still waiting for a scheduled pickup."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T20:45:09.000Z",
          "Titre": "Constantly revised quotes/added fees."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Financial Engines",
          "Nb_Reviews": 1,
          "Date": "2017-04-21T14:31:44.000Z",
          "Titre": "Working with Schock Logistics was not a …",
          "Contenu": "Working with Schock Logistics was not a problem until my shipment arrived at it's destination damaged and no longer functioning. The company sent photos of the way the equipment was shipped and frankly I'm disgusted by the sloppy unprofessional way the equipment was packaged. There was no bubble wrap or padding and the box looked like it was much to big for the equipment. Now that it's time to talk insurance covering the damage I can't get anyway to answer the phone or call me back My company would never work with them again. Big disappointment"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric Forcey",
          "Nb_Reviews": 1,
          "Date": "2016-07-28T00:01:51.000Z",
          "Titre": "Poor customer service",
          "Contenu": "Once you get a quote they pester you until you schedule the pick up. They don't give you a date but say you will be called with 24hr notice. That doesn't happen. They show up out of the blue unannounced. Very poor customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lee",
          "Nb_Reviews": 1,
          "Date": "2018-04-25T03:37:35.000Z",
          "Titre": "Very bad experience.",
          "Contenu": "Very bad experience.  I must say I used your company 4 times and got over charged on the invoice and the driver said one thing and the customer service say another BS. Very bad experience.."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Taylor",
          "Nb_Reviews": 1,
          "Date": "2019-02-21T10:05:06.000Z",
          "Titre": "Suppose to rate experience after last…",
          "Contenu": "Suppose to rate experience after last shipment.  Well, they still haven't picked it up.  They're not very reliable."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steven",
          "Nb_Reviews": 1,
          "Date": "2017-02-03T14:15:58.000Z",
          "Titre": "To difficult",
          "Contenu": "19 emails over the course of 2 days. Not sure why all of this information was not on the online form."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shlome",
          "Nb_Reviews": 1,
          "Date": "2017-06-18T23:06:05.000Z",
          "Titre": "I waited for a month to get delivered"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Matthew",
          "Nb_Reviews": 6,
          "Date": "2017-05-17T03:57:48.000Z",
          "Titre": "you havn't picked it up yet"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Beth",
          "Nb_Reviews": 1,
          "Date": "2021-04-07T14:12:05.000Z",
          "Titre": "Negligent handling",
          "Contenu": "The process of requesting and receiving the quote and then arranging for shipping was quick and easy. However, when the equipment was picked up the driver REPEATEDLY DROPPED each printer before getting them loaded onto the truck. We chose Schock because they were a preferred shipping provider for our equipment leasing company. But, the negligent handling of the equipment caused additional work and documentation for our team. I would not use or recommend Schock Logistics in the future."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tracy",
          "Nb_Reviews": 1,
          "Date": "2019-04-05T21:22:02.000Z",
          "Titre": "Lack of communication - very disappointing and frustrating",
          "Contenu": "Not sure that I would recommend Schock Logistics.  I received a message on Monday, March 25, 2019 asking to schedule a pick up of our old copier.  I tried to call Jeff back twice on Monday, once on Tuesday, and once on Wednesday and left messages each time.  Then on Thursday, March 28, 2019, there was a delivery company on my door step expecting to pick up the old copier.  I was not aware of this at all.  Not impressed that the pick up was just scheduled without any conversation with me.  Extremely lucky that I was not in a scheduled meeting.  I definitely had to scramble to get the paperwork together that was required to be sent with the copier.  The driver was understanding and was able to wait a little extra time to allow me to get everything together. ."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2020-10-05T13:49:04.000Z",
          "Titre": "Schock Logistics personnel were…",
          "Contenu": "Schock Logistics personnel were friendly and kind. I did not know that they would subcontract out the job when working with them. This would have been nice to know when paying such a large amount to move something. The third party company was horrible. They wouldn't answer their phones when calling them. They wouldn't call back when they told you they would. When they showed up they guys wanted to use our dolly that we had in our warehouse. I could only imagine what they would have done if we didn't have one. They didn't handle the machine with care. Made me wish we had taken out insurance because it didn't look like they cared at all if it broke or not."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Allison",
          "Nb_Reviews": 1,
          "Date": "2019-01-30T15:09:55.000Z",
          "Titre": "I'd look somewhere else for shipping",
          "Contenu": "After payment, I was told I would be contacted within 24 hours to schedule a pickup.  We waited three days and called Schock and were again told they would call us to schedule pickup in 24 hours. We finally were scheduled for pick up and it was cancelled 3 times.  When final pickup was to happen - I was told first thing in the morning- it didn't occur until after 3:30PM.  Driver while friendly and polite needed me to show him where to find the serial number on the machine."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Peter",
          "Nb_Reviews": 1,
          "Date": "2015-01-23T02:55:01.000Z",
          "Titre": "Incorrect information provided",
          "Contenu": "When I contacted Schock Logistics, Inc for information regarding the pick up of my delivery they told me that the driver attempted to call me and set up the time but I never responded.  When I spoke to the driver the following day he stated he never called because he didn't have our number.  I then called Schock Logistics back and they then told me that they would pass the number on to the office staff would be meeting the drive..and they failed to do that as well.  They accepted my payment without problem, but couldn't get the logistics taken care of...not what I would've expected."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Shirley",
          "Nb_Reviews": 2,
          "Date": "2015-12-11T22:59:03.983Z",
          "Titre": "Not quite the experience I had hoped for.",
          "Contenu": "I thought it was a bit expensive considering that there was a 2 week wait. And on the day the machine was picked up the men were almost 2 hours later than the contract specified. Their end of the contract was not held up."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Catherine",
          "Nb_Reviews": 1,
          "Date": "2015-07-08T17:58:57.000Z",
          "Titre": "Beyond Frustrated",
          "Contenu": "Once I set up the pickup of our copier it was a quick response to get the copier decommissioned. However, from that point forward the process was less than adequate - after 14 days I have yet to hear from the freight company who was suppose to pick up the copier to even schedule a pickup. I received this email to review the company prior to them even scheduling the pickup. Upon calling the company to see what was going on I was put on hold for 10 minutes and then told they would have to call me back. I asked why we had not received a call to even schedule the pickup when I was given the time-frame for which it should be picked up and now that time frame has 24 hours - the gentleman on the phone seemed very annoyed I would even ask this question and responded with \"who would give you a time-frame?\" and \"when were you given this supposed time-frame?\" then told me he would have to call me back when he had more information. Highly disappointed in the customer service from this company and the follow through."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "M.Skidmore",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T18:16:35.000Z",
          "Titre": "It's been a couple of weeks since we…",
          "Contenu": "It's been a couple of weeks since we made the request for the pickup.  Have heard nothing and the product is still setting in our warehouse."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anthony",
          "Nb_Reviews": 1,
          "Date": "2023-02-12T22:08:21.000Z",
          "Titre": "Final rating is still to be determined",
          "Contenu": "Final rating is still to be determined. I called the company to schedule a pick up for a particular delivery date. The pickup company came later than I was expecting. There is still time for the delivery company to deliver the equipment by my requested delivery date."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cynthia La Marche",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T21:20:54.000Z",
          "Titre": "Good Office Reps, Poor Carrier",
          "Contenu": "Office representatives Kevin and Amable have been friendly and professional. They have answered questions and responded promptly to communications. Amable was even so kind as to contact me immediately when I made the mistake of removing the hard drive from our copier, which I very much appreciated! And because she called me promptly, I was able to recall our copier service technician to return to reinstall it, preventing expensive fees at the destination. I give Kevin and Amable and Spencer Schock 5 stars.The contracted freight carrier, however, could improve. We paid the invoice and returned the waiver by the morning of June 20. The driver called once on June 21, but since then their communication has been poor to nonexistent. There have been two failed pickups so far with no communication from the carrier. The first time the explanation was a major freeway crash, but there was no call informing of this delay. For yesterday's failed pickup there was neither a call nor an explanation. Today I have been expecting another pickup, but it appears likely that it will not happen within the next 45 minutes as I write this. Delays are understandable, but prompt communication regarding the delays would be welcomed.I have been communicating with Amable to try to get this pickup completed, and my attitude at this point is, \"I'll believe it when I see it.\" Spencer Schock has offered to cover the imminent penalty fees for a late return, which is much appreciated. It would just be so nice if the carrier were reliable and communicative. I give three stars only because of this poorly behaved contractor."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Louise",
          "Nb_Reviews": 1,
          "Date": "2019-04-24T14:52:35.000Z",
          "Titre": "The trucking company scheduled to pick…",
          "Contenu": "The trucking company scheduled to pick up the machines cancelled the first day, re-scheduled and showed up over 1 hour late on that day."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Customer Bowden Energy Company",
          "Nb_Reviews": 1,
          "Date": "2022-01-15T20:04:26.000Z",
          "Titre": "I have been in touch with A & B…",
          "Contenu": "I have been in touch with A & B Business Solutions. They claim to not have received the machine as yet. It was picked up December 16,2021 at 10:00 AMI do not want to have to pay for a machine I do not have. I also paid for insurance"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Harvey",
          "Nb_Reviews": 1,
          "Date": "2020-06-02T23:27:39.000Z",
          "Titre": "Equipment was too large for one driver",
          "Contenu": "Equipment was too large for one driver. We had to assist but paid you for the service"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Valerie",
          "Nb_Reviews": 1,
          "Date": "2018-09-24T16:45:54.000Z",
          "Titre": "Polite but unprepared",
          "Contenu": "The gentleman who came, was polite.  The only issue was that he didn't have any type of equipment to pick up the equipment.  Thankfully he used one of our rolling chairs to place the 5 copiers (1 by 1) to take them inside the truck.  Just an advice, bring something that can help you carry the heavy equipment for your customers.  Thank you for helping us out!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Susannah",
          "Nb_Reviews": 1,
          "Date": "2016-06-28T15:48:27.000Z",
          "Titre": "Estimate Process was highly confusing",
          "Contenu": "I found the process of getting the estimate very confusing. The questionnaire that had to be filled out was not very clear on all of the questions, and some answers generated an up-charge and had to be clarified. The de-install options were also not very clear and this took more time to get that sorted out. All of the staff I worked with were very helpful after I asked questions, and response time was quick."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Debbie",
          "Nb_Reviews": 2,
          "Date": "2018-02-21T12:46:24.000Z",
          "Titre": "My overall experience has been good",
          "Contenu": "My overall experience has been good. However, the paperwork has my name on it but the drivers continue to ask for someone else and the drivers are not consistently calling in advance to let me know when to expect them. This is information that is vital because we do have other trucks going in and out of the warehouse."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "D.Doyle",
          "Nb_Reviews": 1,
          "Date": "2018-11-06T17:51:18.000Z",
          "Titre": "The crew who arrived to pick up our…",
          "Contenu": "The crew who arrived to pick up our equipment left us a bit concerned because of the way they handled it.  That said, once we voiced that concern with the carrier, they were quick to ensure us that everything would be covered and we even received a call from the owner.  I would use them again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Debbie",
          "Nb_Reviews": 2,
          "Date": "2019-03-04T19:09:01.000Z",
          "Titre": "Turn Around",
          "Contenu": "If there was a way that the paperwork could be turned around quicker. This process seems to take awhile. If it was cut down to a 3-4 hour window that would be great! Having the drivers contact the company at least 24 hours in advance of pick up would be wonderful."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dr. Pratt, Alameda, CA",
          "Nb_Reviews": 2,
          "Date": "2019-03-05T00:54:45.000Z",
          "Titre": "They were pricey",
          "Contenu": "They were pricey. I don't know if I paid more for the five steps in front, because we have a wheel chair ramp on the side that they never asked us about. I'd like to know the answer to that."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-14T20:14:42.000Z",
          "Titre": "Their system seemed easy to use."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kathy",
          "Nb_Reviews": 2,
          "Date": "2015-02-25T14:44:24.000Z",
          "Titre": "Tech was polite but....",
          "Contenu": "The technician who was sent to decommission our copiers was prompt, and polite. On the other side - he reeked horribly of cigarettes and alcohol."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Phil Vigil",
          "Nb_Reviews": 1,
          "Date": "2016-11-08T22:50:04.000Z",
          "Titre": "Review",
          "Contenu": "It simply took an longer to have the shipment to be delivered to the destination and than it took longer to get the POD."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2017-05-11T19:20:29.000Z",
          "Titre": "Since the equipment has not been picked …",
          "Contenu": "Since the equipment has not been picked up or shipped yet this seems a bit premature."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nick",
          "Nb_Reviews": 1,
          "Date": "2019-01-31T19:04:35.000Z",
          "Titre": "Should have called",
          "Contenu": "I did not recieve a phone call when they arrived to pick up our copiers."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kendall",
          "Nb_Reviews": 1,
          "Date": "2015-11-20T17:18:45.355Z",
          "Titre": "Got the job done, but with little communication",
          "Contenu": "This review was emailed to a Schock representative. After she received the email, she forwarded it on and I was promptly called in order to get more information about the issues that I had. Schock clearly cares about their customers, but it's their third parties that do not. \r My initial complaint is as follows: \r\"I'm not generally one to complain about how processes are handled, but I have to say that I was hoping that this shipping and de-installation would go much smoother than it did. \r Though the process has been timely, I have been completely cut out of the communication loop. I had a Toshiba representative show up completely unannounced on Friday to take out our hard drive. Luckily, our new printer was coming the same day, but if this had been the case, we would have been totally out of luck all of Friday and possibly Monday. I was originally told that the printer was to be taken apart on Tuesday or Wednesday. \r Today, I was supposed to receive a call 30 prior to the pick-up of the Toshiba. I either did not receive a call or at least was left no message at all, and he came during the one time of day I had told the shipping representative that we would be at lunch. One of my managing partners had to receive him with no prior knowledge of the transaction, he was just signing in hopes that someone wasn't stealing our old printer. \r Basically, everything that has happened has happened by surprised and not according to plan.\""
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sara",
          "Nb_Reviews": 3,
          "Date": "2014-12-10T15:14:10.000Z",
          "Titre": "Copier delivery",
          "Contenu": "I never got any feedback that the copier was delivered."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Roslyn",
          "Nb_Reviews": 1,
          "Date": "2018-06-26T12:12:00.000Z",
          "Titre": "too expensive"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T16:36:03.000Z",
          "Titre": "The shipping process was easy",
          "Contenu": "The shipping process was easy. The representatives were knowledgeable and friendly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matthew",
          "Nb_Reviews": 1,
          "Date": "2020-03-26T17:52:29.000Z",
          "Titre": "Great Communication",
          "Contenu": "Would have been five stars, but it was a bit of a hassle getting the printer picked up - but not completely Schock's fault.  It was an issue with the Serial Number and once we got that fixed, it was a quick pickup.Throughout the whole process, everyone was very professional and quick to respond.  Would recommend"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 1,
          "Date": "2021-12-17T23:37:56.000Z",
          "Titre": "Good stuff",
          "Contenu": "The pickup crew of 1 man, was great and all that was needed.  Quick & open to assistance where I could help was wonderful along with rolling with a few small changes to complete the job in an easier and lower cost effort."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "John Kelly - Hyground Consulti",
          "Nb_Reviews": 1,
          "Date": "2020-11-12T16:30:39.000Z",
          "Titre": "We teamed up with Schock Logistics this…",
          "Contenu": "We teamed up with Schock Logistics this summer for all our logistical printer moves across the US. The team are communitive & information and billing is clear and so far so good with collections & great customer service :)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jo Ann",
          "Nb_Reviews": 3,
          "Date": "2019-10-10T18:52:15.000Z",
          "Titre": "Good job, thorough, would definitely use again.",
          "Contenu": "Good job, thorough, needs more communications.  I had to request ETA a couple times on both sides -- the pick up and delivery.  Would definitely use again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-06-23T20:51:30.000Z",
          "Titre": "It is kind of a complicated process…",
          "Contenu": "It is kind of a complicated process filling out the form.  Other vendors it is here is the machine and the address thanks."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2019-07-15T13:10:51.000Z",
          "Titre": "Good to work with",
          "Contenu": "Good to work with, they did miss the original pick up time but still got the shipment there on time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2022-10-19T20:41:23.000Z",
          "Titre": "It seemed to take a little longer than…",
          "Contenu": "It seemed to take a little longer than it use to when Amable was assisting with quotes."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ricardo",
          "Nb_Reviews": 1,
          "Date": "2020-03-18T16:22:32.000Z",
          "Titre": "was a pleasure working with Schock…",
          "Contenu": "was a pleasure working with Schock Logistics, they knew what they were doing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T21:15:01.000Z",
          "Titre": "Apprecaited",
          "Contenu": "The process was smooth, and the communication was timely. I appreciate the customer service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 1,
          "Date": "2019-06-21T17:59:39.000Z",
          "Titre": "Your folks were very understanding with…",
          "Contenu": "Your folks were very understanding with us as we had an internal issue with placing a PO and determining method of payment."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Katie",
          "Nb_Reviews": 1,
          "Date": "2019-11-06T19:30:07.000Z",
          "Titre": "I found them to be very responsive to…",
          "Contenu": "I found them to be very responsive to all my questions.  Very dependable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tina",
          "Nb_Reviews": 1,
          "Date": "2020-02-26T00:36:35.000Z",
          "Titre": "Recommended by Lease Company",
          "Contenu": "I only had contact over the phone to set up the move of our copier. Seemed to be fast and efficient."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T18:48:57.000Z",
          "Titre": "Price-matched a competitior's offer",
          "Contenu": "Price-matched a competitior's offer. Awesome!  But communication to arrange the pick up by the carrier was not as expected."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Van",
          "Nb_Reviews": 1,
          "Date": "2019-05-02T13:02:25.000Z",
          "Titre": "The Staff was very prompt and concerned…",
          "Contenu": "The Staff was very prompt and concerned about my shipping needs."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2021-01-13T20:23:32.000Z",
          "Titre": "They were efficient snd worked quickly"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Greg",
          "Nb_Reviews": 1,
          "Date": "2020-04-23T19:53:13.000Z",
          "Titre": "Initial communications sometimes were…",
          "Contenu": "Initial communications sometimes were lacking detail, but replies to questions were surprisingly fast."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ray",
          "Nb_Reviews": 1,
          "Date": "2016-10-21T17:59:00.000Z",
          "Titre": "Partnership Review",
          "Contenu": "i enjoy working with the Schock team, they are always helpful and friendly. They respond quickly and without issue. The local company that picks up the freight is not so accommodating. they rarely call ahead and they don't always show up when they do say they will. If and when i call the local company, i leave a voice mail because you cannot get a live person and then they do not respond to the voice mail."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Angela",
          "Nb_Reviews": 1,
          "Date": "2019-12-24T15:24:57.000Z",
          "Titre": "We have never had a problem with…",
          "Contenu": "We have never had a problem with reliability and courtesy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ade",
          "Nb_Reviews": 1,
          "Date": "2016-03-09T20:37:00.000Z",
          "Titre": "Good customer service and helpful",
          "Contenu": "Used Schock for the first time. Reps were great even when I had to change my estimate a couple of times. Quick response. Deinstallation guy had a great personality. Only thing was the scheduled pick up driver came earlier than what was in my confirmation email. Pick up was scheduled for 12-5p. Driver came just after 9am because he was in the area. Good thing someone was at the office to assist him."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tony",
          "Nb_Reviews": 1,
          "Date": "2016-03-05T14:38:03.411Z",
          "Titre": "copier good bye",
          "Contenu": "Most of our issues were not Schock Logistics fault but Modern Office Methods.  We were not offer another option for shipping other than handle it yourself and take all the risk.  The paperwork given by MOM did not match the copier being picked up which caused some confusion at pick up.  The guys picking up the copier did a very good job and very professional."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2015-05-06T19:07:46.000Z",
          "Titre": "Quick service, takes care of everything",
          "Contenu": "Once made payment, Schock organized everything. Didn't have to call anybody, they called me to set things up for hard drive removal and pickup. Very pleased! Only thing is that hard drive removal should be close to $500. Hard drive itself is less than $100, should cost $400 for someone to replace the hard drive, which takes less than 60 minutes."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alissa",
          "Nb_Reviews": 1,
          "Date": "2016-08-08T19:59:23.000Z",
          "Titre": "No Problems, could have been a little better with communication",
          "Contenu": "I had no problems working with Schock Logistics. The process went smoothly.  They could have been a little better with communicating when they were going to show up.  I got a call the day of when the tech was coming and the day before for the pickup. I would've like a little more of a heads up, but it all worked out fine."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jacqueline",
          "Nb_Reviews": 1,
          "Date": "2016-07-01T14:21:46.000Z",
          "Titre": "Good Service, No Issues",
          "Contenu": "They were professional, got our copier from our one office location to another one without any issues. I did think that the shipping did take a long period of time to get from only Albany, NY  to Brooklyn, NY (over a week). Also we did not get to pick the day that the unit was picked up, but rather had to wait until we received a call from the shippers arranging for pick up. However, the price was very affordable and we were not in a rush to have the item shipped so it all worked out well for us."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Oakland",
          "Nb_Reviews": 1,
          "Date": "2016-10-20T23:51:18.000Z",
          "Titre": "Printer return",
          "Contenu": "The only criticism I might mention is the actual shipping company, W.B.T. that GoSchock contracts were perfectly nice but a bit unprofessional. When they left a message they never left their name. when I returned the call I had no idea who to speak to. Also, they answered the call with \"Hello\" rather than acknowledging who and what I was calling. It was a bit disconcerting.  That said, the staff and staff I worked with directly with GoSchock were flawless. Pleasant, accommodating, informative, knowledgable. I would not hesitate to work with them again. Thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2016-08-26T16:50:14.000Z",
          "Titre": "Great service!",
          "Contenu": "Very responsive to every email/phone call. Of concern was the company hired to pick up our equipment. They were very careless when moving/loading our equipment. I wouldn't be surprised if the piece was damaged before it left our building."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ken Novet",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T18:49:29.000Z",
          "Titre": "Timely and efficient"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 1,
          "Date": "2017-10-09T13:31:08.000Z",
          "Titre": "Very Good",
          "Contenu": "It took a couple extra days to get to the destination, which was odd since it made it 95% of the way there in a day, then stalled for a couple days. The sales team was very easy to work with though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bob",
          "Nb_Reviews": 1,
          "Date": "2015-04-27T15:52:22.000Z",
          "Titre": "Service OK but not called on day of pickup",
          "Contenu": "Schock visited our site twice to pick up a shipment. The first time they had not contacted me in advance, so we had to reschedule. The second time they came, they did not contact me either."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Drenda",
          "Nb_Reviews": 1,
          "Date": "2017-09-05T12:49:03.000Z",
          "Titre": "They were great in helping me deal with …",
          "Contenu": "They were great in helping me deal with the paper work and then the guys that came to pick up the machine were nice and helpful.  Everyone helped me so much!!Thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2017-05-31T18:12:05.000Z",
          "Titre": "They were quick and prompt",
          "Contenu": "They were quick and prompt. Didn't get pushy when things slowed down on my end. Once everything was approved they were out here quickly to get our stuff moved."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Susan",
          "Nb_Reviews": 1,
          "Date": "2017-05-19T22:57:03.000Z",
          "Titre": "Very good people to work with.",
          "Contenu": "They were very helpful and easy to work with.  They are very quick to get back to you if you have any questions.  I thought their pricing was very fair."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer Jeri Coin",
          "Nb_Reviews": 1,
          "Date": "2016-05-18T17:25:16.000Z",
          "Titre": "Schock Logistics great for freight!",
          "Contenu": "Had a great experience and was updated with email; today received confirmation the freight was received at the destination.  Will recommend this company."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gregg @ Grimes County, Texas",
          "Nb_Reviews": 1,
          "Date": "2018-06-21T22:36:51.000Z",
          "Titre": "Good, Friendly service!",
          "Contenu": "We had to ship 2 copiers back to the finance company.  Schock Logistics provided great, friendly, professional service and made the transaction easy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lila",
          "Nb_Reviews": 1,
          "Date": "2016-04-05T21:21:59.000Z",
          "Titre": "Good communication and good customer service.",
          "Contenu": "It would have been nice if they called me with the pickup time/ delivery time.  I had to call them, but I think I would use them again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer - Vibra Hospital",
          "Nb_Reviews": 1,
          "Date": "2018-08-23T22:26:01.000Z",
          "Titre": "Their service was good",
          "Contenu": "Their service was good and they were timely. I would use them again. Walking on water is the only thing that qualifies for 5 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2017-09-06T19:30:53.000Z",
          "Titre": "Everything was done in a timely manner …",
          "Contenu": "Everything was done in a timely manner with little friction.  Thanks for the professional manner in which everything was handled."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2015-10-30T19:10:05.423Z",
          "Titre": "Ontime Quick and painless",
          "Contenu": "My experience with chock logistics was a pleasure.\rFrom the order taker to the truck driver and mover helper. All Good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike Northen",
          "Nb_Reviews": 1,
          "Date": "2015-08-22T00:30:18.752Z",
          "Titre": "Copier Pickup Pflugerville",
          "Contenu": "Schock did their job well setting up shipping.\rI do have one concern about the loading procedure of the shipping company that actually picked up the copier. We were liable for the condition of the machine until it got to the end delivery point. I was concerned that the copier was simply rolled down the outside walk on the plastic wheels on the copier cabinet. The wheels are not that strong and if they had broken and the machine collapsed, it would have done serious damage before it ever got to the truck.The machine was not shrink wrapped until right before they loaded it on the truck. I would have been pleased more if the machine had been loaded, shrink wrapped and strapped on a flat dolly to transport it to the truck.\rI did not stay at the truck long enough to see that it was actually blanket wrapped it before being strapped in for travel. It would have been better for all this to happen before I signed the released and right before they left the property. \rYes, we did take out liability Insurance but I would have preferred more care had been taken to protect my investment in the event there was something damaged that the Insurance would not cover."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 1,
          "Date": "2016-01-30T03:14:07.306Z",
          "Titre": "First-time user found what was promised did happen",
          "Contenu": "Have never before had occasion to use this transportation provider. But it was a very smooth transaction."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paula",
          "Nb_Reviews": 1,
          "Date": "2017-10-12T12:04:28.000Z",
          "Titre": "Easy to work with.",
          "Contenu": "Are easy to work with. I do recommend Schock Logistics to anyone that needs this service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bob",
          "Nb_Reviews": 1,
          "Date": "2019-03-21T20:27:42.000Z",
          "Titre": "just started working with Schock",
          "Contenu": "just started working with Schock.  First impressions are good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hope Lutheran Church",
          "Nb_Reviews": 1,
          "Date": "2018-05-06T13:23:56.000Z",
          "Titre": "Fast and Easy",
          "Contenu": "Setup was easy and pickup was unexpected, but went smoothly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ta-Shakira Owes",
          "Nb_Reviews": 1,
          "Date": "2015-11-26T21:13:35.895Z",
          "Titre": "Customer service",
          "Contenu": "Great customer service. Always followed up with phone calls."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karen",
          "Nb_Reviews": 1,
          "Date": "2019-09-10T17:13:03.000Z",
          "Titre": "Good Experience.",
          "Contenu": "Good experience.  Very helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lodi Community Church",
          "Nb_Reviews": 1,
          "Date": "2017-01-19T16:30:03.000Z",
          "Titre": "Good Experience",
          "Contenu": "A bit pricey but great service and wonderful people."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amy",
          "Nb_Reviews": 1,
          "Date": "2018-11-08T17:18:20.000Z",
          "Titre": "They did a good job for us",
          "Contenu": "They did a good job for us, and quick service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nguyen, Kimxuan T",
          "Nb_Reviews": 1,
          "Date": "2023-02-20T22:17:45.000Z",
          "Titre": "Great",
          "Contenu": "Great ! Thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 1,
          "Date": "2016-12-27T16:47:06.000Z",
          "Titre": "good company",
          "Contenu": "they do a great job."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mandy",
          "Nb_Reviews": 1,
          "Date": "2016-03-01T20:17:12.912Z",
          "Titre": "Review",
          "Contenu": "Easy to work with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Allison Garcia-BONT management",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T22:52:15.000Z",
          "Titre": "Instructions were simple and easy",
          "Contenu": "Instructions were simple and easy. Maria Swisher was always available if I had any questions. Great service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Northland Cathedral",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T18:03:30.000Z",
          "Titre": "The delivery person was very…",
          "Contenu": "The delivery person was very professional and efficient.  All went well.  Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David K",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T19:45:35.000Z",
          "Titre": "Expensive, yet worth it...",
          "Contenu": "Other than cost-wise (really expensive!), I'd say I didn't have any problems with Schock. The only part I find ridiculous is paying extra to set a specific time/date on when to settle the pick-up, but in the end, Schock was able to handle the moving operation and made it easier overall. Thankfully they were one of the only companies to have valid insurance (Certificate of Liability) so I guess that's another reason I'm not disappointed in their service. To be honest, I would give them a 4.5-star review due to the high cost but at this point, it doesn't matter since they got the job done real quick. Big shout out to Amable for the great help!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Weathershield Roofing LLC",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T23:50:49.000Z",
          "Titre": "They responded quickly to my inquiry…",
          "Contenu": "They responded quickly to my inquiry and got back to me with a quote the next day. We needed to have the leased equipment returned before a certain date and they expedited the pick up so that we were able to meet that deadline. Would definitely use their services again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dee",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T20:37:39.000Z",
          "Titre": "The team responded quickly to my…",
          "Contenu": "The team responded quickly to my original request.Maria Swisher answered all of my questions and was very friendly.Jeff, the driver, arrived on time and was very friendly.  He took care of all of the moving and packaging of the equipment in a timely manner.The whole processes when very smoothly.  Thanks so much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T01:20:54.000Z",
          "Titre": "Fast and easy",
          "Contenu": "Prompt response for a quote and an easy, efficient process to arrange the pick up of a printer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rhonda",
          "Nb_Reviews": 2,
          "Date": "2023-11-07T22:52:49.000Z",
          "Titre": "Professional and Prompt Service",
          "Contenu": "The technician who arrived was professional, friendly, and courteous.  He was prompt in his arrival and respectful of the property."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sally Guthrie",
          "Nb_Reviews": 2,
          "Date": "2023-06-05T21:42:27.000Z",
          "Titre": "They take all the stress off your shoulders!",
          "Contenu": "My entire interaction with Schock was made as easy as possible.   Everyone I spoke with was friendly, professional and so helpful to my needs.  Their forms were easy to understand and complete.  They followed up each email and phone call immediately and answered all my questions.  The equipment move was done seamlessly. They took all the stress off my shoulders!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Al",
          "Nb_Reviews": 7,
          "Date": "2023-09-20T19:22:26.000Z",
          "Titre": "The Customer Service team is excellent",
          "Contenu": "The Customer Service team is excellent.  Always fast and courteous.  I exclusively use Schock Logistics for all my equipment moves and lease returns.Keep up the great work!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Law Offices of Jane Heath",
          "Nb_Reviews": 2,
          "Date": "2023-09-26T20:13:09.000Z",
          "Titre": "Smooth and Reliable Service",
          "Contenu": "Customer service was helpful and responsive, with clear explanations and prompt communication. The driver kept me informed about the pick-up, timely arrived and was courteous and efficient. I was promptly advised by email when the shipment was delivered."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicole",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T23:02:30.000Z",
          "Titre": "Highly Recommended Transport Service!",
          "Contenu": "Super easy to schedule! With only 4 business days before a long holiday weekend, they were able to get our pickup on the schedule and delivered our copier just a few days later! I received emails every step of the way to keep me updated with a tracking link as well. Customer service was excellent, competitive pricing, will most definitely be using Schock Logistics again! Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ty",
          "Nb_Reviews": 2,
          "Date": "2023-07-17T22:29:35.000Z",
          "Titre": "Best equipment movers for us.",
          "Contenu": "We have used Schock a number of times for our equipment moving and it's always a great experience.  Maria works with us to schedule the moves, and follow's up afterwards.  A super easy vendor to work with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Libby Lokey",
          "Nb_Reviews": 8,
          "Date": "2023-02-22T21:25:00.000Z",
          "Titre": "More great service by Schock Logistics",
          "Contenu": "I have used Schock Logistics for 7-8 years and they have been outstanding with each relocation they have conducted for us. We have experienced 2 situations over the years where equipment was damaged in the move, not by Schock, but Schock made good out of the situation above and beyond their promises. I highly recommend this company and their staff is equally great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Al",
          "Nb_Reviews": 7,
          "Date": "2020-09-09T22:59:52.000Z",
          "Titre": "I highly recommend Shock Logistics",
          "Contenu": "I highly recommend Shock Logistics for all your copier freight needs.  I have been using Schock for over a decade and they continue to provided the best customer service consistently year over year.  They are fair, fast and accurate.  I had one insurance claim years ago and Spencer and the team handled it without any issues.  I exclusively use Schock and I refer all my customers to Schock Logistics.Al LongSigna Digital Solutions, Inc."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-08-31T14:25:46.000Z",
          "Titre": "Great Experience",
          "Contenu": "I absolutely loved working with Amable on pickup and delivery. She was able to walk me through the entire process flawlessly and timely. She also took the time to explain step by step instructions to prepare the equipment for pickup. I will definitely use  Schock Logistics, Inc. again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2020-02-10T22:54:27.000Z",
          "Titre": "Still waiting",
          "Contenu": "*Update - immediately received very nice call from Spencer Schock explaining the delay.  I feel confident that Schock Logistics will resolve this in a timely fashion.Still waitingI'd like to give a great review, unfortunately I'm still waiting for the copier to be picked up, over a week after it was scheduled.  Credit card was already charged and still nothing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Al",
          "Nb_Reviews": 7,
          "Date": "2022-06-20T22:41:26.000Z",
          "Titre": "Thank you to the Schock Logistics team…",
          "Contenu": "Thank you to the Schock Logistics team for always providing excellence customer service at competitive rates!  Amable thanks again for the quick turn around!  You are awesome!Best Regards,Albert LongSigna Digital Solutions, Inc."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Al",
          "Nb_Reviews": 7,
          "Date": "2020-03-02T16:40:16.000Z",
          "Titre": "I high recommend Schock Logisitics for…",
          "Contenu": "I high recommend Schock Logisitics for your copier freight needs.  They have been serving our company for over 10 years and are extremely reliable.  Their follow up is great and they always keep me updated.You will not be sorry by choosing Schock Logistics."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2019-12-20T16:44:29.000Z",
          "Titre": "Last minute rescue!",
          "Contenu": "We were closing an office and realized at the 11th hour that we were not going to get the leasing company to pick up the Multi Function Printer we needed to return.  Schock Logistics was able to schedule and Pick up the printer in less than 24 hours and the closing went off without a hitch.  I would use their services again at any time and their customer service was pitch perfect."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Libby Lokey",
          "Nb_Reviews": 8,
          "Date": "2021-07-12T15:27:19.000Z",
          "Titre": "I have had the pleasure of working with Schock Logistics for many years",
          "Contenu": "I have had the pleasure of working with Schock logistics for several years now and each of the many moves have been conducted and completed just as agreed to by all people involved. With all the moves Schock has done for me over the years there have been only 2 situations where damage was incurred and this was accidently done by another carrier. Schock handled both situations very quickly and all was resolved almost immediately. I would highly reccommend Schock Logistics."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julie Vargas from MRC a XEROX",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T16:14:13.000Z",
          "Titre": "AMABLE!!!!!",
          "Contenu": "AMABLE!!!!!!  She is amazing.  Super helpful always.  Quick to get back to me.  Always going above and beyond.  I know that when I request from her, I can just forget about it because she takes the reigns and relieves me of all the stress in logistics.  I truly appreciate everything she does for our account.  I hope to never ever ever ever ever ever lose her :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cathy Raygoza",
          "Nb_Reviews": 1,
          "Date": "2019-11-08T13:18:14.000Z",
          "Titre": "The team at Schock Logistics was more…",
          "Contenu": "The team at Schock Logistics was more than professional.  They answered my every question and delivered on their promises - even earlier than what was scheduled.  Clearly, Schock is the best and most reasonably priced to meet and exceed your shipping needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Al",
          "Nb_Reviews": 7,
          "Date": "2021-12-15T16:52:11.000Z",
          "Titre": "Best freight company out there",
          "Contenu": "Best freight company out there.  Friendly and fast customer service.  Great value for the dollar.  I had an issue in the past and they resolved it right away.  They are truly a company you can count on.  I highly recommend Schock Logistics for all your copier freight requirements.Keep up the great work Team!Sincerely,Albert LongSigna Digital Solutions, Inc."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2020-08-27T19:53:21.000Z",
          "Titre": "I changed my mind several times about…",
          "Contenu": "I changed my mind several times about where and when to schedule the pick up and delivery of 2 copy machines. Amable O'Neal was extremely patient with my changes and sent me multiple quotes with complete professionalism.  Job was done perfectly. Thank you!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cherri Chestnut",
          "Nb_Reviews": 3,
          "Date": "2023-04-19T22:43:18.000Z",
          "Titre": "Everyone that I have worked with does…",
          "Contenu": "Everyone that I have worked with does an amazing job. They are patient with me and provide prompt, courteous feedback. If there is an error, everyone is quick to work with me with professionalism and kindness."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandy",
          "Nb_Reviews": 2,
          "Date": "2023-08-23T17:15:27.000Z",
          "Titre": "Schock Logistics was great to work with",
          "Contenu": "Schock Logistics was great to work with.  They did all the follow up and got everything scheduled very quickly.  Pickup was a breeze and the driver was personable, friendly and professional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T14:50:31.000Z",
          "Titre": "Great team that were very knowledgeable…",
          "Contenu": "Great team that were very knowledgeable and helpful through the entire process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "'Nanci Bushrow'",
          "Nb_Reviews": 5,
          "Date": "2022-02-23T18:42:03.000Z",
          "Titre": "Always a pleasure working with Schock",
          "Contenu": "Always a pleasure working with Schock.  With this transaction, Maria Swisher has been extremely helpful and patient.  I believe she went above and beyond to obtain the services we needed at the best cost possible.  I will definitely continue using Schock Logistics."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Al",
          "Nb_Reviews": 7,
          "Date": "2021-05-14T17:23:47.000Z",
          "Titre": "Excellent Partner",
          "Contenu": "In order to provide excellent service to my customers I rely on partners like Schock Logistics.  They are always responsive and dependable.  If there is any issues they are quick to help resolve them.  I highly recommend Schock Logistics for all your copier freight needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-13T17:05:21.000Z",
          "Titre": "The only communication glitch we had…",
          "Contenu": "The only communication glitch we had was letting me know when the driver would arrive to pick up the equipment. Thankfully, it was a day I was at the office and not working from home. The driver was really a nice man. All email communications have been great - I appreciated the notification when the equipment arrived at its final destination. I believe the cost of shipping and all other aspects were fair and efficient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "First National Bank & Trust",
          "Nb_Reviews": 1,
          "Date": "2020-02-18T13:20:21.000Z",
          "Titre": "Great service from your company",
          "Contenu": "Great service from your company.  Initial contact was very helpful with what was needed to get our shipment completed.  Extra work scheduled on the equipment was done when they said it would be and the equipment was shipped right on time.  Would recommend Schock Logistics and will use them again when needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jesse Hawthorne, Genesis Baptist Church Treasurer",
          "Nb_Reviews": 1,
          "Date": "2019-09-07T15:29:26.000Z",
          "Titre": "I looked into using Schock Logistics…Glad I looked into using Schock Logistics to transport our equipment.",
          "Contenu": "I looked into using Schock Logistics based on a friend's recommendation, and settled on using Schock because of that recommendation a the fact that the quote was about 60% of the next lowest quote I received.  I was extremely please with each of the employees with whom I interacted, especially the driver who picked up our equipment.  If I need such services in the future, there is no doubt that I will chose Schock.I would gladly recommend your company to anyone, based on my experience with you. I did business with you under contract # 84059."
        },
        {
          "Note": 5,
          "Lieu": "VE",
          "Pseudo": "Humberto",
          "Nb_Reviews": 2,
          "Date": "2021-01-19T19:03:25.000Z",
          "Titre": "Schock is among the very best!",
          "Contenu": "Schock is one of the most responsive companies that I’ve worked with. They have been taking care of our shipments for a number of years. They delivered our office equipment on time even during the COVID-19 pandemic."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bethany UCC",
          "Nb_Reviews": 1,
          "Date": "2022-08-23T23:29:51.000Z",
          "Titre": "We needed a company to pick up our…",
          "Contenu": "We needed a company to pick up our copier for return after our lease.  Schock had the best rates and very easy to complete our transactions.  The copier was picked up as promised and Billy was super friendly and helpful.  Highly recommend this company"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laura H",
          "Nb_Reviews": 1,
          "Date": "2020-12-14T17:19:53.000Z",
          "Titre": "This company is the best I have ever…",
          "Contenu": "This company is the best I have ever used for shipping. Everyone I made contact with during my shipment was professional, courteous and treated me like at person not a number. I was able to track my shipment until it reached its destination with no problems!If you need a great shipping company to take pride in their work... call Shock!Thank youLaura HDenver CO"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T15:31:00.000Z",
          "Titre": "My company just started utilizing…",
          "Contenu": "My company just started utilizing Schock and so far so good. Very responsive, professional, and know exactly what they are doing. We will continue to utilize Schock."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Freedom Church",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T18:38:38.000Z",
          "Titre": "Copier",
          "Contenu": "Once I gave them the information they needed I was done.  They told me when they were coming, they came. They were responsible and efficient. The driver was friendly and informative."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan G. Komen Nevada",
          "Nb_Reviews": 1,
          "Date": "2021-05-03T15:57:28.000Z",
          "Titre": "Great customer service",
          "Contenu": "Maria Swisher was a delight to work with. She always responded quickly to my questions, concerns, and emails. She made the process easy and stress free. Great job Maria!! We really appreciate your hard work and dedication! :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-06-29T22:49:57.000Z",
          "Titre": "I was very impressed with the quick…",
          "Contenu": "I was very impressed with the quick response and turnaround time with Schock.  I contacted them with an urgent request in the morning hours and it was resolved and equipment picked up by 1pm!  Very impressed and happy with my experience.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob",
          "Nb_Reviews": 1,
          "Date": "2019-09-04T23:48:42.000Z",
          "Titre": "I have been in the copier business for…",
          "Contenu": "I have been in the copier business for over thirty years now and have tried about every trucking company you can imagine to ship my lease returns back to the warehouses. Schock has been by far my best experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chana, Sukhvinder K",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T18:33:09.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "Excellent customer service. Quick response. Tracking & POD. Quick problem solving. being always there."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gayla",
          "Nb_Reviews": 1,
          "Date": "2021-09-30T16:46:42.000Z",
          "Titre": "We have shipped many machines through…",
          "Contenu": "We have shipped many machines through Schock and have never once experienced any problems.  Their Customer Service reps have always been prompt and courteous and eager to help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "S Ruhl",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T00:17:30.000Z",
          "Titre": "I don't even live in the country and…",
          "Contenu": "I don't even live in the country and Schock made sure everything was handled.  I cannot express enough my appreciation"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T19:38:48.000Z",
          "Titre": "Easy, fast and cost effective",
          "Contenu": "Service was great.  Communication thru the steps was timely and accurate.Easy to make the call and let Schock pick it up."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Libby Lokey",
          "Nb_Reviews": 8,
          "Date": "2021-01-05T19:45:31.000Z",
          "Titre": "I have heavily relied on Schock…",
          "Contenu": "I have heavily relied on Schock Logistics for 4-5 years to move and relocate copier equipment across the Unite States. I provide them location and relocation information and as much information as possible and they handle everything else from that request point forward. They provide me with an estimate and an ETA. They fully explain any information needed to all parties. They are also capable of handling any hard drives as requested. Schock has made my Fleet logistics Manager position so much easier due to their reliability.I think any other office equipment mover would pale compared to the professionalism and reliability Schock and the staff has provided over the past several years."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alberto Medina",
          "Nb_Reviews": 1,
          "Date": "2020-01-03T21:53:28.000Z",
          "Titre": "Schock Logistics picked up and…",
          "Contenu": "Schock Logistics picked up and delivered one of our equip in a very short time. Customer was under pressure to have this equipment transacted and Schock Logistics pulled it off. We are one very Happy Customer.  Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tony",
          "Nb_Reviews": 1,
          "Date": "2019-12-09T20:35:06.000Z",
          "Titre": "I deal mostly with Maria",
          "Contenu": "I deal mostly with Maria.  She has been outstanding and has very good follow-up.  In addition, the pricing is very competitive.  When you add that to the service, you get a trusted partner that looks out for you and handles every order just like I am the only client."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CHARLES",
          "Nb_Reviews": 4,
          "Date": "2019-08-14T23:10:59.000Z",
          "Titre": "They fulfilled every promise.",
          "Contenu": "We were at the end of lease for our copier/printer. Company we leased from told us to use Schock to return copier. We called on them and gave us great service. Step-by-step instructions, they fulfilled every promise and deadline for pick up. Price may have been a bit high for my liking, but you can't name a price for School assisting us in getting out of that cursed lease. That was priceless."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Al",
          "Nb_Reviews": 7,
          "Date": "2019-08-15T17:18:11.000Z",
          "Titre": "I highly recommend Schock Logistics",
          "Contenu": "I highly recommend Schock Logistics, Inc. for all your copier freight needs.  They have served me consistently for over 10 years.  They are quick to respond and get you a quote ASAP.  I have had the pleasure of working with other Dealers in the copier community that also use Schock Logistics and they have nothing but excellent things to say about their service.  I did have one issue in 10 years where a copier was lost.  Spencer was there with a check to replace it no questions asked.  Their insurance is well worth it.  Come to find out the copier was not lost after all only miss-placed. 5 Star Service, if you use them you won't be sorry!Al LongSigna Digital Solutions"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 2,
          "Date": "2020-08-04T12:23:04.000Z",
          "Titre": "Great service all around.",
          "Contenu": "The whole process was very painless. Kevin did a great job sending my estimates over to me and Jeff was in and out picking up the products. Would definitely use Schock Logistics again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cherri Chestnut",
          "Nb_Reviews": 3,
          "Date": "2022-10-17T17:13:43.000Z",
          "Titre": "The team at Schock is always pleasent…",
          "Contenu": "The team at Schock is always pleasent and prompt. They are always willing to help with any questions. The far exceed our expectations with getting back to us with quotes quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laura",
          "Nb_Reviews": 1,
          "Date": "2019-08-14T15:24:30.000Z",
          "Titre": "From the very first call to Schock…",
          "Contenu": "From the very first call to Schock Logistics pick up of our Xerox machines was flawless.  The entire team was quick to respond by email and great follow up by phone as well. The entire process was so quick and easy.I highly recommend them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cherri Chestnut",
          "Nb_Reviews": 3,
          "Date": "2022-02-23T20:48:56.000Z",
          "Titre": "It has been a pleasure working with…",
          "Contenu": "It has been a pleasure working with Schock Logistics. They are always very responsive with my requests for quotes and also any questions I may have. They are a pleasant group of people."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laurel Herndon",
          "Nb_Reviews": 2,
          "Date": "2020-01-02T14:49:18.000Z",
          "Titre": "Great custoemr service",
          "Contenu": "When I have had concerns, questions or issues with freight shipments, the team at Schock has provided fast, courteous responses. I appreciate the great customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Libby Lokey",
          "Nb_Reviews": 8,
          "Date": "2023-09-13T19:51:00.000Z",
          "Titre": "Schock always goes above and beyond to…",
          "Contenu": "Schock always goes above and beyond to get the task completed and communicated to the customer all the way through the process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T20:15:57.000Z",
          "Titre": "They make the website very easy to put…",
          "Contenu": "They make the website very easy to put in for a pickup for delivery.  They are very quick to respond with pricing and scheduling.   I am glad we found them to do our shipping of equipment.  It makes it less work fro us to try to find carriers that will ship to where we need them to."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "'Nanci Bushrow'",
          "Nb_Reviews": 5,
          "Date": "2021-02-05T20:19:45.000Z",
          "Titre": "This company is always efficient from…",
          "Contenu": "This company is always efficient from start to finish with my requests. They communicate with me the whole way through the transaction.  I've been using Shock for over 5 years now.  They save me a lot of time with what they do.  If I miss a step, they're right there for me.  As long as they keep up the great work that they do, I have no desire to go elsewhere."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shelley",
          "Nb_Reviews": 1,
          "Date": "2021-11-16T19:19:35.000Z",
          "Titre": "Have used this company several times",
          "Contenu": "Have used this company several times.  Always nice to work with and setting up the freight.  Very prompt at returning emails.  Thank you for your services. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2019-10-24T20:36:34.000Z",
          "Titre": "Didn't receive a call or email…",
          "Contenu": "Didn't receive a call or email notification that the truck was coming and happened to leave the office (I'm the only one that works here now) and saw a vehicle parked in the lot. Asked the guy if he needed help. He said he was waiting for the truck to pick-up the copier.  Well, okay, I said as I went back in the office!  He was very friendly and professional. Same with truck driver."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Northern California Copier Dea",
          "Nb_Reviews": 2,
          "Date": "2021-11-16T21:53:53.000Z",
          "Titre": "Schock is great to work with",
          "Contenu": "Schock is great to work with.  I never have to worry about returns when I get Amable involved.  She looks after things all the way through the process.  Schock Logistics has been our preferred shipper for years now."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Timothy",
          "Nb_Reviews": 1,
          "Date": "2020-05-06T21:52:36.000Z",
          "Titre": "Kudos to the Schock Logistics Team",
          "Contenu": "Requiring a return of equipment during the COVIC-19 pandemic, I expected to have a difficult time in arranging for transport and actual meeting for pick-up. The Schock Team provided efficient service, answered all questions, and promptly arrived at designated time -- going the extra mile to contact us to make sure someone was on site and available. Kudos to their efforts and service on our behalf."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SSP Inc.",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T17:55:41.000Z",
          "Titre": "Easy peasy, lemon squeezy",
          "Contenu": "I like getting things done online.The process was easy and self-explanatory.  The CSRs were polite and efficient and friendly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T14:15:00.000Z",
          "Titre": "It was a quick process and the…",
          "Contenu": "It was a quick process and the gentlemen was very nice, even asked how my day off was!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SLB of Iowa",
          "Nb_Reviews": 2,
          "Date": "2020-02-27T17:54:27.000Z",
          "Titre": "This company was easy to contact and…",
          "Contenu": "This company was easy to contact and supplied complete details on shipping a copier unit.  The scheduling for pick up was easy and completed in a timely manner.  Sent confirmation of delivery.  Good communication."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicole C",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T00:00:39.000Z",
          "Titre": "Schock Logistics saved my life!",
          "Contenu": "Schock Logistics saved my life! Okay that is a bit dramatic, but you know what I mean. I needed to have a copy machine and printer picked up and shipped out in 2 days or I would pay major fees. Schock pulled through and got the job done! I cannot thank them enough!!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ty",
          "Nb_Reviews": 2,
          "Date": "2020-08-14T22:20:30.000Z",
          "Titre": "Schock is our go to for equipment…",
          "Contenu": "Schock is our go to for equipment moving. I work with Maria.  She is very helpful and responsive.  Every job we utilize Schock for is done with the utmost in professionalism.    Five stars."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan Nakasone",
          "Nb_Reviews": 1,
          "Date": "2021-08-31T20:56:26.000Z",
          "Titre": "I've had the pleasure of working with…",
          "Contenu": "I've had the pleasure of working with Schock for the last 5 years. Everything gets delivered on time and the customer is service. Thank you guys so much! Amable, Kevin, Hayden and Maria are the best!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T19:29:36.000Z",
          "Titre": "Quick to respond",
          "Contenu": "very quick to respond to my request and also follow up. Driver was on time and experienced in moving equipment."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leandra Joseph",
          "Nb_Reviews": 1,
          "Date": "2020-12-15T03:09:33.000Z",
          "Titre": "Kevin was Awesome!",
          "Contenu": "Kevin was Awesome!It was a pleasure dealing with Kevin and Schock Logistics. My needs and issues were addressed and answers in a timely and professional manner. The technicians and trucking schedulers were flexible and understanding of the circumstances of accessing the office location to get to the machines. The actual personal who worked on and picked up the machines were friendly and professional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patty",
          "Nb_Reviews": 4,
          "Date": "2021-04-07T18:33:53.000Z",
          "Titre": "I am a logistics coordinator for a…",
          "Contenu": "I am a logistics coordinator for a digital office equipment company.  I use Shock Logistics often, they are prompt, easy to work with, and their prices are competitive!  I would highly recommend them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T16:29:08.000Z",
          "Titre": "Good service",
          "Contenu": "They came when they said they would and the customer service person sent a quote right away and then followed up."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harry McPartland",
          "Nb_Reviews": 3,
          "Date": "2021-07-15T19:33:27.000Z",
          "Titre": "Totally enjoy working w Amable",
          "Contenu": "Totally enjoy working w Amable. Excellent communication, timely and on top of her business. The best I’ve ever worked with!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gail",
          "Nb_Reviews": 1,
          "Date": "2020-08-07T21:44:22.000Z",
          "Titre": "Schock made a bad situation into a…",
          "Contenu": "Schock made a bad situation into a great experience.  I was always contacted in a timely manner every step of the way and everyone was very polite."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harold And Charlane Stephenson",
          "Nb_Reviews": 1,
          "Date": "2022-08-30T22:22:21.000Z",
          "Titre": "Thanks to Amable",
          "Contenu": "Amable was a wonderful representative of Schook Logistics, Inc.  She was extremely helpful and efficient in working out the details of getting our printer picked up and sent back to US Bank"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Candy",
          "Nb_Reviews": 4,
          "Date": "2021-09-08T14:15:15.000Z",
          "Titre": "I have worked with this company for…",
          "Contenu": "I have worked with this company for several years. They are the best in the industry.  Their team are very knowledgeable and extremely helpful. The best of partners to work with. I cannot say enough about their support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greg Wright",
          "Nb_Reviews": 1,
          "Date": "2022-08-19T00:59:16.000Z",
          "Titre": "This process has been great",
          "Contenu": "This process has been great, very quick to respond and are detail oriented in their process they follow to get you a quote."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2021-01-15T16:50:11.000Z",
          "Titre": "Professional, competent, good customer service",
          "Contenu": "We used Schock Logistics to transport a large copier to a nearby location, and they were professional and responsible.  Definitely will call on them again for shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lori",
          "Nb_Reviews": 1,
          "Date": "2020-07-07T12:56:28.000Z",
          "Titre": "great customer service Maria and…",
          "Contenu": "great customer service Maria and Spencer I believe was his name, the manager worked really well with me. friendly and customer service is excellent!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cytiva -WJM",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T18:45:37.000Z",
          "Titre": "Double checked all SN and made sure it…",
          "Contenu": "Double checked all SN and made sure it was correct in advance.  Communicated the process well.  Showed up on time and ready.  Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-06-17T01:58:35.000Z",
          "Titre": "I appreciated the timely responses to…",
          "Contenu": "I appreciated the timely responses to my request for a quote and related questions.  This ultimately impacted my decision to go with this company for shipping our equipment."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Holli Bird",
          "Nb_Reviews": 1,
          "Date": "2020-06-22T16:16:56.000Z",
          "Titre": "Our Customer Service Representative…",
          "Contenu": "Our Customer Service Representative Amable is absolutely wonderful! She is professional, diligent, and communicates very well. Lately, the carriers have struggled to pick up and deliver our orders on time. Amable has taken care of us whenever a situation like this arises. We appreciate her efforts."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rosie",
          "Nb_Reviews": 1,
          "Date": "2019-10-23T20:05:54.000Z",
          "Titre": "Would recommend!",
          "Contenu": "Schock was great at communicating the process for returning our leased Xerox copier. The tech that came out was friendly and efficient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LMCJ",
          "Nb_Reviews": 1,
          "Date": "2021-07-15T17:38:21.000Z",
          "Titre": "Trying to ship any package is hectic !",
          "Contenu": "Trying to ship a piece of large, heavy equipment can be quite the task.  Thanks to Schock Logistics all i had to do was make a phone call and have a credit card ready. Everything else was a breeze.Thank you for your very vast and professional service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "'Nanci Bushrow'",
          "Nb_Reviews": 5,
          "Date": "2022-10-10T23:15:18.000Z",
          "Titre": "Amable O'Neal was great!",
          "Contenu": "Amable was great, as always.  I appreciate Shock and the employees they have.  They are always very helpful and quick to meet my needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Craig",
          "Nb_Reviews": 1,
          "Date": "2019-10-29T14:08:25.000Z",
          "Titre": "Always do a good job",
          "Contenu": "Always do a good job, reasonable price and drivers are courteous. Once I give Schock the order for a copier move everything is handled and I don't have to worry about it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Candy",
          "Nb_Reviews": 4,
          "Date": "2022-09-09T22:10:36.000Z",
          "Titre": "This is a fabulous company to work…",
          "Contenu": "This is a fabulous company to work with. The Schock team is amazing and their customer service is exceptional . I would recommend them 100%!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vinnie",
          "Nb_Reviews": 3,
          "Date": "2020-12-14T17:45:45.000Z",
          "Titre": "Look no Further!",
          "Contenu": "I shopped around to ship a heavy printer (Noritsu QSS Green R. About 250lbs) and called every shipping company I could find   Schock was next to last. The we’re the cheapest price with the fastest pickup and delivery time. Bonus was I did not need to put on a pallet.    I was thinking too good to be true!  Nope. On day of delivery I asked if I could change delivery address.  I went from office to hone and they did the change the day of delivery, no charge!   I was hoping the printer arrived safely with no damage.  Not only did it show up safely, the printer was wrapped up like a bubble  and it was strapped right to the walls nice and tight.  I was impressed. Lastly, the delivery driver was good guy and did everything for me.During delivery and pickup I received emails on the process and where it was on its journey.  A nice touch. I usually NEVER write reviews but this one was a no brainer.  Don’t think twice about going with Schock. I choose them and can HIGHLY RECOMMEND them.   Vinnie"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roman",
          "Nb_Reviews": 1,
          "Date": "2020-06-08T20:37:04.000Z",
          "Titre": "Great to work with...",
          "Contenu": "I'm a little new to dealing with Schock, but so far so good. Kevin Schook and Amable O'Neal have been great to work with. Amable laughs at my corny jokes and lame movie references."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TAMMY NORTON",
          "Nb_Reviews": 2,
          "Date": "2023-07-23T00:43:05.000Z",
          "Titre": "Showed up when they said driver was…",
          "Contenu": "Showed up when they said driver was very helpful knowledgeable and courteous"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gladys",
          "Nb_Reviews": 1,
          "Date": "2021-05-12T16:57:29.000Z",
          "Titre": "Amable was very helpful in making sure…",
          "Contenu": "Amable was very helpful in making sure we have all the paperwork we need to ship our equipment. Very good service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JACKSON, RONALD L",
          "Nb_Reviews": 1,
          "Date": "2022-09-22T00:30:02.000Z",
          "Titre": "Cross County C8045H2",
          "Contenu": "Amable O'Neal is always very responsive, from beginning to end.  In this fast paced environment, that is always the key to a great experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Premier Electric Inc.",
          "Nb_Reviews": 1,
          "Date": "2022-05-11T20:49:24.000Z",
          "Titre": "Schock Logistics were quick",
          "Contenu": "Schock Logistics were quick, efficient  and great shipping price. Definitely will use again in the future if necessary."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 6,
          "Date": "2023-09-25T22:36:01.000Z",
          "Titre": "Schock Logistics is great and easy to…",
          "Contenu": "Schock Logistics is great and easy to work with.5 stars !!!!!Amable is AWESOME!!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven",
          "Nb_Reviews": 1,
          "Date": "2021-02-10T17:50:53.000Z",
          "Titre": "Driver showed up at a reasonable hour",
          "Contenu": "Driver showed up at a reasonable hour, was very professional and courteous.Loaded equipment and left."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customerM. Worthington",
          "Nb_Reviews": 3,
          "Date": "2021-08-20T21:17:46.000Z",
          "Titre": "From the time I called Schock Logistics…",
          "Contenu": "From the time I called Schock Logistics until the notification that the machine had been delivered to it's destination, everyone I was in contact with was very helpful, understood my needs, and fulfilled their duties in the most professional way possible. I will use them again when necessary."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cindy Westover",
          "Nb_Reviews": 1,
          "Date": "2020-05-14T16:43:22.000Z",
          "Titre": "He did a great job and very…",
          "Contenu": "He did a great job and very professional.  He checked the copier machine and made sure that everything was in good condition.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2021-07-08T15:23:47.000Z",
          "Titre": "Pick Up Service at College Hill Church",
          "Contenu": "Well coordinated by several folks at Schock.    Lot's of follow up and very pleased with the end result.   Unit was picked up on 7/7/21."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "XDOS, Inc.",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T15:40:57.000Z",
          "Titre": "Quick responses",
          "Contenu": "Quick responses, always helpful, this company couldn't be easier to work with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jo Ann",
          "Nb_Reviews": 3,
          "Date": "2023-07-25T14:55:38.000Z",
          "Titre": "Always my GO TO Shipper!",
          "Contenu": "Representatives were very responsive and helpful with virtually no delay in getting a response to questions and providing the quote.  Pricing is super!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shannon",
          "Nb_Reviews": 2,
          "Date": "2020-10-14T03:03:03.000Z",
          "Titre": "I am impressed with how responsive and…",
          "Contenu": "I am impressed with how responsive and attentive to my needs.  I would recommend very much for shipping needs."
        }
      ]
    }
  ]
}