{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.sellgpu.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rostik",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T22:03:56.000Z",
          "Titre": "A complete bait and switch business…",
          "Contenu": "A complete bait and switch business model. I received a quote on their website for $471 for a CPU, after which I received an email from them that they cannot provide the promised price on the website and can only give $415, although the website still has the old price. Be careful with them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brandy Guo",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T00:10:30.000Z",
          "Titre": "They extreme lowball offers",
          "Contenu": "They extreme lowball offers. They're offering a completed build worth over 1000$ in raw parts, at a third of the price. \"342$ for a R75800x, 4060ti, 64gb ddr4, 1tb m.2. Would NEVER trust this site for msrp."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anthony Madison",
          "Nb_Reviews": 1,
          "Date": "2022-09-17T14:37:49.000Z",
          "Titre": "Consumer Beware",
          "Contenu": "I received a shipping label from SellGPU. Prepped the machine and sent it off. After a week I received another email from SellGPU saying I used two emails and provided me a tracking number.The tracking number provided clearly said no results found. The SellGPU account shipping status says Reminder L05. Contacted customer service who stated it should be FedEx not USPS. I clearly emailed support with all the information they sent me this far and was told that it was sent to a wrong address and they can't help me.BEWARE!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mason Millan",
          "Nb_Reviews": 1,
          "Date": "2022-08-22T23:07:13.000Z",
          "Titre": "Low ball",
          "Contenu": "Just from their prices they give you, for a used r5 2600x fully functional is a low ass ball. legitimately offer 28 dollars. Update on August 22nd, the price is now 44 dollars. Use r5 2600x currently on Ebay, and some other places are offering 90+. I'm glad they'd like to look into the low pitch that the site has offered."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Slaughter House games",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T04:26:52.000Z",
          "Titre": "Just built a awesome pc put in the pc…",
          "Contenu": "Just built a awesome pc put in the pc parts and they offered 128 dollars thats it this site is a cheap scam full of i d i o t s that obviously know absolutely nothing about tech i had people on ebay offering me 800😂"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Wyatt",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T11:03:14.000Z",
          "Titre": "I was wanting to check how much money…",
          "Contenu": "I was wanting to check how much money they would give me for a sealed disney Tsum Tsum nintendo switch edition and just so you know those go for like $900 and they try low balling me literally asking for $100. Like is this some sort of joke a normal switch sells for at least like $250. Bruh"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Grady Obermiller",
          "Nb_Reviews": 1,
          "Date": "2022-07-14T01:29:41.000Z",
          "Titre": "They want you to pay them by papal or…",
          "Contenu": "They want you to pay them by papal or Venmo which Venmo isn’t working for them and they never said anything about me paying for shipping this is just bullcrap for my Xbox to be shipped back to me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chad Wilson",
          "Nb_Reviews": 1,
          "Date": "2022-10-30T23:21:44.000Z",
          "Titre": "I still haven't received payment for part recieved",
          "Contenu": "I still haven't received payment for parts that I sold them. They received the parts on 10/21, they said it would be the next business day to process payment. 10/24 came 10/25 still no payment. I tried to call their customer service number and you are immediately forwarded to voicemail and told to leave a message. No one ever called me back like the message on the voicemail said it would. Instead I got a text message saying \"My payment was next in the queue and I should receive payment shortly\". That was last week and I still have not seen any sort of payment or had anyone reach out to me and explain why this is taking so long. The parts I sold were worth 30 bucks and they cant pay it out? I would think twice before shipping anything more valuable like a GPU or a Gaming PC, you might not ever see your money. So far this has just been a big scam. A big NOPE on this company, 1 star customer service, 1 star for reliability."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Moody",
          "Nb_Reviews": 2,
          "Date": "2022-08-09T22:40:45.000Z",
          "Titre": "There is bait and switch - They don't honor terms and conditions",
          "Contenu": "There is some bait and switch with this company. I sold my Xbox One and while many competitors were offering $70, SellGPU offered $90 which obviously impacted my decision to go with them. Also, I felt safe because I read the terms and conditions and they stated they paid for shipping even if they refused the product. I sold my Xbox July 27th and they claimed one of the controllers was faulty so they offered me $70 (the going rate) and offered to recycle my controller. I know my controllers works because I use them both. I advised I'd take the $70 but want the controller returned. They then asked for $10 to have it returned. I reminded the customer service rep that the terms and conditions stated they would pay for shipping and the representative would not acknowledge the terms and conditions and insisted I paid them to return my controller. At this point I recognized I was being deceived. They wanted to not only pay me what the competition was paying but actually pay me less. When I asked to escalate to a supervisor, I was declined. I have an active BBB complaint open. It's been 10 days and I don't have my Xbox or payment. Stay clear of this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jacky Situ",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T01:47:19.000Z",
          "Titre": "Bad support, havent been paid",
          "Contenu": "Transit delay was what they said but havent responded to my support, cpu was sent in a week ago.I was told i'd be emailed on updates within the delay and have not"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-07-23T08:01:17.000Z",
          "Titre": "Y’all never paid me",
          "Contenu": "Y’all never paid me. I sent in 10 Intel I five processor supposed to get $480 and never received anything email confirming that the package was delivered."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kate",
          "Nb_Reviews": 1,
          "Date": "2022-11-09T07:56:56.000Z",
          "Titre": "Awful rip off scammers",
          "Contenu": "Awful rip off. They false advertise by saying they will give you fair prices when in fact they offer a fraction of what the item is worth."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-09-02T21:16:39.000Z",
          "Titre": "scammers",
          "Contenu": "i never got my money like yall said and it took ages for yall to even get back wiith me id like a refund of my item or money for the item"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Khela  Richardson",
          "Nb_Reviews": 2,
          "Date": "2022-10-09T01:11:11.000Z",
          "Titre": "Untrustworthy and Misleading",
          "Contenu": "Re: Order No 631322 I shipped a brand new Microsoft adaptive gaming kit for xbox along with an adaptive controller. Both were brand new and had never been used or taken out of the box. I received a message from sellgpu 10/05/22 that my items did not pass inspection and they did not give me a reason. They offered to send my items back upon request or would recycle in 5 days if no response from me. I immediately responded asking for my items to be returned and for a reason as to why they did not pass inspection. No reason was given but I received a response back same day that they would forward the request to ship back my consoles.On 10/07/22, they emailed me stating that they would get back to me with an update via email/sms as to when my items would be shipped back.Today 10/08/22 at 6:19pm eastern time, I received another email from sellgpu stating We’re very sorry - unfortunately, the item(s) received did not pass inspection. Our apologies.We will hold the item(s) for 4 additional days (7 days from our original email) and then recycle them, unless we hear from you that you would like them shipped back.I am awaiting a response but this seems like a hoax. They’re website states that the process is hassle-free and that is very misleading. I will never use this company again, does not appear to be trustworthy. It seems that intend to keep my brand new gaming kit and controller without paying me the $118.80 they promised under the guise of ‘recycling’ the items even though I’ve requested multiple times for them to return my items back to me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-05-05T22:47:50.000Z",
          "Titre": "By not ripping customers off and giving…",
          "Contenu": "By not ripping customers off and giving them more for how much they paid!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Farther Gamer",
          "Nb_Reviews": 1,
          "Date": "2022-10-24T16:31:01.000Z",
          "Titre": "Not Worth price offered ,better to sell parts separately",
          "Contenu": "I was offered less than $200 for \tGaming PC: i7-6700K (1), GTX EVGA 1080 8GB Hybrid (1), 250GB SSD (1), 6.0TB HDD (1), 32 GB DDR4 (1) - feel like my gpu alone is worth that much."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-09-29T03:15:10.000Z",
          "Titre": "They sent my money to paypal and it has…",
          "Contenu": "They sent my money to paypal and it has been on hold ever since. I’m unable to receive my money and they’ve quit replying to my emails"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T01:51:13.000Z",
          "Titre": "I never got paid for my GPUs that were…",
          "Contenu": "I never got paid for my GPUs that were functioning."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T06:39:43.000Z",
          "Titre": "Sent out parts about 3 weeks ago and…",
          "Contenu": "Sent out parts about 3 weeks ago and still waiting on to get paid"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T05:05:52.000Z",
          "Titre": "never received my check for the card"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-17T03:14:20.000Z",
          "Titre": "I sent in a very expensive processor…",
          "Contenu": "I sent in a very expensive processor for a custom quote along with q few other things and I got paid for everything except the 500 dollar processor I sent in qnd I have sent 5 emails and text and I received no reply. Some one came up on a i9 processorI have sent 6 emailsAnd I never got response and I check my spam and there is nothing. I never go a email explaining the sale or a receipt I would love to talk to you guysMy accct is #510858"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Primal Synergy",
          "Nb_Reviews": 1,
          "Date": "2022-02-21T21:01:50.000Z",
          "Titre": "payment is either slow or not comming",
          "Contenu": "got the emails saying my trade passed and should receive payment 4days later plus a weekend and no change in payment i texted the number and i keep getting the same bs about sorry for the inconvenience we will check this and get back to you but they haven't yet"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Zeke",
          "Nb_Reviews": 1,
          "Date": "2021-06-09T15:35:15.000Z",
          "Titre": "I got an estimate of $76 and received a check for $10",
          "Contenu": "I got an estimate of $76 and never got the check. When I hit up customer service via email, I was told the items I sent were wrong products or missing and revauled my stuff for $10 and refused to send my stuff back. I would absolutely avoid this \"company.\""
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T15:54:45.000Z",
          "Titre": "100% a scam",
          "Contenu": "100% a scam. Don’t trust them at all."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shushi",
          "Nb_Reviews": 1,
          "Date": "2021-04-16T17:44:48.000Z",
          "Titre": "They have yet to send me my check a…",
          "Contenu": "They have yet to send me my check a month after it was suppose to be here."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nicholas",
          "Nb_Reviews": 1,
          "Date": "2021-06-17T03:02:51.000Z",
          "Titre": "Bad Service",
          "Contenu": "Sent the part, never recived the money. Really mad. Don't recommend"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Conner",
          "Nb_Reviews": 1,
          "Date": "2021-06-16T15:20:37.000Z",
          "Titre": "Trash",
          "Contenu": "Paid a fraction of what any other company would have paid for my item."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-09-05T19:47:51.000Z",
          "Titre": "I still haven’t received my money and…",
          "Contenu": "I still haven’t received my money and it’s been over 2 weeks."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John P. Jones",
          "Nb_Reviews": 1,
          "Date": "2022-11-21T21:29:31.000Z",
          "Titre": "Non-existant customer service"
        },
        {
          "Note": 1,
          "Lieu": "QA",
          "Pseudo": "Issa",
          "Nb_Reviews": 1,
          "Date": "2021-06-09T15:28:58.000Z",
          "Titre": "They took my pc and didn’t give me my…",
          "Contenu": "They took my pc and didn’t give me my money."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "StrawberrySHERbet",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T19:17:36.000Z",
          "Titre": "They don’t do same day payouts",
          "Contenu": "It took a week to get to the facility and when it did they still had another 3 days of testing plus the weekends for whatever reason. Therefore it was a total of two weeks I had waited when I could’ve sold it locally for 3 times as much. Just wanted some quick cash but they take forever and give pointless updates when they could’ve just told you when the payment was made instead of getting your hopes up. For what they offer u would expect a fast payout but I would sell it online instead of this website. It’s better off that way anyways. I don’t think I will sell my electronics here again. They promise same day payout but it’s just a lie it turned into weeks which is pretty pathetic imo. Sometimes people need emergency money and they have really expensive gpus and parts so if you’re looking for a quick cash grab you are better off selling it locally. 2/5 stars because they lowball you hard but at least they’ll pay you."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Hackadellic",
          "Nb_Reviews": 1,
          "Date": "2022-09-17T01:59:39.000Z",
          "Titre": "What a hassle for not a lot of $$$$",
          "Contenu": "You did not pay what you said, and I never got the other boxes to sell my other stuff, then those prices changed, not to mention you got my i7 for half of what I would have gotten if I just would have waited."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nathan",
          "Nb_Reviews": 1,
          "Date": "2022-02-23T21:29:33.000Z",
          "Titre": "Meh. Poor customer service. You can get better money if you’re patient.",
          "Contenu": "Wasn’t able to be delivered to the provided address for three days in a row. Ended up taking almost two weeks after I sent it in priority mail. Customer service stopped responding after one email. Won’t be using again, take my shot at local business that I can at least haggle with."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 2,
          "Date": "2021-07-21T16:18:07.000Z",
          "Titre": "The idea is good the prices not so…",
          "Contenu": "The idea is good the prices not so much. Gpu price was fair concidering what's going on now a days. The ram and cpu prices are atrocious. 20$ for 120$ rgb ram, and 60$ for a 150$ cpu is low-ball. You can definitely get more selling privately. The shipping was easy except mine was delayed and couldn't be delivered a few times due to it being the weekend and I do NOT trust USPS enough to have my stuff floating around out there for 3 extra days."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Hector Miramontes Jr",
          "Nb_Reviews": 3,
          "Date": "2021-06-09T23:40:00.000Z",
          "Titre": "Okay",
          "Contenu": "They sent me a check for two items. I emailed them about a third item and they told me to send it as well and would compensate me for it. They paid me for only two items. It wasn't a large amount but still."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Roland Penttila",
          "Nb_Reviews": 2,
          "Date": "2021-06-09T17:29:22.000Z",
          "Titre": "Don’t trust them to be fair",
          "Contenu": "The website offered a price, but after they received my memory, they made an excuse to pay me much less. Not trustworthy."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Connor",
          "Nb_Reviews": 1,
          "Date": "2021-06-18T21:53:15.000Z",
          "Titre": "Took two weeks to receive payment."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T01:19:15.000Z",
          "Titre": "Wasn't what was told was gonna happen"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chadd Weber",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T21:23:25.000Z",
          "Titre": "Misleading turnaround time",
          "Contenu": "Placed an order on may 19th they received it may 24th and now its delayed and i was never told of any delays until may 30th even after contacting them several times nothing was said about being backed up or anything so now its going to be who knows how long before they do anything. This company needs to be alot more transparent on how long it will take to process an order."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Customer MPG",
          "Nb_Reviews": 1,
          "Date": "2022-07-30T22:54:14.000Z",
          "Titre": "Choppy at best",
          "Contenu": "The automated responses are not consistent and the process is choppy at best. Their turn around time on custom quotes is far too long. The time of notification of received, to time of passed, is usually longer than their website suggests. The plus is once passed testing the payments usually arrive within 24 hours for ACH transfers."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "david",
          "Nb_Reviews": 1,
          "Date": "2022-08-25T04:12:39.000Z",
          "Titre": "At first things went smoothly had some…",
          "Contenu": "At first things went smoothly had some questions whether they accepted my GPUs and gave them specific details about them and they assured me they accept and explained how to submit order. We agreed on offer price and I mailed them devices. 3 days after receiving devices they inform that it did not pass inspection and would make me pay to have them returned as they say the order was incorrect. The devices are in perfect working condition and I was very detailed in description and they assured me they accept the GPUs before I sent them in email. I have asked them multiple times to explain why order was incorrect and they will not pay to have ship back and I still have received no answer.**update**They admitted their mistake and going to return devices for free now. So pleased with that."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John doe",
          "Nb_Reviews": 1,
          "Date": "2022-04-26T20:16:58.978Z",
          "Titre": "Straight Foward Service but..",
          "Contenu": "Straight foward service. Like it but dont like the prices they offer. Got $260 for a $800+ gaming pc. Money was deposited as soon as it passed inspection. Liked that as well. Overall good quick efficent service but price offerings are robbery. Take what you can get type of deals."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tuyet",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T19:05:23.000Z",
          "Titre": "Lost package and no response from SellGPU",
          "Contenu": "I shipped my items to them a couple of times. The first few times was great, but I sent in a package on November 2022 and it was lost in shipment.The package has been missing since, I've contacted SellGPU support over 3-4 times and they kept sending me the same response: \"Sorry to learn about your situation. Let me double check this information with our team, and we’ll contact you once update is available.\"I am very tired of reading that same message over an over whenever I contact them. I'll just take a loss and call it a day, because I'll never sell to them again. There are so many other ITADS willing to buy used IT equipment for much better prices. They list on their website that SellGPU guarantees that: \"Your components are 100% insured from the moment you ship.\" Well it's been over 2 months and no response from them.Edit 1/21/2023: They have responded after this review and have resolved the issue. Just wished they had addressed the issue when I emailed them initially."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marcus Trisler",
          "Nb_Reviews": 1,
          "Date": "2023-01-30T01:10:13.000Z",
          "Titre": "solid bones but lacks the finer touches",
          "Contenu": "3 stars for the experience of trading in. I set up a rather large quote from selling 20 GPUs. The quote was on the smaller side of things and definitely could have gotten more selling privately but did not want to go through that process over and over so was really glad they offered a service that allowed me to just be done with it. Fraud people on eBay trying to buy it just wasn’t for me so I was really looking forward to this. So I removed 1 star for packaging. It is presented on their website that they will provide packaging to mail the devices in. So these being pricey GPUs some of which I indicated have no box so I assumed it would be similar to something like Apple’s process of trade in where the trade in kit can accommodate that and was part of the reason we went with them. Instead it was just like 3 medium sized boxes from Home Depot. So technically it worked but had to go and buy packaging for the cards with no box and just an extra step that I wish was a little clearer.I removed a 2nd star for communication. They emailed over and over again about sending the products in even though I had chose the wait for box option but no big deal probably an automated system. I ended up responding to one of the text messages because i actually had another card that I didn’t include on the quote and wanted to add it in. So I text them and they say just include it in the box and our warehouse will know. Like oh okay simple enough…I include it and then ship everything off. A few days later get an email that they received it and will be processing. Like okay cool and then bam refund hit the account bank account and it was all said and done. But the amount was for the quoted amount no mention of the extra card I included. No email response as to like a breakdown for each card just it’s completed. Tried to follow up via text and no response.They were definitely quick with the refund and overall very timely and would probably use them again but just be super cautious and make sure you fill out quote correctly to begin with. Maybe try emailing them so there is a better paper trail? It would have been great if there was a website where I could log on to and see the status for each card or just see something regarding the order"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-10-28T16:06:29.000Z",
          "Titre": "I do not know why I need to pay a $15…",
          "Contenu": "I do not know why I need to pay a $15 fee to Paypal for my trade-in. It does not make sense"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T22:56:01.000Z",
          "Titre": "Set took over 2 months for them to send…",
          "Contenu": "Set took over 2 months for them to send them back the wrong item I sent to them"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-02-22T20:18:05.000Z",
          "Titre": "I sent an entire Pc and other…",
          "Contenu": "I sent an entire Pc and other components to the company, so I opted for the company to send the shipping supplies to me. All I received was 1 single box that way too big for all my items. If the  company wants to provide an option like that, they should be explicit on what they’re sending and what customers are receiving."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 2,
          "Date": "2021-06-10T09:42:12.000Z",
          "Titre": "My experience was good, but. . .",
          "Contenu": "My experience was good, offer was fast, and payment prompt once the product was shipped.  I did receive an additional email several days later after not excepting your offer right away. The email stated I would receive an extra 12% if I excepted the offer but never did.  This was the reason I did accept it.  I received the original amount offered.  I even included a printed copy of said email in the box with the CPU."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Mcdonald",
          "Nb_Reviews": 1,
          "Date": "2021-10-16T20:15:39.000Z",
          "Titre": "Fast to process and test but slow to pay.",
          "Contenu": "So my experience was just OK. You tested the card fast when you received it and said my check was in the mail the next day. Well it took me 3 weeks to receive my check and when i emailed you about if you had sent it i got no response. Then i got it by fed-ex about 5 days after i emailed you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T15:59:37.000Z",
          "Titre": "Never received check, sold my info",
          "Contenu": "Never received check. They also sold my cell number, I get many spam texts each day.Update- New check arrived promptly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Javonne W.",
          "Nb_Reviews": 1,
          "Date": "2023-05-27T00:24:19.000Z",
          "Titre": "Timing is Somewhat Not As Advertised",
          "Contenu": "I really like how simple the process is and believe they're honest people. I just don't like the fact that it took longer than advertised for them to acknowledge that they've received my item. I contacted CS and they've reassured me, but i shouldn't have to do that. Nonetheless, payment was quick. And I'll probably still use them in the future, but my expectations on some of the timing will be lower."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ashleigh B.",
          "Nb_Reviews": 2,
          "Date": "2023-07-01T01:34:08.000Z",
          "Titre": "Best trade in offer",
          "Contenu": "It was very easy to get a price quote, and the provided shipping label and reminders to send it out were appreciated. They also had the best trade-in price of any program I looked at. My only complaint is that I wish they also had an option for sending me an appropriate shipping box for the Switch I sold."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DW",
          "Nb_Reviews": 2,
          "Date": "2023-03-13T23:09:27.000Z",
          "Titre": "Very Helpful Service",
          "Contenu": "Extremely helpful service for getting rid of an old PC I was no longer using. The online process was easy and quick. And the shipping box and label they provided made sending the PC back really convenient. I just needed my own filling material and a location nearby that did package pick-ups. I didn't want to waste time with hagglers on places like ebay so SellGPU was a great alternative for me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Al Donn",
          "Nb_Reviews": 5,
          "Date": "2023-04-10T13:52:42.000Z",
          "Titre": "Finally an Easy way to sell PC parts!",
          "Contenu": "I build my own computers and in the past donated older / unused parts to a local organization that tries to reuse or recycle.  I spent a lot of money on a RTX3090 graphics card and searched for a way to sell it to recoup some of my investment.  That is when I ran across SellGPU.  I didn't realize there was a market for the parts from a home-built PC.  I would have liked to get a lot more for the nearly-new graphics card, but got something out of it from SellGPU anyway.  The process was pretty easy, although I had a hard time submitting my request on the Web - finally used a different browser and it went through."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-06-02T20:08:45.000Z",
          "Titre": "Came through mostly as promised",
          "Contenu": "Came through mostly as promised.  Though it took almost four days to process my package once they had it.  If customer service told me after my first inquiry that they were busy, instead of saying another business day, and then up to five business days, I would give five stars.  First impression of their customer service comes off as them being infallible."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matthew Akamu",
          "Nb_Reviews": 2,
          "Date": "2022-04-14T01:01:01.000Z",
          "Titre": "Easy to use, but pricing isn’t fair.",
          "Contenu": "The overall usefulness was easy, and getting paid was fast too. I would’ve given 5 stars but I personally believe that the pricing I got wasn’t fair as it was new and still in its original package, and retailed for twice what I got. But other than that- it’s good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "st-Time Customer",
          "Nb_Reviews": 1,
          "Date": "2022-10-10T21:07:10.000Z",
          "Titre": "They kept their word and honored the…",
          "Contenu": "They kept their word and honored the price of payment for both the Xbox One S and X I sold for $172 and was given an additional $20 bonus which surprised me. The only drawback I experienced was the inspection process time was slow, but by the next business day the money arrived in my Zelle Account as promised."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T02:00:12.000Z",
          "Titre": "Did not receive payment after several…",
          "Contenu": "Did not receive payment after several inquiries. Update: Received payment after a few days. I’m inclined to chalk it up to holiday slowness, updated review from one to four stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris P",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T22:40:56.000Z",
          "Titre": "The thought of selling old hardware is…",
          "Contenu": "The thought of selling old hardware is nice the time it took to receive the funds makes it a last resort sort of thing rather means of selling something for monetary gain"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2023-02-09T18:43:30.000Z",
          "Titre": "Everything was Great 👍",
          "Contenu": "Everything was Great. Sellgpu needs to get the tracking more updated and everything.  When the customer sells the Graphics card to Sellgpu example. The customer wants more money for there product  that they are selling to Sellgpu. Over all Sellgpu is Awesome!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T19:46:39.000Z",
          "Titre": "Relatively simple process",
          "Contenu": "Relatively simple process. Tracking info was never available when I tried, however; my units were received and I was paid quickly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Connaughton",
          "Nb_Reviews": 2,
          "Date": "2023-05-02T17:59:48.000Z",
          "Titre": "Slight delay due to high due to high…",
          "Contenu": "Slight delay due to high due to high volume received the same week as my order, but customer service was helpful and answered all my questions"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-05-17T19:42:39.000Z",
          "Titre": "I got paid the full amount but I wish…",
          "Contenu": "I got paid the full amount but I wish you sent me some protective materials along with the box because UPS noticed me that my package was damaged during shipment."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T19:36:16.000Z",
          "Titre": "Possible slow payment after holidays",
          "Contenu": "It has been 2 weeks since I shipped in my gpu. They received it. Test passed. Never get the payment.Update:Got my payment the day after this review."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2022-04-23T20:58:16.174Z",
          "Titre": "everything good except wasn't expecting…",
          "Contenu": "everything good except wasn't expecting charge for sending money to paypal"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-09-02T15:35:51.000Z",
          "Titre": "Process was easy",
          "Contenu": "Process was easyEval was lower than expected but understood."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "BlueBaller",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T00:07:42.000Z",
          "Titre": "No balls Low ball",
          "Contenu": "They quoted $800 for my 2-month old $3,600 buildBut they also replied to my comment here and explained why"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott M.",
          "Nb_Reviews": 1,
          "Date": "2023-03-25T04:27:40.000Z",
          "Titre": "Great Service",
          "Contenu": "It does take quite a while to get paid but in the end it’s a great service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thom S",
          "Nb_Reviews": 2,
          "Date": "2022-05-06T19:22:13.000Z",
          "Titre": "Satisfied",
          "Contenu": "A happy customer was able to sell an item I no longer needed. The price given was okay."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rob",
          "Nb_Reviews": 3,
          "Date": "2022-03-15T16:25:06.000Z",
          "Titre": "Easy Transaction, but Less Than Quoted",
          "Contenu": "The sale was easy, but less than five days after the offer was given to me online and they received the GPU, they told me it was worth $50 less to them than I was originally quoted.Now, I'd understand if a couple of weeks had passed, but from the time I received my quote to the day they received the card was less than five full days.I think I'll shop around next time, but at least payment came as promised and quickly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ulises",
          "Nb_Reviews": 1,
          "Date": "2022-02-12T21:38:12.000Z",
          "Titre": "The entire process was straight forward…",
          "Contenu": "The entire process was straight forward and simple. Everything was smooth and there was plenty of communication from SellGPU. The only thing I did not like is the fact they offer you way too little money for your hardware. Personally, I just wanted to get rid of the old part so not a huge deal at the time. However, I would not recommend selling them your GPU... I was being offered way too little for a lightly used RTX 2080 which you can literally sell for hundreds in an instant."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Elliott",
          "Nb_Reviews": 2,
          "Date": "2021-12-31T17:45:55.000Z",
          "Titre": "Easy and effective way to recycle used components",
          "Contenu": "This is an easy way to \"recycle\" used CPUs and memory.  Which is better: to throw it in a landfill or to make it available for someone who can use it?  You are told immediately what your components are worth.  You ship them and they send you a check or put funds in your PayPal account.  A LOT less work than Ebay.  4 stars instead of 5 because the amount you are paid is on the low end, but this is offset by the ease of getting these components out of storage and into use again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-11-05T21:46:07.000Z",
          "Titre": "When they quoted the price for my CPU",
          "Contenu": "When they quoted the price for my CPU, I requested a box and mailing label. They sent me a PDF print label which I did not ask for. A week later, still nothing. I emailed back, they apologized for the confusion. A couple days later I got the items, mailed them in and got my money in PayPal shortly thereafter. Seamless after mailing it in. I would do business again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jerry Shellenbarger",
          "Nb_Reviews": 5,
          "Date": "2020-10-26T18:43:08.000Z",
          "Titre": "No response to inquiries by email",
          "Contenu": "Sent some cpus. It looks like i messed up on what type they are, so sellgpu could not use them.  I received an email from them asking if I wanted them to recycle or send back. I replied that I want them sent back to me. Three follow up emails and no reply to my request over 7 business days if the cpus have been sent back.  Very disappointed in their customer service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scotty Culp",
          "Nb_Reviews": 2,
          "Date": "2022-03-22T18:07:29.000Z",
          "Titre": "Good place to trade parts for cash - easy than eBay.",
          "Contenu": "Price quote was okay. I would have preferred more for the RAM modules as they were 4 x 8GB G-Skill gaming modules but, I got more for the video card. The box to ship the items was a little smaller than expected and made me uneasy that the video card would be broken during shipment. I arranged it well enough to fit all parts and made do with added packing tape around the edges and box itself. Maybe they should consider sending a box at least 2-3 inches larger in length, width, and especially depth, to ensure all parts fit. SellGPU did live up to its deal and paid out within 48 hours of receipt of my items. I will use them in the future as it's easier to deal with than eBay."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-08-12T18:15:59.000Z",
          "Titre": "There were a couple delays during the…",
          "Contenu": "There were a couple delays during the initial communication process when preparing to send out the hardware, but once shipped, everything went very smoothly. The process is mostly painless and I feel we got a good value for our equipment."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2021-06-09T17:48:38.000Z",
          "Titre": "Worked great for me.",
          "Contenu": "Worked great for me.The only issue was that RTX2070 I was trading-in did not fit the mail-in kit/box they sent me. Modern video cards are getting bigger. They should take it into account in their mail-in kit or have several sizes of boxes."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-09-27T03:37:52.000Z",
          "Titre": "good and fast",
          "Contenu": "good and fast, the email notification service just kept emailing me even after I had been paid for the item, and they lowball prices. great if you just need some quick money and don't want to bother with ebay."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-14T17:48:45.000Z",
          "Titre": "Quick easy payment"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Perkins",
          "Nb_Reviews": 3,
          "Date": "2021-11-09T23:44:29.000Z",
          "Titre": "Was real easy",
          "Contenu": "Was real easy, put in what I had. Printed out shipping label, 2 days later received notification that package had arrived then 2 days later received deposit in my PayPal"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 2,
          "Date": "2022-01-23T19:47:04.000Z",
          "Titre": "If you want to sell your components…",
          "Contenu": "If you want to sell your components without doing any extra work this is it. It did take a while for the package to arrive both ways and the price is very low."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2021-06-16T16:06:26.000Z",
          "Titre": "Quick and Easy",
          "Contenu": "The process was as painless as it is purported to be. There was a small snafu with the payment option I had selected but it was immediately solved once I picked a different one."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-19T12:01:21.000Z",
          "Titre": "No check- update: check received",
          "Contenu": "I still haven’t received my check and I can’t get ahold of anyone to fix that.Update: sell my gpu reached out to me and worked with me to get me my check."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-07-26T12:34:33.000Z",
          "Titre": "The process was quick and easy",
          "Contenu": "The process was quick and easy.  My only complaint is the lack of a tracking number on the check you issued. I had to open a support ticket in order to get it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-11-06T04:47:24.000Z",
          "Titre": "Nice",
          "Contenu": "They found my RTX 2080 & explained in detail of what actually happened. In the end, I received payment for both my gpus GTX 970 & RTX 2080."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-02-04T19:03:57.000Z",
          "Titre": "Texts began hitting me to send my…",
          "Contenu": "Texts began hitting me to send my product a few days before the box arrived, but otherwise it was a great experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Elizabeth",
          "Nb_Reviews": 3,
          "Date": "2021-11-04T02:11:45.000Z",
          "Titre": "No Response and Will Not Pay Me",
          "Contenu": "I have had multiple success with SellGPU in the past and suddenly they have gone silent, will not return multiple emails."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ardalan Chaichi",
          "Nb_Reviews": 3,
          "Date": "2021-06-09T15:14:03.000Z",
          "Titre": "Their service is great but my only…",
          "Contenu": "Their service is great but my only complaint is that they buy the GPUs so cheap. I think their buy-in price is not fair at all."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Ritter",
          "Nb_Reviews": 1,
          "Date": "2022-05-12T11:57:54.000Z",
          "Titre": "This scam outfit …",
          "Contenu": "Issue has been tentatively resolved."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-07-14T16:52:18.000Z",
          "Titre": "Quick and easy process",
          "Contenu": "Quick and easy process, we dealt with them all through the mail and were done in about a week. Very reputable company."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Walter",
          "Nb_Reviews": 2,
          "Date": "2021-06-11T15:44:25.000Z",
          "Titre": "Good website however they didnt honor…",
          "Contenu": "Good website however they didnt honor my 10 for the oringal cpu box given to them. But better than nothing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-20T20:08:20.000Z",
          "Titre": "Good experience fast payout",
          "Contenu": "Good experience fast payout. However they will send you a thousand text messages and emails."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-21T22:32:02.000Z",
          "Titre": "Great service, but had trouble getting paid",
          "Contenu": "I sent in two trade ins around December and originally requested to be paid via PayPal, I did receive the money from both orders on my PayPal account but had trouble transferring the money out of it, from that point I refunded the money and requested to have the money wired to my bank which went smooth enough, but never received it apparently due to a already prevalent issue with the bank they do transfers with reversing the transaction at random without notifying SellGPU or the customer, they have since apparently fixed this problem.In general the customer service representatives I had spoken with were typically incredibly helpful as well as understanding of my situation, they even offered me a percentage bonus of my original payout for the trouble I had experienced.The actual experience of selling my components was really easy as they give the option of sending some pre prepared packaging that differed depending on the components, the only trouble I did have was that for my second trade I had multiple components but only one box although there was separate packaging for each component only having one box made it a bit of a challenge to package said components without damaging them, after I sent in the items for transport they arrived without issue and I had contact with them giving my updates on my orders throughout."
        },
        {
          "Note": 4,
          "Lieu": "BG",
          "Pseudo": "Angel Boris",
          "Nb_Reviews": 1,
          "Date": "2022-03-15T14:34:23.000Z",
          "Titre": "best computer parts",
          "Contenu": "very easy and very trusty website , thank you for a nice experience"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer CPK",
          "Nb_Reviews": 1,
          "Date": "2021-12-04T16:49:04.000Z",
          "Titre": "Need some feedback for some bulk…",
          "Contenu": "Need some feedback for some bulk items.Everything else is going good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-09-26T21:21:12.000Z",
          "Titre": "Good job",
          "Contenu": "Good job, fast delivery and fast paying. No complaints here"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cooper",
          "Nb_Reviews": 2,
          "Date": "2021-12-23T21:16:30.000Z",
          "Titre": "Could have received more $ but service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T18:19:51.000Z",
          "Titre": "Quick and efficient process",
          "Contenu": "Quick and efficient process.  Would use again when I have more to sell."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Satisfied customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T01:25:15.000Z",
          "Titre": "My experience went smoothly",
          "Contenu": "My experience went smoothly, they stayed in contact with me during the whole process keeping me updated on what I can expect. Which is what I thought they did very well as a new customer. I would recommend them to others interested in selling any computer parts they don’t use or need anymore."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T22:20:25.000Z",
          "Titre": "I’d give SELLGPU 5 stars",
          "Contenu": "I’d give SELLGPU 5 stars. Great service, fair pricing and great service. Took care of shipping needs & was a simple process. Highly recommend to others and will definitely be using this service again in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Muad'Dib",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T18:29:24.000Z",
          "Titre": "I sold mutliple items in a three week…",
          "Contenu": "I sold mutliple items in a three week span and I was paid according the price quoted. The support team was very responsive and transparent with the whole procedure. I will do business with SellGPU again and again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Moose Inspector",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T22:55:50.000Z",
          "Titre": "Great Experience",
          "Contenu": "They made everything very easy.  I had sold bulk GPUs in the past on the \"4-letter auction site\"  and by the time they nickel-and-dime you, having to deal with deadbeat bidders, people complaining \"the card is too long for my computer\" and all sorts of other crap where \"4-letter auction site\" always sides with the buyer, the price point they offer is well worth it to avoid the hassle"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T19:09:56.000Z",
          "Titre": "Fast, streamlined, convenient",
          "Contenu": "Great, fast experience. This was by far the easiest and most convenient way to sell some used hardware. The quotes are fair and accurate. The fact that you can request a box and packing materials free of charge made the whole process streamlined. They offer many payout options to choose from, which is great and you get notifications along the way when the package was sent/received/processed etc. Once they received my package - it was processed and I got the payout the next day. I absolutely recommend this service to anyone, if you want a quick, easy way to sell some old parts."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paradise Planez",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T16:54:25.000Z",
          "Titre": "5 star review",
          "Contenu": "5 star review. So so so simple. If you want some extra money for your pc parts then this is the best place to go. The prices aren't too bad. And they updated me on every step on where my package was and when I was going to get paid. Once the package delivered to sellgpu I got paid in around 2 days. They allow payments in bitcoin, ethereum, PayPal, zelle, ach. I highly recommend this service."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Luczinia",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T06:13:17.000Z",
          "Titre": "Sell gpu is great",
          "Contenu": "Hello Well right off the bat they information provided from how to sell and what pieces of equipment u have to offer in a guide they haves laid out for u was excellent The customer service was great from start to finish Providing shipping labels and a fair price for equipment It was a just a great overall experience"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wmmm lle",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T00:19:03.000Z",
          "Titre": "Painless",
          "Contenu": "Painless, quick turn around. An all around GREAT experience.  I would NOT hesitate to recommend SellGPU to anyone looking to get rid of excess computer components."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew W.",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T16:34:23.000Z",
          "Titre": "The process was easy and I received my…",
          "Contenu": "The process was easy and I received my payment quickly. I was also offered a very fair price for my electronics, and I received the value I was offered online. Overall, I had a very good experience using them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T21:17:50.000Z",
          "Titre": "Amazing system to simplify the sales",
          "Contenu": "The entire process was so easy and their automated texts/emails made things so transparent.  Best of all, the payments were seamless and fast -- it can't be beat.  With other vendors, I'd have to wait for a check or even digital payments after some churn through email.  But SellGPU initiated the payment promptly after inspecting my shipment (within 2 days) and deposited into my paypal quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rare Reviewer.",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T20:28:10.000Z",
          "Titre": "No issues. Top Notch.",
          "Contenu": "No issues at all. Read where some companies will downgrade your submissions to reduce payment. Check arrived promptly and received updates on ech stage of progress. Frankly, was shocked that it was totally professional. Lastly, I rarely, like almost never, write a review."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CZ Darling",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T03:16:42.000Z",
          "Titre": "This would absolutely be a five star…",
          "Contenu": "This would absolutely be a five star rating, but I noticed in the info I saw, that if I mailed the CPU / GPU back in the original packaging that I would get an additional $10. I thought sweet, I still have only tested the CPU 1 time and never actually used, so I still have it in the original box. But when I didn't get the additional $10, I was a little sad, but oh well. I did send on a Holiday so it took a little longer, but I totally expected that, so that was not an issue. Deffinatly would use them again, they are fast and trust worthy.Note: Changed to a 5 start review, I did not make a review to get them to SellGPU to send the extra $10, but they did, and I was super impressed. I know accidents happen, I would recommend this SellGPU to anyone wanting to sell some older tech they are the best hands down."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T22:32:18.000Z",
          "Titre": "Good experiance, very little effort on my part",
          "Contenu": "I wanted to get rid of old components without using a selling site. SellGPU showed up in a search. Made an account and listed the equipment I wanted to get rid of. I was given an estimate and options on how to send in the components. I let them send me a box. Loaded the stuff and sent it off. I think from the time from ordering the shipping box to the time I received a check (other options for payment are available) was maybe 3 to 4weeks. Prices are a little low ball, but you dint have to pay for shipping or wait for bidders on other sites. Older equipment has little to no value though. Good experiance, very little effort on my part."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2022-11-02T19:34:54.000Z",
          "Titre": "Was skeptical at first",
          "Contenu": "Was skeptical at first. You’re really going to make it this easy for me?Yes. Yes they do. Additional bonus points for the excellent communication throughout the process and really fast payment. I got updates where my shipment was which just really eased my mind. Payment was done quickly, safely and conveniently through PayPal but I think they also support other ways.All in all, a great experience. Will keep them in mind for all my electronic sales going forward. If you’re looking to sell any electronics, I suggest you consider SellGPU."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin W",
          "Nb_Reviews": 3,
          "Date": "2023-10-12T04:58:08.000Z",
          "Titre": "Great company to work with",
          "Contenu": "Great company to work with. Fast shipping and great customer service. I have sold to them numerous times and I've always been satisfied."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-08-24T14:41:40.000Z",
          "Titre": "I have used SellGPU multiple times in…",
          "Contenu": "I have used SellGPU multiple times in the past and each time has been a great experience.  The entire end to end process is simple and easy.  From getting a quote, different shipping options to return your item(s), and getting paid it's all straightforward.  The best part is the top tier communication you get at every step of the way.  There is no question as to what action is being taken at any point because of the excellent communication.  Keep it up!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew K",
          "Nb_Reviews": 2,
          "Date": "2022-12-16T04:05:11.000Z",
          "Titre": "Great experience with this company!",
          "Contenu": "SellGPU has been very easy and straightforward to deal with. I sold a GPU, CPU and some RAM after upgrading my gaming PC. From the start, SellGPU had kept me updated with frequent emails and text messages throughout the entire process. Upon receiving my items, they inspected them promptly and I was paid via PayPal within the next day. This company is the real deal, and I will definitely be back to do business with them again in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Josiah McGuckin",
          "Nb_Reviews": 2,
          "Date": "2022-08-30T12:03:49.000Z",
          "Titre": "Great service at a fair price!",
          "Contenu": "I recently sold two SSDs with SellGPU.  Not only was I able to get a small chunk of money for both that I was able to earmark for future computer needs, but SellGPU made sure to keep me in the loop throughout the entire return process.  I would highly recommend their services if you have functional computer components that you no longer need but hope to see given some additional life.  You’ll get a fair appraisal, and you’ll get treated to excellent communication along the way.  That said, nice work, SellGPU!  I’ll be back in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T20:13:59.000Z",
          "Titre": "They matched an offer from a competitor…",
          "Contenu": "They matched an offer from a competitor and paid me for CPU and RAM that the other co offered nothing for. Considering that this is my third time getting money for old PC parts without any issues, there is no other choice than SELLGPU.com."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tyler",
          "Nb_Reviews": 1,
          "Date": "2022-09-21T22:14:33.000Z",
          "Titre": "Excellent service with prompt shipping…",
          "Contenu": "Excellent service with prompt shipping and constant notifications throughout the entire process. Great communications kept me aware of where my items were at with each step. Price for the parts were above my expectations and I’m glad knowing they’re out there getting more use than sitting in and old computer stacked in my closet."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JLS",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T23:12:59.000Z",
          "Titre": "Easy money for old tech",
          "Contenu": "Easy paid exactly as quotes maybe took a total of a week from quote to paid. Trust worthy but I wouldn’t try pulling a fast one and sending junk hoping they don’t notice. They test the product. Also don’t wait forget to send out item quotes can change by the week. But if you follow the rules and honestly describe your item you getting paid quoted price quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-20T19:40:45.000Z",
          "Titre": "SellGPU review highly recommended",
          "Contenu": "I always saw SellGPU ads on the internet and on Youtube. Before I wanted to sell my items I look at the reviews on this site and most of the reviews were positive 4 out 5 stars. I gave the website a go and started selling my items on the website. The process is really easy and user friendly. I sold a couple of GPU'S and some old consoles for a lot more money than I was expecting. Highly recommend this website for selling GPU'S, Consoles, and old tec. Definitely going to use this website again for selling and buying items. 5 stars highly recommended trusted website."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-13T22:20:16.000Z",
          "Titre": "Perfect Service",
          "Contenu": "It is stressful sending a large amount of expensive computer equipment off to some place with no guarantee of payment.  These folks kept me informed every step and replied every time my worried self asked about my order! 5 stars for 5 star service! Thanks y’all!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan",
          "Nb_Reviews": 2,
          "Date": "2022-09-29T20:59:04.000Z",
          "Titre": "SellGPU purchased my items as described…",
          "Contenu": "SellGPU purchased my items as described in the quote received. Being sent the box to include the items in was greatly appreciated - takes a lot of the hassle out of shipping that would have otherwise turned me away or given up selling my pc parts all together."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jon A",
          "Nb_Reviews": 1,
          "Date": "2022-10-28T22:52:33.000Z",
          "Titre": "Legit, will be using them again.",
          "Contenu": "Clear estimates, clear packing and shipping guidelines, and clear status tracking. Entire process went exactly as described on their website. Received funds in a timely manner, and have since sent more gear their way. No BS!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeremy Alford",
          "Nb_Reviews": 2,
          "Date": "2023-03-22T00:00:50.000Z",
          "Titre": "SellGPU Experience",
          "Contenu": "The experience of getting a quote, having the box and shipping label sent to you couldn’t be easier. They tested and confirmed the price very quickly and it matched the original quote from the website. Payment arrived within a couple of days"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AZSunKeys",
          "Nb_Reviews": 1,
          "Date": "2023-05-06T01:20:54.000Z",
          "Titre": "There’s a reason they are one of the best out there!",
          "Contenu": "One of the best companies out there for selling your new and used computer parts. Customer service is very responsive and they give you updates every step of the way. Not to mention the tracking information for every single thing that is going inbound or outbound. One thing to specifically mention is that I first used my own packaging and it was a lot of work to wrap up the parts. So my next order I decided to use the option they offer to have them send the packaging to you. They send you the perfect packaging for any order, and it has made it so much easier for us!They clearly have a solid method that works and they are the only company I will use for selling any computer related parts."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Bowman",
          "Nb_Reviews": 2,
          "Date": "2022-10-26T07:57:58.000Z",
          "Titre": "Outstanding overall experience",
          "Contenu": "Great customer service. Shipping boxes b arrived quickly. i was generously paid for my used GPU's, RAM, and hard drives. Payment came to me within days of their receipt of my components. I look forward to doing business with them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Beckers",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T23:19:04.000Z",
          "Titre": "They was a little delay when it came to…",
          "Contenu": "They was a little delay when it came to testing the part since they got new hires but once all that was done, getting paid was super fast !! Forsure would trust these people and if you have any questions they have a live chat which was dope too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T02:21:15.000Z",
          "Titre": "This was very easy",
          "Contenu": "This was very easy.  I got a quote submitted my request.  I box on Tuesday.  Sent it out on Wednesday.  It went ground.  They received it on Friday.  I went into a business meeting and received text saying my GPUs had been tested and verified and that I would receive payment soon.  By the time I left the business meeting my funds were in Paypal.  Great Experience"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brandon",
          "Nb_Reviews": 6,
          "Date": "2022-12-26T18:24:08.000Z",
          "Titre": "First Time Using Service. Will Use Again!",
          "Contenu": "A had a couple of CPUs collecting dust and there was no one around me that had a need or desire for 8th generation processors, I stumbled across SellGPU and decided to give the service a try. I am very happy with the process in sending the CPUs back and the selling price was very fair."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kent",
          "Nb_Reviews": 1,
          "Date": "2022-09-07T23:54:53.000Z",
          "Titre": "Very easy process",
          "Contenu": "Very easy process. After having a buyer not pay on ebay I opted to go with SellGPU to sell my processor. The lack of worrying about buyers paying or later trying to claim the processor didn't work was a great benefit"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Timmy",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T15:22:58.000Z",
          "Titre": "Reasonable Processing Time and Recycled for Me",
          "Contenu": "Everything was processed in a reasonably timely manner. I had parts that I wanted to sell and also parts that needed recycling (very old cpus). Even though I could not specify the old cpus in their user interface, after emaling sellgpu, they told me I could include my very old cpus in the box with the ones I was selling. That was a nice surprise! Great company!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eva",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T20:46:17.000Z",
          "Titre": "Fast and Easy!",
          "Contenu": "Fast, easy, reliable. Yeah! It's good stuff. They do what they advertise they do. No complaints. Customer service is also very quick to reply when you have issues. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Oscar",
          "Nb_Reviews": 5,
          "Date": "2022-10-13T22:10:12.000Z",
          "Titre": "I wasn't sure what to expect and I was…",
          "Contenu": "I wasn't sure what to expect and I was afraid of encountering a bad experience as I have heard and read about these such transactions.  I was nervous and was ultimately pleasantly surprised with the results. I was fast and easy and had no snags. My items were well taken care of and I thought I was going to be low balled. But the appraisal was in fact more honest than I had dreaded.  I would defintnetly look to do business again with sell GPU."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Raffeal",
          "Nb_Reviews": 1,
          "Date": "2023-01-01T02:42:59.000Z",
          "Titre": "Legit!",
          "Contenu": "At 1st, I thought it was suspect but decided to give it a try because I had a practically brand new GPU collecting dust. The process couldn't have been simpler. After shipping my GPU to Sell GPU I received Payment for it in 3-4 days."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SF nerd",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T01:16:29.000Z",
          "Titre": "Really glad SellGPU exists!",
          "Contenu": "Easy shipping, great service! Got several hundred dollars for a machine that had been gathering dust under my desk for years. Feels great to recycle it and get some money too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aaron S",
          "Nb_Reviews": 3,
          "Date": "2022-09-15T16:33:20.000Z",
          "Titre": "Fair, fast, and easy",
          "Contenu": "The whole process was clear and easy.  I entered my product and received a fair offer.  Once shipped and received sell my GPU assessed is condition quickly and paid me almost immediately. No shenanigans like some places. I'll definitely use them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-09-04T05:13:14.000Z",
          "Titre": "Efficient service",
          "Contenu": "Efficient serviceI sold my i5-9600k effortlessly through SellGPU. I send it back with my original packaging and was initially not issued the $10 bonus for the original box. I messaged them through email and they added $10 right away."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shawn Ackerman",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T15:50:28.000Z",
          "Titre": "I would give them 10 Stars if it was…",
          "Contenu": "I would give them 10 Stars if it was possible.I don't know why there are reviews that say this is a scammer website. I sent them a video card and a processor and they offered me $250 and within 2 days of them receiving my products I received an email stating that everything passed and they would be sending my check. The next day FedEx let me know that there was a two-day package in the mail from them and in two days I received my $250 check. I am very happy with every process of my experience. They were 100% honest and within one week there was $250 deposited into my bank account. I would give 10 Stars if I could."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "S Mason",
          "Nb_Reviews": 1,
          "Date": "2022-08-28T22:18:01.000Z",
          "Titre": "Selling to SellGPU is quick and easy",
          "Contenu": "We sold our PS4 to SellGPU and it was very easy and quick. They provided the shipping label, I shipped it, SellGPU notified me that they received the package and within days had deposited what they had agreed to directly into my checking acount."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chudah",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T17:57:08.000Z",
          "Titre": "SellGPU is super easy and super quick",
          "Contenu": "SellGPU is super easy and super quick, and I made more on my CPU than I would have going through a 3rd party vendor with all the added hassle and fees. The entire process was painless. I will definitely be using them again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew King",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T19:43:52.000Z",
          "Titre": "Easiest way to get rid of old hardware",
          "Contenu": "The initial quote was truthful and the whole process was easy. You fill out the forms on their website, they ship out a box to you if you need it, you slap a label on it and ship your hardware to them. Easy as that. I opted for a check and the check arrived two days after my package arrived and was tested."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Was",
          "Nb_Reviews": 5,
          "Date": "2023-04-29T01:01:27.000Z",
          "Titre": "Everything was fast quick and easy.get…",
          "Contenu": "Everything was fast quick and easy.get a quote, accept your quote print your label ship your item's wait for your package to arrive once everything pass testing you get PAID, it's just that EASY, I will use them again and again in the Future, Thanks,,,"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jacob Guffey",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T02:53:01.000Z",
          "Titre": "Sellgpu is a great place to get top…",
          "Contenu": "Sellgpu is a great place to get top dollar they do what they say they do you get a quote then you send in you're stuff they test everything then you get you're money with in 3 days I don't know why people are talking bad about sellgpu I got paid what my quote was it didn't even take 3 days to get my check I will do business with them again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-07T22:57:10.000Z",
          "Titre": "First time using their service and…",
          "Contenu": "First time using their service and everything went smoothly. I received the shipping box from them and received my payment via PayPal quickly. I am completely satisfied with SellGPU!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "David P - Edmonton, AB, Canada",
          "Nb_Reviews": 1,
          "Date": "2022-10-31T18:59:52.000Z",
          "Titre": "Good Experience. Recommended.",
          "Contenu": "My GPU quote and all following communications were timely and concise. I feel the quote was fair and my money was deposited to Paypal as soon as my hardware was tested and verified. I would use SellGPU again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim",
          "Nb_Reviews": 2,
          "Date": "2023-08-29T15:50:28.000Z",
          "Titre": "The process was well explained and easy",
          "Contenu": "The process was well explained and easy to navigate. I didn't have to spend hours posting my items for sale or auction online, I just got a quote and shipped them in. Very nice!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "D.H.",
          "Nb_Reviews": 1,
          "Date": "2022-11-02T09:19:22.000Z",
          "Titre": "The whole process was easy and offer…",
          "Contenu": "The whole process was easy and offer for my computer parts was fair. Shipping to the company was fast and free. There was an issue with the companies bank for payment but they were very nice and kept in touch until the payment was sent out."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zach",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T02:41:40.000Z",
          "Titre": "Great working with them",
          "Contenu": "Process was easy, communication was awesome, and the payout was fast"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Krj",
          "Nb_Reviews": 2,
          "Date": "2023-02-19T20:49:58.000Z",
          "Titre": "Easy Fair Transaction",
          "Contenu": "The website was easy to navigate.  I received a fair offer for my GPU and shipping was included!  No unexpected fees or costs. The payment happened in a reasonable time frame"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T20:27:09.000Z",
          "Titre": "Quick and responsive",
          "Contenu": "Quick and responsive.  I suggest not going through PayPal if your order is large as they will put a hold on the payment.  Otherwise service was excellent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bduhbya",
          "Nb_Reviews": 1,
          "Date": "2022-10-11T01:15:54.000Z",
          "Titre": "Easy and fast",
          "Contenu": "The process was very easy and went exactly as they explained. The price they gave was worth a guaranteed so. I was seeing similar prices when trying to sell it myself on various platforms."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greg P.",
          "Nb_Reviews": 1,
          "Date": "2023-03-04T01:24:52.000Z",
          "Titre": "Consistently reliable.",
          "Contenu": "Across multiple transactions spanning two years, SellGPU has always been responsive and done exactly what they promised to do. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KarKit Traders",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T06:05:49.000Z",
          "Titre": "SellGPU Trade In just Perfect",
          "Contenu": "Perfect trade-in follow ups & fast pay out processing. Great job SellGPU.Ursula Colon"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mr. Patel",
          "Nb_Reviews": 3,
          "Date": "2023-03-08T19:40:36.000Z",
          "Titre": "Good customer service and keeps you…",
          "Contenu": "Good customer service and keeps you updated via Text message or emails. This was second time dealing with SellGPU and both time got money on time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dylan Rei",
          "Nb_Reviews": 2,
          "Date": "2022-11-18T19:19:31.000Z",
          "Titre": "Pretty good place to sell quickly",
          "Contenu": "This was a very good experience as I was able to sell my GPU quickly without any problems at all. Though I kind of wish that the value was a bit higher, I can somewhat understand."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T19:39:43.000Z",
          "Titre": "QUICK AND PAIN-FREE PROCESS",
          "Contenu": "QUICK AND PAIN-FREE PROCESS. ESTIMATE AND CHECK MATCHED. GOOD BUSINESS; GOOD SERVICE; KEEPS ELECTRONIC COMPONENTS OUT OF TRASH. BRAVO!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T21:39:07.000Z",
          "Titre": "Fast and professional",
          "Contenu": "Very professional and kept me up to date during selling my Item. The service was very fast as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Blaine",
          "Nb_Reviews": 1,
          "Date": "2023-02-20T23:08:30.000Z",
          "Titre": "Fast and Convenient",
          "Contenu": "I've used their service twice now. Both times all parts passed their inspection once they received it. Payment was also fast and the packing and shipping to them was painless."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T02:59:02.000Z",
          "Titre": "GPU and RAM buyback",
          "Contenu": "This was relatively seamless. I didn't want to deal with online sales of my older 1080 or the RAM I had from an older build so I ended up here. The offer was a little low but I got money and they sent me the boxes to ship to them. Zelle was easy with my bank."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BWS",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T16:26:16.000Z",
          "Titre": "Simple",
          "Contenu": "Website is easy to navigate.  Their communication is timely.  And their payout is quick!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Max",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T21:54:34.000Z",
          "Titre": "Fast and Reliable",
          "Contenu": "SellGPU was fast in shipping me the mailer, processing my trade, and paying me. I will definitely be using their services again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T01:23:12.000Z",
          "Titre": "Sent me the box for delivery with the…",
          "Contenu": "Sent me the box for delivery with the delivery stamp and instructions, so just had to drop it off for shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Leffingwell",
          "Nb_Reviews": 3,
          "Date": "2023-08-09T22:47:09.000Z",
          "Titre": "Would Do Again",
          "Contenu": "Easy to deal with and good communication. Believe I received a fair deal. Wish I could sell them the rest of my electronics."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer Z.",
          "Nb_Reviews": 2,
          "Date": "2022-11-16T02:58:38.000Z",
          "Titre": "5 Stars Across the Board",
          "Contenu": "The most professional and courteous company and transaction. Very quick response time, very genuine and honest people. 5 STARS ACROSS THE BOARD!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Vartanian",
          "Nb_Reviews": 1,
          "Date": "2022-08-30T22:25:26.000Z",
          "Titre": "They received my return on a Friday and…",
          "Contenu": "They received my return on a Friday and I had the money in my PayPal account the following Tuesday.  Very easy to sell here and adequate prices.  Would do business with them again"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T19:54:38.000Z",
          "Titre": "Great company & service!",
          "Contenu": "Everything went as smooth my 2nd time using SellGPU as my first time. This is a great program & company and will use again in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "C Payne",
          "Nb_Reviews": 1,
          "Date": "2022-12-21T20:38:42.000Z",
          "Titre": "Made it super Easy!",
          "Contenu": "Made it super Easy!Received my paypal payment within a week of sending in the CPU. Great service and easy process. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Art",
          "Nb_Reviews": 1,
          "Date": "2023-01-01T06:37:47.000Z",
          "Titre": "Honest people",
          "Contenu": "they are honest, quick to reply with shipping labels and stay in contact via emails. After your items pass they pay you fast and its reliable"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott K",
          "Nb_Reviews": 2,
          "Date": "2023-01-03T22:35:24.000Z",
          "Titre": "super easy",
          "Contenu": "super easy to determine what my specific hardware was worth and get a cash bid right away.  the process was seamless and efficient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T19:46:44.000Z",
          "Titre": "Very helpful,quick",
          "Contenu": "Very helpful,quick, love how they keep you updated throughout the entire process"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric R",
          "Nb_Reviews": 3,
          "Date": "2023-07-06T21:42:22.000Z",
          "Titre": "Smooth, Straightforward, and Simple Process",
          "Contenu": "Smooth, straightforward, simple process of selling my unused computer components.  I will definitely use SellGPU again in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Furry",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T19:24:33.000Z",
          "Titre": "Good",
          "Contenu": "They paid for a box and fast shipping there and back for two sticks of RAM I was going to throw away and gave me a four dollar check. I cannot complain."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-19T12:48:01.000Z",
          "Titre": "Quick and easy 😌 process of selling…",
          "Contenu": "Quick and easy 😌 process of selling your product. I entered details of my Ryzen 7 3700X, they gave me a price which I accepted. Shipped the item and once they evaluated it good I received the money."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dario Davies",
          "Nb_Reviews": 1,
          "Date": "2022-10-06T17:34:57.000Z",
          "Titre": "Nice process",
          "Contenu": "Your process is straightforward and apparent.  It is streamlined to the point that a transaction can occur on the customer side very quickly. I really appreciate that."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-08-31T07:33:46.000Z",
          "Titre": "I’m giving the whole team an…",
          "Contenu": "I’m giving the whole team an appreciation there doing there best exceeding there limit to help customer on their highest expectations thank you for all your help"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Scott",
          "Nb_Reviews": 11,
          "Date": "2022-09-12T20:03:00.000Z",
          "Titre": "Traded in with SellGPU before",
          "Contenu": "Traded in with SellGPU before. Always good service prompt payment. Beats dealing with an online auction service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 1,
          "Date": "2023-05-27T23:00:16.000Z",
          "Titre": "SellGPU is Da Bomb!",
          "Contenu": "SellGPU people were immediately and consistently responsive.  They offered a fair price and took care of absolutely every detail needing attention to complete the sale."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jezus christler",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T14:57:48.000Z",
          "Titre": "legit company",
          "Contenu": "i received my money there was just some technical difficulties 10/10 process not a scam"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T22:47:42.000Z",
          "Titre": "It's Legit",
          "Contenu": "It's LegitTakes about 7~10 days to get it done but they provide shipping boxes and labels. As advertised, no problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jake",
          "Nb_Reviews": 1,
          "Date": "2022-09-01T16:22:46.000Z",
          "Titre": "Fully satisfied",
          "Contenu": "They kept me posted during the entire process. In addition, the entire process is on time as I was informed. Very transparent.  Strongly recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T00:29:06.000Z",
          "Titre": "My experience with this service was…",
          "Contenu": "My experience with this service was great they quickly respond to your email if you have questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elizabeth",
          "Nb_Reviews": 2,
          "Date": "2022-10-19T01:32:33.000Z",
          "Titre": "I'll do it again.",
          "Contenu": "Communication is a BIG plus and payment right on time.  I will use them again. Highly recommend SELLGPU"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Allen",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T21:55:01.000Z",
          "Titre": "Great service and experience!",
          "Contenu": "Easy to do and great communications while things were in process. Very fair prices. I would use them again. Thank You SellGPU!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T23:12:52.000Z",
          "Titre": "This is a lot better than dealing with…",
          "Contenu": "This is a lot better than dealing with the hassle of trying to sell on EBay or any other site."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2023-01-21T17:27:24.000Z",
          "Titre": "The whole experience was simple and…",
          "Contenu": "The whole experience was simple and painless.  I sent them equipment and a few days later they evaluated and paid me for it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donato Bradford",
          "Nb_Reviews": 7,
          "Date": "2022-12-06T21:36:17.000Z",
          "Titre": "Fast service",
          "Contenu": "Fast response and information flow is the best I have dealt with. The ach deposit was perform in 48 hrs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dawn",
          "Nb_Reviews": 2,
          "Date": "2022-11-15T00:16:22.000Z",
          "Titre": "Everything was easy",
          "Contenu": "Everything was easy. From the selection of the components to being sent a mailer. To packing it up and sending it back."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-12-31T23:26:18.000Z",
          "Titre": "Great Fast shipping and payment!",
          "Contenu": "The whole process was simple and easy! I got constant updates on ever part of the process from the shipping of the mailer to the payment!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 3,
          "Date": "2022-10-10T06:23:02.000Z",
          "Titre": "Easy simple satisfying",
          "Contenu": "Good section of accepted goods. I didn't have issues with giving up any of my past products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T21:46:23.000Z",
          "Titre": "Easy process if not wanting to go…",
          "Contenu": "Easy process if not wanting to go through trouble of getting better prices."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Don Norton",
          "Nb_Reviews": 2,
          "Date": "2022-12-09T00:58:33.000Z",
          "Titre": "I’m impressed with how easy the sell…",
          "Contenu": "I’m impressed with how easy the sell back was from top to bottom, the packaging was excellent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T06:02:19.000Z",
          "Titre": "SellGPU made it easy to resell my…",
          "Contenu": "SellGPU made it easy to resell my gently used GPU."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elliot",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T05:08:56.000Z",
          "Titre": "Great Service",
          "Contenu": "They provided a postage paid box which was really cool. The deposited money in bank account 1 day after they received the memory! It was fast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-10-03T19:22:43.000Z",
          "Titre": "Great service!",
          "Contenu": "Great instructions and communication from SellGPU. Also very speedy processing and payment. Definitely would use their services again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AR",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T23:40:25.000Z",
          "Titre": "Quick/Easy/Efficient/Effortless",
          "Contenu": "Quick, easy, efficient process. Texting with updates is a good touch."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ben Costin",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T01:13:13.000Z",
          "Titre": "It's legit",
          "Contenu": "It's legit. Everything works simply as expected. Received a box, put my GPU into it, shipped it, and got the money."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Seth Kruger",
          "Nb_Reviews": 2,
          "Date": "2023-05-19T03:52:12.000Z",
          "Titre": "I’m happy with the results and I’m…",
          "Contenu": "I’m happy with the results and I’m impressed that you are recycling the technology"
        }
      ]
    }
  ]
}