{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.steadystacksystem.com",
      "Review": [
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "mark reeves",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T20:54:52.000Z",
          "Titre": "A honest opinion!!",
          "Contenu": "Im all abt honest opinions thats why i gave 4 star instead of 5.This is not a bored ape, but the potential it has to being up there in the bull market is insane.The devs never stop building this project!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vambrusho FRB",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T17:32:09.000Z",
          "Titre": "Fellowship towards the future of financial freedom...",
          "Contenu": "*continued revenue stream beyond royalties; btc mining allocation. Titans and Legends are the investor illuminati; the future of financial freedom..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AlexanderY",
          "Nb_Reviews": 1,
          "Date": "2023-04-30T15:19:59.000Z",
          "Titre": "Steady Stack is an ever-evolving…",
          "Contenu": "Steady Stack is an ever-evolving community of entrepreneurs that grows stronger by the day. Personally had a chance to meet the founders and hear them speak at an event in Jan 2023. This company is structured well and has no ceiling for success due to their diverse reach within Web2 and Web3. Streamline processes for learning various types of trading, business and RE analytics, AI, and most importantly of all, mindset master classes. This is a family that keeps on giving, teaching men and women all over the world how to fish in any sea."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "augi",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T18:49:23.000Z",
          "Titre": "Steady Stack is a lifestyle",
          "Contenu": "Steady Stack is not only a brand and lifestyle but it is a community of likeminded individuals who want to improve everyday. An investor minded community that helps one another day in and day out. Not only does the community members support each other, there are many many tools, resources, mentors, etc to help you grow. Focus is primarily stocks, crypto, NFTS, but will grow into Real Estate, Ecommerce, Crypto mining, etc. This is your one shop stop for everything!"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Alan C",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T09:35:34.000Z",
          "Titre": "Investor Illuminati",
          "Contenu": "Steady Stack Ecosystem is a great project for those interested in learning to invest, trade and network. Backed by a powerful trading algorithm and led by some of the best traders and business leaders in the space it offers more utility than you will ever need. Masterclasses, love trading, signals and calls for Stocks, Crypto and NFT’s."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charlie Marconi",
          "Nb_Reviews": 2,
          "Date": "2023-04-29T22:52:59.000Z",
          "Titre": "The Most Useful NFT I've EVER Purchased",
          "Contenu": "Steady Stack is a place where investors come to level up and become wealth generating machines. Not only does SS give callouts on what to invest in and when, they legitimately teach their own how to become profitable in the markets. No other NFT project does this. This is a haven of mastermind activity for individuals to come and evolve. A true gem."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Donato Mandetta",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T21:58:06.000Z",
          "Titre": "WILL CHANGE YOUR WEB3 GAME.",
          "Contenu": "Been in Steady Stack since day one.I can safely say that this group completely CHANGED and IMPROVED my web3 game, and my personal drive.Apart from all of the amazing utilities, the calls, the education, the most valuable thing in steady stack is the community! So many valuable and driven people to surround yourself with, the energy is contagious and it drives you to take that fateful decision of really wanting to improve your life.Thanks Steady Stack and thanks team!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joel",
          "Nb_Reviews": 1,
          "Date": "2023-04-29T17:32:35.000Z",
          "Titre": "Knowledge is power",
          "Contenu": "I am 20 plus year investor who has done well for myself. But there’s nothing like adding more knowledge about stocks and crypto with my investment into Steady Stacks. The tools they have for their investors helps even the already knowledgeable investors be successful. Discord: JoelB#1874"
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "David",
          "Nb_Reviews": 3,
          "Date": "2023-04-28T23:23:20.000Z",
          "Titre": "Best Mastermind and Community for Trading and more!",
          "Contenu": "I tried to become a profitable daytrader for a few years now. Finally with the Trading Masterclass from SteadyStack and the awesome community which is very active and helps each other - we learn from each other every day - I managed to get my first payout of 2000$ from Futures Prop Trading last week. I never thought this will be possible but SteadyStack showed me it is! And this is just the beginning of my journey. Thx so much - I am very proud to be part of this Community and being a Titan and becoming a Legend very soon!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Al mchawrab",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T10:47:06.000Z",
          "Titre": "Steady Stack University",
          "Contenu": "Steady Stack is built on business fundamentals and a solid foundation. As an innovator in the space Steady Stack brings value to its holders on daily basis through education, training, mentorship and networking. Holding a Steady Stack NFT is like being a student in an ivy league school for entrepreneurs and innovators. The value is not found anywhere else."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kyle H",
          "Nb_Reviews": 3,
          "Date": "2023-04-29T19:03:50.000Z",
          "Titre": "Breathe of fresh air",
          "Contenu": "Been struggling for years to find a community with the mindset of showing up and getting better everyday.  Steady stack is that community.  Packed with several avenues of wealth and crucial resources to reach success in those avenues.  Steady stack in my mind is the only ecosystem an investor needs!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T22:56:12.000Z",
          "Titre": "Life changing opportunities inside",
          "Contenu": "Trading masterclass has taught me so much and completely leveled up my trading game. Being surrounded by people who are legends and understand how to trade has also helped immensely. So much value in being in the right ecosystem. SS gets 5 stars from me."
        },
        {
          "Note": 5,
          "Lieu": "EE",
          "Pseudo": "Ethan Xuslyn",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T14:53:25.000Z",
          "Titre": "Finally a No-BS community with real world utility.",
          "Contenu": "Most sincere, motivated and friendly community I’ve seen so far. Very wise and mature people, finally no-one is whining and getting emotional. Very rational and calm decisions. This community is my go-to place when I need a life advice and support.Not even mentioning the insane connections with world-class professionals in finance, investments, real-estate and crypto. Never did they underdeliver, never did they lie or mislead, finally a truly honest team of developers. Being a part of this family changed my life big time, and I truly recommend it from the bottom of my heart. Thank you for all the great moments and looking forward for what is to come."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Glock Lesnar",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T19:31:05.000Z",
          "Titre": "Best project in Web3",
          "Contenu": "The team is the best in Web3. They continue to deliver every single thing they talk about. They have delivered more then anyone could have ever expected! They have changed my life for the better. Members of the community are so helpful to one another. It truly is a solid community. The amount of knowledge and value shared is unbelievable! So glad to be a member and shareholder of steady stack!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Giovanni del Castillo",
          "Nb_Reviews": 1,
          "Date": "2023-04-30T16:59:05.000Z",
          "Titre": "A mastermind of growth and Innovation",
          "Contenu": "SS is something we’ve all been waiting for and I could not be happier with the results I’ve gotten being inside this community. From the alpha callers, nft callers, stock trades, crypto traders and real estate alpha inside. The mastermind of information is second to none.Everyone is helpful and always willing to spread knowledge to one another. There’s no dumb or discouraging responses to anything, we all just want to help one another learn and grow. The masterclasses have given me so much value in my financial journey. I can’t say enough good things about the mastermind. Join the discord, take a look around and ask anyone you can inside. We are all here to help and grow."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Jack athanasopoulos",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T13:41:48.000Z",
          "Titre": "More than just an NFT project",
          "Contenu": "Investing in Steady Stack is investing in yourself. Inside, you are provided with all the tools and resources necessary to learn the skills for financial success. Not only do you gain access to live trading sessions with seven and 8-figure traders, quality masterclasses on stocks and real estate, and even how to utilize the best cutting-edge technology such as AI. You also gain access to a quality network of like-minded individuals. Inside Steady Stack, you find the resources that no other Web 2 or 3 business provides, which is why it is vital for financial success."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sprinty",
          "Nb_Reviews": 1,
          "Date": "2023-04-29T22:33:37.000Z",
          "Titre": "Life Changing Advice and Skills",
          "Contenu": "The knowledge and network inside this group will change your life, it’s priceless to me and many others, between money advice with stocks, crypto, NFTs, and real estate. To health advice on supplements, workout and health protocols to be the best version of yourself, I’m here for life!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "alejandro jimenez",
          "Nb_Reviews": 2,
          "Date": "2023-04-29T22:22:22.000Z",
          "Titre": "The greatest mastermind ever created.",
          "Contenu": "The greatest mastermind ever created. From the first minute I joined this community I have been filled with wealth in every field (economic, personal and educational) there are no limits to the valuable information that is handled within this community, without a doubt the best opportunity I've had to connect with people of high value. I am currently creating my own trading community and NFT project thanks to the resources that this great family has given me.Steady Stack is here for the long term.It is a fact that we will leave a giant footprint on the entire digital revolution."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "getchabandzup",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T23:15:55.000Z",
          "Titre": "Thank you web2/web3 for Steady Stack!",
          "Contenu": "A month ago I knew nothing about futures trading 📈 Got involved with the right communities ( steady stack ) , made sure to stay  consistent with my studying, asked question until I understood, watched other people better then me trade…every day is a learning lesson. My P/L trading futures for my first month is nearly 4k. For me that feels like a accomplishment, considering I’m a rookie and knew very little  about day trading a couple months ago. Not we’re I want to be, still have a ways to go until those 10k-20k days like some of my peers.But I have more knowledge then I use to  📈💰 and the small gains add up.Thank you Steady Stack!-Earn"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Blasto",
          "Nb_Reviews": 1,
          "Date": "2023-04-29T00:40:10.000Z",
          "Titre": "Top Notch!",
          "Contenu": "I own many NFTs and I am involved in many communities and Discords , including  Veefriends , Nft Worlds , Degen Toonz.... but the one I consider the best investment and most valuable,  is Stead Stack ! Go Titans!"
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Lliam Shelton",
          "Nb_Reviews": 2,
          "Date": "2023-04-29T22:39:33.000Z",
          "Titre": "Steady Stack is home.",
          "Contenu": "I must say that my experience so far has been fantastic. The community is full of powerful, driven people who are all working towards achieving their financial goals. The team at Steady Stack is incredibly hardworking and dedicated, and they show up every day to provide us with valuable insights and support.One thing that I love about Steady Stack is their focus on education. They provide us with a wealth of resources and tools to help us make informed investment decisions. The mastermind sessions are especially helpful, as they give us the opportunity to learn from experts in the field and ask questions.Another thing that the company is doing well is fostering a sense of community. The members of Steady Stack are all supportive of each other and eager to share their experiences and knowledge. This creates an environment where everyone feels welcome and motivated to succeed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dankers",
          "Nb_Reviews": 5,
          "Date": "2023-04-28T23:01:51.000Z",
          "Titre": "Best NFT Project EVER",
          "Contenu": "I've been on Steady Stack for various months, and I couldn't ask for a better community. I've gotten whitelists to some of the most prestigious NFT projects there are in the ecosystem, which have all provided me with excellent utility for networking and wealth generation, following options swings from Beau who literally never misses, trading classes, analysis from different Titans, etc., and we haven't even started on the crazy utility that will be applied in the future. Literally the best project I've been a part of (not only in Web3), could not ask for a better team."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Fors",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T23:08:20.000Z",
          "Titre": "Steady Stack is an absolute honey pot…",
          "Contenu": "Steady Stack is an absolute honey pot of material and connections for anyone looking to better themselves. Don’t be fooled by its cover as an NFT, this is a mastermind group and a LIFESTYLE"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "carlos katsaris",
          "Nb_Reviews": 1,
          "Date": "2023-04-29T22:12:52.000Z",
          "Titre": "Best Mastermind group in the world",
          "Contenu": "From trading options to real estate, from multiple courses on every aspect of success and high income networking and collaboratorsThese guys have more utility and value to offer than any other NFT project in the world. Not exaggerating."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Austin Kirby",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T15:53:15.000Z",
          "Titre": "Steady Stack Real World Utility",
          "Contenu": "The Steady Stack team has been revolutionizing the trading and NFT world since its launch. The team has focused on and heavily invested in the learning and development of its customers/community and they continue to drive nonstop value into any member who joins the community. I highly recommend this company to anyone that wants to be surrounded by a group of likeminded traders/investors."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin Luttrell",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T21:33:59.000Z",
          "Titre": "Underestimating extreme value is hurting your pockets.",
          "Contenu": "I'm a firefighter/ paramedic by trade without any school education in business, marketing, etc but with the guidance of this amazing team they have been able to show & teach me smart successful ways to understand, retain and apply. I was introduced to SS through a another project. It was last year in the middle of a bear market when I first saw them. Though having high caution for all projects at that time, it was easy to see that SS is something different. SS is a Brand/ Top Tier Lifestyle Club with an AMAZING community. I am learning so much not only from the founders but also by utilizing their courses to further my education, knowledge and overall drive for life and success - no matter what the topic is. The community is very engaging, helpful, respectful and I have not seen or heard anyone act in a way where they feel they are better others. I am very excited to see the direction the founders and team take this but also excited to see how much I will grow as an individual and business man."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Yanik Chauvin",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T22:04:59.000Z",
          "Titre": "Quality wealth and investment tools!",
          "Contenu": "I've been trying to find an online community that could hone my swing trading skills (which were pretty basic) and after many discord group fails, I found Steady Stack. On top of their algo bot that gives buy/sell suggestions, there's a complete trading course and top level treaders giving actionable information.I can't recommend this group enough!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Travis Wagner",
          "Nb_Reviews": 4,
          "Date": "2023-04-28T23:48:45.000Z",
          "Titre": "Steady Stack is the real deal",
          "Contenu": "Steady Stack is the real deal.  It's the first (and perhaps only) web3 project I've seen that is based on sound business strategy.  When most NFT projects were about profile pictures, Steady Stack offered utility as soon as the Discord group opened before anyone even minted.  Post-mint, the funds were used to invest back into the project and add a wide array of new value and utility for its members.To put it concisely, Steady Stack provides the education and resources to elevate your trading, investment, business, and life in general.  Perhaps the best way to convey the value of Steady Stack is through its community members' loyalty:The tokens that grant membership to this community have a market value of over $8000 (and some of them would probably sell for MUCH more than that).  Over 70% of these tokens are hard staked.  That means their owners could not sell them -- even if they wanted to -- until the end of the staking period. Many of these tokens are staked for ***3 YEARS.***  Most of that staking happened within a few hours after it became available. Some members of the community were asking for EVEN LONGER staking periods!If you are looking for a community that will help you level up, you have found it."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Bak",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T23:30:43.000Z",
          "Titre": "lifestyle brand and tech innovation leader",
          "Contenu": "I have been part of Steady Stack for over a year now, and let me tell you it was the best thing that happend to me in quite some time. There are multiple reasons why1. I learned a bunch of skills like trading/real estate/mastering metallity and much more. 2. i made a lot of money through the calls there.3. the connections in that group of people who look to be high value people is absurd.you literally get acess to lawyers,multi figures vcs, programmers etc. just by being part of the ecosystem.And the best things are yet to come. Steady Stack is constantly building and expanding on its utilitys. Best place to be to level up as a person and archive your Ambitions!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 2,
          "Date": "2023-02-10T21:41:57.000Z",
          "Titre": "Amazing value for traders",
          "Contenu": "Steady Stack has given me good knowledge of trading options. Through the masterclass, it has allowed me to discover trading techniques I am using to paper trade in the market as I try and perfect my strategy. This is knowledge that you wouldn't get publicly and skills only those that have worked under hedge funds and veteran traders would get. Great value and one of the best purchases I have made in 2022!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Sengo TV",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T19:03:31.000Z",
          "Titre": "Wealth catalyst = Steady Stack",
          "Contenu": "ROI of 300% due to the learned trading skills is just a side effect.I've been aware of technical analysis but the master class provided so much more. More tips on how to analyze the charts and, more importantly, how big of a part emotions are. The result is just me taking less trades but the ones I enter, I enter confident!Providing me the chance to represent Steady Stack as an Outreach team member opened the world of collaborations and partnerships in the web3 space.This is the ultimate network leverage"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Patrick",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T05:08:24.000Z",
          "Titre": "Steady Stack 👀👀👀",
          "Contenu": "Steady Stack is a project you don’t want to miss out on . Lots of Alpha to get your hands on at any given day. Masterclass to start with to learn at your own pace. Top Mentors who will guide you through any arising problem.  Collaborations with other high class projects will give you a compounding return on the initial investment."
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "David",
          "Nb_Reviews": 3,
          "Date": "2022-12-16T02:34:05.000Z",
          "Titre": "Learning and Mastering Trading Skills…",
          "Contenu": "Learning and Mastering Trading Skills from the Best! Before joining Steady Stack I had no clear rules and sometimes I won sometimes I lost trades. I had no consistency. With the amazing Masterclass and guidelines from Beau and Zan I learned how to build a trading plan, execute it and make consistently profits. I joined Steady Stack 4 months ago and my trading results are getting better each month because I can learn everyday a lot from Steady Stack and exchange with like minded people within the Community!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "snoopdoggiz",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T17:42:12.000Z",
          "Titre": "Steady Stack truly are the Titans",
          "Contenu": "Most NFT projects are useless, either being a fashion or IP brand, but SS is the exception. Steady Stack offers utilities that make you a better person, such as trading, sales, marketing and more. The community is very tight and helpful, and everyone benefits from the great alpha callers. I highly recommend joining Steady Stack, this will absolutely be a blue chip project."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bernardo Rios",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T23:29:16.000Z",
          "Titre": "Steady stack for all levels of life.",
          "Contenu": "Being new to web 3, I couldn’t be happier to be part of the Steady Stack community. Questions are always being answered for any level of experience. Personally I’ve benefited from the masterclass as I knew nothing about options trading and I’m well on my way to make that a full time income. There are many resources from stocks, to NFT alpha, crypto alpha, business lounge and just like minded individuals all on the same trajectory of growth! Awesome community!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Jake",
          "Nb_Reviews": 1,
          "Date": "2022-12-18T13:04:21.000Z",
          "Titre": "its called steady STACK for a reason",
          "Contenu": "before i joined steady stack i was a typical retail trader winging it in a bull market, ive been in the discord since march 2022 and SS has dramatically improved my NFT knowledge and crypto leverage  trading skills....i mean extreme improvement and consistent winning trades...but the biggest thing for me personally is the networking inside the discord and twitter....now ive branched out and really entrenched myself in the web3 scene. I have  gained so much confidence from steady stack and in this scene you gotta have that"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Bill Freedman",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T18:01:20.000Z",
          "Titre": "Since day 1 of joining the SS Titans…",
          "Contenu": "Since day 1 of joining the SS Titans the knowledge gained and insight into both trading and web3 has been next level. I have easily 100x my initial investment with the alpha callers and the community have shown me the path to becoming a successful day trader. Top class community run by proactive, super helpful leaders who understand what true utility is. Thank you team!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Humble Oak",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T17:04:34.000Z",
          "Titre": "Steady Stack Experience",
          "Contenu": "Steady stack has been a great resource for helping me learn about options trading as well as opening other NFT related opportunities within the space. I have been able to get whitelist to exclusive projects through their outreach team as well as have made profit following Beau's Option calls. Huge shoutout to the team!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Consumer",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T16:24:28.000Z",
          "Titre": "SteadyStack is here to stay !!",
          "Contenu": "Joined SteadyStack in Aug of 2022 with little to none trading knowledge. That quickly changed as it is a welcoming environment for anyone from beginner to pro trader.  Through the masterclass system  and weekly classes offered by Beau, Xan and RPH leadership  I quickly became confident to enter in trades which I did successfully.  The communication and knowledge in SteadyStack is second to none. Whether you’re looking to learn more about NFT’s, crypto , stocks and options, SteadyStack is the one stop shop that has it all. Great network of helpful individuals and a true sense of community. Truly a game changer for myself and many others!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Travis Wagner",
          "Nb_Reviews": 4,
          "Date": "2022-12-15T00:56:14.000Z",
          "Titre": "Best Web3 Project",
          "Contenu": "I followed Steady Stack on Twitter basically from the beginning, and I joined the Discord as soon as I got an opportunity (back in March). It immediately stood out because they had utility on day one for everyone in the server. Then they built up layers of additional utility before mint. After mint even MORE utility has been added, and the community just keeps getting better (literally every week). I get WL to more projects than I can mint. I get more alpha calls than I can trade. I get more reports and analysis than I can read. The cup truly runs over in Steady Stack!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Harley",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T08:12:32.000Z",
          "Titre": "From Boys, To Men, To Titans.",
          "Contenu": "These guys are helping the average Joe get to the next level. You won’t find anything like this in the Web2 world I feel. Pays to be early 👀. So thankful that these guys are helping me elevate my financial knowledge to help me gain my ultimate goal of becoming financially free in the not to distant future!"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Miguel Alvarez",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T10:36:07.000Z",
          "Titre": "Steady Stack is changing my life for…",
          "Contenu": "Steady Stack is changing my life for the better. I have gained a tremendous amount of value already with some of the best Alpha and Stock callers in the space. With institutional investment opportunities coming up + all the passive stuff launching this is a true goldmine for every investor. The true all you need illuminati investment group. Get in while you still can."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aric Springstroh",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T05:17:12.000Z",
          "Titre": "Steady Stack has what you Need",
          "Contenu": "The breadth of information available on the Steady Stack discord is literally mind blowing. There is more information and alpha in there than any one person could possibly make use of. Personally I have benefitted from the White List give aways and NFT Alpha calls.  Not to mention simply purchasing a Steady Stack NFT on day one has made me 1.6Eth based on the current floor. The future is bright for the Titans of Steady Stack!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CataractAcrobat",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T11:49:17.000Z",
          "Titre": "Steady Stack Cataract",
          "Contenu": "The organization of all the different channels in the discord made it very easy for new members to navigate it and see the value within each channel has to offer. I've been in many different projects before and what the team does easily makes it in the top 2 projects I've ever invested in. There's more than enough bread crumbs of alpha to give non-holders the ability to save up enough money to become a Titan within a week or two with around $600 without a doubt. It's been such a great experience. I look forward to what the future holds."
        },
        {
          "Note": 5,
          "Lieu": "TR",
          "Pseudo": "NoRush",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T03:26:30.000Z",
          "Titre": "Investor illuminati ^_^",
          "Contenu": "Investor illuminati ^^ I been with them since first 1k member. Continuing support and development all the time. I believe the team and the leads from the heart. They are hard working people who always over deliver. Before this community I was struggling finding a nice long term project to be included. Finally I found Steady Stack and everyone in the community is smart and collaborative. Lots of educational content all the time. How to build wealth, mastering psychology and business. Finding problems - solving problems, learning about trading in any aspect and so much more. Glad to be included."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AdamVisuals",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T09:23:17.000Z",
          "Titre": "Best way to elevate your finance and connections",
          "Contenu": "This has by far been the best investment I have made for myself. Steady Stack provides the best community of people and ecosystem that provides the highest level of engagement. It presents incredible techniques for trading in the stock market (huge credits to Beau). Graphic design is a main focus for me. When I displayed a portion of my work in the community, the response level was through the roof! With love and support. This then led to high quality connections and got me life changing opportunities. So blessed!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Moazez",
          "Nb_Reviews": 1,
          "Date": "2023-04-29T22:18:23.000Z",
          "Titre": "Steady Stack Experience",
          "Contenu": "Being a part of the Steady Stack community has been an incredible journey so far! This extraordinary ecosystem, built by the visionary founders Hassan and Zan Shaikh, has opened up a world of opportunities for me in the rapidly growing Web3 space.The educational content and masterclasses offered by Steady Stack have empowered me to make informed decisions in the realms of crypto, NFTs, and investments. The community is filled with enthusiastic, like-minded individuals who are always eager to collaborate and support each other in achieving success.What sets Steady Stack apart is their unwavering commitment to delivering value to their members and staying ahead of the curve in the ever-evolving NFT landscape. I feel extremely fortunate to be a part of this remarkable community and can't wait to see what exciting developments await us in the future. Thank you, Steady Stack, for this incredible experience! 🌟🌐🙌"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tex",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T18:02:19.000Z",
          "Titre": "Steady Stack is game changing",
          "Contenu": "Steady Stack is. Quite literally changing the game in Web3. I have been in the space for almost a year and this is by far the most utility packed business in the game. It's not some simple project.Trading Algo.Trading bots.Masterclasses.Literature.Business incubator.NFT WL central.Web3 News.Simply just scratching the surface.Titan Takeover is real."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luke Almaraz",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T18:30:17.000Z",
          "Titre": "The highest quality tools and community…",
          "Contenu": "The highest quality tools and community and truly offers multiple paths of upwards mobility.  The traders and courses are priceless. It's refreshing to be apart of a NFT project that truly offers the best in class resources similar to a web2 one. Overall, no complaints and the future is so bright."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "th jester",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T22:31:30.000Z",
          "Titre": "Steady Stack - what a game changer!!!",
          "Contenu": "Steady Stack has really given me a different perspective on trading and what it truly means to exceed at ones goals. The master class - amazing, taught me so much about trading and the proper mindset for success. Invaluable information, Amazing community. So glad to be a Steady Stack Titan!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DayTraderNick",
          "Nb_Reviews": 1,
          "Date": "2022-12-15T18:27:33.000Z",
          "Titre": "Grab a Titan, escape the rat race! That Simple!",
          "Contenu": "SteadyStack has helped me find a place to learn from top traders in addition to being around like minded individuals through their powerful community. Just from my initial purchase price I'm up almost 30x! Not to mention the profits from Beaus calls and all the white list opportunities I acquired that led to easy double your money scenarios. Been here since March 25th 2022 and have gone from struggling to pay bills to being financially independent through the opportunity's found in the discord and resources provided. Highly recommend joining the community before the cost of entry reflects the value provided!"
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "ksiek",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T15:47:35.000Z",
          "Titre": "Best community in WEB3",
          "Contenu": "I am in SteadyStack from just the beginning. I followed creators of it since Nov 2021 and started supporting SS in march. I am a proud holder of 2 titans which I minted. SteadyStack has the best alphacallers, professional traders, news reports, access to new projects and obviously the best communitu and connections. Join us before its too late!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T16:31:49.000Z",
          "Titre": "Best NFT I have minted and bought!!!",
          "Contenu": "Best NFT that I have minted and definitely the best NFT that I have bought. I am up over 5x on other NFT projects that were introduced to me by Steady Stack research department. Beau’s trading reports and watchlist have been a revelation.  The Master Class is a great guide and the community is there to help with everything. My fears of trading have diminished 88% since starting. I highly recommend becoming a Titan in 2022-2023."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Savio John Swavzzio",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T08:57:47.000Z",
          "Titre": "Blessed",
          "Contenu": "I love the trading master mind that gives every individual the opportunity to learn and grow. The environment has provided more than I can ask for. Everything from the trading course to Beau’s calls to the algo, I feel extremely equipped to tackle the market."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "x Delk",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T23:16:53.000Z",
          "Titre": "A Must Have for Traders",
          "Contenu": "I minted Steady Stack to learn more about trading and better my skills, and it has far exceeded my expectations. From an in depth course, to a knowledgable 7 figure trader giving calls and daily market information, Steady Stack is extremely undervalued. Big shout out to Beau who is always willing to answer questions and guide us daily in the market!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nassim Menkor-Ono",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T21:52:11.000Z",
          "Titre": "Most utility in web 3",
          "Contenu": "Since joining my trading has greatly improved, even without getting the algorithm yet. The community is extremely helpful and is very tight knit. The consistent zooms also help greatly. Every I know is dying to get into steady stack when I tell them all the real world utility. No reason to sell because you an easily make back the cost of a titan. LFGG 3 digit Floor price 2023"
        },
        {
          "Note": 5,
          "Lieu": "CZ",
          "Pseudo": "Fanatik",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T11:23:39.000Z",
          "Titre": "Different NFT project and most unique one",
          "Contenu": "I looking for few year to find anything like Steady Stack is it. Where will be experience people around me, looking for help each other be opened to discuss opinion, trades, alpha calls, market structure and much more. Whole community is full of amazing people like Beau, every post is holy grail with information. In my past trade with Beau i was able to make beautiful 34% profit in just 2 days after i enter the trade.Also thank you for Masterclass education, help me a lot understand so many thing like how to properly use indicators (trust them), risk reward management.Even we have one of worst market conditions right now whole team working so hard and i would be like to thank you all of you guys Xan, RPH, Beau! We will work together we will grow together!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T17:29:37.000Z",
          "Titre": "The Investment Illuminati",
          "Contenu": "Having been spending the past couple of years trying to learn about personal finance and investing, I was struggling with information from books and inexperienced YouTubers. Then I found SteadyStack. The community and team that run SteadyStack are second to none. The training and information shared has turned my stock investing from unprofitable to profitable nearly instantly. I've increased my portfolio by 20% over two months, and thats not even utilising everything they have to offer. Not only that, but the sheer amount of information provided about other investment avenues is also great. From Crypto to NFT's - they've got most things either covered or on the horizon."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cam",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T23:16:54.000Z",
          "Titre": "Steady Stackin opportunities",
          "Contenu": "I was looking for a group that would be able to compile all the best investments and opportunities to make money and I am happy to have found Stady Stacks because they have done just that. I have had many opportunities for whitelists and I do not need to spend hours a day in discords to try and get noticed so i can get a WL spot. There are tons of like minded individuals as well and everybody treats one another as family. Its a great community with great leaders"
        },
        {
          "Note": 5,
          "Lieu": "EG",
          "Pseudo": "Djedi",
          "Nb_Reviews": 1,
          "Date": "2022-12-18T15:04:20.000Z",
          "Titre": "Steady stack completely changed my…",
          "Contenu": "Steady stack completely changed my perspective in NFTs. So far my experience with the project been nothing but great, they are the perfect example of over delivering and honestly to a level that I’ve never seen before. Other than the master class, weekly calls with amazing people like Beau and Zan you get a whole community that is interested in trading and willing to help. Alright after mint we started getting dope WL spots for other projects like TTOO and tykes and a few others.. they added dope tools for free to help titans like pocket universe for our safety and alpha sharks to help us too.All that I mentioned above and I still didn’t cover everything because it would take a few pages to really say everything they did and are still doing. My point is, this is the best project in the space today."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bakertrades",
          "Nb_Reviews": 1,
          "Date": "2022-12-15T03:27:02.000Z",
          "Titre": "Investor Illuminati",
          "Contenu": "Love what these guys are doing. The masterclass has helped my trading tremendously and all the alpha callers are bringing the value. My goal is to be a full time stock trader so Beau is my main watch.   Access to Beau makes owning a Titan more than worth it and he's only small part of the value in the grand scheme of things. Steady Stack is literally changing the game/lives and taking over web 3. I'm fortunate to be here early and along for the ride."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JM",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T23:56:54.000Z",
          "Titre": "Life Changing Education and Utility",
          "Contenu": "I joined the Steady Stack on day one from a recommendation of another group I am a member of. The amount of utilities that I have access to is unmatched in this space.  So far I have only been focused on two areas, those being:Masterclass on tradingBeau's Swing Trades and News ReportsThe above two utilities alone without a doubt will be life changing for me. For those that actually apply the utility being provided as a Steady Stack Titan holder, it can change your life for the better but you have to put the work in!2023 is going to bring a lot of new utility to include passive income plays.  This team does not stop and is constantly building in the background.  You will be hard pressed to find any opportunity to match let alone beat Steady Stack!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cesar Ruiz",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T15:50:49.000Z",
          "Titre": "Steady Stack has already gone above and beyond most projects.",
          "Contenu": "I joined about a month ago because my friend had great things to say not expecting much, but I was wrong. I was completely blown away by the amount of knowledge and help I received as soon as I got in. I have never seen a project that had bullet proof knowledge ready to help others break into a field that's highly sought after. I recommend SS to anyone I know because this is what utility is supposed to look like. Super bullish on SS."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Seth Stevenson",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T22:11:35.000Z",
          "Titre": "This group literally helps you stack…",
          "Contenu": "This group literally helps you stack money. Isn’t that why we’re all here? The stock and alpha callers are money printers. The education I’m receiving on top of that not only helps me become better financially but in my personal life as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gerald",
          "Nb_Reviews": 2,
          "Date": "2022-12-15T02:18:00.000Z",
          "Titre": "Steady Stack is a no brainer",
          "Contenu": "I was able to mint two Titans at 0.08 ETH, then added a couple more shortly after mint off the floor. Recently I've added a couple more to bring my total to six Titans.  The floor is currently at 2 ETH so I've already seen a significant value in that investment.I've also won several WL spots from the collab giveaways.  Without these collaborations I wouldn't have been able to obtain WL spots because they are so difficult to achieve on your own.I have also attended Beau's training sessions as often as possible. I'm going to start the Trading Masterclass this week so that I can take advantage of Beau's callouts and the Alpha Callers.  I've seen the testimonials of others having great success from Beau's calls and utilizing the algo bot and I can't wait until I complete the Masterclass so that I can be making winning trades as well.I'm so thankful to be a part of this group and am a Titan for life."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephanie B.",
          "Nb_Reviews": 2,
          "Date": "2022-12-19T05:09:16.000Z",
          "Titre": "Game Changer and unlike any other NFT community",
          "Contenu": "I joined SS in September but had been watching on the sidelines for months before deciding to join the community. So happy I did, it's been a game changer for me.I've been a part of many NFTs but none have brought real world current day to day value like Steady Stack has. I'm a third of the way through Zan's trading master class and it's continuous helping me become a better trader. I listen to all of Beau's weekly classes, follow the morning watch lists, day to day updates, and calls. There's so much utility in just the trading division not too mention all the other areas SS focuses on. Just started following crypto/nft calls from some of the other callers. There's so much to choose from, there's something for everyone. The community is so responsive and helpful, whenever I've had any questions in the past, the SS community is always happy to help out. Honestly Steady Stack is building something special and they have a holder in me forever."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "MassimoCTZ",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T14:46:59.000Z",
          "Titre": "Steadily Stackin, with my fellow titans",
          "Contenu": "Firstly I’d like to start off by saying that without steady stack I wouldn’t have the trading knowledge I have today. From the masterclass to the signal callers to weekly zoom market recaps, steady stack has it all. Oh and that algo on SPY really does hit different. The people you’ll meet and talk to in this community are truly one of a kind. It’s hard enough to find people like this in the world and now we have them grouped up together in what we call the investor Illuminati. This is Revolutionary"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Dave Walton",
          "Nb_Reviews": 2,
          "Date": "2022-12-15T19:46:59.000Z",
          "Titre": "The one web3 ecosystem to shift the NFT meta",
          "Contenu": "Mindset and winning attitude. Since I am a Steady Stack Titan my mentality has completely changed. I now set certain goals I want to achieve and am consistent. Steady in every way and 1% better every day. The community is the biggest support there. Imagine a place where literally everyone wants to see you winning and will help you no matter what. That is my biggest win so far.I just started trading and I always felt uncomfortable because so many people burn their hands. With the masterclass one gets a tool that will accelerate your growth immensely both trading and mindset wise. I know it's hard to believe what is done here but the fact that the founders show up every day and both are extremely motivating and looking for feedback from the community is the synergy needed to achieve anything.And what was done so far is only the tip of the iceberg."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Madd_Dawg",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T07:51:31.000Z",
          "Titre": "Steady Stack is the top NFT project!",
          "Contenu": "Steady Stack is an excellent experience because of the teaching and coaching going on in regards to stock investment and crypto investment.  You see the calls in action, which are consistantly big gains, and you get market research and so it is no joke to be called the investment illuminati.  Follow the plan and you will make big gains for yourself."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen Poynter",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T23:15:16.000Z",
          "Titre": "Steady Stack is setting a new standard in trading communities",
          "Contenu": "Steady Stack is setting a new standard in trading communities. The founders, educators, and alpha callers all have true expertise, so it's refreshing to not have to sort through a bunch of crap separating the diamonds from the rough, but just to be able to log in and see timely, succinct, relevant info needed to succeed in trading. I joined when they launched back in March 2022 and have only been more and more impressed as time goes on, they keep building and adding new tools and refining systems. This is more than just education or algorithms, it's a true ecosystem and network with EVERYTHING one needs to be set up for success in one's own trading journey."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mario Cutino",
          "Nb_Reviews": 2,
          "Date": "2022-12-16T04:21:25.000Z",
          "Titre": "If I could only hold one NFT for the rest of my life...",
          "Contenu": "I came to Steady Stacks looking for a \"one stop shop\" in the world of crypto and NFT's. I was looking market updates, trading advice and most importantly, investment opportunities. I have been with Steady Stacks since mint and it has exceeded my expectations. I have made my money back times 10x just from the 5 tykes I was able to purchase and stake. I have also been able to partner with other projects and provide my wellness coaching service make 4 figures here as well. I have earned lucrative WL spots and will now be able to buy 2 VIP tickets to the first Steady Stake and Tykes meetup with my passive tycoin all because of Steady Stack. The community is second to none in the space and one of the only projects that I do not plan on selling anytime soon."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sean Womble",
          "Nb_Reviews": 4,
          "Date": "2023-04-30T19:52:48.000Z",
          "Titre": "Steady Stack has been a game-changer…",
          "Contenu": "Steady Stack has been a game-changer for me. It is the future of NFT's and Web3. The team is the best alpha callers in many areas, and they always live up to their hype. They continue to add and grow beyond belief."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Rodriguez",
          "Nb_Reviews": 2,
          "Date": "2022-12-14T20:45:06.000Z",
          "Titre": "SteadyStack is hands down the #1…",
          "Contenu": "SteadyStack is hands down the #1 community to be a part of as well as the NFT to own. With excellent leaders and strong communication, this journey had made my life better from a work perspective and at home. I’ve learned how to be a better trader from the masterclass, better presenter/leader at work and so much more. I was very lucky to grab a couple titans early and very fortunate to own 10. The value packed by owning just 1 Titan is completely overlooked. I have made over 20x profit on trades from Beau’s trades as well as tools and strategy from Xans masterclass and live trading classes. The news reports, weekly news letters are all you need to stay up to date. This community is a one stop shop - you don’t need 100 different discord servers, just this one. Grab one before it gets completely out reach!"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Rick Engelen",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T22:22:45.000Z",
          "Titre": "Enter the next gen of NFTs",
          "Contenu": "I am a recent joiner in the Steady Stack community after roaming around in other projects for over a year. Have been looking for a community and team which have a clear direction, vision and execution plan which I found in Steady Stack. Momentarily I am enjoying the trading master class to develop a solid foundation and next to this following Beau's every word to slowly absorb his knowledge and skill. Would definitely recommend to everyone who either wants to up their trading game or wants to join a solid community with a bright future."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Liam Overton",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T15:39:30.000Z",
          "Titre": "Network is your networth!",
          "Contenu": "I’ve had a great experience joining steady stacks since their discord opened back in march. The key for me was to grow my business network, and gain more knowledge as well, with all areas in business - I’m in the process of growing a marketing agency so this is key for me - e.g. sales, marketing etc.. Going into the new year I will be utilising their property and trading division which I have seen profitable for many others in the discord, great to see everyone doing well. There is a clear ROI joining SS. You have everything to gain in all areas of business.What’s it like being in the community? Well, you’ll have easy access to some top level business people, investors and people learning on the same level as you, which helps with accountability and pushing you on as well"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JTL",
          "Nb_Reviews": 1,
          "Date": "2022-12-17T06:46:02.000Z",
          "Titre": "Expert level trading education",
          "Contenu": "Over many years of stock trading, I was definitely in the red overall and was lacking a true vision of micro and macro market cycles. Steady Stack brought so much to light for me and my wife, allowing us to trade with much more confidence with the assistance of trading algorithm software and expert level human traders who are available at almost any hour of the day, within the private Discord server. We are still growing our portfolio and have been mostly in profit, even during the recent downturn of the market. I know that Steady Stack will continue to level up our trading knowledge and will provide immense value in the near and distant future!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rodley Akins",
          "Nb_Reviews": 2,
          "Date": "2022-12-14T14:39:29.000Z",
          "Titre": "My Steady Stack experience",
          "Contenu": "I have been with Steady Stack since the beginning. So I have seen how this has blossomed into such a impressive community. The networking alone is off the charts. My understanding and knowledge of the markets and Web 3 space has grown so much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Blackthorn",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T07:22:01.000Z",
          "Titre": "Best investment 2022",
          "Contenu": "Joining the steady stack \"investor illuminati\" was the best investment decision I've made in 2022. I am a new investor, but the 80% hit rate on Beau's trades are no joke. This is the first real utility NFT project I've seen yet."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stackingallday",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T17:48:17.000Z",
          "Titre": "Once getting into SS, everything changes",
          "Contenu": "Once getting into SS it is an overwhelming wealth of knowledge in every corner, but quickly digested due to the great help and assistance to guide towards utilizing everything there is to offer. Since joining, I could see it was a special community with so much knowledge. Apart from everything I've been learning, that will pay dividends over time, I have already successfully made a handful of extremely profitable trades following the call outs from Beau and his daily watchlists. Every single day there are countless opportunities to make money utilizing the group, and every single day NEW opportunities seem to appear. It genuinely does not stop stacking REAL utilities here, helping all the Steady Stack Titans to Steadily Stack."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Lliam Shelton",
          "Nb_Reviews": 2,
          "Date": "2022-12-17T23:22:50.000Z",
          "Titre": "Steady Stack is shaping the future of it's members.",
          "Contenu": "I have had the most amazing experience since being a part of Steady Stack.For 10+ years I have had no idea on what I wanted to do with my life but I knew that I wanted to do something great and be surrounded by smart people who have the same goals.Steady Stack has helped me to align my dreams to reality by providing all of the resources I need + more alongside an incredible network of teachers / learners and all sorts of people from all over the world.They have bought me great value in opportunities.Since March 2022 I have grown to be able to make money for myself using what Steady Stack has provided.The biggest win for me is being able to trade the stock market efficiently, having learnt from the Steady Stack trading masterclass.Since October I have already taken my trading account from $1k to $5k trading off of my own knowledge.This has created the chance to grow my wealth exponentially."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2022-12-15T02:34:26.000Z",
          "Titre": "A community dedicated to everybody’s…",
          "Contenu": "A community dedicated to everybody’s financial growth has been life changing. They have given me multiple skill sets that will have huge impacts on my life going forward."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Thunderbuddy",
          "Nb_Reviews": 1,
          "Date": "2022-12-15T07:36:46.000Z",
          "Titre": "Opportunity Awaits",
          "Contenu": "Been with them for awhile. They are always looking for ways to deliver more quality so that everyone that is a part of the community can get the most.  They offer so much that you don't have time for everything but gives you opportunity to choose your niche."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "AlphaLEX",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T15:27:10.000Z",
          "Titre": "I love Steady Stack <3",
          "Contenu": "I found Steady Stack by chance and now i can say i was blessed.Before i was struggling to find a community who could fit my way of beeing and who could put me in contact with bussines- minded people like me.I was alone trying to networking and finding useful info and opportunities, all by myself. I didn't know exactly what i was looking for, until i find Steady Stack and suddenly everything was clear to my eyes.Now i feel part of a strong community made of talented and dedicatet people who always look and think three moves ahead. I had consistent gains tanks to all the great calls made in the discord daily, i learned a lot just reading from true masters in trading, crypto and nft, and i feel proud to be part of this, even if i have just scratched the surface and not explored the full potential yet.I bought my first Titan this last september, so i am not an OG member, but i fell in so much love with this project that now i own 7 Titans and i am not stopping till i reach 10."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mark Elliott",
          "Nb_Reviews": 2,
          "Date": "2022-12-14T19:33:26.000Z",
          "Titre": "Steady Stack providing unparalleled investent value",
          "Contenu": "I first heard about Steady Stack in April 2022 through another Web3 community. When I started looking at the utility being planned within this project it was almost to the point of being so much that I questioned if it could be delivered but listening to ReadyPlayerH and Xan I thought it was worth a shot. I was so glad I did as the utility has actually exceeded my expectation. Admittedly, I don't make use of a lot of the utility (e.g. around stock trading) but I have used some of the NFT calls with about 70% making a profit and the remaining 30% breaking even. i.e. I am yet to make a loss on any NFT calls.I was also looking at ways to prepare for the next bull market by learning better ways to research projects. Steady Stack has been a great help in me developing better research techniques as well. For me, this is easily the most valuable utility driven Web3 project I'm involved in"
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Caroz Hassan",
          "Nb_Reviews": 2,
          "Date": "2023-04-28T23:40:37.000Z",
          "Titre": "This is what I want to call community…",
          "Contenu": "This is what I want to call community and a good place to be if you seek a team of likeminded masters who never want to be broke or alone. I have find my freedom I want to have. God bless the team and community"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Shinkel",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T05:09:13.000Z",
          "Titre": "Best NFT project of 2023",
          "Contenu": "Transparency and integrity is key when it comes to the NFT market and the Steady Stack team goes above and beyond when it comes to delivering. Most underrated NFT project of 2023!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "I$aac",
          "Nb_Reviews": 1,
          "Date": "2022-12-15T20:42:43.000Z",
          "Titre": "Steady Stack to the MAX!",
          "Contenu": "Before Steady Stack, I was struggling to find strong communities with a good network of quality people and a concise, thorough and accurate infromation ecosystem about the various topics that I am interested in e.g. news in the crypto space, NFT alpha etc. Now, I have x20 my NFT portfolio on my initial investment in the project and have made some extremely valuable connection which has led me to set up my own web3 developer agency and in my first month, have secured two clients with more pending!The team has curated a strong, professional, positive and optimistic enviornment. RPH, Beau, Xan and the rest of the team are always around to talk with their holders and I have been really impressed with the clear and concise communication line they have established with the community"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Alex M",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T18:27:12.000Z",
          "Titre": "This and nothing else",
          "Contenu": "Words couldn’t even describe how thankful I am for being part of this journey!!"
        },
        {
          "Note": 5,
          "Lieu": "NO",
          "Pseudo": "Pavel Semotan",
          "Nb_Reviews": 2,
          "Date": "2022-12-14T15:26:58.000Z",
          "Titre": "The most helpful community ever",
          "Contenu": "Do you want to learn how to trade stocks/option/nfts? We have number #1 experts which provides you knowledge and calls to each trade which you can be part of. Do you want to be a part of community which keep pushing forward to give the best results? Come and join our family, this is long runner and we are still in the beginning. Value of this thing is unbelievable. Thanks to the team. Cannot wait what 2023 will brings to the house."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stormy",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T23:17:28.000Z",
          "Titre": "Life changing opportunities",
          "Contenu": "Full education with coaching on trading has given my life a different trajectory. While the initial investment into steady stack has gained me over $9400 in value since mint"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "User",
          "Nb_Reviews": 5,
          "Date": "2022-12-14T08:12:19.000Z",
          "Titre": "Underpromiss and overdeliver !",
          "Contenu": "Underpromiss and overdeliver is a best sum up of this brand name. Constantly innovating and expanding, providing quality immediate support in a easily understandable and friendly way. Investment paid off almost immediately, constantly earning cash flow with multiple ways that Steady Stack provides. To join this group is the best financial decision i've ever done"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PrimeApe",
          "Nb_Reviews": 1,
          "Date": "2022-12-15T03:38:38.000Z",
          "Titre": "Titan Takeover is Imminent",
          "Contenu": "The Titans community is the cream of the crop. The knowledge gain and value add to my trading game has been invaluable. From learning to trade to flipping NFT’s there is no subject the Titans do no not excel in."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Geo",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T01:46:32.000Z",
          "Titre": "Bull or bear, this is the best community",
          "Contenu": "I’ve been in Steady Stack since they opened the discord with 130 people in there. I also max minted 4 so I’m truly a day one Steady Stacker. I believed in the vision they set out to create and they’re accomplishing it and then some. I wanted to join because I felt lost on how to progress further in this space, and I wanted a killer group to run with. Everyone in this community serves each other. When I had questions about leverage trading and being brand new, 3-4 members immediately responded with help and info on dos and don’ts. They walked me through the whole process. The outreach team is a beast, they put in so much work for us. Due to them, I’ve been able to secure WLs to some of the best upcoming mints. The combination of teaching from Xan, Beau, Rippy, etc has been eye opening on what’s possible with trading. But there really is something for anyone, whether it’s real estate, mental fortitude, web3, content creation, etc. I really think Steady Stack is the best place anyone can be, bull or bear market. I’m very grateful for the leaders and everyone in the community."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laurie Zydel",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T13:50:54.000Z",
          "Titre": "I have been with Steady Stack since…",
          "Contenu": "I have been with Steady Stack since mint. I knew there was something special about the team and their vision. I am an artist and dont know much about trading and looked forward to learning from this well-versed crew. They haven't disappointed!  They are patent and even offer help to non-titans, which is pretty humbling.  Steady Stack has created quite a family. So happy to be part of it . 🤝"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "G. Jackson",
          "Nb_Reviews": 4,
          "Date": "2022-12-15T09:08:34.000Z",
          "Titre": "Steady stack smashing it",
          "Contenu": "Steady stack provides so much info and value, sometimes it feels like you can't keep up with it. Every channel and member seem to be bringing something new and valuable to the community. I can't believe I'm a titan but will be forever."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MIKE JONES",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T13:48:35.000Z",
          "Titre": "My experience",
          "Contenu": "My experience began once I joined the community. I know this seems like every answer you might have heard, but in steady stack it’s different. People are there to grow their knowledge and that’s the only reason people are here. From the master classes to the swing trades we only make money"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JCrook",
          "Nb_Reviews": 2,
          "Date": "2022-12-14T13:14:36.000Z",
          "Titre": "Don't Sleep On Steady Stack!",
          "Contenu": "The sheer amount of education with these guys is worth the buy-in. The high hit rate of the swing-trade calls (generating over $1M in profits for holders) are worth the buy-in. The insane collab and WL giveaways are worth the buy-in.Noticing a trend here?This company truly sets itself apart from the other noise on the space. Out of 50+ projects I vetted, Steady Stack is one of two that has made it through the bear and the only one that has had a massive increase in floor price from mint(currently floating between 25-30x). I have been given more upward mobility opportunities(exclusive communities & job opps)within the space through Steady Stack than any other projects I'm involved with.Beyond the financial and professional aspect, I truly believe the lessons imparted by the Masterclasses have really changed how I view my limitations in my everyday life as well as the power I have over them and myself. I feel like multiple ball-and-chains have been removed from my hands and feet, and I can feel my strength(belief in myself) growing with each step I take. This is probably the most valuable piece I have taken away from Steady Stack to date.With current announcements leading into major growth catalysts, it's only a matter of time before this project becomes out of reach for the average investor. Get in NOW!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Linus Bucher",
          "Nb_Reviews": 3,
          "Date": "2022-12-20T23:31:41.000Z",
          "Titre": "Greates Investment of my life",
          "Contenu": "I was luckily in pretty early. I found  about these guys on a NT AMA and their vision of how NFT's need to change just caught me. If I can say it in one word it's this. VALUE. They provide so much value. They have different NFT&shitcoin Callers. Of course awsome beau that run's his daily marketupdates with all his heart and has great Stock picks. Awsome.Community - here for everyone. Always helping out - always creating value. Just a bunch of good folks doing good stuff. Good Trading Masterclass by Zan. And a looot of stuff hinted at👀👀."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Travis Wagner",
          "Nb_Reviews": 4,
          "Date": "2023-02-17T23:55:16.000Z",
          "Titre": "Steady Stack <3",
          "Contenu": "I love Steady Stack as a community and as a brand, and I'm really glad to be able represent my community.  The quality of the shirt perfectly reflects the quality of the community and brand!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Dave Walton",
          "Nb_Reviews": 2,
          "Date": "2023-05-02T17:33:04.000Z",
          "Titre": "Steady Stack is the real deal!",
          "Contenu": "Steady Stack is the real deal!I'm usually cautious with reviews but this first sentence is absolutely accurate and I fully stand behind this brand and their team.Whether you are a trader, investor or builder. Steady Stack gives you access to the best resources.I come from the web3 side of their business as I'm a holder of their NFT collection called \"Steady Stack Titans\".For people not familiar with NFTs the best I can describe it is that it's a verifiable digital collectible that grants you lifetime access to the Steady Stack ecosystem. And this is a huge deal.I paid 1k€ in the past for a one-year subscription for a so-called \"Hot Stock Report\" where some stocks were analyzed and that was it. Now by holding a Steady Stack NFT, I have access to this and so much more. For Life!Web3 is all about community and building together.Zan, Hassan, Beau and all of the executive team have truly built the best community of all of web3 over the last 12 months.We are all like brothers and sisters constantly trying to improve and help each other and level up in life.I honestly have never experienced a more motivating digital environment than the Steady Stack ecosystem.As a beginner trader, I started to follow along with our goated trader Beau and made some great returns on stock picks. Now that I'm more advanced I want to follow his option calls where he's constantly dropping bangers. All transparently written down in a trading diary.This brings me to my next point.It's not only about trading but learning. E.g. Zan developed a trading masterclass that brings me up to speed so I can actually follow along with Beau.Titans get access to AI, Real Estate and many more masterclasses on a constant basis.And this is what makes the Titan NFT so valuable. The constant growth.I know it may sound completely crazy to you to buy an NFT. Or maybe you think it's a rug. And that's fine.But I hope I was able to give a little bit of an insight into why Steady Stack is different. And this accounts not only for the NFT but the entire company/ecosystem.If you come from the traditional web2 side you have the ability to get a taste of what Steady Stack is like by purchasing one of their courses.But if you are a growth-minded individual that wants to get far ahead in many aspects of your life I recommend starting to learn more about web3 and our community and ultimately becoming a part of it.I can promise you won't regret it!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "BigFred",
          "Nb_Reviews": 3,
          "Date": "2022-12-14T14:37:03.000Z",
          "Titre": "Investors illuminati",
          "Contenu": "These guys from the team all the way down to community. Are unreal. Everyone helps each other. So many Channels to learn. From web 2-3 business. Started my trading career with these guys. And it’s only going further!"
        }
      ]
    }
  ]
}