{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.a4c.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ryan S",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T18:37:29.000Z",
          "Titre": "Terrible experience thus far...",
          "Contenu": "The item hasn't even arrived yet but i mistakenly purchased a \"used\" google nest hub max as a Christmas gift. I attempted to cancel the order before the item was shipped and Customer Service politely informed me that I could not cancel because a \"shipping label\" had been generated They're wasting my time. Shipping it anyways and then I have to request the refund and pay to return the item. The customer service is either a bot or they're required to send scripted responses"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carlton Huff",
          "Nb_Reviews": 2,
          "Date": "2023-07-05T22:47:49.000Z",
          "Titre": "Still waiting for delivery.",
          "Contenu": "Still waiting for delivery.Certainly not your fault but when I inquired about the delay, your rep gave me the same info as the tracking service.  This small package is laying somewhere in the UPS warehouse, and you now have a dissatisfied customer.  I really asked for help, and not for the tracking status, which I could check myself."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Abhishek S",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T03:36:28.000Z",
          "Titre": "I bought an e scooter for my son which…",
          "Contenu": "I bought an e scooter for my son which the merchant claimed to be “Certified refurbished”. My son was super excited to use it but the scooter never got charged; it came with a faulty battery. I requested A4C to replace the scooter but they said they can only refund my money. I will ship the product back to the company tomorrow and I hope they refund me my money.Don’t put your hopes too high when buying from A4C."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anthony",
          "Nb_Reviews": 3,
          "Date": "2023-05-12T00:45:38.000Z",
          "Titre": "DO NOT BUY FROM A4C!!",
          "Contenu": "I should have done my research about this company before purchasing anything. Just like everyone else, I also received a product that just did not work whatsoever. Do not purchase anything from this site. You have been warned. I wish I wouldn’t have. I’m almost 100% certain that ANY and ALL positive reviews on here are fake and from them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mickey",
          "Nb_Reviews": 2,
          "Date": "2023-07-31T01:41:41.000Z",
          "Titre": "I didn't order anything someone hacked…",
          "Contenu": "I didn't order anything someone hacked my accounts and ordered something with my debit card and when I called the company to let them know the representative said there wasn't anything they could do about it and couldn't cancel the order.  Total BS!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christina Patras",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T03:14:18.000Z",
          "Titre": "I received a defective damaged speaker",
          "Contenu": "I received a defective damaged speaker. I sent 3 emails to A4C support team and never received a reply, until I voice my review of A4C. Finally I received a returned label, but I’m still out $8.01 for a shipping envelope. I I’m not happy that I had to spend $ on an item that does not work, due to the negligence of such an unreliable company. I was not aware that they sell refurbished items. That should be the 1st thing they should post when selling something. Refurbished. I DO NOT RECOMMEND A4C, DO NOT BUY FROM A4C"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Kv",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T21:11:04.000Z",
          "Titre": "No phone # to call",
          "Contenu": "Item showed up defective with only one earbud working. No phone number on their website to contact them only a form to fill out for email. Will not be purchasing anything from this website in the future."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Clifton Budney",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T18:11:02.000Z",
          "Titre": "Didn't receive what I ordered",
          "Contenu": "I ordered an ipad pro 12.9. Recieved package in good time and condition, but they sent me an ipad pro 11 instead. Having an impossible time trying to get them to refund me or replace it for the correct item. I would not recommend anyone to buy anything from this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "A. Shultz",
          "Nb_Reviews": 1,
          "Date": "2022-03-10T20:37:04.000Z",
          "Titre": "Automation != Customer Service",
          "Contenu": "I ordered a couple battery banks that were on sale but didn't seem like mistake. 3 days later I got a cancellation with no explanation. 2 weeks later I get a request to review my experience... Automation is great but you should consider what your customer will experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mo",
          "Nb_Reviews": 1,
          "Date": "2022-03-09T17:15:47.000Z",
          "Titre": "Coupons are not valid. Would not purchase from this website.",
          "Contenu": "I purchased purchase portable battery charger with a 50% coupon on top of a discount. Two days later they refunded my charge with any explanation. That was not fair. Please don’t advertise if you can’t honor the coupons."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris C",
          "Nb_Reviews": 1,
          "Date": "2021-12-17T14:31:50.000Z",
          "Titre": "Misleading shipping estimate and slow customer support response time",
          "Contenu": "I ordered a backpack over 2 weeks ago with an estimated delivery date of 3-5 business days and still have not received the item. The delivery tracking have been saying \"en route\" for the past 2 weeks with no change. I emailed the customer service support and have not heard back from them yet. I ordered it as a Christmas gift but at this rate I do not think I will get it in time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "DV",
          "Nb_Reviews": 2,
          "Date": "2021-12-03T02:38:41.000Z",
          "Titre": "Shipment never made it to my residence",
          "Contenu": "Shipment never made it to my residence. Nothing but excuses from so called supervisor that has been \"helping\" with my situation but not helping at all. Never buy from this company! They are not backed by any guarantee. All I want is my bag and they cannot even do that. Pathetic."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hyosil Bae",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T00:02:24.000Z",
          "Titre": "I did NOT receive my order but A4C ignore this issue.",
          "Contenu": "My order number is A4C-60705 and I did NOT receive this package.I sent an email about this issue to support at a4c dot com but No response so far."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ren",
          "Nb_Reviews": 1,
          "Date": "2021-08-26T15:02:26.000Z",
          "Titre": "I had ordered a case for my phone but…",
          "Contenu": "I had ordered a case for my phone but immediately upon receiving it and did not like it due to it being very heavy for a phone. I emailed customer service to request to return the product but never got a reply back. Still awaiting."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Aaryan",
          "Nb_Reviews": 1,
          "Date": "2022-03-10T15:07:15.000Z",
          "Titre": "Received wrong product",
          "Contenu": "Received wrong product. Ordered Wireless Battery pack. For the product that I received there is no wireless capability. It is some no-name brand generic battery pack. Definitely going to return them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bria Goins",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T16:41:46.000Z",
          "Titre": "AirPod broken upon delivery",
          "Contenu": "When package arrived one of the AirPods was not functional at all which delayed the usage of the need of the product. Still waiting for a reply from buisness."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Annon Amous",
          "Nb_Reviews": 1,
          "Date": "2021-11-09T17:58:08.000Z",
          "Titre": "Horrible customer service.",
          "Contenu": "Ordered surround system that was refurbished.  The surround speakers were not in the box. While they reply to emails, there is no one who will give status other than “escalated” for a week now.  Still out the money I paid and only half a setup.  HORRIBLE customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Julius azamus",
          "Nb_Reviews": 1,
          "Date": "2022-03-08T13:26:29.000Z",
          "Titre": "I have ordered the otter box model and…",
          "Contenu": "I have ordered the otter box model and i received a different brand , You can not switch products without letting the customer know . Even if its an upgrade ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard James",
          "Nb_Reviews": 2,
          "Date": "2022-12-12T16:23:10.000Z",
          "Titre": "Wireless charging station is not…",
          "Contenu": "Wireless charging station is not operating. I plugged in my MS Surface Pro8 tablet to recharge and the A4C charge depleted withing 30 min from a full charge."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michelle S.",
          "Nb_Reviews": 3,
          "Date": "2021-09-07T20:29:57.000Z",
          "Titre": "I have been trying to get in touch with…",
          "Contenu": "I have been trying to get in touch with customer service but no one writes back and there is no phone number. They say if your item is defective of you need to return it for any reason reach out to us. It is almost to the 30 day refund date and I cannot get in touch. No response."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MiamiZ",
          "Nb_Reviews": 4,
          "Date": "2023-03-30T01:52:36.000Z",
          "Titre": "Customer service abandoned me!!",
          "Contenu": "Shipping time on the order was 3-5 business days yet it took 16 days to arrive.  It wasn't A4C that caused the delay but I called the customer service center several time for help with contacting the carrier to try and get the package on track, to request a refund or to request another item be shipped.  Customer service pretty much said it was my problem to resolve and refused to help or provide any alternatives to remedy the problem.  Unfortunately, I would say it's too risky to use this vendor in the future considering your package could go missing and they feel no obligation to get involved."
        },
        {
          "Note": 1,
          "Lieu": "KR",
          "Pseudo": "lee wonhyun",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T06:33:21.000Z",
          "Titre": "Delivery has been completed",
          "Contenu": "Delivery has been completed. However, the box was all damaged and delivered. I haven't checked the product yet, but the damage to the package is serious."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jorge Reyes",
          "Nb_Reviews": 1,
          "Date": "2023-06-24T16:50:33.000Z",
          "Titre": "ordered AirPods on June 9 it’s now…",
          "Contenu": "I ordered AirPods on June 9 it’s now June 24 and ever since June 21 the package kept saying it’s coming around 7:00 but never does so it would change to coming tomorrow on 7 and so on but never arrives"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Len Dumin",
          "Nb_Reviews": 1,
          "Date": "2023-05-06T15:34:09.000Z",
          "Titre": "Speaker will not connect using…",
          "Contenu": "Speaker will not connect using Bluetooth. Tried multiple devices. Would like to exchange for another one."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T02:59:48.000Z",
          "Titre": "Really can’t review, they cancelled my order",
          "Contenu": "My order was cancelled short after o placed the order. No explanation or apology, or notification. I realized it when I clicked the tracking on the original order confirmation when I had expected it to arrive."
        },
        {
          "Note": 1,
          "Lieu": "PH",
          "Pseudo": "Erik Joya",
          "Nb_Reviews": 1,
          "Date": "2023-06-17T02:44:03.000Z",
          "Titre": "A4C bad fraud detection",
          "Contenu": "A4C considered my succeeding transactions a fraud. I already called yet they can't do anything to fix it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Prouty",
          "Nb_Reviews": 1,
          "Date": "2023-01-10T04:52:59.000Z",
          "Titre": "I have now emailed this company twice…",
          "Contenu": "I have now emailed this company twice to return an item because I ordered the wrong case and they have not responded back to me"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anupkumar Soni",
          "Nb_Reviews": 1,
          "Date": "2022-12-12T20:36:38.000Z",
          "Titre": "Showing high offers prices but those…",
          "Contenu": "Showing high offers prices but those product are at the same price on otherwebsite without the price."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gary Garcia",
          "Nb_Reviews": 3,
          "Date": "2023-06-29T00:24:58.000Z",
          "Titre": "I tried to change delivery address as…",
          "Contenu": "I tried to change delivery address as soon as it was sent I sent email. Long story short I never received this stuff."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Randy Frank",
          "Nb_Reviews": 2,
          "Date": "2022-03-09T15:13:08.000Z",
          "Titre": "Order canceled for no reason",
          "Contenu": "I purchased something with a coupon code and the site just cancelled my order with no warning or reason. Not using them again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anmol",
          "Nb_Reviews": 1,
          "Date": "2022-03-09T17:05:38.000Z",
          "Titre": "My order was cancelled without reason.",
          "Contenu": "My order was cancelled without reason.Though the money was returned, this wasn't one of the best service I expected"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gcoin",
          "Nb_Reviews": 1,
          "Date": "2021-08-29T13:36:21.000Z",
          "Titre": "A4C sells a lot of stale products",
          "Contenu": "A4C sells a lot of stale products. What does this mean? Items will sit on a shelf for years, and they will sell for a huge discount. I purchased an iPhone battery that no longer held a charge; my guess is it sat on the shelf for years and drained the cells. A4C wants me to pay for shipping back an item worth 7 dollars? not worth it never shopping here again"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Juan C Alvarez",
          "Nb_Reviews": 3,
          "Date": "2023-03-28T16:48:31.000Z",
          "Titre": "The product is broken and this company…",
          "Contenu": "The product is broken and this company does not have customer support to reach out to get information."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "dfw jay",
          "Nb_Reviews": 2,
          "Date": "2022-03-10T03:51:56.000Z",
          "Titre": "I was excited for my purchase BUT....it got cancelled",
          "Contenu": "I was excited for my purchase, but without warning or explanation my order was cancelled.  BOOOOOO to that!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William Olejnik",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T04:30:20.000Z",
          "Titre": "Need you to give more shipping status…",
          "Contenu": "Need you to give more shipping status infoHard to find my orderAlso, why does it take 2 weeks to Shillong from Georgia?Been in Vegas for 4 daysWhy so long?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Henry “JHAM” D",
          "Nb_Reviews": 4,
          "Date": "2022-03-23T15:44:43.000Z",
          "Titre": "bait and cancel...",
          "Contenu": "I ordered a backpack for a discounted price.  A4C canceled ordered without contacting me detailing a reason."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JW",
          "Nb_Reviews": 1,
          "Date": "2022-03-19T03:14:25.000Z",
          "Titre": "It’s been a month and no one responded.",
          "Contenu": "A4C has the worst customer service I have ever encountered. I have contacted them numerous times but still with no response. I purchased 2 items from them with the supposed 3 to 5 days delivery but they opt to choose DHL, which is a minimum 8 days delivery from their place in Texas to my location in Southern California. I contacted them on day 8 regarding delivery time, no response until 2 days later, after DHL hand the packages off to USPS, a delivery partner of DHL.It then took USPS 2 more days to mis mark the deliveries. I contacted A4C again and raised the concern of usps marked the packages as delivered but was not. A4C told me to wait for 2 more days as usps may mis mark the delivery but it usually arrives in the next 2 days.I waited, for 2 days, to contact A4C again. This time no response at all. I filed a claim with usps, sent another email to A4C telling them what I did, and asked them to also step in and check with shipping partner to push the concern. But of course no one answered. I waited for another 3 days, usps replied they have misdelivered to the wrong mailbox and advice me to contact the merchant. I attached the emails from usps to A4C, seeking resolutions, but still no response. I sent in another email asking for a resolution or I’ll have no choice but to dispute the charge. Told them I don’t want to take this route and don’t want to ruin their online reputation by having to write a negative review. Till today, it’s almost been a month, still no one responded. I honestly don’t know how I can recommend this business to anyone. Nor how can I hold myself back from leaving this review. It’s been a month and A4C still owe me hundreds of dollars, or products, or an answer. The worst part is they choose to hide and disappear, other than stepping up to take care of the problem. This is the worst online company I have ever dealt with, and I warn everyone to stay away from dealing business with them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ronald Burton",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T22:13:53.000Z",
          "Titre": "My order was refunded due to low stock",
          "Contenu": "My order was refunded due to low stock. Why have a sale if your stock is low."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Br",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T22:14:59.000Z",
          "Titre": "Ordered an item listed as new but…",
          "Contenu": "Ordered an item listed as new but received a used item with no box."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sergio  Lopez",
          "Nb_Reviews": 1,
          "Date": "2022-03-10T02:21:08.000Z",
          "Titre": "Terrible experience",
          "Contenu": "Terrible experience. They canceled my order a couple of days later."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carlos Chacon",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T16:18:27.000Z",
          "Titre": "Bluetooth connection is really bad"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steven Possel",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T13:46:53.000Z",
          "Titre": "The product does not work",
          "Contenu": "The product does not work.  It will not pair to a Bluetooth device.  I am preparing it for return to the company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ALEX LACEN",
          "Nb_Reviews": 8,
          "Date": "2022-06-20T23:21:34.000Z",
          "Titre": "The airpods were defective and I needed…",
          "Contenu": "The airpods were defective and I needed to return the items"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dee H",
          "Nb_Reviews": 1,
          "Date": "2022-03-09T04:53:36.000Z",
          "Titre": "Placed an order for a product on sale…",
          "Contenu": "Placed an order for a product on sale and my order was canceled"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Austin",
          "Nb_Reviews": 1,
          "Date": "2022-03-09T03:15:11.000Z",
          "Titre": "A4C Canceled my order with no reason…",
          "Contenu": "A4C Canceled my order with no reason provided."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alex Otero",
          "Nb_Reviews": 1,
          "Date": "2023-01-02T23:56:26.000Z",
          "Titre": "Product sold is unactivatable Company…",
          "Contenu": "Product sold is unactivatable Company still sold it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-04-01T00:30:12.000Z",
          "Titre": "I got the product and the package was…",
          "Contenu": "I got the product and the package was crushed and product damaged.  I was only able to get a refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alyson N",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T21:29:20.000Z",
          "Titre": "does not work",
          "Contenu": "shipping box damaged. product does not charge phone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Veronikka",
          "Nb_Reviews": 1,
          "Date": "2022-03-11T04:07:18.000Z",
          "Titre": "Upsetting",
          "Contenu": "I was excited for my order but then it was canceled. ☹️"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Buck Sturm",
          "Nb_Reviews": 1,
          "Date": "2022-03-09T16:48:26.000Z",
          "Titre": "Order was never fulfilled",
          "Contenu": "Order was never fulfilled, a waste of time."
        },
        {
          "Note": 1,
          "Lieu": "KR",
          "Pseudo": "Sangmin Park",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T08:09:37.000Z",
          "Titre": "don't received.",
          "Contenu": "don't received.no responseno refund"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Maher Dougan",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T19:38:27.000Z",
          "Titre": "Never got the product that I paid for."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jennifer Doyle",
          "Nb_Reviews": 1,
          "Date": "2022-09-28T01:03:38.000Z",
          "Titre": "I have been trying to email them I…",
          "Contenu": "I have been trying to email them I bought 2 iPad and one came and does not work"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "alfred bellows",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T23:04:04.000Z",
          "Titre": "Spam Bot Site",
          "Contenu": "After my purchase I began getting tons of spam."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Manish Mittal",
          "Nb_Reviews": 1,
          "Date": "2022-12-08T23:30:51.000Z",
          "Titre": "One of the boxes arrived damaged."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bhavesh  Shah",
          "Nb_Reviews": 1,
          "Date": "2021-09-06T13:58:40.000Z",
          "Titre": "The mophie case does not charge my…",
          "Contenu": "The mophie case does not charge my Iphone 11 promax. Do not buy this case."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sean H.",
          "Nb_Reviews": 1,
          "Date": "2021-06-24T14:12:34.000Z",
          "Titre": "Wrong description was posted on item…",
          "Contenu": "Wrong description was posted on item description. Ended up receiving an item that was not what I believed that I purchased. Talked to A4C customer service, didn't take that wrong description on website seriously and simply throw a return option. I feel like I wasted my time while I'm not getting anything out of this purchase. Very unprofessional and highly disappointed purchase"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ron Orlando",
          "Nb_Reviews": 72,
          "Date": "2020-04-20T15:22:25.000Z",
          "Titre": "I ordered an item and they charged me…",
          "Contenu": "I ordered an item and they charged me for it on my credit card.  Today I get an email saying the order was cancelled as they didn't have enough stock to fulfill the order.  Why did you charge my credit card in the first place if you couldn't fulfill my order?  What a lousy way to run a business.  I definitely do not recommend this company to anyone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2019-08-19T21:24:34.000Z",
          "Titre": "Lousy inventory control!",
          "Contenu": "Placed an online order for a new cell phone battery.  Order appeared to be placed,  and I received a confirmation email.  The next morning, I received an email stating that this item is no longer available (tough luck!), and my money was refunded.  False hope - if an item is no longer available, take it off your web site and don't give the customer the sense that s/he placed the order successfully."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sam",
          "Nb_Reviews": 1,
          "Date": "2019-08-16T15:06:20.000Z",
          "Titre": "Check with BBB",
          "Contenu": "I never received the products ordered. Two weeks after receiving a \"shipped\" email from A4C, the associated USPS tracking number returns a \"USPS still awaiting package arrival\" message.I have requested a refund through PayPal and have no intentions of ever ordering anything from A4C again. Years ago, they delivered. Today, not so much.Check with the local BBB before you order."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Wen Zhou",
          "Nb_Reviews": 1,
          "Date": "2019-08-14T13:55:47.000Z",
          "Titre": "I ordered the Bohm Bluetooth speaker 14…",
          "Contenu": "I ordered the Bohm Bluetooth speaker 14 days ago from this vendor A4C.   It still showing as processing and not shipped out.   Contacted A4C by phone couple of times, no body answered the phone.   E-mailed customer service a couple times, no reply received at all.   By far, this is the worst seller I ever have!   If I can I would give them negative 5 star!   Do not by anything from this website.   It is a scam!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "R. Jackson",
          "Nb_Reviews": 1,
          "Date": "2019-08-03T21:55:25.000Z",
          "Titre": "Possibly the worst customer service…",
          "Contenu": "Possibly the worst customer service I’ve encountered in decades. Prices are very good, but if you have an issue, WOW. After being charged twice for one item, I’ve sent 4 emails in a week with no resolution. Forget about calling all together. They never answer or return calls. No matter how good the price, service after the sale is more important to me. Never again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "LUTHER BETHEA",
          "Nb_Reviews": 4,
          "Date": "2019-08-05T21:29:50.000Z",
          "Titre": "The worst customer service EVER!",
          "Contenu": "The worst customer service.  No one will return your calls, you are unable to speak with a Live agent, the answering service tells you that you have called the After business hours when its 2pm in the afternoon.  Great deals and prices, but customer service sucks.  I will not be doing business again, I rather paid more for better support and customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Elizabeth",
          "Nb_Reviews": 1,
          "Date": "2019-06-30T12:13:32.000Z",
          "Titre": "THE WORST EVER DONT BUY HERE!",
          "Contenu": "The worst shopping experience bar none!!  Never received confirmation of order. Never receive shipment notice. Never received tracking info. The worst. THREE WEEKS, the envelope appears at my door!!  Not fast shipping. Trying to return items as arrived much too late for my needs. They have 30 day “just because “ policy. Have contacted 6 times via email form and phone. Never received a response. Am turning it over to Paypal now."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Womack",
          "Nb_Reviews": 1,
          "Date": "2019-03-25T15:23:35.000Z",
          "Titre": "HORRIBLE - AVOID - FAKE COMPANY",
          "Contenu": "1. TERRIBLE COMMUNICATION - They make a lot of claims based on contacting them in some form or fashion but *all* of these break down when they don't respond.  2. DOES NOT PROVIDE TRACKING AS PROMISED3. DOES NOT SHIP AS PROMISED3. VAPOR COMPANY - Address does not exist. No reputation4. Watch out for refurbs.  They change website after you place order4. FLY BY NIGHT - AVOID"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-02-07T17:50:42.000Z",
          "Titre": "I desperately needed some bluetooth…",
          "Contenu": "I desperately needed some bluetooth earbuds I ordered. A4C emailed me they didn't have the right address, when they did AT THE TIME OF MY ORDER. Then they used that glitch in their ordering system as an excuse for not shipping it out right away. Then when I and I asked why the order hadn't gone out, they said it was out of stock! It wasn't out of stock when they took my money!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Epe",
          "Nb_Reviews": 1,
          "Date": "2019-02-05T22:55:55.000Z",
          "Titre": "You suck",
          "Contenu": "You suck! I ordered 2 Bohm speakers and only received 1! You asked to see the invoice, which i sent. Since i sent that, i haven't herd any thing. I also sent a copy of your email showing that not only did i order 2, and  paid for 2 that you didn't ask for but i sent on my own! Since then nothing! no email no nothing! So YOU SUCK! I want my speaker or my money back! Maybe this will get a response!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Akshay S",
          "Nb_Reviews": 3,
          "Date": "2019-08-02T20:46:48.000Z",
          "Titre": "The customer care is a joke",
          "Contenu": "The customer care is a joke. I wanted to return the item I bought, they do not respond to emails and if you doesn't matter what time you try to call them, it directly goes to an auto recorded message saying you've reached after hours. It's been several emails and calls and voicemails but no one's noticed anything for two weeks now."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Mason",
          "Nb_Reviews": 4,
          "Date": "2019-06-14T13:39:59.000Z",
          "Titre": "I ordered 4 items & received 3 items…",
          "Contenu": "I ordered 4 items & received two packages and 3 items...The most expensive item have not received & have emailed them several times & NO response on the tracking $ of the item that  was over $150...Beware, you can buy items that are cheaper then the market, but you only get the cheap items... You wont get the items that are more expensive."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Darren",
          "Nb_Reviews": 2,
          "Date": "2019-07-07T17:21:32.000Z",
          "Titre": "Customer service is unreachable",
          "Contenu": "The product was delivered within 8 days of ordering. However, the package tracking did not work so I tried to contact customer service by email and phone, but they do not respond. Emails are ignored and the phone line goes to an answer phone or cuts you off. I wouldn't order from this company again because if something goes wrong I've little confidence they will help. This seems reflected in the reviews from users who have had things go wrong."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Albert Myers",
          "Nb_Reviews": 1,
          "Date": "2019-05-16T11:58:44.000Z",
          "Titre": "Purchased a used Apple Watch Series 3…",
          "Contenu": "Purchased a used Apple Watch Series 3 (GPS+LTE) w/ 42MM Stainless Steel Case & Milanese Loop and found it would not link with my Apple 5 IPhone.  Sent several emails to customer service asking for return instructions and authorization.  Never had a reply.  Had  to keep the watch, which I would have returned, without the ability to link to my IPhone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-07-31T22:57:57.000Z",
          "Titre": "In stock doesn't mean in stock",
          "Contenu": "Placed order on July 9 for an \"in stock\" item.  Credit card charged on July 11.  On July 30, status of order still showed \"Processing.\"  Emailed customer service and they stated the item is out of stock and no ETA for arrival.  Item still shows in stock on the website.  Canceled my order and ordered from another website."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kiran Paladugu",
          "Nb_Reviews": 1,
          "Date": "2020-06-21T01:52:27.000Z",
          "Titre": "The masks boxes (both of them) did not…",
          "Contenu": "The masks boxes (both of them) did not have any seal on them. And I am quite worried about using any of those masks. I bought two of them and it's all going to be waste. These are kind of PPE and should have been properly sealed and shipped. That is crazy not doing that especially during these times."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shane",
          "Nb_Reviews": 1,
          "Date": "2019-02-10T16:51:36.000Z",
          "Titre": "Zero customer support. Sent a defective item",
          "Contenu": "Was delivered a Bluetooth speaker that had out of date firmware which could not be updated. Customer service was practically nonexistent. Only received one response in 48 hours asking for my order number. After that, I received an email with rma and return procedures. I never asked for a return. I would never again do business with this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-08-15T00:53:43.000Z",
          "Titre": "Bought two speakers from A4C.com one of…",
          "Contenu": "Bought two speakers from A4C.com one of the two speakers a Bohm Impact Plus Bluetooth Speaker was missing the rubber feet from the bottom. I've tried to contact A4C.com several times through their own website and even tried to email their support directly. No answer going on 2 weeks now. Will never buy from them again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ron Tilton",
          "Nb_Reviews": 1,
          "Date": "2019-02-21T01:53:23.000Z",
          "Titre": "TERRIBLE CUSTOMER SERVICE",
          "Contenu": "I attempted to return an HDMI Splitter from A4C. I e-mailed customer service 3 times over a 7 day period but got no response. I then tried calling their customer service number only to get a recording telling me that \"Voice mail is disabled for this extension\". I will now throw away this $10 item and never deal with A4C again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nicholas Chiacchere",
          "Nb_Reviews": 2,
          "Date": "2019-05-11T14:38:17.000Z",
          "Titre": "Received wrong item and return is a joke.",
          "Contenu": "Ordered a 2016 samsung wireless charging pad.  I received a 2018 version with a wall plug that wasn't a genuine Samsung wall plug that doesn't fast charge.  They wanted me to return the charger for a refund but it will cost as much to ship as it did in the first place. I'll stick to amazon and ebay from now on."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-06-24T17:08:25.000Z",
          "Titre": "Unable to contact by phone or email for a return",
          "Contenu": "I have been trying for two weeks now to return one of the three watches I purchased and they have not returned to email or phone calls. They were quick to ship and the products were good with the exception of the one watch it had a chip glass. It says you can exchange or return but they have not assisted me in this"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lester Wimberly",
          "Nb_Reviews": 1,
          "Date": "2019-02-08T16:58:12.000Z",
          "Titre": "defective product & the return policy…",
          "Contenu": "defective product & the return policy is not up to par, you got to email them first then when they finally respond days later they attach shipping labels that you have to print out to put on the package your returning, how about you send me a physical return box or envelope with everything I need already on it!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "melba",
          "Nb_Reviews": 1,
          "Date": "2019-09-12T03:59:54.000Z",
          "Titre": "rip off company",
          "Contenu": "Please don't waste your time with this company because they will take your money. My purchase was incorrect and it was returned. After calling and e-mailing for months still no returned merchandise or refund. So pay a little more and purchase from Amazon where your money and time is respected."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shonte",
          "Nb_Reviews": 1,
          "Date": "2019-02-11T13:35:55.000Z",
          "Titre": "I bought an lol doll for my child",
          "Contenu": "I bought an lol doll for my child. Took my money. Told me it shipped. I told my kid, only to be informed days later they they were wrong and they don't have it in stock and refunded me my money. That was fine, but she was devastated cause it was rare to find the confetti pop that I thought I was buying."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-02-05T11:44:54.000Z",
          "Titre": "Never shipped items",
          "Contenu": "Placed my order 1-19-19The same day I got a confirmation email, an email saying my order shipped, and a tracking number. I thought \"these guys are ontop of things\". Well, as of 2-5-19 my tracking number still says \"USPS currently awaiting package\" and they won't respond to email."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Norman Reid",
          "Nb_Reviews": 1,
          "Date": "2019-03-06T14:49:20.000Z",
          "Titre": "The part you sent me was not operable",
          "Contenu": "The part you sent me was not operable. Whether it was defective or not, I do not know.  But one of our employees who used to work for Best Buy said that the wrong part was sent. It should have been black in color and not silver. I sent it back to you yesterday and would appreciate a quick turnaround."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hitesh Patel",
          "Nb_Reviews": 1,
          "Date": "2019-07-05T00:58:15.000Z",
          "Titre": "I have really bad experience with my…",
          "Contenu": "I have really bad experience with my first time purchase with you guys. bought iPad keyboard case. does not capable with my device. call you guys to retune the time several time. answer machine recoded massage and hang up phone.send several email but not reply. finally got reply but represent person just send address to return the items without RMA number while at your website still saw only way to return items with RMA.still issue not get resolve. i ask customer service to provide RMA let see when i get reply.sorry but this is true."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Wanda McKinney",
          "Nb_Reviews": 4,
          "Date": "2019-07-31T14:23:09.000Z",
          "Titre": "After waiting almost a week to receive…",
          "Contenu": "After waiting almost a week to receive my order and no status update, I decided to contact A4C via email.  I then received a response saying the products were out of stock and I would receive a refund.  Had I not contacted them, I guess I'd still be waiting.  Poor customer service!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nicole Johnson",
          "Nb_Reviews": 2,
          "Date": "2021-08-03T15:35:06.000Z",
          "Titre": "Apple MagSafe charger",
          "Contenu": "The item that I purchased was not inspected because upon arrival it didn’t work. It took the company 2 days to respond to say they don’t accept exchanges right now only refunds. I won’t be purchasing anything from this company again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "kayleeanne cook-williams",
          "Nb_Reviews": 2,
          "Date": "2020-01-18T19:29:34.000Z",
          "Titre": "I am not happy with this company",
          "Contenu": "I am not happy with this company. I got my order completely broken. I have tried to contact them repeatedly about replacing my broken iPad Pro screen protector that came in completely broken and I have the picture to prove that it came in broken and not a single reply has even been given about making this right so I’m out the money and stuck with a broke screen protector until I take this up with my credit card company and that is no way to do business I would not recommend purchasing screen protectors from this company if this is how they treat their customers."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-04-08T01:50:55.000Z",
          "Titre": "poor and slow communication, customer service complete mess",
          "Contenu": "poor and slow communication, first customer representative clueless.  Literally took 3 weeks to get my money returned back to me because the company could not get the correct address label printed so it automatically got mailed back. AVOID at all costs its not worth the extra 10 bucks"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-11-19T15:29:30.000Z",
          "Titre": "I ordered an item from this website and…",
          "Contenu": "I ordered an item from this website and it was so glitchy. I got double charged and I had to take time out of my day to deal with this situation. I don’t think I would order again. I called immediately and I was told package already had shipped which I thought was insane."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Valery Jackson",
          "Nb_Reviews": 1,
          "Date": "2020-06-10T22:51:53.000Z",
          "Titre": "The product came with no instructions",
          "Contenu": "The product came with no instructions, nor a number to call.  I called the company that advertised it to try to get me help.  I thought it was supposed to be a wireless charger.  How am I supposed to get it to charge?  I lay the phone on top.  Nothing happens."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark Emde",
          "Nb_Reviews": 1,
          "Date": "2019-03-03T16:31:54.000Z",
          "Titre": "Nonexistent customer support, buyer beware!",
          "Contenu": "I have spent almost a week trying to contact them about a defective item, with no response, even when they say they will respond within 24 hours. I have even tried contacting their customer support line by phone, no response from them even when you call during business hours on their technical support line, and try their customer service line is full and cannot accept anymore messages. I never would have dealt with the company if I knew about this issue with customer support. The company seems to jyst be a reseller and doesn't stand behind their products."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-06-02T17:57:29.000Z",
          "Titre": "Poor customer service",
          "Contenu": "They sent the item to wrong address. Didn't do anything to help in correcting it even after my inquiries. The order was time sensitive, but A4C simply cancelled it after 3 weeks of showing it as shipped. Don't the customers place order because they want the item?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark D.",
          "Nb_Reviews": 1,
          "Date": "2019-06-10T17:38:12.000Z",
          "Titre": "The SurfacePro Tablet they sold us came…",
          "Contenu": "The SurfacePro Tablet they sold us came with a bad case of the \"screen jitters\".  I used their online customer support email system to take advantage of their 30 Day Risk-Free \"Just Because\" Return Policy that was supposed to have a 24-hour response.  After a week, no response.  Second email, no response.  I called their customer service line several times during the day within the open times listed.  The automated line said it was after business hours and to leave a message.  Unfortunately, their customer service doesn't deliver on their promises."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-03-09T06:53:31.000Z",
          "Titre": "Terrible buying experience.",
          "Contenu": "Terrible buying experience.Item not as described.In have not been able to reach the company by phone directly.I was directed to an answering machine and have not heard from them since sending the message.I have also sent an online request and stool have heard nothing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-11-24T15:39:26.000Z",
          "Titre": "I ordered five and only received two…",
          "Contenu": "I ordered five and only received two chargers. I cannot reach the customer service department to ask for either the rest of my chargers or my money back for the ones I never received. I really need someone to look into this.  And also update.  your website."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ron Orlando",
          "Nb_Reviews": 72,
          "Date": "2020-04-27T19:32:51.000Z",
          "Titre": "4AC charged my credit card even though…",
          "Contenu": "4AC charged my credit card even though they didn't have enough stock to fulfill the order. They need to change their policies and make sure they have adequate stock on hand to complete their orders. Extremely poor customer service!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Adam Siemaszko",
          "Nb_Reviews": 2,
          "Date": "2019-06-05T21:45:30.000Z",
          "Titre": "Refurbished, or Total Garbage?",
          "Contenu": "Sold me a \"refurbished JBL speaker\" -- item came extremely damaged /  missing pieces out of it, despite being in a clean box.On top of that, the tracking number A4C provided wasn't correct. The item showed up randomly one day."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ADonnelly",
          "Nb_Reviews": 1,
          "Date": "2019-03-01T17:01:00.000Z",
          "Titre": "Don’t Purchase anything! It’s a hassle!! I got ripped off!",
          "Contenu": "I purchased 4 headsets. 2 different orders. I got the first ones. I did not receive the 2nd ones and so I tracked it and it was not delivered.  I Told them about it, then out of stupidity, they asked me to send in the invoice that came inside the box with the earplugs. I stated, I did not receive the 2nd box of 2, please replace them. She said she couldn’t. I opted for a total refund. I checked my bank statement and the only credited me for half. I’m so mad at these people. There is no phone number and I got them thru Brads Deals. Never go to this place A4C for nothing!!! You will be and try to be ripped off like I was!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jason Newville",
          "Nb_Reviews": 1,
          "Date": "2019-12-22T23:17:28.000Z",
          "Titre": "Possible Scam site",
          "Contenu": "I bought a pair of Air Pod Gen 2 earbuds for my daughter for Christmas but they never came. When I contacted them they totally blew me off and told me to file a claim with the post office. If you want what you pay for DO NOT USE A4C!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "concerned customer",
          "Nb_Reviews": 1,
          "Date": "2019-02-14T09:01:57.000Z",
          "Titre": "Are they still in business?",
          "Contenu": "My order has remained in PROCESSING status for several weeks. Customer service emails inquiring to the status go unanswered - as do phone calls and messages left. I'm not sure A4C is a going concern anymore. They may be out of business."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T12:24:06.000Z",
          "Titre": "Return policy",
          "Contenu": "Ordered two charging pads. They are unable to charge the phone due to thickness of the case. Return policy suggests that shipping is only covered on returns that are defective, and I'm guessing I'd have to pay those fees since it's an incompatibility with my device."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Thom",
          "Nb_Reviews": 1,
          "Date": "2023-06-17T00:18:46.000Z",
          "Titre": "The item that I purchased was…",
          "Contenu": "The item that I purchased was malfunctioning. I requested replacement but there was no option for replacement. Only refund… so I need to send back and I don’t have any available product for a while."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Vj Beedles",
          "Nb_Reviews": 2,
          "Date": "2023-07-05T18:56:32.000Z",
          "Titre": "I purchased the LG earbuds and  the…",
          "Contenu": "I purchased the LG earbuds and  the left earbud doesn't work. I've done a reset, but it won't come on."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Steven McMahon",
          "Nb_Reviews": 1,
          "Date": "2022-03-09T15:51:58.000Z",
          "Titre": "What I ordered isn’t exactly what I…",
          "Contenu": "What I ordered isn’t exactly what I got. It looks the same, and reviews mention the ability to charge a device wirelessly, but the one I received doesn’t charge wirelessly. So I guess I got ripped or got a bad one. It’s lot enough $$$ to bother returning it so I just suck it up and keep it. It works w cables just jot wirelessly which is why I got it. Shipping was reasonable and if I remember correctly it was also free. Coupon code from the article posting the deal was valid so no other issues just not quite the functionality advertised."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "bgd",
          "Nb_Reviews": 1,
          "Date": "2021-09-01T20:22:04.000Z",
          "Titre": "This was partly my fault I ordered the…",
          "Contenu": "This was partly my fault I ordered the wrong item I immediately called and emailed to stop the order but no response. So I ordered the one I actually wanted and I get not one but two requests to review your service   Well your customer service blows if you must know and thanks again for the lack of response to my emails  😡"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 2,
          "Date": "2022-11-05T03:26:06.000Z",
          "Titre": "The battery stopped charging after 8…",
          "Contenu": "The battery stopped charging after 8 months. The USB cover broke off with in a week which I did not think was a big deal. The battery charged great overall and help up. But after 8 months it stopped charging and the response I received was it has a 90 day warranty. That’s it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "gege",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T23:38:06.000Z",
          "Titre": "one item was meant to be a gift but…",
          "Contenu": "one item was meant to be a gift but arrived with damaged box, customer service didn't offer me any other option but to return it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stephen Jones",
          "Nb_Reviews": 7,
          "Date": "2021-12-22T17:04:22.000Z",
          "Titre": "Shipping takes too long they use DHL…",
          "Contenu": "Shipping takes too long they use DHL and as of writing this review the backpack has to arrive, it does have a tracking number but DHL uses horses to get their deliveries too their destination not trucks or air….."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kristin",
          "Nb_Reviews": 6,
          "Date": "2021-12-21T22:11:21.000Z",
          "Titre": "Shipping is extremely slow and beyond…",
          "Contenu": "Shipping is extremely slow and beyond reasonable amount of time to be delivered.Tracking info is inadequate."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Al",
          "Nb_Reviews": 2,
          "Date": "2021-08-27T21:05:52.000Z",
          "Titre": "And here’s A4C’s downside...",
          "Contenu": "The downside to A4C’s service is they’ve “teamed up with TrustPilot” (by subscribing me) so they can spam me with unsolicited requests for a review - and requiring me to unsubscribe from something I never subscribed to."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Richard Benson",
          "Nb_Reviews": 3,
          "Date": "2022-09-29T16:44:12.000Z",
          "Titre": "unhappy with the sound quality"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JOHN AVGOUSTIS",
          "Nb_Reviews": 1,
          "Date": "2020-10-13T13:32:45.000Z",
          "Titre": "Slow to respond, but they will",
          "Contenu": "Have asked for product support for two days without a response. Not sure why they don't list a phone number, but that makes me suspicious in and of itself. Product failed after two weeks and want to return but cannot get ahold of anyone in the company.UPDATE:  Company responded via email and made good on the item. Little slow in the response, but they did the right thing in the long run."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2020-06-19T10:55:30.000Z",
          "Titre": "Slow shipping",
          "Contenu": "Slow delivery time. Took 5 days to prepare for shipping, and 8 days in transit. Didn't see anything during checkout indicating it would take so long. I ordered some plain masks. Hedged my bets that a mask order could get cancelled, so also ordered the same from a seller on eBay with free shipping. The eBay order was at my door 5 days after ordering."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Deborah",
          "Nb_Reviews": 4,
          "Date": "2019-05-22T14:10:31.000Z",
          "Titre": "No paperwork",
          "Contenu": "I may have missed something in the ad but I did not realize the watch I ordered was refurbished or so complicated. There were NO instructions included for this Fossil watch, which came with a charging station.I can't figure out how to start it. I put it on the charger it went from red to blue, but the watch still not moving..I will probably return it. The watch itself is beautiful. Just not functional."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "rrrickets",
          "Nb_Reviews": 5,
          "Date": "2019-06-26T17:19:08.000Z",
          "Titre": "i like the company and service",
          "Contenu": "i like the company and service i ordered a roku stick with remote(new)after roughly 2 weeks the remote stopped workingnow i gotta pay out another 20 bucks for a new remote thru rokuif i knew this was going to happen.........i don't know if i would have bought it.....but i didn't know2 stars for the product, everything else 5 stars"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rob Schilling",
          "Nb_Reviews": 1,
          "Date": "2018-11-08T11:56:40.000Z",
          "Titre": "Took my money, then nothing...",
          "Contenu": "I purchased a refurbished iPod Touch from A4C.com, or so I thought.While my credit card was charged immediately, the company never sent an order confirmation. Three days and three emails later, still no confirmation of my order.Beware of A4C.com.UPDATE: They finally responded, and my product finally arrived. I ended up returning it. Once they engaged, they were helpful. But, the overall experience was not good."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-01-02T17:55:18.000Z",
          "Titre": "Out of stock",
          "Contenu": "I placed my order on December 19 and a shipping label was created. I paid for expedited shipping because it was a Christmas present. On December 22 there was no update to the tracking information so I sent an email requesting more information. There was no response so I called them on Monday the 24th. According to their website they were supposed to be open. No answer. On December 27 I finally received an email saying my item was out of stock."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dan Sheridan",
          "Nb_Reviews": 2,
          "Date": "2018-08-21T18:32:33.000Z",
          "Titre": "Samsung Gear Fit 2",
          "Contenu": "Received my \"refurbished\" Samsung Gear Fit 2 watch from A4C.  Shipping was prompt.  No paperwork or documentation or owner's manual for the device.  That was strange.  Used for 2 days then battery died.   I recharged the battery and it died again in less than 48 hours.  From what I read battery should last around 4-5 days with normal usage.  HELP!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-03-31T18:11:31.000Z",
          "Titre": "Shipping on 2day express was marked",
          "Contenu": "Shipping on 2day express was marked, but said free shipping and handling on ad. Hit buy and paid for 2 day shipping... Tried to cancel right away... No option... Searched. Sent email... Said was already processed and i would have to send back... So 5 days later( not including weekend) i recieve my package...  One of the earbuds doesnt sit in charger correct... Have to carefully place in charger to charge..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James Lee",
          "Nb_Reviews": 1,
          "Date": "2018-11-15T21:39:34.000Z",
          "Titre": "Defective S3 smart watch.  Poor customer service.",
          "Contenu": "Purchased a refurbished S3 smart watch from the company with a 90 day warranty which I received in a timely manner.  32 days into owning it and the battery will not hold a charge past half a day.  Have tried to contact them by several methods several times with absolutely no response from them.  I would not recommend them for any purchase."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Unhappy customer",
          "Nb_Reviews": 1,
          "Date": "2018-08-09T17:07:47.000Z",
          "Titre": "I made an order by mistake",
          "Contenu": "I made an order by mistake. I called them and they canceled the order. I then placed the correct order. I asked when my refund for cancelled order. I sent  4 emails never received an answer til I went thru PayPal to start a dispute. Still have not received my money back yet. Did however receive my correct order. I would not order from them again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "LPS in SCS",
          "Nb_Reviews": 3,
          "Date": "2019-06-11T01:37:18.000Z",
          "Titre": "Easy to Buy, Hard to Return",
          "Contenu": "A4C delivers product well, but fails to respond to web mail, or voicemails.  I've contacted them several times for support, and to return an item under their 30 day \"Any Reason\" return policy. No response! Fortunately I've used PayPal for the purchase, I hope to get my money back going that route.'"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Victor Manire",
          "Nb_Reviews": 10,
          "Date": "2017-08-06T03:00:11.000Z",
          "Titre": "Frustrated",
          "Contenu": "The product, Samsung Gear Fit 2, arrived promptly in good condition.However there were NO printed instructions included. Nor were there any internet links for instructions.  And the device is not intuitively obvious, like where or how to even turn it 'on' or charge it.  A call to the warranty number elicited the response that they were unable to provide any instructions.  So I requested return authorization."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dana V",
          "Nb_Reviews": 1,
          "Date": "2017-03-25T20:32:04.000Z",
          "Titre": "Non Exchangable",
          "Contenu": "I purchased a refurbished iPad Air 32GB. Upon receiving the iPad I noticed the home button was broken. I asked for an even exchange. The website still lists the item for sale but the price has gone up$10 so they keep telling me that they can't exchange it because they're out of stock. But I can still order them off the website. That's fine. I will take my money elsewhere."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ks",
          "Nb_Reviews": 3,
          "Date": "2017-08-28T08:50:41.000Z",
          "Titre": "Difficulty getting an exchange or a refund",
          "Contenu": "We've had incredible difficulty getting an exchange for a malfunctioning tablet that we purchased from 4AC.  It is difficult to understand why A4C cannot access the device and wipe it clean prior to exchanging it.  As of this date, we have not received a) an exchange for the broken tablet, or b) a refund of our full payment.  Extremely unsatisfactory service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Daniel T Martonis",
          "Nb_Reviews": 2,
          "Date": "2018-08-29T13:14:50.000Z",
          "Titre": "Item never arrived",
          "Contenu": "It is hard to give them any more than two stars because the item never arrived. I waited for weeks, was told to wait another week, nothing arrived so they refunded my money. The refund experience was nice, but I will never buy from this company again because my first experience was a bad one. Not sure if they are trustworthy or not."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "align",
          "Nb_Reviews": 1,
          "Date": "2017-03-04T16:20:38.000Z",
          "Titre": "Incomplete order",
          "Contenu": "Still missing all the items for the one box that was my order. I'm unable to use my device until I have all the items that should have been included in my original order. Customer service was quick to say they shipped the missing item, but am yet to receive any tracking, never less the actual item. I would not recommend this site, and my first time was my last time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tom Aurand",
          "Nb_Reviews": 4,
          "Date": "2017-08-17T04:42:13.000Z",
          "Titre": "A4C Deceptive Sales Techniques",
          "Contenu": "Two chargers, described as new on web page but which arrived used, were described on the packing list as \"Tested for Full functions, R2/Ready for Reuse.\"In fact neither worked as intended and apparently were either factory rejects or returned defective.  Deceptive sales techniques.  Company quickly accepted return request, issued RMA and provided prepaid return shipping label.  I am currently awaiting credit on credit card account."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Vlad",
          "Nb_Reviews": 1,
          "Date": "2017-01-13T03:00:03.000Z",
          "Titre": "Shady way of shipping to Canada . Disappointed",
          "Contenu": "I have bought many items from United States that did not exceed 100 United States dollars and have never being charged taxes and brokerage. When I picked up my $45 adapter for a tablet at the post office they wouldn't give it to me unless I pay them $15 and Brokerage +taxes. In the description it stated that the shipper mandated that I would pay taxes upon collection"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Shawn Murray",
          "Nb_Reviews": 2,
          "Date": "2018-12-28T19:59:28.000Z",
          "Titre": "I attempted to contact someone",
          "Contenu": "I attempted to contact someone, anyone, at the customer service phone number yesterday, all day. Despite trying every option, multiple times, every single extension brought me to a disabled voicemail box and then hung up on me. I never did get a person. Additionally, the item I purchased came without any instructions."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Cmw",
          "Nb_Reviews": 4,
          "Date": "2016-12-29T21:36:33.000Z",
          "Titre": "Not satisfied with referb products...",
          "Contenu": "The product I ordered was a refurbished item. I was not completely satisfied with how the product worked. I contacted A4C to return the item. It took two days to respond back to me via email and instead of fulfilling what I wanted, they offer a replacement \"at no cost\". All I wanted was what I asked: an RMA  number to return. Not another offer to replace.Now I'm waiting for another reply back which may take another two days."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Q Caples",
          "Nb_Reviews": 1,
          "Date": "2017-08-25T12:55:09.000Z",
          "Titre": "Purchased iWatch from what I thought …",
          "Contenu": "Purchased iWatch from what I thought was a legitimate website, but ended up getting a demo watch that is used in retail stores.  After an hour of Googling why my watch wasn't syncing, I found out demo watches were typically stolen then sold online. I believe if this company truly tested the \"refurbished\" iWatch, then this issue would have been caught.  I rated 2 stars because the customer service end of returning the watch was quick and painless."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stephen C.",
          "Nb_Reviews": 1,
          "Date": "2017-09-23T09:11:21.000Z",
          "Titre": "Junk!",
          "Contenu": "Shipped me absolute garbage. I bought a \"refurbished\" iPad and I thought I would receive at the very least a working item. I couldn't even set the thing up. Chips in the screen, the home button got stuck in the down position, and fingerprints all over the item when I took it out of the box. You'd think they would at least make sure the buttons worked before selling the item. They agreed to issue a refund, but what a waste of time. Look elsewhere."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JP",
          "Nb_Reviews": 1,
          "Date": "2017-04-25T13:24:19.000Z",
          "Titre": "Wrong product shipped",
          "Contenu": "I ordered a product from the site. The company sent the wrong product ... a completely wrong product (not even in the same category of product). When I asked to return the product and to have what I had ordered sent to me, they indicated that the product was no longer available. A very disappointing experience overall. Edit: It is now a full 19 days since I contacted the company about the error, and I only now have I received a credit for the incorrect order."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Al",
          "Nb_Reviews": 1,
          "Date": "2016-08-12T13:44:58.000Z",
          "Titre": "Where's the beef ?",
          "Contenu": "Saw the best price offered for the refurbished tracker on CNET. Keen to get it and ordered right away. Only problem is I am still waiting after the order was acknowledged on August 2.  It is now August 12. Will it ever get here. The online tracking on the Canadian side shows nothing. Time to go back to a reliable on line retailer, namely Amazon."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Norm S.",
          "Nb_Reviews": 3,
          "Date": "2018-05-04T01:58:16.000Z",
          "Titre": "Not Worth it!",
          "Contenu": "Not really what I was expecting from these wireless Bluetooth earbuds. They do not last as long as they say they do for talk time nor music playtime. I usually use them on and off throughout the course of my day and answer call often. I have noticed that after 2 hours, battery needs recharge. Audio quality for hearing music it’s very poor. I was expecting a better quality but unfortunately it didn’t meet my expectations. Not bad for the price so I’m glad I didn’t pay more than what I did."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 2,
          "Date": "2017-03-18T01:00:00.000Z",
          "Titre": "Late respond about problem.",
          "Contenu": "I ordered Nexus 10 32 GB Tablet.But i got 16GB so when i got the tablet i checked everything what about the people who don't know about it? They have to use it till warranty expire? Or maybe never know till something wrong. So i tired to E-mail and contact Customer service. They replyed me and 2 answer and no more then i call them. That made me get the answer from then how to do for the wrong product. And i am waiting for the right one they will send it to me."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mike Schnad",
          "Nb_Reviews": 1,
          "Date": "2016-09-08T14:56:04.000Z",
          "Titre": "Wrong one!",
          "Contenu": "I think you sent me the wrong converter Jack. The directions said to go from a three-and-a-half millimeter to a two and a half millimeter which is what I ordered. But the one you sent me I could fit three of the Jacks in the audio out output instead of just one as it should be. you sent me a tiny one. I think I deserve the right product! Mike"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Former Customer",
          "Nb_Reviews": 1,
          "Date": "2017-09-12T01:01:00.000Z",
          "Titre": "Bought Refurbished. Arrived still broken.",
          "Contenu": "Bought a refurbished Moto 360 smartwatch. Turns off by itself after about 1 min and can't be turned back on without being placed on the charger. It's highly doubtful they performed any QA (outside perhaps of just turning it on to see if it powered up for 10 secs) or they would have caught the fact that the watch was broken. At least I was issued an RMA rather quickly but still had to shell out $20 for shipping and waste time going to the post office. So yeah, not so good."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bonnie Carter",
          "Nb_Reviews": 1,
          "Date": "2017-03-11T22:32:26.000Z",
          "Titre": "Not happy",
          "Contenu": "Very unhappy! Got the pad! I charged it 100%  want come on.  So I called customer service and to find out couldn't get another one until this one got there. Well I kept on and finally told me another one would go out as soon asyou see it went out in the mailed. It was mailed it before 11.  But first i had to go to the libary to print labels. I have no printer.  So this so not right. I got the pad for work now I have wait again.   Help please.Thank youBonnie Carter"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Martha Jackson",
          "Nb_Reviews": 2,
          "Date": "2017-03-20T12:59:19.000Z",
          "Titre": "So sign of order yet!",
          "Contenu": "According to my email, a battery was sent out 10 days ago.  It has not arrived, and when I try to track it, it appears it started it's journey in Secuacus, NJ, and has never left that town!  Looks like USPS handed it over to DHL and the whole system is messed up.  A4C has not contacted me, so I don't know how to resolve."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-05-18T18:03:18.000Z",
          "Titre": "I had to file a dispute because my…",
          "Contenu": "I had to file a dispute because my package was stuck in the post office forever.I contacted a4c via email and phone... took me 45 minutes on hold... i didnt even get to talk to a rep yet.I still, until now, havent gotten an email response back from a4c.After everything was said and done... and discovered disputed it. I received the package! IT TURNS OUT THEY GAVE ME COMPLETELY WRONG TRACKING.... how does an automated system give wrong tracking #? Shame on you A4C.... bad customer service. First and last purchase ever."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "judy doyle",
          "Nb_Reviews": 1,
          "Date": "2016-12-27T15:56:06.000Z",
          "Titre": "wrong device",
          "Contenu": "We weren´t aware that this device would not work with our phones. When we looked up the problem, it said that we needed a sleeve to work for our phones to charge. We could not find any more info on where to get the sleeves and the costs!! We now have a product we can´t use and is too costly to send back for a refund!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Melissa k",
          "Nb_Reviews": 1,
          "Date": "2018-12-18T17:23:26.000Z",
          "Titre": "Selling used product as new",
          "Contenu": "I ordered two of the new wifi speakers however when I received my product only one was new and other one was used. It took them 2 days to respond to my email about this situation and by than speakers were sold out. This was my first time ordering from this company and my last.I am very disappointed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "CP",
          "Nb_Reviews": 1,
          "Date": "2016-12-11T04:50:47.000Z",
          "Titre": "Decent delivery time, right kind of case but did not fit",
          "Contenu": "I orgionally Got a replacement HTC one m8 phone. I went to the phone store sprint for a new case and was told the stores no longer carried the case options that would fit my phone. After doing a quick search in sprint online and having trouble i did a Google search and found one through this site. The Price was decente, and delivery took about a week which is reasonable. The big problem and reason for low ratting, my phone is slighly longer then the case so i cant use the case"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "gerrit s",
          "Nb_Reviews": 1,
          "Date": "2017-06-12T06:06:43.000Z",
          "Titre": "Sent defective  solar charger .",
          "Contenu": "Sent defective  solar charger .. does not do what says it is capable  of doing.  Live and learn.  Bought smaller chargers from  a4c before and they workwd .. also bought an ipad keyboard that was great.. this solar charger is a joke,  im not waiting in line at post office driving there for a $15 paper weight solar paper weight actually.. honestly  never again, this company sells defective  items and they take their time shipping, thats something  that i had to point out as well.  Avoid A4C"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2019-02-13T02:38:12.000Z",
          "Titre": "I will hesitate to purchase from A4C…",
          "Contenu": "I will hesitate to purchase from A4C again.  Received my watch with a scratch.  Support stated the watch was no longer in stock and would offer either a refund if I return or 10% back and keep the watch.  I opted for the 10% back.  2 weeks later still no refund after daily emails.  Buyer beware."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JK",
          "Nb_Reviews": 1,
          "Date": "2017-07-27T01:46:38.000Z",
          "Titre": "Refurb missing items...",
          "Contenu": "Ordered refurb (not open box) speaker box.  No wall mount included.  Reported and did get a response that one would be sent (7/10).  Inquired again and got response that no update or have not been able to locate item.  (7/17).  Allowed more time for response, none received (7/26).You wanted a review, here you go."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "SC Liu",
          "Nb_Reviews": 1,
          "Date": "2017-07-09T08:02:27.000Z",
          "Titre": "Misleading picture of the item for sale.",
          "Contenu": "Quality of the item that I received is OK, however, the picture was really misleading when I ordered it. This item is actually a wired headphone, but when I placed the order, it shown as a wireless one. I was really disappointed when I received this item to find out that I had been mislead when placing this order."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Cece",
          "Nb_Reviews": 3,
          "Date": "2017-05-09T08:04:32.000Z",
          "Titre": "I have ordered many things from A4c.com …",
          "Contenu": "I have ordered many things from A4c.com before with no problems but my most recent order has been a nightmare so far.  My order was placed on 4/29 but the tracking number provided has been useless. No updates since shipment on 5/2. Hopefully it arrives very soon but if not I won't be ordering from them again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert J. Moreau",
          "Nb_Reviews": 1,
          "Date": "2017-08-05T14:43:21.000Z",
          "Titre": "The item I ordered was received in a badly damaged envelope and the contents of the order was missing",
          "Contenu": "The item I ordered was received with the package badly damage or having been opened and the ordered item missing,  The Post Office pasted two stickers on the envelope stating they received it opened.  I sent an Email to A4C explaining the situation and include pictures of the envelope.  They have yet to provide a response.  Emailed them again with basically the same information and am hopeful they will respond this time.  Asked for the same item if available or a credit to my charge card if unavailable."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jan Murphy",
          "Nb_Reviews": 2,
          "Date": "2018-02-23T15:04:35.000Z",
          "Titre": "My experience wasn’t so good",
          "Contenu": "My experience wasn’t so good, although it had a satisfactory ending.  I tried very hard to order a product on line, but after providing all my personal information the order wouldn’t go through.  I tried to order by phone, but the call didn’t go through.  It was frustrating, but after I found a customer service link things got better.  After a few emails back and forth, I got one yesterday that provided my with a phone to call to place my order, and the customer service rep did a nice job.  My product has been ordered!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2017-07-23T23:00:25.000Z",
          "Titre": "They prices are awesome but their …",
          "Contenu": "They prices are awesome but their product doesn't work even if their paperwork said: \"Tested for full functions\". I order two times the same device and both had obvious issues, different issues but both really blocking to use the product, so how it can be fully tested but never used at all?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Steve G",
          "Nb_Reviews": 3,
          "Date": "2017-08-08T23:42:59.000Z",
          "Titre": "Received a bad iPad Air 2",
          "Contenu": "Received a bad iPad Air 2. Had a dent in the back and wouldn't stay connected to WiFi. I had to reset the network every time I turned the darn thing on. As it was refurbished, I see this as poor quality control. The help desk lady did a good job, though I still haven't received my refund."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gatsby",
          "Nb_Reviews": 1,
          "Date": "2016-12-04T15:40:52.000Z",
          "Titre": "Out of stock but still showing item was shipped",
          "Contenu": "Bought a surface pen from their website. The shipping information was provided really quickly after the order was placed but didn't update for almost a week. Then, I received an E-mail saying the item was actually out of order and they have to cancel the order. Wasted a week here. Bad management."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kandimalla",
          "Nb_Reviews": 1,
          "Date": "2017-04-18T14:35:57.000Z",
          "Titre": "The provided product (Ipad)is in bad …",
          "Contenu": "The provided product (Ipad)is in bad condition and when I contacted them through email no response. Also when on contacted over the phone in the business hours (Tuesday-4/18/2017) ar 9:30 AM CST) it is saying you contacted after the business hours. No one is there to help for returning my product"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "TNN",
          "Nb_Reviews": 3,
          "Date": "2017-02-03T19:18:42.000Z",
          "Titre": "refurbish item was beat up.",
          "Contenu": "i've bought refurb in the past & they look almost brand new, so i assume would be the case: new item found defect, fix then ship out, or someone bought & return without damage & can only sell as refurb, NO, these where beat up & put back wet. at least clean up try to pass them as some what new, ear bud did not fit the chargeing craddle as should, had to squeeze in & yank out with more force then should. didnt charge first time, then now is, pairing was difficult at first, sound quality ok, not great."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Frank Kelly",
          "Nb_Reviews": 1,
          "Date": "2017-10-13T10:15:18.000Z",
          "Titre": "a4c's definition of \"refurbished\" is …",
          "Contenu": "a4c's definition of \"refurbished\" is just \"used\". Bought a Charge HR from them \"refurbished\" but the screen has lots of scratches and isn't anything like new. Looks dirty underneath too.Refurbished in my mind is \"repaired and looks like new\""
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mike Feygin",
          "Nb_Reviews": 2,
          "Date": "2016-10-07T05:59:48.000Z",
          "Titre": "Wrong item shipped and no way to get the correct item",
          "Contenu": "Ordered an Apple Watch - Silver case with the white strap.  Item arrived pretty fast.  I open the sealed box but the watch is black case and black strap.  Contacted the company for the correct item to be shipped.  Took 6 days to get the reply and by that time, all the watches had been sold out.  Got the RMA to ship the black one back.  The receipt states Silver - White and the box - Black - Black.  Just a total waste of my time and effort.  Next time will purchase someplace else.  It's been 2 weeks and I still have no watch."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tri Dang",
          "Nb_Reviews": 2,
          "Date": "2018-09-29T00:57:09.000Z",
          "Titre": "The Samsung AKG headphone that I…",
          "Contenu": "The Samsung AKG headphone that I ordered from A4C does not sound good like the original that came with Samsung phone. The left side of the headphone sounds intermittent. I’m guessing the headphone is not original, that is why the price is less expensive compared to original."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Roman K",
          "Nb_Reviews": 2,
          "Date": "2017-08-30T22:13:04.000Z",
          "Titre": "ordered Surface Pro3 to Canada",
          "Contenu": "ordered Surface Pro3 to Canadacame but should take in Canada Post on my own - n.p.First.Suraface Pro 3 goes with WiFi - this one what was sent by A4Chad not WiFi adapter at all renewed W10, reset network 2 times - still no adapter at all. can not even install drivers - no device in listSurface Pro 3 as PC works perfectly but no WiFi. Cool.Second.No any stylus included as well as no any mentioningthat it is not included. Should buy for $45 on your own. Cool.Wanted to make this as a gift but how i can make a gift with problem.Cool Guys, Go on."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "align",
          "Nb_Reviews": 1,
          "Date": "2016-09-09T17:08:09.000Z",
          "Titre": "Charger not new",
          "Contenu": "I ordered a new wireless Samsung charger and it came in opened with the seal removed.  The packaged was smashed and parts were falling out.  The charger does appear to be working and we have all the required parts, but it does not appear to be new.  It appears it may be refurbished."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 2,
          "Date": "2016-11-14T16:40:53.000Z",
          "Titre": "Product arrived NOT functional.",
          "Contenu": "I ordered an iPad.  iPad arrived NOT functional.  All items are supposed to be confirmed and certified prior to purchase and ship.  Unfortunately, this iPad was not certified and I missed a personal gift-giving date with my Mother.  I hope the 2nd iPad is certified and functional."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kathryn Guillaum",
          "Nb_Reviews": 6,
          "Date": "2018-10-28T21:27:57.000Z",
          "Titre": "My fault for not being more…",
          "Contenu": "My fault for not being more knowledgeable and yours for selling something useless. I was going to send it to electronic recycle, but I will give it to anyone that wants to play with it.I will not recommend A4C to anyone who is not computer saavy. No owners manual?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mary Newton",
          "Nb_Reviews": 1,
          "Date": "2017-03-05T21:41:57.000Z",
          "Titre": "Products are low quality",
          "Contenu": "I bought a Chromo tablet, it is soooooo slow it is not useful, and I have to pay to return it!  I also bought 3 children's smart watches only one works as it should!  I plan on paying to return the crap I bought!.  The customer service rep was awful and not helpful AT ALL!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ee",
          "Nb_Reviews": 1,
          "Date": "2016-08-15T19:46:13.000Z",
          "Titre": "dissapointed",
          "Contenu": "Have ordered refurbished products form a4c in the past with good results.  Latest order of a fitbit I would categorized as \"used\".  Markedly scratched up and even dirty.  Request for an rma has gone unanswered.  Will definitely think twice before ordering from a4c again"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2019-02-22T16:41:10.000Z",
          "Titre": "Items in stock were not updated",
          "Contenu": "Items in stock were not updated.  After ordering and being told it shipped, I was then notified that my item wasn't in stock.  A refund was issued, but I believe that we should've been notified at the time of ordering that the item wasn't in stock."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Manish",
          "Nb_Reviews": 1,
          "Date": "2017-08-06T06:28:48.000Z",
          "Titre": "Sells not so genuine products. Sad.",
          "Contenu": "Although I received the shipment very fast, the Samsung headphones were not genuine as I compared to my original note4 one.  Listening to music on this actually hurts my ears as it's all treble and no bass.  Oh well. I won't be ordering from this place again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2016-10-19T14:09:34.000Z",
          "Titre": "Wrong Item",
          "Contenu": "It is very frustrating when you order a single $12 item and receive the wrong one.  At that cost, it isn't even worth the time to hassle with a return.  Instead, I purchased from another vendor ... obviously receiving it later than I had originally wanted to."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael C",
          "Nb_Reviews": 4,
          "Date": "2020-04-24T17:16:36.000Z",
          "Titre": "2 Weeks for the item I order to arrive",
          "Contenu": "2 Weeks for the item I order to arrive.  Multiple emails sent to customer service inquiring about the shipping delays, only one was returned - the rest they ignored.  The website clearly states \"5 - 6 business day shipping\""
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jake",
          "Nb_Reviews": 2,
          "Date": "2016-08-25T14:40:14.000Z",
          "Titre": "Not as Advertised",
          "Contenu": "The Surface I ordered was supposed to come with Windows 10, but only came with 8.1. It also will not update properly. I had to contact A4C several times, as they took over 4 days to get back with me. I am now trying to go through PayPal to get things resolved."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Formyson",
          "Nb_Reviews": 2,
          "Date": "2017-01-20T00:51:29.000Z",
          "Titre": "Sent a substitute",
          "Contenu": "I had ordered my son some socks. I ordered them in black and received white instead along with a card stating that the black was out of stock. I oils have liked to be given the option before they were sent out. I would have chosen not to order them at all."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Berker Pekoz",
          "Nb_Reviews": 1,
          "Date": "2017-06-08T03:56:46.000Z",
          "Titre": "Fast shipping but the item I've …",
          "Contenu": "Fast shipping but the item I've purchased isn't working properly, I've got a car phone charger and when I plug it to my phone I can feel it slows down the discharge however it's not charging and even the charging sign doesn't come up"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2017-04-06T21:41:03.000Z",
          "Titre": "Tablet came to me completely dead",
          "Contenu": "Tablet came to me completely dead, no charge and the charger doesn't work.  Inconvenient but i can replace charger faster than it would take me to call them.  Test your stuff before u sell it.  Eh, the tablet works so i won't give it one star"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Mihalyo",
          "Nb_Reviews": 5,
          "Date": "2017-11-03T16:21:08.000Z",
          "Titre": "I did not receive correct product and poor customer service …",
          "Contenu": "I did not receive the product that I ordered, instead I received a different style/ model of the product. It seemed like whoever was filling the order just put what they had left on the shelf in my box. When I contacted customer service about this the woman I spoke to was totally indifferent to my complaint. She told me the product I ordered was out of stock and I'd get a credit once they received the product back. She had no interest in hearing what I wanted (the correct item sent) and treated me like I was bothering her with my call. If this is how this company does business then I'll take mine elsewhere..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ness",
          "Nb_Reviews": 7,
          "Date": "2016-12-12T18:10:47.000Z",
          "Titre": "Got directed to the wrong product",
          "Contenu": "A search on Google for \"Blu One Life case\" led me to a case for HTC One.  I didn't notice the switch (my mistake) and accidentally ordered the wrong product.  I've asked A4C to fix the problem but have not heard back yet as of now."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John L  O'Rourke",
          "Nb_Reviews": 2,
          "Date": "2017-01-12T15:36:11.000Z",
          "Titre": "Unexpected charge",
          "Contenu": "I was looking for a manual of instructions for a new Amazon Fire Tablet and the Google for your website stated free questions and then $28 per month for future advice.  Even tho I did input my credit card info, I did not sign up for any known charges and now find that there is a pending charge to my credit card for $28, which I will refute.  I recd advice telling me to reboot the tablet.  Big deal as I had tried that many times.  After re-looking at your website, it said refunds would be made for any reason, no questions asked.  I do not want to pay you the $28 nor any future amounts.Thank you,John O'Rourke"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jimdaddy7up",
          "Nb_Reviews": 1,
          "Date": "2019-11-05T14:25:57.000Z",
          "Titre": "Bluetooth not working.",
          "Contenu": "I ordered and received a refurbished BOHM head phone set that is supposed to have bluetooth. The bluetooth does not work. I like the sound when using it with a wired connection, but the bluetooth feature would be more convenient."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chula Vista customer",
          "Nb_Reviews": 1,
          "Date": "2016-09-10T03:57:46.000Z",
          "Titre": "Unfortunate experience...",
          "Contenu": "Bought a refurbished Samsung Gear S2 a month ago ($129) and the heart rate sensor didn't work...had to return it.  Bought a refurbished LG Urbane 2 this week and this time the watch had numerous scratches and didn't work at all (turned on and screen went crazy...jumping from one screen to another) and so I had to return it also. Emailed their support staff but never got a reply...called their customer service and was able to get a return authorization. I bought a refurbished Samsung Gear S2 from Best Buy for  less ($99) and it looked almost brand new.  Sorry, I was really hoping for a better experience..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 3,
          "Date": "2016-09-11T21:05:34.000Z",
          "Titre": "Sent me a Broken Watch",
          "Contenu": "I ordered a refurbished Pebble Time from A4C. Upon receiving the new watch I sold my old Pebble. Then I noticed that the watch A4C sent me was not working properly. A4C could not offer me an exchange because they were \"sold out\". It took their customer service a few days but eventually they sent me a return label and AMA number, and processed my return. Now I am without a Pebble watch and will likely end up paying near full retail for one since I need one for work. A4C supposedly refurbished this device and then QC'ed it before sending it out.... Yeah, right. I definitely won't buy from A4C again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JC",
          "Nb_Reviews": 1,
          "Date": "2017-05-09T04:59:00.000Z",
          "Titre": "They sent me used, dirty and smelly band",
          "Contenu": "They did not send me refurbished, they sent me used watch. I mean they didn't even bother clean it. I had to clean the edges with a toothpick to get it cleaned...yuck leather wstrap was smeared with someone's sweat. I could smell it eew"
        },
        {
          "Note": 2,
          "Lieu": "AE",
          "Pseudo": "Shaun Washington",
          "Nb_Reviews": 1,
          "Date": "2016-08-09T10:51:29.000Z",
          "Titre": "Hit & Miss nowadays",
          "Contenu": "I've always been satisfied with A4C's electronics and great prices, lately however they've missed the mark on more than 3 occasions.  I always order Refurbished, but I've been getting \"Used\" electronics with scratched displays, which I can clearly tell.  If I wanted used, I would have bought it, so I'm not sure what the disconnect is within the company.  What I do know, is that if this continues I will take my business elsewhere & just get a refund instead of sending it all the way back from Afghanistan, which means it takes a month for me to get another tablet with a scratched screen."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2018-04-19T13:00:42.000Z",
          "Titre": "I ordered a refurbished Color Nook",
          "Contenu": "I ordered a refurbished Color Nook.  They did not provide the proper plug/adapter to charge the tablet.  Worked 1 time and then quit.  Buyer beware. You will have to buy charger directly from Barnes and Noble for your tablet to charge."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Taylor Cox",
          "Nb_Reviews": 1,
          "Date": "2020-08-19T20:00:00.000Z",
          "Titre": "“Certified Refurbished” OtterBox Venture 65 Quart Cooler (Color: Hudson)",
          "Contenu": "Recently received my 65qt cooler but the Dry Storage Tray & Bottle Opener we’re not included inside the cooler. I have attempted to contact A4C, but not heard back. I will update results if/when they respond."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MA Buyer",
          "Nb_Reviews": 1,
          "Date": "2016-10-03T04:05:48.000Z",
          "Titre": "Price Decent; Delivery Poor",
          "Contenu": "Price was decent. However the final delivery was lacking with poor packing leading to damaged box. Fortunately this was not a gift and the actual merchandise was not damaged but just a poor execution so probably won't order from again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ticked Off",
          "Nb_Reviews": 1,
          "Date": "2017-03-10T21:46:56.000Z",
          "Titre": "totally disappointed",
          "Contenu": "The camera on Chromo little tablet is terrible the most ridiculous camera I ever seen.If I hadn't got rid of the box I would've returned this garbage I most certainly will not be ordering anything else period...TOTALLY TICKED OFF"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Danielle  Ro",
          "Nb_Reviews": 1,
          "Date": "2017-02-20T15:18:51.000Z",
          "Titre": "Could have been better",
          "Contenu": "On one hand I think I received my iPad in a GREAT amount of time, however I was made to think I would be receiving my entire order. I only received half of my order, which was disappointing but I understand things happen. I contact the company and they tell me they are going to mail the missing item immediately so I wait for the confirmation email. Needless to say I had to reach out to them after I still did not receive any information on the item being shipped. Come to find out the item is on back order. So I request another item and I still have not heard back about that one either. I feel it was a missed opportunity at a great transaction."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "I Johnson",
          "Nb_Reviews": 4,
          "Date": "2018-11-14T00:37:21.000Z",
          "Titre": "No plans to do business with this company again",
          "Contenu": "I talked by phone with a rep called Mark and was disconnected twice/hung up on(?) and the called back several times and was put on hold for up to 30 minutes only to be told to leave a message and couldn't, call disconnected w/o ability to leave a message.  Did a chat with a rep (don't remember name) who also was of no assistance.  Finally a rep (Marco) responded to send back but after the hassle I decided to sell item to someone else and get my money back.  Product seems to be pretty good and I have ordered before with no problem but then I didn't need to return a duplicated item due to confusion with my credit card company and A4C order indicating reorder(?)."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-07-14T16:24:45.000Z",
          "Titre": "Item shipped did not have all the…",
          "Contenu": "Item shipped did not have all the parts. Attempted to contact A4C by phone with no luck except for answering machine. Contacted by email and waiting for a reply. I do expect items to be shipped with all the parts."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sue",
          "Nb_Reviews": 1,
          "Date": "2017-03-11T11:41:36.000Z",
          "Titre": "Not ordering from here again",
          "Contenu": "I ordered a fitbit but it wasn't working properly so I called to return it and get another item that was higher in price.  I received a shipping label via email so that was good. I didn't have a chance to mail it back right away, but A4c took the money out of my account for my new item right away before they even shipped it out. Now it has been 2 weeks, and they stI'll haven't shipped out my product. They said they haven't received my return but emailed me the tracking information showing that I sent it and it should be there. I did my part, they can see that I sent my return. They took the money out of my account...but still haven't shipped my product!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "mctoo",
          "Nb_Reviews": 1,
          "Date": "2017-07-15T00:44:17.000Z",
          "Titre": "Ordered 2 wireless phone fast chargers …",
          "Contenu": "Ordered 2 wireless phone fast chargers but only one came with the correct fast charger adapter.Tried to leave an honest review on the product to warn potential purchasers but the review has not been posted by A4C."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-11-22T22:46:19.000Z",
          "Titre": "Called customer support 5 times",
          "Contenu": "Called customer support 5 times, each time was asked to leave a message, never heard a reply, Emailed customer suppor, 3 times, never head a reply even though the website promised a response within 24 hours ."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Zac",
          "Nb_Reviews": 1,
          "Date": "2017-02-03T00:35:06.000Z",
          "Titre": "Do not recommend.",
          "Contenu": "The product was as advertised but had a terrible shipping experience. Customer service took 2 days to respond but luckily i was able to get UPS to resolve issue. Will not recommend and will not shop here again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Marc In South Florida",
          "Nb_Reviews": 1,
          "Date": "2016-11-07T13:47:06.000Z",
          "Titre": "First Purchase - A Disappointment",
          "Contenu": "After hearing good things about this site from a colleague, I decided to give it a try and ordered two Apple Ear Buds. After I ordered, I was unable to get any tracking information from the USPS tracking number provided. After a few days, I called customer services, had to suffer through some really awful music while waiting, and after about 8 minutes, the phone hung up. I called customer service again the next morning and after about 2 minutes, a nice lady offered to replace the earbuds and send them expedited shipping. I never received a confirmation email with another USPS tracking number though. And, after nearly two weeks, I still don't have the daggone earbuds. Needless to say, I am not pleased."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alexios",
          "Nb_Reviews": 1,
          "Date": "2020-02-17T18:44:24.000Z",
          "Titre": "Item ordered and was shown in stock",
          "Contenu": "Item ordered and was shown in stock, ordered was canceled and got refunded. A4C said it was out of stock.Item is shown as in stock on website the whole time, and it is still shown in stock."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lad",
          "Nb_Reviews": 2,
          "Date": "2017-05-26T01:41:29.000Z",
          "Titre": "The headphones are extremely poor quality.",
          "Contenu": "The headphones I purchased from A4C are very poor quality. The headphones  automatically initiate Siri commonds on my Iphone even without pressing any key.Will never recommend the headphones to Anyone."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "SRU",
          "Nb_Reviews": 1,
          "Date": "2017-03-06T02:59:31.000Z",
          "Titre": "Never received item",
          "Contenu": "I purchased a used Ipad. After one week, the tracking showed it never left the first location. I called and they promised to ship another one. Another week has gone by & I have heard nothing further."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2018-04-11T14:41:59.000Z",
          "Titre": "wireless earbuds",
          "Contenu": "I received  a product that does not work and I do not like the product. I emailed about 2 weeks ago and I have not heard any response. I just emailed again and I will wait to see if I get a response"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-01-14T22:14:24.000Z",
          "Titre": "My order was accepted and charged",
          "Contenu": "My order was accepted and charged, but several days later I was informed the product was actually out of stock.  My account was promptly credited, but I can't recoup my time.  Disappointing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ben Bruestle",
          "Nb_Reviews": 1,
          "Date": "2017-03-07T00:33:39.000Z",
          "Titre": "Not Refurbished",
          "Contenu": "The ipad came fairly quickly, The screen was separating from the device. Poor quality control for being labeled as  refurbished, Sent ipad back today.The return and refund seem to be going Ok so far."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Negresse Francoise",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T02:48:04.000Z",
          "Titre": "Shipment is horrible",
          "Contenu": "Shipment is horrible. From 11/22/2023 to Dec 1st, 2023. This happened twice. It takes 8 days for shipment from Texas to North Carolina. There has to be a better way of easing the frustration of the consumer. The items purchased are in great condition & the price is very reasonable but the hassle of shipment takes the joy of expecting your new gadgets OUT. I still recommend A4C, because my dilemma may not be your dilemma."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Allan Cummins",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T20:30:23.000Z",
          "Titre": "Old product (clearly long on shelf) marketed as “new”",
          "Contenu": "I bought the MOPHIE power station (new) as a birthday gift for my brother and upon receipt I found that the product packaging (not the shipment packaging) was in poor condition (torn, faded, wrinkled). I did not open up the package as it is a gift, but I hope the product itself is in good condition."
        },
        {
          "Note": 3,
          "Lieu": "DO",
          "Pseudo": "Ruben Silverio",
          "Nb_Reviews": 1,
          "Date": "2023-07-30T19:02:24.000Z",
          "Titre": "After 3 months the headphones stopped…",
          "Contenu": "After 3 months the headphones stopped working,  I can conet them to my Bluetooth any more , I did all the reecet settings in my phone, but nothing was happening"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rosalee Dent",
          "Nb_Reviews": 6,
          "Date": "2023-03-31T01:10:49.000Z",
          "Titre": "Disappointed about a defect in right…",
          "Contenu": "Disappointed about a defect in right earbud...I asked for replacement and I have to ship the earbuds back at my expense for a refund.These should have been checked for defects before shipping. I am not pleased,will never use this company again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Yvonne Castro",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T02:16:58.000Z",
          "Titre": "Too bad",
          "Contenu": "The sound is great from the ear pods but the ear pods have trouble staying in my ears. If I have them on and start moving around the left one slides out then the right one follows. I’ve also changed the different covered that came included and I’m still having the same issues. I think I’m going to return them. The sounds great and noise cancellation, but if they can’t stay in my ears no point having them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pedro",
          "Nb_Reviews": 2,
          "Date": "2023-08-19T03:42:46.000Z",
          "Titre": "Poorly shipped",
          "Contenu": "Ordered a small item and that got shipped without extra padding, the item box got smushed. Fortunately nothing broke."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Polina Pechenyakova",
          "Nb_Reviews": 1,
          "Date": "2022-11-07T17:48:33.000Z",
          "Titre": "When listening to music",
          "Contenu": "When listening to music - sound quality is adequate, but when making calls - I get lots of white noise and interference, it’s very annoying since it’s hard to hear"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sudhan Kannan",
          "Nb_Reviews": 2,
          "Date": "2022-12-02T14:46:45.000Z",
          "Titre": "Original tws Packaging was damaged when…",
          "Contenu": "Original tws Packaging was damaged when it came .. it had a hole near the tws as if some tried to pull it out.. But so far no issues with TWS..it's working fine"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "WBN",
          "Nb_Reviews": 1,
          "Date": "2022-01-15T09:31:06.000Z",
          "Titre": "Product description is what it is.",
          "Contenu": "Product description is what it is.Using DHL as carrier delayed shipment"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Diquan de LaCroix",
          "Nb_Reviews": 1,
          "Date": "2022-03-12T19:36:13.000Z",
          "Titre": "First time using this site but my…",
          "Contenu": "First time using this site but my purchase was seamless and arrived in two days. Would shop again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charles Mohon",
          "Nb_Reviews": 3,
          "Date": "2023-04-03T22:45:57.000Z",
          "Titre": "I still don't know why the charger came without a plug.",
          "Contenu": "I ordered a cordless charger for my phone. It arrived with a power cord  but no plug."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "aromaz79",
          "Nb_Reviews": 3,
          "Date": "2023-01-09T18:44:59.000Z",
          "Titre": "I dont blame A4C",
          "Contenu": "Due to a misunderstanding with the delivery carriers my order was returned without an attempt to reach me for address verification."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JC",
          "Nb_Reviews": 1,
          "Date": "2019-12-13T23:18:40.000Z",
          "Titre": "Did not honor the 90 day warranty",
          "Contenu": "They sent to order out quickly, but the refurbished product did not work. When I called the refurbished warranty group they said they were not honoring the refurbished warranty and sent me a return label. So basically if you really need the product you may want to order two. I asked the person where it said that a4c would not honor the 90 day replacement and they responded that's just our policy right now."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 2,
          "Date": "2019-10-02T14:55:40.000Z",
          "Titre": "Slow Shipping",
          "Contenu": "I ordered a tablet through A4C rather than amazon because of good experiences in the past. I was disappointed with the delayed shipping. It took almost 2 weeks to get my tablet. Had I known it would have taken that long I would have just ordered through amazon. The device itself was as described and works well. Good products slow service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stephen",
          "Nb_Reviews": 4,
          "Date": "2018-07-03T19:45:23.000Z",
          "Titre": "Poor Customer Communication",
          "Contenu": "When I ordered my item I was not asked or advised that a signature would be required when delivered to my residence. I had to leave unexpectedly and noticed from the UPS tracking that it was not delivered due to no one to sign for the package,  I emailed A4C and asked to have it held until I returned but this was neither acknowledged nor relayed to UPS. I did return in time to go to the UPS station to pick up my item."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-04-05T19:06:18.000Z",
          "Titre": "-I recived the incorrect Apple watch…",
          "Contenu": "-I recived the incorrect Apple watch model-The model of the Apple  I purchased was not stated in the adverstiment.-There a no pictures of used products so the customer can adequately understand the condition of the product.-Customer service was slow to repond to my request to return the incorrect model watch I recived.-Once customer service did respond they were quick, curteous and accomadating."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-12-06T10:31:12.000Z",
          "Titre": "Got here quick enough but the exchange…",
          "Contenu": "Got here quick enough but the exchange and return was a bit different. I received the merchandise on November 15th and did not get a respond back for a return until December 5th after two emails and never reaching in my phone. this part of your service could improve a bit otherwise the merchandise was in good shape just was the wrong one for my phone"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DAVID SMITH",
          "Nb_Reviews": 2,
          "Date": "2018-07-01T19:35:16.000Z",
          "Titre": "I’ve been happy with A4C in the past",
          "Contenu": "I’ve been happy with A4C in the past. This time my experience was a little less than desirable. I ordered two FitBit watches about a week apart. The second one didn’t come with a wall charger the first one did. They explained to me in the description it said comes with watch and cable. Fine, but you can imagine my shock when I didn’t receive one as I did before. Why would I check the description a week later for the same item?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ayub",
          "Nb_Reviews": 1,
          "Date": "2018-08-12T21:07:53.000Z",
          "Titre": "My order was confirmed and then cancelled",
          "Contenu": "My order was confirmed and I got tracking number for shipment, but later after a week I got email that my order is canceled. That’s bad as I told my son he is getting headphones.If they cancelled before or not charged my credit and not gave tracking number I would have not told my son. The reason I gave three stars is they refunded amount without me calling."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Miguel",
          "Nb_Reviews": 1,
          "Date": "2018-07-03T16:07:53.000Z",
          "Titre": "Received unit with broken/tampered remote",
          "Contenu": "Received my soundbar on time as scheduled, but the included batteries were missing, and the bottom quarter of the remote was damaged and the remote itself does not work, as though it had been tampered with.I attempted to contact the manufacturer for a replacement to no avail. The remote itself also isn't available for purchase. Would like it replaced."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Salim",
          "Nb_Reviews": 2,
          "Date": "2017-10-08T22:51:28.000Z",
          "Titre": "Everything was great but I realized …",
          "Contenu": "Everything was great but I realized that the shipping address was incorrect and after reaching out to customer service, I was told there is no way for them to correct and I had to try to reroute it with DHL and USPS myself...but the method of shipping doesn’t allow for any changes and I’m still trying to get ahold of someone at the local post office to attempt to have it forwarded or returned to sender."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Evan",
          "Nb_Reviews": 1,
          "Date": "2019-05-26T16:12:59.000Z",
          "Titre": "Customer Service Lacking",
          "Contenu": "Ordered Apple Nike watch at great price for a gift. When it arrived, the watch in box was not color ordered or what was listed on label on box. Checked order history. Confirmed I did not make an error when I placed the order. Found that it was not my error. Discovered that watch I had wanted was now out of stock. Called immediately. They were closed for weekend. Left message indicating issue and requested call back to sort it out.  No one has returned my call. Very disappointing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "TJ Leser",
          "Nb_Reviews": 1,
          "Date": "2017-08-06T18:52:38.000Z",
          "Titre": "Wireless Charger and GearFit2 Smartwatch",
          "Contenu": "I purchased two items a refurb gearfit 2 watch and a samsung wireless fast charger. The charger works great and I got a good deal on it. However, the reason for the 3 stars is that the gearfit 2 arrived broken. The watch its self was in great condition but none of the apps would load, and after 4 hours of having the watch the screen stopped coming on. I ended up returning the watch the next day."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Walter",
          "Nb_Reviews": 1,
          "Date": "2017-09-22T16:51:27.000Z",
          "Titre": "LG Urbane wrong charging cradle",
          "Contenu": "I had purchased a LG Urbane W150 smart watch but the charging cradle provided was for the older model W110 and the w150 is slightly smaller than the W110. This made chaging the watch almost impossible to align the pins with the watch. So I found one on Amazon that said it was compatible with my watch and while it did work that was another $12 to the cost along with several hours of my time researching what was wrong."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James Murkison",
          "Nb_Reviews": 1,
          "Date": "2017-09-23T23:07:19.000Z",
          "Titre": "Disappointed",
          "Contenu": "I cannot rate the product because I have yet to receive it as of 9/23. Ordered on 9/13, was notified via email product “shipped” on 9/14. Was given a projected delivery date of 9/23, but product still has not arrived. I was looking for other options to buy gear from besides Amazon, but this experience has me reconsidering that. May not buy from here any longer. Disappointed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "align",
          "Nb_Reviews": 1,
          "Date": "2017-07-08T04:21:50.000Z",
          "Titre": "I expected better condition for a …",
          "Contenu": "I expected better condition for a refurbished device.  Scratches on the screen and typical wear at the bottom edges where the device would normally be propped up when using the kickstand. Some scratches on the back of the device. Does work well so far.  I wouldn't purchase a refurbished product again in my personal opinion from A4.  Same feeling as purchasing from a private seller on Craigslist."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chains",
          "Nb_Reviews": 1,
          "Date": "2018-07-12T20:27:17.000Z",
          "Titre": "S7 Edge Battery Charging Case and VR",
          "Contenu": "The battery charging case for the Samsung S7 Edge is in good physical shape, but since it was \"pre-owned\" and not refurbished or even tested it seems, I cannot get anywhere near a full charge or even half a charge of the phone with it.  Could still come in handy, but kind of disappointed.I have not had a chance to test the VR headset yet, but I don't see any reason why it wouldn't work since it appears to be in good physical shape.T"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "J. Deming",
          "Nb_Reviews": 1,
          "Date": "2017-06-15T21:02:54.000Z",
          "Titre": "Don't Spend the Extra $ on Shipping",
          "Contenu": "I ordered a product on Wednesday morning and requested two day shipping (at an additional expense). The product wasn't shipped until Friday (the day I expected the order to arrive). I received the product a week after I placed the initial order. I emailed customer service to complain. Customer service at A4C refunded me for the additional shipping expense and apologized for the delay."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Antonio",
          "Nb_Reviews": 1,
          "Date": "2017-03-12T21:23:32.000Z",
          "Titre": "Wrong color sent but product was great",
          "Contenu": "I ordered headphones and shipping speed take at least a week. After waiting a week I received wrong color. I was on a time constraint so I could not return. Headphones were in very good condition. Warranty policy in my opinion is a bit weird. A4C card states that you must keep barcode sticker on the product or it voids warranty. Its a bit weird to walk around with a sticker on your all black headphones."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sandy Lindsey",
          "Nb_Reviews": 2,
          "Date": "2017-03-15T09:45:35.000Z",
          "Titre": "Unprofessional customeer service",
          "Contenu": "I needed to return a defective item and the lady answering the phone had no idea how to help me. I was placed on hold for at least 10 minutes and then disconnected. I called again and got a better response but was told I could not get a replacement as they were no longer in stock and to callback in 2-3 weeks and maybe they would have them. I decided to ask for a refund and order from somewhere that knew how to handle my order."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ricardo Fagel",
          "Nb_Reviews": 1,
          "Date": "2016-10-09T04:46:40.000Z",
          "Titre": "Great communication",
          "Contenu": "Everything went smoothly and quickly.  Easy interface to work with.We were on vacation when we ordered and payed for expedited shipping.  We allowed a couple of extra days as a cushion.  The package never arrived.  We had to leave and have no idea what happened to the items we ordered. This may be no fault of the vendor, but the shippers, do not know where the ball got dropped."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Glenn",
          "Nb_Reviews": 2,
          "Date": "2016-12-08T05:17:06.000Z",
          "Titre": "Almost everything works",
          "Contenu": "I purchased 2 Samsung wireless fast chargers and a Samsung gear s2.  The fast chargers work fine and the watch works as well.  The wireless charger that came with the watch doesn't work.  I messaged the support on the website regarding this issue over 24 hours ago and have not received a response.  I was able to use the watch for one day before it died with no charger"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "align",
          "Nb_Reviews": 6,
          "Date": "2016-12-14T18:34:18.000Z",
          "Titre": "Nice product, lacking in customer service",
          "Contenu": "Great product, once it was received.  The system generated the product to be sent to the wrong home.  Customer service took their time about addressing the situation, while I was very concerned about where the $200 product might be located.  Would love to purchase again because once I received the product, it worked great, but based on the experience, I simply cannot."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jonathan Nave",
          "Nb_Reviews": 2,
          "Date": "2017-02-09T23:09:06.000Z",
          "Titre": "Wrong LTE tablet",
          "Contenu": "Usually everything goes great, but this time the tablet I ordered was supposed to have T-Mobile service but the one I got had Sprint service.  I did contact support but was told I could return it or keep it as they had no TMobile tablets left.  I kept it and it's in great condition, but would have liked to have the right cell service on it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-09-06T12:17:41.000Z",
          "Titre": "I sent multiple emails regarding…",
          "Contenu": "I sent multiple emails regarding shipping issues with no response from the company (yes I checked spam box).  Because I received no response I purchased a different product and requested the original item be cancelled. To my surprise the item ended up on my doorstep two days later so I then had to pay to return it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "iPad poweruser",
          "Nb_Reviews": 1,
          "Date": "2017-04-08T16:27:35.000Z",
          "Titre": "I ordered a refurbished iPad but when I …",
          "Contenu": "I ordered a refurbished iPad but when I received it I couldn't even charge it. I had to send it back in and wait for another one. When I called customer service they didn't even say sorry or apologize. All they asked was if I wanted a refund or another one. Doesn't help that had problems with USPS delivering it either. It was supposed to be for present which now I have to get something else. I guess we will see when the replacement gets here if it works."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-01-22T17:40:39.000Z",
          "Titre": "Wrong item",
          "Contenu": "I ordered a certain style of ear buds and I got a different style than the image I was shown and those weren't the ones I wanted if I wanted style(2) that I received I would have gotten it elsewhere but the original style I wanted(1) was hard to find at a cheap price which is why I ordered it originally"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Samuel Wolfe",
          "Nb_Reviews": 1,
          "Date": "2017-07-06T14:14:07.000Z",
          "Titre": "I recently puchased a galaxy gear s3 …",
          "Contenu": "I recently puchased a galaxy gear s3 though the site, but when i received it, it wouldnt turn on. The return process was simple but they where out of stock for a replacement so i had to go to another supplier. Everything was smooth for the return, I would have prefered a replacement , or the original to work preferably."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mason",
          "Nb_Reviews": 3,
          "Date": "2018-10-25T12:29:12.000Z",
          "Titre": "Bought what was advertised as a 64gb…",
          "Contenu": "Bought what was advertised as a 64gb iPad.  When it arrived, I was shocked to find out it was a 16gb model.  I called the company to complain and was offered the explanation that they \"must have been out of the 64gb model.\"  No apology whatsoever.When they couldn't locate the model I wanted, I returned it to them.  It took 2 phones calls and 2 trips to the post office since the rep failed to include the postage in the first email.I did get my money back, but I will NOT be shopping with them again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JJ",
          "Nb_Reviews": 1,
          "Date": "2018-09-01T23:05:07.000Z",
          "Titre": "Mixed Because Of What I Purchased But I Would Not Rule Them Out To Try Again.",
          "Contenu": "I gave 3 stars because there is no separation to rate vendor vs. item purchased. The A4C shopping and purchasing experiences were fine! Prices are good and shipping was timely. However, the \"Silicone Heat Resistant Gloves\" I purchased, for half the price amazon charges, are a different story. Can only hold a hot pan for a few seconds before your hand starts feeling the heat.For anyone reading this who is considering buying from this vendor, I would say give them a try. Just know what you are buying."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "raj",
          "Nb_Reviews": 2,
          "Date": "2017-03-18T20:15:29.000Z",
          "Titre": "Good watch with limited things",
          "Contenu": "Good things: Design and feel, waths faces, display, WiFi connection.Average: it's water resistant not water proof, no NFCLimitations: it's not capable of working off sync with phone for steps,and activity tracker. When synced with phone activity is overwritten with phone info.You could only place call on your phone, can't answer on your wrist.New tjing, I have seen heart rate even for computer table in this watch. Asked for replacement, hope I get product in which heart rate sensor works..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "align",
          "Nb_Reviews": 1,
          "Date": "2017-01-21T21:30:24.000Z",
          "Titre": "Lack of Timely Information",
          "Contenu": "Although my order appeared to ship almost immediately the updated information was lacking for almost a week.  Until I finally got through to a customer service agent who informed me to track through a fourth party rather than the third party provided.  Shipment took almost the full 7 business days to arrive."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Wayne Jockers",
          "Nb_Reviews": 3,
          "Date": "2016-11-01T21:37:53.000Z",
          "Titre": "Great deals....shipping not so great 😞",
          "Contenu": "There is no doubting your great deals I have ordered several items in the past year. However the shipping has a lot to be desired. Ordered on the 22nd didn't ship unit the 27th...no updates on USPS site until it arrived in my city and was delivered on the 1st.Great deals but don't be in a hurry!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "..",
          "Nb_Reviews": 1,
          "Date": "2016-10-07T21:47:22.000Z",
          "Titre": "....",
          "Contenu": "I purchased two refurbished smart watches, and upon receipt of them both, and upon initial set up, we discovered that they both needed access codes for them to work. After contacting the company, I was advised that they didn't have the access codes, so basically the watches were useless. They did offer a refund though. Giving them another shot,I purchased two refurbished tablets. We haven't tried setting them up yet, so I don't know if I'll still have the same issues as I did with the watches."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Jolee",
          "Nb_Reviews": 1,
          "Date": "2016-11-09T18:25:34.000Z",
          "Titre": "Minor scratches on the watch - updated",
          "Contenu": "Function wise 100% satisfied!Updated on November 9, 2016Resolution Centre approached me, and we exchanged emails back and forth for a couple of days. All went smoothly until the Refund - Customer Services dept screwed up. If they hadn't screwed up, I would have upgraded the ratings to 5/5 and left a shinning review for A4C.COM and their amazing customer service. I had to correct their mistake and it left a bit of bad taste in my mouth. Will still purchase products from A4C.COM but with extra caution."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "D. Beckett",
          "Nb_Reviews": 1,
          "Date": "2017-04-22T02:42:48.000Z",
          "Titre": "Your company is fine but I will be se 2 …",
          "Contenu": "Your company is fine but I will be se 2 tablets back. 1 the battery drains overnight when shut off.  The second one hangs so long then finally lets you use it till you login somewhere and the tablet freezes again. You are the seller and not the remanufacturer. I think the product is old and garbage."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 4,
          "Date": "2017-06-26T13:37:20.000Z",
          "Titre": "Have used twice",
          "Contenu": "Have used twice.  First item was as advertised, good value but painfully slow shipping on the \"flat rate\".  Second item hasn't arrived still.  It sits for days and days and days at one location with no apparent movement.  Be prepared for incredibly slow shipping if you use flat rate."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2017-03-06T18:38:30.000Z",
          "Titre": "Good communication, fast shipping, terrible quality.",
          "Contenu": "Received my 2-pack of headphones shortly after placing the order. Shipping was fast and free. Received only 1 working pair of headphones and  those were probably the worst headphones I've ever purchased. Not entirely the fault of the seller, but they shouldn't carry such garbage products."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ethan K",
          "Nb_Reviews": 1,
          "Date": "2016-12-09T19:26:58.000Z",
          "Titre": "Defective Product Received",
          "Contenu": "I received a defective product, but customer rep was willing to send me a replacement. I would have given 4 stars if i did not have to send in the replacement first. This delays the processing, as normally other vendors send me a replacement without having to receive the defective product first."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "B Kelly",
          "Nb_Reviews": 1,
          "Date": "2020-02-18T13:31:16.000Z",
          "Titre": "The product didn't work on my phone as…",
          "Contenu": "The product didn't work on my phone as stated in the description. Also had to pay to return the items.  Still waiting on my refund. The product was nice, but was not compatible.  Customer service replied quickly but not willing to cover the return shipping."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Wesley Ellis",
          "Nb_Reviews": 1,
          "Date": "2016-10-11T18:16:26.000Z",
          "Titre": "It took awhile, but great product and packaging!",
          "Contenu": "It's been more than 10 days since I got an email saying my order shipped. Five days after, the tracking showed it left it's point of origin, in New Jersey. I am in NE GA, that was 4 days ago, no updates since.Update! Package arrived,  fantastic packaging,  great product. Happy ending."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Art",
          "Nb_Reviews": 2,
          "Date": "2019-11-15T03:27:24.000Z",
          "Titre": "Close but no cigar",
          "Contenu": "Item ordered was close but not exactly what I needed or what was described. The Samsung Iconx tips I ordered were actually for the Galaxy Buds. There is a slight difference but enough that it's a difficult fit for the Iconx buds. The shipping was fast, though."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Luis",
          "Nb_Reviews": 1,
          "Date": "2020-09-04T05:21:33.000Z",
          "Titre": "fast shipping but faulty merchandise…",
          "Contenu": "fast shipping but faulty merchandise email them to try and ship it back and get a replacement because I was still going to order the same unit they said no that they are only currently doing refunds so I returned the merch now waiting on my refund"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "J. O.",
          "Nb_Reviews": 1,
          "Date": "2016-10-18T12:27:01.000Z",
          "Titre": "2 unsuccessful buys in a month",
          "Contenu": "I had shopped and bought 2 items with A4c in a month, 1st wrong item was sent and when I called them they said it was out of stock so they refunded.2nd the item was not working as it should, called them, and they said it was out of stock.There must be a problem with there internal communications and the items they post on their website regarding having it in stock or not.Anyways they are quick in sending a return slip and refund, i was thinking that they are used to returns thats why they're fast with returns and refunds which is good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul Gottesman",
          "Nb_Reviews": 1,
          "Date": "2016-09-23T00:33:21.000Z",
          "Titre": "Wery slow delivery.",
          "Contenu": "While I got a tracking number it took 4 days before seeing that the package was actually on its  way.  When finally the tracking number showed up in the report the package also arrived.  Since the delivery was by USPS maybe sending the item directly with USPS was faster than with DHL."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rev.",
          "Nb_Reviews": 1,
          "Date": "2017-11-17T22:55:35.000Z",
          "Titre": "customer service and delivery",
          "Contenu": "I'm happy with the product I just had a problem getting it on time and tracking it I paid extra for it to be delivered early but for some reason it was sent by regular mail and a week later, I called in and still could not get tracking information or location info I was going to cancel when I finally got it . when ordering make sure you stay on top of ur order n if u pay extra it's probably good u make sure it's been shipped out and don't just go off of the email that they send you because I got 1 but my order was never sent out until I called about it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ernest Chen",
          "Nb_Reviews": 1,
          "Date": "2017-01-14T05:38:30.000Z",
          "Titre": "Product Shipped Was Not as Described",
          "Contenu": "Product was described as Refurbished - In Immaculate, Like New Condition.  When I received the product, it had scratches on the front face and back clasp and had signs of fairly heavy use.  I was disappointed with the condition since it was not as described on the site and have asked for an RMA to return and get a refund.  They have sent a pre-paid label and assuming this process goes smoothly, I at least appreciate their willingness to take the product back at their cost.  If this process does not go smoothly, hopefully I have the chance to update this review."
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "Oystein M",
          "Nb_Reviews": 1,
          "Date": "2017-04-07T00:29:51.000Z",
          "Titre": "Customer service not a top priority",
          "Contenu": "I thought I had found my new go-to place for electronics online and ordered an item with limited description: \"Includes 6 different adapter rings to fit wide range of lens' models.\" As it turns out, it did not fit my lens. As the description was off, and not entirely customer error, I was hoping A4C would be willing to pay for return shipping or at least split the cost. I got impatient answers saying they simply would not provide a return label. Then I received an e-mail to rate my experience, which I am now doing. I am unlikely to give A4C another chance."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mike Kloc",
          "Nb_Reviews": 2,
          "Date": "2016-10-27T04:07:29.000Z",
          "Titre": "Good product but poor communication and defective email.",
          "Contenu": "I purchased some headphones and was sent an email with a tracking number which didn't work and the email content about my order was scrambled with all the characters along the right side in a vertical column.  I sent the company an email because I was unable to track the shipment.  The USPS number said it left their facility but 8 days later I still am waiting for it and the tracking number was never updated.  I sent an email to the company which was never answered.  On the next day the product arrived and I am happy with it.  Too bad there was other issues with this sale."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 4,
          "Date": "2017-07-10T21:32:32.000Z",
          "Titre": "Its supposed to be a fast charger for …",
          "Contenu": "Its supposed to be a fast charger for my S8. But it doesn't fast charge. Probably because the Sent a regular plug with it instead of a fast charger plug. I noticed this same setup brand new for $2 more. I'm kicking myself in the A$s for not buying new"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2019-06-12T17:58:57.000Z",
          "Titre": "Product was damaged when received.",
          "Contenu": "Received my product in a timely manner, however my headphones weren’t working! They could not even turn on or get charged. My first experience. The support team was able to reach back to me with a return label to ship it back for free thanks."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JAVIER",
          "Nb_Reviews": 1,
          "Date": "2017-05-22T20:43:43.000Z",
          "Titre": "I have made several purchases with …",
          "Contenu": "I have made several purchases with varying degrees of success. I will still consider them for refurbished equipment.  But last purchase was really badly packaged (no protection inside) and the good was roughed up.  Works Ok. But the looks are not great."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gregory Culpepper",
          "Nb_Reviews": 3,
          "Date": "2017-01-08T00:38:06.000Z",
          "Titre": "Confused",
          "Contenu": "I finally eeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeee"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "yo_8",
          "Nb_Reviews": 1,
          "Date": "2017-06-26T18:15:46.000Z",
          "Titre": "The first one that arrived was a …",
          "Contenu": "The first one that arrived was a defective product. But however, the customer service was great and they immediately sent a replacement and that seems to be good so far. But I am  still in the testing phase and will keep it if it works fine for a week."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "align",
          "Nb_Reviews": 1,
          "Date": "2017-08-29T15:19:11.000Z",
          "Titre": "Good product",
          "Contenu": "Good product, reasonable price, but item was not delivered and had to go through the inconvenience of picking it up from a drop off location. UPS did not make a second attempt for this seller, all other seller's items get up to 3 delivery attempt!"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "kt",
          "Nb_Reviews": 3,
          "Date": "2017-09-08T06:13:03.000Z",
          "Titre": "Moto360 watch",
          "Contenu": "Purchased the Moto360 watch. but it stopped working within a week pf purchase. had to goto buffalo to return to avoid paying duties. i did get a replacement watch but it looks used and is in a much worse aesthetic condition than the previous one."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 5,
          "Date": "2019-10-01T02:57:48.000Z",
          "Titre": "Made a purchase and found an alternate…",
          "Contenu": "Made a purchase and found an alternate product that interested me more. Contacted IMMEDIATELY before product shipped. Received NO reply from A4C. At all. Product arrived and is good condition. Customer Service needs improvement"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ada Jacque",
          "Nb_Reviews": 1,
          "Date": "2018-12-22T17:16:47.000Z",
          "Titre": "Your order website was a horror",
          "Contenu": "Your order website was a horror, the “verify you are not a robot” made me do it 50 x. Very frustrating and so much time wasted. The deal was good , the product is good, the delivery was good, the order process was insanity producing!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "rikk",
          "Nb_Reviews": 2,
          "Date": "2018-10-20T12:00:23.000Z",
          "Titre": "Great price but Verizon doesn't support…",
          "Contenu": "Great price but Verizon doesn't support the activation of the smartwatch anymore so this transaction was a waste of time. Great customer service though. Because of that reason I will consider to make future purchases from you all."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Philip",
          "Nb_Reviews": 2,
          "Date": "2016-10-12T12:03:51.000Z",
          "Titre": "Good Enough",
          "Contenu": "I found this company several months ago when I needed to replace a cell phone battery.  Had I known that I would need to replace the charger later on, I would have ordered both at the same time.  Nonetheless, I was glad to finally receive the subsequent order of the charger.  I will qualify that after a couple of failed attempts in ordering the new charger which was out of stock, I finally stumbled across the refurbished chargers that were in inventory that sold for a dollar less.  I  tagged to be notified when the new models are restored in inventory, but in the meantime this rebuilt charger works fine.  The cell phone is fully charged now."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael B",
          "Nb_Reviews": 1,
          "Date": "2017-08-07T23:34:38.000Z",
          "Titre": "Watch band not as displayed",
          "Contenu": "Watch was described as refurbished. While it arrived entirely functional and in good cosmetic shape, I was disappointed that the band was not from the manufacturer. The product photo showed an all black watch band.  Instead, a third party watchband was supplied with blue and pink dots. As a male, the pink and blue dots are not my preference. I purchased another watchband to wear instead of sending product back for refund. The description of the product had no description of the band provided other than \"medium\". Overall, functional and in good shape, but was surprised to not have the original band or at least original all-black band color."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Canadian customer",
          "Nb_Reviews": 1,
          "Date": "2017-06-27T19:58:07.000Z",
          "Titre": "Not great",
          "Contenu": "My wire cracked after a week of using the product. Also the battery pack over heats and after a while it overheats my cellphone. Honestly the only thing that is good is that you can recharge twice your phone in one battery pack."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2018-05-29T04:46:13.000Z",
          "Titre": "No response from A4C support.",
          "Contenu": "I bought a refurbished Otterbox Symmetry ipad 2 folio case from A4C.  No instructions were included and I couldn't find any on the web.  After inserting the iPad into the case, I noticed it wouldn't automatically turn on or off after opening/closing the case. Also the case closure flap wouldn't stay down.  I sent A4C support a request for a refund and received NO answer. However, I discovered yesterday that after rotating the iPad 180 degrees (the iPad can rotate in the case 360 degrees) the on/off feature and flap are working perfectly.  So the case magnets are happy now and I'm happy now, but I'm somewhat miffed at A4C's failure to respond."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chris K",
          "Nb_Reviews": 1,
          "Date": "2017-01-18T21:52:03.000Z",
          "Titre": "slow processing and shipping -",
          "Contenu": "Great Value for item purchased.. but I expect better communication and status updates..  tracking numbers only track with global DHL not DHL.. USPS does not track until local arrival..  order was in limbo for a number of days...."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "keny2",
          "Nb_Reviews": 1,
          "Date": "2018-12-19T03:14:26.000Z",
          "Titre": "This company could have gotten 5 stars",
          "Contenu": "This company would have gotten 5 stars; however, nowadays I don't want to go through pain in the neck circumstances – like mailing back any items – and I  certainly don't want to pay for postage if it is a companies mistake. The short story is that I used the search bar and got several items coming up. I utilized a very specific set of parameters for the product I wanted, Yet I got the wrong product sent to me. All the parameters I searched for came up, but one. To be honest, this has happened on Amazon.com as well – but they take responsibility for it in return product.This customer service representative did not take responsibility for the companies search bar issue."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer Fred Russell",
          "Nb_Reviews": 1,
          "Date": "2018-09-10T01:49:33.000Z",
          "Titre": "Loved watch bad charger",
          "Contenu": "Loved watch, but charger didn't work.They were sold out so I had to buy a 24.00 Samsung charge to charge it. I bought the S3 Classic refurbished. The watch works hreat,feel A4C should refund cost of Samsung charget."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eric M.",
          "Nb_Reviews": 1,
          "Date": "2016-12-05T00:11:36.000Z",
          "Titre": "Unfortunate Damage During Shipping",
          "Contenu": "Unfortunately, my first experience buying an iPad 2 from A4C was not the most satisfying.  I was excited by the Cyber deal of course, but the iPad, although possibly packaged sufficiently,  was damaged slightly during shipping.  The back has a ding in it and the screen was scuffed up.  I was very shocked when I removed it from the box.  I know stuff happens, but I am disappointed, especially since it took a week to get to me in Charlotte, NC from Brooklyn, NY.  I did reach out to their warranty team, but I am still waiting for them to supply me return and exchange information so I can get an undamaged iPad as quickly as possible since I use an iPad for my music charts."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pamela",
          "Nb_Reviews": 1,
          "Date": "2021-01-03T19:23:42.000Z",
          "Titre": "Screen Protector Freezes Phone Screen",
          "Contenu": "You are not able to use the touch screen when the screen protector is on.  The screen freezes up  and you aren’t able to do anything.  It is also hard to hear the other person on the phone line:"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "GEM",
          "Nb_Reviews": 2,
          "Date": "2017-09-04T20:34:23.000Z",
          "Titre": "Shipping was not as quick as initially …disappointed....",
          "Contenu": "Shipping was not as quick as initially stated....packaging could have been better,  tracking via USPS not good at all , nothing concrete until very last minute......Again so much for ...in rain n shine et etc....."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kenny D",
          "Nb_Reviews": 1,
          "Date": "2019-01-30T18:05:33.000Z",
          "Titre": "Delivery was a bit slow. Merch exactly as advertised.",
          "Contenu": "Delivery was a bit slow. Ordered on the 9th, received on the 23rd. I had to email to get it rolling. Might have been DHL's glitch though.The Item received in perfect condition, and exactly as advertised."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "J Douglaz",
          "Nb_Reviews": 1,
          "Date": "2017-01-09T01:21:48.000Z",
          "Titre": "So far not so good.",
          "Contenu": "So far not so good. I haven't received my package yet. I would rather pay for shipping and receive it..thanks not pay and have it delayed. Not able to reach customer service so I'm just sitting and waiting."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-03-04T04:35:35.000Z",
          "Titre": "Difficult purchase process",
          "Contenu": "Product was what I wanted but trying to purchase it was frustrating.  I didn't want to set up an account but finally had to.  It would have been nice to have that information when I started the purchase."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mitch",
          "Nb_Reviews": 1,
          "Date": "2017-01-06T03:35:07.000Z",
          "Titre": "Great price, very slow delivery",
          "Contenu": "The product I ordered was significantly less expensive here, but shipping from NY to NJ (30 miles) was very slow. I called to ask about the status of my delivery and the customer service rep was not helpful."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nycke",
          "Nb_Reviews": 3,
          "Date": "2017-03-22T18:10:43.000Z",
          "Titre": "Ok but not",
          "Contenu": "If i could change my mind i would. The tablets came fast but one loses charge too fast and loads even slower. I wouldn't recommend at all and frankly I'd like to send it back and get my money back."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "dealHunter",
          "Nb_Reviews": 1,
          "Date": "2016-12-11T05:43:43.000Z",
          "Titre": "Broken charger",
          "Contenu": "I've ordered from A4C before and had no issues. But my last purchase was disappointing because the refurbished item I bought did not work. I'm currently in the process of returning it for a refund."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Vegawu",
          "Nb_Reviews": 1,
          "Date": "2017-02-21T20:00:53.000Z",
          "Titre": "Item is good but no original packing and manual for Refurbished?",
          "Contenu": "Bought the Ipad as Refurbished but received only the device and charge cable. Though item looks new but with some tiny scraps and marks on edge and back. Doubt it's used. Guess won't buy from A4C"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JD",
          "Nb_Reviews": 1,
          "Date": "2017-03-24T22:35:19.000Z",
          "Titre": "Refurbished iPad mini",
          "Contenu": "The item was received in a timely matter. However, the screen, which was replaced, does not even come close to sitting flush with the case and the home button gets stuck when not pushed straight down."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ron Niehus",
          "Nb_Reviews": 1,
          "Date": "2017-01-11T18:52:10.000Z",
          "Titre": "Good and bad",
          "Contenu": "The good: I ordered online 2 refurbished ipad for Christmas and they were delivered promptly. One was not working well and once I called, a return label was sent promptly.  I was refunded my money within a week or two.The bad: The same ipad was out of stock, so I checked the \"notify me when back in stock\" box. I never got that that notification, but I watched each day and it came back into stock. I ordered online, paid for it and got a confirmation number and UPS tracking #. My money was taken within a day. When I noticed that wasn't being shipped, I called & was told it was really out of stock. It took another week or more to get my money back. I will not reorder again online, but only via phone with a real person."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "atadpole",
          "Nb_Reviews": 1,
          "Date": "2016-10-31T00:16:52.000Z",
          "Titre": "The sync dock arrived broken",
          "Contenu": "The sync dock arrived broken.  It's likely because it comes in a zip-lock bag without a box, and it's shipped in a weakly protected paper envelop.  Even though it was a bargain, I can't believe brand name product (kensington) would be shipped in zip-lock bag.  This is one of my most disappointing online shopping experiences.update 10/30/2016:  I was contacted by customer service and they offered a free replacement.  The dock still arrived in zip-lock bag, in the same kind of bubble envelop.  Fortunately, it is not broken this time.  Revising the rating for very good customer service, but takes 1 star off for the initial frustration, and another star off for how they ship product with inadequate protection in packaging."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "alignmike",
          "Nb_Reviews": 1,
          "Date": "2016-10-16T11:12:02.000Z",
          "Titre": "Car charger",
          "Contenu": "I received original unit and was not working left vm no one got back to me until I called a 2nd time and spoke to someoneIt should have been sent overnite to me in NJ from Brooklyn but wasn't"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 5,
          "Date": "2019-03-13T19:26:51.000Z",
          "Titre": "The daily email  I got with a specific…",
          "Contenu": "The daily email  I got with a specific item was hard to find on your website at the \"same price\" advertised. I wound up buying same item at higher price. A little bait and switch"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "M. Hogston",
          "Nb_Reviews": 1,
          "Date": "2019-02-09T00:21:42.000Z",
          "Titre": "Customer service is almost nonexistent",
          "Contenu": "Customer service is almost nonexistent. No reply to my emails or calls to customer service where I kept getting a recording during business hours. I left messages twice... no response."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ranger78",
          "Nb_Reviews": 1,
          "Date": "2016-09-30T18:06:40.000Z",
          "Titre": "Good Customer Service",
          "Contenu": "Package did not arrive for several weeks, so I contacted Customer Service. They determined the shipment was lost and are now sending me a replacement. Raised my rating from 1-3 as a result."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sam",
          "Nb_Reviews": 1,
          "Date": "2018-11-03T20:44:28.000Z",
          "Titre": "I don't recommend",
          "Contenu": "I had a hard time giving 3 stars.  I wanted to give 2 but I am trying cut A4C a break.  I recall seeing other reviews suggesting that it is not a reliable place from which to get refurbs due to poor quality control.  I recently got a couple of refurbished Alexa dots.  The packaging was OK but in retrospect I should have gotten them from Amazon for $5 more.  I did get one that way and the extra money was worth piece of mind.  You see, I ordered an Asus tablet refurb from A4C in the past that didn't even work out of the box.   I swore to not use them again.  I always stick to my word on such matters.  I ordered the dots on accident, having forgotten the original source of the Asus tablet.  In short, I don't recommend A4C.  They have a 1.5 rating on reseller ratings.  Check it out."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Samuel Hall",
          "Nb_Reviews": 1,
          "Date": "2017-06-30T11:25:35.000Z",
          "Titre": "The Samsung Gear 2 watch I ordered …",
          "Contenu": "The Samsung Gear 2 watch I ordered seems to have a faulty battery because it will not maintain a charge longer than 5 hours. I have to constantly put it on the charger throughout the day."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2017-11-08T18:40:19.000Z",
          "Titre": "The shipping was slower than most …",
          "Contenu": "The shipping was slower than most sellers I deal with.  The product broke after less than 2 months of minimal use.  The price was cheap so I guess that's what you get for a bargain."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "bozeman",
          "Nb_Reviews": 3,
          "Date": "2017-01-16T23:59:25.000Z",
          "Titre": "Battery doesn't hold charge.",
          "Contenu": "I did everything the instructions said to do in order for the battery to keep a charge.  It will not hold  a charge any better than my old one. Wouldn't recommend this purchase."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer  Kenneth Johnson",
          "Nb_Reviews": 2,
          "Date": "2018-10-20T12:32:14.000Z",
          "Titre": "Their was no paperwork or any kind of…",
          "Contenu": "Their was no paperwork or any kind of instructions on how to operate our fitbit.  We are 80 years old and expected at least some paperwork on how to operate or use this fitbit."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jen",
          "Nb_Reviews": 1,
          "Date": "2017-06-05T22:42:00.000Z",
          "Titre": "It's okay",
          "Contenu": "It's okay.  The design isn't the greatest as the back wheels keep hitting the toddlers heels. The seat also sits low so it doesn't provide enough height to kick off with feet.  This would be great for very very young toddler if their motor skills are developed and coordinated enough due to the size of the product. My toddler is on the small size and this is a bit small for his use due to reasons above.  Also the back wheels looks like it can be folded like the front for easy low profile storing but if it can, then I haven't been able to figure it out how.  For the front wheels there's a clearly marked push slide button.The only great thing is, this is a refurb but it looks completely new.  Maybe I can pass it on to my nephew so he can start using it at a much younger age."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Douglas Dolezel",
          "Nb_Reviews": 1,
          "Date": "2017-05-16T12:33:06.000Z",
          "Titre": "Great past purchases…",
          "Contenu": "All my prior experience with A4C has been very positive. The last purchase  has some issues. The tablet has an Android OS that severely limits various functions. i expected more."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gino M",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T02:22:58.000Z",
          "Titre": "Satisfied",
          "Contenu": "The company promptly shipped what I ordered and the transaction was easy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris Stone",
          "Nb_Reviews": 2,
          "Date": "2023-08-04T06:09:38.000Z",
          "Titre": "I bought a refurbished charger",
          "Contenu": "I bought a refurbished charger. Came in looking new, but presented poor performance and upon closer inspection the ports were corroded and wasn’t acceptable. A4C responded quickly and issued a return form (prepaid) and gave a full refund. Very good customer service. I will definitely use them in the future."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mathew Beredo",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T15:50:57.000Z",
          "Titre": "Shipped very quickly",
          "Contenu": "Shipped very quickly. Website very easy to navigate. Broad range of options."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "C. Lee",
          "Nb_Reviews": 2,
          "Date": "2023-08-13T01:43:33.000Z",
          "Titre": "Good deal, but missing mounting screws?",
          "Contenu": "I bought a Ring Gen. 2 motion sensor.  It was on sale and shipped quickly.  It connected to the Ring hub with no problem, but there were not mounting hardware (screws and wall anchors).  In the past, I have always received mounting screws and anchors.  Maybe, Ring is no longer supplying them?  It wasn't a deal breaker for me as I have them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paula Giambrone-Kerr",
          "Nb_Reviews": 4,
          "Date": "2023-05-03T16:19:10.000Z",
          "Titre": "I purchased the speaker for my…grandson",
          "Contenu": "I purchased the speaker for my grandson's 12th birthday.  I was very anxious regarding the quality because I read so many negative comments.  I worried he would need help setting it up.  Well ... 12-y/o's are much smarter than this gram.  Less than 5 minutes he had it working.  The sound is terrific.  I'm thinking of getting one for myself!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Darryl",
          "Nb_Reviews": 5,
          "Date": "2023-08-03T12:54:59.000Z",
          "Titre": "On time at a good price",
          "Contenu": "On time, we’ll worth coming back. Items arrived in a plain secure envelope and was carefully sealed and separated."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "A J",
          "Nb_Reviews": 2,
          "Date": "2022-09-30T00:46:57.000Z",
          "Titre": "Generally good service with minor hiccups",
          "Contenu": "I continue to use a4c after many years for buying Apple Watches and other genuine accessories. This time, I was sent a defective Apple AirPods Pro unit. However, I saw the defect as covered under Apple's own quality program and was able to get the unit exchanged. However, it is a negative that a4c sent out the defective unit in the first place (i.e. it easily passed their quality \"checks\"). Plus the hassle of having to do this in the first place. In any case, the products are genuine and a very good discount. Generally pleased with the purchase."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wm",
          "Nb_Reviews": 2,
          "Date": "2022-03-08T23:58:00.000Z",
          "Titre": "Fine by me",
          "Contenu": "Had no issue with my order.  Shipping time was a little longer than I was used to, but it wasn’t a big issue.  Item seems as described.  Based on this experience I would buy at A4C again, although I do think it’s a weird name."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tristan",
          "Nb_Reviews": 3,
          "Date": "2022-03-08T00:09:27.000Z",
          "Titre": "Item came as described, but shipping could be better",
          "Contenu": "Item came as described, but later than expected. If they had a better shipping estimate, I would have given another star"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Kennedy",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T20:14:36.000Z",
          "Titre": "Good price",
          "Contenu": "Good price, great product.  Shipping not as fast as the bigger players but fast enough for this purpose."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eugene Thornton",
          "Nb_Reviews": 7,
          "Date": "2022-08-24T22:36:28.000Z",
          "Titre": "I was impressed with the prompt…",
          "Contenu": "I was impressed with the prompt response, and the friendly customer service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe Trimble",
          "Nb_Reviews": 6,
          "Date": "2023-08-18T23:17:36.000Z",
          "Titre": "Free shipping"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Benjamin Arthur Shepherd III",
          "Nb_Reviews": 1,
          "Date": "2022-09-30T18:49:56.000Z",
          "Titre": "Good experience",
          "Contenu": "Good product, easy delivery and timely."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James A. Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2021-09-02T19:40:43.000Z",
          "Titre": "Gets quite hot while charging",
          "Contenu": "Gets quite hot while charging, but does what is meant too."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "clynnholmes",
          "Nb_Reviews": 1,
          "Date": "2020-12-29T03:11:08.000Z",
          "Titre": "4.5 stars",
          "Contenu": "4.5 stars. Products shipped quickly and items as described. Only complaint is that I bought my first Lifeproof case, which came with some sort of key to open it but there were no instructions on how to use it properly. Thankfully, we figured it out without damaging the case. Aside from that minor detail, very satisfied with purchase and will definitely purchase from again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "gSolber",
          "Nb_Reviews": 6,
          "Date": "2020-06-26T08:58:43.000Z",
          "Titre": "Cant expect much from a4c poor but passing",
          "Contenu": "Bluetooth device I bought was a return or used unit but seems ok for under $20. Some dirty some scuffs but guess i expected  it.  Do get some static when volume exceeds 45% but was under $20 so il deal with it. Shipping took a long time and it was packed poorly. In fact was rolling around in package  like it was just tossed in package and shipping label attached. I purchased a battery charger before from them it broke 3 weeks into use so I dont expect much from this company."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Black",
          "Nb_Reviews": 7,
          "Date": "2019-10-06T18:49:05.000Z",
          "Titre": "Product was exactly as advertised",
          "Contenu": "Product was exactly as advertised.  I really like having a large flat charging surface for charging my phone.  My old little round charging pad was difficult to find the sweet spot to start charging.  The Lyft pad seems to work if I simply get close to one of the two charging centers. Shipping on the other hand took longer than I typically have happen (..but it was free shipping!)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-05-10T17:35:53.000Z",
          "Titre": "I purchased a Smart watch twice from…",
          "Contenu": "I purchased a Smart watch twice from A4C and both turned out to be defective in exactly the same way. They would not sync to the computer. A4C was very gracious and did issue a return goods authorization plus the appropriate credit. My only issue was that it required several attempts to get the second RMA.  I do plan to use this site again since they do have good prices on a wide range of items."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Midnitestich",
          "Nb_Reviews": 1,
          "Date": "2018-12-20T16:23:02.000Z",
          "Titre": "Great price",
          "Contenu": "Great price. Item did arrive damaged and unuseable. Contacted them through email and they responded the next day. Gave me the option for a replacement or refund. Requested a replacement so they sent an email with a prepaid mailing label. I did have the  hassle of going to USPS for return. I did get my replacement and it works great. Should have better quality control in shipping dept hence only 4 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carla",
          "Nb_Reviews": 1,
          "Date": "2019-08-26T16:28:07.000Z",
          "Titre": "Price and products are great, shipping through USPS is terrible!",
          "Contenu": "I think the product and cost are exceptionally good so that is a 5 star rating.  However, the shipping through USPS is letting down the service because they lost the package, then found it, then delivered it to the wrong address, then recovered it, then delivered it to me, then had no record of delivering it to me.  It was a shambles and caused too much headache.  Just because of that, I would order from Amazon, as they rarely use USPS and the tracking is excellent."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "D Way",
          "Nb_Reviews": 1,
          "Date": "2018-12-15T21:46:31.000Z",
          "Titre": "Thank you for making this purchase possible",
          "Contenu": "The LG Gpad is awesome and I'm very grateful to have it. The ONLY reason I couldn't give 5 stars was because of the charger cord that accompanied it. Within two days the charger cord wouldn't work and I had to get a different one on my own. Now that I have gotten the new cord everything is wonderful. I will buy from you again and I have shared my experience with my friends so that they can peruse your site also. Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Orlando Area Customer",
          "Nb_Reviews": 1,
          "Date": "2018-07-03T16:21:27.000Z",
          "Titre": "Happy customer, but request that A4C review its online ordering software",
          "Contenu": "Product value was outstanding.  Product quality, packaging, delivery speed were outstanding.  Overall, a great transaction.I'd only suggest that the A4C folks do some test orders on their own site.  I had to log in several times to get the order to process.  This added frustration to the process, and I was concerned about how many items I had ordered as a result of the interface challenges.  Other than that one issue, though, the experience was outstanding."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customerStephen Starr",
          "Nb_Reviews": 2,
          "Date": "2018-06-14T00:12:25.000Z",
          "Titre": "Package took over a week to arrive",
          "Contenu": "Package took over a week to arrive, but arrived in great shape. The reason for the rating of 3 stars and not higher is it came without any instructions! I had to go to YouTube just to figure out what the parts were and how to pair the Bluetooth.Even though refurbished, it sounds great, but there still should have been at least rudimentary instructions in with Tap. I've gone to Amazon's website and there are no free downloads of instructions are available."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JOHN DELUCCA",
          "Nb_Reviews": 9,
          "Date": "2019-07-29T20:32:55.000Z",
          "Titre": "A4C would have rated a 5 star rating if…",
          "Contenu": "A4C would have rated a 5 star rating if they would have been able to fulfill my order.  I ordered and paid for an item, only to find out later that it was \"out of stock.\"  A4C did immediately issue a refund to my credit card, but I question the ability to place an order if the item is not available."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "chuck",
          "Nb_Reviews": 1,
          "Date": "2018-04-30T15:36:08.000Z",
          "Titre": "good product/limited battery time",
          "Contenu": "The buying experience was flawless.  I was a little disappointed in the product itself.  The sound quality and comfort of use was fantastic but the battery life is really, really low.  My fault there though, I didn't research to product due to being overwhelmed by the awesome price!  The literature in the product box was spot on as to what the battery life would be.  No deception or anything like that, I just hoped for more than 2 1/2 hours of use between charging."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stacey A.",
          "Nb_Reviews": 3,
          "Date": "2018-05-25T23:28:07.000Z",
          "Titre": "Product Rliability is Good!",
          "Contenu": "I have purchased from A4C over the years and have found this site to offer reliable products. My reason for not giving a 5 rating is because of \"price creep\".  I have purchased the same/similar items and have seen the prices rise a lot (even for refurbished). However, whenever I buy - the product has been very reliable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brandan",
          "Nb_Reviews": 2,
          "Date": "2018-07-03T17:26:52.000Z",
          "Titre": "Good sound. Less than perfect packaging.",
          "Contenu": "Item (BÖHM B3 Soundbase) was received in a timely fashion. The packaging was minimal (only primary box that had no protection for the center of the box) and arrived a little “crushed”.  However the speaker was undamaged. Good sound. A nice improvement over built in speakers. Perfect for our small bedroom TV."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donna Zenz",
          "Nb_Reviews": 1,
          "Date": "2018-10-20T18:13:23.000Z",
          "Titre": "I love my new headphones",
          "Contenu": "I love my new headphones. They are beautiful and they really do silence background noise. My only little complaint is that I can’t turn the volume down enough. Even with the sound turned all the way down on my phone and the headphones, I still find myself trying to decrease the sound. I’ll adjust. They’re great!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 2,
          "Date": "2019-08-27T19:04:06.000Z",
          "Titre": "Like the product",
          "Contenu": "Like the product.  Shipped fast as promised.  Fair price.Not sure yet if product will live up to my expectations of charging my phone useing wireless feature more than once before recharging charger.  Initial test charged once, then charger had to be recharged.  Will give it more tries..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alacrity",
          "Nb_Reviews": 3,
          "Date": "2019-09-30T21:04:04.000Z",
          "Titre": "Decent pricing and wide variety make…",
          "Contenu": "Decent pricing and wide variety make A4C a great resource. Weak spots in shipping times and tracking info are the only negatives I can come up with (4 day shipping delay, sub-contractor shipper and lack of tracking info until handed off to USPS).All in all, not an unpleasant experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-06-12T20:00:24.000Z",
          "Titre": "Great sale price",
          "Contenu": "Great sale price. Quick shipping. Nice packaging. It showed small band but once I opened the box included the large band. Only reason for the 4 star not 5 is because no instructions at all. Having never owned a fitbit product that was a learning curve. But I got it. Seems to work as it is expected."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Victoria",
          "Nb_Reviews": 1,
          "Date": "2018-04-23T09:47:04.000Z",
          "Titre": "Happy purchaser",
          "Contenu": "I purchased for my daughter and husband a birthday gift and an anniversary gift. I purchased with just over a week before the date I needed. There was a hiccup with this shipping BUT customer service was awesome. I spoke with two different people on two different occasions and both times I got a human, whom spoke the same language as myself, was polite and extremely helpful. When I did receive products both were in great condition! I would definitely recommend them and they definitely have a future customer in myself."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bob    customer",
          "Nb_Reviews": 1,
          "Date": "2018-05-23T01:36:58.000Z",
          "Titre": "Bohm speaker through A4C",
          "Contenu": "A4C processed and shipped the order quickly and efficiently. The product itself (Bohm speaker) really left a lot to be desired. Great write up but second rate sound (it sounded a bit \"Tinny\"). Can't compare to the Bose portable speaker. On the other hand, for $29 what can you expect?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mwis",
          "Nb_Reviews": 1,
          "Date": "2020-08-21T11:16:55.000Z",
          "Titre": "good product, terrible shipping",
          "Contenu": "The product I purchased was high quality, and the price was excellent.  The only problem I had was the shipping, it took over a week to receive my order.  Very slow response, it went through DHL and then to the USPS.  Slow to be processed and delivered."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2018-06-04T12:59:46.000Z",
          "Titre": "Tracking was very strange on this one",
          "Contenu": "Tracking was very strange on this one. Showed label printed, but not at Post office till the day it was delivered. They must be using a very old copy of Windows 10. Took almost a full day to update before I could use it. Now that it’s up and running, I am very happy with it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-08-02T21:15:01.000Z",
          "Titre": "A4C offers quality products at very…",
          "Contenu": "A4C offers quality products at very good prices.  The only negative I had was that my package Sat for 4 days at a depot less than 3 hours from my house with no explanation. While this is not directly under A4C's control, they chose the shipping carrier used."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer from Suffern",
          "Nb_Reviews": 1,
          "Date": "2018-09-06T20:43:28.000Z",
          "Titre": "Website was easy to negotiate through",
          "Contenu": "Website was easy to negotiate through, product description was true and accurate and ordering process was easy.  Reason for four star rating; I did not receive a confirmation of purchase notification or a confirmation when the item with tracking number was shipped."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "kelli reiter",
          "Nb_Reviews": 1,
          "Date": "2020-12-19T07:52:01.000Z",
          "Titre": "So this speaker looks amazing for a Christmas gift",
          "Contenu": "So this speaker looks amazing , and the specs are amazing , I really hope it is , I purchased this for my son as he is a ups driver and wanted a Bluetooth speaker for his truck , so I got this ,,, I hope he loves it on Christmas,,,,"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dav id",
          "Nb_Reviews": 1,
          "Date": "2019-02-14T13:45:46.000Z",
          "Titre": "Just as described",
          "Contenu": "The product was delivered as promised. Product was exactly as described. I've purchased several items from them and have not been disappointed yet. Four stars because customer service is slow taking several days to respond. I would buy from them again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "eileen",
          "Nb_Reviews": 3,
          "Date": "2019-03-09T20:13:08.000Z",
          "Titre": "The only reason why I didn't give 5…",
          "Contenu": "The only reason why I didn't give 5 stars is because the package came OPENED with a rubber band around it.  A bluetooth speaker in a plain   envelope, that wasn't even padded!  It's an electronic. How do you thoughtlessly send it this way?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Consumer",
          "Nb_Reviews": 1,
          "Date": "2020-01-09T14:17:55.000Z",
          "Titre": "Great Customer Satisfaction!",
          "Contenu": "I bought an Echo show (gen 1) that was advertised on sale in mid-November as a Christmas gift to get a jump on my Black Friday shopping. It turned out that the recipient of my gift received the newest generation 8 as well, and wanted to return my gift. I followed the appropriate channels and requested an RMA on 12/26. It was rejected due to being past the 30 day return policy.  However, Lacy reached out and was able to make an exception and authorize an RMA. I'm greatful that she took the time to go above and beyond to reconcile with an individual customer.  I commend their customer service for their resolution and thank you Lacy!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Iain Mackinlay",
          "Nb_Reviews": 1,
          "Date": "2018-07-04T14:09:58.000Z",
          "Titre": "Love the sound bar but it arrived with…",
          "Contenu": "Love the sound bar but it arrived with big dent on the faceplate......could have been UPS because the packaging was damaged in the same place!....doesn’t seem to affect the performance so not worth the hassle to exchange!Thanks.       Iainmackinlay"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "bMin",
          "Nb_Reviews": 4,
          "Date": "2018-06-05T00:40:51.000Z",
          "Titre": "a few SuperBuys..if you watch",
          "Contenu": "An occasional item \"far-Below-everywhere-else\" sale price..like BstBuys 2017 copy of the MicroSoft \"Surface 3\" Win10 2-in-1 with pop-off magnetic keyboard, marked down at A4C to \"Three for the price of 1\"... I love it!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Phil S",
          "Nb_Reviews": 1,
          "Date": "2019-05-17T15:18:31.000Z",
          "Titre": "I remain a loyal customer",
          "Contenu": "I've used A4C a number of times,es and been very happy.  This time was disappointing as the item really didn't perform at all. I was delighted in the \"no hassle\" phone call to return the item. I remain a loyal customer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JeffG",
          "Nb_Reviews": 2,
          "Date": "2019-01-20T18:16:50.000Z",
          "Titre": "A4C was good for the purchase process",
          "Contenu": "A4C was good for the purchase of the product process including the quick shipping but the product itself was terrible, it didn't work. It was the RCA Amplified HD Digital Indoor Antenna. I didn't get one channel over the air! This is my third purchase of an HD digital indoor antenna from different retailers and they ALL didn't work! And they claimed to have ranges from 80 to 100 miles. It is NOT worth the hassle to return a $10 item, learned from my experience, the HD indoor digital antenna's just don't work, the technology is just not there yet, don't waste your money if you live in the suburbs or an urban area."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Linda Dryden",
          "Nb_Reviews": 1,
          "Date": "2020-12-04T04:28:26.000Z",
          "Titre": "Received my order less than a week…",
          "Contenu": "Received my order less than a week after I placed the order. Christmas gifts for my grandchildren so I cannot attest to the quality of the product. However, I feel the reputation of otter box speaks for itself."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Riverat49",
          "Nb_Reviews": 1,
          "Date": "2018-09-13T17:34:51.000Z",
          "Titre": "Return soundbox to get one that works",
          "Contenu": "I bought a soundbox for my TV, which did not work.  Called A4C and they did not have a tech support person that could help me troubleshoot it, so they are sending me another one to try.  Hope this one works.  They were nice about it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Chan",
          "Nb_Reviews": 1,
          "Date": "2022-12-11T18:19:30.000Z",
          "Titre": "Fast shipping"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-05-23T16:04:57.000Z",
          "Titre": "This company is great with processing…",
          "Contenu": "This company is great with processing the request for a return in a very cordial and professional way.  The ear phones did not have as large a surface area covering the ears as I needed; therefore, the headpiece was tight."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sadruddin Shahbuddin",
          "Nb_Reviews": 3,
          "Date": "2022-03-15T16:59:15.000Z",
          "Titre": "Good quality and good customer service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jessica Gonzalez",
          "Nb_Reviews": 2,
          "Date": "2020-06-26T16:52:08.000Z",
          "Titre": "We like it!",
          "Contenu": "I like the size of this particular speaker, it’s just right! The carabiner style hook, is very practical. The battery charge doesn’t last as long. It’s waterproof, rugged and the sound is not too bad."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-07-26T18:41:56.000Z",
          "Titre": "Ordered 2 phone chargers",
          "Contenu": "Ordered 2 phone chargers. 1 worked and 1 did not work. I contacted a4c asking for a 2nd working phone charger instead of a refund. A4C did not send a 2nd working charger, but they refunded the non-functioning charger."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Thompson",
          "Nb_Reviews": 1,
          "Date": "2020-09-30T19:21:59.000Z",
          "Titre": "Would have been 5 stars but....",
          "Contenu": "Great company to work with only negatives are time for deliveries, usually 10-14 days and if you qualify for a refund, nonworking item, you only get 90% of the price credited to your credit card."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Siuleafar",
          "Nb_Reviews": 3,
          "Date": "2019-05-09T20:53:54.000Z",
          "Titre": "Great value, tracking package challenging.",
          "Contenu": "Item received as described and works perfectly. Great pricing. Delivery took a bit long and the package tracking process requires a few steps, as tracking info isn't easily displayed on the account page."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Judi",
          "Nb_Reviews": 8,
          "Date": "2019-05-09T16:53:52.000Z",
          "Titre": "it was delivered within a reasonable…",
          "Contenu": "it was delivered within a reasonable time and in good condition.  the only thing is I couldn't  find an estimated delivery date.    I like to have an estimated date in case I am gone for a few days."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JOSEPH ROGUSO",
          "Nb_Reviews": 6,
          "Date": "2018-09-05T17:59:01.000Z",
          "Titre": "I like it",
          "Contenu": "I like it , it’s also a little slow because it’s a older iPad and some of the new game apps don’t work . But all in all it’s looks like new , and checking my email and looking at new online its works well"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alyssa",
          "Nb_Reviews": 4,
          "Date": "2018-09-04T18:17:35.000Z",
          "Titre": "Great price, quick shipping; was the box opened?",
          "Contenu": "Received the item in reasonable time. Looked like the box had been opened. I have not used the item yet, as it will be an Xmas gift. No indication that there will be any problem.  The price was great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "KC",
          "Nb_Reviews": 1,
          "Date": "2018-09-23T16:00:15.000Z",
          "Titre": "Pro and Con.",
          "Contenu": "Pro:The product was shipped fast.Good product.Good quality.Hold charge as said.Recommended.Con:No package just in plastic bag and was not informed in advertisement.Heavy for only 3000"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daren H.",
          "Nb_Reviews": 1,
          "Date": "2018-10-02T17:22:10.000Z",
          "Titre": "This is my second purchase from A4C and…",
          "Contenu": "This is my second purchase from A4C and I am happy overall with all the products I received. They arrived quicker than expected and were packaged well. My first purchase of an ipad4 was perfect. I purchased a second ipad4 and an ipad air on my second visit. The only complaint I have is that the ipad air shows definite signs of wear and there were dents on the back that are a little worrisome. The force that it took to create the dents can't be good for the internal hardware. The wear on the edges could have been caused by a case and doesn't affect the ipad's performance. Only time will tell if the dents will have an impact on the life of the device. I am very pleased with my purchases especially when you factor in the savings over a brand new decice."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sharon C.",
          "Nb_Reviews": 3,
          "Date": "2018-05-25T04:18:39.000Z",
          "Titre": "I have not used the grow lights I…",
          "Contenu": "I have not used the grow lights I received, as I am waiting to move this year.  However, I was very impressed with the packaging.  I had no problem placing my order, either.  Quick and easy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Art Vandelay",
          "Nb_Reviews": 1,
          "Date": "2021-06-03T03:36:21.000Z",
          "Titre": "Met expectations",
          "Contenu": "Received my Google Home Max as described and met my expectations as stated when I ordered. I would have given a 5th star if it would have exceeded my expectations."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wayne",
          "Nb_Reviews": 3,
          "Date": "2020-06-24T20:53:32.000Z",
          "Titre": "The Lifeproof Bluetooth speaker",
          "Contenu": "The Lifeproof Bluetooth speaker has performed very well as I have used it several times. I was leery of purchasing a returned product but it works well and I am very pleased."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customerCentralTxPreacher",
          "Nb_Reviews": 2,
          "Date": "2019-10-24T18:32:18.000Z",
          "Titre": "My dealings with the company have been…good",
          "Contenu": "My dealings with the company have been great. However I did have to send back an item twice as it was defective. But it was a no hassle return which speaks highly of the company."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "RAKAN",
          "Nb_Reviews": 2,
          "Date": "2018-05-26T01:33:27.000Z",
          "Titre": "Great refurbished product",
          "Contenu": "Package arrived within a week. I had some charging issues with the device at first. Looked up a YouTube video on how to solve it. Problem solved. Product runs as it should. Thanks."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MAC",
          "Nb_Reviews": 8,
          "Date": "2018-08-31T16:26:42.000Z",
          "Titre": "Great product",
          "Contenu": "I used the silicone gloves for the first time this week.  I removed a baking pan from the oven whose temperature was 375 degrees.  I didn’t burn my hands.   Goodbye potholders!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "WJM",
          "Nb_Reviews": 1,
          "Date": "2019-02-07T16:28:06.000Z",
          "Titre": "Good Experience and a Good Product",
          "Contenu": "I enjoyed my order with A4C and it was processed quickly and delivered promptly. Their sale prices were also very good and I was able to get a good item and a very good value."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Diane",
          "Nb_Reviews": 2,
          "Date": "2018-06-11T04:31:06.000Z",
          "Titre": "Good value",
          "Contenu": "Overall, it was a great experience buying from a4c.com. I think my banking information was compromised after the transaction but was caught in time. Very happy other than that!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "M. Bass",
          "Nb_Reviews": 1,
          "Date": "2018-07-03T16:43:19.000Z",
          "Titre": "Works just fine",
          "Contenu": "Works just fine.  Easy enough that an 80 year old(me) semi techie could set it up.  Only thing missing was the batteries.  Fortunately  I. Had some😀👵🏻"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2022-09-29T20:10:03.000Z",
          "Titre": "Product as described",
          "Contenu": "Product as described. Item shipped quickly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cubfanone",
          "Nb_Reviews": 2,
          "Date": "2018-08-09T00:02:11.000Z",
          "Titre": "The soundbar is an excellent value with…",
          "Contenu": "The soundbar is an excellent value with great sound, however, the usability is counter-intuitive. Love the acoustics, but still have no idea how I made it work with my TV."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-05-27T17:31:27.000Z",
          "Titre": "I just received my bluetooth speaker…",
          "Contenu": "I just received my bluetooth speaker and it works great. I only gave it 4 stars because I've only had it a few days...I'm waiting to see how durable it is."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2019-02-17T15:36:13.000Z",
          "Titre": "I would love this company to refurbish…",
          "Contenu": "I would love this company to refurbish my wife’s old flex fit bit but they told me that they cannot do that so I asked them for further assistance and no answer"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "BORIS YOFFE",
          "Nb_Reviews": 4,
          "Date": "2018-12-22T17:25:06.000Z",
          "Titre": "On time delivery",
          "Contenu": "On time delivery, product meets expectations.  One star off - for packaging:  it was very difficult to get the product out of its plastic wrapping/packaging."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christine Shafransky",
          "Nb_Reviews": 1,
          "Date": "2020-12-30T01:35:34.000Z",
          "Titre": "Package arrived late but in good condition",
          "Contenu": "Package arrived after Christmas but the phone cases I ordered were very nice and without issues! Thanks for looking after my order for me A4C!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kyle VanLandingham",
          "Nb_Reviews": 1,
          "Date": "2021-02-03T15:06:32.000Z",
          "Titre": "No more USPS",
          "Contenu": "Please please please, use a different shipping service than USPS. My package sat at post office for over a week in \"Pre-shipment\"."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-03-11T04:06:54.000Z",
          "Titre": "Great CS follow up and overall good CS",
          "Contenu": "Great CS follow up and overall good CS. R stars because the product I received a refurbished one didn't work at all not even turn on so QC is poor."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jack Hamilton",
          "Nb_Reviews": 1,
          "Date": "2018-12-28T05:58:17.000Z",
          "Titre": "Works good and provides great sound",
          "Contenu": "Works good and provides great sound. The only con is that people I'm talking to on my iphone or on Facebook chat say it causes their sound to echo."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 9,
          "Date": "2018-08-13T21:35:55.000Z",
          "Titre": "Web site transaction very smooth",
          "Contenu": "Web site transaction very smooth.  Shipped fairly quickly.  My only criticism was that it seemed to take too long to get order updates from the company."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Katie Sullivan",
          "Nb_Reviews": 3,
          "Date": "2021-08-24T01:09:23.000Z",
          "Titre": "Great transaction",
          "Contenu": "Great transaction! Order was easy, arrived in a timely manner- I think it was about a week or less. No issues at all! Recommend!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Teri Cobbin",
          "Nb_Reviews": 3,
          "Date": "2020-07-13T19:13:19.000Z",
          "Titre": "Disposable Mask review",
          "Contenu": "I've ordered the disposable mask twice.  Quality of the disposable mask is good and shipping didn't take long.  I would order again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stacey J Darnold Finnigan",
          "Nb_Reviews": 7,
          "Date": "2020-10-03T15:38:44.000Z",
          "Titre": "A tad bit slow delivery",
          "Contenu": "The only complaint I have is the shipping took a bit longer than I would have liked, but given the current environment, it was acceptable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Weeb2SBC",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T21:32:56.000Z",
          "Titre": "Bluetooth earbuds were good",
          "Contenu": "The bluetooth earbuds were just as described and arrived in a short period of time.  The sound is pretty good and I would recommend them to others."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-05-28T01:09:46.000Z",
          "Titre": "everything was to my satisfaction…",
          "Contenu": "everything was to my satisfaction except the delivery. package was sent to 3 states before it made it to my state, took 10 days for delivery."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-06-01T16:39:18.000Z",
          "Titre": "Shipping/tracking information is scant",
          "Contenu": "Shipping/tracking information is scant. The product took 6 business days to arrive. The product was in good condition.  Overall, good value."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Arnold Knack",
          "Nb_Reviews": 3,
          "Date": "2018-08-14T01:33:54.000Z",
          "Titre": "Nice and as advertised",
          "Contenu": "It is nice and as advertised however I mount my phone in a holder in my car and it interferes with the holder even in the retracted position"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stewparts",
          "Nb_Reviews": 2,
          "Date": "2019-08-31T12:46:58.000Z",
          "Titre": "Good prices",
          "Contenu": "Good prices.  Fast delivery.  Cheapest price for an echo dot.I mainly look for good prices on watches and Tablets.  They sell out fast."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-01-08T19:45:05.000Z",
          "Titre": "No problems with the order",
          "Contenu": "No problems with the order.  I received the package in a decent amount of time with no damage.  The speaker I ordered worked pretty good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert  E.",
          "Nb_Reviews": 16,
          "Date": "2018-12-15T19:52:59.000Z",
          "Titre": "Although the product sent was incorrect…",
          "Contenu": "Although the product sent was incorrect the 1st time - a replacement shipment was received shortly thereafter.  Correct product was good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Giulio",
          "Nb_Reviews": 1,
          "Date": "2019-07-05T21:16:49.000Z",
          "Titre": "Nice Deal",
          "Contenu": "The shipping info was updated too late I thought I was scammed by you but fortunately everything went fine little late but fine so far"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christopher Ramsayer",
          "Nb_Reviews": 2,
          "Date": "2020-09-28T17:20:44.000Z",
          "Titre": "Damaged package",
          "Contenu": "Shipping package was fine, but product packaging inside was damaged. No damage to product. Other than that everything was great"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ERIC RENIX",
          "Nb_Reviews": 3,
          "Date": "2020-10-17T14:39:26.000Z",
          "Titre": "They have great  sounds customer…",
          "Contenu": "They have great  sounds customer service  great 👍 they  are a little  different  just have to adjust  right in ear."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-03-14T17:51:51.000Z",
          "Titre": "wrong info given",
          "Contenu": "fast shopping but wasn't the right battery false info said it would work for my phone won't it's not the right battery"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "A happy customer",
          "Nb_Reviews": 1,
          "Date": "2018-08-16T00:03:00.000Z",
          "Titre": "I have not really used my popsocket yet…",
          "Contenu": "I have not really used my popsocket yet but several people in my family have them and just love them.  I'm sure I will, too"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephen Thibodeaux",
          "Nb_Reviews": 2,
          "Date": "2020-12-08T01:45:47.000Z",
          "Titre": "Wasn't Bad at All",
          "Contenu": "Was easy to order and didn't need to call customer service, but the package tracking leaves a lot to be desired."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2019-01-20T16:11:51.000Z",
          "Titre": "The price was great",
          "Contenu": "The price was great. The product looks good. The shipping was a little delayed, but I am not complaining with free shipping."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lawman50",
          "Nb_Reviews": 1,
          "Date": "2019-09-09T21:13:30.000Z",
          "Titre": "Seamless Transaction",
          "Contenu": "Product arrived on the previously stated date. The product was new and as advertised.I’am satisfied. I would use again."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-10-22T13:32:03.000Z",
          "Titre": "Easy to place order and product arrive…",
          "Contenu": "Easy to place order and product arrive in good time. A little expensive on the shipping price of earbuds ($14 to canada)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Graham",
          "Nb_Reviews": 2,
          "Date": "2021-01-09T19:11:09.000Z",
          "Titre": "Quick service",
          "Contenu": "Quick service. Product arrived as expected. Price was very good. My experiences with A4C have always been good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rell philly",
          "Nb_Reviews": 1,
          "Date": "2018-10-07T15:17:30.000Z",
          "Titre": "IPad works looks good few scratches but…",
          "Contenu": "IPad works looks good few scratches but other than that it’s exactly what they said....will definitely shop here again!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tina Mun",
          "Nb_Reviews": 1,
          "Date": "2020-07-13T22:49:38.000Z",
          "Titre": "It has a great quality of the material…",
          "Contenu": "It has a great quality of the material but the loops are weak that I experienced detachment twice among 10 masks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Graham B",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T22:05:08.000Z",
          "Titre": "Uncertain Expectations - Pleasantly Surprised!",
          "Contenu": "Excellent service - had to contact customer service because of a misapplied coupon code. Without voiding the transaction, an agent refunded the difference, and did so immediately.Item arrived very quickly and exactly as described. I couldn’t be more satisfied. Went into this process unsure what to expect, but can say with confidence that I wouldn’t hesitate to purchase from A4C again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leonid",
          "Nb_Reviews": 2,
          "Date": "2023-09-29T19:25:47.000Z",
          "Titre": "Thumbs up!",
          "Contenu": "Great vendor, everything went smoothly, I got a great deal and my purchase was delivered two days earlier than initially estimated."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deepak Kumar",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T18:59:03.000Z",
          "Titre": "I bought a Anker power conf and Liberty…",
          "Contenu": "I bought a Anker power conf and Liberty pro 3 . Both are brand new. My experience with A4C is good. Will definitely recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Southwick",
          "Nb_Reviews": 4,
          "Date": "2023-10-03T17:24:38.000Z",
          "Titre": "Shipping was faster than stated",
          "Contenu": "Shipping was faster than stated.  Product was flawless and works great. Price was lowest found by $100"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bret Cohoon",
          "Nb_Reviews": 3,
          "Date": "2023-09-25T00:43:39.000Z",
          "Titre": "I had an issue on my end I contacted…",
          "Contenu": "I had an issue on my end I contacted customer service and thry fixed it right away. I will definitely buy from them again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin Weathermon",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T21:49:45.000Z",
          "Titre": "Great Seller!",
          "Contenu": "Products shipped quicky, arrived on time, and in excellent condition."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ringxy Lim",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T19:26:13.000Z",
          "Titre": "Great product and good condition",
          "Contenu": "Great product and good condition. Will shop again. Thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ammar",
          "Nb_Reviews": 3,
          "Date": "2023-09-24T21:18:54.000Z",
          "Titre": "Awesome",
          "Contenu": "Awesome! Price on an awesome product. Good communication. Received the items swiftly."
        },
        {
          "Note": 5,
          "Lieu": "PR",
          "Pseudo": "Roberto Rivera",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T15:44:02.000Z",
          "Titre": "Fast shipping",
          "Contenu": "Fast shipping, package arrive early. No problems in the purchase"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donald Kemp",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T00:21:37.000Z",
          "Titre": "Happy camper 😛",
          "Contenu": "Order process was easy,  fast delivery and the product was better than I expected at a tremendous discounted price so overall very very happy with the whole experience"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ac",
          "Nb_Reviews": 8,
          "Date": "2023-09-09T06:12:36.000Z",
          "Titre": "A4C has been my go to place for tech purchases…",
          "Contenu": "A4C has been my go to place for less expensive, high quality tech. Will continue to be my go to place if they continue with the same offerings and great prices year after year."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jorge",
          "Nb_Reviews": 7,
          "Date": "2023-09-27T01:04:16.000Z",
          "Titre": "Quality at a glance",
          "Contenu": "I was kept well informed on my package and add tracking"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Levi",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T21:48:03.000Z",
          "Titre": "Ordered headphones and got them and a…",
          "Contenu": "Ordered headphones and got them and a great price. Great quality and convenient"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sarah Carroll",
          "Nb_Reviews": 2,
          "Date": "2023-09-08T18:49:39.000Z",
          "Titre": "Love my new AirPods!",
          "Contenu": "Received my new AirPods very quickly in the mail. Actually ahead of time. Very pleased with them. I forget I have them in - they are so comfortable. Love them very much. Thank you A4C!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sophan Im",
          "Nb_Reviews": 3,
          "Date": "2023-09-19T16:23:48.000Z",
          "Titre": "Great and responsive",
          "Contenu": "Made a couple changes to the order and they were responsive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TROY WILKEN",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T04:07:03.000Z",
          "Titre": "Very good communication and help with…",
          "Contenu": "Very good communication and help with the online chat person Kim and follow up with emails to solve the issue. And fast turnaround time from sending my broken earbuds in and getting new ones. Very good customer service in the current business world these days."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RDTX",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T22:40:26.000Z",
          "Titre": "Good Customer service",
          "Contenu": "The item i ordered was slightly defective but still usable. A4C customer support were extremely fast in responding to me and resolving my issue in a timely manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Teng",
          "Nb_Reviews": 4,
          "Date": "2023-09-03T18:44:00.000Z",
          "Titre": "Product came in a short amount of time…",
          "Contenu": "Product came in a short amount of time and the customer service was courteous and helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 2,
          "Date": "2023-09-25T22:40:07.000Z",
          "Titre": "Fast shipping and as advertised."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "eric decastro",
          "Nb_Reviews": 3,
          "Date": "2023-08-08T23:51:17.000Z",
          "Titre": "Best price for products purchased + amazing customer service!",
          "Contenu": "Products were the best price around. Further, I forgot to add a coupon code and I was a refunded the difference. Great customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aleksandr Tokmazeyskiy",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T18:34:53.000Z",
          "Titre": "First time buying from A4C and been a…",
          "Contenu": "First time buying from A4C and been a great experience. Lg Wireless buds came very well packaged and delivered within 4 days. Very happy with the purchase !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "G$",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T12:58:33.000Z",
          "Titre": "Easy",
          "Contenu": "Easy, no issues"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jess",
          "Nb_Reviews": 2,
          "Date": "2023-06-02T20:25:31.000Z",
          "Titre": "Trusted Seller",
          "Contenu": "I recently ordered some wireless earbuds from A4C.  Shipping was fairly quick and the earbuds were both authentic and in perfect condition.  I would trust them as a seller in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MT Forg",
          "Nb_Reviews": 1,
          "Date": "2022-12-22T22:47:36.000Z",
          "Titre": "Great product Great price",
          "Contenu": "Great product, excellent price. Otterbox defender series for 11 Pro Max, was in immaculate condition and I am very satisfied with my purchase. A4C brings great savings to the masses. I’ve shopped here for more than 5 years and am always pleased with quality and price on offer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aiyaz P",
          "Nb_Reviews": 2,
          "Date": "2023-08-17T05:33:04.000Z",
          "Titre": "I ordered a Ring Motion detector…",
          "Contenu": "I ordered a Ring Motion detector through them. The package arrived on time and is working as expected"
        },
        {
          "Note": 5,
          "Lieu": "CR",
          "Pseudo": "Michael A",
          "Nb_Reviews": 3,
          "Date": "2023-04-12T18:10:13.000Z",
          "Titre": "Great in every way",
          "Contenu": "Fast shipping, item brand new and sealed as described, great customer service. I didn't know this company but gave it a chance anyway, I'm happy I did, buy with confidence."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donna Wade",
          "Nb_Reviews": 1,
          "Date": "2023-01-27T14:26:05.000Z",
          "Titre": "Samsung 3 and 4",
          "Contenu": "I order a Samsung watch 3 which I was unable to connect to cellular service. The watch itself was in great shape but just wouldn’t connect. I called and explained my situation. They immediately issued me a return and I decided to try the Samsung 4 watch. It is perfect! It was in great shape (no scratches or marks), battery lasts 36 hours or so and I am extremely happy with my purchase. As a side note, my husband loved the watch 3 so much we decided to keep both!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 5,
          "Date": "2023-09-28T18:37:44.000Z",
          "Titre": "Good price and fast shipping"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin Mclain",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T01:25:28.000Z",
          "Titre": "Excellent value.Nice design and sound…",
          "Contenu": "Excellent value.Nice design and sound with the speaker ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MB",
          "Nb_Reviews": 2,
          "Date": "2023-02-15T23:33:33.000Z",
          "Titre": "I see a lot of reviews regarding…",
          "Contenu": "I see a lot of reviews regarding purchases throughout many different shopping outlets. My experience with this specific company \"A4C\" was a great transaction and got exactly what was described. I'm happy with the purchase and will most likely buy again from this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AnW",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T18:56:41.000Z",
          "Titre": "I can my cell phone accessories at reasonable price",
          "Contenu": "Received item quickly and in excellent condition. Price is very reasonable as refurb.Seller is very good at communication after purchase"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AD",
          "Nb_Reviews": 4,
          "Date": "2023-09-28T21:50:33.000Z",
          "Titre": "Great",
          "Contenu": "Everything was great. Shipping was quick."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JK",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T17:46:15.000Z",
          "Titre": "Good speaker",
          "Contenu": "I have a strong affinity for this product. When it comes to the sound quality, opinions may vary from person to person, but personally, I primarily utilize this speaker for music listening or connecting it to a TV, and I experience no discomfort whatsoever. I endorse this speaker and recommend it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Guy Witherspoon",
          "Nb_Reviews": 5,
          "Date": "2023-08-02T23:16:18.000Z",
          "Titre": "Great refurbished charger",
          "Contenu": "I needed a wireless fast charger for my Samsung phone and this fitted the bill perfectly at a great price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 2,
          "Date": "2023-08-04T02:51:45.000Z",
          "Titre": "No fear - A4c Great Transaction",
          "Contenu": "Everything about this transaction was easy.  Website-Easy, Ordering-Easy, Paying-Easy, Shipping-Easy and Fast!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ariane",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T20:40:24.000Z",
          "Titre": "Great service, exactly what I ordered",
          "Contenu": "I received my order quickly and it was shipped in perfect shape."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nathan Van Cleave",
          "Nb_Reviews": 1,
          "Date": "2022-10-21T19:00:42.000Z",
          "Titre": "I would buy from A4C again",
          "Contenu": "I bought a certified refurbished phone case that was completely out of stock elsewhere. I saw a couple of bad reviews for A4C and was a little worried, but my experience was great! The case was in perfect condition and I am very pleased."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ben",
          "Nb_Reviews": 3,
          "Date": "2023-03-27T01:38:39.000Z",
          "Titre": "Great Pricing, Bullet Fast Shipping",
          "Contenu": "Carries a nice variety of products, many of which have deep discounts. Check the site regularly, you'll find sale prices on top name brands, as much as 50% off. Bullet fast shipping, great all around."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "joey nguyen",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T20:51:40.000Z",
          "Titre": "Had an issue with the order my mistake…",
          "Contenu": "Had an issue with the order my mistake they fixed it really quick … great contact and service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandy Cameron",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T19:38:24.000Z",
          "Titre": "Great Sound",
          "Contenu": "The LG earbuds that I received are fantastic! The sound is comparable to my AirPods and at a much more affordable price!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christina",
          "Nb_Reviews": 2,
          "Date": "2023-06-06T13:49:27.000Z",
          "Titre": "The order was quickly filled- and while…",
          "Contenu": "The order was quickly filled- and while I haven't yet opened the earbuds (they are intended for a gift) they are beautifully packaged and arrived quickly!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Philip N.",
          "Nb_Reviews": 3,
          "Date": "2023-08-02T16:58:28.000Z",
          "Titre": "The website is clear and easy to…",
          "Contenu": "The website is clear and easy to navigate.  Ability to pay with different options is a plus."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan Matthews",
          "Nb_Reviews": 3,
          "Date": "2022-04-28T21:34:35.022Z",
          "Titre": "I ordered the wrong size Apple Watch…",
          "Contenu": "I ordered the wrong size Apple Watch and retuned it for the smaller face model, hassle free. The customer service was excellent and super friendly. Great company to do business with! I highly recommend… LOVE my Apple Watch🤗"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-06-03T22:39:32.000Z",
          "Titre": "Product and price were fantastic",
          "Contenu": "Product and price were fantastic! The JBL ear pods have a great sound quality, they hold a charge for a long period of time. They fit in perfect in my ear..they have not fallen out, but sometimes they feel like they are but are not…I think it is me just paranoid I am going to lose them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pachi",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T16:05:22.000Z",
          "Titre": "Great place to buy high tech devices",
          "Contenu": "Great place to buy high tech devices. I have purchasing from this place for more than a decade with confidence."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "sgarfinkle83",
          "Nb_Reviews": 5,
          "Date": "2023-08-03T00:59:51.000Z",
          "Titre": "perfect shopping",
          "Contenu": "A4c continues to deliver perfect quality  gear and to do it quickly and cheaply."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MikeS",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T21:39:07.000Z",
          "Titre": "Simple purchasing process, and fast delivery",
          "Contenu": "Found a deal for LG earbud from slickdeals. Purchasing was a breeze, and delivery was fast.  Happy with the experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew",
          "Nb_Reviews": 5,
          "Date": "2023-08-15T21:06:36.000Z",
          "Titre": "The proprietor of the business was on…",
          "Contenu": "The proprietor of the business was on top of things and very honest"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Flores",
          "Nb_Reviews": 3,
          "Date": "2023-05-13T03:01:58.000Z",
          "Titre": "The JVC Earbuds that I ordered came within a few days from when I purchased them. Great Value for the price!",
          "Contenu": "The JVC Earbuds that I ordered came within a few days after I purchased them. The price was excellent and the earbuds were just as advertised. They sound great and fit well. Great value for the money!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shaobao zhang",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T12:14:27.000Z",
          "Titre": "very good",
          "Contenu": "very good。 I am very like.   And good prices"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Todd",
          "Nb_Reviews": 1,
          "Date": "2022-09-30T00:11:12.000Z",
          "Titre": "Great price and experience",
          "Contenu": "Price is unbeatable and shipping was fast!  Couldn’t ask for any better communication along the way with frequent updates.  A+"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Willie Irie",
          "Nb_Reviews": 5,
          "Date": "2022-10-17T02:23:28.000Z",
          "Titre": "The item fits the description on the…",
          "Contenu": "The item fits the description on the website. Moreover, it was shipped promptly and received in pristine condition. I truly enjoy buying from A4C."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Pahk",
          "Nb_Reviews": 4,
          "Date": "2022-03-20T18:00:37.000Z",
          "Titre": "No fooling",
          "Contenu": "They sent me the wrong product but no worries they sent me the correct item immediately.  What a nice surprise from customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George Carpenter",
          "Nb_Reviews": 3,
          "Date": "2022-12-12T15:02:06.000Z",
          "Titre": "Was skeptical but it was great!",
          "Contenu": "Was skeptical when I saw a deal but transaction went smooth and shipping was great.  Would defiantly buy from them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Samantha Ramos",
          "Nb_Reviews": 2,
          "Date": "2022-05-30T20:55:30.000Z",
          "Titre": "apple watch series 6",
          "Contenu": "I got an apple watch series 6! I got it as CR and it is perfect! It looks brand new! I have gotten a few different products from A4C and have always gotten exactly what I wanted. I think people really need to pay attention to the grade of the product. You get what you pay for! Don't expect refurbished, or pre owned to look brand new. If you want something like that always get CR!! Thank you A4C!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Avery",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T16:56:52.000Z",
          "Titre": "Great price",
          "Contenu": "Great price. The purchase process was seamless with product procurement and delivery done in a timely matter."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terry H",
          "Nb_Reviews": 7,
          "Date": "2022-07-15T02:54:18.000Z",
          "Titre": "Always a good experience at A4C!",
          "Contenu": "I've been buying items from A4C for several years and always have a good experience.  Good products at great prices!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shopper",
          "Nb_Reviews": 1,
          "Date": "2022-11-20T01:36:24.000Z",
          "Titre": "I’ve shopped with them a couple of…",
          "Contenu": "I’ve shopped with them a couple of times now. Easy shopping. Great communication. Reasonable delivery time."
        },
        {
          "Note": 5,
          "Lieu": "KR",
          "Pseudo": "Jun Ho Byun",
          "Nb_Reviews": 1,
          "Date": "2023-07-15T06:09:21.000Z",
          "Titre": "The transaction was satisfactory",
          "Contenu": "The transaction was satisfactory. Thank you for selling at a good price."
        },
        {
          "Note": 5,
          "Lieu": "KR",
          "Pseudo": "SeungHoon Kang",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T12:16:09.000Z",
          "Titre": "Go I'd product.",
          "Contenu": "Go I d product.But slow delivery.You.must be fast delivery  methods."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandy Watson",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T14:43:53.000Z",
          "Titre": "Item delivered fast and was a quality…",
          "Contenu": "Item delivered fast and was a quality product!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ayden",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T22:47:31.000Z",
          "Titre": "Great used tech site",
          "Contenu": "Great used tech site, ordered 5 or 6 times now and every time Ive had a good experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chantal Acacio",
          "Nb_Reviews": 3,
          "Date": "2023-03-30T16:16:29.000Z",
          "Titre": "Great website for buying refurbished items",
          "Contenu": "I ordered headphones at an extremely affordable price here and they arrived within a few days and in perfect condition!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fernando Sanchez jr",
          "Nb_Reviews": 2,
          "Date": "2023-04-07T17:21:01.000Z",
          "Titre": "Ez to navigate website, great deals",
          "Contenu": "Ez to navigate website, a lot of great deals and quickly received purchased items!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Appleget",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T17:48:46.000Z",
          "Titre": "Product arrived in the time frame…",
          "Contenu": "Product arrived in the time frame advertised. So far the product is working as advertised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kewal",
          "Nb_Reviews": 2,
          "Date": "2023-08-02T20:24:57.000Z",
          "Titre": "Got the ring sensors on time",
          "Contenu": "Got the order delivered as listed and promised within the timeframe"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MOHAMMED",
          "Nb_Reviews": 4,
          "Date": "2023-05-01T11:43:48.000Z",
          "Titre": "Great Company To Order From",
          "Contenu": "Fast shipping, great service, received product new as promised, and the price was great"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob Hermann",
          "Nb_Reviews": 2,
          "Date": "2023-03-29T19:05:54.000Z",
          "Titre": "Great Shopping Experience",
          "Contenu": "Fast shipping, quality product (exactly as described), and a great price. A trifecta!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael B",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T18:22:29.000Z",
          "Titre": "Super fast shipping",
          "Contenu": "Super fast shipping, tracking info sent. Price was amazing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephanie Cable",
          "Nb_Reviews": 2,
          "Date": "2023-05-05T03:17:20.000Z",
          "Titre": "great product,great company, great price!!!!!",
          "Contenu": "great product, on time,fast shipping, unbelievable price, very impressed"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cristian Deanda",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T00:51:37.000Z",
          "Titre": "I accidentally ordered the incorrect…",
          "Contenu": "I accidentally ordered the incorrect size and offered to teuturn the item but the company said it was unnecessary to so do so and I was still issued a full refund"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "WES G",
          "Nb_Reviews": 4,
          "Date": "2023-05-04T01:26:50.000Z",
          "Titre": "Great price",
          "Contenu": "Great price!  Fast shipper!  Received item exactly as described."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 2,
          "Date": "2022-03-14T14:50:51.000Z",
          "Titre": "They are quick with shipping and have…",
          "Contenu": "They are quick with shipping and have excellent products. Would recommend them to anyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ramesh Soni",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T07:32:19.000Z",
          "Titre": "The order was processed and shipped…",
          "Contenu": "The order was processed and shipped very quickly.  The product was as described."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AJK",
          "Nb_Reviews": 2,
          "Date": "2022-03-08T21:52:28.000Z",
          "Titre": "Shipped promptly",
          "Contenu": "Shipped promptly. No issues. A bit skeptical, but products were new and exactly as described."
        },
        {
          "Note": 5,
          "Lieu": "CR",
          "Pseudo": "Ayleen Dale",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T16:09:49.000Z",
          "Titre": "Better than expected.",
          "Contenu": "Didn't have any issues with the site and the product arrived in perfect conditions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Art Clevinger",
          "Nb_Reviews": 2,
          "Date": "2022-10-22T19:06:52.000Z",
          "Titre": "Just what I was looking for!",
          "Contenu": "Website was easy to navigate and they offered a great discount all on their own."
        },
        {
          "Note": 5,
          "Lieu": "KR",
          "Pseudo": "lee jaemyung",
          "Nb_Reviews": 2,
          "Date": "2023-06-08T02:45:01.000Z",
          "Titre": "After ordering",
          "Contenu": "After ordering, the delivery was fast and the product was loaded"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark C...",
          "Nb_Reviews": 2,
          "Date": "2023-08-01T05:31:12.000Z",
          "Titre": "Good Stuff",
          "Contenu": "Delivery was great and the product is perfect at a great price. We are good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AHassani",
          "Nb_Reviews": 3,
          "Date": "2023-06-03T23:08:07.000Z",
          "Titre": "Cost Efficient and Expeditious",
          "Contenu": "The cost and efficiency of the purchase was worth the 5 stars. The product was also as described."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Holcombe",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T19:43:53.000Z",
          "Titre": "Quick easy ordering",
          "Contenu": "Quick easy ordering, product was as described, and condition was perfect."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "A I",
          "Nb_Reviews": 1,
          "Date": "2023-08-27T03:05:37.000Z",
          "Titre": "Fast Delivery.  Good Experience.",
          "Contenu": "Company adjusted order fast and correctly.  Order arrived quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luis morales",
          "Nb_Reviews": 2,
          "Date": "2023-07-06T06:51:28.000Z",
          "Titre": "Received the product I purchased in a…",
          "Contenu": "Received the product I purchased in a timely manner."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "GUILLERMO SANDOVAL",
          "Nb_Reviews": 4,
          "Date": "2022-12-03T22:55:35.000Z",
          "Titre": "Good price and Fast Shipping",
          "Contenu": "I think you have a very good price, and fast shipping in a holliday days"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryan Roderick",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T19:09:15.000Z",
          "Titre": "Great deals",
          "Contenu": "Great deals, quick shipping and fairly quick customer service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rafael Soto",
          "Nb_Reviews": 2,
          "Date": "2023-07-04T00:15:37.000Z",
          "Titre": "Fast shipping",
          "Contenu": "Fast shipping, works as like the original."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Manuel Rosales",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T00:53:47.000Z",
          "Titre": "Product described accurately and the…",
          "Contenu": "Product described accurately and the price is excellent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jesse N",
          "Nb_Reviews": 4,
          "Date": "2023-03-29T18:03:17.000Z",
          "Titre": "Exactly what I ordered",
          "Contenu": "Exactly what I ordered, delivered earlier than they said."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "donald c jagot",
          "Nb_Reviews": 7,
          "Date": "2022-10-01T13:11:36.000Z",
          "Titre": "Shipment arrived quickly",
          "Contenu": "Shipment arrived quickly, product performed well, connected immediately. Batteries hold their charge longer than my previous earbuds."
        },
        {
          "Note": 5,
          "Lieu": "KR",
          "Pseudo": "Kim",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T08:45:12.000Z",
          "Titre": "So good",
          "Contenu": "Good product, nice price and friendly customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Truong",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T03:50:01.000Z",
          "Titre": "got what I wanted at a great price",
          "Contenu": "got what I wanted at a great price.  Shipping was fast and no issues with product or shipping.  Thank you A4C."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Lally",
          "Nb_Reviews": 1,
          "Date": "2022-03-09T15:59:52.000Z",
          "Titre": "no issues device was sent as promised…",
          "Contenu": "no issues device was sent as promised and fantastic product"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JenZ",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T19:52:58.000Z",
          "Titre": "VERY pleased",
          "Contenu": "Efficient delivery and an exceptional product for a very fair price."
        },
        {
          "Note": 5,
          "Lieu": "KR",
          "Pseudo": "lee jaemyung",
          "Nb_Reviews": 2,
          "Date": "2023-05-28T15:01:20.000Z",
          "Titre": "I trust that the product is delivered…",
          "Contenu": "I trust that the product is delivered accurately"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 2,
          "Date": "2023-08-03T03:07:04.000Z",
          "Titre": "Good price.",
          "Contenu": "Good price, product was in good condition."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jose Martinez",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T17:41:42.000Z",
          "Titre": "Great quality for the product and price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Iuguesr",
          "Nb_Reviews": 2,
          "Date": "2023-08-04T19:33:30.000Z",
          "Titre": "Good product",
          "Contenu": "Good product, good price, good delivery, thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sri Akkina",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T01:06:31.000Z",
          "Titre": "Order received on time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jimmy Taylor",
          "Nb_Reviews": 1,
          "Date": "2023-01-09T02:45:35.000Z",
          "Titre": "That battery charger is great and very…",
          "Contenu": "That battery charger is great and very convenient for the kids and I. We just love it         Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jerky",
          "Nb_Reviews": 1,
          "Date": "2022-03-10T00:31:52.000Z",
          "Titre": "Legit",
          "Contenu": "Good prices, solid selection, fast shipping, and very transparent and easy to use interface."
        }
      ]
    }
  ]
}