{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.tranya.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "ZA",
          "Pseudo": "Sma Rantsoabe",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T15:28:35.000Z",
          "Titre": "I had a received a promotion for a 50%…",
          "Contenu": "I had a received a promotion for a 50% discount on my purchase from the app but when trying to make a purchase the price was not what showed on the promotion which is why I did not complete the purchase."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dreceus",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T23:56:12.000Z",
          "Titre": "Never again",
          "Contenu": "These are the absolute WORST earbuds I have ever owned, especially from Tranya. I have purchased their brand of headphones multiple times in the past and have always been satisfied up until this point. From the moment I took them out of the pack I had issues. First off, I hate the new touch sensitive pad they have on the T10s instead of an actual button to press for pause/play. Secondly, when I finally charged up the power box they come in I could only get the right earbud to even turn on. I looked up multiple solutions to try to get the left one working but nothing I tried worked for me.Lastly, the battery life on the earbuds and the charge box is absolutely TERRIBLE. As I mentioned earlier, I fully change box (and also the earbuds) and not even 24hrs later both the box and earbuds were completely dead. And I hadn't even used them! I only noticed they were dead when I went to try them out one more time before writing this review. SmhSo in conclusion, I am completely unsatisfied with this product and will probably never purchase anything from Tranya again. I'm in the process of trying to get a complete refund from them (if their customers service ever reaches back out after the multiple emails I have sent them) and send them back these trash headphones. (*PS. There is a small chance I just received an defective product and will be willing to hear out the reps if they honor my refund request. I still have a pair of the T1 buds that work but are slowly going out on me, which was the whole reason i decided to buy these to begin with.)"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Micheal Tanh",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T18:17:25.000Z",
          "Titre": "absolutely no returns",
          "Contenu": "Returns are only quailfy due with quality issues. Edgilable returns must be unused and packaged as orginal.In other words, absolutely no returns. You won't know the quality if you're not using it, opening the product."
        },
        {
          "Note": 1,
          "Lieu": "SA",
          "Pseudo": "Doc H",
          "Nb_Reviews": 1,
          "Date": "2023-06-11T16:19:01.000Z",
          "Titre": "These scammers don’t have an address…",
          "Contenu": "These scammers don’t have an address nor a number to call on their site so that’s a red flag. Another scamming proof that when you ask for replacement they send you this:Please give us a five-star review on this website and provide us with screenshots.—link goes here; review website will not allow posting with a link —Note that it is required to leave a good review on the site, not a bad review of the product. Otherwise it cannot pass.An then we will issue a new one for you.Very grateful to you.“"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Clay W.",
          "Nb_Reviews": 1,
          "Date": "2022-08-19T09:01:09.000Z",
          "Titre": "TranyaGo is trash product and service",
          "Contenu": "Ordered a watch. 4 weeks later it arrived. Surprised by the low quality and feel ( vibration feels like the watch is going to fall apart and the screen is blurry).Requested a refund and was asked to upload a video to YouTube showing the quality issue (I don't have YouTube account nor should I have to) was then told they ship from chine and I will bare the cost of shipping and they do not hold responsibility for lost packages. Currently disputing charges with the bank."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Matthew Fitzpatrick",
          "Nb_Reviews": 1,
          "Date": "2022-10-31T18:50:59.000Z",
          "Titre": "Bad company, Tried to blackmail me.",
          "Contenu": "My package arrived, earbuds didnt work. They didnt turn on, didnt work at all. Then, after I directly emailed support, because they dont have a chat function ON THE PAGE. And then, they tried to blackmail me into giving them 5 stars on a separate webpage in order to get my earbuds replaced. Frankly I'm disgusted."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hunter newlin",
          "Nb_Reviews": 2,
          "Date": "2022-11-03T16:54:13.000Z",
          "Titre": "Absolutely horrible company",
          "Contenu": "Absolutely horrible company with horrible products. I ordered tranya t10s and when they came they were not functional. The support then instructed me in circles to swab the prongs etc. after I proved to them that they were broken I was then forced to give a 5 star review to recieve a replacement. The replacement has the exact same issue. Now they just offered me 5 dollars in compensation to a 40 dollar product and 2 weeks of my time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "S",
          "Nb_Reviews": 1,
          "Date": "2021-03-05T21:08:03.000Z",
          "Titre": "No Customer Support",
          "Contenu": "Their customer support page ironically shows a woman on a headset, however, there is phone number to contact them. You can email them, but they won't respond. Never making a purchase from them again, their earbuds are cheap and fall apart after a few months."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brandon Evan-Test",
          "Nb_Reviews": 1,
          "Date": "2020-06-02T15:47:42.000Z",
          "Titre": "Poor customer service, provided invalid tracking number",
          "Contenu": "I ordered a pair of wireless ear buds on may 2nd, they shipped out may 7th. It's now June 2nd and the tracking number they provided says it's invalid. I have contacted customer service 3 different times and got the same answer over and over again. Definitely would NOT Recommend"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T04:02:20.000Z",
          "Titre": "They asked for a 5 star review if i…",
          "Contenu": "They asked for a 5 star review if i wanted my headphones replaced because they arrived faulty. Being honest makes your company grow and you can learn from your mistakes. This is not professional"
        },
        {
          "Note": 1,
          "Lieu": "KW",
          "Pseudo": "Kamel",
          "Nb_Reviews": 2,
          "Date": "2022-05-30T22:02:32.000Z",
          "Titre": "Please can anyone advice what should I…",
          "Contenu": "Please can anyone advice what should I do with team of tranya I have make purchase of smart watch since one week and until now I didn’t receive any email of Shoping or no one he contact me Really it’s my bad experience of Shoping online Please anyone he have contact of them write for me Thank you so much"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "April Martin",
          "Nb_Reviews": 2,
          "Date": "2021-01-27T05:21:47.000Z",
          "Titre": "I ordered the ear buds on the 15th…",
          "Contenu": "I ordered the earbuds on the 15th of January 2021. I have yet to receive the earbuds or any communication from Tranya about the estimated time of delivery.  I know there has been a delay with deliveries due to COVID but I would at least expect an estimated delivery date or some form of communication about what is going on.  I have been checking the Tranya/Shop Pay app and there has been no movement since I purchased them. Disappointing.  I am regretting paying for these earbuds as I am pretty sure I will not receive them but somehow I allowed them to take my money."
        },
        {
          "Note": 1,
          "Lieu": "SE",
          "Pseudo": "Axelollars",
          "Nb_Reviews": 10,
          "Date": "2021-04-22T12:16:26.000Z",
          "Titre": "Horrible service",
          "Contenu": "Horrible service, I bought Tanya T10, after a few months the volume in the right earbud god really low. When I contacted customer service they told me to turn the volume up, I had the volume on max and could barely hear anything."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Vijay Karthik Kalyanasundaram",
          "Nb_Reviews": 4,
          "Date": "2019-12-14T10:56:20.000Z",
          "Titre": "Irresponsible customer service",
          "Contenu": "I am really disappointed with the service of Tranya company. I ordered a pair of TW earbuds on 27th November 2019, Tranya Rimor. After my payment was successfully completed, their customer service contacted me stating that my product has been shipped and usually it takes 7-15 days on 30th November. It is almost 15 days today and I haven't received any updates regarding my shipment or where my product is currently. I contacted the service personnel and they were really slow responding for my mail after 1 day of time. I am really frustrated right now since I planned to take my earbuds during my vacation and I havent received them yet. I am really disappointed with the service of Tranya."
        },
        {
          "Note": 1,
          "Lieu": "UA",
          "Pseudo": "Brian Smith",
          "Nb_Reviews": 1,
          "Date": "2022-05-25T14:00:34.000Z",
          "Titre": "Scammers from China",
          "Contenu": "Scammers from China, ripping you off. Do not purchase anything, do not instal their apps. There is one for monetizing your steps :) - total scam and virus"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Ashlie Turner",
          "Nb_Reviews": 4,
          "Date": "2023-07-25T19:03:50.000Z",
          "Titre": "Unethical",
          "Contenu": "So my watch broke and i contacted them sent screen shot etc. Customer services took 10 days to get back to me and only after i chased. The only way they would send me a new watch was if i put a 5 star review on here and proved it to them. Fair enough they sent a new one but to only do it after i send a 5 star review is unethical to me. Email below is what i receivedDear friend,As a way of expressing our apologies, we will resend you a new product, but can you give us a five-star review on this website and provide us with screenshots first? (Trust polite link supplied)Note that it is required to leave a good review on the site, not a bad review of the product. Otherwise it cannot pass.And then we will issue a new one for you. We'll reissue it for you as soon as you're done. Thanks in advance."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Joel  Hernandez Licona",
          "Nb_Reviews": 1,
          "Date": "2022-08-13T16:41:13.000Z",
          "Titre": "expensive and no good looking smart…",
          "Contenu": "expensive and no good looking smart watch there's no any logo or something that identify the brand same watch you can find it in Amazon less expensive"
        },
        {
          "Note": 1,
          "Lieu": "GR",
          "Pseudo": "Marildi Metoli",
          "Nb_Reviews": 1,
          "Date": "2022-12-10T13:48:01.000Z",
          "Titre": "If I could rate 0 I would gladly do so…",
          "Contenu": "If I could rate 0 I would gladly do so I ordered some earbuds from the official website I waited a week and they got returned back to the sender I contacted them they told me I gave wrong shipping information ok I contacted they told me everything is set they would sent me a second pair of earphones they sent it December 1st. Today I checked the tracking order and saw they got sent back again for second time without even contacting me this must be a joke started laughing worst costumer service ever these were a present for my brothers birthday he asked me also when they going to arrive.today I demand a refundi already been waiting for a month"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Taniva Scanterbury",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T00:24:51.000Z",
          "Titre": "THIS COMPANY IS ASININE AND GARBAGE",
          "Contenu": "THIS COMPANY IS ASININE AND GARBAGE. DON'T WASTE YOUR MONEY HERE, THERE HEADPHONES DON'T WORK AND YOU WON'T GET A REFUND BACK. NEVER AGAIN"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stevie Cribbins",
          "Nb_Reviews": 2,
          "Date": "2023-05-27T05:01:20.000Z",
          "Titre": "DO NOT TRUST THESE REVIEWS!!",
          "Contenu": "Purchased the watch using a coupon code purchase with “coins” earned on the Sweatcoin app. HUGE MISTAKE! This watch looks nice out of the package, but my partner wore it for approx 4-5 days before the watch reset itself back to factory settings. We thought it was a fluke. But it happened again. So far, we’ve had it for approx 3 weeks and it’s reset 4 times! I reached out to customer service and they requested a video of the issue… how in the world do I get a video of the watch resetting when you cannot anticipate when it will reset again. After 14 email responses back & forth (yes, 14..) the representative finally understood my dilemma and seemed to want to back their warranty… BUT only if I leave a 5 star review on this website and send them a screenshot. I’d love to add a screenshot of the email, but alas, I cannot. So I will copy/paste their latest response… “Sorry for your inconvenience.Please give us a five-star review on this website and provide us with screenshots.—link goes here; review website will not allow posting with a link —Note that it is required to leave a good review on the site, not a bad review of the product. Otherwise it cannot pass.An then we will issue a new one for you.Very grateful to you.“I’ll take the loss just to expose the truth. This company is garbage. Their products are garbage and their service is garbage."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "NZ",
          "Nb_Reviews": 1,
          "Date": "2021-05-17T10:47:55.000Z",
          "Titre": "Shockingly bad service/potential scam!",
          "Contenu": "I purchased one of their products at the start of March. I received an e-mail confirming this and providing me with a tracking number. After a month of waiting without an update, and a tracking number which came up as an \"error\", I began to contact the e-mail address provided in my confirmation. After a month of no reply I discovered this was an entirely incorrect e-mail address which they had given me. I then messaged the address from their site at which point they said they could find no evidence of my order (despite taking my money), once I stated that I could prove it through bank statements they offered to send a replacement package, I assumed this meant the first package got lost so I agreed. Again, no response. After a week I followed up, asking the status of the replacement, to which they responded that they could not send it to me until the first package had been returned to them. At this point I demanded a refund which I did eventually get, however, when I initially checked out I noticed an option for postal insurance claiming that Tranya wouldn't be liable for lost products otherwise. Judging by this transaction I would assume this is a common scam they pull to avoid actually sending any products out."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Kian Powell",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T19:25:59.000Z",
          "Titre": "Terrible company",
          "Contenu": "Do no trust some of these 5 star reviews, ordered and received my Tranya S2 smartwatch less than a month ago, build quality is terrible and I can't even use it now because the magnets in the back of the watch where the charger connects have popped out and stick to the charging cable making it unusable, so I did what anyone would do and sent an email asking for a refund for this defective product. They had the audacity to send me an email telling me to leave a 5 star review on here to be able to receive a replacement, I don't want a replacement, I want a refund, dishonesty and lies are not what future customers should be looking at when looking for new products. I will not be buying from them again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kurt Laird",
          "Nb_Reviews": 1,
          "Date": "2022-11-18T08:01:09.000Z",
          "Titre": "Beware:  Warranty?  Don't try to use it!",
          "Contenu": "I have attempted to get a warranty replacement for my Tranya 530 earbuds for \"over two months\". I first looked online and attempted numerous times to get the 2 earbuds to sync but to no avail. After an initial response from Tranya (they needed an order #) and my response to that request I received no communication until I repeatedly asked them for assistance with my warranty request.  They then asked for photos or videos.  These are earbuds; photos and videos for earbuds that did not sync?  I asked them just what I was supposed to photo or video as they did not have any apparent physical damage or deformity.I then sent them an email explaining that two months was ridiculous and that I was going to start posting online about their apparent failed warranty process.  The email below from Tranya is apparently their attempt to get me to tell you how good everything was.  Well it wasn't and it is not worth it to me to misrepresent this experience to other potential buyers. I enjoyed the earbuds (for just over 6 months) but the non-existent warranty process would keep me from purchasing any product from Tranya in the future.  G*****s (*******@tranya ***)To:you DetailsHi,Sorry for your inconvenience.Please give us a five-star review on this website and provide us with screenshots.h****://***trustpilot com/review/www tranya comNote that it is required to leave a good review on the site, not a bad review of the product. Otherwise it cannot pass.An then we will issue a new one for youVery grateful to you."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hartman  Caviedes",
          "Nb_Reviews": 1,
          "Date": "2022-08-02T08:42:48.000Z",
          "Titre": "What happen with my order…",
          "Contenu": "I do not have information on when my order will arrive, do not show up for any reason, it has not arrived"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andrew Noel",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T16:50:20.000Z",
          "Titre": "Headphones suck!!!",
          "Contenu": "Headphones are straight garbage and break from nothing, don’t waste money on cheap Chinese garbage plastic!!!"
        },
        {
          "Note": 1,
          "Lieu": "TR",
          "Pseudo": "Cemal Bulbul",
          "Nb_Reviews": 1,
          "Date": "2022-08-10T10:57:06.000Z",
          "Titre": "Touchscreen not working properly.",
          "Contenu": "I did not expect that product is not working properly.Just bad idea and bad experience."
        },
        {
          "Note": 1,
          "Lieu": "UA",
          "Pseudo": "Сергей Кашилов",
          "Nb_Reviews": 6,
          "Date": "2022-11-01T10:40:58.000Z",
          "Titre": "The tracking tool for my parcel is…",
          "Contenu": "The tracking tool for my parcel is still showing - there's no such a tracking number or supplier hasn't added you tracking number into the system - whilst I am being asked now to share my review on product, which I am not sure when can be even delivered, if delivered.."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kayla Hoover",
          "Nb_Reviews": 1,
          "Date": "2020-05-28T12:04:13.000Z",
          "Titre": "Scam?",
          "Contenu": "They literally just didn't send it and aren't responding after almost a month."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Herson Monterrosa",
          "Nb_Reviews": 1,
          "Date": "2022-08-01T14:06:35.000Z",
          "Titre": "no good cality",
          "Contenu": "Not even a week has passed since I bought them and the left side no longer sounds correctly"
        },
        {
          "Note": 1,
          "Lieu": "SA",
          "Pseudo": "Mohammad Husseen",
          "Nb_Reviews": 2,
          "Date": "2022-10-31T13:45:03.000Z",
          "Titre": "Bad for shipping i don't receive my…",
          "Contenu": "Bad for shipping i don't receive my order"
        },
        {
          "Note": 1,
          "Lieu": "EG",
          "Pseudo": "Islam Elawadly",
          "Nb_Reviews": 1,
          "Date": "2022-11-01T04:03:43.000Z",
          "Titre": "I didn’t get my package till now",
          "Contenu": "I didn’t get my package till now ! And still had no idea will it get here or not"
        },
        {
          "Note": 1,
          "Lieu": "AZ",
          "Pseudo": "Irada Masimova",
          "Nb_Reviews": 1,
          "Date": "2022-08-13T07:51:06.000Z",
          "Titre": "The stuff didn't  come yet",
          "Contenu": "The stuff didn't  come yet, it's  been like 4 weeks"
        },
        {
          "Note": 2,
          "Lieu": "EE",
          "Pseudo": "nikita romaikin",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T20:18:25.000Z",
          "Titre": "One headphone just died",
          "Contenu": "One headphone just stopped making any sound at all. No damages were made. Just stopped. Awful quality of the product."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Glen FRASER",
          "Nb_Reviews": 2,
          "Date": "2022-07-07T14:19:05.000Z",
          "Titre": "TRANYA product return service sux.",
          "Contenu": "Yes I like TRANYA, but sadly they have lousy service particularly when there products fail and I need assistance. I recently wrote to TRANYA regarding a pair of expensive earbuds that will no longer sync with each other. After several unsuccessful attempts at contacting TRANYA all I got was silence. TRANYA are bloody hopeless 😩 all you can hope for is that the product continues to work."
        },
        {
          "Note": 2,
          "Lieu": "CH",
          "Pseudo": "Yarrow TV",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T10:18:44.000Z",
          "Titre": "Montre Tranya S2",
          "Contenu": "Good morning,I recently bought a Tranya S2 watch which I received on time but when I received it, the watch did not work.I contacted someone from your site by email, and I was told to write a review on your site so that I could have a return of the watch.thank you for taking the time to read and responding so quickly to email.a beautiful day to you.Cordially"
        },
        {
          "Note": 2,
          "Lieu": "SA",
          "Pseudo": "Mohammed Alsierafy",
          "Nb_Reviews": 1,
          "Date": "2022-11-13T05:27:07.000Z",
          "Titre": "Still not yet received my AirPods"
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "Love is Loveria",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T06:51:37.000Z",
          "Titre": "Your new earphone are good.but i was…",
          "Contenu": "Your new earphone are good.but i was buy 4 earphone and you are give 2 earphone are old .i complain you thats after you are change this earphone but you are give same earphone.dont have good sound quality, only work 3-4 hours work,after finish charge ..so bad experience for your company.."
        },
        {
          "Note": 3,
          "Lieu": "LT",
          "Pseudo": "Ray",
          "Nb_Reviews": 4,
          "Date": "2021-01-09T15:38:45.000Z",
          "Titre": "Overpriced producs",
          "Contenu": "Do not buy earphones from them for the full price, just search for any promotion code or subscribe to a newsletter and wait for the code, because you can get 50% discount with it. Otherwise those earphones are just not worth their price. To be more specific, I have bought Tranya T10, which was the most expensive product in their shop at that time. Bass is amazing, however they lack highs and mids. Bass is suppressing higher frequencies, so it is not what would you expect from the earphones which usually cost ~80$, but for 40$ - yeah, it is okay. Some rewievers say that highs and mids are very sharp, I can't believe them, maybe those reviews are just bought. I give 3 stars of 5 not because I have experienced something unpleasant with the website or shipping, but because I just want to let people know that their items are overpriced."
        },
        {
          "Note": 3,
          "Lieu": "TR",
          "Pseudo": "Qasem Alwadiya",
          "Nb_Reviews": 1,
          "Date": "2022-11-13T00:35:50.000Z",
          "Titre": "The Airpods caused me a pain in my ear…",
          "Contenu": "The Airpods caused me a pain in my ear mybe because it hasn't plastic headStill I'm lost when I need to stop the music can't click on stop button I keep searching with my fingerAnd more but this my experience with til now"
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "Daan",
          "Nb_Reviews": 10,
          "Date": "2022-07-13T12:00:57.000Z",
          "Titre": "I only received one earbud",
          "Contenu": "I only received one earbud, so I contacted them multiple times. Got no e-mails back... Now I have lost about €50,- for just one earphone and I can't get into contact with them. Don't buy anything in their shop!Edit: After a while I received an email that I could return the earbud and case to a chinese adress, and so I did. After a while I received both the refund for the earbuds and the refund for the returnig costs! Thanks for the service"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Morgan Gaither",
          "Nb_Reviews": 1,
          "Date": "2022-08-16T03:23:12.000Z",
          "Titre": "Im unsatisfied with my service.",
          "Contenu": "my package took so long, and arrived scratched"
        },
        {
          "Note": 3,
          "Lieu": "AE",
          "Pseudo": "moetallica",
          "Nb_Reviews": 10,
          "Date": "2022-11-05T15:38:12.000Z",
          "Titre": "Great sound but it need to have a…",
          "Contenu": "Great sound but it need to have a better grip on the ears"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Caitlin Powell",
          "Nb_Reviews": 1,
          "Date": "2022-11-24T06:07:20.000Z",
          "Titre": "Great earbuds",
          "Contenu": "Great earbuds, very comfortable and has earpieces for three sizes, good sound and bluetooth connection is great. Would recommend to anyone looking to try a new brand of earbuds."
        },
        {
          "Note": 4,
          "Lieu": "MD",
          "Pseudo": "Andrei Macovei",
          "Nb_Reviews": 1,
          "Date": "2022-11-18T06:02:06.000Z",
          "Titre": "They are almost great",
          "Contenu": "They are great, the sound is great but if i listen ti a song where a lot is happening, this product starts making like a smoke sound.These also happens when i listen tobmusic on ,,samsung music,, on youtube it is awesome, no problems, except the ,,owerhelming,, one."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Amelia",
          "Nb_Reviews": 1,
          "Date": "2022-11-10T18:30:05.000Z",
          "Titre": "Good products that works",
          "Contenu": "Good products that works. Also great service and advice of what you should do when something isnt working"
        },
        {
          "Note": 4,
          "Lieu": "EG",
          "Pseudo": "Mohamed Elshalaby",
          "Nb_Reviews": 2,
          "Date": "2022-11-05T11:57:55.000Z",
          "Titre": "Good",
          "Contenu": "Good : Easy payment Bad: the product didnt arrived yet till now"
        },
        {
          "Note": 4,
          "Lieu": "SA",
          "Pseudo": "HAMDAN ALSHEHRI",
          "Nb_Reviews": 2,
          "Date": "2022-11-22T06:46:40.000Z",
          "Titre": "Good👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "James D",
          "Nb_Reviews": 1,
          "Date": "2022-08-15T02:05:47.000Z",
          "Titre": "Very good customer service",
          "Contenu": "Very good customer service. I had an issue with my pair and they offered me a new pair or my money back. Sound is very good"
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "JULIO CEZAR Cezar",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T03:17:52.000Z",
          "Titre": "Exceptional costumer service",
          "Contenu": "Simply phenomenal customer service. I bought a product that after a while was defective and they sent me a new one (which I'm waiting for it to arrive). I intend to purchase new products from your products in the future.Note: Only crazy people don't give the company 5 stars lol"
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Thais Noveletto",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T00:04:42.000Z",
          "Titre": "The customer support is faster than I've ever seen.",
          "Contenu": "I found your support to be super fast and efficient. Perhaps investing in marketing for the Brazilian audience would be interesting; we are not accustomed to this type of feedback from companies here."
        },
        {
          "Note": 5,
          "Lieu": "RS",
          "Pseudo": "Uros Prvanovic",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T12:36:52.000Z",
          "Titre": "GREAT company!",
          "Contenu": "I bought several products from them and all were amazing! Had a problem with one pair and after a few mails, they've sent me a replacement pair. Great products, amazing company!"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Enrica",
          "Nb_Reviews": 5,
          "Date": "2023-11-28T11:14:42.000Z",
          "Titre": "Great balance price vs quality",
          "Contenu": "Great balance price vs quality. The produc is really good. The sound is clear and the battery is lasting as expected. The recharge is quick. Very good experience!"
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Jhon Felip",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T13:06:46.000Z",
          "Titre": "Very great Support",
          "Contenu": "One earbud just died and the support was amazing!One earphone stop of reproduce any sound, so i just talk with the support and they´re gonna send me a new one"
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Tete Gold Tech",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T04:16:15.000Z",
          "Titre": "Tranya Nova EARBUDS are AWESOME!",
          "Contenu": "Tranya Nova EARBUDS are AWESOME!I tested the new headphones and really liked the results they delivered. The noise cancellation is very good, it has a game mode, and you can also have a clean musical experience with powerful bass"
        },
        {
          "Note": 5,
          "Lieu": "JO",
          "Pseudo": "Kutada Rafiq",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T18:07:52.000Z",
          "Titre": "Honestly, the first thing is the best customer service, and as for the product, I highly recommend it"
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Alexandru Liciu",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T09:00:50.000Z",
          "Titre": "Tranya awesome earbuds and amazing support",
          "Contenu": "I purchased a pair of earbuds and a smartwatch, I was actually really impressed and happy about the product, honestly I was not expecting for them to be so fine. After some time, one of the earbuds started to be considerably quieter so I have reached the support via email where the support assisted me in a truly fair way and we managed to solve this as expected. So far so good, the product is really nice and I love the earbuds so from my end, I'm glad that we managed to solve this so fast."
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "神山翔",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T15:10:17.000Z",
          "Titre": "S2 smartwatch is the best",
          "Contenu": "I've purchased an S2 smartwatch, which is definitely the best smartwatch I've ever encountered. It has every function you need at a very reasonable price. The display is bright and easy to recognize. The battery lasts nearly a week. In addition, it's waterproof and tough enough to accompany all your workouts. It's must-buy item, no doubt."
        },
        {
          "Note": 5,
          "Lieu": "DO",
          "Pseudo": "Fabio Villalona",
          "Nb_Reviews": 1,
          "Date": "2022-07-12T07:08:27.000Z",
          "Titre": "Tranya M10B are great!!",
          "Contenu": "Tranya M10B are great!!! ENGI start to use today for walking and work great, successfully tracking and the package was in great conditions! audio great! This review is coming from someone who didn't like this kind of earbuds because they kept falling out of my ears but I decided to give these a try and they fit my ears well and don't fall outESPLos empece a usar hoy para mis caminatas y funcionan perfectamente, el tracking fue exitoso y el paquete en buenas condiciones! el audio genial! esta reseña viene de alguien que no le gustaba este tipo de audifonos porque siempre se caían de mis orejas pero decidi darles una oportunidad a estos y se ajustan bien a mis orejas y no se caen"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Sonia Di Lallo",
          "Nb_Reviews": 25,
          "Date": "2023-07-12T08:30:07.000Z",
          "Titre": "Great customer service.",
          "Contenu": "Great customer service.I bought those wonderful earbuds. Being from China I would have expected a really long delivery time to Italy. Instead they got here very quickly and they were great, the sound is very clear the connection gets immediately. But the thing that really impressed me was the customer service. I had a technical issue and they solved it almost immediately. I really recommend buying directly from them"
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2023-01-21T11:44:27.000Z",
          "Titre": "Already several years with Tranya…",
          "Contenu": "Already several years with Tranya products and they are great. Well done earbuds with wonderfull sound and a kickass bass that just got better with every new earbud release. Bass boost mode in a new models is a peace of art.Tranya team will always ready to give a best byer experience and i know they can be trusted.Bottom line - try it...you won't be disappointed"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Manhor",
          "Nb_Reviews": 1,
          "Date": "2022-08-09T19:04:47.000Z",
          "Titre": "Long running and featured",
          "Contenu": "Tranya Smart Watch is looking smooth on hand and feels lighter, it has all the basic features like sports tracking, sleep tracking, heart rate and blood oxygen monitoring. The battery life stays more than a week for me. App GloryFit is easy to setup and showing related notifications on my android phone. I can customize more like different watch faces, date display with in this price range watch. I recommend this watch in this budget."
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Jurie",
          "Nb_Reviews": 2,
          "Date": "2023-02-13T06:15:12.000Z",
          "Titre": "Some of the best ever",
          "Contenu": "Over the last 3 years I had numerous amount earbuds and headphones, linked with electronic equalizers to improve the sound quality. Never had i the sound and confort that left me satisfied, till I found Tranya ..... no equalizers needed, sound reproduction is crisp, clear, midrange specially on the T10 B is wow, bass on the T20 is if your in a cinema."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Murray",
          "Nb_Reviews": 1,
          "Date": "2022-08-09T10:32:37.000Z",
          "Titre": "Great Headphones !",
          "Contenu": "I purchased a pair of Tranya headphones on Amazon a few months ago for listening to audio books and music around the house and during walks as opposed to another set of AirPods. These are AMAZING, such a better value over AirPods, great sound, very crisp, much better battery life as well. I’d recommend these as an option to anyone!"
        },
        {
          "Note": 5,
          "Lieu": "TH",
          "Pseudo": "BOB dob",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T10:20:08.000Z",
          "Titre": "I love using my Tranya T10Bs",
          "Contenu": "I really loved using my Tranya T10Bs, they had great bass and an amazing battery life, even better than advertised). Also, there was a small issue with sound being a bit uneven but I was offered a free replacement and so can also say that customer experience was amazing too!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank Bongiovanni",
          "Nb_Reviews": 1,
          "Date": "2022-08-17T21:46:40.000Z",
          "Titre": "Tranya products and Customer Service",
          "Contenu": "I use Tranya wireless earbuds and their Fitness watch.  Both are excellent products and their prices are far less than comparable products from other companies. Product support and general questions are online only but, it's very good and timely.  This Company is very customer friendly and considerate.  Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "anonymous",
          "Nb_Reviews": 2,
          "Date": "2022-10-11T15:36:38.000Z",
          "Titre": "Tranya M10 Earbuds",
          "Contenu": "I have been using the M10 earbuds for the past year or so and I couldn't be happier with them. The sound quality from low bass to high treble is much better than any \"air pods\" style earbud I've ever tried. The only issue I have is that the Bluetooth audio codec is a slightly older style (AAC) that can't make full use of the more modern technologies like Qualcomm aptx audio (higher sample rate, more bits per sample), however they do still work just fine with my phone set to that audio codec. Having said that, the sound quality is still fantastic so I'm not sure if I'd know a difference even if I did switch it.Their customer support is also top notch with quick response times and favourable outcomes"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brendan",
          "Nb_Reviews": 1,
          "Date": "2022-10-14T03:25:08.000Z",
          "Titre": "Love this company and their products",
          "Contenu": "Tanya is excellent! I've had several of their headphones, smartwatch and wireless charger - loved them all! They make really great products at an awesome price point. On top of that, their customer service is top notch. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryan Southerton",
          "Nb_Reviews": 1,
          "Date": "2022-08-10T06:19:18.000Z",
          "Titre": "Great Company!",
          "Contenu": "I’ve been a customer of Tranya for approximately 7 years now. Every time they put out a product I’m interested. There are few that can keep up with modern technology and maintain an affordable price.  Most of my friends didn’t believe me until they tried their products themselves that they are as good if not better than the leading brands at about 1/3 the cost. I owe a lot to this company because they have gotten me through so many hours of work with their earbuds and have always given excellent customer service."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Yatin",
          "Nb_Reviews": 5,
          "Date": "2022-04-22T10:14:40.658Z",
          "Titre": "Amazing TWS !!!!!",
          "Contenu": "I recently purchased tranya t10 pro wireless earbuds to be honest these are amazing , great in sound , comes with good battery backup. The case of t10 pro is somewhat smaller which is good and perfectly fits in hand. Highly recommended if you looking for TWS in affordable price.."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tania Tizz",
          "Nb_Reviews": 2,
          "Date": "2022-08-05T07:13:07.000Z",
          "Titre": "Tranya earbuds are it for earbuds!!",
          "Contenu": "Tranya earbuds are amazing. Especially for the price! So many stylish options to choose from to find the exact right pair for you whether it be sound or fit! I own a pair of M10's, T10's, T20's, and the Tranya watch. All are really reliable and the time I did have an issue with a pair of earbuds, Tranya service and support departments both led me through to a fixable resolution, and replaced them when I couldn't find a fix. Very grateful to this company and forever a loyal customer!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "HeathCliff Rothman",
          "Nb_Reviews": 5,
          "Date": "2022-08-09T06:10:44.000Z",
          "Titre": "Tranya's products and service are quite Superior",
          "Contenu": "Firstly, Tranya's T30 are my favorite earbuds ever. I have a very discriminating ear, and I have been impressed with the quality, bass treble and voice. Parenthetically, I also find the customer service to be quick and responsive. My second pair of earbuds are the m10. I love the button feature on those and find them extremely comfortable. For a brand that is not well known, their products are quite Superior."
        },
        {
          "Note": 5,
          "Lieu": "CN",
          "Pseudo": "school bonbon",
          "Nb_Reviews": 1,
          "Date": "2019-05-27T08:41:34.000Z",
          "Titre": "Excellent sound quality cheaper alternative to Apple’s expensive Airpods",
          "Contenu": "Excellent sound quality! For me, these truly wireless earphones are a PERFECT cheaper alternative to Apple’s expensive Airpods. Lightweight, very comfortable overall. Calls went well with the built-in microphone. It can be used for listening to music and phone call. Works very well. Overall, I really like them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin Lincoln",
          "Nb_Reviews": 4,
          "Date": "2022-08-15T15:39:39.000Z",
          "Titre": "Great service and one of the best 'bang…",
          "Contenu": "Great service and one of the best 'bang for the buck' companies out there.At these prices, I can't believe the top notch quality.I use the M10's for working out because they have actual button that are easy to use with gloves and are not easy to accidentally active.T30's for TV watching is excellent and pair very quickly with our AppleTV.I can't recommend the company enough."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gary Bennett",
          "Nb_Reviews": 1,
          "Date": "2022-08-09T06:44:39.000Z",
          "Titre": "I have used Tranya earbuds for years…",
          "Contenu": "I have used Tranya earbuds for years (my wife bought me some T3s). I've been impressed with the quality for price, both in sound and battery life. The only problem I've had was with the lid breaking on the T3 and T10 cases, however the customer support has always gotten me a new case IMMEDIATELY. At this point, I'm using the T20s and am very happy with them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rachel Browning",
          "Nb_Reviews": 3,
          "Date": "2022-08-11T23:42:47.000Z",
          "Titre": "Nothing but good experiences",
          "Contenu": "I’ve had nothing but good experiences with Tranya. I’ve purchased at least three ear buds, and two smart watches. Their customer service is excellent, they often check in afterwards, and all products have worked great."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Malika Hoekx",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T23:12:24.000Z",
          "Titre": "I previously owned the Tranya Rimor…",
          "Contenu": "I previously owned the Tranya Rimor earbuds and was very happy with them for 3 years. Recently one earbud stopped connecting to the charging case so I decided to replace them with Tranya T10. Very good sound quality and battery life."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Hart",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T05:26:55.000Z",
          "Titre": "Great products. Great prices.",
          "Contenu": "By far the best products and priced well under the huge name companies. Customer service is exceptional. My package was lost in shipment. No questions asked, they sent me another pair right away. I own several Tranya Products and I love them all. I have T10 earbuds I've used every day for a long time. Still work great. My newest are the X3 earbuds. These are my new favorite. I'm a customer for life. They didn't ask me to review them until I messaged them first saying how much I love Tranya and the X3's. They said that's great. Could you please review and the link."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jesus Diaz",
          "Nb_Reviews": 1,
          "Date": "2022-11-14T10:09:59.000Z",
          "Titre": "I gotta say all the earbuds I ever…",
          "Contenu": "I gotta say all the earbuds I ever tried for the past 10 years were not good but these are the best I ever tried and the sound and bass is awesome and the game is from 1 threw 10 I give it a 7.5 it just a slightly gotta be better game mode and plus one the earbuds fit really good, won’t fall out.."
        },
        {
          "Note": 5,
          "Lieu": "EG",
          "Pseudo": "Abd El-Rahman Sayed",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T10:29:30.000Z",
          "Titre": "Fabulous",
          "Contenu": "Absolute quality but designed different I couldn't find case for it but overall it is a treasure"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phoebe",
          "Nb_Reviews": 1,
          "Date": "2023-01-29T15:47:19.000Z",
          "Titre": "Good Service",
          "Contenu": "I received my Tranya earbuds T10B in the mail very fast and found this brand through Sweatcoins app. When I received my earbuds, the packaging was good and no missing items. After I have charged the base left side earbuds would not turn on. When the left earbud is taken off and put back on the base it is not lighting up. Right side is working properly. I contacted customer service about exchange/refund and they were very helpful. The customer service informed me that in order for me to receive a new operable earbuds. I will need to write a good review on here and send a screenshot of my review back to them."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Daisy",
          "Nb_Reviews": 10,
          "Date": "2023-05-13T04:41:18.000Z",
          "Titre": "Smart watch S2 replacement",
          "Contenu": "I ordered a smart watch S2 for my husband, the charging doesn't work anymore because the magnets at the back came off and he didn't use that much (in less than one month of use they came off). I contacted them by sending an email about it including pictures and video. No response for two weeks and then I contacted through Facebook and got a response. They were very helpful and offered to send a new one for me. They provided me quickly with the tracking number too so I can keep track of the parcel. So in case you don't get a response by email, then contact through Facebook messenger can help. The smart watch comes with a year guarantee if you register the product which my husband did. Let's hope I was just unlucky with the old one. Anyway the company didn't make a hassle and send a new one straight away, so you can rely on them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dymonek Jones",
          "Nb_Reviews": 1,
          "Date": "2022-10-08T07:11:43.000Z",
          "Titre": "Before I found Tranya",
          "Contenu": "Before I found Tranya, I got the earbuds for a nice discount through my walking app called sweatcoin. In truth I really needed another bluetooth device. And, its astonishing that I was able to come across Tranya. All their products are great! The ones I got are T10 B earbuds. Plus an advantage I love is that these are water proof. I was really excited to recieve them and couldn't wait to use them."
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Sarah  Braviceanu",
          "Nb_Reviews": 2,
          "Date": "2022-07-07T13:11:03.000Z",
          "Titre": "Thank you for sending me the mint green…",
          "Contenu": "Thank you for sending me the mint green color even if this wasn’t in the official sweatcoin offer. It’s a surprise that truly made my day, and the color is totally enchanting and unique. When I saw that the green isn’t in the offer I cancelled the order and ordered again the black ones but someone from your team maybe saw I wanted those and sent me the pods I liked. Truly master craftsmen, very fast delivery, love the sound! Thank you so much!! They’ll definitely change my life as I will become more active being capable to listen to music when I go out. Thank you!!"
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "eucii",
          "Nb_Reviews": 1,
          "Date": "2022-09-05T07:47:35.000Z",
          "Titre": "Overall great",
          "Contenu": "Was able to get a T10 Pro with a 50% discount. Had it arrived after a week and despite one side not working, was able to get support from their support team to get a new replacement. The audio quality sounds great despite only working on one side. Can't wait to receive the replacement."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Gollakner",
          "Nb_Reviews": 1,
          "Date": "2022-08-11T21:05:56.000Z",
          "Titre": "Great Company, Great Products",
          "Contenu": "I have had nothing but great experiences working with Tranya.  All of the products I have tested (Ear buds and smart watches are affordable, great quality, and durable.  I would highly recommend anything from Tranya."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Adam & Donna Francis",
          "Nb_Reviews": 3,
          "Date": "2022-09-29T05:49:47.000Z",
          "Titre": "I'm very happy with tranya",
          "Contenu": "I'm quite happy with my smartwatch and I have had an issue with the watch but when I contacted their customer service team to see what options I had. I have had the best experience with the customer service team and they have been very helpful and prompt response to my emails and I am very satisfied with the outcome with the issue I had. I would highly recommend tranya"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Sonia Di Lallo",
          "Nb_Reviews": 25,
          "Date": "2023-07-13T10:08:13.000Z",
          "Titre": "Quality of sound excellent",
          "Contenu": "Quality of sound excellentGreat quality of sound in such small earbuds. I bought the F4. They connect immediately and you are soon immerse in a world of music. And good quality of calls as well"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "apratirath moulick",
          "Nb_Reviews": 1,
          "Date": "2022-08-15T09:51:56.000Z",
          "Titre": "I just purchased a Tranya T10 pro grey…",
          "Contenu": "I just purchased a Tranya T10 pro grey earbuds two days back and I am really really satisfied with the product, the sound quality, bass, the looks and the features are just awesome! Also thanks to Sweatcoin app which was where I came to know about Tranya! Love it!!!"
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Abhay Singh",
          "Nb_Reviews": 2,
          "Date": "2023-04-03T08:30:04.000Z",
          "Titre": "Tranya is very good company and having…",
          "Contenu": "Tranya is very good company and having amazing products. Recently i bought earphones and it got delivered on time with great quality. I would like to recommend to everyone to go for Tranya products."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jason",
          "Nb_Reviews": 3,
          "Date": "2023-08-24T20:27:36.000Z",
          "Titre": "Good quality watch especially like the…",
          "Contenu": "Good quality watch especially like the blood pressure and blood oxygen tools.Plenty of different faces to choose from too"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dennis Williams",
          "Nb_Reviews": 1,
          "Date": "2022-08-09T14:03:05.000Z",
          "Titre": "great smartwatch",
          "Contenu": "I recently got the Tranya Smartwatch and was really blown away by the features for the price. Heartrate monitoring, SP02, and can still read text messages on it. Battery life is great and I easily go 5 days between charges. For $40 it's a real bargain."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "kaeli andrews",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T18:30:48.000Z",
          "Titre": "They replaces my broken headphones in…",
          "Contenu": "They replaces my broken headphones in such a short amount of time and really heard me out. Thank you!!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Attitude Sleepy",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T16:29:51.000Z",
          "Titre": "The ear phones are truly amazing",
          "Contenu": "The ear phones are truly amazing. The sound clarity is soo good. It really has anc function. It was my best buddy during my workouts to stop other sounds. It was also good for me while studying as it has noice cancellation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RRR",
          "Nb_Reviews": 3,
          "Date": "2022-09-12T06:57:29.000Z",
          "Titre": "Shopped multiple times, love the company",
          "Contenu": "I have purchased from Tranya multiple times, and have dealt with them directly and through Amazon. I have always had great experiences with their products and customer service. I recommend them 100%."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "King Stewie",
          "Nb_Reviews": 1,
          "Date": "2022-08-09T12:06:53.000Z",
          "Titre": "NEVER DISAPPOINTS!",
          "Contenu": "I’ve used several Tranya products ,and love their products ! They are equally good and last just like other top brands but a fraction of the price. I’ve had small issues with a couple products and they were there to correct it immediately! I highly recommend this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason Rice",
          "Nb_Reviews": 2,
          "Date": "2022-08-02T13:51:53.000Z",
          "Titre": "The tranya products are incredible",
          "Contenu": "The tranya products are incredible. I have used 3 of their headphones. The quality of sound that their headphones produce is amazing. The battery life on the charging case last a long time. The customer service is fast and helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2022-10-09T06:28:55.000Z",
          "Titre": "Tranya has great customer service and…",
          "Contenu": "Tranya has great customer service and their products work great. I particularly love the wireless earbuds because they never fall out of your ears even when running or working out."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "paul ince",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T23:52:29.000Z",
          "Titre": "TranyaGo smartwatch was much more than I expected for the price",
          "Contenu": "I really liked the TranyaGo smartwatch. The small profile and light weight are great. Battery life was up to a week. The fitness apps worked really well and were easy to use. Postage/processing times from the tranya website were really quick. Very satisfied overall"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Glynis Dangel",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T03:56:29.000Z",
          "Titre": "Fast customer service",
          "Contenu": "Customer support is fairly fast and responsive. I’ve been purchasing Tranya products for some time now and I’m especially a fan of the earphones. Good for the price products!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Noam Cohen",
          "Nb_Reviews": 2,
          "Date": "2022-08-05T06:10:17.000Z",
          "Titre": "Love Tranya products",
          "Contenu": "Love Tranya products, their earbuds are great design and have a deep sound. Their watch is nice and slick.And their customer service is awesome - quick replies and very accommodating."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LaughWithme",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T20:53:44.000Z",
          "Titre": "Well they ain’t lie",
          "Contenu": "Amazing company , watch was broken , not at fault of my own and they sent one for free honoring their agreement."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RRR",
          "Nb_Reviews": 3,
          "Date": "2022-08-02T10:44:30.000Z",
          "Titre": "Repeat customer. Will buy Tranya again.",
          "Contenu": "I have purchased from Tranya a few times, and their products have been consistently of high quality, especially considering the affordability. I had to contact customer service once about a question regarding my purchase, and they were very attentive and assisted me with all my needs. When I need earbuds, Tranya will be the ones I go to first."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "wayne sudama",
          "Nb_Reviews": 2,
          "Date": "2023-06-26T18:46:07.000Z",
          "Titre": "Awesome watch",
          "Contenu": "Excellent watch. I wasn't expecting much due to the low cost but I am amazed at how well built it is and the amount of features it has. I have no doubt it will last for a very long time. Very fast delivery too. I highly recommend this watch and company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marc",
          "Nb_Reviews": 1,
          "Date": "2022-08-10T03:43:49.000Z",
          "Titre": "Tranya Earbuds--Great Sounding!",
          "Contenu": "Tranya earbuds (T10s and M10s) have been awesome in comfort, durability, as well as great sounding. For the price, not a better value in earbuds...highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "R.L. DeFalco",
          "Nb_Reviews": 1,
          "Date": "2022-08-09T12:55:57.000Z",
          "Titre": "I have yet to be disappointed by a…",
          "Contenu": "I have yet to be disappointed by a Tranya product. I have three different models of earbuds and their watch - all are comfortable, function well and offer an amazing value!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Watson",
          "Nb_Reviews": 2,
          "Date": "2022-11-07T12:32:25.000Z",
          "Titre": "Good customer service",
          "Contenu": "Had an earbud that didn't work but the customer service is fantastic and took care of it right away! They sound great would definitely buy again!"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Daan",
          "Nb_Reviews": 10,
          "Date": "2021-05-18T08:57:53.000Z",
          "Titre": "After sending some mails, I got great service!",
          "Contenu": "Sadly, I received only one earbud. After some emails I got a reaction that I should send it back to their adress (in China). So I did. After two weeks I got a reaction that they received the package and they refunded the costs of the earbuds and the shipping costs. I am very satisfied with the way they have resolved this."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J D",
          "Nb_Reviews": 5,
          "Date": "2022-10-13T19:23:51.000Z",
          "Titre": "Very pleased!",
          "Contenu": "Very good, high quality products.  Highly competitive with other products on the market.  From sound quality to long lasting battery, great overall investment!"
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "Gridimo",
          "Nb_Reviews": 2,
          "Date": "2023-03-29T14:00:34.000Z",
          "Titre": "Tranya is a very reliable company",
          "Contenu": "Tranya is a very reliable company and i love their products. I had T40 for 3 years and because i was very happy i bought X1. They are the best for lessening music while i am running.  I recommend Tranya products."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Deb S",
          "Nb_Reviews": 16,
          "Date": "2020-10-12T20:03:30.000Z",
          "Titre": "Received today & they are fantastic",
          "Contenu": "Received today & they are fantastic, far better than the plug in earphones, I work in a warehouse son these are really handy for moving about more!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Big Jukka",
          "Nb_Reviews": 3,
          "Date": "2022-08-09T13:48:05.000Z",
          "Titre": "Tranya is the only way to go!",
          "Contenu": "Tranya earbuds are the only way to go for me. You won’t find a better, quality pair of earbuds, especially for the price. I’m a basshead and these little guys pump out a balanced beefy sound! No need to consider any of the big name brands."
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Imteeaz Goolamhossen",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T08:20:35.000Z",
          "Titre": "Great S2 smartwatch",
          "Contenu": "The S2 smartwatch is great to use, light on the wrist, easy to read outdoor, and track my physical activities as well."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mohammed Babakir",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T10:35:15.000Z",
          "Titre": "The Tranya S2 watches surpassed my…",
          "Contenu": "The Tranya S2 watches surpassed my expectations, with fast delivery to the UK despite being shipped from China. The battery life is exceptional, lasting several days without needing a recharge. However, what truly impressed me was their outstanding customer service. When I encountered a technical issue, they promptly resolved it, showcasing their commitment to customer satisfaction. I highly recommend purchasing directly from them for a top-notch experience."
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Arjun Rijal",
          "Nb_Reviews": 1,
          "Date": "2022-09-25T13:20:50.000Z",
          "Titre": "Excellence service and attention",
          "Contenu": "Excellence service and attentionExcellence service and attention and on top of that the product was even better than expected. special thanks gladys he is very friendly  thanks A lot I am appreciate"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shaq",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T15:21:03.000Z",
          "Titre": "5 stars",
          "Contenu": "The watch has a lot of apps the follow almost any workout or activity that you might be doing"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "B. Peterson",
          "Nb_Reviews": 1,
          "Date": "2022-10-11T12:47:44.000Z",
          "Titre": "Tranya experience",
          "Contenu": "I've had Tranya in the past and have been very satisfied. Though I originally had an issue with the smartwatch, I contacted the service department and they quickly resolved my issue."
        },
        {
          "Note": 5,
          "Lieu": "CY",
          "Pseudo": "Hadi Mounajed",
          "Nb_Reviews": 2,
          "Date": "2023-07-14T12:41:13.000Z",
          "Titre": "Good customer service",
          "Contenu": "I had a problem with one headphone that stopped working and they offered me to replace it at their expense."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathleen",
          "Nb_Reviews": 1,
          "Date": "2023-02-02T05:30:27.000Z",
          "Titre": "Nice watch",
          "Contenu": "Nice watch I received the TranyaGo watch in the mail very fast. I found this watch the through Sweatcoins app and it worked until it stopped. Customer service will honor the warranty."
        },
        {
          "Note": 5,
          "Lieu": "EG",
          "Pseudo": "Islam Ahmed",
          "Nb_Reviews": 1,
          "Date": "2023-01-09T09:46:56.000Z",
          "Titre": "Tranya t 10 pro is very good and stable.",
          "Contenu": "Tranya t 10 pro is very good and stable, water proof, clean and loud sound, and it doesn't fall easily from my ears."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "preet L",
          "Nb_Reviews": 3,
          "Date": "2022-12-10T00:19:19.000Z",
          "Titre": "These are my favourite headsets because…",
          "Contenu": "These are my favourite headsets because of sound quality and battery life. I always keep my headsets with me. Thanks Tranya."
        },
        {
          "Note": 5,
          "Lieu": "MY",
          "Pseudo": "arif yusoff",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T08:19:06.000Z",
          "Titre": "good service!!"
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Consumer",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T18:16:54.000Z",
          "Titre": "Very good sound",
          "Contenu": "Very good sound, adaptable in ears Very good as well!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Nathan Richards",
          "Nb_Reviews": 1,
          "Date": "2022-12-23T05:07:41.000Z",
          "Titre": "Awesome ear phone",
          "Contenu": "Awesome ear phone. Feel so comfortable and I forget that I have them in. Their customer is really quick and helpful. Defs better than Apple."
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Hasan Huseen",
          "Nb_Reviews": 1,
          "Date": "2022-11-04T13:36:30.000Z",
          "Titre": "fast delivery and very good quality.",
          "Contenu": "fast delivery and very good quality.It's very easy to order on the website.I recommend that everyone should buy this wireless headphone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Oscar Riva",
          "Nb_Reviews": 1,
          "Date": "2022-09-13T13:21:19.000Z",
          "Titre": "Excellent product Tranya F1",
          "Contenu": "The Tranya F1 is outstanding easy to setup, clear sound and easy to carry on, has a good price and the control are so easy and simple.You can setup in with both sides buttons in both earbuds. Is very comfortable and have a good battery lifeI setup with my iPhone and work excellent!! Good choice."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fagunwa Fatunmise",
          "Nb_Reviews": 1,
          "Date": "2022-08-09T05:54:13.000Z",
          "Titre": "I still don’t understand how Tranya…",
          "Contenu": "I still don’t understand how Tranya makes such great earphones for such a great price. I’m never disappointed with the quality of the build or the sound. Great phones!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Cedlocked",
          "Nb_Reviews": 1,
          "Date": "2022-12-19T06:16:46.000Z",
          "Titre": "Amazing Products",
          "Contenu": "Amazing Products! Customer support is very helpful and kind. Tranya Products are very good for a budget and functions like it is described."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Parker Flood",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T05:31:45.000Z",
          "Titre": "Easy warranty claim",
          "Contenu": "Quick responses to my warranty claim, the tranya customer service took care of my claim with no issue"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KJOC",
          "Nb_Reviews": 1,
          "Date": "2022-08-09T13:13:00.000Z",
          "Titre": "Good quality at a good price",
          "Contenu": "I've used many of the Tranya Bluetooth earbuds over the years, and for the cost, you can't beat the sound quality and battery life."
        },
        {
          "Note": 5,
          "Lieu": "BG",
          "Pseudo": "Gosho Penchev",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T08:23:53.000Z",
          "Titre": "Recommend",
          "Contenu": "The quality of the products is very good and the price is reasonable. Support team answers quite fast and is understanding and helpful!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Michael Kojo Oduro",
          "Nb_Reviews": 1,
          "Date": "2023-01-19T12:57:06.000Z",
          "Titre": "Very reliable service",
          "Contenu": "Very reliable service. I made my order from the United Kingdom 🇬🇧 and got to me within a week. I was very happy as it also came with warranty. Love Tranya always."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John G.",
          "Nb_Reviews": 2,
          "Date": "2022-08-09T13:13:46.000Z",
          "Titre": "The Tranya smart watch is a great…",
          "Contenu": "The Tranya smart watch is a great value. It has many features I need for exercise tracking and I like that I can change the watch faces. Only wish they offered a watch face protector."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Neidson Aguiar",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T00:45:28.000Z",
          "Titre": "Excellent quality headphones.",
          "Contenu": "Excellent quality headphones.It's the second one I've had.Great price and arrived quickly.I recommend."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Sara",
          "Nb_Reviews": 1,
          "Date": "2022-07-08T19:37:05.000Z",
          "Titre": "Wonderful",
          "Contenu": "I used to had different brand but once I switched to Tranya. My perception has changed. Wonderful price & product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jesse Hall",
          "Nb_Reviews": 1,
          "Date": "2022-12-21T09:05:32.000Z",
          "Titre": "Tranya products are amazing",
          "Contenu": "Tranya products are amazing! For the price, they are the best earbuds I’ve ever owned. I am always recommending them to friends."
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "山田 めぐみ",
          "Nb_Reviews": 2,
          "Date": "2022-11-14T20:06:00.000Z",
          "Titre": "I did good shopping",
          "Contenu": "I did good shopping. It fits well on the arm and has various operation functions, which is very useful"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Lee Davy",
          "Nb_Reviews": 1,
          "Date": "2023-01-03T11:51:48.000Z",
          "Titre": "Great earbuds for the money",
          "Contenu": "Great earbuds for the money. I have 2 sets of the t20 model. Had an issue with 1 pair after a few months which were replaced by the customer service team. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mimicbeatle",
          "Nb_Reviews": 2,
          "Date": "2022-11-28T03:12:09.000Z",
          "Titre": "Tranya T10Bs",
          "Contenu": "The tranya T10B are probably the best earbuds I've bought, great sound quality and amazing bass."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Eg",
          "Nb_Reviews": 4,
          "Date": "2022-04-18T01:25:36.000Z",
          "Titre": "I really enjoyed using their earbuds…",
          "Contenu": "I really enjoyed using their earbuds bought 2 of them and when I had a problem I was able to contact them and it was resolved."
        },
        {
          "Note": 5,
          "Lieu": "SA",
          "Pseudo": "Ahmed Pasha",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T13:42:48.000Z",
          "Titre": "Tranya S2 Smart Watch at very beginning…",
          "Contenu": "Tranya S2 Smart Watch at very beginning I denied to buy this watch and i saw its features and can’t avoid buying this product Such a good looking light weight optimized features and Delightful quality which difficult to find its kinda Brand im loving it such a nice watch i have ever owned"
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "none",
          "Nb_Reviews": 1,
          "Date": "2022-09-03T12:00:56.000Z",
          "Titre": "cute and reasonable",
          "Contenu": "simple, easy, cute, and reasonablebut it suddenly flapping and disconnecting periodically. great that support team respond timely against issue."
        },
        {
          "Note": 5,
          "Lieu": "SA",
          "Pseudo": "Mohammad Husseen",
          "Nb_Reviews": 2,
          "Date": "2022-11-21T04:51:04.000Z",
          "Titre": "It's really an excellent headphones",
          "Contenu": "It's really an excellent headphones . I advise everyone to buy this product, and their dealings are great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tony",
          "Nb_Reviews": 1,
          "Date": "2022-10-09T03:40:56.000Z",
          "Titre": "Nice earbuds",
          "Contenu": "This company earbuds are nice. It has a really nice gaming function that I don’t see in other earbuds. It has a nice quality for its price"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Mazzei",
          "Nb_Reviews": 1,
          "Date": "2023-04-21T19:12:16.000Z",
          "Titre": "I've used Tranya products for years",
          "Contenu": "I've used Tranya products for years. I can't say enough good things about the quality of the products and responsiveness of the product team."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Atamai Manuella",
          "Nb_Reviews": 1,
          "Date": "2022-09-15T05:29:16.000Z",
          "Titre": "Product was well advertised and shown…",
          "Contenu": "Product was well advertised and shown its promise. UI and App was easy to navigate. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "EG",
          "Pseudo": "Spice Pepper",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T10:31:18.000Z",
          "Titre": "Good customer support",
          "Contenu": "The customer support and response time was very good, and they are willing to help with any issue."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Eduardo Costa",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T14:31:08.000Z",
          "Titre": "with the service",
          "Contenu": "Very satisfied with the product and support, thank you!"
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "Elizabeth Dongala",
          "Nb_Reviews": 4,
          "Date": "2022-08-04T07:41:08.000Z",
          "Titre": "Just great",
          "Contenu": "Just great, I'm loving it, I received yesterday my product.Thank you so much, the support is very helpful."
        }
      ]
    }
  ]
}