{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.resilio.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William Farrell",
          "Nb_Reviews": 4,
          "Date": "2023-11-23T00:09:50.000Z",
          "Titre": "not worth the $100 got zero out of it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Arthur Klein",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T02:08:00.000Z",
          "Titre": "I have the personal pro version and ran…",
          "Contenu": "I have the personal pro version and ran the sync on a portable (local) drive. The system ran the sync, but when I checked, Resilio Sync did not completely sync documents."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Timothy Stark",
          "Nb_Reviews": 6,
          "Date": "2022-11-25T14:18:20.000Z",
          "Titre": "I tried to purchase Resillo Sync Pro…",
          "Contenu": "I tried to purchase Resillo Sync Pro with 40% discount code that you provided when I subscribed newsletter but code already expired.  That was 2nd time attempt. There is no way to contact customer service through that Resillo website.  Poor customer service..."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Luca Tarantini",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T23:55:17.000Z",
          "Titre": "I absolutely love the software and it’s…",
          "Contenu": "I absolutely love the software and it’s a part of my daily life. I’ve bought two family pack licenses. But PLEASE come back and start updating the program again. I hate to be using abandonware that I paid (twice) for and that I love so much."
        },
        {
          "Note": 1,
          "Lieu": "BE",
          "Pseudo": "Kris Permentier",
          "Nb_Reviews": 4,
          "Date": "2020-10-21T09:15:08.000Z",
          "Titre": "Time for a remake",
          "Contenu": "Gui could be a lot easier.Options like scheduled or cobditional tasks should be included.Program crashed several times since installation.Very slow sync."
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "luciano ludwig",
          "Nb_Reviews": 1,
          "Date": "2020-05-30T19:27:52.000Z",
          "Titre": "I purchased the program ..opened a case…",
          "Contenu": "I purchased the program ..opened a case ..and the technical support simply send me to read the forums ..and he didn't even send me an email back, after I requested his help ponce more ... The guy name was Roman Zanin ..Really disappointed  ..."
        },
        {
          "Note": 1,
          "Lieu": "LU",
          "Pseudo": "gny",
          "Nb_Reviews": 3,
          "Date": "2020-12-04T20:43:33.000Z",
          "Titre": "update doesn't work well",
          "Contenu": "update doesn't work well. Have to do download. No Social network presence.Guidance is not easy for beginners.Should take inspiration from pushbullet to be more \"friendly\"Positive point : excellent support."
        },
        {
          "Note": 1,
          "Lieu": "TW",
          "Pseudo": "SYHU",
          "Nb_Reviews": 1,
          "Date": "2022-07-22T23:34:24.000Z",
          "Titre": "No read & write access",
          "Contenu": "Many files are told \"Resilio Sync does not have read & write access to the files and cannot proceed with synchronization.\" There are similar questions are asked on the web but I cannot find useful information to deal with this issue."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "RS",
          "Nb_Reviews": 1,
          "Date": "2021-02-01T14:26:55.000Z",
          "Titre": "Your program deleted all my files in a…",
          "Contenu": "Your program deleted all my files in a minute. Years of work lost cause you don't have a one way copy with no deletes feature. Deleting stuff in one area shouldn't delete files in the other area."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Hendrik Botha",
          "Nb_Reviews": 1,
          "Date": "2021-11-12T20:23:17.000Z",
          "Titre": "I can't use this product on a Windows…",
          "Contenu": "I can't use this product on a Windows server. I didn't realise I wouldn't be able to use it until after I purchased it. Turns out to be a total waste of my money. Why on earth can a single user who has paid for the product not use it on a Windows server?"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mark Jones",
          "Nb_Reviews": 7,
          "Date": "2023-08-01T15:35:30.000Z",
          "Titre": "Atrocious download speeds",
          "Contenu": "Atrocious download speeds. No more than 1.4MB/s on a 1Gb network and 103GB's to download is appalling."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paul Davis",
          "Nb_Reviews": 1,
          "Date": "2022-09-20T20:09:52.000Z",
          "Titre": "Unable to register with my license",
          "Contenu": "I paid for the app and spent time trying to load the license. Watched videos, etc. No luck. I sent an email to support and never received a response. My next step is ask for refund and call my credit card company."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "TrustPilot Is Shit",
          "Nb_Reviews": 248,
          "Date": "2020-06-20T13:51:04.000Z",
          "Titre": "Another annoying platform with a…",
          "Contenu": "Another annoying platform with a minimum of 5 people for the team plan. You know teams of less than 5 exist right?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jimmie Cone",
          "Nb_Reviews": 3,
          "Date": "2023-06-01T04:09:01.000Z",
          "Titre": "Unable to sync files",
          "Contenu": "I was unable to figure out even with the instructions how to get the files on my two laptops and android phone.  I was unable to sync my files."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Timothy Hoogland",
          "Nb_Reviews": 4,
          "Date": "2020-09-24T15:11:01.000Z",
          "Titre": "Changes Promises after purchase.",
          "Contenu": "They change licenses after you purchase. I bought the Pro license and have a server at home. They killed off the ability to install it on a windows server (yes, even for home use). I will not be buying this ever again."
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Ryan Cole",
          "Nb_Reviews": 1,
          "Date": "2022-07-03T01:42:13.000Z",
          "Titre": "sooooo slow",
          "Contenu": "This service is insanely slow for large transfers/syncing between computers"
        },
        {
          "Note": 1,
          "Lieu": "RU",
          "Pseudo": "Mikhail Romanov",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T10:11:50.000Z",
          "Titre": "Very slow connection",
          "Contenu": "Very slow connection. 500-700kB/s I bay it for the fast connect."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Doug H.",
          "Nb_Reviews": 3,
          "Date": "2023-04-02T16:48:31.000Z",
          "Titre": "Not a good solution",
          "Contenu": "Not a good solution. Extremely poor documentation for NAS use."
        },
        {
          "Note": 1,
          "Lieu": "CH",
          "Pseudo": "Peter B",
          "Nb_Reviews": 2,
          "Date": "2020-07-20T19:15:18.000Z",
          "Titre": "Dont buy",
          "Contenu": "terrible service / software dont work"
        },
        {
          "Note": 1,
          "Lieu": "CH",
          "Pseudo": "STZ",
          "Nb_Reviews": 1,
          "Date": "2019-01-11T18:17:03.000Z",
          "Titre": "Although I spent quite some time in…",
          "Contenu": "Although I spent quite some time in reading the help function in Resilio Sync I was not able to get a proper synchronisation between a Samsung Mobil, a Huawei tablet and a Windows PC. I fear rhe articles in the help function are written for user with quite some experience and not greenhornes like me getting in touch with android for the first time. I have deinstalled your software on my devices and consider the purchase of the software an unsuccesful experiment."
        },
        {
          "Note": 1,
          "Lieu": "AR",
          "Pseudo": "Sebastian",
          "Nb_Reviews": 1,
          "Date": "2018-09-21T18:59:31.000Z",
          "Titre": "2 weeks to sync only 1 File of 1gb.",
          "Contenu": "the program mostly part of the time does not work correctly, I tried to sync a 1 Gb file between 2 computers over internet and the program showed me syncing about 10 minutes and stop doing it, i had to restart the program every time i remembered i was wanting to have this file on 2 computers (also tried to disable and enable relay server). it took more than 2 weeks of sync the file. i guess i will keep using Dropbox as long as this program evolves because i paid the license already :'(. COME ON! IT SUPPOSE TO RESILIO SYNC IS A FILE SYNCING PROGRAM!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Drew Friestedt",
          "Nb_Reviews": 1,
          "Date": "2019-06-15T09:35:08.000Z",
          "Titre": "Resilio does not seem to support their product",
          "Contenu": "Resilio does not seem to support this product (as of June 2019).  They do not respond to support tickets or questions in the forum.  I spent a few grand on the software thinking they would provide support as advertised.  Well, that is just not the case."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "hsc",
          "Nb_Reviews": 1,
          "Date": "2018-09-15T09:53:41.000Z",
          "Titre": "Very BAD",
          "Contenu": "Very BAD, if i click \"trennen\" then th Folder is erased not \"disconnected\"- not able to click on the Source which folders i want to sync- only able to select on the target which folders/files i dont want to syncv"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Karsten",
          "Nb_Reviews": 1,
          "Date": "2020-04-09T08:20:42.000Z",
          "Titre": "Not recommendable",
          "Contenu": "Bought the licence because of the possibility to use it on 4 devices but unfortunately it  doesn´t work. Send mail to the support but never received an answer.Therefore 1 star and even that is too much."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Graham Thorburn",
          "Nb_Reviews": 1,
          "Date": "2020-02-17T00:03:59.000Z",
          "Titre": "I'm trying to set up a sync from a…",
          "Contenu": "I'm trying to set up a sync from a computer to two NASes - one remote. I found the experience incredibly frustrating, and weeks later still haven't got it working to my satisfaction - veering between having multiple nested copies or no copies. The principle reason is the insistence in all the help documents that a NAS is just the same as another computer (try sending an email with a link to a NAS), so apart from the documents detailing the differences in how to install the app to different brands of NAS, all the help documents assume that your other device is either another computer, or a mobile device (for which the instructions are much clearer). I can't be the only person trying to do this - some simple examples would be helpful."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Martin Hildebrandt",
          "Nb_Reviews": 1,
          "Date": "2019-10-14T13:37:32.000Z",
          "Titre": "Reached a Critical Point with Users where sync is unusable",
          "Contenu": "Reached a Critical Point with Users, overloading our firewalls (50 connections each multiplied by 95 users), killing all bandwith on 100mbit/s symmetrical fiber) and loosing files/folders every now and then overloading the logs so the support can't identify the problem.Overload also in the database due to no real \"forgetting\" of already deleted files clogging up the DB until you revoke the share and rebuild it completly.RAM and CPU usage as well as bandwith is crazy high forcing our people to shut down resilio while having conference calls.Also no policy management of all the clients.main point from the support \"you should switch from sync to connect\" - we did that and it was a desaster. rolled everything back and now switch to alternatives."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Da",
          "Nb_Reviews": 1,
          "Date": "2020-04-02T21:28:19.000Z",
          "Titre": "You cannot create encrypted folders on…",
          "Contenu": "You cannot create encrypted folders on Android apparently due to CPU etc .. it's 2020 my phone is more powerful than my laptop. what decade was it when this decision was made?"
        },
        {
          "Note": 1,
          "Lieu": "KR",
          "Pseudo": "DONGKYUE KIM",
          "Nb_Reviews": 1,
          "Date": "2019-09-16T00:08:02.000Z",
          "Titre": "Conflicts with folder management…",
          "Contenu": "Conflicts with folder management programs like \"NexusFile\" can slow down your computer."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "mike  simatos",
          "Nb_Reviews": 2,
          "Date": "2018-12-28T23:35:15.000Z",
          "Titre": "did not work i tried all diffrent ways",
          "Contenu": "did not work i tried all diffrent ways Used to work when it was free after i payed nothing worked"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jon",
          "Nb_Reviews": 2,
          "Date": "2019-07-31T00:22:46.000Z",
          "Titre": "Service and support are good, but didn't work",
          "Contenu": "Service and support are good, but the product messed up syncing files.  So I got a refund"
        },
        {
          "Note": 1,
          "Lieu": "CZ",
          "Pseudo": "Martin",
          "Nb_Reviews": 1,
          "Date": "2019-09-21T20:26:03.000Z",
          "Titre": "I was not able to link devices...",
          "Contenu": "I was not able to link my windows computer with two linux machines and android mobile phone.update 1: ... and no, I didn't open any service ticket since I didn't find a support line. Just few forum. I asked for money back and installed opensource Syncthing even I will probably need to wait for some nice features from Btsync/Resilio.Update 2: Feedback for resilio - make device linking fully working, maybe some self-diagnostic could help. Second note about linking - it is very confusing - I install to one PC, it ask me for a user name. On other PC it requested also password - shall I use same user name as first computer? what about the password ?! Later I found that I don't need second identity/cerficitates (maybe ?!). Than mobile phone, cool just making a picture. Third computer, again some username, then to settings, linking, but I'm afraid I will loose or kick my previous computers. Shall I link from first to second, from second to third, from third to first or second ?! ... ok, I somehow managed this out. Than I found that my windows computer won't link anymore.As user, I want to have it simple and clear.Write name of device, Copy-paste a code (or type) and click \"OK\". In case of webui I understand that I need to enter also User/pass, but the purpose of the input must be clear.good luck bye !"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Raymond Kroeker",
          "Nb_Reviews": 1,
          "Date": "2019-08-08T21:56:06.000Z",
          "Titre": "Crashed on start",
          "Contenu": "Crashed on start.  Contacted support, got no response.Not a product, merely a tool."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Mark Radley",
          "Nb_Reviews": 3,
          "Date": "2019-07-16T20:33:40.000Z",
          "Titre": "Not good",
          "Contenu": "Not good. Tried to contact support for help but never heard from th3m. Just awful"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Some person",
          "Nb_Reviews": 1,
          "Date": "2019-01-01T17:24:04.000Z",
          "Titre": "Bad for large data sets",
          "Contenu": "Bad for large data sets, indexing is poor..works well for small sets of files"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ender wiggin",
          "Nb_Reviews": 1,
          "Date": "2020-08-03T19:54:09.000Z",
          "Titre": "Unreliable",
          "Contenu": "Unreliable - almost as Microsoft product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sergei",
          "Nb_Reviews": 1,
          "Date": "2018-09-22T04:28:52.000Z",
          "Titre": "Working super unstable and have a lot…",
          "Contenu": "Working super unstable and have a lot of problems in China"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "BW",
          "Nb_Reviews": 1,
          "Date": "2019-12-08T16:48:55.000Z",
          "Titre": "Very difficult to get sync working over LAN",
          "Contenu": "Very difficult to get sync working over LAN."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Alejandro  Lazaro Alonso",
          "Nb_Reviews": 1,
          "Date": "2019-05-21T18:31:43.000Z",
          "Titre": "Imposible to use for professional"
        },
        {
          "Note": 1,
          "Lieu": "ZA",
          "Pseudo": "Brent",
          "Nb_Reviews": 1,
          "Date": "2019-09-27T20:50:48.000Z",
          "Titre": "Keeps reminding me to rate them"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Marcel",
          "Nb_Reviews": 2,
          "Date": "2018-09-21T18:35:28.000Z",
          "Titre": "Not user friendly."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Jacques Botte",
          "Nb_Reviews": 1,
          "Date": "2023-08-27T02:05:22.000Z",
          "Titre": "user interface for selecting directory need to be reworked …",
          "Contenu": "user interface for selecting directory is not suitable.I send three links and each time, the users selected the wrong directory to sync.It seems the mouse control when selecting a directory within explorer, is not working as \"user's expectation\"."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Manu L.",
          "Nb_Reviews": 2,
          "Date": "2023-07-08T21:16:45.000Z",
          "Titre": "Cant buy a license with Paypal",
          "Contenu": "Cant buy a license with Paypal, Support only answeres tickets from PRO/Business accounts.Free version is OK i guess.."
        },
        {
          "Note": 2,
          "Lieu": "FR",
          "Pseudo": "Willem",
          "Nb_Reviews": 7,
          "Date": "2020-07-13T08:33:48.000Z",
          "Titre": "Great in theory, not so much in real life",
          "Contenu": "It really pains me to write this because in theory this tool is fantastic, that is what the second star is for. Unfortunately the reality of it is that the software seems buggy. Camera uploads works only sometimes, sync crashes, has user right issues, stops and requires reboots, authorisations arrive late and on different devices, doesn't sync some files. I can honestly say I have a good knowledge of PC's, but this has taken me a day of work to get things fixed with the forum which is just not OK. To make things worse support is not exactly quick with their replies, I've been waiting for 3 working days, just for two of the above mentioned issues. So as there is no chance for me to get this fixed on the short term, I asked for a refund. I'll definitely try again if it still exists in a couple of years to see if it has matured, but in it's current state it just doesn't seem usable."
        },
        {
          "Note": 2,
          "Lieu": "RU",
          "Pseudo": "Igor",
          "Nb_Reviews": 1,
          "Date": "2021-02-02T21:12:29.000Z",
          "Titre": "I'm disappointed by the absence of server features for multi-user (family) license",
          "Contenu": "I bought a Resilio Sync Family Pro license a week ago. I registered on the Resilio forum at the same time. After a week my forum registration still hasn't been approved, despite I reminded of myself twice.I'm disappointed that there is no a server-type installation of the Sync, e.g. for a home server (FreeBSD, Linux) or NAS. The main idea is that such a server can serve as an endpoint not just for one client, as it is now, unfortunatelly, but for many making the solution more convenient and similar to the traditional cloud-based services. It's very simple to implement and it costs nothing. I could not imagine that it hasn't implemented yet. Once again, if you buy a Family license that includes a few users and you have a home server or NAS, than only one user can sync with a node on the server. It's a shame.I hope it will be fixed soon."
        },
        {
          "Note": 2,
          "Lieu": "KR",
          "Pseudo": "DONGHYUN KIM",
          "Nb_Reviews": 1,
          "Date": "2021-09-18T23:58:50.000Z",
          "Titre": "The response was slow and the customer…",
          "Contenu": "The response was slow and the customer support refused to help because they claimed that it is beyond the hardware specs. In the end the reddit was more helpful and gave me the solution for my problem."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael  Hess",
          "Nb_Reviews": 2,
          "Date": "2020-06-18T20:44:53.000Z",
          "Titre": "My problem was never resolved!!",
          "Contenu": "My problem was never resolved!!!   I got an email from support saying to use another app(Files App) to use Sync on iOS.  After that never heard back.   The iOS app keeps crashing and I can’t save files to the app.  Very disappointing!!!"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Olivier",
          "Nb_Reviews": 1,
          "Date": "2021-10-16T21:14:47.000Z",
          "Titre": "I sync my files on my Drobo 5N and it…",
          "Contenu": "I sync my files on my Drobo 5N and it delete both files on my original drive + the ones on my Drobo 5N....in a snap"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Srini Rao",
          "Nb_Reviews": 1,
          "Date": "2021-02-13T00:49:46.000Z",
          "Titre": "Does not work with network drive for…",
          "Contenu": "Does not work with network drive for home use ...its useless for me"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Daryl Kuchay",
          "Nb_Reviews": 2,
          "Date": "2022-08-14T16:45:04.000Z",
          "Titre": "Community edition is not even enough for a studio apartment",
          "Contenu": "Got Resilio installed on Debian server and bought a license so I could get phone backups working. Up to this point, it worked. Once I bought a low storage capacity ipad and invited my partner to use the service too I found that \"community\" was not going to support that many connections or selective sync. Was disappointed that Resilio has that much of a hand held out for money. Even seafile community allows 5 users with little restriction. VPN, secure shellfish and photo synch will duplicate the functions I sought. And for free. But its not apparent. One may need to search for a while on why the barcode one is scanning on their ipad only produces an obscure error and resilio makes it so you cant use google to search their forums for an answer. If that is what they want let me thank them for taking my money. Lesson learned."
        },
        {
          "Note": 2,
          "Lieu": "IT",
          "Pseudo": "Me",
          "Nb_Reviews": 1,
          "Date": "2020-05-06T14:42:38.000Z",
          "Titre": "Lack a lot of features",
          "Contenu": "Lack a lot of features for a professional use. It's also quite expensive. We used it for a month because a collaborator wanted us to use it but after a few weeks we switched to a better alternative.Also, the fact that all linux boxes are considered server and you have to pay a lot more for a license that works on linux it's a big flaw for people like me that work mostly on linux."
        },
        {
          "Note": 2,
          "Lieu": "CN",
          "Pseudo": "Yulu",
          "Nb_Reviews": 1,
          "Date": "2018-09-22T01:19:38.000Z",
          "Titre": "We want the DHT feature back!!!!!!!",
          "Contenu": "Sorry to give you guys 2 stars. I am user from China,and I have a family license and every goes fine in the beginning. But you removed DHT feature after a version that cause resilio sync completely unable to use in China. Cause the tracker servers were blocked by China Great Firewall. We want the DHT feature back!!!!!!!"
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "brett bouet",
          "Nb_Reviews": 1,
          "Date": "2020-02-05T07:11:22.000Z",
          "Titre": "I am still trying to get it working",
          "Contenu": "I am still trying to get it working. It is not a simple program to work with. There is a lot of configuring that needs to be done to fix simple - for other programs - problems like files being locked and not syncing. Also, the configuring cannot be done in the user interface, but requires you to edit configuration files, which is especially difficult on a NAS, as it requires Telnet, and user's rights administration, etc.As I bought the pro version, hoping it would solve my problem, I will recontact support and see if we can get this fixed."
        },
        {
          "Note": 2,
          "Lieu": "SE",
          "Pseudo": "Irfan",
          "Nb_Reviews": 1,
          "Date": "2018-11-08T09:04:18.000Z",
          "Titre": "Too unreliable",
          "Contenu": "Too unreliable. Deleting files by itself. Replacing files randomly with zero byte copies. Overwriting new files with older versions from other sync devices. I gave my best to go with it for 3 years now, but this is just getting ridiculous. If I cant trust my backup and sync service, than what is the point."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "AA",
          "Nb_Reviews": 1,
          "Date": "2019-01-05T20:37:54.000Z",
          "Titre": "Don’t upgrade!",
          "Contenu": "I was running the old, free version of BT Sync for years. It was greatz. So I bought the paid version, and guess what: The upgrade failed to migrate any of my synced folders!  The instructions in the website for manual migrating also failed.  This shouldn’t happen, ever."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Liam",
          "Nb_Reviews": 3,
          "Date": "2018-09-21T18:40:44.000Z",
          "Titre": "Works sometimes but unreliable",
          "Contenu": "Was hoping for a set-it-and-forget-it remote backup solution but it proved to be too resource intensive and buggy. Ended-up giving up on it and using another sync solution instead. Hope to try again someday once it has time to mature."
        },
        {
          "Note": 2,
          "Lieu": "IT",
          "Pseudo": "Sebastiano Pera",
          "Nb_Reviews": 2,
          "Date": "2019-01-27T21:05:55.000Z",
          "Titre": "I really like the desktop software",
          "Contenu": "I really like the desktop software, that's the only I've been using and it works fine. When I've bought the licence I've been redirected to a portal(very basic graphic) where I saw the number of licences available. So after some time I've registered a licence on a PC and I wanted to see if the licence number was updated. So, I typed resilio.com but there is no way to access the reserved area from this page. And when I've found the link to the portal I was precedently redirected I've just seen that the keys are still the same amount, so basically this page apparently shows only the amount of licences of my plan, but not the real usage.Hope they'll make it better."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Bob",
          "Nb_Reviews": 1,
          "Date": "2018-09-28T18:24:18.000Z",
          "Titre": "Great potential with lacks",
          "Contenu": "Great potential,  great feature set but...Lacks guarantees of data security and safety. Some situations require full sync which can take days or even weeks when data is large (1-10 GB)."
        },
        {
          "Note": 2,
          "Lieu": "ZA",
          "Pseudo": "Raphael",
          "Nb_Reviews": 4,
          "Date": "2020-04-19T10:55:22.000Z",
          "Titre": "Overall fairly easy to use",
          "Contenu": "Overall fairly easy to use, but takes a long time to start up and analyse your folders each boot and only gets worse as the amount of data to be synced increases"
        },
        {
          "Note": 2,
          "Lieu": "GR",
          "Pseudo": "ILIAS",
          "Nb_Reviews": 2,
          "Date": "2019-04-04T08:03:56.000Z",
          "Titre": "Very hard to understand how to use it…",
          "Contenu": "Very hard to understand how to use it correctly 3 DAYS I'm trying to sync correctly between my PC , my mobile , my laptop and my tablet and still not functioning... I have a folder on the desktop of my PC called \"S\" aka (Sync) and I have another folder in my mobile phone's microSD  called \"S\" ( SD://S ) and I have another folder in my tablet's microSD  called \"S\" ( SD://S ).  I want whatever happens in whoever one of these \"S\" folders  (in my mobile or in my tablet or in my laptop and my desktop ) to happen immediatelly to all the other \"S\" folders... how is that  possible ??? And why the Resilio team hasn't any ready solutions for the most frequent sync scenarios? We aren't all of us  IT technicians...Sure would be very nice to have a help page which makes things abundantly clear how to use it in 10 most usual scenarios."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "George Smith",
          "Nb_Reviews": 1,
          "Date": "2019-03-08T01:12:37.000Z",
          "Titre": "I am the person people call for help.",
          "Contenu": "I am the person people call for help.I still cannot figure out some of the basic ideasof this program.  Sometimes it works and sometimes NOT."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alex Whittemore",
          "Nb_Reviews": 3,
          "Date": "2020-09-01T21:31:42.000Z",
          "Titre": "Development is slow and inconsistent",
          "Contenu": "Development is slow and inconsistent, and support is unresponsive and mostly unhelpful."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Nico",
          "Nb_Reviews": 3,
          "Date": "2018-09-21T20:47:13.000Z",
          "Titre": "Software is not stable",
          "Contenu": "The service itself is great but the software to set it up and monitor it, is buggy, fails to update, etc."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mr Barnes",
          "Nb_Reviews": 27,
          "Date": "2020-01-19T15:54:16.000Z",
          "Titre": "This does an excellent job of syncing…but...",
          "Contenu": "This does an excellent job of syncing through any network, across firewalls, from home LAN to another etc. It's fast too.The problems it has are hard to tie down.It just doesn't work reliably.I have twice lost big chunks of data that I had thought I had definitely checked had syncronised to another machine. They hadn't. The sync showed complete, there was no more activity, but all I had was placeholders, so I lost everything. Maybe I have some element of blame in that, although it seemed to happen even when I had been careful and I am no IT newbie.More frequently still it reports individual missing files for no apparent reason whatsoever. I have got to the point of it reporting hundreds, and rarely are they files I am too worried about, but this just isn't good enough!I am still using it, but only for syncing my movie library, which has a few big files and doesn't have complex permissions issues like a working computer's general documents. I'm also using it for my offsite backups - read only in one direction because it is so good at getting connected where my rsync through dynamic IP addressing just hasn't worked for more than a few days at a time!I really wanted this to work, but sorry, not good enough."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Samuel",
          "Nb_Reviews": 1,
          "Date": "2018-09-23T02:15:45.000Z",
          "Titre": "It's blocked in China",
          "Contenu": "It's blocked in China. As a kind of p2p service, why transaction could be blocked in China?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Zack",
          "Nb_Reviews": 1,
          "Date": "2018-09-22T00:09:38.000Z",
          "Titre": "I frequently have trouble syncing with…",
          "Contenu": "I frequently have trouble syncing with other users in a shared folder."
        },
        {
          "Note": 2,
          "Lieu": "CH",
          "Pseudo": "Antonio Bollino",
          "Nb_Reviews": 1,
          "Date": "2018-12-15T13:13:54.000Z",
          "Titre": "cost excessive 750 USD for a server."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "hernan",
          "Nb_Reviews": 1,
          "Date": "2020-03-29T00:30:12.000Z",
          "Titre": "i can't share some folders"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Makay Murray",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T00:53:55.000Z",
          "Titre": "Sync functionaly works, but web GUI needs some work.",
          "Contenu": "Does the software sync data? yes. However it feels incomplete. For starters the web interface when installing on a NAS is clunky. Especially when accessing remotely. For me, it required the use of Tailscale and the NAS DSM manager at the same time in two windows to know where and what I was syncing. If the NAS version of the software had a native GUI in Synology DSM and QNAP that would increase ease of use and setup for people that aren't quite as techy. The software lacks viability into sync errors. I'm trying to sync some directories from NAS A to NAS B in read-only mode (to NAS B). simple enough. Target NAS B shows a sync error. However it doesn't say what file(s) is causing the error. There's no pointer to the offending log file line. There's no way (I can see) to dismiss the error. Sync progress is obstructed while the error is in place. The selective sync screen is a little laggy as well as limited in functionality. When I select \"sync\" on some sub-folder it sometimes takes a good 30 seconds to turn from unselected to selected. This UI change should be instant. Even if the underlying sync engine hasn't fully turned over to actually start syncing. At the very least toss in a spinning wheel while it's thinking so the user knows their input has been registered. The Selective Sync screen on a NAS web interface is limited. No search feature to find a folder or file in a large structure. No ability to select multiple files and folders at once. No ability to re-size the dialog window. Lastly, the NAS web GUI has many functions hidden and is inconsistent. With a \"sync all\" folder clicking on the share name does nothing. With a \"selective sync\" folder the same action brings up a browser to select what items are synced and what items are not. This should be a dedicated button so it's more clear when clicking the folder name will do nothing and when it will do something. A little more attention to the Web GUI would go a LONG way to making this more pleasant to use."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rich",
          "Nb_Reviews": 1,
          "Date": "2021-10-08T16:16:16.000Z",
          "Titre": "Cool product, but slow",
          "Contenu": "Cool product, but it’s just insaaaaaanely slow. I got 2000b/s internet at the office and 200 mb/s at home, yet I’m getting average transfer speeds of 7 mb/s, highest peak ever being 19.5 mb/s. Perhaps I’m missing something, but other uploads and downloads with other software are utilizing my full bandwidth."
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "Damien",
          "Nb_Reviews": 2,
          "Date": "2021-06-15T17:29:23.000Z",
          "Titre": "Pretty bad... But still better than the other",
          "Contenu": "The app is buggy, does not provide useful info when it does not work, use some huge amount of cpu something for no obvious reason, oh, and the \"family plan\" is a joke, it's basically an \"ok you can share your licence\"...But it does the job and is globally better than the other soft"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2020-10-13T04:49:44.000Z",
          "Titre": "Good product went bad",
          "Contenu": "edit: they have offered a free business license to previous customers so I have upped the rating to 3 stars. Original review: I have used this product since it was called BitTorrent sync and stuck with Resilio through the purchase. I am surprised when without warning they broke the product for use on home servers and now want paid for a commercial license. Time to start looking for alternative products."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Avinash Arora",
          "Nb_Reviews": 5,
          "Date": "2023-08-11T17:47:16.000Z",
          "Titre": "Overall pretty good but the developer…",
          "Contenu": "Overall pretty good but the developer has stopped working on it. It's only a matter of time before it becomes non functional."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Adam Bollmeyer",
          "Nb_Reviews": 1,
          "Date": "2021-04-19T20:38:28.000Z",
          "Titre": "Good software with room for improvement",
          "Contenu": "Not being able to sync folders inside of other folders is a huge roadblock for me. I had to work around this limitation by restructuring my folders that have been set up for well over a decade. It's not the end of the world, but it is a major inconvenience. My specific use case is photo syncing. I would like to sync cell phone photos to a folder inside my 'Pictures' folder on my home server, then sync that folder to my NAS to back everything up. This does not seem possible with the current implementation. Otherwise, I have greatly enjoyed the ease of replication between devices. It's still not as straightforward or as easy to use as QNAP's Qsync software, but I do like it now that it's set up."
        },
        {
          "Note": 3,
          "Lieu": "RU",
          "Pseudo": "Andrew Go",
          "Nb_Reviews": 1,
          "Date": "2020-10-10T16:10:46.000Z",
          "Titre": "Excellent, but poor Android optimization",
          "Contenu": "At my case the app is excellent except for the single aspect, and it is an optimization under Android. Resilio Sync is the main night phone battery consumer even with 30 min waking up interval (about a percent per hour!). Say, the main competitor - free SyncThing - consumes almost nothing and distributes chsnges from the same Linux workstation to the same phone and tablet (both running Android) during a minute or so.Paid version is in use."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Joachim Kiefaber",
          "Nb_Reviews": 1,
          "Date": "2022-05-11T00:21:53.000Z",
          "Titre": "Reason for degrading is the missing of…",
          "Contenu": "Reason for degrading is the missing of a detailed written instruction. Only some fast films for installation is not enough.So I have a lot of money paid for IT specialist for installation. It was difficult with linux.Now after several days it is running"
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Ke",
          "Nb_Reviews": 1,
          "Date": "2023-01-16T23:45:36.000Z",
          "Titre": "IOS App",
          "Contenu": "IOS App: - Background Sync missing, Folder Sort Options to be improvedGeneral:- Delete outdated or stolen devices from device listRest is great"
        },
        {
          "Note": 3,
          "Lieu": "ZA",
          "Pseudo": "PN",
          "Nb_Reviews": 1,
          "Date": "2021-04-15T08:09:34.000Z",
          "Titre": "Pros and Cons",
          "Contenu": "It's a great app, but as soon as you sync MANY small files, the transfer drops down to a snail's pace which makes it pretty much unusable for urgent projects.Works great for large files though."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Matt",
          "Nb_Reviews": 1,
          "Date": "2021-01-01T23:32:21.000Z",
          "Titre": "Update the phone apps!",
          "Contenu": "Update the phone apps!! The Android app does not start after my phone has rebooted. Please fix this. It also seems to not sync on its own if I enable the sleep feature."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jürgen Habben",
          "Nb_Reviews": 1,
          "Date": "2020-05-26T11:47:33.000Z",
          "Titre": "Support",
          "Contenu": "Your support is Englisch only! A German Manual is missing."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "George Boulos",
          "Nb_Reviews": 1,
          "Date": "2021-06-02T20:39:34.000Z",
          "Titre": "iOS app doesnnot intergrate with iOS…",
          "Contenu": "iOS app doesnnot intergrate with iOS file system"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Christopher Dubea",
          "Nb_Reviews": 1,
          "Date": "2021-12-04T23:49:22.000Z",
          "Titre": "It's a memory hog",
          "Contenu": "It's a memory hog. Otherwise it's works fine."
        },
        {
          "Note": 3,
          "Lieu": "CR",
          "Pseudo": "Michael McConnell",
          "Nb_Reviews": 1,
          "Date": "2019-09-01T22:48:43.000Z",
          "Titre": "File transfer performance is ok, could be better.",
          "Contenu": "File transfer performance is ok, however compared to other bittorrent transfer like systems Resilio is one of the slowest I've ever used. It would be nice to see more custom variables exposed.One feature that would be nice to see is that if two systems have the file that they both participate in uploading. It appears that if two systems on a LAN have the file only one uploads to a new participant in the share."
        },
        {
          "Note": 3,
          "Lieu": "ES",
          "Pseudo": "Cliente",
          "Nb_Reviews": 2,
          "Date": "2019-01-08T02:11:33.000Z",
          "Titre": "Trustable, but not so amiable website",
          "Contenu": "The website works well, buying from it works as expected and the experience is fine. Accessing the account area is less obvious than it should be, though.The price is steep but occasional offers push it down to reasonable levels.However the different license terms and what constitutes an \"identity\" is fairly confusing and never well explained, even on forum posts where they try to clarify."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Clint",
          "Nb_Reviews": 1,
          "Date": "2018-09-19T12:01:42.000Z",
          "Titre": "Good \"new-product,\" not what you'd expect from a more mature product.",
          "Contenu": "Unfortunately, it does not support basic filesystem features on windows such as symbolic links.  It supports them on all other platforms so there isn't any reason it couldn't on Windows.  Going back and forth with support over the issue has gone nowhere.  It's pretty good otherwise but I wish it had more granular control.I'd say its a 'new product' in its feature-set and robustness, but pretty good."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Melanie Cook",
          "Nb_Reviews": 4,
          "Date": "2019-04-06T22:44:20.000Z",
          "Titre": "I love what this product does",
          "Contenu": "I love what this product does - I've been using it for years, since it was a beta, actually!However, I'm pretty geeky, have worked in IT half my life, as help desk, network admin, sys admin, it manager, and it really is not very intuitive.  I have recommended it to a friend, who is also geeky, but not as much as me, and he couldn't get it set up.  The documentation needs a lot of work.  I think it's worth persisting with though, once it's working, it's brilliant!"
        },
        {
          "Note": 3,
          "Lieu": "SK",
          "Pseudo": "NoNo Name",
          "Nb_Reviews": 1,
          "Date": "2019-12-14T09:45:58.000Z",
          "Titre": "Well",
          "Contenu": "Well, it somehow works... its surprising that in some situations downloaded amount of data is twice as large as the single file 70gb file (but 140gb downloaded)... It would be nice to have the option to set priority or at least speeds for each synch folder individually.Transfer speeds are not high, even on LAN.Sync status (%) is confusing and from point of the user not trustworthy.I'm happy with the purchase, but it looks like beta version more than a final product.Program and run as service are good options."
        },
        {
          "Note": 3,
          "Lieu": "AR",
          "Pseudo": "Diego",
          "Nb_Reviews": 1,
          "Date": "2018-09-21T12:35:20.000Z",
          "Titre": "Execlent, but some thing to be analyzed",
          "Contenu": "Hi all!, I love Sync, but have some things that i want to share:- Sync never end on some big files, and files with some much activity.  (for example thunderbird portable email client) - In cases on machines with low resources, when run at the start, running down the performance and the startup become very slow.- The sync folder is very big, more than a 2 gbs.- The link devices, is a problem, with some family I can't see the devices and in other cases see one in a node and no one in other"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jason CM",
          "Nb_Reviews": 1,
          "Date": "2019-05-04T01:45:39.000Z",
          "Titre": "If it worked as advertised",
          "Contenu": "If it worked as advertised, it would be great. I have had a lot of growing pains and still haven't been able to get to work well. It will sync between two same brand NAS but not a third NAS from a  different brand. Loads of permission errors even though all the files and folders are wide open."
        },
        {
          "Note": 3,
          "Lieu": "CH",
          "Pseudo": "Patrick",
          "Nb_Reviews": 3,
          "Date": "2018-09-21T19:19:25.000Z",
          "Titre": "notification center",
          "Contenu": "I would kinda like if it were possible to have a possibility to have also selective syncing like dropbox and also to receive a message when once a file has been updated or created. Otherwise I had no issues. Thanks for your work!"
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "Thomas de Groot",
          "Nb_Reviews": 10,
          "Date": "2018-09-22T10:41:33.000Z",
          "Titre": "All files synced every where on private servers! but steeb learning curve.",
          "Contenu": "I use Resilio to save my data on multiple vps's and sync to laptops. This was not easy to set up. You need to use a tunnel to config the vps. And since it is running on linux you need to do things with services that require you to use the command line. And I use the encrypted option that (I think) you need to setup via a certain workflow. But .. if you have it up and running it is really nice to have my files synced on every machine I use. One thing I really miss though is to be able to remove a machine without going to the machine itself. In case of theft, or a broken machine, there is no way to remove it from the list of synced machines.Also the documentation could be improved."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2018-09-21T18:28:56.000Z",
          "Titre": "Title",
          "Contenu": "It'll be perfect if they allow you to create public links to share files with non-resilio users.  Because of that, this can't be a long term solution, but in the interim, it is very useful and easy to manage."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Evan Xu",
          "Nb_Reviews": 2,
          "Date": "2020-02-19T19:02:05.000Z",
          "Titre": "It sync flawlessly",
          "Contenu": "It sync flawlessly. Only one con is that ignore list can't be synced and I asked the support confirmed that global ignore list or syncable ignore list is not in their roadmap. Kind of disappointed."
        },
        {
          "Note": 3,
          "Lieu": "HK",
          "Pseudo": "Vladimir",
          "Nb_Reviews": 1,
          "Date": "2018-09-25T10:40:01.000Z",
          "Titre": "No connection to relay in China",
          "Contenu": "Very bad server connection when using Chinese ISPs. Hope that Resilio can add a better support for such scenarios, including more relay servers (hopefully some self-deployable option as well), proxies, etc."
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "Francis",
          "Nb_Reviews": 2,
          "Date": "2020-01-20T02:37:44.000Z",
          "Titre": "I tried to setup for syncing to my iPad…",
          "Contenu": "I tried to setup for syncing to my iPad Pro from my MacBook Pro and it kept telling me the address was not correct.  I followed you video on how to do it yet it did not work.  Very disappointed."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Matt",
          "Nb_Reviews": 1,
          "Date": "2018-09-21T18:16:38.000Z",
          "Titre": "great software with lacking…",
          "Contenu": "great software with lacking documentation, and an unclear UI.Bought it a while ago to keep files synced between my desktop, laptop and server, but setting it up became cumbersome and unwieldy."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shaine Mata",
          "Nb_Reviews": 1,
          "Date": "2019-05-29T16:14:09.000Z",
          "Titre": "Works But Not Intuitive",
          "Contenu": "Works But Not IntuitiveThe user interface could use some work. One is able to do what needs doing, but it takes some tinkering and looking up. Would not recommend for low tech users."
        },
        {
          "Note": 3,
          "Lieu": "SE",
          "Pseudo": "Odd Eivind Ebbesen",
          "Nb_Reviews": 10,
          "Date": "2019-03-03T20:30:06.000Z",
          "Titre": "Very beta experience",
          "Contenu": "The software has great potential, but it feels very beta. Hangs on shutdown, not very intuitive in use. I sort of regret I paid for it. But hopefully it'll get better in the future."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Loki Bear",
          "Nb_Reviews": 1,
          "Date": "2019-01-15T19:36:41.000Z",
          "Titre": "syncthing > resilio sync",
          "Contenu": "syncing between windows, linux, and macos is a bit difficult for it. syncthing seems to do a much better job out of the box, supports versioning, seems to use less resources, and is free.. but syncthing lacks in system integration and installer/upgradesupdate: i did receive help from support when contacting through website. i am a family pro plan user. while they did not exactly work out my issue, told me it was not possible, i figured out my issue on my own (and in fact what i was trying to do is COMPLETELY possible) and I have been using Resilio Sync now for 2 weeks and its been relatively quiet and nice piece of software.syncthing definitely has a nice set of features though and i will probably revisit both in a couple of months after having more time with Resilio day to day."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Shaw",
          "Nb_Reviews": 1,
          "Date": "2018-11-26T18:32:14.000Z",
          "Titre": "documentation is terrible",
          "Contenu": "documentation is terrible. I've had to trial and error my way through the setup of devices. the app works, but come on guys/gals, get your s#$& together and write the front end"
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2019-09-06T07:08:22.000Z",
          "Titre": "In a lot of IOS Apps is it possible to…",
          "Contenu": "In a lot of IOS Apps is it possible to save in the cloud. but never in resillio. like in scanbot. I use a always on home server for my resillio data. but I have to use iCloud :-("
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "ryan ophelan",
          "Nb_Reviews": 1,
          "Date": "2019-04-10T15:08:00.000Z",
          "Titre": "Resilio seems to work well with a few…",
          "Contenu": "Resilio seems to work well with a few large files. It's extremely flexible and has clear advantages over Dropbox. But, I attempted to sync a 300GB project with thousands of files, and it actually failed. It didn't just take a long time, it NEVER finished. Because each file is a separate torrent file, and it seems like it transmits only one at a time, with a long wait in between, it is extremely slow, cumbersome, and actually fails on large directories. This has been my experience, and checking that firewall issues and advanced settings were not the issue, I threw up my hands at this.To solve this issue, I ended up zipping large directories to create fewer large files, and this of course worked beautifully. I wish resilio could find a way to do something like this behind the scenes. It would make this the ultimate sync tool."
        },
        {
          "Note": 3,
          "Lieu": "TW",
          "Pseudo": "J Chou",
          "Nb_Reviews": 1,
          "Date": "2019-12-13T02:31:15.000Z",
          "Titre": "Sync-up from mobile device to server is…",
          "Contenu": "Sync-up from mobile device to server is excellent. Hope it could provide bi-direction sync-up, that is to provide sync-up from server to mobile device."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "BGS",
          "Nb_Reviews": 1,
          "Date": "2018-12-26T18:36:43.000Z",
          "Titre": "Generally works well",
          "Contenu": "Generally works well, but haven't been able to get it to work with my Synology NAS. Will load the first time, and then will not work after that."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Jonathan",
          "Nb_Reviews": 2,
          "Date": "2018-09-14T06:58:07.000Z",
          "Titre": "The app works nicely with no obvious…",
          "Contenu": "The app works nicely with no obvious failings but it is very hard to use and confusing over the differences between various facilities and features."
        },
        {
          "Note": 3,
          "Lieu": "RO",
          "Pseudo": "Paul Diaconescu",
          "Nb_Reviews": 1,
          "Date": "2018-12-29T12:14:58.000Z",
          "Titre": "Share files to non-resilio users",
          "Contenu": "Hi,This is an very good product.But i need some polishing.One of the things i would need is to be able to share files to non-resilio users."
        },
        {
          "Note": 3,
          "Lieu": "PL",
          "Pseudo": "hapi",
          "Nb_Reviews": 1,
          "Date": "2019-01-01T09:48:51.000Z",
          "Titre": "all you need is a free version",
          "Contenu": "The free version is so different from the paid one that it's a shame to pay. The link can not be copied by the Qr code at a later time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Andrew",
          "Nb_Reviews": 2,
          "Date": "2018-09-21T16:15:20.000Z",
          "Titre": "I've paid and they promised...still without proper Linux client.",
          "Contenu": "They promised a Linux client and it's cumbersome at best. I've paid for this service and it's been years without a proper Linux client.Edit: Since Resilio replied, I'll add this to my review: help.resilio. com /hc/en-us/articles/204762449-Guide-to-LinuxThat includes the list of \"peculiarities\" that exist on the Linux client. And that is if you can even get it running properly. \"Resources\" is a poor excuse as to why they don't have a native GUI client. Flatpacks? Snaps? App Images? Linux is expanding into the consumer market and they can't even be bothered to create a proper client. They are paying someone to reply with excuses though.Another Update: To be clear, I'm not asking for a refund. The product works very well on supported platforms. I use it on my Synology NAS, Windows Desktop and Macbook. I depend on it daily and it works well. My issue is my primary platform is Linux and the support for Linux is very lacking."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Jayness",
          "Nb_Reviews": 1,
          "Date": "2018-12-30T06:42:06.000Z",
          "Titre": "Notable bugs",
          "Contenu": "Notable bugs: up and down data rarely display anything but 0. When a file is downloading it disappears until it's downloaded (Mac os)"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Simon",
          "Nb_Reviews": 1,
          "Date": "2018-09-28T21:16:08.000Z",
          "Titre": "Twice requested to make a claim but…",
          "Contenu": "Twice requested to make a claim but either it is not eligible for claim or the manufacturer ends up absorbing the cost of repair."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "STUART FRANKEL",
          "Nb_Reviews": 8,
          "Date": "2019-04-19T00:31:48.000Z",
          "Titre": "using Resilio Sync for years now and…",
          "Contenu": "using Resilio Sync for years now and just having terrible trouble syncing.Support was poor and still do not have 100% working."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "IT",
          "Nb_Reviews": 1,
          "Date": "2018-12-30T22:02:28.000Z",
          "Titre": "I am not an expert",
          "Contenu": "I am not an expert, so I need help with the set up now have it done correctly.  I still have questions are not answered."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Dale Forrest",
          "Nb_Reviews": 1,
          "Date": "2019-11-21T02:26:05.000Z",
          "Titre": "product works just fine however I…",
          "Contenu": "product works just fine however I uninstalled and decided to use an opensource app that does the same thing."
        },
        {
          "Note": 3,
          "Lieu": "AT",
          "Pseudo": "Sascha",
          "Nb_Reviews": 1,
          "Date": "2018-09-24T06:31:43.000Z",
          "Titre": "Essential UI functions are missing...",
          "Contenu": "No Black/Whitelist via Graphical UI... No Thumbnails in iOS Version... I am using Resilio since 3 years..."
        },
        {
          "Note": 3,
          "Lieu": "BE",
          "Pseudo": "daniel d'hanis",
          "Nb_Reviews": 8,
          "Date": "2019-04-08T10:56:48.000Z",
          "Titre": "Had troubles to apply my license in…",
          "Contenu": "Had troubles to apply my license in LinuxWindows went without problems"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 2,
          "Date": "2018-10-08T17:30:40.000Z",
          "Titre": "Needs much better instruction",
          "Contenu": "Needs much better, readily available, instructional documentation."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Mdrodge",
          "Nb_Reviews": 1,
          "Date": "2019-04-01T23:21:25.000Z",
          "Titre": "A few files lost somehow and replaced…",
          "Contenu": "A few files lost somehow and replaced with empty files."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "jason w",
          "Nb_Reviews": 1,
          "Date": "2019-02-07T16:17:09.000Z",
          "Titre": "This would be a 5 Star program except…",
          "Contenu": "This would be a 5 Star program except for the fact that it doesn't seem to work well on windows 7. I have both Firefox and Chrome installed, both up to date, and the os up to date but it tells me i have to update one or both of them before it can run. It struggles to sync to that computer and doesn't run reliably when i finally get it to run in a browser because it never runs on its own.That said, i have been looking for a way to get away from Dropbox for a long time. I never liked that i had to store things on their server to begin with, but their website was useless to me (the organization is mediocre at best, and since i don't use MS Office i can't use it to preview or edit my files) with Paper being the only feature i occasionally use. For Paper, Google Docs and Sheets are overwhelmingly better and more useful. Dropbox mobile app is completely useless because i have to download everything twice (once for it to try and preview, then a second time to actually open the file); can't automatically download everything, can't choose where the download goes to on the device, and can't use the SD card on the device.Resilio doesn't try to preview the files, so that is a big plus for it. It lets me choose where the files get stored on each device. I get to sync files differently (have a folder to sync files for my phones/tablets and folders to sync other files between laptops and desktops, with yet other files to sync between just the desktops). I get to save the file to the SD card. It is capable of syncing on any network the devices are connected to. It is extremely faster than Dropbox and doesn't use internet to do so. This program is nearly perfect in my opinion, but not being stable on Windows 7 is a big hit since i won't upgrade my desktops to window 10 until i absolutely have to."
        },
        {
          "Note": 3,
          "Lieu": "ES",
          "Pseudo": "Fernando Dopazo",
          "Nb_Reviews": 2,
          "Date": "2019-04-06T17:49:40.000Z",
          "Titre": "I want native sync with gdrive",
          "Contenu": "I want native sync with gdrive, onedrive, etc"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Yacer",
          "Nb_Reviews": 3,
          "Date": "2018-09-21T18:25:35.000Z",
          "Titre": "Sells bad product false advertising"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "DGB TO",
          "Nb_Reviews": 1,
          "Date": "2018-09-21T12:17:56.000Z",
          "Titre": "Great product,... lacking effective documentation",
          "Contenu": "...Okay, \"friction,\" as worded by Trustpilot, is not an accurate word in my case; I have had no friction with Resilio's staff--in fact, the one or two times I reached out to them they were forthcoming, no problem.  But I did not want to give my overall experience a four-star rating, for the following reason:Resilio Sync is an amazing product/service--all my tech-head associates agree.  And the one time I got it to work properly, I did glimpse a brave new world.  The problem is not with Sync; it's that, though I believe I've read through all the many brief and medium-length documents made available by Resilio, I still don't know that I've set it up properly for what I want it to do, and I still am not confident, each time I try to use it, that I'm following the correct steps.  Clearly, the documentation works for a great many people, but everyone is different, and it hasn't worked for me.  Further, I have searched YouTube for instructional videos and found only one or two, produced by third-party individuals; those were more about what Sync could do, than exactly how to do it.  (I have not done a document or video search in about six months now, so if there are newer resources than that out there, this will be outdated information.)I have the desire to make good use of Resilio Sync, but have thus far been discouraged, and my schedule has not allowed me to just focus on it and 'break its back'.  I wish there were a few videos/documents that took one step-by-step through the set-up and use process, for INDIVIDUAL USE CASES (pardon the capitals):  1) If you want to send someone one large file, do this--from start to finish.  2) If you want to give someone access to a whole folder, do this--from start to finish.  3)  If someone who has a Sync account wants to share something with you and you need to set up the free version of Sync, do this--from start to finish.  4)  If you want to set Sync up as a personal server (or whatever), do this--from start to finish.  Etc.Thanks very much for reading!  I do look forward to being able to use Sync properly one day.  Best regards."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Tam�s Rusz",
          "Nb_Reviews": 1,
          "Date": "2018-12-27T16:37:45.000Z",
          "Titre": "Thumbnail for images would be nice"
        },
        {
          "Note": 3,
          "Lieu": "RU",
          "Pseudo": "Vladislav Churilov",
          "Nb_Reviews": 1,
          "Date": "2019-05-14T04:45:21.000Z",
          "Titre": "Product is not worth the money."
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Dillon Sinden",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T17:32:17.000Z",
          "Titre": "Great tool",
          "Contenu": "Great tool! Setup was simple yet a bit confusing at first with trying to understand identities. Licensing was just the simplest best experience ever. One Click!I'm just missing the ability to sync from my android root / directory. The furthest I can go back is /storage/0 or /storage/{SD card}.It would be nice to grab the /storage folder and have one rule though."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Maximilian Fechter",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T18:12:39.000Z",
          "Titre": "Great program to share your files…",
          "Contenu": "Great program to share your files without a 3rd party cloud. Windows version runs reliable and has a fast data transfer. Installation and maintenance is much easier than e.g. owncloud server.Encrypted folder is a great idea, if you would like to have another peer online, but dont trust somebody nicking your harddrive from the pi lying on your Desk. Unfortunately the encrypted folder makes some problems. I shared this to a Bananapi with ubuntu server 22 running. Some files cant be transferred. And, hence the encryption, I dont know which ones. Not sure why this is."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ed Armstrong",
          "Nb_Reviews": 2,
          "Date": "2023-03-10T17:14:06.000Z",
          "Titre": "The product itself is great and does…",
          "Contenu": "The product itself is great and does almost exactly what I need it to.The only limitation that I have run across is that running certain programs from the shared drive on Windows will fail because of file locks.  Likely not an issue for people who want to just share data, rather than programs."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Joel",
          "Nb_Reviews": 1,
          "Date": "2020-09-13T03:43:15.000Z",
          "Titre": "Excellent software held back only by the Home version's lack of server support",
          "Contenu": "Everything about Resilio Sync Home is excellent - except for the lack of Windows Server support. Just because I have a server does not mean it's for commercial use, so this is a severe limitation of the home version.Don't let this hold you back from trying or purchasing it, though. It is a truly excellent piece of software that's made my life significantly easier."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Donovan Sullivan",
          "Nb_Reviews": 2,
          "Date": "2020-10-03T22:50:52.000Z",
          "Titre": "Works quite well between desktop and…",
          "Contenu": "Works quite well between desktop and laptop. The phone app has been a little bit frustrating. Kept showing can't download file 99%, but I couldn't find a way in the app to actually locate the error. Eventually fixed it by re indexing the folders, restarting a a bunch of times, re connecting devices a few times. Don't know why it's fixed, but it is. Also have had it fail to recognize changes to a folder a couple times on one device when bringing a different one online. Overall works well, very happy with resilio especially the one time purchase business model, just a few little nags."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gamon",
          "Nb_Reviews": 1,
          "Date": "2021-07-25T17:26:56.000Z",
          "Titre": "It's a good tool that works pretty…",
          "Contenu": "It's a good tool that works pretty well. The only feature I'm missing is the possibility to send a link to share to a friend. The friend should be able to just download the data without having to install the resilio client on his side. This would be possible if resilio had an anonymous client running in the browser."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Rob B",
          "Nb_Reviews": 1,
          "Date": "2021-05-16T02:20:12.000Z",
          "Titre": "Resilient Sync was easy to install…",
          "Contenu": "Resilient Sync was easy to install across all my devices (NAS Drives, iMac, MacBook and iPhone). It works flawlessly and quickly. I bought a home pro licence for the extra functionality and because it was a lifetime purchase and not a subscription. I have found the documentation lacking a little, leaving me a little confused about some aspects of its operation. Overall, a very efficient way of having all my files available on all my devices."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Nicolas Strobl",
          "Nb_Reviews": 1,
          "Date": "2021-08-18T16:01:30.000Z",
          "Titre": "Great Product, but poor iOS app",
          "Contenu": "The software works wonders on a computer and keeps everything in sync. The iOS and iPadOS apps however have a lot of room for improvement. While the app integrates with the \"Files\"-app there is no background sync. So if you want to add a pdf to a folder you have to add that file with the \"Files\"-app because the Resilio Sync app doesn't offer this functionality. When you added the file it still isn't synced however, so you need to open the Resilio Sync app to start that process.Overall: The price is good, but the app needs background sync to be usable for adding or editing files or even for backing up photos without manually opening the app every time."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "TL",
          "Nb_Reviews": 1,
          "Date": "2021-07-31T02:57:45.000Z",
          "Titre": "Really love how easy this is to sync…",
          "Contenu": "Really love how easy this is to sync from computer to computer but I am giving 4 stars because I have to use a whole other software (Goodsync) to backup files to HDD as you can't do that with this. SO maybe that could be a future update?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TJ",
          "Nb_Reviews": 1,
          "Date": "2020-07-28T22:31:16.000Z",
          "Titre": "Great software overall",
          "Contenu": "Great software that is stable and suites my workflow. Very simple to use and \"just works\" for the most part. 4 stars mainly because it is missing critical feature for my own flow: remotely removing clients from my account (I know it is like that by design but I would prefer to have it)."
        },
        {
          "Note": 4,
          "Lieu": "PR",
          "Pseudo": "Jesus Rodriguez Garcia",
          "Nb_Reviews": 1,
          "Date": "2021-09-30T14:10:48.000Z",
          "Titre": "The application for Android must have…",
          "Contenu": "The application for Android must have \"selective synchronization\" since I have deleted files on my cell phone and it deletes them on the main computer where I store. You are missing the option to erase only on this device. Thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "HKFamily",
          "Nb_Reviews": 1,
          "Date": "2021-09-17T00:18:25.000Z",
          "Titre": "Better for smaller syncs",
          "Contenu": "Overall the software seems fairly polished and robust.What the software seems to struggle with is trying to sync folders with a lot of subfolders and files. The Indexing seems to keep going but there often is no way to tell when if ever it will finish. On some folders I've had the indexing stop but it seems like the indexing finished prematurely as the sync folder size is wrong. I've tried rescanning but I'm not sure why some folders never seem to finish. That said, I paid for the software so I'm still going to keep trying to use it.For small folders or single files the software was great."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Sheila Flanagan",
          "Nb_Reviews": 1,
          "Date": "2021-02-19T17:31:04.000Z",
          "Titre": "Sync issues in Ubuntu",
          "Contenu": "Although I consider myself a newbie at Linux, and I knew it was an underlying permissions issue, I finally went into each folder/subfolder & added rslsync as a usr with full permissions. If the support email had specified doing that it would have saved me time, but as it was, I was able to get every folder on my Ubuntu machine as well as Windows 10 laptop & Android phone syncing the desired folders. Tech support emailed within 24 hours and followed up with ensuring my issue had been resolved."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DAWN EMERY BALLANTINE",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T16:18:27.000Z",
          "Titre": "Customer service is not readily…",
          "Contenu": "Customer service is not readily accessible so it took a few failed attempts and lost work in syncing between computers. But 5th time worked!"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Soham Sen",
          "Nb_Reviews": 1,
          "Date": "2022-08-20T20:36:56.000Z",
          "Titre": "Overall good but lacks some convenient features",
          "Contenu": "Some convenience features are lacking, like not creating Documents, Documents (1), etc. when syncing a folder with same name from different devices, but overall does the job well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RAY K",
          "Nb_Reviews": 1,
          "Date": "2022-02-23T15:08:56.000Z",
          "Titre": "Works great",
          "Contenu": "Works great. I don't use it as much as I expected but it's a great way to backup my chrome book to a win10 box (without using a cloud) that gets backed up up as well so i hope to never lost important info."
        },
        {
          "Note": 4,
          "Lieu": "PT",
          "Pseudo": "Hans-Joerg",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T00:22:28.000Z",
          "Titre": "Easy to install and fair pricing",
          "Contenu": "Can be installed without long reading of instruction manuals.The pricing with the one-time payment is more than fair."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Boyd Shermis",
          "Nb_Reviews": 2,
          "Date": "2020-05-23T21:59:47.000Z",
          "Titre": "I've been using since Bittorrent Sync…",
          "Contenu": "I've been using since Bittorrent Sync Beta. The app has gotten better and more stable. I've certainly been happy. However, it's still a bit tricky to get going on a Linux (Ubuntu) based server - and so I must degrade by at least half of a star."
        },
        {
          "Note": 4,
          "Lieu": "KH",
          "Pseudo": "You Delux",
          "Nb_Reviews": 1,
          "Date": "2021-11-19T15:22:45.000Z",
          "Titre": "I used resilio to sync data between my…",
          "Contenu": "I used resilio to sync data between my Qnap and my PC. It working great with not many folder subfolder and files..but when I sync my PC documents which is has many subfolder and files total 17Gb resilio cant sync it all I miss some files and subfolder."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Rajesh Devabhaktuni",
          "Nb_Reviews": 1,
          "Date": "2020-07-13T03:05:30.000Z",
          "Titre": "I've logged a case with Support team…",
          "Contenu": "I've logged a case with Support team and they've responded to me with set of instructions on what to do next. yet to troubleshoot the issue. Thanks. Even in these Covid times, they responded, off course, bit slow."
        },
        {
          "Note": 4,
          "Lieu": "RU",
          "Pseudo": "Sergei Iakhnitskii",
          "Nb_Reviews": 1,
          "Date": "2020-07-10T10:46:47.000Z",
          "Titre": "Good program with bad support",
          "Contenu": "The program is good for syncing files with my NAS but support is not responding in declared times for paid clients. No response for 3 days already."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "NGilmour",
          "Nb_Reviews": 1,
          "Date": "2021-02-17T14:25:40.000Z",
          "Titre": "Fantastic remote file access platform - mediocre documentation",
          "Contenu": "Resilio answered my questions of how I can make my important files accessible remotely and securely. Set up was painless. Like really painless, and it works. I had messed around with other platforms like NextCloud and OwnCloud but after a while of doing more maintenance than actual use I gave up and went with a professionally developed platform. The cost of Resilio is worth every cent and for what you are getting, I feel it is worth it. I appreciate OpenSource software, it has its place, but if a consumer wants something to work reliably then it is worth making the investment. I would rate this a perfect 5 stars, however, the documentation really needs to be worked on. Explanation of the ID platform is about as clear as mud and the differences in Tiers and what you get with each tier was buried deep into their support site. I had purchased the family plan thinking that with 2 people accessing my server that is what I needed. That was not so. I needed to reach out to support to get the information I needed and ended up returning my family plan and getting the Single user. All in all, very worth it. Very happy that it is easy and...just works. No messing around with it. Set it and forget it.  Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TJ",
          "Nb_Reviews": 1,
          "Date": "2022-11-23T02:45:56.000Z",
          "Titre": "My experience with Resilio Sync",
          "Contenu": "It is a little bit confusing to understand the application, It can be more user-friendly.If you can understand the functionality, it is a good tool to try."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Greg Raven",
          "Nb_Reviews": 7,
          "Date": "2020-05-29T20:21:41.000Z",
          "Titre": "Works as advertised",
          "Contenu": "Works as advertised. I wish it were more like Dropbox in terms of auto-uploading, but other than that is just what I was seeking."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JIE ZHUO",
          "Nb_Reviews": 1,
          "Date": "2020-06-28T12:52:33.000Z",
          "Titre": "ios version might need some enhancement…",
          "Contenu": "ios version might need some enhancement inside “ios - files”. No placeholders & pdf not able to save changes."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "bereter",
          "Nb_Reviews": 1,
          "Date": "2021-07-17T11:43:02.000Z",
          "Titre": "Resilio is Excellent but I was wishing…",
          "Contenu": "Resilio is Excellent but I was wishing it has more and rich features like what is in GoodSync or Gs Richcopy360"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Amber Paintal",
          "Nb_Reviews": 1,
          "Date": "2020-05-25T17:07:16.000Z",
          "Titre": "A bit of figuring around and you get…",
          "Contenu": "A bit of figuring around and you get what you asked for.. the power of this app is in its simplicity and a clean interface. Will recommend."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Hann March",
          "Nb_Reviews": 13,
          "Date": "2020-10-09T19:07:36.000Z",
          "Titre": "Very good start some syncing issues…",
          "Contenu": "Very good start some syncing issues here and there but nothing preventing fluid use."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "elnr",
          "Nb_Reviews": 1,
          "Date": "2020-08-11T07:05:24.000Z",
          "Titre": "Was a bit hard to figure out Peer to…",
          "Contenu": "Was a bit hard to figure out Peer to Peer and config Resilio on raspberry. But now all is running like a charm."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "RalfK",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T19:54:36.000Z",
          "Titre": "Android-app needs some improvment",
          "Contenu": "only the Android-app needs some \"hands on\""
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Jeremy",
          "Nb_Reviews": 2,
          "Date": "2020-06-18T06:19:59.000Z",
          "Titre": "Good but a memory hog",
          "Contenu": "Works well, selective sync is great. Uses far too much memory though."
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "JP Smith",
          "Nb_Reviews": 1,
          "Date": "2021-05-12T03:25:18.000Z",
          "Titre": "I have missed you",
          "Contenu": "it takes to long to get registered by the timeme your done i have changed my mind"
        },
        {
          "Note": 4,
          "Lieu": "CO",
          "Pseudo": "Nicolas Tautiva",
          "Nb_Reviews": 1,
          "Date": "2020-01-14T16:33:04.000Z",
          "Titre": "The product is fantastic, but instructions could be clearer",
          "Contenu": "The product is fantastic.  I use 3 computers and I need to have all the info synced among them... so Resilio is the perfect solution for my needs.The only reason I give 4 starts is that the instructions are not very clear... it took me a couple of hours to read the suggested links, and at the end, it wasn't clear for me what I had to do to sync according to my needs. Apart from that, the product works as expected."
        },
        {
          "Note": 4,
          "Lieu": "RU",
          "Pseudo": "Sergey Litvinenko",
          "Nb_Reviews": 1,
          "Date": "2019-07-25T16:41:35.000Z",
          "Titre": "Great, but lacks of naming storages choice",
          "Contenu": "I didn't expect there would be limitations on naming the Backups.I have two phones, and each of them has \"Camera\" storage I'd like to backup, they were named \"Camera\" and \"Camera2\", but I'd like to have them either with names \"Sams_Camera\" or \"Samsung/Camera\" and \"Meizu_Camera\" or Meizu/Camera\". I really need clearly distinguish between them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Easton",
          "Nb_Reviews": 1,
          "Date": "2019-08-16T17:08:05.000Z",
          "Titre": "Probably will be a 5-star ranking when…",
          "Contenu": "Probably will be a 5-star ranking when I can learn to connect my three computers together correctly.  When I was trying last week I kept getting interrupted over and over, not your fault for sure.  I fall into that group of users for whom it takes a couple of stumbling tries to get enough of a new program memorized so I can go through the process smoothly.  I will have time over the weekend (I hope) to get it all communicating.  Thanks, R. Easton"
        },
        {
          "Note": 4,
          "Lieu": "CN",
          "Pseudo": "DALNE GERT KOMBATE",
          "Nb_Reviews": 1,
          "Date": "2019-03-12T07:21:40.000Z",
          "Titre": "I can access my NAS files where and when i need them, right from windows.",
          "Contenu": "I've looked for an option to have index folders from my Nas on my computer and access or share them anytime just by with two clicks. Not having to load a webpage or anything like that, but just to it right within windows. Resilio sync works almost perfectly for me! I experienced a couple of bugs but nothing major. So far, i'm pretty happy with my purchase."
        },
        {
          "Note": 4,
          "Lieu": "FI",
          "Pseudo": "Viljami",
          "Nb_Reviews": 2,
          "Date": "2018-10-02T07:53:18.000Z",
          "Titre": "It works well but as with all these…",
          "Contenu": "It works well but as with all these syncing softwares, I was afraid that I will lose my files and of course that happened also with Resilio. I think the unsyncing of a folder was not clearly stated in the software that it will delete sync from every connected device. In addition I accidentally deleted some files in Finder but couldn't bring them back so I had to sync everything once again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2018-10-02T17:47:10.000Z",
          "Titre": "I like Resilio - Linux Mint interface needs major upgrade",
          "Contenu": "I like Resilio, it is a great program and I use it often and happily upgraded to the paid Pro version. However, I use Linux Mint and  I would encourage them to work diligently to improve their Linux interface. I frequently send data between Linux and Windows machines. Linux users should not be considered less important that Windows or Apple users. If you want 5 stars you must improve your Linux interface."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "A.K",
          "Nb_Reviews": 1,
          "Date": "2019-01-01T15:28:26.000Z",
          "Titre": "Very fast & solid but missing some basics features",
          "Contenu": "+I'm very happy with speed, stability and unlimited storage, currently syncing about 1TB among several devices.-file versioning in Resilio sync is very basic if exists at all.-I really miss the image and document file thumbnails from cloud services like Drive or Dropbox, it is very helpful to see which file is the right one to download. but now I have to guess or sometimes download the whole folder searching for one or two files."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Manuel Bedres",
          "Nb_Reviews": 1,
          "Date": "2019-01-04T16:55:46.000Z",
          "Titre": "After years of searching and trying…",
          "Contenu": "After years of searching and trying different apps I finally found a simple and uncomplicated way to sync specific folders between my two computer. Resilio works fast and invisibly in the background and keeps both my computers synchronised.  And I have never experienced such a stable connection between my computers with other software. Thumbs up.Only setting up the ignore lists is a bit cumbersome and could be integrated directly into the app."
        },
        {
          "Note": 4,
          "Lieu": "RO",
          "Pseudo": "Adrian",
          "Nb_Reviews": 1,
          "Date": "2018-09-14T08:45:55.000Z",
          "Titre": "I had a great experience with the app…",
          "Contenu": "I had a great experience with the app so far, using it on my Windows PC, Linux laptop and phone. The phone app seems sometimes to have a later response then the other two platforms. Other than that, I find it hard to link any devices for the first time, requiring me to copy a code on some other medium and paste it to the machine I want to link. I think it is subpar from all the other features which work flawlessly and are easy to use."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kamil",
          "Nb_Reviews": 1,
          "Date": "2018-09-29T00:42:12.000Z",
          "Titre": "This is a great of a program",
          "Contenu": "This is a great of a program. There is only one flaw - it works slow when computer is restarted (and starts indexing). Suggestion: why don't you make a music app similar to Spotify, where you can sync playlists (yes, it impossible when you normally sync them into your cell phone), edit music. Maybe you can even buy Winamp and base it on it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "_burningtree",
          "Nb_Reviews": 1,
          "Date": "2019-09-18T16:44:11.000Z",
          "Titre": "Absolutely worth the money",
          "Contenu": "I switched my cloud backups and sync to this for more control and security. It works as a great replacement, if you have a NAS or home server setup. Software interfaces are of the same grade as most cloud providers, like Dropbox. But is just shy of a google cloud design and UI. Absolutely worth the money."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MK",
          "Nb_Reviews": 2,
          "Date": "2019-09-05T18:19:24.000Z",
          "Titre": "Its incredibly helpful in synchronizing…",
          "Contenu": "Its incredibly helpful in synchronizing files across multiple devices and saves a lot of time.The only problem I have right now is with Android app that quite often doesn't want to sync files with the PC even if the app is open (devices just don't see each other). Restart of the app help."
        },
        {
          "Note": 4,
          "Lieu": "AT",
          "Pseudo": "Markus R.",
          "Nb_Reviews": 2,
          "Date": "2018-09-23T09:59:37.000Z",
          "Titre": "Don't wanna miss this application anymore :)",
          "Contenu": "A great and simple application to connect different devices to synchronice files between each other, don't wanna miss it anymore. One star removed because of the lack of one important feature to give a 'label' on a share, to easy distinguish which is one when both shares uses the same directory name."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alexander",
          "Nb_Reviews": 2,
          "Date": "2019-05-02T14:18:17.000Z",
          "Titre": "Good syncing tool. But could be better",
          "Contenu": "Resilio runs fast and smoothly, and it's great to have such a secure ability to share documents with colleagues and clients using peer-2-peer connection. But on the other hand, it can be buggy from time to time and I won't call the support the best one. Interface could be also more logical."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Johnathan Rouse",
          "Nb_Reviews": 1,
          "Date": "2019-11-06T21:51:22.000Z",
          "Titre": "I love the software",
          "Contenu": "I love the software, and I love the services you provide, as well as redundancy in terms of connections... I just wish the other server's that are on YOUR side were just a BIT faster. It works great for files that are only a couple of Mbs, but over a Gb and you're done for."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "The Pinot Wookiie",
          "Nb_Reviews": 4,
          "Date": "2019-04-06T23:41:20.000Z",
          "Titre": "Useful alternative to Google Drive / Dropbox",
          "Contenu": "Searched for an alternative to Google Drive and Dropbox which is free of hassle. After trialling the free version of this platform for around 4 months, I upgraded to Home Pro for additional flexibility and sharing. I am very satisfied with the performance and security of this product."
        },
        {
          "Note": 4,
          "Lieu": "MY",
          "Pseudo": "khairul anwar mustapha",
          "Nb_Reviews": 1,
          "Date": "2019-11-04T08:12:11.000Z",
          "Titre": "Easy to manage files in different location",
          "Contenu": "Easy to manage. Really help in managing my file in different locations for my computers. Purchased for  1 home license pro. The discount is really a help for a lower currency exchange country.I will give 5 stars if my purchase 1 license cost can be converted to 5 licenses."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Raphael Wieschollek",
          "Nb_Reviews": 2,
          "Date": "2020-05-03T11:28:21.000Z",
          "Titre": "Only one thing seems to me missing",
          "Contenu": "Only one thing seems to me missing: a pdf handbook explaining simple and complex setup of Resilio Sync. But when working - try and error method needed - this tool works extremly fast when saving data from smartohones and tablets to my windows computers."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark V",
          "Nb_Reviews": 1,
          "Date": "2018-09-22T21:18:23.000Z",
          "Titre": "Indispensable",
          "Contenu": "Resilio Sync is pretty much flawless as far as synchronization, background transfer and data integrity go. My only issues have to do with memory and cpu overhead ... not extreme, but enough to force me to turn the service off occasionally when I really need the resources."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mason",
          "Nb_Reviews": 1,
          "Date": "2018-09-22T19:43:54.000Z",
          "Titre": "I personally love Resilio",
          "Contenu": "I personally love Resilio. The only reason it is not a 5 star is simply because it does require some measure of technical capacity to get the best use out of it. Not every consumer would find this \"easy to use.\" That said, it is fast, private and priced right."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "louije",
          "Nb_Reviews": 1,
          "Date": "2019-01-06T14:50:37.000Z",
          "Titre": "Self-hosted sync as it should be",
          "Contenu": "Self-hosted sync as it should be. Fast, cheap and without giving away data to outsiders. Installation on Linux Desktop, macOS and iOS was very fast and easy. I wish there had been an easier way to set it up on server Linux (without the recourse of the web GUI)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Igor Kupriyanchik",
          "Nb_Reviews": 1,
          "Date": "2019-12-05T02:10:40.000Z",
          "Titre": "What this app does feels like magic",
          "Contenu": "What this app does feels like magic, but the manual (setup instructions) is not clear; thus the setup is difficult. I would not be surprised to find that some people gave up altogether and forfeited the money spent. Hence there are 4 stars only."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel Anderson",
          "Nb_Reviews": 1,
          "Date": "2019-01-13T00:17:06.000Z",
          "Titre": "It's a great app",
          "Contenu": "It's a great app, and it's super useful. There are a lot of features still missing. Things like being quickly able to see what files have already been synced in selective sync mode for instance. It could easily get to a 5 star as it matures more."
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "Tarcilio Neto",
          "Nb_Reviews": 1,
          "Date": "2019-11-15T23:08:55.000Z",
          "Titre": "It has been working great so far",
          "Contenu": "It has been working great so far. It would be best if Resilio was accepted in more service apps as a sync option; Only issue so far is on large files. Resilio is getting stuck and uploading/downloading at a very small pace."
        },
        {
          "Note": 4,
          "Lieu": "GR",
          "Pseudo": "Georgios K",
          "Nb_Reviews": 4,
          "Date": "2021-05-13T18:16:18.000Z",
          "Titre": "It is working fine but it is not so…",
          "Contenu": "It is working fine but it is not so user friendly."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Nico Zeller",
          "Nb_Reviews": 1,
          "Date": "2018-12-04T17:10:31.000Z",
          "Titre": "A powerful cloud solution which can be…",
          "Contenu": "A powerful cloud solution which can be implemented easy and fast on nearly every platform. The ability to use one host server as a media platform to reduce the storage usage on the client platform (mobile) would be great!"
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2018-09-26T02:34:03.000Z",
          "Titre": "A struggle to understand properly",
          "Contenu": "When I understand how to use it best — or get lucky — it works great. But if I don’t use it regularly, I can’t figure out its model of operation and then it’s broken to me (my fault perhaps, but also a usability issue)."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Muppet",
          "Nb_Reviews": 1,
          "Date": "2018-09-23T05:09:49.000Z",
          "Titre": "I use resilio to sync Git repos…",
          "Contenu": "I use resilio to sync Git repos between multiple machines and virtual machines.  For the most part, this works great!  It can sometimes corrupt the repo on some of the other machines which is an occasional nuisance."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AM",
          "Nb_Reviews": 1,
          "Date": "2018-09-13T21:24:09.000Z",
          "Titre": "Resilio has amazing potential",
          "Contenu": "Product has amazing potential, and has made huge strides, but still falls short in UX to get a content shared from a directory on one machine to a directory on another.  Mobile sync-on-demand also has some challenges as it takes time to refresh the meta-data of a remote directory, but the app gives no indication of what is actually going on, it looks like the end-node is offline or that the app is just not working.That said, bang for buck there is nothing that can do what this app can do; it has become a critical part of my workflow by syncing folders on several machines. If they can improve the UX, or maybe just give better feedback on what is going on, it is a winner for a much wider audience."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "William Bateman",
          "Nb_Reviews": 2,
          "Date": "2019-04-01T07:54:25.000Z",
          "Titre": "Absolutely brilliant program that make…",
          "Contenu": "Absolutely brilliant program that make securely sharing data easy. If you have a collection of remotely operating machines, then Resilio is by far the fastest means of synchronising data across them."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Bernard",
          "Nb_Reviews": 6,
          "Date": "2018-09-14T09:18:41.000Z",
          "Titre": "Great cost-effective private cloud solution",
          "Contenu": "Great, cost-effective private cloud solution.Sole point of critique: no clear way to replace \"owner\" of folder of file if the original owner device (PC laptop) crashes or is otherwise lost."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Jay",
          "Nb_Reviews": 1,
          "Date": "2018-12-28T17:16:47.000Z",
          "Titre": "I love your product, but room for improvement.",
          "Contenu": "I love your product.  Very useful.  However, there's still a few things that could be improved.  Once there was a folder shared between 3 devices that wouldn't stop syncing (just static image files, no files that'd dynamically change) and it only stopped once I removed all files from the folder.  It'd be also great if there was a way to link devices without having to manually connect each device with each-other.  Also, a way to change folder names and identity names without having to remove/re-add them would be handy...I'm still not totally sure how I was able to do it.  I had an autogenerated name for my identity on one device and I had to add/remove devices and rename until it finally changed it to what I wanted"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Carsten Kalka",
          "Nb_Reviews": 1,
          "Date": "2020-06-14T16:49:57.000Z",
          "Titre": "Everything perfect"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Sagnik",
          "Nb_Reviews": 1,
          "Date": "2018-09-21T19:23:08.000Z",
          "Titre": "It lacks some features that I would…",
          "Contenu": "It lacks some features that I would like to see, or rather bugs that I would prefer be removed but other than that very seamless experience. It is my daily driver for wireless transfers in home."
        },
        {
          "Note": 4,
          "Lieu": "SE",
          "Pseudo": "Tommy Svensson",
          "Nb_Reviews": 7,
          "Date": "2019-07-14T20:36:23.000Z",
          "Titre": "Working great on all my platforms…",
          "Contenu": "Working great on all my platforms except IOS. But thats not Resilios problem. Apple has a number of specifik platforms behavior.I am sure Resilio has implemented it as good as its possible."
        },
        {
          "Note": 4,
          "Lieu": "RU",
          "Pseudo": "Petr Kalambet",
          "Nb_Reviews": 1,
          "Date": "2018-12-04T08:09:22.000Z",
          "Titre": "The one thing I'm missing most of all",
          "Contenu": "The one thing I'm missing most of all is to have ability to choose destination folder location and folder name. Plus it would be perfect to untie shared folder name and share name itself."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JH",
          "Nb_Reviews": 1,
          "Date": "2018-09-14T03:08:51.000Z",
          "Titre": "Very good software",
          "Contenu": "Very good software. Wish it was a easier to configure, easier to re-configure mistakes, easier to re-configure when files have to move to another drive. All the setting in one place. Thanks."
        },
        {
          "Note": 4,
          "Lieu": "RU",
          "Pseudo": "DIAKOV",
          "Nb_Reviews": 1,
          "Date": "2018-09-15T14:38:21.000Z",
          "Titre": "The app very slow start in Windows 10",
          "Contenu": "The app very slow start in Windows 10, android, IOS.Then I used BitSinc 1.4 in Windows, satisfaction was 100%, because it worked quickly, and did not consume a lot of computer resources."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Ron Br",
          "Nb_Reviews": 2,
          "Date": "2018-09-22T01:13:26.000Z",
          "Titre": "Highly flexible product",
          "Contenu": "Highly flexible product; used for a variety of syncing & backup use cases in my family. Take a bit of time to totally figure out, but the investment in time is worth it"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anthony",
          "Nb_Reviews": 1,
          "Date": "2018-12-27T16:58:16.000Z",
          "Titre": "Great tech",
          "Contenu": "Great tech, easy to set up on MacOS and Windows. Would be nice to have an easier setup on Raspberry Pi hardware, maybe listing what builds work best on which Pi devices."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Flo",
          "Nb_Reviews": 1,
          "Date": "2018-09-15T19:02:17.000Z",
          "Titre": "The sync function is absolutely great",
          "Contenu": "The sync function is absolutely great, but I wish it would be easier to send a file directly to someone else (maybe even without having them installed Resilio sync apps)"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Gyula Weber",
          "Nb_Reviews": 1,
          "Date": "2019-12-13T20:26:00.000Z",
          "Titre": "Very good and stable application",
          "Contenu": "Very good and stable application, I can only recommend it. Requires some understanding about what you can change, and what you can not, but it totally worth it."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Cornel",
          "Nb_Reviews": 1,
          "Date": "2019-04-02T19:23:48.000Z",
          "Titre": "Works OK but crashes from time to time",
          "Contenu": "Works OK but crashes from time to time. Tool tips would also be nice to understand how it works.iOS app crashes regularly and does not seem to be fully-developed."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Janek",
          "Nb_Reviews": 1,
          "Date": "2019-01-02T10:16:24.000Z",
          "Titre": "The product works great, support could be better",
          "Contenu": "The product works great, but the support wasn't particularly helpful when my purchase didn't work at first and I'd like to have a proper Linux version."
        },
        {
          "Note": 4,
          "Lieu": "TH",
          "Pseudo": "VijayS",
          "Nb_Reviews": 2,
          "Date": "2019-12-08T17:41:47.000Z",
          "Titre": "Great software for personal sync with…",
          "Contenu": "Great software for personal sync with high security for geeks.There is occassionally unusual high CPU usage, with logs showing connections from others."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Davide",
          "Nb_Reviews": 1,
          "Date": "2018-09-14T06:09:44.000Z",
          "Titre": "Best in class",
          "Contenu": "Best in class, just missing a slightly tighter integration with the systems (I know it's multi platform, so it's ok... :) ). 4,5 stars more than 4 :D"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Dan Mossip",
          "Nb_Reviews": 1,
          "Date": "2018-12-24T15:48:23.000Z",
          "Titre": "I have only recently purchased the…",
          "Contenu": "I have only recently purchased the product, but have yet to find anything that was not simple and easily laid out to make it work the way i wanted it to."
        },
        {
          "Note": 4,
          "Lieu": "CN",
          "Pseudo": "pp ruan",
          "Nb_Reviews": 1,
          "Date": "2019-01-02T06:02:05.000Z",
          "Titre": "Experience bad in China",
          "Contenu": "Because I can't use your service in China, the experience is very poor. I hope that you have other ways to make the products available in China."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas Harrington",
          "Nb_Reviews": 1,
          "Date": "2018-12-14T22:51:23.000Z",
          "Titre": "Recommended.",
          "Contenu": "Has worked reliably for me for a few years now. Syncing between Macs is great and easy to use. Adding cloud-based sync takes some expertise."
        },
        {
          "Note": 4,
          "Lieu": "HK",
          "Pseudo": "Karl",
          "Nb_Reviews": 4,
          "Date": "2018-09-21T23:53:39.000Z",
          "Titre": "It's a great product, but",
          "Contenu": "It's a great product, but it's taken really long to get user interface and performance improvements for the Synology version."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2018-09-28T19:10:11.000Z",
          "Titre": "Great app",
          "Contenu": "Great app.  I've been a heavy user for years.  Only drops a star because it uses a lot of memory when syncing tons of files."
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Roland Skinner",
          "Nb_Reviews": 1,
          "Date": "2019-10-01T16:39:13.000Z",
          "Titre": "Works well",
          "Contenu": "Works well, and I don't have the worry of losing code changes while in transit, should I be working on-site at a client."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2018-09-21T20:42:04.000Z",
          "Titre": "Great for synchronizing my work across…",
          "Contenu": "Great for synchronizing my work across computers! I wish the phone app would sync a little more quickly when taking pictures."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "TheG",
          "Nb_Reviews": 1,
          "Date": "2019-08-29T20:18:27.000Z",
          "Titre": "Great product but...",
          "Contenu": "Great product. The only problem is that it often wont sync immediately but with 39-60min delay. But still the best option."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "magdesign",
          "Nb_Reviews": 1,
          "Date": "2018-12-25T00:55:38.000Z",
          "Titre": "Great tool.",
          "Contenu": "Great tool. After using Synoloy cloud for years I completely switched to resilio sync. Super fast and reliable. Recommend."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Stefan Stähli",
          "Nb_Reviews": 1,
          "Date": "2019-01-02T08:30:58.000Z",
          "Titre": "Works fine",
          "Contenu": "Works fine. Linux Server Install is a little more tricky but still easy. I miss the Log off  button on the Linux Web GUI."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2018-09-21T05:33:12.000Z",
          "Titre": "Advanced knowledge to resilio sync is…",
          "Contenu": "Advanced knowledge to resilio sync is not easy to find. And I am missing a simmilar GUI on Linux as I find in Windows"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Edward Torres",
          "Nb_Reviews": 2,
          "Date": "2019-05-03T22:30:42.000Z",
          "Titre": "Still a bit confusing to use",
          "Contenu": "Still a bit confusing to use. I feel like I haven’t been able to get a good grasp oh how things can be shared."
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "Sallim",
          "Nb_Reviews": 7,
          "Date": "2018-09-21T23:49:29.000Z",
          "Titre": "So far the process has been smooth",
          "Contenu": "So far the process has been smooth. Although the configuring needed some trial and error but got it in the end."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Miguel",
          "Nb_Reviews": 1,
          "Date": "2018-09-21T23:27:18.000Z",
          "Titre": "Very convinient, but",
          "Contenu": "Very convinient, but it sucks that when you share a file, the other person must have Resilio installed as well."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Jose",
          "Nb_Reviews": 2,
          "Date": "2018-10-01T06:56:49.000Z",
          "Titre": "Good application",
          "Contenu": "Good application. I really use it a lot. There is room for improvement but it will be there. I recommend it."
        },
        {
          "Note": 4,
          "Lieu": "RU",
          "Pseudo": "ilya",
          "Nb_Reviews": 1,
          "Date": "2018-09-14T04:13:04.000Z",
          "Titre": "Sometimes there is a problem with the…",
          "Contenu": "Sometimes there is a problem with the speed of file transfer and the connection of new users to the folder"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Kai",
          "Nb_Reviews": 1,
          "Date": "2018-12-06T10:05:17.000Z",
          "Titre": "Great Software.",
          "Contenu": "Great Software.Posibility to share simple file without clientinstallation would be the last star for me"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Martin",
          "Nb_Reviews": 1,
          "Date": "2018-09-28T19:57:46.000Z",
          "Titre": "would be better if it could open itself…",
          "Contenu": "would be better if it could open itself in background on system restart, but in general it's great"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "derek",
          "Nb_Reviews": 1,
          "Date": "2018-09-20T23:05:38.000Z",
          "Titre": "It works really good",
          "Contenu": "It works really good, and quickly, or as quick as my internet allows. But generally the folders respond very quickly, unlike google drive which is always hit or miss when it responds. I would like some stuff to be easier, or more user friendly. Here are some examples. 1. Moving a folder. If I want to move a folder somewhere, new folder, new drive, etc. A simple option within the interface would be nice. 2. Adding two different folders that have the same stuff in them. Just yesterday I wanted to add my two music folders. One on my PC, the other on a SD card on my phone. This way its way easier to keep my music synced with a master library. I start doing that and Sync says there is stuff already in the folder. Yeah, duh I know, Its the exact same POOP, except for one album. Maybe the option to have a one way mirror a folder. I had to delete all the music on my phone so there wouldn't be any issues. 3. Yesterday when I was setting up the music sync, I did it on the wrong computer. I should have done it on my server computer where the music is, but I did it on my pc. Now I have to set that up to do that. I don't know how, and I might have to delete all my music again just so I can have it as I want."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Adam S",
          "Nb_Reviews": 1,
          "Date": "2019-05-30T19:50:51.000Z",
          "Titre": "Great product",
          "Contenu": "Great product. I do occasionally have issues syncing to my NAS box other than this it's great!"
        },
        {
          "Note": 4,
          "Lieu": "CN",
          "Pseudo": "Yuan Wang",
          "Nb_Reviews": 1,
          "Date": "2018-12-10T01:22:49.000Z",
          "Titre": "Resilio is very good",
          "Contenu": "Resilio is very good, but can not be used normally in China, it seems to be related to China GFW"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rgator",
          "Nb_Reviews": 1,
          "Date": "2018-09-21T18:34:05.000Z",
          "Titre": "A great tool to have",
          "Contenu": "A great tool to have when you have two or more computers and a few external hard drives!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Martin Welsch",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T11:58:02.000Z",
          "Titre": "Excellent tool server less replication!",
          "Contenu": "Excellent tool for replication without single point of control (failure). Full 5 stars for promised and provided functionality. Good feature 'encrypted folders'. However, this does not provide 'boxcryptor like' functionality! I would strongly wish Resilio would include file level transparent encryption/decryption like boxcryptor did."
        },
        {
          "Note": 5,
          "Lieu": "IS",
          "Pseudo": "Toti Arna",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T11:17:12.000Z",
          "Titre": "Easy to use and works",
          "Contenu": "Works \"out of the box\" and super fast. Have been using for the last 5 years on many computers without any major issues.Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Jens",
          "Nb_Reviews": 2,
          "Date": "2023-11-25T14:42:16.000Z",
          "Titre": "Resilio sync - perfectly",
          "Contenu": "Bought Resilio sync online, everything worked perfectly. The product itself is just a little expensive."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Biju A",
          "Nb_Reviews": 3,
          "Date": "2023-11-29T10:05:13.000Z",
          "Titre": "Very straight forward Sync",
          "Contenu": "Very straight forward SyncNo fuss and nothing complicated. Just the very function it is supposed to do is done with aplomb."
        },
        {
          "Note": 5,
          "Lieu": "HR",
          "Pseudo": "Jurica Parsic",
          "Nb_Reviews": 1,
          "Date": "2022-05-05T14:26:18.000Z",
          "Titre": "Resilio is effective and easy to configure",
          "Contenu": "I have tried several apps that would suit my needs and Resilio proved to be the best so far. After intial setup it continued working in the background. On my Pc the console is easily accessible from the browser should I need to edit configuration. ProsSimple and easy to configure, automation, synchronization without 3rd party serverConsstatus when client goes offline, no file version history"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "D A",
          "Nb_Reviews": 1,
          "Date": "2023-01-21T19:48:47.000Z",
          "Titre": "Terrific program! Just get it!",
          "Contenu": "This is perhaps the most useful program I have ever come across. Easy to sync folders across multiple devices, encryption, sharing, probably lots of other features I haven't figured out yet. Encrypt your cloud folders, see all your files on mobile, everything syncs so fast it's unbelievable. Just get it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Video producer",
          "Nb_Reviews": 1,
          "Date": "2022-03-18T14:05:34.000Z",
          "Titre": "Just get it",
          "Contenu": "I'm a video producer with a work schedule split between home and office. Moving hard drives back and forth was getting to be a pain, and cloud-based services were too slow and did not offer enough storage. I wanted a fast, automatic, secure P2P solution. Enter Resilio - I only wish I had looked into this sooner! After testing the full-feature trial version, I was sold."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Markus M.",
          "Nb_Reviews": 1,
          "Date": "2022-04-27T17:08:27.453Z",
          "Titre": "Exactly what I was looking for",
          "Contenu": "Exactly what I was looking for. Works well from beginning, has all and just the functions which are actually useful und a clear, well desined UI. Can be installed on my NAS and now keeps my PC/Laptops synced in nearly real time, so I can continue work I did on one seamlessly on another. Transferring data from my smartphone without an usb-cable and manual work is much more comfortable. Only a few limitations on an android (e.g. deleting files on a linked Computer does not delete them on the smartphone) are a little annoying). For me the advanced folders and selective sync option are worth the price for the Home Pro version."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Simone Caselli",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T20:42:56.000Z",
          "Titre": "easy to use, useful for simplifying",
          "Contenu": "Simply usefully and easy to use in keeping sync your docs.Thanks a lot"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Ellis",
          "Nb_Reviews": 3,
          "Date": "2022-04-27T18:02:37.171Z",
          "Titre": "Resilio Sync is amazing! Better than Dropbox, Google Drive, Synology Drive, and syncthing!",
          "Contenu": "Resilio Sync is amazing! I installed it on my Synology NAS and I've been using it to synchronize files across three different hosts. Before Resilio sync, I tried using Synology Drive, Dropbox, Google Drive, and syncthing, but Resilio Sync blows them all out of the water. Self hosted, *fast*, and it just works. I couldn't ask for more. I'll never use anything else. It is seriously amazing."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Creative Spades",
          "Nb_Reviews": 2,
          "Date": "2022-11-22T21:39:23.000Z",
          "Titre": "Full 5 stars...and it can be even better!",
          "Contenu": "The software is not perfect and requires some more work. But over all it's a full 5 stars software.Syncing is a breeze and the interface is close to perfect.I would love the addition of another few little features that I'm sure would be of no effort to include (like syncing folders/hdd on the same machine with mirroring capabilities). Maybe, who knows, it might be something in the future."
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Panzerklein4",
          "Nb_Reviews": 2,
          "Date": "2022-12-12T16:43:56.000Z",
          "Titre": "Fantastic method for fast Personal Backup",
          "Contenu": "Used this application since it was know as Bittorrent Sync, and was happy with it. After transforming into Resilio Sync it received a whole new vibe with the creation of the Apk for Android (and IOS) that created the possibility of fast backup and sharing with your smart device.Be happy with a nice application for your backup needs and Support the devs."
        },
        {
          "Note": 5,
          "Lieu": "AR",
          "Pseudo": "Franco B.",
          "Nb_Reviews": 3,
          "Date": "2020-05-19T20:20:30.000Z",
          "Titre": "Best app for the job.",
          "Contenu": "I've tried a lot of apps to sync/backup/share files. Some do some of these tasks well but fail in others. With Resylio Sync I can make a synchronized off-site backup of important folders and documents for which I cannot use cloud services because the volume of information is too big and makes prices inaccessible.The selective synchronization was the main reason why I switched to the paid plan. Now I can access all the files on a PC from other PCs, without taking up space."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris S",
          "Nb_Reviews": 1,
          "Date": "2022-02-19T21:46:51.000Z",
          "Titre": "Resilio Sync - excellent for file distribution",
          "Contenu": "Resilio Sync is a wonderful product. It is easy to try out and easy to purchase the premium features. While it turned out not to be particularly fast for transferring very large folders of files, it works very well for transferring smaller (up to 100 MB) files back and forth between two computers in a seconds. And the purchase of the premium version is a permanent license, not a subscription, which is more difficult to find nowadays."
        },
        {
          "Note": 5,
          "Lieu": "TR",
          "Pseudo": "silop",
          "Nb_Reviews": 1,
          "Date": "2020-09-17T06:22:21.000Z",
          "Titre": "Goodbye rainy clouds...",
          "Contenu": "For years I used several cloud providers for syncing my files between my devices. Since I have several TBs of data to sync, none of the cloud solution were feasible. They are either too expensive or do not provide sufficient storage. Since I started using Resilio Sync I no longer worry about price/storageissues. Resilio Sync is perfect for syncing without a cloud provider. Definitely recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris C.",
          "Nb_Reviews": 1,
          "Date": "2021-08-04T20:28:54.000Z",
          "Titre": "Simple Sync - All Around Great Product",
          "Contenu": "Wanted to try Resilio for a couple reasons.  Liked the fact the license is a one-time price and not a subscription model.  What I've enjoyed the most is the multi-device linking capabilities.  Having work, cell and home folders synced up is a great feeling knowing that you always have those important files synced at a second location.  I'm looking into a NAS setup and being able to easily integrate with Resilio is top of the list for a simple, solid solution.  Overall, a fantastic, easy to setup and sync product and would highly recommend giving it a try. Definitely take advantage of trying PRO so that you can see how great the solution really is.  Customer for life!"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Bas van den Wollenberg",
          "Nb_Reviews": 3,
          "Date": "2020-08-03T08:15:56.000Z",
          "Titre": "Easy to use and just works, has been solid for years",
          "Contenu": "I've been using Resilio Sync for years, it was the first time I ever paid for software as a teenager. It really \"just works\" on just about any platform I've tried (mainly Linux, Windows, and Android, both servers and personal devices).It's getting harder to find software that doesn't rely on a monthly subscription, the one-time payment for Resilio Sync is more than worth it."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Andrzej Bargiela",
          "Nb_Reviews": 5,
          "Date": "2023-06-14T18:54:04.000Z",
          "Titre": "After assessing the PRO product I found…",
          "Contenu": "After assessing the PRO product I found that my specific needs were not covered. I requested a refund and was promptly served by their customer support who swiftly processed the refund.Thank you and look forward to your new products."
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "Ph",
          "Nb_Reviews": 2,
          "Date": "2023-09-29T23:32:04.000Z",
          "Titre": "That is what I want",
          "Contenu": "For one thing I find the program great; it does what everyone thinks must be possible, but everything you try loads your data in the cloud ... but I have plenty of storage at home to use for that.The other thing is, if you use it provately, you can use the demo version indefinitely without charge ... that is really worth a lot. So I tried it a while, and now I pay. Once. No Abo or something, maybe I wil by a licence again next year, just because I find this great and refreshing. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Wade",
          "Nb_Reviews": 2,
          "Date": "2021-09-28T04:00:12.000Z",
          "Titre": "Finally went Pro",
          "Contenu": "I have used resilio for years to sync my two home computers. Now that I have a server and an additional PC it became necessary to move to pro. The pro version has allowed me to easily share folders between devices and selectively download files as required rather than having to have large HDDs in each device."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "T Santangelo",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T00:46:00.000Z",
          "Titre": "You've got to give them credit for…",
          "Contenu": "You've got to give them credit for actually coming up with a solution that will free you from the cloud.  Well done! Now I would like them to update the UI to make it more understandable as to what is going on. Read-write, or read-only, yeah I think I get it, but it's not intuitive at first. In fact it's not intuitive at all. Would love to have a clearer picture of what is going on behind the scenes. Perhaps more prompts, like, are you sure you want to....etc."
        },
        {
          "Note": 5,
          "Lieu": "SK",
          "Pseudo": "RT",
          "Nb_Reviews": 2,
          "Date": "2021-07-02T20:53:07.000Z",
          "Titre": "Very dependable solution",
          "Contenu": "Very dependable solution. Software tools (Sync apps are very focused on their functionality, and work well across Windows, Mac, NAS, Android, Haven't tested iOS yet). Files transfers are fast even across the planet"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Yo",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T10:47:07.000Z",
          "Titre": "Powerful tool",
          "Contenu": "Rather easy to discover, found what I needed on the doc, available & documented for linux.At the end, it's so practical, fast & useful, just as the cloud but without it!!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Marcus",
          "Nb_Reviews": 3,
          "Date": "2020-05-16T11:17:14.000Z",
          "Titre": "I've been using Resilio since 2015…",
          "Contenu": "I've been using Resilio since 2015 across multiple computers and continents over the years with very few, if no problems. It's perhaps a bit technical to set up but that's become so much easier over the years. The Archive feature has certainly saved me a few times when something critical has gone missing that Time Machine and even Git missed! what I love is that Resilio is -super- fast and I'm in control of all my data. I've linked it to a few key folders so my Desktop is always in sync and I've never once opened an older version of a document. I really recommend this over a few other big competitors who I've found either slow (as in days to just create file placeholders) or very readily creates conflicts. Keep up the good work!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2020-06-11T00:14:27.000Z",
          "Titre": "Love being able to easily share files…",
          "Contenu": "Love being able to easily share files between my iPad, Windows PC, MacBook Pro, and Android phone though my LAN at high speeds. This is pretty much my multiplatform airdrop replacement, but with more features."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Devoted To Christ",
          "Nb_Reviews": 4,
          "Date": "2021-04-11T05:56:01.000Z",
          "Titre": "Resilio is like no other sync program. It's a brilliant application.",
          "Contenu": "Resilio is like no other sync program I've used. I like its unique and very solid way of syncing files between computers on my local network. I absolutely love this software. I struggled with this for years and along came Resilio! It is a brilliant application that the developers should really feel proud of. It is amazing how well it works, and consistently the files are identical on all computers with no glitches."
        },
        {
          "Note": 5,
          "Lieu": "NO",
          "Pseudo": "Richard",
          "Nb_Reviews": 5,
          "Date": "2021-04-05T14:26:10.000Z",
          "Titre": "Essential for my workflow nowadays",
          "Contenu": "Essential for my workflow nowadays, use it to sync all my music-, and video projects between computers and companions, great stuff. Just be careful not to sync a folder within a sync folder which creates a loop which may corrupt all your files."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Seth Robinson",
          "Nb_Reviews": 1,
          "Date": "2020-12-12T15:44:55.000Z",
          "Titre": "Private, Simple, and Effective",
          "Contenu": "We no longer had the desire to keep our data in \"the cloud\" so began the long search for a program that we could host privately at home.  I was gearing up to build a small server that ran a semi-complicated application until we gave Resilio a trial run.  The serverless file synchronization between several computers and phones has proven to be a dependable mechanism thus far. I have files completely mirrored on two computers which is my full backup.  The \"selective sync\" feature is very neat, particularly for mobile devices. For example, keeping my KeePass database replicated across my phone and laptop as well as pictures.This an awesome and simple program.  Highly recommend it if you're in IT  and don't want to screw around with this stuff after checking out for the day.  Great job here, folks at Resilio!"
        },
        {
          "Note": 5,
          "Lieu": "RU",
          "Pseudo": "Alexei Shvalev",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T09:44:09.000Z",
          "Titre": "Great app for syncing anything",
          "Contenu": "I use the pro version. Super. The ease of creating and syncing is amazing. Create a folder anywhere - computer, laptop, phone - and that folder appears on all devices at once! It's magical. All you have to do is select the options you want as that folder will sync to that particular device. I highly recommend it!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "EpsilonAlpha",
          "Nb_Reviews": 1,
          "Date": "2022-04-09T20:02:13.000Z",
          "Titre": "Better than Dropbox",
          "Contenu": "Dropbox deleted my account, for no reason after i spend barely 1k on their service. Lucky my data was still on my Devices, but how to get it in sync again? Here Resilio came into place: It barely seemless integrated into my workflows and expanded and improved the redundance and performance of my Data, omni-present and always backed up"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Saraj Mollah",
          "Nb_Reviews": 2,
          "Date": "2021-05-14T19:32:18.000Z",
          "Titre": "After 5 years of using Rsync",
          "Contenu": "After 5 years of using Rsync, I have recently bought the pro version of Resilio sync and it made transferring data through PC much better. With the power of Peer to Peer technology, it is much faster and securer than the cloud. All of my friends in college loves this software especially group work. I think you should download it too!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kyle",
          "Nb_Reviews": 1,
          "Date": "2021-12-04T04:28:57.000Z",
          "Titre": "Great piece of software!",
          "Contenu": "Great piece of software! I used it to set up my own little server with an old computer as the “always on” hub for transferring my files between all my devices. I just hope that this is still being actively developed because it’s been awhile between version numbers and I really hope it continues because it’s a great solution for those of us who either don’t trust — or don’t want to pay for— cloud storage when all we need is a piece of software and a spare computer and suddenly my “cloud” is limited only by how much drive space I connect to my devices:"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2020-09-13T02:15:36.000Z",
          "Titre": "I should have transitioned long ago",
          "Contenu": "I have had a business Dropbox account for as long as Dropbox has had business accounts. I kept it for convenience to sync 7TB worth of images amongst a few computers in near realtime. Every once in a while dropbox would get out of sync on a computer and it would take 4 days to re-sync. Every time it did that I would curse and say \"if it does it again, I'm getting rid of Dropbox\".About the twelfth time it did it I finally made a switch. Resilio is orders of magnitude better than Dropbox. It's actually unfair to even compare the two Resilio is so far ahead. Laziness cost me thousands of dollars a year and weeks of headaches."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Paco Gimeno",
          "Nb_Reviews": 2,
          "Date": "2023-05-09T09:24:21.000Z",
          "Titre": "Resilio Sync is amazing",
          "Contenu": "I have been using Resilio Sync for years now and it's the best app around for syncing files between my devices. I don't think there is a day I'm not using it. The UI and UX is great and not bloated, even the free version is ad-free. After many years I have decided to buy the pro version and the way that handle selective sync is incredibly good and user friendly."
        },
        {
          "Note": 5,
          "Lieu": "DK",
          "Pseudo": "Anders",
          "Nb_Reviews": 23,
          "Date": "2020-08-09T16:54:01.000Z",
          "Titre": "Used this synchonization SW for years…",
          "Contenu": "I have used this synchonization SW for years; the first years was a bit rocky where you had to reboot the sync several times. The BT Sync product was pretty good but after the Resilio sync launch, the product is pretty resilient for most purposes. I have bought the Pro version and the customer service is good to follow up on any issues - and eventually solve them..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Biao",
          "Nb_Reviews": 1,
          "Date": "2020-05-10T02:25:45.000Z",
          "Titre": "Works perfectly for my use cases",
          "Contenu": "My main two use cases: one is the non frequently in use files backup, and another is to make more space on my laptop by putting files in to remote.So far the sync product perfectly  satisfies my requirements and works very well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Craig",
          "Nb_Reviews": 4,
          "Date": "2021-02-10T15:05:30.000Z",
          "Titre": "Upgraded to Pro after using Free for many years.",
          "Contenu": "Upgraded to Resilio Sync Pro after using Free for many years. My Setup follows (long story):  I Sync my 2019 MacBook Pro 16 with 4Tb SSD with my retired 2013 MacBook Pro with 2 - 1Tb SSD's, both currently on Catalina.  Have not upgraded the new MBP to Big Sur yet, as I want to make sure Resilio is fully compatible.  Also added a 6Tb HDD as an E:Drive to my W10 PC for a 3rd backup.  Mac to Mac to PC and all syncs perfectly.  File names need to be adjusted since the Mac can use symbols like \"|\", \"/\", \"\\\", etc., but the PC cannot.  It replaces with another symbol and duplicates the folder. I do light video production, and I back up my 2019 Mac's \"Movies\" Folder with all my Final Cut Pro Libraries ONLY to the PC and have given the PC \"Read-only\" privileges.  Additionally, I have a Lacie 5Tb external on my 2019 MBP for Time Machine, which is Apples incremental backup program.  I feel confident I am covered and if anything happens, I can pick up instantly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zach Losacker",
          "Nb_Reviews": 1,
          "Date": "2020-12-06T14:31:20.000Z",
          "Titre": "Cloud-Storage Replacement",
          "Contenu": "If you are looking for a replacement to cloud storage, and want to use a pool of storage you have sitting and not being used, this is the way to go! I’m in the process of moving my files from Google Drive (due to an application error by Google) to Resilio and using storage that I had sitting in my desk. The only suggestion I would recommend is lower cost. $60 for 1 user is a little much...I made the purchase, but it was almost difficult to justify the purchase, despite the program doing what I needed it to do. Other than that, this is a great program!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Max Planck",
          "Nb_Reviews": 4,
          "Date": "2023-05-26T14:00:41.000Z",
          "Titre": "Best of the best",
          "Contenu": "Best of the best - after a long odyssey between Dropbox, Nextcloud, Owncloud and whatever - this is the only solution that gives full freedom and control over the data while being fast and reliable."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Arvydas",
          "Nb_Reviews": 2,
          "Date": "2020-06-17T18:30:28.000Z",
          "Titre": "Excellent for super large transfers",
          "Contenu": "I've been using Resilio to facilitate file transfers of up to 5TB over the internet (film post production) and so far it has not failed me! It is excellent as a large file transfer tool, however it's not great for actual syncing as it fails to properly identify duplicate files and  causes all sorts of weird glitches and data loss when using it for actual synchronization. But for simple, fast, large file transfer, it's excellent!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Wojciech Klepacki",
          "Nb_Reviews": 10,
          "Date": "2023-10-09T05:31:57.000Z",
          "Titre": "It fits my needs",
          "Contenu": "It's a great product if you know what to expect. I use it to synch folders between my Linux laptops, my office Windows powered desktop and my Android phone."
        },
        {
          "Note": 5,
          "Lieu": "MY",
          "Pseudo": "Jon",
          "Nb_Reviews": 1,
          "Date": "2022-04-18T04:00:32.000Z",
          "Titre": "Deep learning curve and good 14 days…",
          "Contenu": "Deep learning curve and good 14 days trial run before the purchase, and worth it especially if you are on multi OS. Speed is fastest I have ever seen in a WiFi file transfer. 95% stability so far."
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "David H",
          "Nb_Reviews": 2,
          "Date": "2023-03-07T14:56:16.000Z",
          "Titre": "Resilio gets my recommendation.",
          "Contenu": "Reliable file sync between my Linux, iOS, macOS and Windows terminals, local or remote with nothing stored in cloud. Add file sharing by links and a lifetime license, Resilio gets my recommendation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dante Ironheart",
          "Nb_Reviews": 1,
          "Date": "2022-09-11T01:26:58.000Z",
          "Titre": "Best solution I could ever find that…",
          "Contenu": "Best solution I could ever find that provides synchronization with files and folders of my choice locally and remotely with high transfer rates. It does everything I wanted to therefore I got the Pro via the Synology app (though I think it's a community app so you may have to upload the store or application file). As the Synology user, I've been looking for a reliable solution and alternative to the buggy Synology drive app on my Android. Don't get me wrong, The app in Synology drive works great on Windows 10. However I've tried to sync the approximate 300 GB on my 1 TB microSD card with my Synology. For some reason it keeps crashing. I've even tried using RoboCopy command to preserve the time stamps. to help it alone and it was doing well then it crashed again. Next I tried FolderSync (way too technical). Next I tried, Resilio and to speed things along used RoboCopy again synced instantly with a couple of redundant conflicts (extra file of something that couldn't be determined whether it was new or old) which was expected but everything's been running smoothly. Feel free to delete the extra files that conflict if you use RoboCopy to save time it'll save you space or you could Just do it the long way and you should be fine."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BlueIris",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T05:50:06.000Z",
          "Titre": "I've tried to use other software that…",
          "Contenu": "I've tried to use other software that made me use a forum for assistance with so-so results, but this was the BEST!  My issues were resolved."
        },
        {
          "Note": 5,
          "Lieu": "KH",
          "Pseudo": "Ben",
          "Nb_Reviews": 1,
          "Date": "2022-07-08T12:02:49.000Z",
          "Titre": "Excellent product",
          "Contenu": "Excellent product, works perfectly. And it's not a monthly subscription price, so really excellent!I would just add that the website is not super clear, and it took me time to figure out which offer fitted me. And the Linux app could be a bit easier too.Still a great product!"
        },
        {
          "Note": 5,
          "Lieu": "DK",
          "Pseudo": "Per",
          "Nb_Reviews": 24,
          "Date": "2020-06-16T18:17:38.000Z",
          "Titre": "Really useful",
          "Contenu": "Really useful - no limits on how large files and no privacy issues when files stay local.I especially use it for syncing large movie recording / editing sessions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rocco",
          "Nb_Reviews": 1,
          "Date": "2021-07-16T22:20:17.000Z",
          "Titre": "Great Software!",
          "Contenu": "Perfect for syncing files across my phone, Windows PC, and Ubuntu server. The server acts as an always-online peer for the other two as well as a backup. Great way to de-Googleify a workflow."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Perez",
          "Nb_Reviews": 2,
          "Date": "2022-03-21T18:09:33.000Z",
          "Titre": "I've been using Sync for my personal…",
          "Contenu": "I've been using Sync for my personal stuff for a year and PRO tier offers me the advantages os selective sync and free pc space.Pretty happy with the upgrade!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "D Bailey",
          "Nb_Reviews": 1,
          "Date": "2020-07-16T20:10:58.000Z",
          "Titre": "Sync Pro has worked like a charm once I…",
          "Contenu": "Sync Pro has worked like a charm once I figured out that I needed to use the same identity name on all clients (peers). Very handy for accessing files from my work laptop or phone without needing to chew up space for all of them."
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "Miguel Mendonca",
          "Nb_Reviews": 6,
          "Date": "2020-07-01T14:23:11.000Z",
          "Titre": "Awesome P2P sync service",
          "Contenu": "Awesome service that really excels at P2P syncing. I use it with Dropbox on certain platforms where the official application is not supported (e.g. Windows ARM64)."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Johannes Bitsch",
          "Nb_Reviews": 1,
          "Date": "2022-02-11T08:12:37.000Z",
          "Titre": "Perfect Tool…",
          "Contenu": "The Time between installation and the productivity start was less then 10 minutes… I couldn’t believe this and double-checked it several times.But it works perfectly. Period."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Ashley",
          "Nb_Reviews": 1,
          "Date": "2020-08-12T01:19:12.000Z",
          "Titre": "Been using Resilio for a few weeks ago…",
          "Contenu": "Been using Resilio for a few weeks now with a Synology Nas and a couple of Windows PC's and it has been rock solid, I don't have to worry about what it is doing as it just works. Easy to setup and quick to sync!"
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "Frank Klin",
          "Nb_Reviews": 1,
          "Date": "2022-12-05T20:03:51.000Z",
          "Titre": "Overall i am happy with the product.",
          "Contenu": "Overall i am happy with the product.What i need to have.1.need Android tv support2Community is not active 3 new version has a lot of time to be releasedMemory is always increasing when delete and insert files and 1gb nas has problems. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "Bayazid B.H.",
          "Nb_Reviews": 1,
          "Date": "2023-02-19T17:18:41.000Z",
          "Titre": "Straightforward purchasing process",
          "Contenu": "Straightforward purchasing process, not too many things to fill, no subscription, just purchase, get key, and now you can use rslsync Pro features."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dustin Massey",
          "Nb_Reviews": 3,
          "Date": "2020-06-13T18:12:12.000Z",
          "Titre": "Love ya",
          "Contenu": "Love ya. Resilio is the best app I have on my computers. It's elevated my travels and use of multiple computers by ten fold you could say. Dont think there's a better syncing platform out there. Also, it's only gotten better. Yes, there were difficulties but the team at Resilio has calmed all issues. This app is a forever app - and now it's on my phone too! I look forward to using it in the future"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Axel Lenz",
          "Nb_Reviews": 20,
          "Date": "2023-12-05T14:26:50.000Z",
          "Titre": "Very fair Companie!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "JD",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T17:34:58.000Z",
          "Titre": "Great way to sync All my computers…",
          "Contenu": "Great way to sync All my computers together, always up and running and my files are always accessible. I love this thing."
        },
        {
          "Note": 5,
          "Lieu": "LU",
          "Pseudo": "Pratik Patel",
          "Nb_Reviews": 3,
          "Date": "2023-08-11T01:14:19.000Z",
          "Titre": "It has been an awesome companion!",
          "Contenu": "It has proven to be an exceptional companion!Utilizing my Synology NAS as the central server, seamlessly linked to all my directories, I've achieved something truly remarkable. I've established a personalized cloud infrastructure that boasts a multitude of customization options.Sharing nearly 60GB of personal data with my brother in a different country has been a breeze, thanks to this setup. This accomplishment would have been unattainable through costly cloud storage solutions alone. Furthermore, this investment represents a one-time expenditure, a preferable alternative to the ongoing monthly subscriptions of conventional cloud services.My brother opted for a more budget-friendly iPhone with limited storage capacity, which inevitably led him to shy away from taking photos to avoid memory shortage problems. However, upon his return home, all the files seamlessly synchronize with his laptop. While there is a minor issue with iOS requiring the Sync app to be opened, Android's operating system facilitates automatic syncing without manual intervention.Admittedly, I initially had reservations about this purchase due to my unfamiliarity with the app. Yet, as time passed, my perspective evolved, and I now consider it one of the most astute investments I've made thus far.Presently, my devices harmoniously sync critical data flawlessly across various platforms. I effortlessly utilize a mix of Mac, PC, iPhone, iPad, and Synology NAS without encountering any synchronization issues.For those seeking to synchronize data seamlessly across devices, eliminating the need for cumbersome cables and intricate software, this solution comes highly recommended. With just a single computer and a phone, the data transfer process is streamlined and efficient."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Gleb Dolgich",
          "Nb_Reviews": 8,
          "Date": "2022-07-05T21:19:06.000Z",
          "Titre": "Works well, just what we needed",
          "Contenu": "Works very well, seems reliable and quick. Just what our family needs to sync important documents between our computers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "tony day",
          "Nb_Reviews": 8,
          "Date": "2021-03-16T16:46:32.000Z",
          "Titre": "Been using it for ~4 years",
          "Contenu": "Been using it for ~4 years. Great way to collaborate and share folders. Also recovery if you accidentally delete something is pretty good."
        },
        {
          "Note": 5,
          "Lieu": "HR",
          "Pseudo": "Goran Galić",
          "Nb_Reviews": 1,
          "Date": "2021-08-13T07:54:34.000Z",
          "Titre": "Hello Resilio People!",
          "Contenu": "Hello Resilio People!Thanks for Your product. Everything synchronizing just fine. I am satisfied. Greetings from Croatia"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-10-29T14:53:47.000Z",
          "Titre": "It has turned my Windows 10 PC into NAS…",
          "Contenu": "It has turned my Windows 10 PC into NAS whereby I am able to remotely access and amend files on my home computer"
        },
        {
          "Note": 5,
          "Lieu": "NO",
          "Pseudo": "Ali",
          "Nb_Reviews": 1,
          "Date": "2020-08-17T19:40:48.000Z",
          "Titre": "Performant",
          "Contenu": "Extremely quick indexing and file transfers; on my LAN, I often experience sub-second latencies for mirroring small file changes, and can get ~10MB/s file transfer speeds for both large files (virtual machines) and large numbers of files (Git repositories). All in all, very performant compared to most other sync solutions that I’ve tried."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Carlos Silva",
          "Nb_Reviews": 3,
          "Date": "2022-05-23T03:05:36.000Z",
          "Titre": "Excellent.  But, hard to learn to use.",
          "Contenu": "It's great when you understand how it works.  The instructions and functionalities to learn the operation are not clear and not didactic.  That should get better."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Cezar Ferreira",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T14:50:44.000Z",
          "Titre": "The application works fine",
          "Contenu": "The application works fine; more than I would expect"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Neil Sadwelkar",
          "Nb_Reviews": 2,
          "Date": "2023-06-22T06:42:44.000Z",
          "Titre": "Pro works better than trial",
          "Contenu": "I had the trial version for a while. But it was spotty and often wouldn't sync at times. Apart from that, the Pro version adds features which are must-have."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Earthcrosser",
          "Nb_Reviews": 8,
          "Date": "2021-04-30T07:33:05.000Z",
          "Titre": "SIMPLY THE BEST!",
          "Contenu": "Awesome experience with this software. I've been using SyncThing since it's open-source and with a lot of positive reviews, I can't pass on it. However, upon actual use, it's cumbersome to setup. I'm an IT person and even though I was able to set it up successfully with all of my devices, I had to document the process. And when I'm adding a new device, I have to look at that and make sure that everything works. There were quirks here and there. And then Resilio Sync came along. I was just browsing at their website and was surprised to see a 50% discount. So i bought the Family license at 50usd even though I haven't tried it. Boy I was utterly surprised how easy it is without looking at the documentation. I just had to experiment a little to ensure that my files won't be deleted. And it worked! One thing that I love about Resilio is that my Synology NAS has a native app for it. So my files from my PCs and laptops sync to my NAS1 and NAS1 syncs to NAS2 and NAS2 syncs to the cloud (using iDrive which I also love!!). Now, i don't even have to worry for a second if I overwrite or delete files since Resilio and iDrive has versioning. I also sync my backups to pCloud as my 4th backup destination. I have backups all over the place 'coz I'm a paranoid storage hoarder! Lol."
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Beat Kappert",
          "Nb_Reviews": 6,
          "Date": "2020-08-27T20:27:38.000Z",
          "Titre": "I very much appreciate that this…",
          "Contenu": "I very much appreciate that this software does not have to be paid with a subcription model, but that is a one time charge."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Cesar Fraire",
          "Nb_Reviews": 1,
          "Date": "2021-09-18T02:52:10.000Z",
          "Titre": "Si the best app to sync your stuff…",
          "Contenu": "Si the best app to sync your stuff without the problem of the slowly upload and slowly download from a server, and its all pretty secure, you can use it without an internet connection, only in the local, and you can sync all your data, 1gb 1000 gb 1000000gb"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Haberjr",
          "Nb_Reviews": 4,
          "Date": "2022-07-03T13:37:29.000Z",
          "Titre": "I find this software very reliable",
          "Contenu": "I find this software very reliable. I particularly like that my desktop and my laptop can sync, even when my laptop is in sleep mode."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Andrey Eremenko",
          "Nb_Reviews": 6,
          "Date": "2022-12-02T18:35:09.000Z",
          "Titre": "I have bought Resilio Sync after one…",
          "Contenu": "I have bought Resilio Sync after one year of using the free version. Great software.   Needs a little time to adjust to the UI but other than that worked great."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Dan B",
          "Nb_Reviews": 1,
          "Date": "2022-01-13T21:20:34.000Z",
          "Titre": "Great Product",
          "Contenu": "One of my favourite apps. I use it to run my own private (and secure) Cloud. Keeps my devices synchronized and critical data backed up."
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Elijah",
          "Nb_Reviews": 1,
          "Date": "2022-10-26T11:20:53.000Z",
          "Titre": "I really like to use Resilio",
          "Contenu": "I really like to use Resilio! i had the normal version then upgraded to Pro because of its benefits! i am very happy with it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John in Colorado",
          "Nb_Reviews": 6,
          "Date": "2020-07-25T15:14:13.000Z",
          "Titre": "Perfect solution for my needs...",
          "Contenu": "Provides me with a seamless way to swich from my computer in the recording booth to the computer in the editing room."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Andreas",
          "Nb_Reviews": 2,
          "Date": "2021-11-21T17:23:44.000Z",
          "Titre": "Works great",
          "Contenu": "Using the application on Synology NAS to synchronise all my devices. Both free and pro version work a treat. Definitely recommend"
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Jérome S.",
          "Nb_Reviews": 5,
          "Date": "2023-09-24T10:28:29.000Z",
          "Titre": "This tool made it easier to sync …",
          "Contenu": "This tool made it easier to sync a customer's documents when WD (WD Discovery) stopped maintaining their sync application."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "REY D",
          "Nb_Reviews": 1,
          "Date": "2022-07-10T04:29:04.000Z",
          "Titre": "Resilio Sync has been quite reliable…",
          "Contenu": "Resilio Sync has been quite a reliable application.  Has been so useful over the years."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lusid Post",
          "Nb_Reviews": 1,
          "Date": "2020-07-01T21:38:46.000Z",
          "Titre": "Good to go",
          "Contenu": "Great for sharing files - the paid version definitely has it's benefits in on the fly permissions changes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Freitag",
          "Nb_Reviews": 2,
          "Date": "2020-09-10T17:18:22.000Z",
          "Titre": "Very good.",
          "Contenu": "The product is great, works very well. The interface could be easier to use but once it is set up, works wonderfully."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew Ashenden",
          "Nb_Reviews": 1,
          "Date": "2021-07-19T11:47:32.000Z",
          "Titre": "Well worth the money",
          "Contenu": "Well worth the money. I am able to back up ALLfile types, unlike my experience with  MS's OneDrive."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "dnk",
          "Nb_Reviews": 1,
          "Date": "2020-05-10T08:32:13.000Z",
          "Titre": "Robust",
          "Contenu": "Robust, highly efficient on LANs, finds its way even in complex setups."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MARKIV MARIAJ",
          "Nb_Reviews": 1,
          "Date": "2022-04-20T14:45:22.914Z",
          "Titre": "The best file-synchronization software…",
          "Contenu": "The best file-synchronization software that doesn't break your wallet every month like the cloud services are designed to do."
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "Dionisis Falireas",
          "Nb_Reviews": 2,
          "Date": "2020-12-08T08:19:36.000Z",
          "Titre": "Excellent software",
          "Contenu": "Excellent software, and excellent customer service. My one and favorite app for seamlessly syncing my files between five PCs. Excellent!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Christian Junk",
          "Nb_Reviews": 1,
          "Date": "2020-09-16T12:00:03.000Z",
          "Titre": "For me the best Dropbox/OneDrive/Google…",
          "Contenu": "For me the best Dropbox/OneDrive/Google Drive/etc. replacement ever. Very fast, reliable and private."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Damien Downes",
          "Nb_Reviews": 1,
          "Date": "2020-05-07T21:21:38.000Z",
          "Titre": "Really impressed with this tech",
          "Contenu": "Really impressed with this tech. No need to setup a VPN to access file server everything just works no matter where I am."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "David Payne",
          "Nb_Reviews": 1,
          "Date": "2020-10-06T08:13:07.000Z",
          "Titre": "Very fast and good for syncing code",
          "Contenu": "Very fast. Ignore list works well with developers syncing code but not build artifacts."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Nandkumar Deshpande",
          "Nb_Reviews": 2,
          "Date": "2020-05-08T23:03:10.000Z",
          "Titre": "Resilio working fantastic for me.",
          "Contenu": "Resilio working fantastic for me so far. I use it to sync media folder(s) in my NAS and PC."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wesley Mason",
          "Nb_Reviews": 1,
          "Date": "2022-02-24T14:39:33.000Z",
          "Titre": "I moved over from Syncthing over a year…",
          "Contenu": "I moved over from Syncthing over a year ago and have been very happy with the speed and quality."
        },
        {
          "Note": 5,
          "Lieu": "HK",
          "Pseudo": "TONY CHAN",
          "Nb_Reviews": 1,
          "Date": "2022-05-04T16:09:13.000Z",
          "Titre": "Fantastic Tools!",
          "Contenu": "A must-have tool to complement your personal cloud on a home NAS!"
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Ca",
          "Nb_Reviews": 1,
          "Date": "2020-06-03T19:53:52.000Z",
          "Titre": "Great!",
          "Contenu": "They are very patient and helpful. Answer very fast (at least to Resilio Sync Pro users)."
        },
        {
          "Note": 5,
          "Lieu": "TW",
          "Pseudo": "Mars Huang",
          "Nb_Reviews": 1,
          "Date": "2023-01-19T16:26:27.000Z",
          "Titre": "非常可靠的同步服務",
          "Contenu": "非常可靠的同步服務，在 Nas、PC、Mac、Android 上我都安裝了 Resilio Sync、在這些平台上都提供了非常可靠的服務，我非常滿意！"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PROXCON, LLC",
          "Nb_Reviews": 3,
          "Date": "2020-05-07T11:05:27.000Z",
          "Titre": "AMAZING, but can be 99% BETTER! Still, 5-STARS... READ!!!",
          "Contenu": "USING FOR PERSONAL USE!!!Even though the product failed in so many ways, it did not meet all or many of my expectorated uses. It's not what I expected. I was expecting to purchase something with a login and a password, that let me create 5 users, on MY giant Synology NAS... but that is not the case.I would like to have then creat sub-folders for those users on MY giant Synology NAS, so that each of them can have a username and a password to dump/sync all and everything about their lives, in a centralized, divided, personalized way. But instead, it has this SUPER ugly and clumsy way of sharing a license file. C'mon, people at Resilio, that is a horrible way of creating a Family Package. You overly complicated something really, really good here. Your use of a license FILE key, is simply too much... just give out one ALPHANUMERIC license KEY code that can be easily, meaninglessly registered and shared. It's only a file-sharing system, and the implantation makes it seem way-way over protective. This software is NOT handling my the back-end of my bank! And, it is NOT handling my hospital electronic medical records systems. Also, please please please.. read this part: you CANNOT expect that each and every user out there has the centralized capacity to synchronize to their own systems, and don't go down the path of saying the word \"cloud.\"You want a good statistical number? Did you know that many people have cell phones and tablet devices with storage that is GREATER than that of the storage on their computer? It is a true, known fact! There are so many laptops out there than only come with 128GB or 256GB of storage, because of SSD storage technologies, while a cell phone comes with storage capacities greater than 256GB. So in this scenario, you expected consumer's are supposed to know about ALL of this stuff? Most people have been spoiled for years, and have not had the need to worry about running out of storage. However, the configuration and model setup of your software just ignores your average person's knowledge of storage (needs).Why am I giving you 5-stars, when I've stated many complaints? Because you have a great product here, free or not... you have an easy fix to correspond to a user's needs. All you need to do, is create 1) a main login and that becomes the first user of the family package, 2) allow 4 more users to be created, maybe with their own key, or an invite link, 3) allow everyone the option to either a) create a central point of sync storage on their own home computer, or b) create a central point of sync storage on the MAIN user's system -- the account holder of the Reilis Sync product, 4) allowing such decision, a request and approval process would be nice.... everything else would be magical.IMPORTANT! Fix your damn app, at least the one for iOS / iphone. I have over 300,000 photos and the app never begins to transfer a single photo because it's too busy \"Indexing...\" Your app should see \"WOW lots of files here! Let's start sections at a time, and go from there.\" But even worse, the app crashes! OMG, does that mean the indexing has to start all over? I gave up entirely on the app, Amazon has a way BETTER photo backup setup, with a simple app that IMMEDIATELY starts backing up when you open the app.(sorry for any typos, writing too fast, so munch to write about, and could probably write more)(also, by know means am I saying this is the WORST software ever... I think everyone should give it a try, and tinker with it a bit, because it might perfectly work out well for you!)GOOD LUCK, EVERYONE!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen Albers",
          "Nb_Reviews": 7,
          "Date": "2022-03-11T16:59:26.000Z",
          "Titre": "Best backup solution for both consumers…",
          "Contenu": "Best backup solution for both consumers and small businesses."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Sagar Bharatbhai",
          "Nb_Reviews": 1,
          "Date": "2020-07-24T14:22:29.000Z",
          "Titre": "Pro is definitely worth it with…",
          "Contenu": "Pro is definitely worth it with selective sync and local sync."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barry Furnival",
          "Nb_Reviews": 1,
          "Date": "2021-11-05T15:28:42.000Z",
          "Titre": "Great easy-to-use syncing and sharing tool",
          "Contenu": "Great easy-to-use way to sync your devices. Great for securely share files with other people."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Fabio Tramacere;",
          "Nb_Reviews": 5,
          "Date": "2020-07-28T06:15:26.000Z",
          "Titre": "Very nice product",
          "Contenu": "Very nice product ! Easy to install and configure. Highly recommended"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Karm",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T18:09:42.000Z",
          "Titre": "Very useful program",
          "Contenu": "Very useful program. Works well for my needs. Setup was easy and files transfer are real fast."
        },
        {
          "Note": 5,
          "Lieu": "LT",
          "Pseudo": "Paulius J",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T20:56:14.000Z",
          "Titre": "The fastest file sync software in the…",
          "Contenu": "The fastest file sync software in the known universe."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jon Fields",
          "Nb_Reviews": 1,
          "Date": "2022-08-12T22:10:03.000Z",
          "Titre": "Resilio Sync just works",
          "Contenu": "Resilio Sync just works.  It's simple, fast, and easy.  The support team is amazing and pretty quick to reply."
        }
      ]
    }
  ]
}