{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.communityphone.org",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dwayne Oxford",
          "Nb_Reviews": 6,
          "Date": "2023-12-16T13:46:35.000Z",
          "Titre": "Started great",
          "Contenu": "Started great, got a friendly helpful man named Will in Boston, then he stopped responding to calls. Now get mostly offshore communication problems.I have good phone performance but still don't have name on outgoing calls. Called many times to no avail.They do good at 1st, then NOT!!Update; Learned last nite that the call waiting STILL'S not working. Name does seem to be with some outgoing calls now."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William Sisco",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T17:15:47.000Z",
          "Titre": "never received box, no service not refunds nothing",
          "Contenu": "never received box, cancelled service but still charged 500 for years service and told it would not be refunded. Then received two boxes, called them again and said they would resolve everything and told they would email return address labels.  Never received labels then received email that indicated since they have not heard from me they are closing case.  Tried calling support today, so far 1 hour, 7 minutes and 45  seconds on hold for support.  Still no refund. total outlay of 645 dollars for NOTHING.  They are horrible company trying to hold on to money to support their company"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "CaSaundra Thomas",
          "Nb_Reviews": 6,
          "Date": "2023-10-13T17:48:08.000Z",
          "Titre": "This company is Horrible!!!",
          "Contenu": "I just signed up with this service. It arrived and setup was easy. But when trying to go to the online site to activate my account and setup my user nane and password, it only redirects me to the login site (Which it won't let me create). I called customer service, waited for over 10 minutes on hold. Then a represenative picked up the phone (I could hear them breathing) and they did not speak when I said hello. They simply hung up on me. So the website is crap! The customer service reps have no skills, and I am stuck with a crap phone for at least this month and I will be charged another $50 for a restocking fee when I do get out of this P.O.S. company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Maria Gonzales",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T21:18:03.000Z",
          "Titre": "Great sales people",
          "Contenu": "Great sales people, worst customer service in the WORLD!   i cannot get a hold of anyone to help me. just started service, now i am going to cancel service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ner Nonsense",
          "Nb_Reviews": 2,
          "Date": "2023-02-10T00:48:59.000Z",
          "Titre": "dirty rotten lieing theives!!",
          "Contenu": "dirty rotten lieing theives!!! they refuse to allow me to ship their garbage back despite it not working at all and have charged me 160 dollars on my bank card and its only been 2 weeks i have called 15 times they will not give me information to send their unit back nor will they refund my money STAY AWAY!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Mandell",
          "Nb_Reviews": 3,
          "Date": "2022-07-02T17:24:45.000Z",
          "Titre": "This is a low rent amateur operation",
          "Contenu": "This is a low rent amateur operation. Claims LOW PRICED wireless old fashioned telco service, but it's strictly wifi interconnect. And they start you off with a \"LOWBALL\" down and dirty price, then keep jacking it up in the dark of night, crying about extra costs. A bunch of amateur grifters for sure."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Catherine Dobbins",
          "Nb_Reviews": 1,
          "Date": "2023-05-07T20:16:57.000Z",
          "Titre": "Do not believe them when they tell you…",
          "Contenu": "Do not believe them when they tell you that you can keep your old number. One of the reasons I decided to switch to their service was that I wouldn’t have to notify  everyone about a new number. After I signed up they say they can’t transfer my number from my old provider, so now I have to decide if they are worth keeping. Response from customer service is basically too bad we just can’t do it. What other nasty surprises will I run into from them?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amanda Wyatt",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T21:28:07.000Z",
          "Titre": "No Senior Caregiver Plan…",
          "Contenu": "I signed up for the Senior Caregiver services. Online it shows a nice portal to set up reminders. Turns out, you have to request THEY set up the reminders and wait for them to call you to discuss. For each needed reminder. Nope. Canceling and asking for full refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Leonard Slavin",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T01:30:24.000Z",
          "Titre": "This is the third time I’ve called…",
          "Contenu": "This is the third time I’ve called about the same problem, and it has not been resolved as of yet. I keep getting runaround answers to the questions. I asked no one has been able to help yet I’m starting to reconsider using your company for my mothers phone services."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Woods",
          "Nb_Reviews": 1,
          "Date": "2023-02-05T15:48:09.000Z",
          "Titre": "Phone never worked",
          "Contenu": "Phone never worked, sent out a second base and charged another 240 dollars, still didnt work, refused a refund!! Beware of this scam, dont fall for it, paid a year in advance and never made a single call.. HORRIBLE!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Julie Pflanzer",
          "Nb_Reviews": 2,
          "Date": "2023-11-13T16:17:15.000Z",
          "Titre": "Poor experience for elderly person",
          "Contenu": "I signed my elderly mom up for this service as she has dementia and is having a hard time working a cell phone. I so wanted this to work.Shipping was an issue. I typed in my mom's address but the web browser generated an extra digit. I didn't notice until after I placed the order. I sent a message back as soon as I noticed this. Never got a response. When I called they told me I had to contact the shipping company. I had to call twice because I had never heard of the shipping company and needed to get contact info. Got a hold of the shippers to get them to send the device to the right address. Got billed. 2 weeks later I finally got the device. Hooked up the device. It didn't work well. Cell service in my mom's assisted living is poor. She lives downstairs and I have verizon and calls are poor. Her device said 5 bars though?  but every other call was put to voice mail and then she couldn't dial out and when we finally hooked up it dropped calls. Very frustrating. Especially for someone with dementia. She needs reliable communication to family and doctors. So I wanted to cancel and get something reliable. This is where they kept wanting me to fix the problem. I was even refered to amazon to buy equipment to make it work. Also was told I could buy cell phones. She can't use those. Also told they could crank up the boosting to help her get service. Haha. Yeah right. Got billed a month while they \"problem solved\". Also whenever I got \"tech\" support it was from over seas. If I said something off script they didn't know how to reply. Communication with language was an issue. I spent 30 minutes explaining under no uncertain terms that we were canceling. When they finally got the message I wasn't refunded all of the cost because I wouldn't trouple shoot with them. It says on their website they would. Shame on them becaue they work with elderly people and I'm sure if I wasn't there to help my mom she would have been scammed out of the whole amount. I would never refer someone to this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2022-10-09T03:23:14.000Z",
          "Titre": "Not customer friendly",
          "Contenu": "Have had several inconveniences in such a short time. Initially went with the minimum of 400 minutes a month and after a month or so, no service. What's the problem? You've exceeded your minutes. No argument here, bump us up to unlimited. Okay fine. Not very long after I get a notice, save money by paying annually. Okay I did. 2 months go by and am being told my credit card is expiring. Mind you I'm paid up until July next year. I sent in the information as asked this week, being early October and a long way from next July. Sent it anyway and today for whatever reason we have no phone service.  So yes there's your one star only because there was nothing lower."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "B.L. Brown",
          "Nb_Reviews": 1,
          "Date": "2022-05-10T21:40:04.000Z",
          "Titre": "Not dependable",
          "Contenu": "The phone service is constantly going out and when I try to call customer service I get a recording that they are busy with other customers and to try again later then it hangs up.  We were without phone service for nearly a week.  I wanted to cancel my service and send the unit back, but you can't reach anyone through customer service and you HAVE to cancel over the phone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Veronica",
          "Nb_Reviews": 1,
          "Date": "2022-05-11T15:48:48.000Z",
          "Titre": "Dropped calls",
          "Contenu": "Dropped calls, plan dialing the number your trying to call a couple of times before you can get it to connect.good luck when you have to enter numbers in for PIN.thank you for this email though i keep forgetting to start looking for new phone service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "LeeAnn Scheer",
          "Nb_Reviews": 2,
          "Date": "2023-01-26T07:06:25.000Z",
          "Titre": "Update from review yesterday",
          "Contenu": "Update from review yesterday. They are now calling me a liar and making up all kinds of outrageous things they claim I agreed to on the phone. Still no refund or resolution. Avoid like the plague!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thomas Amato",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T00:36:25.000Z",
          "Titre": "I ordered one landline base and was…",
          "Contenu": "I ordered one landline base and was sent three. I was charged for three. When I complained, I was refunded for one base, still charged for two plus the original charge. This is a bad service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gregory Topliff",
          "Nb_Reviews": 6,
          "Date": "2023-03-24T14:25:29.000Z",
          "Titre": "Update on getting my refund",
          "Contenu": "After going to the BBB I got a call from Alex Lloyd from Community Phone. He got me my refund for the service for one year I paid in advance. He couldn't get the powers that be to pay for the 5 phones I had to buy for the landline and I haven't gotten the money back yet for the base unit I had to buy for $106.92 but he has been vigilant in keeping in touch. If all of the people at Community Phone didn't give me the runaround for 3 months I wouldn't have had to go to the BBB in the first place. Thanks Alex."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "THOM SERTICH",
          "Nb_Reviews": 1,
          "Date": "2022-09-26T21:42:43.000Z",
          "Titre": "NOT WHAT WE EXPECTED.",
          "Contenu": "We need a phone system that can handle extensions in other rooms.  We are in our 80's, frail health, wheelchair dependent.  If emergency during the night, we cannot run to the phone that works, cannot hear it ring, we are hard of hearing.Called to return item.  Instructions provided, along with a notice that we will be charged a restocking fee; $50.00 on a new phone; $30.00 on a used phone.  We were never informed as to which we had.  I am infuriated because I realize I have a used one.  Whoever had the phone previous to us apparently could not get the base open to install a battery.  We could not, either, though we tried for several hours to do so.  Our monthly Social Security income in this household is $2400.00.  Also, is the purchase price of your base the same for a used device as to a new one?  The whole scenario seems totally unfair to us.Sincerely,Thom and Beverly Sertich"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gregory Topliff",
          "Nb_Reviews": 6,
          "Date": "2023-03-26T18:01:36.000Z",
          "Titre": "Check missing so far.",
          "Contenu": "I never got the check for the landline base. I also shouldn't be charged a restocking fee when I was never given the service I paid for. I hope my contact Alex will get this straightened out."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Angie Whalen",
          "Nb_Reviews": 5,
          "Date": "2022-07-13T06:05:20.000Z",
          "Titre": "We left Comcast because we were having…",
          "Contenu": "We left Comcast because we were having problems with our phone service. Once we signed up here, we were given a temporary #. I was able to set up voicemail. Now we transferred our old # and it was activated. Initially people calling us were getting the recording that you hear on their system. \"You've reached Community Phone. For billing press 2, tech support 3, etc. We didn't know that until someone came to the house & said that they had called. That's the recording they heard. That was fixed. Now our # was released to them and activated. Our phone doesn't ring. I dial 1 as well as *86 and it either rings or is busy. Nothing else. Tech support said I could set up VM. I call the # from my cell & a recording states that I can't leave a message because because VM hasn't been set up. Next step: complaint to the BBB."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Annmarie Clinton",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T17:29:45.000Z",
          "Titre": "The worst business choice I made in using this service",
          "Contenu": "I just got signed up with this service. Move both my business service from Comcast and  totally regret this. My businesses has lost a whole day of calls after they told me the numbers were successfully ported. This is the second day and my phones are still not ringing. Longer than ever hold time for someone to talk to I then get an automated voice that tells me to call back later and then disconnected call.  No able to go on online portal which I was told I have. Then when I finally get on my ported numbers are NOT listed there. I have lost a lot of money from this service that I paid for and have not been able to use. I need a refund and will be disputing this."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anne Edwards",
          "Nb_Reviews": 1,
          "Date": "2023-02-22T17:40:40.000Z",
          "Titre": "I wish I would have come here first",
          "Contenu": "I weish I would have come here first.  I beleived them and now I am waiting for my refund since I paid a year in advance and could not use the service :(  I canceled within 7 days of receiving the phone.Jan 27th was the start....oh they did give me half back for the phone not the service..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Barbara Minton",
          "Nb_Reviews": 1,
          "Date": "2022-05-18T16:25:25.000Z",
          "Titre": "Been trying to reach you via phone",
          "Contenu": "Been trying to reach you via phone.  No customer service person available. Last year sign up for your phone service.  You may me pay $60.00 to bring my old phone number with me.  No other phone service in the past ever did that.  You guys are part of AT&T.  Which is corp.  Not a big fan of corporate America.  When I said that to the customer service rep.  She said no that T-Mobil is also connected with Community Phone.  Still corporation.  You email me and told me you bill my credit card for $317 dollar and change.  Which I told the customer service agent.  Mostly likely won't renew.  You guys sent me another email saying if I did a annual renewal I would get one month free a 10% saving.  Didn't get it.  You guys are such a ripoff.  That is what corporate America is all about.  You need to educated your customer service people.  Very disappointed in your service.  Plus, during this past year I have had calls just drop during conversation with family.  You people are terrible company.  Thank You Barbara Minton"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Geraldine COATES",
          "Nb_Reviews": 3,
          "Date": "2022-05-10T21:46:23.000Z",
          "Titre": "My telephone is mostly off than on...I…",
          "Contenu": "My telephone is mostly off than on...I have to reset it at least 4 times a week.I even had to pay for another box,that wasn't working,and never got a cc refund or credit.."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Charlotte Whitaker",
          "Nb_Reviews": 2,
          "Date": "2023-02-14T01:29:13.000Z",
          "Titre": "Community phone is another scam target…",
          "Contenu": "Community phone is another scam target old people. . I am going to sue them them.  never got what I  paid for. I have try to talk to the people ,never got the issue resolve."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Patrick",
          "Nb_Reviews": 1,
          "Date": "2022-05-11T07:04:21.000Z",
          "Titre": "I've been trying to port my number to a…",
          "Contenu": "I've been trying to port my number to a other phone company now for about 3 weeks now with no success."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jane Daughtry",
          "Nb_Reviews": 6,
          "Date": "2022-05-10T21:55:28.000Z",
          "Titre": "The phone line is terrible",
          "Contenu": "The phone line is terrible. Half the time you can't hear the person on the other end of the line.Tried to contact customer service but of course I haven't heard back from them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Erica",
          "Nb_Reviews": 1,
          "Date": "2023-02-17T02:41:58.000Z",
          "Titre": "My voicemail never worked",
          "Contenu": "My voicemail never worked. After a call to customer service I was told they would reset something and in 24-48 hours it should be fixed. Here it is about 2 weeks later and it is still not fixed. In my call to customer service tonight I explained I can still use my old answering machine so it’s not a huge deal, but it’s a shame the service isn’t working because it would be nice to have. The answer I got was  (after I had to explain the problem about 3 times) “well if hasn’t worked we might as well just remove it.” I submitted an online request to correct the name that comes up for our caller id.  That was supposed to take affect in a couple days. About a week later it’s still not working and they said they never got the request. Supposedly that was taken care of tonight and it should be correct in about 3 days. And then they were charging me (which I didn’t know about) an extra $9 a month for the robocall feature. I Immediately canceled that feature as soon as I noticed it on my bill but it is still not removed.  However the rep said that I am not paying for it and he doesn’t know why I still have it. It is supposed to be taken off of my account as well. I paid for 3 months service at once to save a few dollars but was informed that I wouldn’t be able to cancel within this time frame and if I wanted to cancel I would have to call right at the end of the 3 months to cancel the service. So if and when I do cancel this service it’s probably going to be a nightmare. The phone does have good service in my little rural area so that is a plus."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "LeeAnn Scheer",
          "Nb_Reviews": 2,
          "Date": "2023-01-25T05:15:28.000Z",
          "Titre": "Completely terrible!!",
          "Contenu": "Completely terrible!!! It doesn’t work at all, they won’t refund my money or let me out of a year contract. Do not use!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Betty Ramos",
          "Nb_Reviews": 1,
          "Date": "2023-01-13T03:28:06.000Z",
          "Titre": "My phone is not ringing.Called…",
          "Contenu": "My phone is not ringing.Called technical support and no one answered.Im 79,need a landline at night.please someone call and lets get it fixed.Im paid for the year.  Betty Ramos 817-975-2595"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Julie Miles",
          "Nb_Reviews": 4,
          "Date": "2023-03-25T08:16:04.000Z",
          "Titre": "Well power was out for two hours",
          "Contenu": "Well power was out for two hours . I was told phones will work during power outages not one of my phones worked no power at base"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Yvonne",
          "Nb_Reviews": 2,
          "Date": "2023-02-06T22:21:08.000Z",
          "Titre": "Horrible Company",
          "Contenu": "If I can give 0 stars I would.  This is the worst telephone company in the USA.  They are a total SCAM.  What makes it worst my mom is a senior citizen on a fixed income and they still ripped her off.  All we wanted was a landline with voicemail and caller ID. Even though I read they had caller ID.  What they are saying now is for outbound caller id.  Whoever heard of just having a caller id that for outbound calls only?  People want to see who is calling.  So I write a complaint I want caller ID or I am canceling.  What they do is send me a new SIM card which I thought was to get my mom caller id but now I know I was wrong. They just send me the SIM card to appease me.  I put in the new SIM card now my mom has no phone service.  I called support and sat on hold for 40 minutes then the representative tells me my new SIM card had to be activated and it will take two hours.  Needless to say, the SIM card never activated,  so my mom was without phone service for the weekend because now according to tech, it will take 2 hours to activate but instead, it never happened.  I sent a message to the salesperson and I am sure she got her commission so did not care and I told her I want a refund.  Her response was she was sorry and sent my request to the billing department.  Needless to say, it has been over a week the billing department has not given my mom common courtesy to call her back or call me back or send a refund. So many issues with this company in just 3 weeks: I was on hold for 2 hours trying to reach support because we could not figure out the voicemail.  After 2 hours I get a pre-recorded message the reps are busy call back and the call disconnects.   Spoke with rep Luis made an appointment with me to call me back at 6:00pm needless to say he did not call.  He called me back 45 minutes late unacceptable. Do not spend any money with this company Run as fast as you can.  They are ripping over senior citizens who still would like to enjoy a landline in their homes. My poor mom, hopefully, will get a refund and she will not be out over $200 something dollars.  This company really sucks."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Maurine Mihalek",
          "Nb_Reviews": 8,
          "Date": "2022-08-21T17:43:08.000Z",
          "Titre": "I had Sprint Phone Connect 3 as my…",
          "Contenu": "I had Sprint Phone Connect 3 as my landline for several years. I absolutely loved it. The phone unit cost less than $40.00. The phone connections were reliable. The calls were always crisp and clear. And I NEVER, EVER, EVER  had any dropped calls. I never needed to call tech support. The cost was extremely affordable at only $15.00 per month. Unfortunately, it was a 3G device which Sprint, now part of T-mobile, discontinued supporting around January,  2022. I found Community Phone on the internet. It sounded like a way to still have a landline. I started as a customer in November, 2021. I am NOT happy with this replacement product. I had to purchase their device (the Landline Base) for a one-time, upfront fee of $99.00. I wasn't happy about that but assumed it had 4G or 5G technology in it, so I accepted that requirement.I am still using the same cordless phone units which I previously used successfully with Sprint Phone Connect 3. Sound quality was always great with Sprint. Now with Community Phone, the quality of the sound during calls is bad. With my volume turned all the way up, the first several minutes of a call are faint. It improves only slightly later in the call. I find that parts of the conversations are not very clear.And the number of calls that are dropped or just end abruptly for no reason at all is intolerable. There is no warning when it might happen. I have never experienced this with any other phone company in my life. On my end there is a loud screeching noise.  I can try to talk, but the person on the other end doesn't hear anything, just silence, no sounds. This happens A LOT, way too often. Recently, when someone calls me and I answer, we both hear a loud dee-dee-dee sound, and the dee-dee-dee noise just keeps repeating. We have to hang up and redial. Sometimes we get a normal connection,  but sometimes we get the weird dee-dee-dee sounds again.I set up voice mail with Community Phone. Big mistake. I was dissatified with how it works. Once activated the Community Phone voice mail cannot be deactivated per tech support. I like to use my answering machine on my cordless phone. It is much simpler than trying to access the Community Phone message system. I called tech support several times for a solution.  I asked them to cancel my voice mail setup, but they said that cannot be done.  They claim they fixed it so that there would be more (4 or more) rings before my voicemail message kicks in, but it is still 3 rings.  I am not impressed with their tech support staff. And the monthly cost for Community Phone is more than triple what I paid with Sprint. I pay almost $49.00 per month for much, much worse service. The Senior Discount is only good for 3 months and then it disappears forever.I wanted to post reviews on Google and Yelp, but it seems Community Phone has several addresses which don't seem to work for Yelp or Google. So I have left reviews with the BBB, with Google (for Community Phone landlines in Illinois} and Trustpilot.I am looking for alternatives because with Community Phone, the quality of the phone connection is poor, connectivity is highly unreliable, and  calls are routinely dropped, and tech support is inadequate. It has been a frustrating experience for me and the people who call me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gregory Topliff",
          "Nb_Reviews": 6,
          "Date": "2023-02-20T18:07:52.000Z",
          "Titre": "From day one starting Nov",
          "Contenu": "From day one starting Nov. 22, 2022 I had nothing but problems with recordings to redial again, dropped calls in the middle of conversations being hung up on and various forms of interference with the person I called fading in and out with static. I spent more time on chats than I did using the phone. I kept saying how imperative a reliable phone was because I was in the middle of renovating my new house dealing with a bunch of contractors. I had to return calls when I was interrupted with a busy signal and hung up on explaining I didn't hang up on them it was the phone. That and the fact that I am on a 100% disability from my war wounds received in Vietnam and needed the phone for emergencies. I was told time an time again to try the same thing over and over with no results of fixing what I know to be a flaw in the technology. I reset the base several times then moved it to another room. All of which showed the green lights to the right of the base lit up. I was told the signal was very good so that wasn't the problem. I heard apology after apology for over 2 and a half months, which started to be annoying. It was like a child breaking an article of value and saying they were sorry thinking that covered the problem. I started to keep a phone log of all of the interruptions and dealings that went on and posted a complaint on Facebook. After months of hating the phone every time I used it fearing it would ruin my day trying to make contact with people, I was told a new SIM card would be sent to fix the problem. On 2-2-23 I put the card in and was told to wait a couple of hours. When it didn't work I went on chats the next day and was told to put the old card that worked sometimes back in for the weekend. After that I contacted the agent on chats again asking what they wanted me to do and was told that the phone number was being synced up with the new card and would take a few hours. Several days later on the 8th I got a call from Ibrahim trying to tell me the phone was ready to go but the sound was muffled and breaking up really bad so I could only get a word or two every now and then. I told the guy that I couldn't understand half of what he was saying. He said he could hear me clearly on his end but I couldn't hear him. He asked that I call a number to confirm a better signal so, I said I would call a friend and let him know. I called a friend a couple of miles away and heard a crackling sound of interference missing some of his words but it was better than the other call. When I hung up I called a business to place and order for vitamins and got the same interference. I reported that back to the guy and finally gave up. I wanted my money back for the year that I paid in advance and cancelled the service. On the weekend just before canceling I placed a complaint with the Better Business Bureau after knowing that this issue was never going to stop. I got a second email from them a couple of days ago saying they haven't gotten a response from the company. In my response to them I added that I had zero service for several days. I stopped using the phone all together and disconnected it. I went to chats again to cancel the service and spent about another hour going back and forth. I did the cancellation form and got back an odd part of the questionnaire. It asked a yes or no question about using a portal to I believe keep the number assigned to another company. I said no and after the question it had one word, \"false.\" Not knowing what that was I added that to chats. Considering that I was told I would hear back in 24 hours and it's been over 2 days I went on this sight to see that others are being screwed royally. Lastly, being a former law enforcement officer losing my job from my pre- existing war wounds, I have made some contacts in my state's government regarding fraud and deceptive business practices. I will take this next steps up the ladder if I don't get a positive response. Enough is enough of bad business."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christina",
          "Nb_Reviews": 1,
          "Date": "2022-05-18T01:54:26.000Z",
          "Titre": "The quality of the calls were crap",
          "Contenu": "The quality of the calls were crap. I kept it as a punishment phone for my kids."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amy Holbein",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T20:49:20.000Z",
          "Titre": "Because it is not working"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T14:49:18.000Z",
          "Titre": "Not the phone signal I had hoped for.",
          "Contenu": "The quality and stability of the phone signal is highly variable and inadequate to support working from home. I now gather that I need to buy some antenna and mount it on my roof if I want to have connectivity equivalent to a true landline."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "KH",
          "Nb_Reviews": 22,
          "Date": "2022-09-12T16:58:43.000Z",
          "Titre": "Maybe they are desperate for business",
          "Contenu": "Maybe they are desperate for business.  One guy tried to pressure me  into the service by  asking seemingly innocuous questions. He called me once after on a cell phone; I told him I had gone with another company.  He calls again, this time with the 866 number, and states, \"Oh, Ok,\" when I said I had previously told him I   had gone with another company."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Todd",
          "Nb_Reviews": 1,
          "Date": "2022-05-10T23:20:36.000Z",
          "Titre": "Friendly people, poor phone service",
          "Contenu": "Everyone I have talked to has been extremely friendly which I appreciate.  However, the phone keeps going straight to voice-mail without even ringing.  The base unit has to be reset several times every week. We were sent a replacement unit and have had the same issue. Will likely terminate the service soon. It is very unfortunate as I really liked the attitude and friendliness of everyone I have dealt with."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Silver",
          "Nb_Reviews": 3,
          "Date": "2022-05-11T17:46:01.000Z",
          "Titre": "It's very difficult to get into contact…",
          "Contenu": "It's very difficult to get into contact with someone and the information that you all send out to seniors regarding subscribing to a yearly plan is not a savings. There's no discounts for Veterans or anything that would cause me to let others know about your service. You all need to do much better in this day and time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lynn Neathery",
          "Nb_Reviews": 2,
          "Date": "2022-05-11T02:52:37.000Z",
          "Titre": "We have problems pretty often",
          "Contenu": "We have problems pretty often. We do live out in the country, but our previous system worked better than this one. It randomly doesn’t work.  Sometimes we get a loud three tone sound that doesn’t go away when we answer the phone."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Marsha",
          "Nb_Reviews": 2,
          "Date": "2022-05-12T01:40:35.000Z",
          "Titre": "I am still getting calls from Eye Care…",
          "Contenu": "I am still getting calls from Eye Care which used this phone number with Verizon 12 years ago.  Some times it does not work in that I cannot hear the person at the other in of the line or cannot dial out.  No dial tone."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "sdav",
          "Nb_Reviews": 1,
          "Date": "2022-05-18T08:51:32.000Z",
          "Titre": "I enjoy having a \" landline\" number",
          "Contenu": "I enjoy having a \" landline\" number. however, I've received really annoying crank calls and now the number does not seem to work even if I call from my cell phone."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Charlotte Whitaker",
          "Nb_Reviews": 2,
          "Date": "2023-02-08T17:13:43.000Z",
          "Titre": "Community phone is another scam pull on…",
          "Contenu": "Community phone is another scam pull on older people.  the charge to set it up the account is high, the month charge is high . They don.t give you the service you  paid for."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gene Hobdy",
          "Nb_Reviews": 3,
          "Date": "2022-05-11T03:16:40.000Z",
          "Titre": "Terrible customer service",
          "Contenu": "Phone works good but customer service is terrible.  Not all of them but the majority."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Carole Wachowski",
          "Nb_Reviews": 1,
          "Date": "2022-05-18T02:09:36.000Z",
          "Titre": "Answering system problems.",
          "Contenu": "After repeated calls to try to use my own answering machine instead of your automated system, I am switching to another company to be able to use my own answering system which I have to have day to day details for our U-Pick operation."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Philip",
          "Nb_Reviews": 1,
          "Date": "2022-05-27T04:08:21.000Z",
          "Titre": "dont understand why i am having to…",
          "Contenu": "dont understand why i am having to \"reboot\" the equipment"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Delores",
          "Nb_Reviews": 1,
          "Date": "2022-05-11T21:03:41.000Z",
          "Titre": "the service is terrible"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cordia Kunkel",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T04:28:02.000Z",
          "Titre": "Very happy with your service and…",
          "Contenu": "Very happy with your service and finally have great reception thank you"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ruth",
          "Nb_Reviews": 1,
          "Date": "2022-05-20T23:00:52.000Z",
          "Titre": "Excellent voice connection, but",
          "Contenu": "Basic functionality (quality of voice connection) of phone service is excellent!There are a few quirks to the system that could be improved:1. During power outage battery backup kicks in, which is good. However when power comes back on phone does not automatically revert to ac power. The modem must be reset. As an elderly user that resettingvprocess is confusing for me.2. Voice mail cannot be deactivated. As an elderly user I cannot remember how to access voice mail, too confusing for me. I do understand how to use my answering machine, but because voice mail is always on my answering machine has to be set to pick up calls before voice mail which rarely allows me enough time to answer phone before answering machine kicks in.I assume for most users these issues are not a problem, but think it should be something Community Phone could easily fix to make life a little easier for us old folks."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Denise Smith",
          "Nb_Reviews": 2,
          "Date": "2023-05-18T22:19:18.000Z",
          "Titre": "I got this phone for my mother",
          "Contenu": "I got this phone for my mother, who lives with me,. At some her voicemail greeting changed to Spanish. I could not do any of the steps to change it back to English because it was all in Spanish. It took me four emails and three phone calls before it was finally fixed. There is nothing that explains in English in the documentation or online to fix this. No one was able to adequately explain why it happened. Additionally the phone itself has static in it frequently.  The date isn’t 100% accurate when it asked me for it. It was in March and it was in April that I contacted them.  The price point is good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Donald",
          "Nb_Reviews": 1,
          "Date": "2022-05-11T01:04:23.000Z",
          "Titre": "Service and voice quality have been…",
          "Contenu": "Service and voice quality have been excellent; my ONLY criticism is the number of rings for incoming calls--so many times the call goes to voice mail before I can reach the phone. And I have 6 phones in my house!  I try to remember to carry a phone with me at all times, but sometimes I get busy and forget. PLEASE, add another ring, or better, add 2 rings!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Margaret",
          "Nb_Reviews": 1,
          "Date": "2022-05-16T04:43:00.000Z",
          "Titre": "Calls are set to be answered at 3 rings…",
          "Contenu": "Calls are set to be answered at 3 rings in order to go to my answering machine, and not community phones answering setup.I used to be able to join a call by pressing the phone/flash button.When I try to join a call now, I loose the caller, also, the message stops,this stops me from receiving the correct callback number. Not all callers leave the same callback number on a message that is the same as the caller ID coming in. Too much time and frustration are wasted trying to trace an important call.When I answer on the first ring the call is dropped.When I know the caller and number, I then must call them and apologise for the poor phone service!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patricia",
          "Nb_Reviews": 1,
          "Date": "2022-05-12T18:32:11.000Z",
          "Titre": "I would have loved to give you 5 stars but...",
          "Contenu": "I would have loved to give you 5 stars but the fact that I can't get a call log keeps you at 3. This is the perfect phone set up for my elderly mother and the purchase process and set up couldn't have been any easier. You even ported over her old number which was very important to her. My mother has been the target of local fraudsters and having the call log is very beneficial. It also helps when she says that someone called but she cant remember who it was. Please let me know when you will be able to provide the call log and once i have it, I will be happy to update your rating!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Middle Tennessee Resident - USA",
          "Nb_Reviews": 2,
          "Date": "2022-06-12T01:16:28.000Z",
          "Titre": "My phone goes out quite often and I do…",
          "Contenu": "My phone goes out quite often and I do not realize it has until I have missed important calls. No ring tone and I cannot make or receive phone calls. Rebooting the phone doesn't always fix the problem either."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cindy",
          "Nb_Reviews": 1,
          "Date": "2022-05-10T23:02:27.000Z",
          "Titre": "Community Phone",
          "Contenu": "The phone works well and has not been difficult to use. The only issue is the representative who stated would return call did not.  When calling community phone the representative followed through on second call.  I would use this service again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Maretha Johnican",
          "Nb_Reviews": 3,
          "Date": "2022-05-18T00:57:18.000Z",
          "Titre": "Partially-Satisfying Experience",
          "Contenu": "I received a new phone base in a short period of time. I received adequate assistance with trouble shooting on the 3rd call."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Diana",
          "Nb_Reviews": 1,
          "Date": "2022-05-18T13:35:03.000Z",
          "Titre": "Price",
          "Contenu": "I was surprise when the price jumped up.  My father is older and doesn't know how to use a cell phone.  He needs a landline.  He is now not at home, he is in a nursing home.  Community Phone works good at the nursing home, but I was surprise when the price went up.  He is on a limited income.  Is there an help to pay for his phone bill or can his bill be reduced."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Morgan",
          "Nb_Reviews": 2,
          "Date": "2022-05-10T21:35:46.000Z",
          "Titre": "Everything is ok except when my phone…",
          "Contenu": "Everything is ok except when my phone line beeps and I try to click over, it doesn't click over and sometimes when the phone rings a certain amount of times once I pick up the phone clicks and I get the dial tone, at first I thought the other side hung up but after a while I think it's my phone."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Viliamu Chan Kau",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T00:37:51.000Z",
          "Titre": "Sometimes the connection",
          "Contenu": "Sometimes the connection,  when I used my cellphone to call the house phone, it has the static sound.  That is my only concern. Thank you"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Nancy",
          "Nb_Reviews": 1,
          "Date": "2022-05-10T22:03:46.000Z",
          "Titre": "Recently when talking long distance",
          "Contenu": "Recently when talking long distance, FL to DE, we lost connection 3 times during our 2 hour conversation."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dorothy",
          "Nb_Reviews": 1,
          "Date": "2022-05-18T04:14:12.000Z",
          "Titre": "Your phone service worked sometimes and…",
          "Contenu": "Your phone service worked sometimes and others, it did not."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2022-05-10T23:16:00.000Z",
          "Titre": "Great service here",
          "Contenu": "Great service here, where cell service doesn't work good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 4,
          "Date": "2022-05-17T23:13:31.000Z",
          "Titre": "No service",
          "Contenu": "The phone goes out of service very frequently. Not a great setup for elderly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Annie",
          "Nb_Reviews": 1,
          "Date": "2022-05-21T23:55:14.000Z",
          "Titre": "Service is not reachable incoming or…",
          "Contenu": "Service is not reachable incoming or outgoing in the area of serviceIts difficult reaching Customer Service"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paula",
          "Nb_Reviews": 1,
          "Date": "2022-05-11T02:38:13.000Z",
          "Titre": "Have had a few issues"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 1,
          "Date": "2022-10-11T17:17:04.000Z",
          "Titre": "Need to block calls"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Norma",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T19:55:56.000Z",
          "Titre": "Community Phone is EZ phone.",
          "Contenu": "Was able to update credit card from one to another.  This was one issue and one person but went smooth.  There has hardly been time for evaluation of phone.  This was installed for my sister so it will be there if her cell phone fails her and she has barely \"met\" it.  Thankful for it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Duncan Esplin",
          "Nb_Reviews": 3,
          "Date": "2023-10-19T00:36:27.000Z",
          "Titre": "very bad experience",
          "Contenu": "Was not until after paying upfront for the year was told that the A-I they use does not recognize calls coming from Verizon phones so friends had to call a cell phone . Once I cancelled service and try to return base unit was told they DONT REFUND for service only for the return of the base unit , this all took place within a week , Dont trust these folks and dont fall for their discount if you buy a year upfront !UPDATE..I have been able to resolve problems with Community Phone and have received refunds Thanks Britney"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JUDITH BLASI",
          "Nb_Reviews": 2,
          "Date": "2023-08-02T06:14:49.000Z",
          "Titre": "I love the phone clarity",
          "Contenu": "I love the phone clarity. My cell phone is not clear at all. I have had a few disconnected calls. My big problem is setting  & getting into my voice mail. The instructions when you dial 1 is not clear enough. I forgot my password & have no idea how to reset password. More information should be sent with the modem. I like having a clear voice on my end & callers end."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Diane",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T08:34:27.000Z",
          "Titre": "It seems to be working well",
          "Contenu": "It seems to be working well.  It took longer than I expected to get it all switched over.  I still show a different number when I  call someone. Hope this is fixed by tomorrow, but I  think I will like it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gary",
          "Nb_Reviews": 1,
          "Date": "2022-05-11T14:24:59.000Z",
          "Titre": "Only one incident and need to understand about annual membership.",
          "Contenu": "So far, everything has been OK.  I had some strange problems losing dial tone and connection issues, but I rebooted the system by turning off power to the little antenna tower for a few minutes and then powering on again. That solved the problem. I was not able to contact a technician, because it was after hours.  Other than that, it seems fine. I need to understand what \"annual membership\" means, because I make very few calls and an email said I could save money with annual membership. I don't make many calls and saving money with an annual membership might be beneficial."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 2,
          "Date": "2022-05-11T17:48:31.000Z",
          "Titre": "Your customer service folks were very…",
          "Contenu": "Your customer service folks were very helpful.  I did have some problems getting my 92 year old mother’s original phone number transferred over to you.  Most of this was AT&T.  Your receiver device has stopped working 3 times.  I think that it may lose the signal and cannot reestablish by itself.  I turned it off then restarted it.  After going through it’s startup routine the phone worked again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rosemary and Eva Roberts",
          "Nb_Reviews": 1,
          "Date": "2022-06-26T22:15:29.000Z",
          "Titre": "Like the Service...Butttt!!!!!",
          "Contenu": "Still having issues...but once I switch out the old landline box to the new one I'm hoping all will be better & my Mom's phone line will be working more than it's not!!! However, Customer Service & Tech. Support are Awesome & will do wherever it takes to fix your problem to keep you a satisfied customer!! So far both my Mom & I are happy with Community Phones & the cost is the best I've seen in a long time!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kathryn Minter",
          "Nb_Reviews": 3,
          "Date": "2023-04-08T19:41:38.000Z",
          "Titre": "We have had problems with the phone…",
          "Contenu": "We have had problems with the phone since we got it, but the techs are always available to help.  We still do not have VM through your system, but one tech showed us how to set up our local VM on our home phone.  At times, we still have incoming calls go directly to VM or they say the line is not available.  Thankful we have a cell phone as backup when this happens."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Judith LaRue",
          "Nb_Reviews": 3,
          "Date": "2022-12-28T16:02:17.000Z",
          "Titre": "Purchased 11/16",
          "Contenu": "Purchased 11/16, received 11/18, service out comes & goes; incoming calls ring but unable to answer; moved equip room to room to find best location, none get a constance 2 bars which is necessary to receive/make calls.  11/28 called to cancel service, got ticket & advised will get emails. Got email saying had to allow company to troubleshoot service.  Subscription was final purchase would not be refunded.  Responded, get technicians to do whatever necessary to correct service but if not effective I would need a full refund of money for equipment & subscription as I was assured would happen if service could not be corrected to a dependable phone lineThe service could not be fixed.  Took a bit but all funds were refunded.  Have to say service department did get everything straightened out."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Lyon",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T22:19:34.000Z",
          "Titre": "Nice to have live customer service with…",
          "Contenu": "Nice to have live customer service with a reasonable wait time.  The service rep told me to take the back of the base off to use the reset button, however, such a thing does not appear to exist and there is no way to remove the back from the base."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "susan vigneault",
          "Nb_Reviews": 2,
          "Date": "2023-01-25T18:02:59.000Z",
          "Titre": "CROOKS!",
          "Contenu": "Never received the package.  Call for a refund but wouldn't oblige. This company is a total scam. Taking advantage of seniors. We paid for a year up front. No refund.  I will take this up with the CFPD and the attorney General. These people belong in jail.UpdateAfter a review from Community phone all was remedied."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Toni Greenlaw",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T11:55:56.000Z",
          "Titre": "The entire experience was wonderful",
          "Contenu": "The entire experience was wonderful, the only thing that really isn't an issue is the time you must wait for a dial tone.  No big deal, just that's it and that doesn't bother me or my family."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "lena",
          "Nb_Reviews": 3,
          "Date": "2022-05-11T13:15:28.000Z",
          "Titre": "I like it",
          "Contenu": "Took a while to get my service going, I had to call 3 times to get my original number transferred, from misinformation.  Some call ID numbers show on my phone, some do not.  Sometimes I have to dial a number twice before it connects.But all in all, I wanted a landline.  It's good so far."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donna",
          "Nb_Reviews": 2,
          "Date": "2022-05-18T15:13:51.000Z",
          "Titre": "Our service is fine",
          "Contenu": "Our service is fine, but it’s really challenging to speak to a person and change logistics like how your payment is being made.  For instance changing cards that your payment is charged to.  Also that is the only option for payment.  They can’t do a direct draft from a bank account."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charles Soderin",
          "Nb_Reviews": 5,
          "Date": "2023-04-14T18:56:00.000Z",
          "Titre": "Only problem was that I was informed…",
          "Contenu": "Only problem was that I was informed that my hard line number had been transferred. In fact my previous carrier had changed the transfer date and I wasn’t notified 🤔"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-10-19T19:54:52.000Z",
          "Titre": "I love hearing my longtime phone number…",
          "Contenu": "I love hearing my longtime phone number ringing in my new location. What I noticed is the amount of static. At times it is so loud its deafening - not sure the cause. Its a bummer. Otherwise, I love the service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cheryl",
          "Nb_Reviews": 1,
          "Date": "2022-05-17T23:15:51.000Z",
          "Titre": "The reception is not always adequate",
          "Contenu": "The reception is not always adequate.  That may not be your fault but I’ve had several people look at it.  It seems to have better reception in different places within the apartment."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cynthia F.",
          "Nb_Reviews": 2,
          "Date": "2023-03-29T01:35:32.000Z",
          "Titre": "I’m happy to have my land line phone…",
          "Contenu": "I’m happy to have my land line phone number move with me. However, I miss seeing the name of callers along with their number.. it makes it irritating to decide to answer the phone when it rings."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kathleen Haton",
          "Nb_Reviews": 1,
          "Date": "2023-04-09T19:31:45.000Z",
          "Titre": "I find if I haven't used the phone for…",
          "Contenu": "I find if I haven't used the phone for an extended period of time, I need to unplug the unit to \"reboot\" it. Otherwise, am satisfied with the service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Luana",
          "Nb_Reviews": 1,
          "Date": "2022-07-01T13:49:03.000Z",
          "Titre": "Community phone to the rescue!!",
          "Contenu": "Community phone came to my rescue when I had no other options. We were new in the neighborhood. Our mobile provider did not support our area and I was working from home. The IP was patchy and I couldn't use my VOIP. so using Community phone was a God sent. Thanks for your service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ronald",
          "Nb_Reviews": 2,
          "Date": "2022-05-11T01:42:21.000Z",
          "Titre": "need old house phone no.3372389809",
          "Contenu": "when i changed to community phone service i tried to get my old phone no which is 3372389809 from magic jack phone service never happened. other than that, i like community phone service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jean Yorke",
          "Nb_Reviews": 2,
          "Date": "2022-05-11T14:21:32.000Z",
          "Titre": "I ordered this phone for my mom (93)…",
          "Contenu": "I ordered this phone for my mom (93) and it works pretty well.  The clarity is great, but there are a few small issues that we have with it that probably wouldn't hamper my buying it again. The first is that it has random beeps about every 3 minutes that, when it beeps, I can't hear what she's saying.  The second is that it has had to be rebooted twice now, and when that happens, she can't do it herself.  I  have to drive to her house and perform the task of removing the back cover and inserting a toothpick or paperclip into the tiny hole in the back to reboot it, then wait for the lights to all come back on.  This procedure had to be performed 3 times last week to get it to reset correctly. The third is that the device needs to be placed in a window in order to pick up the best signal, which is not always convenience if you have no window sills or tables in front of a window.  Again, none of these issues would deter me from using this device or recommending it to anyone that needs just a phone and doesn't have a reasonable local phone company option.  Overall, I give it 4 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marilyn Sutcliffe",
          "Nb_Reviews": 1,
          "Date": "2023-04-08T02:07:47.000Z",
          "Titre": "When I give number to retail clerk…",
          "Contenu": "When I give number to retail clerk another person’s name is revealed. It has happened  few times."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer: Valuable customers",
          "Nb_Reviews": 4,
          "Date": "2022-05-18T19:16:39.000Z",
          "Titre": "Simple to set up",
          "Contenu": "Simple to set up. This landline connection is interfaced with and Dependent on cell towers for transmission of signal. This is an indication of the obsolescence of hard wired equipment available for secure and more dependable phone service. The old technology was and still is greatly appreciated, but has largely been replaced by cell phone and cell tower repeaters to relay the communications (antenna) streams. The changeover to internet providers for regular phone service, commercial, industrial, and small businesses are not excluded. This COMMUNITY PHONE is Not a party line, which certainly would be considered a totally UNSECURED LINE for personal and/or private communications. This Community Phone requires a 120VAC outlet to power this unit continuously. When power is lost, you can expect service to continue. This service will switch automatically to BATTERY BACKUP! Battery life has not been reported in the setup instructions and list of components in the package when shipped to the customers. I lost power and the phone worked just fine. Note: You must purchase a landline handset for service upon installation. The regular phone jacks for landlines still are the connection ports for signal incoming and the handset to make or receive phone calls. Still assessing service quality while speaking. So far clear and line-noise free. Good job by Community Phone up to this point."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gary Kinoshita",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T07:03:13.000Z",
          "Titre": "Community Phone for Seniors",
          "Contenu": "Community Phone provides reliable service at an affordable cost for senior citizens who survive on a fixed income. Customer service is helpful with clear and reliable solutions for phone outages or usage issues."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Florence/Susie",
          "Nb_Reviews": 1,
          "Date": "2022-05-11T01:13:20.000Z",
          "Titre": "We’re happy with the phone service",
          "Contenu": "We’re happy with the phone service. My only complaint is that my Bank changed my debit/credit card #.. and we received a daily message. Someone called my mother, who has the phone and is 92, in a care center. My name is on the phone and I pay the bill every month. I wasn’t called. I feel I should have been given the time allotted in my daily Emails to take care of changing my card info for payment!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paula",
          "Nb_Reviews": 1,
          "Date": "2022-05-10T21:44:49.000Z",
          "Titre": "Equipment arrived quickly",
          "Contenu": "Equipment arrived quickly.  Set was easy. Transfer of number was longer than anticipated hence 4 instead of 5. Customer service 5. Patient and polite"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donna",
          "Nb_Reviews": 3,
          "Date": "2022-05-18T01:56:53.000Z",
          "Titre": "I believe Community phone is a great…",
          "Contenu": "I believe Community phone is a great service with wonderful and friendly customer service. There were a few hiccups but customer service is there to help"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jimandpatsy Nay",
          "Nb_Reviews": 2,
          "Date": "2023-03-25T01:42:13.000Z",
          "Titre": "Their phone is very reliable",
          "Contenu": "Their phone is very reliable -- always there and working when I need it.  The price is reasonable, also."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 1,
          "Date": "2022-05-10T23:22:10.000Z",
          "Titre": "Customer service was very helpful when…",
          "Contenu": "Customer service was very helpful when the phone was down. Once the modem was replaced no problems with phone service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Macioszek",
          "Nb_Reviews": 4,
          "Date": "2023-03-23T16:06:02.000Z",
          "Titre": "phone cuts out at times where second…",
          "Contenu": "phone cuts out at times where second party can not hear me, system is not very good with wireless phone"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Nelson",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T01:47:43.000Z",
          "Titre": "Needs more rings before phone message…",
          "Contenu": "Needs more rings before phone message activated, that is, minimum of eight rings"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Barry",
          "Nb_Reviews": 1,
          "Date": "2022-05-17T23:53:15.000Z",
          "Titre": "There's a problem with the volume on…",
          "Contenu": "There's a problem with the volume on incoming calls.  Have not beenable to resolve it.  Otherwise, just fine..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Goldena",
          "Nb_Reviews": 1,
          "Date": "2022-05-18T00:56:39.000Z",
          "Titre": "Louis was very helpful",
          "Contenu": "Louis was very helpful. He walked me through troubleshooting when the phone wasn't working."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2022-05-12T15:35:44.000Z",
          "Titre": "Quick and efficient",
          "Contenu": "Quick and efficient, pricing was great and service is awesome"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff Hero",
          "Nb_Reviews": 2,
          "Date": "2023-04-03T20:11:16.000Z",
          "Titre": "It keeps disconnection from the phone…",
          "Contenu": "It keeps disconnection from the phone handset"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cheryl Sherwood",
          "Nb_Reviews": 1,
          "Date": "2023-01-21T23:07:28.000Z",
          "Titre": "Works as advertised , low cost ? Eh!!",
          "Contenu": "Community phone definitely met the need  , of a phone service for my elderly mother when Verizon's stopped supporting her 3g based cellular base  , she can't see well enough to navigate a cell phone , not sure her voice is strong enough to consistently use voice activated cell options  , received the unit  , plugged her familiar handset in & was immediately using the phone with a temp # , took a few days to get her old # ported over , Community's user support  very helpful & good at communication. , My only slightly negative thought is Community bills itself as low cost / no hidden fee  , my 39 dollar monthly bill is actually $53 xx after taxes , the taxes & fee' may not be Community generated & are not hidden the Community Sales rep did enumerate these clearly  , but even $39 seems high for a single line with no Data compared to other carriers great & small  & I would imagine most consumers of the cellular base service are elderly & on a fixed income with no ability to access Data anyway  , other than the slightly higher price for basically basic service it seems to work very well & as advertised  , 2 weeks problem free so far !!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kenny",
          "Nb_Reviews": 1,
          "Date": "2022-05-11T14:40:55.000Z",
          "Titre": "The phone works very well it was a way…",
          "Contenu": "The phone works very well it was a way to keep in touch with my aging family"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sonya Gaynor",
          "Nb_Reviews": 3,
          "Date": "2022-05-12T20:01:48.000Z",
          "Titre": "Good Service",
          "Contenu": "Thank you Community Phone for the good service you have provided."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kathleen",
          "Nb_Reviews": 3,
          "Date": "2023-03-23T20:12:25.000Z",
          "Titre": "Pretty Good Company!",
          "Contenu": "I’m happy with the service and I live in the mountains!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jesus",
          "Nb_Reviews": 3,
          "Date": "2023-07-11T17:39:07.000Z",
          "Titre": "Very simple set up",
          "Contenu": "Very simple set up. Easy to use for my elderly mom."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joyce F",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T09:47:06.000Z",
          "Titre": "I will recommend this one."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mary Myers",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T19:46:39.000Z",
          "Titre": "Good service use",
          "Contenu": "Good service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ken",
          "Nb_Reviews": 1,
          "Date": "2022-05-11T14:46:05.000Z",
          "Titre": "Nice help.",
          "Contenu": "Very helpful with ring duration issue."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Helen Green",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T22:32:51.000Z",
          "Titre": "Provide reliable phone service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dorothy Ann Garrett Bradley",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T16:45:48.000Z",
          "Titre": "Price",
          "Contenu": "Can't beat the price. Wish it had called ID."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "K g",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T00:44:56.000Z",
          "Titre": "Good for nursing home",
          "Contenu": "Good reception"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sharon",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T03:05:42.000Z",
          "Titre": "Customer service was excellent",
          "Contenu": "Customer service was excellent, please keep it going in America.We're still having a little problem with connection but pretty sure it's our location. Prices are very good, after dealing with ATT,I would say they are excellent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "tracy geib",
          "Nb_Reviews": 5,
          "Date": "2023-11-23T02:19:26.000Z",
          "Titre": "l live in a rural mountain area and…",
          "Contenu": "l live in a rural mountain area and have spotty reception if l am lucky. l found your company and did some homework about refunds etc. if l get terrible reception. l decided to try, and boy am l glad that l did. l get perfect reception every time and it is less expensive that landline companies that have been around forever. l recommend you try this company...they are for real and are there to help you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary Worsley",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T21:16:03.000Z",
          "Titre": "Clear Cut Communication With Community Phone Representatives",
          "Contenu": "I was so stressed out  I was trying to find a company that is customer friendly.Looked up Phone ratings Community Phone, has a TOP rating. The individuals that represent the company are pleasant, didn't transfer me from one place to another; and after waiting on the line; didn't cut me off.  I see why the company has a good rating.I am also happy to have the personal assistance that I received from the Onboarding office.  I was having a lot of trouble getting my phone service straight; but by the kind guidance that I have received from the agent; at the Onboarding Office; who I had been speaking to by e-mail, all is well.   A pleasant surprise!  He reached out to me by phone. And offered assistance.  My landline was already switched; I was having difficulty switching my cellular from another phone company to Community Phone. All is set.  He helped me tremendously; I will let my Senior Wellness Center in DC know about this service.  I highly recommend this company and Its outstanding customer support.  Mary W."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melissa",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T17:48:19.000Z",
          "Titre": "Awesome customer service very…",
          "Contenu": "Awesome customer service very professional, received my equipment very quickly with no issues.  I would highly recommend so much better than those other providers.  Finally a landline that has great service without the big provider hassels."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alan",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T02:22:43.000Z",
          "Titre": "Excellent Experience~!",
          "Contenu": "I have been working with a Congolese church (I am not Congolese), helping them out with their technical issues.  I was tasked with finding them a telephone service that would be excellent and affordable.  I have been working with Elijah, and it has taken over a month to resolve all of this (because of the issues the Congolese have), and the language barrier.  Elijah has been extremely helpful and responsive on days I thought he would be unavailable.  He has been understanding, continuously communicative, and all around very pleasant to work with.  He gets A+++ for my review, and deserves a big raise!  Thanks so much!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alexendra",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T19:13:22.000Z",
          "Titre": "Keep Land Line active",
          "Contenu": "As retired disable person I am grateful for a chance to use landline phone. It is more convenient for me and more affordable.Thanks,Alexandra."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Esther Moerth",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T18:43:05.000Z",
          "Titre": "Great costumer service",
          "Contenu": "Great costumer service! Great to have a landline phone that doesn’t depend on wiring...unfortunately doesn’t always work perfectly in our remote area ....therefore switched to regular landline....would love to be able to keep this phone just for emergency situations (storm power/telephone line outages etc.), without having to pay a fee for every month....maybe Community phone can introduce a special plan for costumers who are interested in that kind of service. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karni Syed",
          "Nb_Reviews": 2,
          "Date": "2023-08-15T01:36:59.000Z",
          "Titre": "Experience was fast easy and the reps…",
          "Contenu": "Experience was fast easy and the reps are respectful and know what they are doing. After dealing with another company who gave me the run around and couldn’t get the line up and running, I found Community Phone and it was set up and worked in a snap"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "paul murphy",
          "Nb_Reviews": 3,
          "Date": "2023-06-09T01:40:52.000Z",
          "Titre": "The people at Community Phone have been…",
          "Contenu": "The people at Community Phone have been excellent surpassed my expectations.It truly was plug-and-play, which was a Pleasant expierence.The curveball is my 95-year-old mother who God bless her soul does have short term memory gapsCommunity Phone‘s team was so patient on the phone and walked her through everything. Your service is great AT&T or is transferring us to so many departments and then off to the Philippines.Community Phone is a breath of fresh airPaul Murphy"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barry",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T19:43:45.000Z",
          "Titre": "Switching to Community Phone",
          "Contenu": "With my previous landline phone provider, I had continual static, which eventually made it almost impossible to hold a conversation.  They tried to fix this 4 different times.  It would be static free for a while and then the static would resume again.  I stumbled on Community Phone and switched.  Setting it up was simple, and it works, static free.  Also, unlike my previous provider, Community Phone has been very helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George Hendricks",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T04:53:58.000Z",
          "Titre": "Community Phone is a God send for those…",
          "Contenu": "Community Phone is a God send for those of us who have loved ones in a memory care facility. It doesn't need a hardwired complex system in house, and you don't have to navigate endless bureaucrats to set it up. It is easy to set up and it is very reliable as it operates through widely available cell systems. I took it out of the box and had it set up and operating within maybe 45 mins. AND the price is very reasonable, and beats all the other phone services."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathleen Nelson",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T01:51:47.000Z",
          "Titre": "The monthly cost for my (land line) is…",
          "Contenu": "The monthly cost for (land line) is great!  Getting an account set up was easy.  Customer service was great. They followed up to see how my set up and first few days went.  This was helpful and appreciated.  The company seems truely genuine in their desire to offer good service at affordable rates and caring about their customers. Thinking about using them for cell phone service too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vickie Melhorn",
          "Nb_Reviews": 3,
          "Date": "2023-05-06T22:17:54.000Z",
          "Titre": "This company has their customers best interest in heart",
          "Contenu": "You are very committed to helping your clients. I was impressed with the knowledge you gave me and walking me through the complete phone set up. The phone box arrived in expedited time also. The ease of ordering, setting up, receiving my phone number and reaching customer service for support was amazing. Thank you for taking care of your customers"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan Tauber",
          "Nb_Reviews": 3,
          "Date": "2023-04-03T23:32:17.000Z",
          "Titre": "Best Move I Could Have Ever Chosen",
          "Contenu": "Best move I ever made! Best customer service, best pricing for (especially) the elderly, like me, most honest, most straightforward, and the best company overall for those unable to exist only on Social Security. I have a heart disease for which there is no cure, only a “life prolonging” procedure for which I do not qualify, because an induced heart attack would kill me. I LOVE life, I LOVE living. But there is a huge difference between living and simply existing. That is what I face every single day, and I cannot rightly “choose” to simply exist, under those circumstances. My road ahead is filled with dangerous “physical potholes” and alluring curves that lead to a subsequent compassionate life changing decision!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alejandra Engley",
          "Nb_Reviews": 2,
          "Date": "2023-04-08T18:14:56.000Z",
          "Titre": "Community Phone Always On",
          "Contenu": "Community Phone stays on when power goes off due to weather. One time I was disconnected, the advice to reboot worked. Help is always available.We have a Panasonic Cordless Answering System with 4 handsets. I turned off the answering system. I have phone contacts in google voice. All our phone calls show caller and number on handsets. Missed calls show up on the Community Phone device."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alice Templeton",
          "Nb_Reviews": 3,
          "Date": "2023-03-28T23:20:36.000Z",
          "Titre": "No Outages or Telemarketers",
          "Contenu": "No Outages or Telemarketers We don't get many calls, but when it does ring it is a friend, family member, or doctor. All those marketers sure made our lives miserable. This service has been excellent. I've told most of my family members about your new phone service. Love your service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary Haik",
          "Nb_Reviews": 8,
          "Date": "2023-06-14T13:22:21.000Z",
          "Titre": "Customer service was excellent",
          "Contenu": "Customer service was immediately available to assist me when I had an issue with my phone. They stuck with me until the issue was resolved. They sent new equipment and before I'd gotten it unboxed, they called to see if I wanted help setting it up. Thank you Community Phone, specifically Luis, for the excellent customer service!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Andrew Bull",
          "Nb_Reviews": 2,
          "Date": "2023-07-07T18:34:50.000Z",
          "Titre": "The A Team",
          "Contenu": "Yasir M and David W turned up on time and installed fibre quickly, safely and left me happy. This was especially nice as the previous 3 engineers turned up with out a hoist and didn’t sort me out like the A team"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan Tauber",
          "Nb_Reviews": 3,
          "Date": "2023-04-03T20:11:46.000Z",
          "Titre": "Switching to Community Phone was the…",
          "Contenu": "Switching to Community Phone was the best decision I’ve ever made! Cost is amazing, customer service is even better, and I’m happier, knowing that I’m in much better hands than I was before. We older folks are more grateful for you than you’ll ever know!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "T Pryor",
          "Nb_Reviews": 2,
          "Date": "2023-05-30T15:34:55.000Z",
          "Titre": "The mannerism of the staff n the…",
          "Contenu": "The mannerism of the staff n the overall conversation thru out the ordeal have been excellent. Not one negative response from your team. Thank u for the ride n I appreciate all of u n sorry have to end my mom's service.😪"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wendy Johnson",
          "Nb_Reviews": 3,
          "Date": "2023-05-23T22:36:09.000Z",
          "Titre": "Customer care help was topnotch and great phone service.",
          "Contenu": "Customer service extremely pleasant and helpful and anxious to please. And the phone service is wonderful - hooray for no more depending on internet! Just wish we could still get real copper lines so we'd have phone during electrical outages."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tricia",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T18:41:47.000Z",
          "Titre": "Excellent customer service!",
          "Contenu": "Excellent customer service every person has been kind and helpful shipping was very quick for my phone and box to arrive service works perfect!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lita R",
          "Nb_Reviews": 3,
          "Date": "2023-05-17T01:20:46.000Z",
          "Titre": "From beginning to end everyone I spoke…",
          "Contenu": "From beginning to end everyone I spoke to was nice and helpful. The phone system seemed like a no brainer since landlines are becoming obsolete. My situation changed and I didn’t need a landline anymore but I was impressed how the company was helpful, knowledgeable and accommodating from beginning to end. I would highly recommend this company’s services"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Betty Parsons",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T18:50:38.000Z",
          "Titre": "Stayed on top of it",
          "Contenu": "I received several communications by way of email and phone calls to keep me apprised of the status of my mom’s set up.  We had some glitches along the way with transferring Mom’s number to Community Phone, but I was guided step by step."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom Hill",
          "Nb_Reviews": 4,
          "Date": "2023-06-10T02:04:24.000Z",
          "Titre": "JUST THE THING FOR SENIOR CITIZENS.",
          "Contenu": "Incredibly easy hook-up for an 84-year-old non tech savvy guy.  Been using 2 weeks now and working flawlessly.  I switched frm AT&T to get the total scam blocking feature.  In 16 days, it has blocked 600 scam calls and not one got throught to my 83-year-old bride, who is really gullible to these calls in her advanced years."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joyce Ross",
          "Nb_Reviews": 3,
          "Date": "2023-05-06T01:14:11.000Z",
          "Titre": "Great Landline Company",
          "Contenu": "Representatives were helpful and very attentive to my concerns and requests.  They followed up frequently and always asked if I was satisfied.   I very much appreciate the service Community Phone provided.  I really like the credit offered to the person who refers Community Phone to others."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JustAnswer Customer",
          "Nb_Reviews": 2,
          "Date": "2023-03-23T22:38:48.000Z",
          "Titre": "Community Phone is a reliable",
          "Contenu": "Community Phone is a reliable, user-friendly service.  I like having a landline, which is very helpful in a power failure.  Saved money over phone company landlines.  Thank you, Community Phone!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alice Templeton",
          "Nb_Reviews": 3,
          "Date": "2023-06-08T02:56:30.000Z",
          "Titre": "This is the best phone service I have…",
          "Contenu": "This is the best phone service I have ever had. When it rings, I know it is an important call from a doctor or friend. No more annoying calls that bug me all the time. Trying to sell me something or just all-out lies to make me believe I have won something, then telling me to pay for the taxes or postage. I used to get them so much I hated to answer my phone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ann Goehner",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T21:57:51.000Z",
          "Titre": "Community Phone genuinely cares about…",
          "Contenu": "Community Phone genuinely cares about their customers. As they have continued to grow they have continued to add extra service options that I really like, too.  Very happy with the price of their service also."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sharon Cooper",
          "Nb_Reviews": 1,
          "Date": "2023-03-04T01:53:27.000Z",
          "Titre": "We have never had a problem since signing up in December 2021!",
          "Contenu": "We have had Community Phone service since 12/16/21.  My landline through our major carrier was over $70 a month, and going up.  We are both retired, so I thought I would see what else was available.  I found this service, was able to keep my landline phone number that we had for 43 years at that time, and have never looked back.  I was so surprised to see all of the really bad reviews of this service.  We have never had one bad experience since we signed up.  We will stick with them, they have done everything they promised before we became customers, and we have always had great reception and as good or better phone service than we had with the \"Big\" companies."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jerold Glen Cauthon Jr",
          "Nb_Reviews": 6,
          "Date": "2023-04-10T22:15:38.000Z",
          "Titre": "A Great Phone Service Provider",
          "Contenu": "I don't really like the fact that my cell phone service with them doesn't have voicemail, but I can live with that since I do have voicemail on my landline service.  Other than that, they are a great service provider."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan Tauber",
          "Nb_Reviews": 3,
          "Date": "2023-04-07T20:52:57.000Z",
          "Titre": "The best move I ever made was switching…",
          "Contenu": "The best move I ever made was switching to Community Phone. The customer service is great, the pricing is phenomenal, and I have never been happier with my phone service. Thank you so much for helping me make this decision!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mozella Crowder",
          "Nb_Reviews": 1,
          "Date": "2023-04-08T19:58:54.000Z",
          "Titre": "My experience with Community Phone",
          "Contenu": "My experience with Community Phone has been great!  The transition from my mobile phone to a landline phone was seamless with Community Phone. What's most important is the security of knowing that the service is always available and reliable.  Thank you for this innovative idea!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gerardo Berrios",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T16:29:33.000Z",
          "Titre": "I wanted a landline in case of power…",
          "Contenu": "I wanted a landline in case of power outage due to hurricane. I ordered an old school phone like the one I was familiar with back in the seventies. I’m moderate happy with the phone. Only problem is I can not setup voice mail. I tried to follow the instructions but it says I need to call my number and press talk, call or flash. I tried calling the support line but after waiting half hour I chose the option to receive a call back which never came. The talk, call or flash buttons are not available on my phone. Update 3/27/23Received call from customer support. Was not able to solve problem. Still don’t have voice mail.Received a follow up phone call from customer support. Voice mail is now up and running. Updated rating to 5 stars."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sheila Parks",
          "Nb_Reviews": 3,
          "Date": "2023-06-15T14:40:25.000Z",
          "Titre": "My experience was always great from the…",
          "Contenu": "My experience was always great from the first day I applied at community phone. The customer service was excellent. They were willing to help me get adjusted to the new phone system."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DEBORAH LANGTON",
          "Nb_Reviews": 2,
          "Date": "2023-03-28T21:50:30.000Z",
          "Titre": "Sorry I don’t remember date or details…",
          "Contenu": "Sorry I don’t remember date or details but your representatives have always solved problems and did it with perfection. Live people to talk to is always the best choice, not robots!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Margaret Ferrick",
          "Nb_Reviews": 3,
          "Date": "2023-04-12T21:56:39.000Z",
          "Titre": "Good customer service, good price!",
          "Contenu": "The representative I spoke to was willing and capable to answer my  questions and to explain how the system works. Certainly the price was right for service! And while we have a cell phone, its nice to have a land line."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sean F",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T16:52:24.000Z",
          "Titre": "I can finally ring my family",
          "Contenu": "I can finally ring my family, friends and doctor again. My old provider shut me off. Needed a provider that just offers basic service. Happy to come across community phone. It’s hard to find simple things in the world these days. Everything has to be complicated. Not Community phone. Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles",
          "Nb_Reviews": 2,
          "Date": "2023-04-04T00:45:00.000Z",
          "Titre": "Great customer service!",
          "Contenu": "Community Phone has been great. I have only had one issue when the box quit working after about a year. I contacted them and they sent a new box immediately. I love that when I moved, all I had to do was unplug the box, bring it with me and plug it in at my new address and I was good to go. Simplicity and great customer service- two rare things these days!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barbara E.",
          "Nb_Reviews": 3,
          "Date": "2023-03-21T00:42:32.000Z",
          "Titre": "So Good!",
          "Contenu": "I am beginning my fourth year with Community Phone, and I couldn't be more pleased. The service easily equals that of AT&T, at a fraction of the cost.Set-up is simple, and customer service is the best in the business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julie Miles",
          "Nb_Reviews": 4,
          "Date": "2023-03-30T20:23:31.000Z",
          "Titre": "So far everything it's great to be able…",
          "Contenu": "So far everything it's great to be able to call local and long distance for one flat rate and not have to have two phone carriers one for local and one for long distance and long distance be charged 10 cents per minute"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lynn RUTHLESS ANGEL",
          "Nb_Reviews": 8,
          "Date": "2023-05-18T21:25:11.000Z",
          "Titre": "Great customer service",
          "Contenu": "We switched to community phone after our previous provider drastically increased their pricing. Community phone is a lot less expensive,  their customer service agents are amazing,  very knowledgeable and courteous to customers.  I highly recommend community phone service for your landline needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laura Wheeldon",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T02:47:49.000Z",
          "Titre": "Before Community Phone",
          "Contenu": "Before Community Phone, I had no connection with the outside world, lol. Thanks to this great service, I now have a phone that allows me to get help if I need it. I am a 60+ widow out in the country with no cell service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lena May",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T19:03:52.000Z",
          "Titre": "Thank you for the service you do",
          "Contenu": "Thank you for the service you do. I have not had any phone issues since I started with y’all and that is a wonderful feeling when I was with the other company my phone always stayed messed up and I couldn’t get anyone to fix the issue. Thank you for all you do."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kehbe",
          "Nb_Reviews": 2,
          "Date": "2023-07-20T00:51:53.000Z",
          "Titre": "Will recommend to family and friends!",
          "Contenu": "Fast shipping of equipment, easy setup and install, friendly and helpful customer support, fair pricing and reliable signal and service. Thank you Community Phone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "caa",
          "Nb_Reviews": 2,
          "Date": "2023-03-27T17:11:09.000Z",
          "Titre": "Excellent company",
          "Contenu": "My phone is working great so far, any issues i have had were attended to in the quickest and professional manner. Everyone was extremely helpful to make sure my phone was working to my satisfaction and i am very happy that it is!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yolanda Buchanan",
          "Nb_Reviews": 2,
          "Date": "2023-06-01T19:52:04.000Z",
          "Titre": "I have exceptional phone service",
          "Contenu": "I have exceptional phone service. Had a small problem stopping voice mail service from operating on my phone. But all I had to do was call and the tech I talked to knew exactly how to stop it. Great service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nancy McMannus",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T03:55:18.000Z",
          "Titre": "The excellent customer service of Community Phone",
          "Contenu": "When I received my Community phone base and hooked it up, I couldn't call out but I could receive calls. I immediately called the company and spoke with Charles in the Onboarding Dept. He went above and beyond his duty to help me and by the next day he called and had figured out the problem and fixed it. I could call out and receive calls with no problems. I was using a temporary number and Charles ported in my number I wanted transferred and my phone is working fine. I had never seen such wonderful customer service from any company. Charles called me many times during this process and was very concerned about me and spent much time on solving the problem and getting me hooked up properly. I really appreciate all that he did and am very grateful to him. I was so worried about tranferring my number and that I would lose it and he reassured me that he would make sure I didn't lose it. The other customer service representatives  have been helpful too but Charles really is outstanding. I have never seen any company with people like Charles who go out of their way to make sure the customer is satisfied. Thank you Charles. You put me at ease and I'm really enjoying my Community phone system. I would highly recommend Community Phone to anyone who wants a landline phone. You can really depend on them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anne",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T21:22:17.000Z",
          "Titre": "Trouble logging into my account",
          "Contenu": "I called C/S because I couldn't log into my account. C/S rep put a request in to fix. I received an email with a link that got me into my account no problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marge Stanton",
          "Nb_Reviews": 1,
          "Date": "2023-02-02T20:28:51.000Z",
          "Titre": "Concern was expressed",
          "Contenu": "It was very good. I was listened to, asked questions & the interview was done quickly with the person in question.  A response was given in a quick period of time and I felt things were handled professionally."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Meloney Ashworth",
          "Nb_Reviews": 2,
          "Date": "2023-03-28T02:54:05.000Z",
          "Titre": "The only thing that would make her…",
          "Contenu": "The only thing that would make her phone service any better would be if she could have her original home phone number 251-633-8818."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alice Templeton",
          "Nb_Reviews": 3,
          "Date": "2023-05-18T21:11:23.000Z",
          "Titre": "I haven't had any trouble with my…",
          "Contenu": "I haven't had any trouble with my phone, and I have told everyone who is having phone troubles about Community Phone. It is well worth what I pay for it. Getting rid of those callers trying to cheat me out of what little I have. The same caller called me eight times one day. When the phone rings these days, it's a friend, a family member, or a doctor. I can't thank CommunityPhone enough."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carol",
          "Nb_Reviews": 2,
          "Date": "2023-05-27T13:17:14.000Z",
          "Titre": "Everything went so well",
          "Contenu": "Everything went so well.  When the box was delivered everything was activated we just followed simple instructions and everything works great.   Very pleased  The whole process of signing up was so easy.   Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gabrielle Zu��iga",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T12:57:15.000Z",
          "Titre": "Great Service",
          "Contenu": "I don't have any problems with this service!If I need help,I get great customer services. Plus I can connect my phone anywhere in my house!Thank you community phone, I have no complaints about you all!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Isaac",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T16:51:45.000Z",
          "Titre": "I have had this system for a while and been mostly pleased BUT..…",
          "Contenu": "I have had this system for a while and been pretty pleased with it and I kept my OLD phone number,,,However: Lately a lot of input calls have gone to the Temporary Number issued when I first got the system . The greeting they hear is the initial one I set up and then it goes to that voice mail box. It apparently isn't switching to my Home Phone number all the time. Doesn't happen all the time but it's getting annoying. And sometimes in the middle of a conversation, it just goes silent/disconnects and I have to call that  party back. Small but irritating glitches. Thats why I can't rate it any higher.UPDATE:After posting this, I got an email and phone call from Community Phone. They got with me and we did some setting changes on my end and their end. The result seems to be that calls coming in now are properly switched to my home phone. Time will tell if this is fixed but I have faith that the problem is solved. I want to thank them for their prompt and courteous response to an aggravating situation. So I will raise my rating to a 5 STAR and be a happy customer.  Isaac"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elizabeth Engeman",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T23:57:41.000Z",
          "Titre": "Community phone has provided a reliable…",
          "Contenu": "Community phone has provided a reliable phone for my mother in a nursing home.  We used our own phone and set up  was very easy.  Customer service has been great also,"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keith",
          "Nb_Reviews": 2,
          "Date": "2023-03-23T20:30:50.000Z",
          "Titre": "It's exactly what I need",
          "Contenu": "It's exactly what I need: a landline number for in-coming calls which are forwarded to my cell phone, at 1/4 the price I paid to AT&T!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deborah",
          "Nb_Reviews": 1,
          "Date": "2023-07-01T04:11:01.000Z",
          "Titre": "Great service",
          "Contenu": "Aaron walked me through the process of setting up phone.  It was easy and stress free.  All my questions were answered in terms I understood.  Options explained.  I'm happy with the whole process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mrs.",
          "Nb_Reviews": 2,
          "Date": "2023-07-11T13:40:05.000Z",
          "Titre": "New Customer",
          "Contenu": "The customer service agent was extremely well versed in the priduct, services and the type of program best suited for the needs i required."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joel Juett",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T15:41:13.000Z",
          "Titre": "Works almost too well",
          "Contenu": "Works almost too well, dad can easily call using the programmed call buttons and stay in touch with the family."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven John",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T02:01:58.000Z",
          "Titre": "Simple to install",
          "Contenu": "Simple to install. Does everything I want and I don’t have to deal with my old provider which has the worst customer service. The young man that helped me get my service and set it up was very helpful and a joy to work with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SUSAN PRIVITERA",
          "Nb_Reviews": 2,
          "Date": "2023-03-23T22:03:29.000Z",
          "Titre": "I am very happy with community phone…",
          "Contenu": "I am very happy with community phone service. The people are always very nice when I had questions. And the price is perfect for my budget. Thank you. I also recommended it to my sister and brother-in-law and they like it to."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Ofelia",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T17:29:12.000Z",
          "Titre": "Support staff is impressive",
          "Contenu": "Your support staff is excellent. Quick to answer or return a call, and patient in answering questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark McCarthy",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T13:53:24.000Z",
          "Titre": "We’ve had a good experience with our…",
          "Contenu": "We’ve had a good experience with our home phone service. There have been no problems so are thankful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary Kladiva",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T03:07:09.000Z",
          "Titre": "Great customer service and quick to…",
          "Contenu": "Great customer service and quick to respond to emails.  The service works great and much more reasonable priced than other companies."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Guest",
          "Nb_Reviews": 10,
          "Date": "2023-03-23T21:11:11.000Z",
          "Titre": "The installation went very well",
          "Contenu": "The installation went very well, after we figured out the settings on my Panasonic machine and Community's equipment,it was a breeze."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pamela James",
          "Nb_Reviews": 2,
          "Date": "2023-06-28T21:22:43.000Z",
          "Titre": "Amazing Five Star Service",
          "Contenu": "The ease of obtaining this landline. I also appreciate the knowledge of the employee that assisted me all through this process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lee Watkins",
          "Nb_Reviews": 8,
          "Date": "2023-05-05T23:05:12.000Z",
          "Titre": "I MAM USING IT FOR MY WIFE WHO HAS…",
          "Contenu": "I MAM USING IT FOR MY WIFE WHO HAS ALZHEIMER'S SO SHE CAN CALL FAMILY (MEMORY PUSH BUTTOM PHONE WITH PHOTOS). DID NOT WANT A LAND LINE. SO FAR IT HAS WORKED PERFECTLY."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T14:10:30.000Z",
          "Titre": "You made everything so easy",
          "Contenu": "You made everything so easy. From signing up, purchasing equipment and installing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JOHNNIE C SAMPSON",
          "Nb_Reviews": 4,
          "Date": "2023-03-22T18:52:17.000Z",
          "Titre": "great phone service",
          "Contenu": "customer service was great with my order. the phone box arrived as promised. setup was a breeze. The phone worked as soon as i got the signal from the box that all is well. so far no problems, just getting used to something new. I love the fact that are no phone lines to worry about. and the box has battery backup which is great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Diane H.",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T23:09:29.000Z",
          "Titre": "Great listeners and problem solvers at…",
          "Contenu": "Great listeners and problem solvers at Community Phone.  They are great communicators and handle problems with ease."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rhonda Atherton",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T16:42:11.000Z",
          "Titre": "Very friendly customer service",
          "Contenu": "Very friendly customer service. Easy and quick set up. I recommend to anyone in need of phone service. Thank you Community Phone!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lee Watkins",
          "Nb_Reviews": 8,
          "Date": "2023-03-21T22:11:46.000Z",
          "Titre": "I only use the phone for emergencies",
          "Contenu": "I only use the phone for emergencies, of which I have had none, But the testing has always been positive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ali Ali",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T19:17:50.000Z",
          "Titre": "Great asset to my home!",
          "Contenu": "Was needing a house phone for a long time and now feel safer knowing if I need something I don't have to dig for my cellphone. I can use my landline!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 3,
          "Date": "2023-03-29T00:06:07.000Z",
          "Titre": "problem resolved",
          "Contenu": "I emailed my problem in. got answered within hours, and followed the instructions given and resolved the problem. No problem!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan Martin",
          "Nb_Reviews": 9,
          "Date": "2023-03-23T20:53:15.000Z",
          "Titre": "Still great for handset-landline..",
          "Contenu": "Still great for handset-landline...  check last feedback for details.Now for a mobile.. almost ready to call."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandra",
          "Nb_Reviews": 2,
          "Date": "2023-03-31T05:30:00.000Z",
          "Titre": "I am so pleased with Community Phone",
          "Contenu": "I am so pleased with Community Phone . I had so many problems with the phone service before I switched to Community Phone. I was being ripped off and I couldn't get the problems fixed . I certainly got a bill  everymonth but no service. Thank you community phone.I can count on you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mel",
          "Nb_Reviews": 2,
          "Date": "2023-04-10T23:04:42.000Z",
          "Titre": "We had AT&T",
          "Contenu": "We had AT&T.  I was so happy when we found this company on line.  I called, spoke to the rep, had all our questions answered.  The router came a few days later.  It was so easy to install.  I just love it.  We can make long distance calls without being billed for a bunch of BS.  I would recommend Community Phone to everyone that needs a land line, that has a cell phone.  We love our land line."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Abi Smith",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T18:51:20.000Z",
          "Titre": "I can finally ring my kids again with…",
          "Contenu": "I can finally ring my kids again with my landline. Thanks Community Phone for making it possible. No complaints"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donna",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T18:33:39.000Z",
          "Titre": "If you need a phone try them.",
          "Contenu": "I never hardly have trouble with them. I had another phone with line but they were AWFUL. Took me three weeks to get rid of that company even though I had this company,."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T19:03:34.000Z",
          "Titre": "It's simple and easy to understand",
          "Contenu": "It's simple and easy to understand. Thorough follow-up and great people who care."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barb Beel",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T17:43:17.000Z",
          "Titre": "Every time I called (and it was many…",
          "Contenu": "Every time I called (and it was many times ) I actually talked to someone whom I could understand.No press one for this or two for that.Always very helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandra Eddy",
          "Nb_Reviews": 2,
          "Date": "2023-03-23T13:10:02.000Z",
          "Titre": "You can use the system with any phone.",
          "Contenu": "I love that it stays on during power outages and that I didn't have to buy a new phone. It works with my old phones that are at least 20 years old. Setting it up was simple. Now I can find my cell phone when I need it; I just pick up the house phone and call the cell. I live in Quincy, MA and we are always loosing power."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carole Menser",
          "Nb_Reviews": 8,
          "Date": "2023-03-29T19:20:39.000Z",
          "Titre": "Very happy",
          "Contenu": "Everything went very smoothly. The base unit is easy to set up, and I liked being able to use the phone I already had. Porting my phone number was another plus. Also, the sound quality is good. No problems at all."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary Averitt",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T20:56:04.000Z",
          "Titre": "Happy Customer",
          "Contenu": "I like the fact that the price never changes and if I need help some always responds in a timely manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janie Mc",
          "Nb_Reviews": 4,
          "Date": "2023-03-22T15:09:10.000Z",
          "Titre": "Very happy with my services from Community Phone",
          "Contenu": "Very happy with my services from Community Phone. I have both a house phone and a cell phone through them. Both are \"up\" consistently. The sound is clear, calls only rarely \"drop,\" and I get a signal on my cell phone no matter where I am."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shannon",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T21:14:15.000Z",
          "Titre": "Set up was quick and easy",
          "Contenu": "Set up was quick and easy, phone service works great! Would definitely recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janet Jones",
          "Nb_Reviews": 2,
          "Date": "2023-08-29T04:17:02.000Z",
          "Titre": "Excellent service",
          "Contenu": "The representative I talked to was very helpful. He was knowledgeable and explained everything in detail."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yolanda Scurlark",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T03:39:57.000Z",
          "Titre": "My experience is when the weather is…",
          "Contenu": "My experience is when the weather is bad you don’t have to worry about your phone going out. Thank you all."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "dwrink",
          "Nb_Reviews": 8,
          "Date": "2023-03-29T19:55:54.000Z",
          "Titre": "No Issues To Date…….",
          "Contenu": "My mother has had no issues to date with her Community Phone service so that is good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nancy",
          "Nb_Reviews": 3,
          "Date": "2023-03-23T01:49:20.000Z",
          "Titre": "Responded to my concern and I expect…",
          "Contenu": "Responded to my concern and I expect when I need to make a change they will help me take care of that,"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T00:55:03.000Z",
          "Titre": "Everyone I spoke with was kind",
          "Contenu": "Everyone I spoke with was kind, patient, and most of all effective. It was easy to get to a real live person and not the hassle of a machine. Yeah for you !!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Connie Anderson",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T21:59:54.000Z",
          "Titre": "I got this phone for my elderly mother…",
          "Contenu": "I got this phone for my elderly mother ..She just couldn't keep a cell phone...So easy she just picks up phone handset and says\" hello\"..Thanks Community..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laura Cloutier",
          "Nb_Reviews": 1,
          "Date": "2023-04-15T00:22:27.000Z",
          "Titre": "Great costumer service skills,they…",
          "Contenu": "Great costumer service skills,they answered all my questions. Reliable quality phone service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-05-19T12:59:19.000Z",
          "Titre": "I'm a senior with a very limited amount…",
          "Contenu": "I'm a senior with a very limited amount of money each month, your monthly charge works very well for me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marlene",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T04:20:42.000Z",
          "Titre": "They both were polite Sammy and charles…",
          "Contenu": "They both were polite Sammy and charles and answered all my questions"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GEORGIA JOHNSON",
          "Nb_Reviews": 2,
          "Date": "2023-03-30T05:18:10.000Z",
          "Titre": "lAuto pay is easy",
          "Contenu": "lAuto pay is easy, and this company's service is far better than Century Link."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arlene",
          "Nb_Reviews": 4,
          "Date": "2023-05-17T20:28:27.000Z",
          "Titre": "Love the landline and 2 cell phone",
          "Contenu": "Love the landline and 2 cell phone.  So much cheaper using community phone Arlene, VA"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bonnie Pedraza",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T03:06:19.000Z",
          "Titre": "It is easy to talk with a real person…",
          "Contenu": "It is easy to talk with a real person when that is necessary. Everyone has been very helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bonnie Campbell",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T17:27:01.000Z",
          "Titre": "I think Community Phone is just…",
          "Contenu": "I think Community Phone is just awesome. I really wanted a house phone but not one thing I could connect to out here in country.SOOOO.... I called Community Phone and I have GREAT service.. Love my home phone."
        }
      ]
    }
  ]
}