{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.gamers-outlet.net",
      "Review": [
        {
          "Note": 1,
          "Lieu": "ZA",
          "Pseudo": "Ettienne van Staden",
          "Nb_Reviews": 6,
          "Date": "2023-12-20T11:13:04.000Z",
          "Titre": "DONT TRUST THESE PEOPLE",
          "Contenu": "DONT TRUST THESE PEOPLEPurchased a 2-year key for CCleaner, but RIGHT after activation it shows 549 left on subscription. Now, if I'm not mistaken, 2 years are 730 days. Purchased another 2 year key for Eset Security, and I get \"Register key - cannot activate register key because register key is already activated!\"*This subscription is currently managed by another ESET HOME account. If you bought it through a reseller, please get in touch with them to add the subscription to your account or contact our Technical Support for assistance.Never again, this is fraud!*This subscription is currently managed by another ESET HOME account. If you bought it through a reseller, please get in touch with them to add the subscription to your account or contact our Technical Support for assistance."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Aubin",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T17:39:58.000Z",
          "Titre": "Unusable Key",
          "Contenu": "I had purchsed a key for \"blank\" and it was already used. I asked for a refund and they tried to give me another key after I already explained I bought one elsewhere that wasn't used, and I just wanted a refund. They said I'd be getting my refund, which was 3 days ago so maybe it will come, maybe it won't. This is my only experience with this company but it will probably be my last just to be safe."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T18:32:57.000Z",
          "Titre": "When I tried to use the product key to…",
          "Contenu": "When I tried to use the product key to activate Windows 10 the Microsoft site said it was not valid."
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "Raffaelli Milena",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T00:51:37.000Z",
          "Titre": "Funziona ma considera windows 11 una copia",
          "Contenu": "Windows11 cannot be activated on this device because the product keyhas already been used in another device. If you believe it has not been usedon another device, select Troubleshoot below. Codeerror: 0xC004C008"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "kaim Bidiwala",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T12:12:02.000Z",
          "Titre": "nothing worked",
          "Contenu": "nothing worked, no downloads no key, disappointed,waste of money"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Brinder Singh Saigal",
          "Nb_Reviews": 10,
          "Date": "2023-12-12T17:57:56.000Z",
          "Titre": "The key that was provided had already…",
          "Contenu": "The key that was provided had already been used maximum number of times. It was not accepted on the microsoft online system. I had to waste an hour calling them to explain."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vanessa Mehserle",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T19:00:52.000Z",
          "Titre": "Microsoft Office Product Key Didn't Work",
          "Contenu": "I bought the Microsoft Office package so I could have it on my personal computer and they product key didn't work. I'm pretty disappointed."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Manu",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T00:05:15.000Z",
          "Titre": "Price payed higher than invoice amount received",
          "Contenu": "Price payed and invoice received, both in Euros, does not match with the amount charged on bank account.Price charged on the bank was about plus 7% over the invoice ammount received and marked on the web shop during the buying and payment operation.During the buying/payment process I never was informed about the final price should be charged on the bank account.I am not agree at all with explanation got from gamers outket."
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "Melissa Saavedra",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:51:19.000Z",
          "Titre": "Thekey i purchased was already used and…",
          "Contenu": "Thekey i purchased was already used and they didn't send me a new one back."
        },
        {
          "Note": 1,
          "Lieu": "AL",
          "Pseudo": "F.k.wizzwhack",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T15:21:47.000Z",
          "Titre": "They gave me a preowned key for…",
          "Contenu": "They gave me a preowned key for microsoft studdent office pack and i dont have time to bother with emails to contact support because they neglect it. Its like me using a fake credit card and after 30days the money returns"
        },
        {
          "Note": 1,
          "Lieu": "GR",
          "Pseudo": "Athanasios",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T14:05:42.000Z",
          "Titre": "Attention!",
          "Contenu": "Attention! Be careful! They don't seem honest. I detected suspicious activity! Today I made a purchase of a NOD license for one computer for 2 years.After I received the key, and tried to activate it, it gave me a message that the activation failed \"Activation failed. License limit exceeded. Devices using this license are more than allowed.\"I contacted the support and they gave me a new key. I tried it and this time the activation went through but below 2 permanent and serious errors were detected. 1) The license did not last 24 months as claimed, but 21 months and most crucially 2) That half the shields were permanently disabled. I sent again for the 2rd time and they never replied!"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Sir Ecki",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T18:46:35.000Z",
          "Titre": "download through Microsoft did not…",
          "Contenu": "download through Microsoft did not work. There are only 365 - products available"
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "Marco Benedetto",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T20:24:17.000Z",
          "Titre": "Invalid key",
          "Contenu": "The system answer me: invalid keyI couldn t have mc office on my computer"
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "luigi di iorio",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T21:35:59.000Z",
          "Titre": "I purchased Office 2019 Professional…",
          "Contenu": "I purchased Office 2019 Professional Plus CD Key Phone Activation but I was unable to install it on my PC.  Launching the OfficeSetup.exe file installs Microsoft 365. Clearly the phone number never appeared in the Activation wizard."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T17:26:54.000Z",
          "Titre": "Would not install",
          "Contenu": "Would not install. Enough time has passed that I don’t remember exact messages. Was trying to install on a computer that once had a version of Office 2010 and it try’s to activate that version but then responds that the 3 allowed installs are active although one of the 3 was removed from a laptop prior to recycling. I was trying to install on the new replacement laptop.Help Desk at Gamers-Outlet were exceptional at resolving this issue.  Office 21 is now installed and activated.  Very much appreciated. Dave."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JS",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T16:57:31.000Z",
          "Titre": "Purchased Win 10 Pro CD-key on…",
          "Contenu": "Purchased Win 10 Pro CD-key on 8/10/2023 from gamers-outlet. When I tried to activate on 11/19/2023, it failed. Customer support replied I waited too long to activate my key, there was no genuine reason to wait so long, and they have no way of knowing I did not use it twice. Solution was to offer me a 10% discount coupon for another purchase. Why would I buy another invalid key or anything from them for that matter. Scam site, go elsewhere."
        },
        {
          "Note": 1,
          "Lieu": "PT",
          "Pseudo": "Ricardo Delgado",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T18:41:18.000Z",
          "Titre": "Sold me the wrong Key on purpose",
          "Contenu": "Sold me the wrong Key on purpose, didnt want to refund me. Their solution was \"Cancel your key and wait for us to sell it again, then we can refund\" when they made the mistake.Had to open a ticket on Paypal to get a refund.Wont ever buy here again"
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "sam",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T14:27:32.000Z",
          "Titre": "office key does not register",
          "Contenu": "office key does not registerphone registration does not register is this legal??????helpdesk not seriousthis is fraude!"
        },
        {
          "Note": 1,
          "Lieu": "AE",
          "Pseudo": "Sadiq Kallada",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T11:17:28.000Z",
          "Titre": "This site is a scam",
          "Contenu": "This site is a scam. They took my money and gave a dummy office key. Noone from their support even responded to me even after raising a complaint."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chuck",
          "Nb_Reviews": 3,
          "Date": "2023-11-13T02:48:37.000Z",
          "Titre": "F'in spammers",
          "Contenu": "This company does not care about their clients. they continue to spam them begging for reviews in spite of their request to cease and desist. They have lost another customer. My only recourse is to report each and every email i get from them which will, eventually and if everyone does it, get them blackballed from future emailing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "charles rich",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T13:05:31.000Z",
          "Titre": "Did not work and never got a response…",
          "Contenu": "Did not work and never got a response from customer service. Total waste of money."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mr Vairis Trinskis-Roze",
          "Nb_Reviews": 8,
          "Date": "2023-11-30T19:30:11.000Z",
          "Titre": "MS office key which didn't work.",
          "Contenu": "Purchased a key for MS office, which didn't work. Tried to find some information how to get in touch with the seller, but there wasn't any."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Sebastien D",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T20:42:37.000Z",
          "Titre": "Windows Server 2022 doesn't work",
          "Contenu": "I bought key for Windows Server 2022 standard. The key didn't work. I think it's a windows classic key. So i just loose my money..."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Andre",
          "Nb_Reviews": 4,
          "Date": "2023-12-04T23:11:04.000Z",
          "Titre": "A bad buy",
          "Contenu": "I bought office 2016. The download was good. When I open word, excel. Etc I get the message that I don’t have a license and they offer to buy Office. So I am not happy and disappointed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeffrey Ogle",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T22:25:41.000Z",
          "Titre": "Total s**t show",
          "Contenu": "They charged me three times for one purchase. The code did not work and I showed them proof. Will not give me a refund for the three charges until they sell the codes again. Their policy does not state software ware only references games. Total s**t show. Will never recommend."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 2,
          "Date": "2023-11-16T21:06:44.000Z",
          "Titre": "\"GAMERS OUTLET\" is a BUNCH OF CROOKS.",
          "Contenu": "\"GAMERS OUTLET\" is a BUNCH OF CROOKS.They sent a Windows 10 license key that WOULD NOT ACTIVATE.  The error stated that the license was ALREADY ACTIVATED.  THEY SIMPLY STEAL THE MONEY CLAIMING THEY ARE SELLING LEGITIMATE PRODUCT.  I would give them ZERO stars if I could"
        },
        {
          "Note": 1,
          "Lieu": "NO",
          "Pseudo": "maxiem Anani",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T01:26:21.000Z",
          "Titre": "The windows key don't working"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Fernando Sillas",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:39:24.000Z",
          "Titre": "Windows said that CD key was already in…",
          "Contenu": "Windows said that CD key was already in use."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Vali",
          "Nb_Reviews": 25,
          "Date": "2023-11-30T01:42:41.000Z",
          "Titre": "I purchased a key for office 2013 but…",
          "Contenu": "I purchased a key for office 2013 but is not working.I requested a refund for it but they refused so please avoid to buy from this website"
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "gianmarco sapuppo",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T06:55:20.000Z",
          "Titre": "bad buy",
          "Contenu": "i buied 2 keys for  windows10 but don't work!!!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "neil towsey",
          "Nb_Reviews": 13,
          "Date": "2023-12-12T17:20:39.000Z",
          "Titre": "Unable to activate online or by…",
          "Contenu": "Unable to activate online or by phone,said it was invalid"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Mel Canning",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T23:08:11.000Z",
          "Titre": "Scam - refuse to refund",
          "Contenu": "Purchased a office 365 key. No mention of locked to Europe on the website until I log a claim with PayPal for a refund, (now it's on there website)so I can purchase an AU copy. There answer use a VPN and change region, tried this but Microsoft still blocked,Keep away from these guys if you want a product that works. Now our of pocket $90 as needing to purchase an AU copy as current license expires in 3 days."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Michael Caleb",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T17:48:44.000Z",
          "Titre": "Kindly refund me",
          "Contenu": "Kindly refund me, you debited me twice for the same item and I’ve written a mail to you with no reply."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T07:42:14.000Z",
          "Titre": "Poor customer service and return policy",
          "Contenu": "Purchase did not work.  Was denied refund even after hours of troubleshooting."
        },
        {
          "Note": 1,
          "Lieu": "GR",
          "Pseudo": "P.B.",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T13:26:14.000Z",
          "Titre": "Unpolite support center",
          "Contenu": "The person who communicated with me from the support center was really unpolite. As I already told him, politeness should be there, even if the customer makes a mistake. I will definitely not prefer you next time.UpdateDear James C.I think you just did not search enough. My ticket number was 170919 and I exchanged more than one emails with the person supporting me. Check again"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "anarchris",
          "Nb_Reviews": 4,
          "Date": "2023-11-27T20:20:39.000Z",
          "Titre": "argued with me over and over then told…",
          "Contenu": "argued with me over and over then told me they'd help me with software but didn't tell me they'd invade my computer and take it over. don't trust them"
        },
        {
          "Note": 1,
          "Lieu": "TH",
          "Pseudo": "Anon",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T10:06:56.000Z",
          "Titre": "sent me an illegal MSDN Key and denied…",
          "Contenu": "sent me an illegal MSDN Key and denied responsibility because I had checked its authenticity with a PID Checker.Avoid."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Mb",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T18:03:49.000Z",
          "Titre": "Horrible",
          "Contenu": "Horrible. I had to use multiple payment methods. Then when one finally went through, didn't get the codes. And eventually, 2 days later got a refund without explanation.Also during the choosing of products, constantly got bombarded with ads of other things. Making me misclick several times.Prices are good though, but I'm not actually sure if this is a legitimate business."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Nikki",
          "Nb_Reviews": 43,
          "Date": "2023-09-20T14:32:54.000Z",
          "Titre": "BUYER BEWARE",
          "Contenu": "Continues spamming to no end. Be careful when buying from this company as, seemeingly, the will never again leave you alone.Edit after Gamers Outlet reply: I have not received any emails from this company addressing this issue. All I receive is the ocasional spam message, which is unwelcomed. They have also ignored my previous emails (in plural) asking them to remove my details from their system; they however replied to one of my requests by THANKING ME FOR OPENING AN ACCOUNT (outrageous!). As I said, BUYER BEWARE."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Andreas",
          "Nb_Reviews": 2,
          "Date": "2023-11-06T17:59:20.000Z",
          "Titre": "Key not working with already installed windows version",
          "Contenu": "I received the key immediately but it was not accepted by the installed windows I had. The key by another provider worked without a problem. I was not aware that the key is linked to a to be downloaded and to be installed windows 7 version."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Peter",
          "Nb_Reviews": 2,
          "Date": "2023-09-13T04:04:37.000Z",
          "Titre": "Keys work",
          "Contenu": "Keys work - awesome, no qualms here.  Just the most bizarre shopping experience with use of credit card.  Instead of having \"Pay with Credit Card\" option, they confuse shoppers with Square or Paypa reference, like I care or need to know what service THEY use to process my payment.  Shopper is confused thinking that they do not accept credit cards and have to use paypal or square account only.  How they managed to make something so simple so complicated is simply mind blowing."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Johan",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T09:45:21.000Z",
          "Titre": "Beware of this site, it is all a scam."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Lars  Micaelson",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T11:56:55.000Z",
          "Titre": "The Key for Windows 10 didnt Work",
          "Contenu": "The Key for Windows 10 didnt Work. So wasted Money and the customer service is Bad No answer or Something Like that."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 6,
          "Date": "2023-10-24T00:03:11.000Z",
          "Titre": "fraud /broken product/ did not return the money!!!",
          "Contenu": "the product I bought from gameoutloet doesn't work and they don't want to give me my money back.  Additionally, as they asked, I sent them an invoice for the purchased product and sent it back to them, but there is no money.  in addition, the person who talked to me via e-mail was incompetent and did not listen to what I was saying, she replied to me with something else (I had the impression that I was writing with a bot) I am outraged, dissatisfied, I feel cheated and robbed, I have no money and no product - a scandal.  No one has even responded for 2 days, but they sent an email asking for feedback.  worst service, I do not recommend.  0 stars"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2023-10-18T04:24:08.000Z",
          "Titre": "Sent me an invalid key",
          "Contenu": "Sent me an invalid key, told me to send screenshot of error message to get new key. By then I already got a new working key elsewhere and won’t reformat just to show an error message. Either way I should have received a genuine key to start with."
        },
        {
          "Note": 1,
          "Lieu": "GR",
          "Pseudo": "Stefan Clever",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T13:33:47.000Z",
          "Titre": "Thé Key is for a office version 2010...",
          "Contenu": "Thé Key is for a office version 2010...Microsoft does not support that anymore so it's a useless purchase"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Remmy",
          "Nb_Reviews": 9,
          "Date": "2023-10-15T00:50:01.000Z",
          "Titre": "I suggest people should avoid buying…",
          "Contenu": "I suggest people should avoid buying products with key. I have learnt my lesson. I bought 2 products from Gamers-outlet.net as follows with reference numbers 1821363 and 182832929/09/23 - bought Microsoft Visio professional 2021 Cd Key Global 6. and on 1/10/23 - I also bought Microsoft project professional 2021 Cd Key Global 5None of the keys for the above products work. They could not be uploaded up till now and was a waste of money. The more I send email to Gamers company, the more they give suggestions on what to do but none worked.I am disappointed because not able to download the products has affected my work. I am not encouraged to buy further products from this company."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Marcel  Blinn",
          "Nb_Reviews": 2,
          "Date": "2023-11-06T19:18:30.000Z",
          "Titre": "unfortunately did not work. My fault???",
          "Contenu": "Unfortunately, it was not clear that this Office Key could only be used for US or English language.I was not able to activate a German office."
        },
        {
          "Note": 1,
          "Lieu": "ZM",
          "Pseudo": "ZAMBU",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T21:21:50.000Z",
          "Titre": "Could not pay for this order",
          "Contenu": "Could not pay for this order, PayPal logged in otp received but payment not processed...even using bank card could not work. Have bought a couple of keys before with no issues at all, this time around frustrated had to get it from elsewhere!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Davie Loulo",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T18:00:28.000Z",
          "Titre": "Key invalid",
          "Contenu": "I entered my key, it did nothing, tried entering it again and it said it was invalid. I heard customer service is excellent and they could help me get a new working key so that would be amazing. I will change my review after its working <3. Thank you."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Sharon",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T00:00:04.000Z",
          "Titre": "Buyer beware- Possible Grey Software",
          "Contenu": "I was sold a dud Microsoft Office key. The problem was definitely not installer error as when I failed to install, I asked my IT guys to takeover. They also could not make the key work. Definitely a bad experience."
        },
        {
          "Note": 1,
          "Lieu": "ZA",
          "Pseudo": "Gideon Jonker",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T11:43:57.000Z",
          "Titre": "Double charged me",
          "Contenu": "Double charged me, because the site doesn't tell you the transaction was successful. It stays in your cart. Then I tried again and after second attempt gave up. Suddenly I get two emails with the codes and only then see it went off my bank. Support tells me I must send them the second code and only after they resold it can they refund me. Sound fishy. Not satisfied at all."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Renjit  Joshua",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T23:38:03.000Z",
          "Titre": "I made a purchase Microsoft Office 2019…",
          "Contenu": "I made a purchase Microsoft Office 2019 on the 3rd of November and I got the key to activate when I try to activate my Microsoft Office it's not working, I have asked for help and the support team didn't help me to resolve the issue infact the just closed the case and my activates key is still not working. I want my refund back ASAP I am really not happy with the service at all."
        },
        {
          "Note": 1,
          "Lieu": "UA",
          "Pseudo": "Aspect Bezdatovich",
          "Nb_Reviews": 3,
          "Date": "2023-10-02T15:31:42.000Z",
          "Titre": "My Windows 11 key worked for less than…",
          "Contenu": "My Windows 11 key worked for less than a month, after which I received a message saying that my Windows copy was not genuine. I don't even want to find out what caused it; I just went and bought a key from the official Microsoft store!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "David",
          "Nb_Reviews": 3,
          "Date": "2023-11-18T19:07:09.000Z",
          "Titre": "bought activation key for office 21",
          "Contenu": "bought activation key for office 21. Found did not need key after all, to activate product"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Anna",
          "Nb_Reviews": 2,
          "Date": "2023-10-08T18:39:05.000Z",
          "Titre": "Scammed me the key was already in use",
          "Contenu": "Bought a windows 10 key for 5€ and it arrived within 1min. I used it right away but I couldn't activate it and I was being told that the key is already in use. So they scammed me and send me an unusable key. I contacted customer service but got no answer. Had to go through PayPal to get my money back. So don't be cheap like me, use another site"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Lee Thompson",
          "Nb_Reviews": 4,
          "Date": "2023-10-30T11:52:43.000Z",
          "Titre": "Useless key.",
          "Contenu": "Key doesn't activate, incorrect activation instructions.In answer to reply: The support ticket in question was 173734 for your records.For others: It's the support ticket where I did indeed get a full refund, after having to exercise my distance selling rights and refuse to wait for them to resell the keys bought. The company wanted multiple proofs the key didn't work which would have required removing the new key I'd bought and activated from elsewhere without issue.Oh, it is also the support ticket where the company outright states that they are going to resell the key I have reported as invalid anyway (even after telling them that the Microsoft support team confirmed the key as invalid)."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "zach forney",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T18:27:12.000Z",
          "Titre": "Your windows cd key prices are…",
          "Contenu": "Your windows cd key prices are rediculose now. I easily found multiple sights selling them for less. Won't be using gamer outlet anymore"
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "יוסל לאנדא",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T00:33:16.000Z",
          "Titre": "I received a product code but it is…",
          "Contenu": "I received a product code but it is incorrect and does not work!!!!Not worth buying!!!!"
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Pascal",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T20:27:37.000Z",
          "Titre": "ESET NOD32 license: not ok",
          "Contenu": "Bought ESET NOD32 license. After installation, based on their instruction on the website, the product did not function properly, in the sense that I got errors (red crosses) in the ESET software.A closer inspection revealed that the license was for ESET internet security (instead of NOD32) and that it was already linked to some weird email address, whereas none of this was mentioned on their website. I asked for a refund, since the license did not function properly and the information on their website was misleading.Got an answer saying that i will not get a refund, because the license can no longer be sold to another customer. Of course told them that this was not fair (their license wasn't ok!), but they ignore me.Great way to deal with customers guys!FYI:Afterwards purchased an official NOD32 license from ESET directly and that one works as expected."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tiffany Duarte",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T17:34:20.000Z",
          "Titre": "Tried to get a refund because wrong…",
          "Contenu": "Tried to get a refund because wrong item was purchased. Was told that I would have to wait until item was resold to receive refund."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Martin",
          "Nb_Reviews": 2,
          "Date": "2023-11-08T23:09:32.000Z",
          "Titre": "Cd Key already in use",
          "Contenu": "Unable to activate serial (already in use).This site apparently sell cd keys multiple times..."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Paul",
          "Nb_Reviews": 3,
          "Date": "2023-10-21T19:44:22.000Z",
          "Titre": "Avoid at all cost",
          "Contenu": "I have to give a least 1* in order to post but I would not even give that if I had a choice. I google searched for a perpetual licence for Microsoft office and foolishly bought off this bunch of clownsI am writing this review to advise people of what is not explained in the product description. The installation of my product became corrupted and I could not repair it. I subsequently uninstalled the full programme. Upon reinstall, Microsoft returns an error message to inform me I am a victim of fraud when I use my password key. After contacting gamers outlet, they then elaborate on terminology. To be clear I want everyone who is considering using then and reads the product description...One pc/one installation means that if you have a problem with the software and need to uninstall it, you will have to pay again.I would love to add to this review, the replies I got from them over today's online exchange.Why does it take a complaint to explain terminology? Surely this should be explained in the description of what I am buying. I would not have purchase, had this been made clear in the product description that you pay again if you need to reinstall.Be warned and choose wisely!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vera",
          "Nb_Reviews": 3,
          "Date": "2023-09-27T14:31:16.000Z",
          "Titre": "Gamers-Outlet worked with me for a few days, BUT...",
          "Contenu": "Gamers-Outlet worked with me for several days before I was able to install Office 21. After finally getting Office 21 installed, I entered the Product Key, within minutes Microsoft set notification that the Product Key was not valid in the United States, and I could no longer open the program."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "anarchris",
          "Nb_Reviews": 4,
          "Date": "2023-11-22T18:17:33.000Z",
          "Titre": "keys didn't work",
          "Contenu": "keys didn't work. kept asking for more information screenshots over and over"
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Antonio Montes",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T22:10:43.000Z",
          "Titre": "La descarga la trato mi pc  como…",
          "Contenu": "La descarga la trato mi pc  como troyano  asi que  no me sirvió para nada espero recuperar mi dinero"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tristan Daniel",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T18:59:31.000Z",
          "Titre": "never got my key",
          "Contenu": "never got my key, just took like 16 dollars"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andre Aponte",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T04:11:14.000Z",
          "Titre": "SCAM!!",
          "Contenu": "SCAM!!! Was unable to activate Windows with the key I bought as it is already in use on another device.  SCAM!!!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "FLX",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T19:53:05.000Z",
          "Titre": "Annoying.",
          "Contenu": "it randomly cancelled my key and its taking a long time to refund the money back onto my card so i can get it from somewhere else. just being annoying tbh."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Jacques Meyer",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T15:15:17.000Z",
          "Titre": "ordered and received nothing",
          "Contenu": "ordered and received nothing. I sent them an email with no response.No thanks, never anything from them again"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "R Stuart",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T15:27:12.000Z",
          "Titre": "Product key did not work",
          "Contenu": "Product key did not work.  Support took 3 days to offer any real help and that was to offer to take control of my computer.  Ridiculous really.  The refund policy clearly states a lie."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "...",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T19:02:21.000Z",
          "Titre": "They are not giving a refund",
          "Contenu": "They are not giving a refund, for you to get a refund they need to sell the code you bought from them to someone else first. SCAM!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ben Had",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T03:44:17.000Z",
          "Titre": "Key don't work",
          "Contenu": "Key's boned, I got rippedWould not recommend, but I guess I kinda had it coming for making the purchase in the first place"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Allan",
          "Nb_Reviews": 2,
          "Date": "2023-10-30T20:27:27.000Z",
          "Titre": "Verification system doesn't work",
          "Contenu": "Verification system doesn't work, support email address became unavailable. Asked for money back - heard no more."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dave Buerger",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T21:40:15.000Z",
          "Titre": "It wouldn’t download",
          "Contenu": "It wouldn’t download.  I asked for a refund which you haven’t done.Do I have to take additional action?Hopefully not.  Just complete my refund."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Adrián marcos maldonado",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T22:06:26.000Z",
          "Titre": "I bought a windows key and the day…",
          "Contenu": "I bought a windows key and the day after my computer was asking me to activate windows again."
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "frac nco",
          "Nb_Reviews": 2,
          "Date": "2023-10-14T19:07:03.000Z",
          "Titre": "ordered a product",
          "Contenu": "ordered a product, I waited 30 minutes to receive an email saying: the product is out of stock, the refund did not arrive"
        },
        {
          "Note": 1,
          "Lieu": "LV",
          "Pseudo": "RB",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T11:43:41.000Z",
          "Titre": "Product was out of stock (even though…",
          "Contenu": "Product was out of stock (even though site said otherwise), they issued a refund, but I never received the money."
        },
        {
          "Note": 1,
          "Lieu": "PT",
          "Pseudo": "- Vasco Cunha",
          "Nb_Reviews": 4,
          "Date": "2023-09-25T09:45:26.000Z",
          "Titre": "After choosing several game hypotheses",
          "Contenu": "After choosing several game hypotheses, I am faced with a lack of stock. It's a shame they don't come up with solutions"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Zeke",
          "Nb_Reviews": 6,
          "Date": "2023-11-22T08:14:31.000Z",
          "Titre": "Doesn’t work.  Don’t waste your time",
          "Contenu": "Purchased windows server key but didn’t work."
        },
        {
          "Note": 1,
          "Lieu": "BE",
          "Pseudo": "Thomas Vanderavert",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T06:56:31.000Z",
          "Titre": "They sell keys of Windows versions that…",
          "Contenu": "They sell keys of Windows versions that are not in service anymore!"
        },
        {
          "Note": 1,
          "Lieu": "AT",
          "Pseudo": "Thomas Wallner",
          "Nb_Reviews": 23,
          "Date": "2023-10-15T08:13:43.000Z",
          "Titre": "i was asking for a refund because the delivery time is longer than expected",
          "Contenu": "i was asking for a refund. then i got as answer they give me a refund when they sell the key to a other customer...excuse me?"
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Francisco Javier Salcedo",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T02:28:32.000Z",
          "Titre": "Invalid Cdkey",
          "Contenu": "The code I bought has not worked, it tells me that it is not valid"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Daniel C",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T09:15:23.000Z",
          "Titre": "Couldn't get it to work with my version…",
          "Contenu": "Couldn't get it to work with my version of Windows and customer support stopped replying to messages."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brayant",
          "Nb_Reviews": 3,
          "Date": "2023-10-02T23:41:30.000Z",
          "Titre": "I paid they never gave me my key",
          "Contenu": "I paid they never gave me my key, i tried to contact them and nothing, i gave up and ask paypal for a refund"
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Javier Moreno",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T13:11:29.000Z",
          "Titre": "Only Works one hour",
          "Contenu": "It was activamente, but an hour later it was identified as overused."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Justyn Miller",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T21:48:20.000Z",
          "Titre": "Key bought did not work",
          "Contenu": "The key sent to me for Microsoft office did not work. Buyer beware."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "P.E.",
          "Nb_Reviews": 2,
          "Date": "2023-10-29T21:58:15.000Z",
          "Titre": "Microsoft saying that token is not valid",
          "Contenu": "MIcrosoft is telling me that the token (key) is not valid. I cannot install the license."
        },
        {
          "Note": 1,
          "Lieu": "CO",
          "Pseudo": "Vladimir Ortega",
          "Nb_Reviews": 4,
          "Date": "2023-11-04T01:03:58.000Z",
          "Titre": "I bought a serial for windows 11 and it…",
          "Contenu": "I bought a serial for windows 11 and it tells me that it was already used, I need a refund."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Michelle Bradley",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T22:44:41.000Z",
          "Titre": "Microsoft key didn't work",
          "Contenu": "Microsoft key didn't workNo interest in sorting it"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "YD",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T18:11:09.000Z",
          "Titre": "Non Available games declared as in Stock",
          "Contenu": "They put Games in there, that ain't available or in stock. You buy them and get fooled. No recommendation."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Daniel Seitz",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T20:44:37.000Z",
          "Titre": "bought but did not get the key",
          "Contenu": "I bought a key, waited about 10 minutes, but did not get one. I think status is the name of the box, it said out of stock. So I was worried that could be scam and directly conntacted paypal to get my money back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "curtis",
          "Nb_Reviews": 1,
          "Date": "2023-09-17T01:27:31.000Z",
          "Titre": "Avoid and use other sites!",
          "Contenu": "Money left my bank, but the order did not go through. They claimed it was a pending deposit but still 5 days later showing up on bank.Would not recommend"
        },
        {
          "Note": 1,
          "Lieu": "CH",
          "Pseudo": "Hansjoerg Wehrli",
          "Nb_Reviews": 2,
          "Date": "2023-09-23T19:40:35.000Z",
          "Titre": "My credit card details were stolen…",
          "Contenu": "My credit card details were stolen after buying something at your store. I had to disable the card and order a new one."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Eresjkigal",
          "Nb_Reviews": 2,
          "Date": "2023-11-09T11:13:16.000Z",
          "Titre": "The key is not working on the version I…",
          "Contenu": "The key is not working on the version I bougth. I know it is only 3 euro but that is not expected."
        },
        {
          "Note": 1,
          "Lieu": "HR",
          "Pseudo": "Ida Haklička",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T12:47:18.000Z",
          "Titre": "It's not working",
          "Contenu": "It's not working, office package is not working."
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "Ivan Rosales",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T00:44:56.000Z",
          "Titre": "It's absurd the exorbitant price rise…",
          "Contenu": "It's absurd the exorbitant price rise in the office bind licences"
        },
        {
          "Note": 1,
          "Lieu": "AT",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-10-06T22:49:27.000Z",
          "Titre": "They sent me wrong key,I told them to…",
          "Contenu": "They sent me wrong key,I told them to give back money,forced me to use it and didnt refund me at all"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Dan Feinstein",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T10:14:09.000Z",
          "Titre": "Windows retail key not working",
          "Contenu": "I bought a Windows retail key and apparently it was already used. So it was not working"
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "MB",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T18:52:36.000Z",
          "Titre": "SCAM",
          "Contenu": "The windows key i bought was already used. scammers"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Adam Parod",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T20:26:37.000Z",
          "Titre": "Microsoft said key was already used on…",
          "Contenu": "Microsoft said key was already used on a different system (but i just bought it).  After dealing with a Microsoft rep for 45 minutes, Microsoft activated the key anyway."
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "JC Eelvelt",
          "Nb_Reviews": 7,
          "Date": "2023-12-20T16:02:28.000Z",
          "Titre": "product getting more expensive every…",
          "Contenu": "product getting more expensive every step I took."
        },
        {
          "Note": 2,
          "Lieu": "GR",
          "Pseudo": "ANASTASIOS",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T11:38:25.000Z",
          "Titre": "Office activation details",
          "Contenu": "The whole process was not clear as described"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Lizzie",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T18:35:56.000Z",
          "Titre": "My money left my account TWICE!!",
          "Contenu": "My money left my account TWICE!!! And efforts to get it back proved useless."
        },
        {
          "Note": 2,
          "Lieu": "BE",
          "Pseudo": "anoniem",
          "Nb_Reviews": 2,
          "Date": "2023-02-22T18:55:06.000Z",
          "Titre": "Bought Malwarebytes premium (life time), did not work 3 times within  10 days.",
          "Contenu": "Bought Malwarebytes premium (life time)Had to mail them 3 times, since it broke 3 times.Also the review button (on their website) does not work for me on 2 different browser (brave and firefox). Though the most postive thing I can say about this is their customer support responding to their emails within a few minutes and refunding me."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Andrew Muirhead",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T11:32:22.000Z",
          "Titre": "My computers Windows 7 doesn't…",
          "Contenu": "My computers Windows 7 doesn't recognize the key I bought."
        },
        {
          "Note": 2,
          "Lieu": "BG",
          "Pseudo": "Chris Walter",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T10:07:28.000Z",
          "Titre": "bought a CD key for steam",
          "Contenu": "bought a CD key for steammoney was sent via paypalaccording to the website, CD key was on stockapparently CD key was not on stock when boughtsupport tried to help and was shortly afterwards offlinegot the key 1 hour laternot the support quality I would expect from a dealer like gamers outletsadly, I would not recommend gamers outlet anymore"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Aliu Adeyemi",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T12:17:58.000Z",
          "Titre": "Inability to install as it takes ages",
          "Contenu": "I was unable to install or use the application. Downloading alone took eternity.I need guidance on installation.Thank you"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael Spindler",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T01:44:49.000Z",
          "Titre": "Invalid Key",
          "Contenu": "The key for Visio Professional was invaild. I got an rejected message during installation that the key was already in use. The Office 2106 key purchased from Gamers Outlet at the same time and installed prior to Visio Pro 2021 was valid, and installed OK. I installed Visio a few months after that and assumed I could not get a refund or another key after so long."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James Coffey",
          "Nb_Reviews": 3,
          "Date": "2023-07-09T19:59:06.000Z",
          "Titre": "Not much help after I downloaded Win 11…",
          "Contenu": "Not much help after I downloaded Win 11 Pro —just gave me a pretty complicated work around —which I’m not comfortable with.  I’ll probably get a professional to help me with."
        },
        {
          "Note": 2,
          "Lieu": "HU",
          "Pseudo": "szszsz",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T00:48:17.000Z",
          "Titre": "I bought invalid keys",
          "Contenu": "I bought invalid keys. it turned out 3 months after the purchase (I used it then), the complaint was not accepted."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Timothy Reynolds",
          "Nb_Reviews": 1,
          "Date": "2023-04-29T20:55:29.000Z",
          "Titre": "I did not like using phone activation …",
          "Contenu": "It worked, but I did not like using the phone activation for my Microsoft software and having to attest that this is the first time the code was used. I have no idea if it is legit and if I'm saying something true or not."
        },
        {
          "Note": 2,
          "Lieu": "GR",
          "Pseudo": "ΒΙΚΥ ΠΑΠΑΚΩΝΣΤΑΝΤΙΝΟΥ",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T13:08:02.000Z",
          "Titre": "Delay of the order",
          "Contenu": "Ι did my order and payment before many days and I haven't receive the product yet. Please let me know what it's happening."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Charles",
          "Nb_Reviews": 2,
          "Date": "2023-10-19T20:14:36.000Z",
          "Titre": "worth the risk?",
          "Contenu": "Shops says it is American, registered in Israel, uses GMail as its mail server."
        },
        {
          "Note": 2,
          "Lieu": "GR",
          "Pseudo": "Bruno",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T11:17:21.000Z",
          "Titre": "My order ID is",
          "Contenu": "My order ID is: 1322842- I tried to activate the license I bought buy phoneat the end of the activating process I was told that the amount of licenses where consumed- I send you a screenshot installation ID - you send me a confirmation ID- with this Confirmation ID I tried again to activate my license by phone and I was told here was on block of number missing - I gave you this information and you send me back a screenshot indicating where to enter the Confirmation ID- I could not find the prompting screen to enter these numbers however it seems now  I have a MS Office license, because when I use an app it reads OFFICE 2021 but I could not confirm if I really have Office 2021 properly installed. CONCLUSION: You reply was prompt but you should have taken more time to explain where to put in the Confirmation ID"
        },
        {
          "Note": 2,
          "Lieu": "IT",
          "Pseudo": "Luca Saladino",
          "Nb_Reviews": 1,
          "Date": "2023-03-12T22:53:26.000Z",
          "Titre": "ID card needed",
          "Contenu": "I bought a key and the order was is in a \"pending\" state. They contacted me the next day and informed be that my identity cannot be verified so I needed to send them my ID card.Once the procedure was completed they sent me the purchased key.This is never happened is years of online purchases. I can't trust them right now. I'm going to delete the account."
        },
        {
          "Note": 2,
          "Lieu": "MX",
          "Pseudo": "German Pons",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T18:02:41.000Z",
          "Titre": "Not all is true that said in the website",
          "Contenu": "In the website, said that Halo Masterchief collection, will have all the games but not and when somebody found the error, told me that I had to check it with Microsoft, so I didn't receive solution."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Joe Geekie",
          "Nb_Reviews": 8,
          "Date": "2023-05-12T23:46:16.000Z",
          "Titre": "To treat your customers like the old…",
          "Contenu": "To treat your customers like the old Gestapo not very good. i appreciate you have been stung a few times as a business. but to send somebody the wrong  item then give them that your a fraud treatment is unjust. i paid for the item again and it worked fine. but still feel you need to sort out your customer sevicers big style"
        },
        {
          "Note": 2,
          "Lieu": "AE",
          "Pseudo": "AL BAWABAH COMPUTER",
          "Nb_Reviews": 2,
          "Date": "2023-10-06T06:24:37.000Z",
          "Titre": "most of the time key is not working and…",
          "Contenu": "most of the time key is not working and someone has to chat and sort out. Either key might have sold so many times, then they issue another key. it need to be done one at a time. when we are in customer place it is not good idea to chat with you people."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Neolyn Kalu",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T14:17:59.000Z",
          "Titre": "I have sent email to the support team…",
          "Contenu": "I have sent email to the support team that the Visio Pro2021 & Ms Project Pro that 1 subscribed for will not open  and i've been charged for it. Non of the team has done anything to follow up. Got an automated email that is not helpful."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "J.",
          "Nb_Reviews": 1,
          "Date": "2023-02-25T00:31:16.000Z",
          "Titre": "Half of purchased codes did not wok",
          "Contenu": "Half of purchased codes did not work and cs was being difficult in resolving issue. Took more effort than necessary to get replacement codes."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "peter horwood",
          "Nb_Reviews": 14,
          "Date": "2023-08-03T00:10:26.000Z",
          "Titre": "windows office 2021 key make it clear…",
          "Contenu": "windows office 2021 key make it clear if you do reinstall off windows it will not work again"
        },
        {
          "Note": 2,
          "Lieu": "ES",
          "Pseudo": "Salvador",
          "Nb_Reviews": 2,
          "Date": "2023-08-28T00:44:09.000Z",
          "Titre": "No sirven",
          "Contenu": "I buy Windows 10 y Office and nothing works.Windows say me I need buy lincence.Nobody explain me nothing."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Andreas Kobza",
          "Nb_Reviews": 2,
          "Date": "2023-02-25T14:18:21.000Z",
          "Titre": "Not useful for android tablets.",
          "Contenu": "Unfortunately this key does not work for android tablets, which it should have been used for. You could add this to the product description."
        },
        {
          "Note": 2,
          "Lieu": "BE",
          "Pseudo": "Rick",
          "Nb_Reviews": 1,
          "Date": "2022-11-20T15:18:03.000Z",
          "Titre": "\"Lifetime\" product only lasted 1 month..",
          "Contenu": "I ordered and purchased a well-known software for malware protection for my personal computer. Even though the cd-key i bought was supposed to be for a \"lifetime\" subscription, i opened my PC today after just 1 month and my subscription was revoked. Support responded quickly with a fresh cd-key. Unfortunately even though providing me with multiple cd-keys none of them were working."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Abayomi Olutade",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T14:27:12.000Z",
          "Titre": "I have requested for the download link…",
          "Contenu": "I have requested for the download link since I purchased yet to receive it in my email. So frustrating."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Dirk",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T20:20:20.000Z",
          "Titre": "Software is not full usable as it is…",
          "Contenu": "Software is not full usable as it is controled by Sellers account."
        },
        {
          "Note": 2,
          "Lieu": "IL",
          "Pseudo": "יגאל יצחק",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T05:56:00.000Z",
          "Titre": "i tried to copy disk twise {to two…",
          "Contenu": "i tried to copy disk twise {to two diferent disk} and after the computer dose not recognize the two disk at all"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Stuart Smith",
          "Nb_Reviews": 11,
          "Date": "2023-03-27T01:34:32.000Z",
          "Titre": "The good the bad and the unactivateable",
          "Contenu": "If you are buying Microsoft Office this company is fantastic but if you are buying a Kaspersky licence it does not activate or if they do they are not for a full year."
        },
        {
          "Note": 2,
          "Lieu": "CO",
          "Pseudo": "aha",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T04:14:26.000Z",
          "Titre": "I have bought the keycode many times…",
          "Contenu": "I have bought the keycode many times and they have always worked. unfortunately the last purchase did not work the key code"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ROBERT MALYSZKO",
          "Nb_Reviews": 1,
          "Date": "2023-04-08T14:03:29.000Z",
          "Titre": "MY WINDOWS 10 CODE DID NOT WORK",
          "Contenu": "MY WINDOWS 10 CODE DID NOT WORK THEY SEND ME SOME INSTRUCTION TO INSTALL IT BUT IT WAS TO HARD FOR ME I WANTED A FULL REFUND BUT THEY DID NOT GIVE ME THAT'S WHY THEY HAVE ONLY 2 STARS"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Ben Sims",
          "Nb_Reviews": 1,
          "Date": "2023-03-17T10:54:29.000Z",
          "Titre": "I'm sure the Office Pro 2019 copy I got…",
          "Contenu": "I'm sure the Office Pro 2019 copy I got was a cracked version.Went to activate it and it said my code had been used too many times."
        },
        {
          "Note": 2,
          "Lieu": "IL",
          "Pseudo": "ayal perez",
          "Nb_Reviews": 1,
          "Date": "2023-02-27T12:14:27.000Z",
          "Titre": "Item amount automatic",
          "Contenu": "The amount of item was automatically set on 2 and I purchased 2 items for no reason, very disappointed"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ahmad Miller",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T20:16:56.000Z",
          "Titre": "The delivery was fast but the key I…",
          "Contenu": "The delivery was fast but the key I received didn’t work."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Cameron Rich",
          "Nb_Reviews": 3,
          "Date": "2023-07-08T12:24:07.000Z",
          "Titre": "Wanted a Windows Pro key",
          "Contenu": "Wanted a Windows Pro key. It was a Windows Home key as confirmed by Microsoft. So won't even use it."
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "Mino",
          "Nb_Reviews": 2,
          "Date": "2023-07-10T19:14:33.000Z",
          "Titre": "I ve asked if I could change the key to…",
          "Contenu": "I ve asked if I could change the key to a key that unloacks office for Apple No answer"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kameron Schultz",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T00:38:27.000Z",
          "Titre": "I couldn’t use the code that was sent"
        },
        {
          "Note": 2,
          "Lieu": "CY",
          "Pseudo": "Panagiotis Foti",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T23:10:54.000Z",
          "Titre": "All the keys are not working properly…",
          "Contenu": "All the keys are not working properly straight"
        },
        {
          "Note": 2,
          "Lieu": "SI",
          "Pseudo": "Ales Kovacic",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T10:06:31.000Z",
          "Titre": "the windows activation key doesn't work…",
          "Contenu": "the windows activation key doesn't work so the experience is not worth it."
        },
        {
          "Note": 2,
          "Lieu": "MX",
          "Pseudo": "Alfredo López Ayala",
          "Nb_Reviews": 1,
          "Date": "2023-03-05T17:14:09.000Z",
          "Titre": "Dos licencias de office 21 no he podido…",
          "Contenu": "Dos licencias de office 21 no he podido activar."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Ken",
          "Nb_Reviews": 9,
          "Date": "2023-07-02T23:34:29.000Z",
          "Titre": "price went up when they added the…",
          "Contenu": "price went up when they added the 'extras'."
        },
        {
          "Note": 2,
          "Lieu": "GR",
          "Pseudo": "sofia xenitidou",
          "Nb_Reviews": 1,
          "Date": "2023-03-26T08:59:52.000Z",
          "Titre": "The site was either not responding or…",
          "Contenu": "The site was either not responding or too slow."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Roger Partridge",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T17:10:42.000Z",
          "Titre": "Not impressed",
          "Contenu": "Purchased a win 11 cd key didn't work."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Shadow",
          "Nb_Reviews": 2,
          "Date": "2019-04-19T17:41:13.000Z",
          "Titre": "Wrong Key",
          "Contenu": "Bought a Ms Office 2019 Key- instantly got a key... but a ms office 2016 one. Normally 5Stars for the fast Service but -3 because of the wrong key (only 3Stars deducted cuz theres not that a big difference between the two versions but there are better Key Sellers out the who sell them for the same price and where you WILL get the key you ordered)."
        },
        {
          "Note": 2,
          "Lieu": "DK",
          "Pseudo": "Oliver R",
          "Nb_Reviews": 4,
          "Date": "2015-11-19T11:38:31.677Z",
          "Titre": "Slow!",
          "Contenu": "I bought the new star wars, when the stuck status was good. I contacted the supporter, and they told me, i only should wait a couple of seconds, then will i get the game.\r I bought the game for 3 hours ago. But i did not get the key. I contacted the support again, and they said the just get qut of stuck. And i will get one in a hour.\r That is now 3 hours ago. And the support is gone offline.\rThanks for nothing..."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2015-05-05T08:18:51.000Z",
          "Titre": "provided Witcher 3 GOG code canceled as purchased with stolen cc",
          "Contenu": "The purchase of the GOG code was fast and easy. It could be redeemed immediately.\r However, after 3 days the code was canceled by GOG. According to GOG support it had been purchased with a stolen credit card.\r Gamers-Outlet Support was a bit slow to respond, but after forwarding the mail from GOG support I received a refund within 3 working days."
        },
        {
          "Note": 2,
          "Lieu": "IT",
          "Pseudo": "Daniele",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T07:38:09.000Z",
          "Titre": "Ok 3 codes one was already blown",
          "Contenu": "Ok 3 codes one was already blown, but ok the other 2"
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "Thomas",
          "Nb_Reviews": 4,
          "Date": "2016-08-11T15:09:55.097Z",
          "Titre": "Pre purchase of WoW:Legion",
          "Contenu": "On the website with large red letters it was promoted that the keys will be delivered BY the 10th of August (the release date of the pre-patch for Legion). Purchased expecting them to live up to their promise, considering how visible this advertisement was. However, the product is still not being delivered. On the 10th they claimed that it's going to happen on the 11th and now on the 11th they are saying it will be \"Friday or Monday\" (they aren't sure about that either).TL;DR: False advertisement."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Niklas",
          "Nb_Reviews": 1,
          "Date": "2015-01-27T12:39:37.000Z",
          "Titre": "Worst Shop!",
          "Contenu": "I have PRE-ORDERED the game DYING LIGHT, but I have not received the key yet. Official release date: 27.01.2015.\rThe support has told me to contact the refund-support to get a refund, because I was not too happy when I was told I probably won't get my game today.\rRating: 1 Star\r EDIT:\rAfter contacting the support for the third time, I finally got some more information about this problem and I got an excuse from them. But I'm still not buying anything from them again.\rRating: 2 Stars\r EDIT 2:\rI now got my refund, but I'm still not recommend this shop."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Icthalian",
          "Nb_Reviews": 2,
          "Date": "2016-11-25T15:42:03.000Z",
          "Titre": "Close but no cigar (or Steam key, for that matter)",
          "Contenu": "I paid for a Civ 6 CD key but was provided with a key for, apparently, a GeForce reward scheme. This didn't work and, after several attempts, their support person sent me to an AMD rewards website instead. This website's account activation process didn't work, so I requested a refund. I was told that my order was cancelled and they would resell my key, only refunding me once the key had been activated. Wholly unacceptable experience which resulted in my having no Steam key, no Civ 6, an open PayPal dispute and being down €36 until such time as they deem it fitting to give me my money back."
        },
        {
          "Note": 2,
          "Lieu": "UA",
          "Pseudo": "Hafn Hadle",
          "Nb_Reviews": 2,
          "Date": "2023-02-23T23:24:10.000Z",
          "Titre": "1 of 5 key are already used by somebody."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Melody",
          "Nb_Reviews": 1,
          "Date": "2014-12-09T03:42:14.000Z",
          "Titre": "Quick delivery, but be careful.",
          "Contenu": "I purchased Dragon Age Origins after being linked to a CD-Key aggregate site which suggested they were selling the copy with the DLC.  I went to the page, and while the text said nothing about DLC, the tags and a review did seem to confirm it.  Upon purchasing, I was told that I was crazy for believing in tags and past reviews over the main copy/paste text in the description.\r I didn't like being insulted and only asked that they remove the tags that stated that the purchase came with DLC, to which they refused.\r If you're unsure if a product comes with bonuses, be sure to talk to their customer service before making purchasing decisions.\r Otherwise, the service was quick and efficient."
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "Madcustomer",
          "Nb_Reviews": 1,
          "Date": "2014-10-01T11:49:59.000Z",
          "Titre": "Not so happy. But solved problem after 9 days",
          "Contenu": "I purchased a cd key and I  REALLY needed that cdkey on the same day, but there were big problems because they hand't it in stock and later the cdkey gift from steam was already in use. After days waiting for the cdkey and the steam problem, The owner of that website gave me 9 days later a other cdkey/steamproductgift that will work. But problem was only solved after 9 days and I really needed that cdkey on the same day. He was also from Israel to Amsterdam for a business trip so he didn't had time to do it fast. He sended me an e-mail with a steamproduct/gift that worked, but He didn't gave me some extra present to apologize like some other websites do like [external reference]. I am not so happy but after 9 DAYS problem solved."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Kai",
          "Nb_Reviews": 3,
          "Date": "2015-03-23T12:23:41.000Z",
          "Titre": "invalid code - bad support",
          "Contenu": "The Gamekey wasn´t valid. I tried to contact the support via E-Mail, but i dont have received any reply from the support yet. I wrote two E-Mails and wait for over a week now."
        },
        {
          "Note": 2,
          "Lieu": "IL",
          "Pseudo": "Leon Lovecraft",
          "Nb_Reviews": 18,
          "Date": "2017-01-26T10:46:06.000Z",
          "Titre": "Not a scam, but terrible service",
          "Contenu": "Bought a Steam version of Rise of Tomb Rider for 31.15$ instead of 59.99$. If you can read the instructions, this site is recommended.UPD:Bought Resident Evil 7. Read instructions: FOR AFRICA, UK AND MIDDLE EAST ONLY! OK, I'm from Middle East (Israel). Tried to activate. Steam says that \"product is not available in your region\". OK - sent refund request to a customer service - they say that they will provide a refund only after they will resell the key... WTH?! They sold me a key that doesn't work in the region that it should work in, according to their description, AND they make rules for a refund.Opened a refund request on PayPal - will get my money back, but Gamers-Outlet, does not make the experience simple.I will buy from them in future, but I will check other sites before. If I'll have one more bad experience, I'll stop buying from them."
        },
        {
          "Note": 2,
          "Lieu": "MX",
          "Pseudo": "Filiberto Duran",
          "Nb_Reviews": 3,
          "Date": "2023-03-23T21:03:02.000Z",
          "Titre": "the key doesnt work"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Moonman",
          "Nb_Reviews": 3,
          "Date": "2017-02-23T03:45:18.000Z",
          "Titre": "Not received key",
          "Contenu": "Never received a key, maybe I'm impatient and should stop being a lil bech. But yeah. I like instant transactions and this isn't instant."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Charlie",
          "Nb_Reviews": 1,
          "Date": "2021-02-25T17:36:34.000Z",
          "Titre": "Bought a Key",
          "Contenu": "Bought a Key, payed, nothing shown in transactions on account. Have to contact support and maybe request refund from Paypal..."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2014-11-14T14:43:56.000Z",
          "Titre": "purchase was cancelled. I don't know why",
          "Contenu": "I ordered a Fifa 15 Key. Then Gamers-Outlet wanted me to send a copy of my ID Card. After I did so, my purchase was cancelled nevertheless."
        },
        {
          "Note": 2,
          "Lieu": "FR",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2015-06-25T06:11:31.433Z",
          "Titre": "Too much verification",
          "Contenu": "They asked to send a photo of my id card with the order number and today's date for a simple Paypal 20 $ order. Nonsense."
        },
        {
          "Note": 2,
          "Lieu": "FR",
          "Pseudo": "Anna",
          "Nb_Reviews": 1,
          "Date": "2015-03-21T13:29:56.000Z",
          "Titre": "Teso Tamsriel unlimited.",
          "Contenu": "Was wrote \"explorer pack\" on the package when I bought it, I was never able to unlock this feature..."
        },
        {
          "Note": 2,
          "Lieu": "DK",
          "Pseudo": "Daniel Sørensen",
          "Nb_Reviews": 12,
          "Date": "2021-02-05T22:53:27.000Z",
          "Titre": "bough a win10 cd key that was on stuck",
          "Contenu": "bough a win10 cd key that was on stuck, after buying it, its says they need to restock.. cool"
        },
        {
          "Note": 2,
          "Lieu": "IT",
          "Pseudo": "Matteo Memoli",
          "Nb_Reviews": 1,
          "Date": "2020-11-13T21:41:12.000Z",
          "Titre": "too slow to release the cd key",
          "Contenu": "my order is complete two minutes ago sorry for the 2 stairs this sites is 5 stairs"
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "Klant",
          "Nb_Reviews": 4,
          "Date": "2015-03-02T22:39:19.000Z",
          "Titre": "One key didn't work",
          "Contenu": "One key out of three pack keys didnt work contacted the support no replies from them."
        },
        {
          "Note": 2,
          "Lieu": "IT",
          "Pseudo": "mario coclite",
          "Nb_Reviews": 6,
          "Date": "2023-08-04T09:03:01.000Z",
          "Titre": "Key not found"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Creagh",
          "Nb_Reviews": 2,
          "Date": "2014-11-05T00:27:00.000Z",
          "Titre": "slow",
          "Contenu": "8hr wait for cd key to be emailed"
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "Joel Salas",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T03:40:20.000Z",
          "Titre": "I don't know why my distributor account…",
          "Contenu": "I don't know why my distributor account is no longer there.  I buy many licenses and it gave me a better price.  It already cost me dearly, the truth is I'm going to look for another option like Royal.  I buy from you because I trust you, but given your price increase I will have to look for options.  Thank you"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alan K",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T23:44:25.000Z",
          "Titre": "I had to buy another key. First one died..",
          "Contenu": "I've purchased from Gamers-Outlet a couple of times and although I find their support to be top notch, I find the terms to be a little misleading. This was a replacement key I had to purchase because I reinstalled Windows 11. A normal retail key you would not have to do that. The keys are priced good, but if you have to keep buying them, is it really worth it? Thus the 3 stars. If they would have supported the key I originally purchased and give me a replacement, this would have been a 5 star experience. One thing to be aware of, some of the cheaper keys require MS phone activation. Phone activation can be a real PITA and takes at least a half hour to complete. YMMV"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Emilio Gutierrez",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T15:59:29.000Z",
          "Titre": "Good for some time",
          "Contenu": "After a few keys I bought for them worked properly, the last one didn't. I got the \"Key has been activated on another device\" message. This is a shame because I counted on Gamers-Outlet for my keys for quite some time."
        },
        {
          "Note": 3,
          "Lieu": "NZ",
          "Pseudo": "Rhys Powell",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T03:39:54.000Z",
          "Titre": "The price was good and the license is…",
          "Contenu": "The price was good and the license is legit, however I actually purchased Office 2021 Pro and the license key they gave me by mistake was for Office 2019 Pro. I eventually worked out that I had to activate 2019 but it was a bit frustrating. They need to take more care in listing the correct version."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Daniel Lopez",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T02:55:34.000Z",
          "Titre": "We got there in the end",
          "Contenu": "First Code didn't work.Second code also didn't work.Third code worked and windows 11 is now activated."
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "VSA",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T20:44:56.000Z",
          "Titre": "One of the Windows codes didn't work…",
          "Contenu": "One of the Windows codes didn't work (\"had already been used\") so I had to activate is by phone which took a long time"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "A C",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T04:06:15.000Z",
          "Titre": "Got the wrong key, but fixed after three attempts",
          "Contenu": "Got the wrong key, took two attempts to get it right."
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "A Basili",
          "Nb_Reviews": 6,
          "Date": "2023-12-01T23:52:14.000Z",
          "Titre": "It seem like the Licence Key works but…",
          "Contenu": "It seem like the Licence Key works at the beginning, but every few hours then it is requested to activate the licence"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Zero",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T17:52:50.000Z",
          "Titre": "Great deals; poorly constructed and scam-looking website",
          "Contenu": "This website has some really fantastic deals on product keys!But unfortunately, the website is not only ugly and a bit bloated/hard to navigate;But it also will constantly ask for location access, and will post (if it's true) whenever someone buys something on their website right at the bottom of the page, obscuring quite a bit of your view.With the frequent popups and location requests, this can definitely seem like a scam website.If you trust it enough, you can get some amazing deals!But if you're skeptical, I would honestly look elsewhere. Your safety is not worth being at risk over a deal."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Jayaguhan Chelladurai",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T09:55:25.000Z",
          "Titre": "Keys are region locked. Make sure it get it in the right region",
          "Contenu": "Very prompt response. The keys work. The seller is approachable. However, the keys are region locked."
        },
        {
          "Note": 3,
          "Lieu": "LT",
          "Pseudo": "Valdas Dambrauskas",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T18:26:54.000Z",
          "Titre": "For some reason transaction didn't go…",
          "Contenu": "For some reason transaction didn't go frue first time i had to wait until money where relised from pending to make a purchase again."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Pravin D",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T22:48:27.000Z",
          "Titre": "Great pricing, poor customer service.",
          "Contenu": "The pricing for software licences is fantastic.However, the discount voucher/code that I used for the purchase was not honoured fully. Instead of 10%, it was processed as 2%. When challenged, Gamers blamed third party code company. But it was 10% on another site as well."
        },
        {
          "Note": 3,
          "Lieu": "ES",
          "Pseudo": "Andrés García",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T08:40:13.000Z",
          "Titre": "Slowest download",
          "Contenu": "Excellent prices, but the download time was extremely slow with several disconnections. Sometimes it makes you doubt if it's going to go ahead."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Rad1sh",
          "Nb_Reviews": 33,
          "Date": "2023-01-21T15:11:02.000Z",
          "Titre": "Software great, after sales needs work.",
          "Contenu": "Got a working version of MS Office for Mac 2021 so can't complain at that. But the rest of the experience left a lot to be desired. No email confirmation of order. No instructions on how to download the software. I spent ages trying to work it out from their website, and in the end had to email them. A quick response provided the answers, but why can't they simply send an automated email on completion of order, with instructions attached?"
        },
        {
          "Note": 3,
          "Lieu": "GR",
          "Pseudo": "Vasileios Bourantanis",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T06:02:00.000Z",
          "Titre": "You could give some good information…",
          "Contenu": "You could give some good information about the upcoming installation:1. Save contacts, emails, and accounts in Outlook or inform that is not needed. 2. Unistall ALl previous editions of Office (some people may be scared  to do it if they don't know that results)"
        },
        {
          "Note": 3,
          "Lieu": "LV",
          "Pseudo": "Kristaps from Latvia",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T17:17:43.000Z",
          "Titre": "Smooth transaction but ugly hidden costs",
          "Contenu": "I hate when you advertise one price but by the time you get to checkout many mysterious fees are added and in the end, it costs almost the same as from steam or other official providers. I hate these dirty tricks. Other than that the code worked great and the transaction was flawless."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "jk",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T07:59:07.000Z",
          "Titre": "I bought the Microsoft Word 2019 office…",
          "Contenu": "I bought the Microsoft Word 2019 office version key but it says 2016 when I go to account."
        },
        {
          "Note": 3,
          "Lieu": "BG",
          "Pseudo": "Atanas Smily",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T22:29:14.000Z",
          "Titre": "Should provide an option to generate a…",
          "Contenu": "Should provide an option to generate a confirmation id's for MS products as Office or Windows."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Heather",
          "Nb_Reviews": 1,
          "Date": "2022-11-27T00:51:11.000Z",
          "Titre": "Initial ke unusable, online support non-existent",
          "Contenu": "Purchased a key for my teenage son. He couldn't log in using the details I entered to get the key, so I looked it up on my device which was used for the purchase. I hit 'download' instead of 'view' and now he can't use the code as it says it has already been used... Supposedly 24/7 support but they're not responding to my query. Edit: After emailing their support team, it was resolved reasonably quickly. They gave us another code which was already used but third code worked."
        },
        {
          "Note": 3,
          "Lieu": "SK",
          "Pseudo": "Danvo",
          "Nb_Reviews": 4,
          "Date": "2023-03-02T21:58:13.000Z",
          "Titre": "I bought keys for Office 2021…",
          "Contenu": "I bought keys for Office 2021 in September, but tried to use them in February. (I had no time to replace my old laptop...) Both keys i was unable to activate and support team wrote to me that because it is a long time since I bought it, they can't accept my request for replace. Not a very good answer I think. But my previous experience was good."
        },
        {
          "Note": 3,
          "Lieu": "BE",
          "Pseudo": "Gaymer",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T07:55:33.000Z",
          "Titre": "They're alright",
          "Contenu": "They listed a game to be for steam, but it was actually for another platform.They did offer a refund when they sold the key to another person to make it right.Their support is quite fast to respond and try to resolve the issue though"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "ken benson-clarke",
          "Nb_Reviews": 58,
          "Date": "2023-03-26T21:05:45.000Z",
          "Titre": "Sad to report ANOTHER key never worked",
          "Contenu": "Sad to report ANOTHER key never worked, thats 4, 3 being home and 1 being home pro. assistance is given but no response when I said it did not work out., and then being told they are time limited."
        },
        {
          "Note": 3,
          "Lieu": "ES",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T21:32:59.000Z",
          "Titre": "I disliked that for office package I…",
          "Contenu": "I disliked that for office package I had to download a full image instead only a key."
        },
        {
          "Note": 3,
          "Lieu": "ES",
          "Pseudo": "josep pedret",
          "Nb_Reviews": 3,
          "Date": "2023-10-11T12:21:37.000Z",
          "Titre": "In case of an error in purchasing a…",
          "Contenu": "In case of an error in purchasing a product, they do not return the money at the time.....they only promise to return it as soon as they sell the license......a shame"
        },
        {
          "Note": 3,
          "Lieu": "SA",
          "Pseudo": "Alamin Abdalla",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T01:49:30.000Z",
          "Titre": "The payment takes a lot of time and…",
          "Contenu": "The payment takes a lot of time and many PayPal steps confusing and annoying,I hope u guys fix that issue and make it more simple other than the site deserves 5 stars"
        },
        {
          "Note": 3,
          "Lieu": "BE",
          "Pseudo": "Vincent Caufriez",
          "Nb_Reviews": 6,
          "Date": "2023-04-25T21:19:30.000Z",
          "Titre": "This is a great site with very…",
          "Contenu": "This is a great site with very interesting discounts, but the site is a victim of its success and in the 9 selected games I wanted to buy only one was available.No details about the restocking of the products."
        },
        {
          "Note": 3,
          "Lieu": "IL",
          "Pseudo": "sagi haber",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T13:48:00.000Z",
          "Titre": "They advertise 1 price but on the site…",
          "Contenu": "They advertise 1 price but on the site it's a different price"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "anjo rasker",
          "Nb_Reviews": 3,
          "Date": "2023-07-27T23:31:44.000Z",
          "Titre": "I can only give a rating of 3 stars as…",
          "Contenu": "I can only give a rating of 3 stars as I have been waiting for a refund for 3 weeks now.  When refund is received I will review my ratings."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Saleem Ahmed",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T10:02:37.000Z",
          "Titre": "Poor customer service",
          "Contenu": "Hi ,Did not get what I needed & in response to my reservation the response of customer service team was very annoying and casual. The customer service needs special attention and training how they should communicate with customers with manners. Thanks!"
        },
        {
          "Note": 3,
          "Lieu": "RO",
          "Pseudo": "Romaneanu Claudiu",
          "Nb_Reviews": 2,
          "Date": "2023-02-24T00:18:39.000Z",
          "Titre": "I dislike cause i get a Windows 10…",
          "Contenu": "I dislike cause i get a Windows 10 license and doesn t work .In time i get many serials for my pc friends but at Christmas time once time don t work it! If you can help me with a license tine Willbrook perfecte"
        },
        {
          "Note": 3,
          "Lieu": "PH",
          "Pseudo": "Rafael YU",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T14:05:09.000Z",
          "Titre": "I like the wide choices of products",
          "Contenu": "I like the wide choices of products, however, payment process is a pain specially for credit card/debit card"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "William",
          "Nb_Reviews": 2,
          "Date": "2023-08-07T08:15:15.000Z",
          "Titre": "I am now spammed with scam emails",
          "Contenu": "I am now spammed with scam emails  Although the key worked after several attempts and communications with their help desk(who were very quick to respond so that’s great)."
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "ROBERTO",
          "Nb_Reviews": 3,
          "Date": "2023-02-26T15:06:44.000Z",
          "Titre": "Good prices and fast service",
          "Contenu": "Good prices and fast service -                                  The bad point is that there is an short expiry date to use the software licences (less then 2 days) - In case you cannot use the licence within this short period of time you have to buy a new licence"
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Holger Bruns",
          "Nb_Reviews": 6,
          "Date": "2023-05-19T18:30:19.000Z",
          "Titre": "Why do you write your E-Mails in…",
          "Contenu": "Why do you write your E-Mails in english? I only can‘t write or read shool english and when you send me an Mail i don‘t wanna answer to this because i am german."
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "Andrea",
          "Nb_Reviews": 1,
          "Date": "2023-08-27T21:37:20.000Z",
          "Titre": "The serial number was already used",
          "Contenu": "The serial number was already used, I had to phone to Microsoft Service to manually activate my Win10 Pro license."
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "OSCAR GONZALEZ MUÑOZ",
          "Nb_Reviews": 2,
          "Date": "2023-04-16T04:14:48.000Z",
          "Titre": "I could not install the software.",
          "Contenu": "I could not install the software.I used another option however I am going to keep the licence in case I need it in the future"
        },
        {
          "Note": 3,
          "Lieu": "IL",
          "Pseudo": "Yesh",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T19:37:19.000Z",
          "Titre": "it's great to be able to get these…",
          "Contenu": "it's great to be able to get these things for cheap. on the other hand i had some trouble with win 11 pro (though could be it had nothing to do with it being) and had to reset back to win home"
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "J Schäfers",
          "Nb_Reviews": 6,
          "Date": "2023-03-10T23:09:36.000Z",
          "Titre": "The price is very good, but...",
          "Contenu": "The price is very good. But it is not an international Version. It is not possible to change the language into German."
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "sidney diony",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T03:34:57.000Z",
          "Titre": "It's cool but 2 key were bad already…",
          "Contenu": "It's cool but 2 key were bad already used...For the price I didn't tell support to fix because it'll be more expensive time is money."
        },
        {
          "Note": 3,
          "Lieu": "LT",
          "Pseudo": "Kęstutis",
          "Nb_Reviews": 3,
          "Date": "2023-11-26T20:36:17.000Z",
          "Titre": "Code for 1 year",
          "Contenu": "Code for 1 year, but dont last for it, missing few months."
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "ALBERTO MONTANARI",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T18:48:49.000Z",
          "Titre": "The first activation key they sent me…",
          "Contenu": "The first activation key they sent me didn't work, on the second attempt everything is fine."
        },
        {
          "Note": 3,
          "Lieu": "PE",
          "Pseudo": "Omar Jesús Quispe Avila",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T04:18:16.000Z",
          "Titre": "That license don't have all permision",
          "Contenu": "That license don't have all permision. Kaspersky manager password isn't actívate with license that I purchase."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Richard",
          "Nb_Reviews": 9,
          "Date": "2023-10-15T15:42:27.000Z",
          "Titre": "Win11Pro Key is actually Win10Pro still works though.",
          "Contenu": "I purchased a Windows11Pro Key and a Office21 key both work fine however the Windows Key is actually a Windows10Pro No 11Pro it still activated Win11Pro but that’s not the point will it stand upto long term activation who knows and as Gamers-Oulet sell both Win10 & Win11 keys at different prices I do feel a little cheated and technically I guess it is fraud which kinda defeats me buying a “genuine” Licence there for I cannot fully recommend the service as it sells something that works but isn’t actually what it claims to be."
        },
        {
          "Note": 3,
          "Lieu": "GR",
          "Pseudo": "Nobody in particular",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T14:39:41.000Z",
          "Titre": "The product was fine but I paid…",
          "Contenu": "The product was fine but I paid slightly more than it said on your website."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Mr R C",
          "Nb_Reviews": 22,
          "Date": "2023-04-28T06:06:20.000Z",
          "Titre": "There was a lot of confusion over my…",
          "Contenu": "There was a lot of confusion over my first order. However when I placed the second order it went ok"
        },
        {
          "Note": 3,
          "Lieu": "SK",
          "Pseudo": "Jakub Dočkal",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T11:28:29.000Z",
          "Titre": "Key doesn´t work.",
          "Contenu": "Key doesn´t work. I tried phone activation, Getcid, nothing worked. They still tell me the key is OK but key was dead."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kenneth Sands",
          "Nb_Reviews": 3,
          "Date": "2023-11-18T17:21:27.000Z",
          "Titre": "Difficult to find key."
        },
        {
          "Note": 3,
          "Lieu": "HR",
          "Pseudo": "Ivan Kostović",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T08:24:12.000Z",
          "Titre": "I bought 2 CD keys for W10",
          "Contenu": "I bought 2 CD keys for W10, but one of them was used somewhere before (message from W10). The other W10 key was OK."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Kunde",
          "Nb_Reviews": 2,
          "Date": "2023-08-05T17:11:03.000Z",
          "Titre": "unnecessary fees",
          "Contenu": "I don’t understand the weird made up fees, just write the exact price"
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "Alex Collari",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T18:48:04.000Z",
          "Titre": "call windows is booring..."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Paul",
          "Nb_Reviews": 31,
          "Date": "2023-02-23T20:48:51.000Z",
          "Titre": "It was ok codes worked but the codes…",
          "Contenu": "It was ok codes worked but the codes stopped working after just a few weeks so a waste of money really"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Eddy",
          "Nb_Reviews": 6,
          "Date": "2023-08-26T20:38:04.000Z",
          "Titre": "The key did not work for me it said I…",
          "Contenu": "The key did not work for me it said I have the wrong key for the copy of office 16 plus"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jose Briseno",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T09:51:40.000Z",
          "Titre": "I bought 2 keys",
          "Contenu": "I bought 2 keys 1 worked and 1 did not it said key was already in use"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eugene Lewis",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T15:48:13.000Z",
          "Titre": "Had to do phone activation. Not what I expected",
          "Contenu": "Did not like phone activation."
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "Antonio Scopa",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T01:02:28.000Z",
          "Titre": "I have purchased 4 office keys but 2…",
          "Contenu": "I have purchased 4 office keys but 2 were not utilizable"
        },
        {
          "Note": 3,
          "Lieu": "LV",
          "Pseudo": "ARVILS BAUMANIS",
          "Nb_Reviews": 1,
          "Date": "2023-04-15T17:46:36.000Z",
          "Titre": "Can't activate online",
          "Contenu": "Can't activate online, and the dic.. homepage not workin. I still need to call and it,s takes time."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Anthony",
          "Nb_Reviews": 9,
          "Date": "2023-07-22T00:19:27.000Z",
          "Titre": "1st  key did not work",
          "Contenu": "1st  key did not work. After that it got so difficult that I abandond it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mr T",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T04:18:22.000Z",
          "Titre": "Great prices",
          "Contenu": "Great prices - the payment system was a bit wonky."
        },
        {
          "Note": 3,
          "Lieu": "BE",
          "Pseudo": "Stijn Vanden Wyngaert",
          "Nb_Reviews": 3,
          "Date": "2023-04-07T22:45:57.000Z",
          "Titre": "More Adobe stuff like Acrobat",
          "Contenu": "More Adobe stuff like Acrobat, lightroom, Photoshop,…And i love it!"
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "Pascal Dim",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T11:09:27.000Z",
          "Titre": "Win 11 pro not working, win 10 pro are great",
          "Contenu": "Ordered multiple cd keys of win 10 pro and win 11 pro. The Win 11 pro didn't work. but the win 10 pro are working great!"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Tawanda Mhangwa",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T16:57:26.000Z",
          "Titre": "license key didn't work"
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Peter Milde",
          "Nb_Reviews": 3,
          "Date": "2023-04-18T17:55:31.000Z",
          "Titre": "I couldn‘t buy with creditcard",
          "Contenu": "I couldn‘t buy with creditcard. So I paid with Paypal."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "LynxRK",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T08:11:16.000Z",
          "Titre": "I have to do a verifkation with id card"
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "Alex Verwijmeren",
          "Nb_Reviews": 8,
          "Date": "2023-03-03T14:01:17.000Z",
          "Titre": "Membership confusing",
          "Contenu": "Paying for membership is no good"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Paul Wickham",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T22:08:58.000Z",
          "Titre": "It's OK",
          "Contenu": "It's OK. I stuffed up, but I'll be back in a short time to buy again."
        },
        {
          "Note": 3,
          "Lieu": "CH",
          "Pseudo": "Juergen Orthmann",
          "Nb_Reviews": 1,
          "Date": "2023-03-11T17:23:49.000Z",
          "Titre": "The first key provided was already…",
          "Contenu": "The first key provided was already used, the second worked fine.... is this all legal??"
        },
        {
          "Note": 3,
          "Lieu": "RS",
          "Pseudo": "Zoran Nikolić",
          "Nb_Reviews": 2,
          "Date": "2023-04-06T07:15:12.000Z",
          "Titre": "I bought Keys for windows 10 and 11.One…",
          "Contenu": "I bought Keys for windows 10 and 11.One of those didn't work"
        },
        {
          "Note": 3,
          "Lieu": "BE",
          "Pseudo": "Romain",
          "Nb_Reviews": 2,
          "Date": "2023-02-25T10:31:44.000Z",
          "Titre": "Office keys didn't work"
        },
        {
          "Note": 3,
          "Lieu": "LT",
          "Pseudo": "Dainius Akucevicius",
          "Nb_Reviews": 3,
          "Date": "2023-10-09T14:19:35.000Z",
          "Titre": "Baught with internet actyvation",
          "Contenu": "Baught with internet actyvation, get by telephone actyvation :("
        },
        {
          "Note": 3,
          "Lieu": "DK",
          "Pseudo": "Mathias",
          "Nb_Reviews": 1,
          "Date": "2020-11-03T10:34:58.000Z",
          "Titre": "Slow delivery on Windows 10 key",
          "Contenu": "Haven't received my Windows 10 key yet. I made the purchase 15 minutes ago, they took my money and the order isn't in my downloads and doesn't even show up in my orders list on my account.After almost 24 hours I received my key. Extremely slow process, and I was slowly becoming convinced i got scammed. The website lacks a lot of credibility.The support was decent though."
        },
        {
          "Note": 3,
          "Lieu": "BA",
          "Pseudo": "Danilo Nikolaš",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T22:43:14.000Z",
          "Titre": "You become very expensive"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 3,
          "Date": "2023-08-27T18:57:29.000Z",
          "Titre": "One of the Visio keys did not work."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "David Musch",
          "Nb_Reviews": 3,
          "Date": "2023-07-25T13:33:52.000Z",
          "Titre": "Price",
          "Contenu": "I had the product Bit it had tot be updated."
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "Mark",
          "Nb_Reviews": 41,
          "Date": "2019-11-29T13:56:15.000Z",
          "Titre": "Bought W10 license key",
          "Contenu": "Bought W10 license key, status was on pending, contacted support and told me to wait a bit longer because they were restocking, waited 3 hours, contacted again for a refund, they refunded me. And i bought the key somewhere else.Next time do not advertise 'in stock'  when you cannot deliver."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Enrico",
          "Nb_Reviews": 1,
          "Date": "2015-03-31T21:52:44.000Z",
          "Titre": "Slooooowwww",
          "Contenu": "I buy a lot from key-Sites, most likely Kinguin because I always try to get the best shot. Out of 5 different key sites I have used so far Gamers-Outlet was the slowest with over 1h of waiting time :( \rSo it's not really just pay and play - you may have to wait even though we're in the 21st century.\rJust saying: The 2nd slowest site after Gamers-Outlet was Kinguin with a waiting time of 5 minutes. Maybe I have just bad luck here."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Chris Gaggin",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T09:01:55.000Z",
          "Titre": "Does what I was hoping for very happy"
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "Paolo C.",
          "Nb_Reviews": 7,
          "Date": "2014-08-14T10:40:15.000Z",
          "Titre": "Great price but no pre-order bonuses",
          "Contenu": "I Bought a Risen 3 Pre-order steam key that expected to be released with extra bonuses according to the description, but help desk said to me that unfortunately their stock of keys arrived without pre-order bonuses, i had the chance to get refunds but i wanted to play the game so it's ok the price was great but I hope that in the future there will be more precise product description. Nice shop by the way and if something goes wrong you'll get immediately refunds."
        },
        {
          "Note": 3,
          "Lieu": "BG",
          "Pseudo": "George Georgiev",
          "Nb_Reviews": 5,
          "Date": "2023-10-22T10:44:59.000Z",
          "Titre": "Prices rise very quickly",
          "Contenu": "Prices rise very quickly +100% for two months"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "CommittedH",
          "Nb_Reviews": 2,
          "Date": "2020-09-17T14:24:59.000Z",
          "Titre": "TL;DR Buy 1 Key. Leave.",
          "Contenu": "Bought 1 Windows 10 key to see if they were genuine. 2 Hours of \"Pending Verification\" then I had the key. Happy it worked so bought another, \"Pending Verification\" for 2 days, sent a support ticket then next day got a reply saying they need my photo ID along with the name and address and also my phone number for possible phone verification. Not comfortable giving this out to a site that just sells keys and not sure why I had to wait 3 days total to find out what's going on with my order after I gave them my money. A lot of work for a $5 key.They did promptly give me a refund when asked, thank you!"
        },
        {
          "Note": 3,
          "Lieu": "JO",
          "Pseudo": "ahmad",
          "Nb_Reviews": 2,
          "Date": "2014-08-01T21:43:42.000Z",
          "Titre": "Good not great",
          "Contenu": "After few hours of paying for an item I received an email requiring a handwritten text and scan copy of my ID coz my order was flagged. This has never happened with me with other game selling sites and buy a lot of games online. But after speaking with support via chat everything went well. I gave it 3points for the following reason: On reviews and site they mention instant delivery and 24/7 support as i remember but that was the opposite in my case the email sent by them was after a few hours also Support via chat took some time to respond, there is no estimated time shown on when they will reply.  All in all I think its a safe and good site."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2014-10-17T09:29:07.000Z",
          "Titre": "Long wait until i got the key",
          "Contenu": "I think i had to wait 5 days after release of the game i preordered until the key arrived.\r they told me it was a one-of-a-kind thing and i tend to believe them.\r In the end all worked out well."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Bernhard Becker",
          "Nb_Reviews": 1,
          "Date": "2023-07-17T19:31:47.000Z",
          "Titre": "good price",
          "Contenu": "good pricebad support"
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2015-04-16T16:16:43.000Z",
          "Titre": "6/10 Honestly",
          "Contenu": "I bought a game but they sent me an invalid key.\rAnyway, customer service is perfect, they provided me a new valid key in a few hours and they were very very polite.\r LC"
        },
        {
          "Note": 3,
          "Lieu": "ES",
          "Pseudo": "Master of None",
          "Nb_Reviews": 7,
          "Date": "2022-09-11T23:09:42.000Z",
          "Titre": "first key didnt work",
          "Contenu": "First key didn't work, support was able to give a different key an hour later."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "andrew edwards;",
          "Nb_Reviews": 3,
          "Date": "2014-11-11T15:29:08.000Z",
          "Titre": "unclear",
          "Contenu": "the release date for the game i purchased was not specified which ended with some complications but the customer support went above and beyond the call of duty to help me"
        },
        {
          "Note": 3,
          "Lieu": "TR",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2015-01-29T20:16:08.000Z",
          "Titre": "Easy but unnecessarily Safe",
          "Contenu": "İ got key cheap and i like cominication but its unnecessarily safe they want your's identity card and its risky thing for costumers."
        },
        {
          "Note": 3,
          "Lieu": "LV",
          "Pseudo": "wid",
          "Nb_Reviews": 1,
          "Date": "2021-11-14T00:34:18.000Z",
          "Titre": "Buyed Microsoft visio 2021",
          "Contenu": "Buyed Microsoft visio 2021 - key can't be activated using setup.office.com - Token not found. Got a refund"
        },
        {
          "Note": 3,
          "Lieu": "NZ",
          "Pseudo": "Malcolm Tippett",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T23:52:20.000Z",
          "Titre": "Quick n easy"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "compternerd",
          "Nb_Reviews": 3,
          "Date": "2023-05-02T21:31:57.000Z",
          "Titre": "The last 3 I bought did not work."
        },
        {
          "Note": 3,
          "Lieu": "FI",
          "Pseudo": "Jani",
          "Nb_Reviews": 1,
          "Date": "2014-11-25T20:22:21.000Z",
          "Titre": "Your \"global multilangual cd-key\" can be a Russian Steam gift",
          "Contenu": "I recently bought a \"THE WITCHER 3 WILD HUNT STEAM GLOBAL MULTI-LANG CD-KEY\"\r However, I received a Russian steam gift of the game. After contacting the support for the first time they just said that that version has all languages. After contacting them a second time and indicating very clearly that a Russian version/ steam gift is not what was agreed upon they refunded the sale price to my Paypal account.\r Most likely 90 % of people accept the Russian version, and there can be problems when the game is out next year. Just google \"The Witcher 3 RU OLD\" = name of the steam gift for more information.\r But still positive experience from the refund - too bad for majority of the people not realizing to ask it.\r *edit* rating increased to 3 stars based on apology from the store and swift communication via e-mail from their side. Also I can confirm that the description on the game in the store now better reflects the nature of the product. \r Just very carefully make sure you really get what you order by checking the name of the gift you receive and you should be good to go. If you decide to buy a RU game, be aware that there is some risk (does it work in the end, is there some content removed?) in buying those games if you do not live in Russia."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Yozzer",
          "Nb_Reviews": 9,
          "Date": "2017-04-13T19:23:53.000Z",
          "Titre": "Bought Assassins Creed Black Flag",
          "Contenu": "Bought Assassins Creed Black Flag. Key supplied was invalid when I entered it into my Uplay key activation portal. Contacted Gamers Outlet chat line, and they basically said I had to prove the code was invalid, and this had never happened to them before. I provided an image of the screen activation failure, and contacted Ubisoft support as G.O. had requested, Ubisoft were very good, and confirmed the key was not valid. I sent a text copy of the chat to G.O., but they said they wanted the image, still trying to insist I had not proved the key was not valid.I found I still had the internet connection to Ubisoft, so sent G.O. the images of the chat, confirming the key is rubbish. I have now opened a dispute via Paypal. Edit: Support have come back to me now with an option of a full refund or a new key. I chose the new key and it is downloading now. Seems they needed the information I sent to get a refund themselves. It is a pity support did not make this clear in the first place, but perhaps they were busy, but as this is the first key I have bought, having spent a small fortune in the last 3 decades or so on software, and thought I could save some money, but at my age I could sure done without the hassle, and it seems it was a good job I was able to get the image of the chat with Ubisoft support!"
        },
        {
          "Note": 3,
          "Lieu": "TR",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2015-04-11T20:37:10.000Z",
          "Titre": "id required?",
          "Contenu": "it was ridicilous that to send the picture of the id. i couldnt get the reason."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "PhantomTa2",
          "Nb_Reviews": 12,
          "Date": "2014-09-06T17:33:38.000Z",
          "Titre": "*EDITED REVIEW* Here to help?",
          "Contenu": "*EDITED REVIEW*\r  My review for this company was less than affable.  I felt I was mistreated whilst trying to purchase a game, but they have since contacted me and have done all they can to help remedy the situation.\r  I have since got my game from a different store, (in fact it was the same day), but seeing as a representative from Gamers Outlet has contacted me and has tried everything she can to sort the problems out, I have decided to edit my review for them.\r   It's inevitable that some customers will come across problems, such as I did, and will feel slighted by what happens and will leave a less-than-favourable review of the store.  As said, they have since contacted me and have been, in my opinion, pleasant to deal with, even through my scathing perception of them.  With this being said, I'm editing my review of them to 3 stars, acceptable but there was friction.  If there was a higher rating I could give that was truthful to the situation, (not on any part of the store's fault), then I would rate it that. I would even say it's \"4-Stars, but with some friction\".\r   I feel I am probably going to try this store again some time in the future.  The customer rep who emailed me was very friendly and polite, even offering a small amount of compensation for what happened. \r  In that light, I would suggest that others try this store,  hopefully to find that my problems were a one-off occurrence."
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "gielke03",
          "Nb_Reviews": 4,
          "Date": "2016-05-16T21:18:07.000Z",
          "Titre": "Did get the key but with a twist",
          "Contenu": "i got the key the next day so i had the wait for a time but yea"
        },
        {
          "Note": 3,
          "Lieu": "UA",
          "Pseudo": "Hafn Hadle",
          "Nb_Reviews": 2,
          "Date": "2023-03-08T23:34:23.000Z",
          "Titre": "1 of 5 keys don't works"
        },
        {
          "Note": 3,
          "Lieu": "SG",
          "Pseudo": "Jet Tan",
          "Nb_Reviews": 2,
          "Date": "2016-10-28T16:49:54.000Z",
          "Titre": "Good support does not make up for poor logistics.",
          "Contenu": "UPDATE: Support got back to me with a working Hellfighter pack key. Bumped my review up to 3* from 2. Many thanks to support for sticking with a customer till the very end.Decided to buy BF1 with the Hellfighter pack key from the site seeing the good reviews. However, little did I know that I would run into so much trouble.1) Paid with Paypal and redirected to main site, only to get a \"site down\" error from Cloudflare. Order was stuck on pending, had to email support for confirmation.2) An hour later, was asked to provide a photo of my ID and a handwritten note for verification. I don't see the need for this, and many others did not need to have to do this, so I was genuinely puzzled. This was not only a huge inconvenience, but also a risk of identity theft.3) Sent a photo of my ID for verification. Key was released near instantaneously (a plus). However, another problem surfaced: trying to download the scan of the game key on their website resulted in me getting an unopenable zero kb file. Tried with different browsers and even on my phone, nada. Had to email support AGAIN to get them to send me the game key.4) Days later, friend tried to use the Hellfighter DLC key (game was a gift for my friend), only to find out it has already been used. Contacted support, but a resolution seems unlikely since they seem to have run out of keys on the main site.  Basically, I was scammed out of a dollar. If you are thinking of purchasing from this site just to save a few bucks, my suggestion is don't. The only pleasant part of this experience (which prevented me from giving this a 1*) was the cordial and spontaneous support, but this does not excuse the trainwreck of a process of getting the game key; I would rather have a seamless experience without me having to contact support in the first place than this."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Consumer",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T20:08:40.000Z",
          "Titre": "Rrsolved issue quickly",
          "Contenu": "My code showed as had been used. Reported this and was was contaced almost immediately. resolved quickly . Provide some evidence of the error message and received a working code. All done in about 30 mins"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Earl AJ Blighboy",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T23:16:05.000Z",
          "Titre": "Great price but need better instructions",
          "Contenu": "Great price and the key worked as advertised. The only problem was the process of installation was a little confusing and the explanation of the required steps involved could have been more detailed and clear.I realise this is on the Microsoft side of things, but it would still be good to provide clear information on this."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Raymond",
          "Nb_Reviews": 5,
          "Date": "2023-12-21T13:52:42.000Z",
          "Titre": "Quick response to plea for help",
          "Contenu": "Quick response to plea for help! One of the best customer service centres around."
        },
        {
          "Note": 4,
          "Lieu": "PT",
          "Pseudo": "Antonio Leal",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T19:57:05.000Z",
          "Titre": "I haven't received the order yet",
          "Contenu": "I haven't received the order yet.  therefore, I cannot rate your service.  😕"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Leona Montgomery",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T15:26:36.000Z",
          "Titre": "Recommendation",
          "Contenu": "Purchase went flawlessly for office licenses for Windows and Mac. All licenses worked, only activation on Mac caused some trouble. Support was friendly and gave suggestions until we were able to figure it out."
        },
        {
          "Note": 4,
          "Lieu": "PT",
          "Pseudo": "T. E.",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T20:55:33.000Z",
          "Titre": "Excellent service!",
          "Contenu": "Excellent service!Bought an office key immediately received.As the first one didn´t work, I complained and in a few minutes it was properly replaced."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Amadio",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T18:05:13.000Z",
          "Titre": "Download was uneventful",
          "Contenu": "Download was uneventful. Activation wasn't as straight forward as I would have liked it, but easy nevertheless."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "AJ",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T23:07:14.000Z",
          "Titre": "Quick to fix solution",
          "Contenu": "I received a used product Key at first, However they quickly fixed this in seconds by giving another key , FAST SERVICE"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "cb",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T18:26:03.000Z",
          "Titre": "Inital key was invalid but a…",
          "Contenu": "Inital key was invalid but a replacement worked just fine."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mr MacKenzie",
          "Nb_Reviews": 21,
          "Date": "2023-12-02T16:02:03.000Z",
          "Titre": "Microsoft 365 One User One Year Renewal",
          "Contenu": "Website was easy to navigate.Software key was very easy to use via the provided MS linkVery good price - most competitive(Europe includes UK !!)Only downside is that there was a Paypal fee which means the price you see is not the price you pay - I tried to use a different payment method but looks like it is only available to USA buyers."
        },
        {
          "Note": 4,
          "Lieu": "CO",
          "Pseudo": "Demolizher",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T20:21:03.000Z",
          "Titre": "So far, good!",
          "Contenu": "The service in general seems very well. Everything working out so far!"
        },
        {
          "Note": 4,
          "Lieu": "GR",
          "Pseudo": "Ioannis Mexis",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T18:21:06.000Z",
          "Titre": "I had to wait for about an hour for my…",
          "Contenu": "I had to wait for about an hour for my purchase to be accepted. I did not expect a not immediate buy. Other than that it was a straightforward experience."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Eduardo Calero",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T16:18:12.000Z",
          "Titre": "I should have placed 5 stars instead of…",
          "Contenu": "I should have placed 5 stars instead of 4 because the money I paid for the product is insignificant. Therefore, I shouldn't expect more for the money I paid for.I had a hard time getting the software installed. See my previous notes and emails but overall, all is well that that ends well.Mank thank you for your help and patience."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Fawzi Mahmoud",
          "Nb_Reviews": 6,
          "Date": "2023-12-09T07:45:10.000Z",
          "Titre": "Good customer support!",
          "Contenu": "I bought window 11 pro key. First key didn’t work but customer support were very quick to sort it out and a replacement code was sent."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "guillermo",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T20:15:04.000Z",
          "Titre": "super cheap super fast",
          "Contenu": "super cheap super fast, in 5 minutes i had my key and it worked on the first try – however sketchy, however gray-market, works fine."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "James",
          "Nb_Reviews": 37,
          "Date": "2023-12-01T13:17:43.000Z",
          "Titre": "Excellent on one and OK on the other,",
          "Contenu": "Bought two CD keys , one worked perfectly.  The other didn't as it said it was already in use.  I raised a query and had a response within 15 mins. It was no use and replied. The second response was again within 15 mins and was no better. I then told them that I wanted another key. They supplied it within 15 mins and everything is fine.  So slight problem but fully resolved with quick customer support."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mr Chil",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T20:39:55.000Z",
          "Titre": "Seems sketchy. Turned out to be legit.",
          "Contenu": "I was in need of MS office suite. I decided to purchase from Gamers Outlet with a gift card as this seemed to be pretty sketchy. Tried multiple times with a gift card to make the transaction. It declined multiple times. According to what I could find on the company, they were based in the US. Turns out the transaction was made in Israel. I only found out after I used a legit credit card and got a warning from my bank about an international transaction and it stated it was coming from Israel. So they emailed me the keys, I downloaded the software from the \"official\" link they provided, installed the software and was able to license and register it with no problems. The description of what I was purchasing was accurate. Schit didn't hit the fan so I don't know how well the customer service is. I will use them again. I have already recommended them to many. If anything could be changed to better my experience to make it smooth transaction, it would be to have a US based transaction so I can use gift cards to purchase or at least a warning that they are not US based."
        },
        {
          "Note": 4,
          "Lieu": "PT",
          "Pseudo": "Bruno Santos",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T21:07:31.000Z",
          "Titre": "Good service, great prices.",
          "Contenu": "Good products, great prices, very good service. If you need help after purchasing, they help you with a very quick response and knowing what they are doing."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Trevor Palmer",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T12:57:16.000Z",
          "Titre": "I stuffed up and purchased home…",
          "Contenu": "I stuffed up and purchased home licences and was trying to active clean pro installs with them. In my mind I was convinced i had bought pro. It took 8 emails before it was pointed out to me I goofed. So end result was great. The thing that suprised me was the email was headed \" Windows 10 pro lic keys not working\" and after sending back order number It wasnt picked up until later. We are all human it seems."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "NordVPN Customer",
          "Nb_Reviews": 3,
          "Date": "2023-11-08T20:52:47.000Z",
          "Titre": "The product keys were cheap",
          "Contenu": "The product keys were cheap, as described and worked so give Gamers Outlet a 4 star.  Although calling Microsoft to activate the keys was a nightmare, sure long automated call and kept having technical issues with the calls so had to make multiple calls - I'd give them negative stars.  I'd recommend paying a bit more for keys you don't have to call in to Microsoft."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Matteo",
          "Nb_Reviews": 3,
          "Date": "2023-12-11T10:02:14.000Z",
          "Titre": "Very good website",
          "Contenu": "Very good website and I had a good experience with it.The instructions for installation could be clearer."
        },
        {
          "Note": 4,
          "Lieu": "IE",
          "Pseudo": "nick robinson",
          "Nb_Reviews": 12,
          "Date": "2023-11-05T22:18:44.000Z",
          "Titre": "Website easy to use",
          "Contenu": "Website easy to use . Install and setup details very detailed. Key history avalible to recheck purchases. Recently a software purchased changed and the info on the site showed what was required to adjust and continue using appVery happy with service and have purchased several items from themWould use there services again in the future."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "R  Raaphorst",
          "Nb_Reviews": 6,
          "Date": "2023-11-29T21:55:45.000Z",
          "Titre": "Just a bit cumbersome doing the phone…",
          "Contenu": "Just a bit cumbersome doing the phone activation, but when you concentrate it is perfectly doable. Great value for money."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Marco Turri",
          "Nb_Reviews": 5,
          "Date": "2023-11-16T17:27:03.000Z",
          "Titre": "Nice experience on buying SW",
          "Contenu": "The purchase process has been completed without any problems. To be improved is the aspect of documentation that is produced. The overcharge for using PayPal would be avoided or reported prior to purchase.However you are very professional and the site is nice"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ΧΡΗΣΤΟΣ ΛΑΜΠΡΙΑΝΙΔΗΣ",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T22:05:54.000Z",
          "Titre": "Quick respond of the helpdesk but…",
          "Contenu": "Quick respond of the helpdesk but produch never worked."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Gadbury",
          "Nb_Reviews": 5,
          "Date": "2023-11-05T19:51:22.000Z",
          "Titre": "Quick and easy to get keys",
          "Contenu": "I build a lot of systems, once my business and now just a retirement  hobby, so having quick and well priced OEM program keys is essential to every PC large or small. Gamers-Outlet makes the process of purchases fast and painless."
        },
        {
          "Note": 4,
          "Lieu": "GR",
          "Pseudo": "Georgia",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T21:50:20.000Z",
          "Titre": "Very good price",
          "Contenu": "Very good price, a little complicated to install. I failed the first time and I asked for another key, but the response was immediate and effective."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Adesope Bello-Aromire",
          "Nb_Reviews": 19,
          "Date": "2023-11-08T12:25:08.000Z",
          "Titre": "Almost entirely perfect, but very perfect for me",
          "Contenu": "The quickness of delivery, ease of installation and genuineness of product. My only reason for keeping one star to myself is that there isn’t yet a version for iOS. This of course might be due to the highly exclusive nature of the iOS brand."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "César Campos",
          "Nb_Reviews": 2,
          "Date": "2023-11-10T18:22:51.000Z",
          "Titre": "Good place to buy software...",
          "Contenu": "All the buying process was too easy and simple, only the information provided to download the .iso and redeem the licence, for me, wasn't too clear, it makes me have doubts about if the image was for pc or mac."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Patrick Johansson",
          "Nb_Reviews": 3,
          "Date": "2023-11-21T18:57:57.000Z",
          "Titre": "Great support",
          "Contenu": "After buying a windows 10 pro key, it did not work. But I contacted their support and within 24h it was solved and i received a key that worked fine. Great response from their support."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Valentín González Ortiz",
          "Nb_Reviews": 2,
          "Date": "2023-10-24T17:44:47.000Z",
          "Titre": "Worked as expected",
          "Contenu": "Worked as expected, keys received, software downloaded, installed, activated,... Everything working fine in less than 15 minutes.¿Anything for improvement?It would be nice to receive a sticker or a discount for next acquisitions.Just joking."
        },
        {
          "Note": 4,
          "Lieu": "GR",
          "Pseudo": "MARIA KEKELIDOU",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T20:41:29.000Z",
          "Titre": "Super job!!!!!!"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "H. Duim",
          "Nb_Reviews": 11,
          "Date": "2023-10-16T12:53:30.000Z",
          "Titre": "Trustworthy, low prices, good service.",
          "Contenu": "Their site is easy to navigate, their product catalogue complete. The instructions are clear and the prices are really good. But the proces after you have forgotten your password is ridiculous complicated. But you simply need an id so you can find your key when needed and you have lost it.Bought multiple times software from them."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Michael",
          "Nb_Reviews": 27,
          "Date": "2023-11-05T00:58:25.000Z",
          "Titre": "What was sold as a Windows 11 Pro…",
          "Contenu": "What was sold as a Windows 11 Pro product key turned out to be a Windows 10 Pro product key. This is not such an issue as, apparently, it can be used to activate Windows 11. Two surprises in one evening!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Nik Halliday",
          "Nb_Reviews": 5,
          "Date": "2023-12-08T16:08:15.000Z",
          "Titre": "Responding to second or third request…",
          "Contenu": "Responding to second or third request but, as yet, I have not been able to use the product.  So far so good."
        },
        {
          "Note": 4,
          "Lieu": "CO",
          "Pseudo": "Camilo L.",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T07:43:54.000Z",
          "Titre": "Excelent customer service",
          "Contenu": "I was having issues activating my product, but once I send a form for customer service, the solved it right away!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Arjin",
          "Nb_Reviews": 6,
          "Date": "2023-09-04T19:52:14.000Z",
          "Titre": "Surprisingly Good",
          "Contenu": "I was a bit sceptical about buying keys from Gamers-Outlet because the price was so insanely low, but happy to say that I bought Windows 11 Pro and the key worked perfectly.  In fact, a couple of days later I also bought Office 2021 from them.  The only reason I'm not giving them a 5 star is because there's a small additional cost for using PayPal/Credit Card that you only find out once you go to the payment screen.  Not a big deal given how cheap the keys are, but I feel the additional cost should be better advertised."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Angelo Ghezzi",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T00:26:29.000Z",
          "Titre": "Problem with downloaded Office image",
          "Contenu": "I had a problem with Office image dowloaded from gamersoutlet.zendesk.com/..., because my OS, Windows 2010 22H2 version, don't recognize file image signature.I have downloaded the image from the other site and I was able install and use Office"
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "Yoeri Stevens",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T22:21:57.000Z",
          "Titre": "Easy to select and buy",
          "Contenu": "Easy to select and buy. Received the key in under 1 minute!"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Wes Barlow",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T10:25:07.000Z",
          "Titre": "Nice website",
          "Contenu": "Nice website, actually some effort, really simple to use."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jenkye",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T09:55:05.000Z",
          "Titre": "Orientation on the site is weird",
          "Contenu": "Orientation on the site is weird, so I didn't see that I have 3 keys instead of 1."
        },
        {
          "Note": 4,
          "Lieu": "IL",
          "Pseudo": "guy lazovski",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T14:40:26.000Z",
          "Titre": "Excellent prices",
          "Contenu": "Gamers outlet has excellent prices, this is the third time I ordered from them. I really wish the payment validation would take less, and that the variety of software would be better, would like it to include SOLIDWORKS and endnote."
        },
        {
          "Note": 4,
          "Lieu": "SE",
          "Pseudo": "Nikolaos V.",
          "Nb_Reviews": 3,
          "Date": "2023-11-06T11:34:08.000Z",
          "Titre": "The key worked perfectly - many spam emails",
          "Contenu": "The key has worked without problems, thank you. BUT after the buy I got a massive amount of spam emails in my inbox; you should be more careful about sharing the emails used to make payments to you."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "CustomerAlan G",
          "Nb_Reviews": 20,
          "Date": "2023-12-07T21:12:28.000Z",
          "Titre": "Excellent service …",
          "Contenu": "Excellent service and a remarkable price for a working MS key"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Vincent Ng",
          "Nb_Reviews": 12,
          "Date": "2023-10-10T19:32:42.000Z",
          "Titre": "There might be extra cost if you pay by VISA or MasterCard",
          "Contenu": "I paid, they delivered in 30 seconds. So nothing wrong with that.  What was wrong was the fact I was charged for paying in foreign currency (I'm in UK, paying GBP) while using VISA debit.  The charge was from my bank, thankfully just an extra GBP or so."
        },
        {
          "Note": 4,
          "Lieu": "DK",
          "Pseudo": "D.O.H",
          "Nb_Reviews": 26,
          "Date": "2023-09-07T13:32:50.000Z",
          "Titre": "Faulty codes, fast response",
          "Contenu": "Bought 2 products - none of the codes worked at first. The matter was resolved fast, as their response was quick, but an unnecessary hassle to write back and forth a couple of times with a couple of screenshots.Great price, and working products in the end (Windows 11 and Office 2021)"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Manoj Mistry",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T12:11:19.000Z",
          "Titre": "Process was smooth",
          "Contenu": "Process was smooth, key worked well. Instructions for prerequisite delete could be more explicit"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Alexander De Lima",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T06:14:46.000Z",
          "Titre": "Still waiting for my keys to come even…",
          "Contenu": "Still waiting for my keys to come even though they said that it was in stock but no it wasn't. Emailed the the stafff and they said they're waiting for delivery so hopefully I get my keys but so far my experience has not been good."
        },
        {
          "Note": 4,
          "Lieu": "PT",
          "Pseudo": "MEscobar",
          "Nb_Reviews": 3,
          "Date": "2023-12-09T21:36:10.000Z",
          "Titre": "Key works but can't use hotmail account"
        },
        {
          "Note": 4,
          "Lieu": "SK",
          "Pseudo": "Ing.Roman Surin",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T18:48:57.000Z",
          "Titre": "Comunication and problem solving(fast…",
          "Contenu": "Comunication and problem solving(fast Via remote) Negatívne: IS seeling a license (eset Global rules) that not works"
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Francisco Garcia",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T08:34:52.000Z",
          "Titre": "Great experience",
          "Contenu": "Quick response, very good price, easy download and instalation, no further issues with the product, I'm really happy to have found Gamers Outlet. I'll repeat and recommend them for sure!"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Arnoud",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T13:53:01.000Z",
          "Titre": "Buy microsoft software thingies",
          "Contenu": "I wanted Ms Office, i bought Ms Office key here, Ms office key works.From visit to checkout, takes less then 5 minutes.Only annoying thing is the popups in the bottom corner of the screen from people who bought products on the website."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "TGC",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T09:01:32.000Z",
          "Titre": "Good pricing but keys not always work.",
          "Contenu": "The first thing that you are doing great is pricing, very competitive and consumer friendly, also your client support is very good, they helped me when your first key wasn't working, also the secondo and the third, only the fourth key worked. I do not know if is frequent or not but at start it was a bit scary, purchasing something but then having nothing, but your client support was so king to answer fast and giving me substitute keys."
        },
        {
          "Note": 4,
          "Lieu": "GR",
          "Pseudo": "Pan Anton",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T10:23:54.000Z",
          "Titre": "Very good service and prices",
          "Contenu": "Very good service and prices! The keys were available immediately and worked fine! Using one for over a year now. Four stars because prices go a little bit up with some payment services."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Peter Weiß",
          "Nb_Reviews": 7,
          "Date": "2023-11-30T22:19:06.000Z",
          "Titre": "Good Support Team at all",
          "Contenu": "The key works, but only for version 5.xx, not for the current version. So do not update the software."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Andrew",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T02:39:25.000Z",
          "Titre": "Better than expected customer support",
          "Contenu": "Purchased a key that didn't work first time but the customer support to resolve the issue was excellent. Very fast responses and very accommodating until we got thee product. I would not hesitate to use them again especially as the prices were so competitive."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Terry Clark",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T05:35:45.000Z",
          "Titre": "Legitimate product",
          "Contenu": "All in all a very easy process to purchase and install. I had a slight problem with activation abut easily overcome."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Mark",
          "Nb_Reviews": 7,
          "Date": "2023-10-13T17:16:37.000Z",
          "Titre": "nice prices",
          "Contenu": "Nice prices, fast service. But activation my be a little cumbersome, as the site is not very clear about the actions to take. Once you've found out its easy."
        },
        {
          "Note": 4,
          "Lieu": "AT",
          "Pseudo": "Andreas Gebetsberger",
          "Nb_Reviews": 4,
          "Date": "2023-10-28T20:08:17.000Z",
          "Titre": "{updated}",
          "Contenu": "Review changed - sorry my bad! A little bit more detailed explanation would be great but the sold goods are working and all is fine!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Frank Leff",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T04:20:45.000Z",
          "Titre": "Very good pricing",
          "Contenu": "Very good pricing.  Got the Office with no problems quickly.  Had problem with antivirus program codes.  Got it resolved in a few days."
        },
        {
          "Note": 4,
          "Lieu": "GR",
          "Pseudo": "Petris Fars",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T17:19:58.000Z",
          "Titre": "Double charged",
          "Contenu": "On the last step of purchase the page lagged and dint responded so I did it again  so I got charged twice . 4 days now and yet the refund ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MARCO ANNONI",
          "Nb_Reviews": 2,
          "Date": "2023-11-02T19:48:32.000Z",
          "Titre": "The price was really good",
          "Contenu": "The price was really good. It's not 5 stars because the process hasn't been completely smooth but everything worked out in the end."
        },
        {
          "Note": 4,
          "Lieu": "PE",
          "Pseudo": "Luis Madrid Guerra",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T20:50:13.000Z",
          "Titre": "You sould have two steps identity…",
          "Contenu": "You sould have two steps identity verification to avoid unauthorized access to gamers outlet site"
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Cristiano Valentini",
          "Nb_Reviews": 3,
          "Date": "2023-09-06T09:38:49.000Z",
          "Titre": "so far so good",
          "Contenu": "so far so good. The 2 Office keys I purchased, worked for the activation. Need time to check if the \"lifetime\" subscription is really working."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Shuaib Balogun",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T14:10:47.000Z",
          "Titre": "The customer service team was very helpful.",
          "Contenu": "The customer service team was very prompt and helpful; they did not waiver until the installation problem was fully solved. Kudos to them all."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "jurica ivcevic",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T18:21:33.000Z",
          "Titre": "To be honest ...",
          "Contenu": "To be honest .... It was confusing purchasing & installing (for me) .... Had to hire professional to install it Otherwise everything nice .... Thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hector Guillen",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T04:45:56.000Z",
          "Titre": "The delivery was fast and secure",
          "Contenu": "The delivery was fast and secure. I like the service, I just hope you will have other applications available ( like adobe premier pro) thank you"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Raymond Dueck",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T20:44:32.000Z",
          "Titre": "I bought several keys for office for…",
          "Contenu": "I bought several keys for office for future usage. But when I tried to use them they did not work. The good news they gave me a credit for me to use later when I needed the keys and so all was good. I just wished I had know that you can not buy and not use until much later. So for those buying make sure you intend to use when buy them"
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Jorge Guerrero",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T20:02:01.000Z",
          "Titre": "Good product",
          "Contenu": "It, a bit difficult to follow the instructions but the product is good."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Fedor",
          "Nb_Reviews": 16,
          "Date": "2023-10-24T08:42:22.000Z",
          "Titre": "Works well! Fast and easy.",
          "Contenu": "Fast and easy. just place your order and receive the key quickly with hassle free installation."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Sven Widmann",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T17:48:32.000Z",
          "Titre": "Steam key Was already Used",
          "Contenu": "Steam key Was already Used, so i got Nothing.Edit: Customer Service Provided a new working Key.Thanks for that."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tim Williamson",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T21:48:00.000Z",
          "Titre": "Very fast and simple",
          "Contenu": "A very fast and simple process to purchase a software key."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "MARCO",
          "Nb_Reviews": 4,
          "Date": "2023-09-06T14:05:15.000Z",
          "Titre": "Fast delivery and good support",
          "Contenu": "Fast delivery and good support for my problem solving.All the keys are ok. For me is very useful to have an history of purchases (and keys)."
        },
        {
          "Note": 4,
          "Lieu": "IL",
          "Pseudo": "אלעד בר מערכות מחשוב בעמ בר",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T23:04:09.000Z",
          "Titre": "high price",
          "Contenu": "everything works fine.just the price was too expensive than other sites."
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "Pieterjan Deprest",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T13:31:10.000Z",
          "Titre": "Some problems but good helpservice",
          "Contenu": "Key didn't work in the beginning but after contacting the help service it worked (best help service ever)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ruben",
          "Nb_Reviews": 4,
          "Date": "2023-08-29T17:33:00.000Z",
          "Titre": "There are very versatile company they…",
          "Contenu": "There are very versatile company they have everything you can possibly need the purchasing is pretty easy figuring out how to get to download and that's a little different other than that it's pretty good"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "randy",
          "Nb_Reviews": 7,
          "Date": "2023-10-31T20:09:00.000Z",
          "Titre": "good service",
          "Contenu": "havent try'd the key yet.but fast delivery and good explanation"
        },
        {
          "Note": 4,
          "Lieu": "GR",
          "Pseudo": "Ioannis Tsartsa",
          "Nb_Reviews": 3,
          "Date": "2023-09-23T18:45:17.000Z",
          "Titre": "Well",
          "Contenu": "Well, everything goes right. The four star was because then promotion price was lower that the price that I have actually paid."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Chris",
          "Nb_Reviews": 32,
          "Date": "2023-11-03T14:14:20.000Z",
          "Titre": "Great service",
          "Contenu": "Slight issue but the matter was resolved withing 30 minutes."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Snoopy",
          "Nb_Reviews": 2,
          "Date": "2023-08-24T16:13:19.000Z",
          "Titre": "The payment function for creditcards on…",
          "Contenu": "The payment function for creditcards on the webside is very poor. It is very hard to read the numbers and characters"
        },
        {
          "Note": 4,
          "Lieu": "BG",
          "Pseudo": "Iliyan Iliev",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T20:38:13.000Z",
          "Titre": "Fast and reliable"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Andy",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T00:36:22.000Z",
          "Titre": "Codes didn’t work but they were really…",
          "Contenu": "Codes didn’t work but they were really helpful in solving the problem. Great value for money in the end."
        },
        {
          "Note": 4,
          "Lieu": "SI",
          "Pseudo": "Aleš Mohorič",
          "Nb_Reviews": 3,
          "Date": "2023-08-22T12:07:41.000Z",
          "Titre": "Good",
          "Contenu": "Good: quick delivery.it works.Bad: download links are not directly visible with the serial. Quite a hussle to find the download for the iso."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Alberto Viotto",
          "Nb_Reviews": 6,
          "Date": "2023-11-13T18:13:01.000Z",
          "Titre": "All keys working fine",
          "Contenu": "All keys working fine. No issues or problems."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Kamran Fazal",
          "Nb_Reviews": 2,
          "Date": "2023-10-30T20:06:57.000Z",
          "Titre": "issue resolved,good service, recommended",
          "Contenu": "i had an issue but it was resolved and put it right straightyaway.thank you and recommended"
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Antonio Gimenez del Pino",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T13:27:48.000Z",
          "Titre": "Excelente support team",
          "Contenu": "I purchased an activation key, and it didn't work at first,   but they solved it in seconds."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "massimo",
          "Nb_Reviews": 2,
          "Date": "2023-09-06T17:56:40.000Z",
          "Titre": "Good but I had to do some ad steps to…",
          "Contenu": "Good but I had to do some ad steps to insert the key calling microsoft support via call"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "OZ",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T00:31:59.000Z",
          "Titre": "EU only Office 365 Key",
          "Contenu": "Ordered wrong regional CD key but got refund. Happy ending."
        },
        {
          "Note": 4,
          "Lieu": "AE",
          "Pseudo": "Abdallah Al Hamadi",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T22:23:39.000Z",
          "Titre": "The experience was good",
          "Contenu": "The experience was good, but it should be faster to get the licenses as it should be available"
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "r.",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T16:25:54.000Z",
          "Titre": "Excel key",
          "Contenu": "All ok, perfect"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Stray",
          "Nb_Reviews": 6,
          "Date": "2023-11-16T07:49:26.000Z",
          "Titre": "Windows 11 key's working",
          "Contenu": "Windows 11 key's working, guess time will tell though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff Cotton",
          "Nb_Reviews": 11,
          "Date": "2023-10-12T20:56:46.000Z",
          "Titre": "It appears that prices have gone up…",
          "Contenu": "It appears that prices have gone up recently.That's two price increases in less than 3 months."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ian Osterloh",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T21:37:29.000Z",
          "Titre": "The key works but the website has a lot…",
          "Contenu": "The key works but the website has a lot of annoying bugs"
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Cristiano",
          "Nb_Reviews": 3,
          "Date": "2023-09-04T11:47:36.000Z",
          "Titre": "Great sw purchasing experience!",
          "Contenu": "Quick order phase, download instruction easy to find and to follow. Very useful"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Stephen",
          "Nb_Reviews": 3,
          "Date": "2023-10-08T20:20:56.000Z",
          "Titre": "Happy ending",
          "Contenu": "First key didn't work, but they were quick to resolve and sent me a working key."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "M. Ritzema",
          "Nb_Reviews": 14,
          "Date": "2023-11-11T19:49:54.000Z",
          "Titre": "Nice service. Good prices.",
          "Contenu": "Exellent dhop.Good prices, nice service."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Don Wilson",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T01:23:02.000Z",
          "Titre": "Initial code did not seem to work but…",
          "Contenu": "Initial code did not seem to work but we worked through the issues and ended up with a new code that did work."
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "Patrick C",
          "Nb_Reviews": 5,
          "Date": "2023-08-30T18:54:15.000Z",
          "Titre": "Excellent site for licenses",
          "Contenu": "Excellent site for licenses, I removed one star because I activated Eset smart security on 28-08-23 and the license is only valid until 27-07-24, so I lost 1 month!"
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Modesto Encabo",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T23:41:00.000Z",
          "Titre": "Product shipping and instalación nearly…",
          "Contenu": "Product shipping and instalación nearly perfect"
        },
        {
          "Note": 4,
          "Lieu": "BG",
          "Pseudo": "Grigor G",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T22:59:01.000Z",
          "Titre": "easy dealing with this company ang…",
          "Contenu": "easy dealing with this company ang quality is always good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Smelling good.",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T19:50:13.000Z",
          "Titre": "Fast and easy",
          "Contenu": "Fast and easy.   Key worked as advertised.  I'm assuming the key is OEM; hence the low cost and will only work on the pc it's activated from.  Meaning it's not transferable to another pc or different motherboard in the same pc.  Will buy again from gamers-outlet in the future."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mark Pattenden",
          "Nb_Reviews": 17,
          "Date": "2023-12-21T12:57:49.000Z",
          "Titre": "I used Gamers for a security key which…",
          "Contenu": "I used Gamers for a security key which sadly didn’t work first time around. But after sending an email it was promptly replaced with another. Highly recommended"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Will",
          "Nb_Reviews": 10,
          "Date": "2023-12-21T15:44:05.000Z",
          "Titre": "Always an excellent supplier of keys…",
          "Contenu": "Always an excellent supplier of keys for Windows 10 and the best price too. Will be using your services again probably in the next ten minutes"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mike King",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T12:25:36.000Z",
          "Titre": "Slight electricity account issue.",
          "Contenu": "I had telephoned my meter readings to a call handler. But for some unforeseen reason the number on the electricity account got jacked. I spoke to a Xoliswa this morning who took the correct numbers and corrected my account with ease. She was pleasant and took care of the issue with ease. It was nice to talk to her. Regards"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joshua",
          "Nb_Reviews": 4,
          "Date": "2023-12-17T21:10:09.000Z",
          "Titre": "The easiest key buying process I have…",
          "Contenu": "The easiest key buying process I have been through yet. They don't ask for extensive personal information either. The key arrived instantly and I had windows 11 pro activated seconds after. I will be buying all my windows keys and any other I can find from here, from now on."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Leela Sintho Hartong",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T00:17:43.000Z",
          "Titre": "The code I received did not work",
          "Contenu": "The code I received did not work. I was worried that it was a scam, however they responded to my support ticket within minutes and send me a working code. Very good customer service."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Marcus",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T20:16:43.000Z",
          "Titre": "very quick and great support",
          "Contenu": "After a technical problem I received very quick and great support from these guys and my problem was solved! So I can really recommend this shop and will buy again!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "sha mani",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T09:41:10.000Z",
          "Titre": "They do a rly good job",
          "Contenu": "keys always working. no problems ever, since years nowDunno who's paying hundrets of $ to M$ for license keyswhen you can it here for only some $"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donald Judson",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T21:43:47.000Z",
          "Titre": "Great Place to Buy Keys",
          "Contenu": "Bought the key I needed and within seconds I was given a code that worked immediately. Fantastic service and was able to pay through PayPal just in case something went wrong."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "James Gillan",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T21:34:55.000Z",
          "Titre": "Everything worked as expected",
          "Contenu": "Everything worked as expected. No problems with installation or any other issue. Everything is working as it should with the software. Delighted and would have no hesitation in buying from this seller again.Recommended."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T21:09:59.000Z",
          "Titre": "Good product for good price.",
          "Contenu": "Installing was very easy, had some troubles with the activation of MS office on my computer. Thanks to the superb help of the helpdesk, it was fixed within a few minutes."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Silvia",
          "Nb_Reviews": 12,
          "Date": "2023-12-19T19:48:17.000Z",
          "Titre": "Very good indeed!",
          "Contenu": "They gave me the Key for activate W10 Home on my old PC and it worked very well. Furthermore they helped me in answering to all the questions I put on them during an afternoon time. Really excellent!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "andrew",
          "Nb_Reviews": 4,
          "Date": "2023-12-20T10:44:16.000Z",
          "Titre": "Office 2019",
          "Contenu": "I bought this as I need a license key and I have to say I was not disappointed and will def use them again. The price was soo cheap and the delivery was so quick and instructions was easy to follow."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "PeterA",
          "Nb_Reviews": 4,
          "Date": "2023-12-16T23:45:33.000Z",
          "Titre": "Smooth as Silk",
          "Contenu": "Having had a couple of not-so-great experiences with buying product keys online, I thought I'd give this lot a try. I'm glad I did - the transaction was as smooth as silk, and the product downloaded and installed a-ok. Recommended."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Gregory Monahan",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T05:58:50.000Z",
          "Titre": "Amazingly fast",
          "Contenu": "Amazingly fast, gave me a used key to start, but rectified as soon as I let them know. Will definitely be back for more keys if needed, plus took PayPal which left me with a bit more confidence.Office 2019 for Mac"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Taylor",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T02:18:06.000Z",
          "Titre": "Office 2021 Professional Plus Cd Key Global ISO Download",
          "Contenu": "What I really liked is that the img file downloaded via the gamers-outlet download link had the correct checksum of authentic Microsoft Office 2021 Retail. Also, the product key worked and resulted in activation of Microsoft Office Professional Plus 2021."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Tech User",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T16:12:56.000Z",
          "Titre": "Windows 10 Home activation key",
          "Contenu": "Key arrived straight away and activated with no problems. Will definitely use this company again"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Faye Monahan",
          "Nb_Reviews": 7,
          "Date": "2023-12-19T01:40:33.000Z",
          "Titre": "Digital Key works on MS Office",
          "Contenu": "Great product. I received my MS Office keys right away after buying and they worked! Happy to know these products are available online and they actually work. It has reasonable price too! 5/5"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Francisco Galvan",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T20:27:49.000Z",
          "Titre": "I love this site",
          "Contenu": "I have bought several licenses here, and most of them work like a charm, but a couple of them did not work the customer service was amazing, and quick, and they solved my problem each time, I recommend them 100%, nice job guys, keep this way!I am from Mexico and now I have to use a VPN because the site is restricted here, but I can use it through a VPN."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Russell Seaton",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T00:21:14.000Z",
          "Titre": "Great",
          "Contenu": "Great.  I bought the Office 2021 Key.  Minor problem downloading the software that appears on the product page.  So I contacted Support and they sent another link to download the Office software.  Then bought the Key for $9.74.  Opened Word and it asked to enter the Key.  But you have to read the questions and click on the right boxes.  It also asks if you want 365.  So be sure you get to the Office 2021 one time Key box.  Excel and Word work perfectly.  Happy."
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Gavin Cairns",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T13:12:22.000Z",
          "Titre": "Super quick and simple installation",
          "Contenu": "The speed and ease of installation was remarkable. Had everything downloaded, installed and configured inside of 30 minutes"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kent Lisius",
          "Nb_Reviews": 161,
          "Date": "2023-12-17T04:26:37.000Z",
          "Titre": "They are the best in the West…",
          "Contenu": "They are the best in the West everything is already sold ready to go so I don't even need to mess with anything and the transaction comes with a really nice Adobe PDF receipt that is really easy to read if it comes handy!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr Steve Goodlad",
          "Nb_Reviews": 24,
          "Date": "2023-12-20T17:16:58.000Z",
          "Titre": "fast delivery very pleased with my…",
          "Contenu": "fast delivery very pleased with my purchases  I  have used this company dozens of times and will contimue in the future"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "GARY P",
          "Nb_Reviews": 23,
          "Date": "2023-12-19T17:54:16.000Z",
          "Titre": "Not sure it would work first time, BUT",
          "Contenu": "Not sure it would work first time. but followed the instructions and it installed and authenticated forst time. Excellent price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ed Tsang",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T05:25:34.000Z",
          "Titre": "Great customer support",
          "Contenu": "Received the Win 10 pro key promptly but it failed to activate on my PC. Emailed customer support and received the second key almost immediately. The second key worked and I am a satisfied customer."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Elio Viaggi",
          "Nb_Reviews": 5,
          "Date": "2023-12-18T18:06:33.000Z",
          "Titre": "Everything as Promise!",
          "Contenu": "I bought a license for Office 2021 and as expected I received I link to download the iso image and the instructions regarding the installation. Everything works fine, I don't need any support!"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Jan Beerkens",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T03:03:01.000Z",
          "Titre": "perfect always cheap and working…",
          "Contenu": "perfect always cheap and working always. And good service when something is not working well"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yuriy Leyfman",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T06:59:47.000Z",
          "Titre": "All keys work flawlessly",
          "Contenu": "All keys work flawlessly, and the integration with various software applications is seamless. It's a relief to find a product where all the keys and software work seamlessly together.Another highlight is the customer service provided by the company. They were responsive, helpful, and went above and beyond to ensure I had a seamless experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pankaj Vibhute",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T20:26:21.000Z",
          "Titre": "Just perfect.",
          "Contenu": "Just perfect.. I had an issue with the key I received initially but the support was so great that I got the new working key right in 2 mins after my  requested email."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sa",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T15:56:17.000Z",
          "Titre": "These windows keys are the real deal!",
          "Contenu": "These windows keys are the real deal. Five bucks and change for a Windows 10 key that activates a Digital License?  Can’t beat it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "kay",
          "Nb_Reviews": 7,
          "Date": "2023-12-17T23:19:39.000Z",
          "Titre": "Exactly as advertised",
          "Contenu": "Exactly as advertised. The only qualm is the site asks for a lot of personal info which should make people a little weary but I didn't have any problems with my key (so far). Very happy"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Menini Luca",
          "Nb_Reviews": 5,
          "Date": "2023-12-18T10:53:39.000Z",
          "Titre": "Very fast delivery",
          "Contenu": "I paid the windows 11 pro key and almost instantly I received it! Worked immediately and no problem after about 2 weeks.Great site"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T00:56:21.000Z",
          "Titre": "very good value item",
          "Contenu": "item as described, good pricing, took my time to install and works perfectly, many thanks"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr Z",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T09:19:54.000Z",
          "Titre": "Speedy service",
          "Contenu": "Speedy serviceInstructions were sufficient.Got my app in about 15 minutes.Just what you want from a service like this.Brilliant"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Geeth Luckshan Fernando",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T22:51:41.000Z",
          "Titre": "I just bought windows 10 pro CD key and…",
          "Contenu": "I just bought windows 10 pro CD key and I got a great price And I will buy it again thank you for gamers outlet site"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Peter",
          "Nb_Reviews": 4,
          "Date": "2023-12-17T03:09:27.000Z",
          "Titre": "Key worked flawlessly",
          "Contenu": "Key worked flawlessly after I downloaded an updated component for windows 7, as advised by your agent."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Patrick",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T17:38:38.000Z",
          "Titre": "Easy to buy, good price and fast delivery",
          "Contenu": "Very easy to buy a key (iDeal support), good price en very fast delivery via e-mail. Also instructions about how to use it."
        },
        {
          "Note": 5,
          "Lieu": "EE",
          "Pseudo": "Tõnu Väli",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T20:42:50.000Z",
          "Titre": "I allways find software what I need in…",
          "Contenu": "I allways find software what I need in one place. Games, office software and so. Good prices and zero problems so far. Very recomended place to find what You need. I like it much :)"
        },
        {
          "Note": 5,
          "Lieu": "LT",
          "Pseudo": "Abominable",
          "Nb_Reviews": 3,
          "Date": "2023-12-17T22:29:02.000Z",
          "Titre": "Got my product as soon as I paid",
          "Contenu": "Got my product as soon as I paid, no issues whatsoever, fantastic prices too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Static",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T19:49:15.000Z",
          "Titre": "Easy ordering",
          "Contenu": "Easy ordering. I was skeptical but these guys are legit. Thanks again"
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Cristian C.",
          "Nb_Reviews": 4,
          "Date": "2023-12-20T21:48:02.000Z",
          "Titre": "You are great professionals",
          "Contenu": "You are great professionals! Very kind, patient and helpful !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Logan Ray",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T00:19:05.000Z",
          "Titre": "Perfect!",
          "Contenu": "Perfect!Five minutes, five dollars, and now my Windows 10 Pro is activated (on a laptop I built that had no drive)."
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "George Igglesis",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T11:20:45.000Z",
          "Titre": "Various options to choose and value for money",
          "Contenu": "Easy to navigate and purchase/check-out.Lowest prices.Quick response from customer support."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "JP",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T18:12:59.000Z",
          "Titre": "It is really great and specially fast",
          "Contenu": "It is really great and specially fast, which is very important for us."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Timothy Diemler",
          "Nb_Reviews": 4,
          "Date": "2023-12-20T14:04:58.000Z",
          "Titre": "Everything was as advertised",
          "Contenu": "Everything was as advertised. Great price and much appreciated!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Bay",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T22:03:55.000Z",
          "Titre": "Easy Peasy",
          "Contenu": "Super easy to transact and worked without issues"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "M Elsworth",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T00:45:37.000Z",
          "Titre": "Product Key Works!",
          "Contenu": "I received the product key promptly.  Followed the instructions.  Work perfectly."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Freddy Abendanon",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T17:58:50.000Z",
          "Titre": "They are fast",
          "Contenu": "They are fast and no hassle with installation."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Steve Kallagher",
          "Nb_Reviews": 5,
          "Date": "2023-12-19T19:01:59.000Z",
          "Titre": "Did exactly what it said on the tin",
          "Contenu": "Did exactly what it said on the tin, paid for code and was running Visio pro a minute later. Top notch"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Curt",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:03:05.000Z",
          "Titre": "Just what I wanted and transaction was…",
          "Contenu": "Just what I wanted and transaction was smooth and problem free"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vitor Rocha",
          "Nb_Reviews": 4,
          "Date": "2023-12-19T17:52:51.000Z",
          "Titre": "Definitely recommend",
          "Contenu": "Very easy to buy and super cheap. Quick transaction and easy install as well."
        },
        {
          "Note": 5,
          "Lieu": "LR",
          "Pseudo": "yash dinani",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T10:39:43.000Z",
          "Titre": "I will always refer this website.",
          "Contenu": "This website is very easy to understand!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hema chaurasia",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T20:45:26.000Z",
          "Titre": "Customer service was excellent and responsiv    r reason",
          "Contenu": "for whatever reason, I was not able to download and install the MS Office , but customer service was excellent and responsive, and they refunded my money right away."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Marcin D.",
          "Nb_Reviews": 4,
          "Date": "2023-12-18T19:57:46.000Z",
          "Titre": "Best price on the internet for Windows…",
          "Contenu": "Best price on the internet for Windows 11 key. All work fine. Quick service"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Friend of Ted - Carla",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T17:58:54.000Z",
          "Titre": "À great product",
          "Contenu": "À great product! It easy to install and it works well. It was also very competitively priced!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erik",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T20:50:52.000Z",
          "Titre": "Easy transaction",
          "Contenu": "Easy transaction, I was nervous at first, but the deal was legit and the code worked fine. Price was great too. I would use again."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Abhijit Rana",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T01:18:38.000Z",
          "Titre": "Value for money product",
          "Contenu": "Installation instructions were very clear. I had no problems in installing MS office"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Daniel L'Heureux",
          "Nb_Reviews": 5,
          "Date": "2023-12-17T18:21:03.000Z",
          "Titre": "Perfect Experience !",
          "Contenu": "Safe Paypal Payment. Very Fast Key Delivery By Email. Perfect Experience, Thanks ! :-)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kent Lisius",
          "Nb_Reviews": 161,
          "Date": "2023-12-19T13:54:16.000Z",
          "Titre": "Best Store Ever",
          "Contenu": "They are the best every time I go to them they have the perfect solution for my needs!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Richard",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T20:21:06.000Z",
          "Titre": "Quick and easy to find what I wanted",
          "Contenu": "Quick and easy to find what I wanted, to order and pay, and then to receive the products. They also worked perfectly and have had no problems so far. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Diekkie",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T16:08:29.000Z",
          "Titre": "Overall great!",
          "Contenu": "Good prices, service and customer service 👍🏽Thanks & stay healthy"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Mi",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T22:16:28.000Z",
          "Titre": "The windows 11 pro license is legit."
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "Matthias S.",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T13:31:34.000Z",
          "Titre": "Easy purchase and fully functional",
          "Contenu": "A month ago I purchase Office 2016. It worked instantly and is still working fine."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "IIIRUS_Q",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T19:08:13.000Z",
          "Titre": "Super secure",
          "Contenu": "Super secure Super saver Super faster The best 👌"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Justin Shaw",
          "Nb_Reviews": 19,
          "Date": "2023-12-17T21:06:37.000Z",
          "Titre": "Great Microsoft Office Pro software",
          "Contenu": "Great Microsoft Office Pro software. Easy and brilliant."
        },
        {
          "Note": 5,
          "Lieu": "RS",
          "Pseudo": "Nenad Čučković",
          "Nb_Reviews": 3,
          "Date": "2023-12-17T13:34:14.000Z",
          "Titre": "At first i was suspicious",
          "Contenu": "At first i was suspicious, but i tried and this was amazing experience...."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "RACHID BELKADI",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T20:59:06.000Z",
          "Titre": "Installation and activation in 5…",
          "Contenu": "Installation and activation in 5 minutes without any problem. Very satisfied with my purchase and will recommend it to anyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J H",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T21:02:15.000Z",
          "Titre": "Key was legit and came via email…",
          "Contenu": "Key was legit and came via email immediately."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Giuseppe Nicolosi",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T19:27:54.000Z",
          "Titre": "I was sceptical about the service",
          "Contenu": "I was sceptical about the service. Everything was OK so 5 stars. Very good service at the best price"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Curritodelacroix",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T08:46:13.000Z",
          "Titre": "Windows 11 pro",
          "Contenu": "Enviaron la clave rápidamente y sin problemas se realiza la instalación a la primera"
        },
        {
          "Note": 5,
          "Lieu": "RS",
          "Pseudo": "igor klajn",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T01:04:42.000Z",
          "Titre": "All the keys were corect and even i…",
          "Contenu": "All the keys were corect and even i made a mistake first time, you helped me to solv that very quickly."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "jason  dees",
          "Nb_Reviews": 5,
          "Date": "2023-12-18T18:55:30.000Z",
          "Titre": "Excellent",
          "Contenu": "Excellent, received code asap will use again"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Giammarco Vignali",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T09:42:03.000Z",
          "Titre": "Instant support",
          "Contenu": "Instant support, true products, great site!"
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "Alexandros Tsolakidis",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T16:30:13.000Z",
          "Titre": "Excellent choice....!!!",
          "Contenu": "Excellent choice....!!!Very quick, very easy...!!!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Richard Renshaw",
          "Nb_Reviews": 5,
          "Date": "2023-12-18T16:34:17.000Z",
          "Titre": "Win 11 Pro and office",
          "Contenu": "Bought the keys for win 11 Pro and office.  Installed and done quickly no issues."
        },
        {
          "Note": 5,
          "Lieu": "HR",
          "Pseudo": "DK",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T16:11:30.000Z",
          "Titre": "Recommended!",
          "Contenu": "Fast, instructive and no problems at all - 10/10!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mat Wirsch",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T16:33:11.000Z",
          "Titre": "Very fast email delivery",
          "Contenu": "Very fast email delivery, at a very reasonable price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T07:23:34.000Z",
          "Titre": "For Real!",
          "Contenu": "Ordered and received code. Entered code and worked perfectly. What more could you axe for!"
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "José Gama Rodrigues",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T20:17:12.000Z",
          "Titre": "Easy and quick transaction."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Erik",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T08:38:43.000Z",
          "Titre": "Very good prices aVery good prices and extremely fast service!nd extremely fast…",
          "Contenu": "Very good prices and extremely fast service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "EnergizerBunny",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T15:39:29.000Z",
          "Titre": "1st purchase",
          "Contenu": "1st purchase, will be back again for sure. Got my key quick and had no issues.Thanks"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Rachel Quarmby",
          "Nb_Reviews": 7,
          "Date": "2023-12-19T21:59:11.000Z",
          "Titre": "Brilliant purchase",
          "Contenu": "Brilliant purchase. Worked fine. Really cheap. Would use again."
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "Avital Gonen",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T21:56:30.000Z",
          "Titre": "Thumbs up!",
          "Contenu": "Fast, easy to use, and en attractive price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JWC_Saiyan",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T03:08:34.000Z",
          "Titre": "It was very useful to me to find a good…",
          "Contenu": "It was very useful to me to find a good deal for my window key."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "CRAIG ONEILL",
          "Nb_Reviews": 13,
          "Date": "2023-12-17T23:24:51.000Z",
          "Titre": "Excellent service",
          "Contenu": "Instant after purchasing thanks so much"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leroy",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T05:21:18.000Z",
          "Titre": "Helped out download for computer novice"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "ADRIAN EAVES",
          "Nb_Reviews": 4,
          "Date": "2023-12-19T19:08:31.000Z",
          "Titre": "Very easy transaction will use them…",
          "Contenu": "Very easy transaction will use them again"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Millan Salvador",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T00:51:54.000Z",
          "Titre": "I am really Happy whith my shopping",
          "Contenu": "I am really Happy whith my shopping. Thankyou."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "John van Zijl",
          "Nb_Reviews": 5,
          "Date": "2023-12-19T20:34:24.000Z",
          "Titre": "No fuss",
          "Contenu": "No fuss, fast, accurate"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lawrence Cantlin",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T21:39:24.000Z",
          "Titre": "Installation was simple and quick",
          "Contenu": "Installation was simple and quick.  The link for the DVD .img was speedy."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Robert  Fischer;",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T20:01:51.000Z",
          "Titre": "Good shop",
          "Contenu": "Good shop, fast delivery worked as expected!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Geoff Smith",
          "Nb_Reviews": 4,
          "Date": "2023-12-18T00:48:12.000Z",
          "Titre": "Service and price was great and the key…",
          "Contenu": "Service and price was great and the key worked without issue."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Arne",
          "Nb_Reviews": 14,
          "Date": "2023-12-18T19:17:37.000Z",
          "Titre": "TOP!",
          "Contenu": "Fast, without problems, Work Perfect. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "M G G",
          "Nb_Reviews": 10,
          "Date": "2023-12-17T20:16:35.000Z",
          "Titre": "Dam Good Service",
          "Contenu": "Brilliant fare play, easy to find, simple to buy , very quick process. Just the job."
        },
        {
          "Note": 5,
          "Lieu": "HR",
          "Pseudo": "Zdenko",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T16:27:43.000Z",
          "Titre": "Satisfied",
          "Contenu": "Working as is describer."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "J. G.",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T15:49:55.000Z",
          "Titre": "Everything was great",
          "Contenu": "Everything was great. Key was instantly delivered and worked like a charm."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jeff",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T22:29:56.000Z",
          "Titre": "Well the first key didn't work but the…",
          "Contenu": "Well the first key didn't work but the second did.Good support!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Michael Velasquez",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T08:05:47.000Z",
          "Titre": "Trustworthy and got my key that worked…",
          "Contenu": "Trustworthy and got my key that worked straight away!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Paul Read",
          "Nb_Reviews": 25,
          "Date": "2023-12-21T16:03:04.000Z",
          "Titre": "Gr8 service"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "M  Udin",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T20:02:14.000Z",
          "Titre": "Good experience",
          "Contenu": "I was a bit reluctant at first. But the email was quick. And the key worked."
        }
      ]
    }
  ]
}