{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.getnomad.app",
      "Review": [
        {
          "Note": 1,
          "Lieu": "TH",
          "Pseudo": "Mitch Blando",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T02:37:51.000Z",
          "Titre": "I bought an APAC bundle data",
          "Contenu": "I bought an APAC bundle data, esim installed properly and all but not working at all. Contacted customer service and just recieved an automated message and never reply to me at all. Waste of money. I requested a refund but still they didnt bother to email me back."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "خالد عبدالكريم سليم ع",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T07:35:38.000Z",
          "Titre": "The esim doesn't offer any interet only…",
          "Contenu": "The esim doesn't offer any interet only signal nd I have bought another one with 10G and the same problemWelcome! Thank you for installing our Nomad eSIM. Remember to enable Data Roaming for this line when you're ready to use it. (1/2)For assistance, access our Help center (requiring an active Wi-Fi or data connection.Enjoy your eSIM experience! (2/2)Those the details of the second one please I need a solution and financial compensation for the first and the second one"
        },
        {
          "Note": 1,
          "Lieu": "BR",
          "Pseudo": "Debyday",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T19:07:48.000Z",
          "Titre": "Very very very bad service. 10USD thrown in the wastebasket",
          "Contenu": "Very very  very bad service.Never 4GSometimes 3GAlways unstable signal"
        },
        {
          "Note": 1,
          "Lieu": "HK",
          "Pseudo": "Samantha La Carrubba",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T01:11:18.000Z",
          "Titre": "If I would give zero stars I would",
          "Contenu": "If I would give zero stars I would. No towels or bedding besides the sheets. Also the filters need to be changed and there was mold in the light fixtures"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "LUKE",
          "Nb_Reviews": 3,
          "Date": "2023-11-06T00:42:37.000Z",
          "Titre": "Don’t use in Thailand",
          "Contenu": "Don’t use in Thailand. They completely outsource it to another company and don’t get involved at all. I ended up racking up a bill because I was unaware my data plan that I paid nomad for had finished (nomad never informed me of this). When complaining I just got really bad answers from customer service that I should be contacting another company  (seems a bit ridiculous as I had paid Nomad for their services)- super unhelpful and won’t use again.  Cheers!"
        },
        {
          "Note": 1,
          "Lieu": "JO",
          "Pseudo": "Mu'men Hussin Mahbuobeh",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T13:15:57.000Z",
          "Titre": "C application and a dishonest company…",
          "Contenu": "C application and a dishonest company asking you for strange information. A SIM card was purchased hours ago and it has not arrived yet. This is the biggest failure. 😡😡😡"
        },
        {
          "Note": 1,
          "Lieu": "SG",
          "Pseudo": "wee sin tan",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T10:49:13.000Z",
          "Titre": "The lack of a local Korea handphone…",
          "Contenu": "The lack of a local Korea handphone number made it impossible to download and access localised app such as Kakao taxi. This affected my overall experience and I would advise travellers to Seoul from using your service."
        },
        {
          "Note": 1,
          "Lieu": "LA",
          "Pseudo": "Caitlin C",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T09:07:02.000Z",
          "Titre": "Difficult to install",
          "Contenu": "Difficult to install, terrible connection. Bought a real sim in laos and it worked so much better. Wouldn't recommend. Very expensive for the amount of data I bought (1gb a day for 8 us), bought a sim with more data for drastically less money. Don't waste your time."
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Marianne Albertsen",
          "Nb_Reviews": 3,
          "Date": "2023-12-05T08:17:00.000Z",
          "Titre": "Too meny Strange programs to accept",
          "Contenu": "Too meny Strange programs to accept. Too much time to g’et it workDon’t vant ever to ude it againLost al my moneyThink it is unacceble"
        },
        {
          "Note": 1,
          "Lieu": "TH",
          "Pseudo": "Valerie Lim",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T14:41:40.000Z",
          "Titre": "Very slow internet, waste money",
          "Contenu": "I had really slow internet connectivity, even in major cities like Bangkok. It took 6-10 seconds to load every single webpage or google maps location, which is extremely frustrating when you're a traveler trying to navigate in a new place. The FAQs and instructions were not helpful either. Meanwhile my friend who bought a local SIM card had fast internet. I should have done that too."
        },
        {
          "Note": 1,
          "Lieu": "SG",
          "Pseudo": "lim huiting",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T08:09:18.000Z",
          "Titre": "There is no provision of a korean HP…",
          "Contenu": "There is no provision of a korean HP number, this makes it tough to use their local app like kakao taxi."
        },
        {
          "Note": 1,
          "Lieu": "DO",
          "Pseudo": "carla",
          "Nb_Reviews": 4,
          "Date": "2023-09-02T20:31:54.000Z",
          "Titre": "It was literally a waste of my money",
          "Contenu": "The app and the E-sim were a complete disaster, travelling around Europe, it eventually worked, less than 20% of the time, but the rest of the time I had forced to pay roaming from my local mobile phone company (ATT USA), Their customer service is just a Q&A and they definitely haven't something to change, the system doesn't work. It worked in London for 1 day of 3, It didn't work in Amsterdam, Cambridge, Belgium. It worked fine in Paris, but it didn't work at all in Berlin, Vienne and Budapest. Almost a month, is it worked 6 days? maybe it too much to say."
        },
        {
          "Note": 1,
          "Lieu": "HR",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T14:28:06.000Z",
          "Titre": "Awful customer service",
          "Contenu": "I bought a sim which hasn’t worked, I’ve tried to troubleshoot myself using all the online articles and received zero help from the customer support - which has taken 2 days to get a response all of which are we will look into this and let you know. Then no one responds. There is no line to call just a chat no one responds to, would never use this service it’s a complete waste of time"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Eleise",
          "Nb_Reviews": 4,
          "Date": "2023-08-23T13:18:39.000Z",
          "Titre": "If I could select Zero I would",
          "Contenu": "If I could select Zero I would. I had no issues purchasing the esim and downloading the app and then downloading the esim BUT activating it was as frustrating as anything I’ve ever done. I’ve used esims before. Customer service - what a joke! Waiting for ages for them to respond with a comment that was obviously cookie cutter and they hadn’t read my initial comment. Troubleshooting instructions didn’t help and I’m no dummy. Wasted so much time and gave up. Decided to go with another provider. Tomorrow is the deadline for activation so I’ve blown my $22 for 10g of data. My time is worth a whole lot more"
        },
        {
          "Note": 1,
          "Lieu": "BM",
          "Pseudo": "Chakhan Marques",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T21:26:38.000Z",
          "Titre": "My data lasted only for 3 days this…",
          "Contenu": "My data lasted only for 3 days this time.  I was disappointed as I paid for 7 days of data.  I will try another app next time."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Maksym K",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T10:38:20.000Z",
          "Titre": "Good price but it does do the job",
          "Contenu": "The purchase process went more or less smoothly. Got Australia 20Gb eSIM which was Truphone and was using a Vodafone network. Compared to other eSIM I was purchasing in other countries, this one often gave me \"Emergency calls only\" and \"No service\" errors when trying to use this card for data. Amaysim on Optus provided me with better connection and reliability."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Freedman",
          "Nb_Reviews": 2,
          "Date": "2023-06-14T16:53:07.000Z",
          "Titre": "I used Nomad in April in Berlin and it…",
          "Contenu": "I used Nomad in April in Berlin and it worked flawlessly. This week I am in Bergen Norway and it is impossible to connect via Nomad. The only way I can get online is using mr Verizon travel plan which is costing me $10/day on top of the wasted $33 I spent on Nomad. Very disappointing. I had recommended Nomad to several other people who travel internationally but will no longer do so."
        },
        {
          "Note": 1,
          "Lieu": "AE",
          "Pseudo": "Neven Gordić",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T16:01:10.000Z",
          "Titre": "Browsing web was fine but each time I…",
          "Contenu": "Browsing web was fine but each time I tried to download an app it wasn't possible, it said it would take 17h for a 50Mb app."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Margaret",
          "Nb_Reviews": 36,
          "Date": "2023-08-28T08:49:26.000Z",
          "Titre": "Charged twice for 1 plan, Nomad refuse to help",
          "Contenu": "I ordered a 45 day, 20GB APAC e-sim for $26. Nomad charged me twice on paypal and when i notified them of this they claimed they could not help me, despite me providing screenshots of the transactionas from my paypal account.I have now raised a dispute with paypal which Nomad have ignored, so awaiting a refund once paypal rule in my favour. Very poor service indeed, it seems they are incapable or unwilling to fix their mistake.*Edit*Just to clarify they only rectified their mistake after I disputed it on paypal. Their reply to this suggests they sorted this issue out themselves - they did not. They were completely unable to help me for 4 days, then magically after a paypal dispute they were able to help me - funny that."
        },
        {
          "Note": 1,
          "Lieu": "GR",
          "Pseudo": "Claude Préville",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T18:19:46.000Z",
          "Titre": "Noting was working in rodos",
          "Contenu": "Noting was working in rodos, Grece today and for the last few days. Tried everything, not even able to reach the customer service with full bars+GR…My wife with a e-sim from Vodafone was having no problems."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Chris Ring",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T12:16:02.000Z",
          "Titre": "Terrible experience",
          "Contenu": "Unclear directions on website and via staff. American format instructions that do not match UK phones. QR code reading that did not work. Difficult manual loading with very long codes. Even when we did get the system working (on a multi country trip) we could not use it. Total waste of money."
        },
        {
          "Note": 1,
          "Lieu": "AT",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T12:00:37.000Z",
          "Titre": "Really unreliable service in EU",
          "Contenu": "Really unreliable service in EU. Frustrating to have to work with customer service on troubleshooting every few days. I would have preferred being given a new eSIM or something else instead of texting, calling, and trying to fix something that shouldn't have been giving problems. My requests for a new eSIM were largely ignored .I went with a different provider. It's been much better since making the move."
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Linnea Herbaek",
          "Nb_Reviews": 15,
          "Date": "2023-09-12T11:23:11.000Z",
          "Titre": "It does not work in Bali!",
          "Contenu": "It does not work in Bali!I have spend the past two hours trying to get their esim to work. However the internet connection does not work! I tried to get help from support, however they just keep asking me to restart my phone… which does not work! So I wasted my money…DO NOT USE THIS COMPANY FOR INTERNET IN INDONESIA!"
        },
        {
          "Note": 1,
          "Lieu": "BG",
          "Pseudo": "Zalden N",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T20:58:03.000Z",
          "Titre": "Support is so bad",
          "Contenu": "Support can not answer in 24 hrs, total waste. I need to use my card cuz plan is not activated, but I can not reach the support, poor service :("
        },
        {
          "Note": 1,
          "Lieu": "SG",
          "Pseudo": "Harry C",
          "Nb_Reviews": 2,
          "Date": "2023-07-08T02:06:10.000Z",
          "Titre": "From Great to Zero on Same Trip",
          "Contenu": "I tried Nomad for the first time on my current trip to Asia - Singapore, Taipei, and Hong Kong. My experience in Singapore was worthy of 5 stars. Nomad worked like a charm as soon as I left Changi Airport and that flawless service endured for the entire week in Singapore. However, Taipei service was spotty to non-existent and I was forced to turn on my Verizon cellular service. I noticed that Verizon and Nomad used the same local carrier, so I have no clue why Nomad’s eSIM didn’t work. I followed the recommendations to turn Airplane mode on and off, reboot my phone, etc., and finally gave up and just stayed with my Verizon plan. I landed in Hong Kong yesterday and the same thing happened. I got service for about five minutes, then completely failed, so it looks like my experiment with Nomad is a one-and-done."
        },
        {
          "Note": 1,
          "Lieu": "BE",
          "Pseudo": "Alejandro Del Valle",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T15:47:55.000Z",
          "Titre": "I hired a service on my Trip to Sri…",
          "Contenu": "I hired a service on my Trip to Sri Lanka and I pay without having any internet connection for three weeks. I ended buying a SIM card locally because it was impossible to connect. You should update your services because it is not nice that you offer it and it does not work...."
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-06-18T10:54:58.000Z",
          "Titre": "Getting initially connected to a…",
          "Contenu": "Getting initially connected to a network took days.  Nomad customer service was only available via email; no live chat possible. So I was left sending/receiving multiple emails attaching multiple screenshots.  Due to multiple time zone difference between me and Nomad customer service, I couldn’t always get usable information promptly.  CS suggested multiple local networks that never appeared as options on my phone.  I chose to pursue my vacation rather than wait for customer service response after every CS suggestion. Nomad needs 24/7 live chat support.  Join the 21st Century."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Panos",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T18:16:37.000Z",
          "Titre": "Coverage was very bad with multiple disruptions",
          "Contenu": "Coverage was very bad. I used this service in Japan in multiple cities. Even in Tokyo, I kept get getting disruptions. Randomly it we would lose signal and we had to wait for it to start up again. Another friend used the same service and noted the same problems. In the bullet train it was painstakingly slow to load a simple website.One of my friends had a normal Japanese SIM and another had a US sim and they had no disruptions and perfect coverage everywhere we went. I recommend buying an eSIM from a service provider in the country you are visiting."
        },
        {
          "Note": 1,
          "Lieu": "HK",
          "Pseudo": "Chiara",
          "Nb_Reviews": 1,
          "Date": "2023-09-17T04:59:53.000Z",
          "Titre": "There might be better companies",
          "Contenu": "One of the more affordable eSIMs in Sri Lanka. Unfortunately, we had a lot of trouble with it. Oftentimes, the data was very slow or did not work at all. It just was not very reliable and I had trouble hotspotting my partner."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kenneth  Douglas",
          "Nb_Reviews": 1,
          "Date": "2023-06-18T12:31:11.000Z",
          "Titre": "Very disappointing",
          "Contenu": "Very disappointing Esim installed per directions, but could not get useful data connection.Ended up turning your off and using the Verizon travel plan which will cost me substantially more.Had seen you in NY Times and was expecting a much better experience."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T10:49:46.000Z",
          "Titre": "Internet speed very slow"
        },
        {
          "Note": 1,
          "Lieu": "SE",
          "Pseudo": "Volkan Uzun",
          "Nb_Reviews": 1,
          "Date": "2023-07-30T02:24:06.000Z",
          "Titre": "It logs you out so often and guess what…",
          "Contenu": "It logs you out so often and guess what you need internet to login.  Basically you need internet from somewhere else multiple times a day to use internet. In most part of London it is extremely slow"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "M Durham",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T06:13:43.000Z",
          "Titre": "Worst internet ever",
          "Contenu": "Worst internet ever - I have been travelling through fairly popular tourist areas (Rome, Naples, Berlin) and the internet speed has been at best very slow and at worst non-existent, dropping out entirely for no reason at all or appearing to give one or zero bars when my native sim (inactive for data roaming) is giving full reception. Have wasted so much time trying to use very basic functions on the internet with this terrible reception. Would not recommend. Even if you get a relatively large data pack (20GB in my case) there is just no way you could ever use it up with these slow speeds and bad reception."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "WeisGuy",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T22:02:30.000Z",
          "Titre": "Hard to activate, or just doesnt work.",
          "Contenu": "I bought the e-sim and followed the instructions.  It did not work.  Their process is not simple with the QR code to activate, unfortunately.  I think that is how it got sideways, but perhaps it just does not work well.  I am not a novice to e-sim, I have done it before and use a dual sim for travel several times a year.  I was just up for trying a different e-sim company unique to the country I was visiting.  I really wanted this to work, but unfortunately I put money down the drain."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Unhappy",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T10:39:25.000Z",
          "Titre": "Do not trust their “unlimited” offers",
          "Contenu": "I’ve used their normal eSIM offerings successfully in the past but would *never* trust one of their “unlimited” eSIM deals again after today. The eSIM kept disconnecting, and when it was connected it never got 5G connection speed even when it was available. Basically “unlimited” appears to be severely limited at their end by having such a rubbish flaky connection that you’ll be forced to use another internet connection (as indeed I’m using to write this review).  Will never trust again :("
        },
        {
          "Note": 1,
          "Lieu": "BG",
          "Pseudo": "Nikolay Shilev",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T09:26:54.000Z",
          "Titre": "the plans with iphone 14 pro in Turkey…",
          "Contenu": "the plans with iphone 14 pro in Turkey snd China were not installing properly, issues with PDP authorization, and not able to activate Turkish plan. The Nomad installation giude is not for the menus in thus phoneI was not able to use my plan for Turkey on 22nd of May"
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "Moshe Feldman",
          "Nb_Reviews": 5,
          "Date": "2023-07-04T14:08:37.000Z",
          "Titre": "I bought 2 e-sims using the internet on…",
          "Contenu": "I bought 2 e-sims using the internet on my laptop, associated with my email.  The first 30 day one was meant for me and the 7 day one for my son.  I was able to get mine to work, but my son's worked only in Slovenia but not in Croatia (we were in Croatia the beginning and end of our trip)"
        },
        {
          "Note": 1,
          "Lieu": "RS",
          "Pseudo": "Al",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T14:00:11.000Z",
          "Titre": "Charged twice",
          "Contenu": "I bought a serbian sim with data package (1gb) for 7.50, and I was charged TWICE for a total of 15 euros. There seems to have been some kind of mistake, I only selected 1gb for 7.50, but two payments of 7.50 appeared in my paypal transactions, and I effectively paid twice for one data package."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "PA",
          "Nb_Reviews": 2,
          "Date": "2023-06-20T12:20:29.000Z",
          "Titre": "Wasn\"t able to connect in Mexico",
          "Contenu": "Wasn\"t able to connect in Mexico. What a waste of money! Help documentation  was nonexistent and you had to call for support. How the heck can you call if you can't connect and no wifi was available? As soon as I did have wifi, I bought my old standard, a competitor, and it worked instantly."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Fez",
          "Nb_Reviews": 3,
          "Date": "2023-10-04T13:38:08.000Z",
          "Titre": "Simple but not affective",
          "Contenu": "This is for sharm Egypt Internet Speed very very slow and it fails to connect in a lot of places Simple to purchase simple to set up but simply not upto scratch in sharmMay work better in other locations"
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "Anat",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T11:52:30.000Z",
          "Titre": "Bad experience",
          "Contenu": "I had two packs-1 GB, 3 GB. The forst (3) wasnable to start, when I landed in Greece. It took few houra to start to work. After 2 GB approximately, the pack started to slow it's work... and I almost had no ability to use the internet. I had no ability to add GB, and in order to use to use the internet, I bought a new pack,which did not work for a wholesale day."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Andrew Rahman",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T10:50:43.000Z",
          "Titre": "Phone always shows you’re in Hong Kong",
          "Contenu": "This was my first experience with an eSIM and unfortunately it was not great. In New York City it worked quite well, seemingly without issue, but as soon as we left NYC our phones kept telling us we were in Hong Kong. We couldn’t use TikTok, prices would show up in Hong Kong Yuen, several sites wouldn’t provide us access saying they were not providing access to Hong Kong. While the data was working relatively consistently in major cities, as soon as we exited a major metropolitan area the speed and quality of the connection dropped drastically, sometimes not working at all. For about 80% of the trip our iMessage was not working. Unsure why but it seemed to be related to the Hong Kong aspect mentioned above. We were also unable to message each other with iMessage the entire time after we left NYC (21 days) and had to use other solutions. Lastly, and this is simply a reminder to myself and word of caution to other travelers, we opted to only get a data plan without a phone number to save money and that was a mistake. We NEEDED to call places several times and simply couldn’t, which caused delays and complications on our trip. So, unfortunately I cannot recommend this service."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Oakley Smith",
          "Nb_Reviews": 1,
          "Date": "2023-06-25T22:25:35.000Z",
          "Titre": "Unfortunately I wasn’t able to connect…",
          "Contenu": "Unfortunately I wasn’t able to connect either phone or data. I had to fall back on my canadian service provider who charges $15CDN/day for roaming!"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "drlilley",
          "Nb_Reviews": 2,
          "Date": "2022-07-19T20:59:54.000Z",
          "Titre": "Hopeless in France",
          "Contenu": "App might be OK but the connectivity and service in France was hopeless and the technical support very limited. Kept being told to perform the same setting change. In the end gave up and went with a competitor which proved to be faultless."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Rebecca",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T11:56:38.000Z",
          "Titre": "A waste of time and money",
          "Contenu": "Crap app, no way to tell you you’ve used up data until it’s cut off and you’re stranded overseas with no way to get in touch. Biggest mistake of my holiday was using Nomad. Make sure to get a phone call plan as 2FA is used everywhere these days"
        },
        {
          "Note": 1,
          "Lieu": "RO",
          "Pseudo": "Sorin Munteanu",
          "Nb_Reviews": 3,
          "Date": "2023-06-19T20:10:56.000Z",
          "Titre": "Could not activate SIMs",
          "Contenu": "Could not activate SIM. Tried to stop the transaction and accidentally bought a second one. Could not activate that either. Would appreciate a refund as I didn't use either. And I really needed one."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shane Bracewell",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T21:43:54.000Z",
          "Titre": "I could not get the esim to work",
          "Contenu": "I could not get the esim to work, despite trying everything.  I reluctantly had to resort to using my Rogers roam like home. I used an airalo esim for a previous trip to the USA in May and it worked perfectly. I would not use nomad again after this trip.  Sorry."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rebecca V",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T23:33:51.000Z",
          "Titre": "The set up instructions were unclear",
          "Contenu": "The set up instructions were unclear. Had trouble setting up after reaching destination in Europe. Once activated service worked well, but almost gave up activation out of frustration"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Niv Sharon",
          "Nb_Reviews": 3,
          "Date": "2023-05-16T13:13:47.000Z",
          "Titre": "THAT WAS BAD, VERY BAD!!!!!!",
          "Contenu": "well it was paying for a service that activated when I was here in Australia.so....I will recommend to STAY AWAY from this service, because they will blame the customer for their failure, just terrible service!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "JP",
          "Pseudo": "T Demir",
          "Nb_Reviews": 12,
          "Date": "2023-11-05T19:05:09.000Z",
          "Titre": "The speed slows down to 0.5mbit after…",
          "Contenu": "The speed slows down to 0.5mbit after using 2GB data, I paid 36 USD for 10 days of UNLIMITED DATA. 36 USD IS A LOT FOR WHAT YOU PROVIDE! YOU THIEVES! LAST TIME I AM GOING TO USE YOUR SERVICE!"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Jon Fearnley",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T22:24:57.000Z",
          "Titre": "Failure to connect.",
          "Contenu": "I was unable to connect or use your product despite wasting a lot of time. For me it was an absolute waste of money. If I had the time I'd try to get a refund, but I've already wasted enough time on it. The one star is because you were good enough to seek my feedback."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Patrick De Rooij",
          "Nb_Reviews": 6,
          "Date": "2023-08-04T10:34:26.000Z",
          "Titre": "Difficult to activate en poor service.",
          "Contenu": "If you can manage to activate the e-sim, it works great. Activation was a problem and the service was very poor. Actually I didn’t get an answer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Fatamorgana",
          "Nb_Reviews": 11,
          "Date": "2023-02-25T11:49:24.000Z",
          "Titre": "SCAM once they got your money, they don’t care",
          "Contenu": "I bought one of their more expensive plans and my phone smashed a couple of days after. I contacted them to transfer the sim to my new phone and they said it’s not possible. I tried using my old phone as a hotspot and it wasn’t working anymore either. Zero help from their support, they just don’t care about the customer once they get their money. Basically lost all my money (their plans are not cheap!) couldn’t use the old phone (after attempt to transfer), the new phone, or the old as a hotspot. Seriously, what kind of sham is this? It’s an e-sim, how hard can it be to transfer? They literally have that option listed in the app but it’s total bs!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Martin",
          "Nb_Reviews": 2,
          "Date": "2023-10-08T09:53:56.000Z",
          "Titre": "5G not available",
          "Contenu": "Installing the eSIM was OK… it could be easier.PLEASE GIMME THE OPTION TO SELECT A 5G CONTRACT!!!"
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Gerhard Reich",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T16:29:31.000Z",
          "Titre": "Too complicated to install",
          "Contenu": "Too complicated to installMore than triple price if SIM cardI ended up buying a SIM card in Spain and it worked within minutesJust do you know: I pate 10€ for 30GTime inbox loved was much less that the hour I spent with your customer service rep to finally install my esim"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dalton",
          "Nb_Reviews": 3,
          "Date": "2023-05-15T11:54:33.000Z",
          "Titre": "“Not activated”",
          "Contenu": "ESIM worked, but website and app were showing “not activated”. This prevented me from seeing the data usage and prevented me from being able to add more data."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Rajiv Bhasin",
          "Nb_Reviews": 2,
          "Date": "2023-07-01T11:43:18.000Z",
          "Titre": "Very disappointed",
          "Contenu": "Very disappointed, the eSIM didn't work even for day for me tried few times in Florence, Tuscany and Amalfi Coast. I don't want deal with co and just deleted the app."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Leonardo  Salgado",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T19:00:14.000Z",
          "Titre": "The signal simply don’t work",
          "Contenu": "The signal simply don’t work . I paid for nothing"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steven Sklar",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T15:21:22.000Z",
          "Titre": "Did NOT work",
          "Contenu": "Did NOT work.  Managed to block my other internet connections and nothing else so had no internet except with hotel or other WI-FI!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Nicole Macqueen",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T10:25:47.000Z",
          "Titre": "Could not get the sim to work",
          "Contenu": "Could not get the sim to work, had to buy another one with a different company. These sims can be/are tricky  my solution is to buy low value sims and top up as needed. If one doesn’t work, it’s less painful"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Richard Brazeau",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T15:03:32.000Z",
          "Titre": "Major disapointment",
          "Contenu": "Nomad Service in puerto Vallarta was absolutely terrrible. Ended up buying a local sim.  Really defeats the purpose of esim."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Kevin O'Neill",
          "Nb_Reviews": 2,
          "Date": "2023-07-25T00:26:35.000Z",
          "Titre": "It isn't working and I keep getting…",
          "Contenu": "It isn't working and I keep getting roaming charges from my provider back home.Nomad messaged me below and told me to contact them for more investigation.  I emailed them with more detail and they replied 5 days later offering me $3 off my next purchase.  Hopefully that isn't all of the compensation they will offer.  As the roaming fees I was hit with were a lot more than $3.  This is on top of the $65 I paid intially.Update, the below response from nomad had some false information.1.  They never mentioned anything about a refund in an email to me.  (They have given me a refund now).  Hard for me to respond for a refund when they didn't offer.2. Nomad had asked me to email the support with my order number to investigate, that is what I did, so that is sending a ticket in my opinion.  If there was some other way for me to submit a ticket, nomad never provided that information to me in the reply.It seems nomad is trying to make it look like I didn't contact them correctly, and that I didn't respond to a question when in fact, I did what they asked in emailing about the issue, and they never asked me about getting a refund when they sent me the $3 off next purchase email.Pretty poor customer service in my opinion."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "PV",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T17:27:13.000Z",
          "Titre": "Hard to install and understand",
          "Contenu": "Hard to install and understand. Never worked well. Really, a waste of time and money. Maybe this is a technology that hasn’t quite been perfected…."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marie",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T18:33:42.000Z",
          "Titre": "no signal most of the time",
          "Contenu": "I used the Italy plan in Feb 2023 and got no problem, very smooth and fast. Later we bought 30 EU countries  plan in Apr 2023, and got no data or very slow in Barcelona most of the time during the Italy, Spain and France trip. Ended up purchasing a short term SIM card there. A whole waste!"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Sally",
          "Nb_Reviews": 6,
          "Date": "2023-06-18T07:21:23.000Z",
          "Titre": "Not the best connection wise in Croatia",
          "Contenu": "I’m in Croatia and the connection is very slow - takes a while to open pages/links. I’m struggling with webpages taking forever to open. Purchased nomad as was cheapest - would not use again. On a positive - was easy to install"
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "Ronen Givon",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T16:12:53.000Z",
          "Titre": "Very dufficult to initiate the service",
          "Contenu": "It took a few hours until, with the help of customer service, I was able to use the service.A few times a day the service dropped from 5G to E. When I noticed, I had to change to Flight Mode and back (Which restored the service)."
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "Noah",
          "Nb_Reviews": 2,
          "Date": "2023-06-20T18:34:50.000Z",
          "Titre": "The last two times I used this app",
          "Contenu": "The last two times I used this app, the internet didn't work properly and I had to deal with it all the time. It sucks, I probably won't use this service anymore"
        },
        {
          "Note": 1,
          "Lieu": "JE",
          "Pseudo": "Romano  Pezzali",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T07:26:31.000Z",
          "Titre": "I didn’t know how to us it",
          "Contenu": "I didn’t know how to us it I have tried to call and text but didn’t worked It seams I had to be connected to internet So I haven’t used my allocations that I did buy Any suggestions Regards Romano"
        },
        {
          "Note": 1,
          "Lieu": "JP",
          "Pseudo": "Paul Posada",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T12:29:43.000Z",
          "Titre": "It doesn’t work !!!",
          "Contenu": "The esom cars installation is very complicated and even do I was able after many trials to activate the sim  it still doesn’t work …"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thomas Gaudreault",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T17:26:52.000Z",
          "Titre": "Not a good experience",
          "Contenu": "really difficult to set up at first and the esim is from hong kong so no tiktok while esim is activatedlte very slow"
        },
        {
          "Note": 1,
          "Lieu": "GR",
          "Pseudo": "nathalie",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T20:57:43.000Z",
          "Titre": "Very bad esim card",
          "Contenu": "Very bad esim card. The esim card doesn’t work. Try all the troubleshooting tips, nothing works. I wrote to nomad, never had an answer. Do not recommend"
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "Marisa",
          "Nb_Reviews": 8,
          "Date": "2023-08-21T10:20:10.000Z",
          "Titre": "Card expired unexpectedly and no assistance",
          "Contenu": "My card expired 13 days from the day I bought It and not after 30 days as it was written in the mail. So I had no data when I still was abroad and I spent 40€ to use 8GB instead of 10. I contacted Nomad but no answer"
        },
        {
          "Note": 1,
          "Lieu": "BE",
          "Pseudo": "Manyin Wang",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T18:54:53.000Z",
          "Titre": "Really sucks",
          "Contenu": "Really sucks. I buy add-on data before I run off current data and it says will auto use the add-on data. When I walk around in a foreign city the data run off and it needs connect wifi to active add-on data. What shall I do? I have nothing to do in a stranger city. Cant even use google map. It sucks."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "MM",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T00:28:06.000Z",
          "Titre": "The esim kicked me off the cellular…",
          "Contenu": "The esim kicked me off the cellular plan. We were using a usa sim card for gps and travel in the us. Middle of the night in Missouri, kicked us off in the middle of nowhere at a rest stop. I will never use this provider again."
        },
        {
          "Note": 1,
          "Lieu": "PH",
          "Pseudo": "Godofredo Pineda",
          "Nb_Reviews": 1,
          "Date": "2023-07-01T15:21:23.000Z",
          "Titre": "Nomad no use in turkey",
          "Contenu": "Tried to activate and use nomad in turkey.  Failed to engage and provide data for online use.  10 dollars down the drain.  Lucky that i only loaded 10 dollars worth."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "David D",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T05:46:48.000Z",
          "Titre": "I couldn’t get it to work in Mexico",
          "Contenu": "I couldn’t get it to work in Mexico so I ended up buying a local SIM card after arriving."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Manuella Ewerton",
          "Nb_Reviews": 1,
          "Date": "2023-05-28T13:14:52.000Z",
          "Titre": "Slow internet at US",
          "Contenu": "I used the service during a trip to Europe last year. Everything worked fine, so I decided to use it again for a trip to the US.This time I got bad signal, slow internet and not a good service."
        },
        {
          "Note": 1,
          "Lieu": "SG",
          "Pseudo": "David Seah",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T00:01:55.000Z",
          "Titre": "It is so difficult to get the esim…",
          "Contenu": "It is so difficult to get the esim active. Need to restart my mobile phone 5 times to get it working."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Yoko Douglas",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T06:17:29.000Z",
          "Titre": "Unlimited data is a misnomer",
          "Contenu": "Unlimited data is a misnomer.  Useless.The data was throttled back so much it was essentially unusable."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Jane",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T10:45:28.000Z",
          "Titre": "Cell data stopped working even though…",
          "Contenu": "Cell data stopped working even though zi had only used 1.9 GB of my 5 ???  I followed your instructions to restart and it still didn’t work. Not impressed. Won’t buy nomad again."
        },
        {
          "Note": 1,
          "Lieu": "HK",
          "Pseudo": "Max",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T23:47:31.000Z",
          "Titre": "Bought 2 eSim in Hong Kong",
          "Contenu": "Bought 2 eSim in Hong Kong, never had the service. Never couple chat to anyone. Nobody answered, I’m used to use eSim, but this one is the only i won’t use again."
        },
        {
          "Note": 1,
          "Lieu": "NC",
          "Pseudo": "Patrick",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T23:46:40.000Z",
          "Titre": "Useless",
          "Contenu": "Useless, the esims I bought never worked. Couldn't join the provider by any means.No refund."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "martin Geissinger",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T05:14:35.000Z",
          "Titre": "it did#t work i could not find any…",
          "Contenu": "it did#t work i could not find any support"
        },
        {
          "Note": 1,
          "Lieu": "SB",
          "Pseudo": "SI traveller",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T21:03:11.000Z",
          "Titre": "Sold a dud",
          "Contenu": "Sold a dud . Overpriced E sim for unworkable product.Data speed barely functional if at all."
        },
        {
          "Note": 1,
          "Lieu": "TR",
          "Pseudo": "Samir",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T09:49:26.000Z",
          "Titre": "The data and speed the Nomad app SUPER SLOW DATA PROVIDED.",
          "Contenu": "The data and speed the Nomad app provided is much slower then the Data my carrier provider me. Since I could not used as I was expecting."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Stephen",
          "Nb_Reviews": 7,
          "Date": "2023-06-28T16:24:23.000Z",
          "Titre": "Unreliable",
          "Contenu": "My Nomad plan worked fine for only one day of my five day plan. I checked my settings and Nomad instructions, but couldn’t get the plan to reconnect."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Giedre",
          "Nb_Reviews": 1,
          "Date": "2023-06-18T01:07:05.000Z",
          "Titre": "Internet doesn’t work!!!",
          "Contenu": "Internet doesn’t work!!!! The network was just in the short moments. Very disapointed.😤"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "DB",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T09:40:02.000Z",
          "Titre": "Wifi is slow",
          "Contenu": "The wifi isn‘t working. The connection is very bad."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Juan",
          "Nb_Reviews": 2,
          "Date": "2023-06-19T07:15:40.000Z",
          "Titre": "In Japan your service didn't work",
          "Contenu": "As you may be able to see I could not use the data I had to buy a local SIM card for the week I didnt find any way to request a refund so double bad service in Japan"
        },
        {
          "Note": 1,
          "Lieu": "NO",
          "Pseudo": "Ahman Ahmadi",
          "Nb_Reviews": 4,
          "Date": "2023-08-03T18:11:06.000Z",
          "Titre": "We bought esim for Malaysia as it said…",
          "Contenu": "We bought esim for Malaysia as it said it will work in Singapore as well but it did not"
        },
        {
          "Note": 1,
          "Lieu": "PL",
          "Pseudo": "jassim Alameeri",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T11:07:00.000Z",
          "Titre": "Signals week in it gets disconnected in…",
          "Contenu": "Signals week in it gets disconnected in some areas in Poland, WhatsApp call is very very difficult and we can't hear each other, instead we use voice messages only, we have 5 accounts on different mobiles and we suffer the same."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Bruce",
          "Nb_Reviews": 5,
          "Date": "2023-05-15T17:01:01.000Z",
          "Titre": "Was great. Now does not work",
          "Contenu": "When I first used nomad it was great. The last two times I have used it I have been unable to get it to work. My friend had a similar experience. Neither of us use it now. We both have iPhone’s, this could be the problem."
        },
        {
          "Note": 1,
          "Lieu": "SE",
          "Pseudo": "Wesley Ryder",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T10:30:07.000Z",
          "Titre": "Coverage is terrible",
          "Contenu": "Coverage is terrible Have struggled to get connectivity even in popular places"
        },
        {
          "Note": 1,
          "Lieu": "ZA",
          "Pseudo": "Sarah",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T15:40:10.000Z",
          "Titre": "Terrible",
          "Contenu": "Total waste of money, e sim didn’t work and customer service unable to help"
        },
        {
          "Note": 1,
          "Lieu": "TR",
          "Pseudo": "Hassan Saraierh",
          "Nb_Reviews": 2,
          "Date": "2023-07-01T06:56:00.000Z",
          "Titre": "i ended up buying two sim cards on my…",
          "Contenu": "i ended up buying two sim cards on my phone, and another two sims on my friend phone. the process is not easy and for me is is not good UX."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Nils C.",
          "Nb_Reviews": 2,
          "Date": "2023-10-13T05:22:42.000Z",
          "Titre": "I can’t use the eSIM card because it…",
          "Contenu": "I can’t use the eSIM card because it doesn’t works. I don’t get my money back. Criminals!!!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Siddharth Atalatti",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T13:57:51.000Z",
          "Titre": "Inspite of paying for everything it…",
          "Contenu": "Inspite of paying for everything it never worked. I couldn't access any data"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2023-05-15T15:30:10.000Z",
          "Titre": "Totally worthless",
          "Contenu": "Totally worthless.  I never got it working properlyv for either country."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Soohyun Kim",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T11:14:24.000Z",
          "Titre": "Issue didnt resolve and was worstso slow",
          "Contenu": "Issue didnt resolve and was so slow Hard to connect with an agent"
        },
        {
          "Note": 1,
          "Lieu": "BR",
          "Pseudo": "Miguel Silva",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T00:37:11.000Z",
          "Titre": "I couldn’t activate it while traveling…",
          "Contenu": "I couldn’t activate it while traveling to USA this month.I paid for nothing!I want my money back."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Theophilus",
          "Nb_Reviews": 10,
          "Date": "2023-12-20T02:04:13.000Z",
          "Titre": "Go for Holafly instead in Sri Lanka",
          "Contenu": "The Sri Lanka eSIM works with Hutch and it’s unclear whether the problem lies with the network or the eSIM but I suffered from poor and unstable connections even in central Colombo. Eventually I gave up and swapped to a Holafly/Dialog card which was infinitely better (if more expensive)."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Charlie Risso-Gill",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T07:14:38.000Z",
          "Titre": "I have had a negative experience",
          "Contenu": "I have had a negative experience . I am unable to activate my plan due to the Erie message saying my code is invalid. The support I tried to get was minimal"
        },
        {
          "Note": 2,
          "Lieu": "SG",
          "Pseudo": "Daniel Lim",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T05:43:49.000Z",
          "Titre": "Unable to get connect in big shopping…",
          "Contenu": "Unable to get connect in big shopping mall in Malaysia. Disappoint."
        },
        {
          "Note": 2,
          "Lieu": "ES",
          "Pseudo": "Santiago",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T08:37:41.000Z",
          "Titre": "Extremely slow speed, ended up buying a physical SIM",
          "Contenu": "I bought an eSim for El Salvador but it never really worked. The description said 4G bit I never really had 4G speed, I could barely send/receive WhatsApp messages and it didn't work to navigate the internet at all. I had to buy a physical Sim in the end so I could have signal."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Yurima Jimenez",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T00:21:57.000Z",
          "Titre": "Not satisfied",
          "Contenu": "it worked well when it worked but it shut down before expiry, just like \"that\" no warning... it was to be good for 7 days and I had it only from  Dec 1 to Dec 4 mid day."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gus G",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T19:35:00.000Z",
          "Titre": "Fantastic when it works; support horrible when it doesn't",
          "Contenu": "I used Nomad for a recent trip to the UK (London) and El Salvador. In the UK, everything worked great – I had no problems with my UK plan and a solid connection everywhere you would expect to.Things were very different in El Salvador. The plan details for this eSIM clearly said I could expect \"4G/LTE\" speeds. However, once I activated the plan, the plan details in the Nomad app said \"Speed: 3G\". Sure enough, I could only get a 3G network connection, which was next to unusable. I also had my existing Verizon plan active on the phone, and had LTE coverage on that SIM almost everywhere in El Salvador, on the exact same network (Movistar) as the Nomad eSIM. It is clear that I was sold a 3G only plan by Nomad, since their eSIM would not connect at anything over 3G while I had full bars of LTE on another SIM on the same phone at the same time in the same location. I can see from other reviews here that I am not the first person to experience this exact issue using a Nomad eSIM in El Salvador.But the real problem here? Nomad's support. I outlined all this to Nomad via the app multiple times, and the support team was like a broken record. There were constant requests to update my data settings, screenshot my data settings, reboot my phone (even when I had already just done all of this multiple times), and an insistence that I was receiving 3G speeds because of the geographical location I was in and that it must be because the location only had 3G coverage (clearly not the case, given I had 4G on my Verizon SIM on the same phone). Every time I contacted support to let them know I still wasn't connected to 4G, they would message me something like \"we see that your usage has gone up 50MB so it looks like your data is working\", to which I repeatedly had to explain that I had never said I didn't have working 3G data, just that I could not connect to the 4G network as promised.I lost count of the times I had to repeat myself, change my settings, restart my phone – eventually I gave up, because 3 days into my 5-day trip I had spent more than enough time and energy trying to get my Nomad eSIM working as advertised. Horrendously frustrating experience, and at literally no point during my many, many messages with support did I feel like they could understand the problem or help me with it. They seemed completely incapable of going off-script, and frustratingly their script had very little to do with the problem I was experiencing.I ended up buying another travel eSIM from Maya, which worked perfectly, was significantly cheaper, and gave me the 4G speeds I was expecting (on the same phone and same network as the Nomad eSIM, nonetheless).Ultimately, I paid for a 4G plan and not once was connected to 4G, and there was nothing resembling an offer of a refund (even a pro-rated one, given that I did use SOME data on 3G).5 stars for the flawless service in London.1 star for the service in El Salvador.1 star for the support."
        },
        {
          "Note": 2,
          "Lieu": "SG",
          "Pseudo": "Rachel",
          "Nb_Reviews": 2,
          "Date": "2023-11-02T18:38:56.000Z",
          "Titre": "Easy to set up much like most of the…",
          "Contenu": "Easy to set up, much like most of the esims i tried; unfortunately, this is one that i felt was not worth the money.  After 2 days of use, my data is gone— all it kept saying was i do not have internet connection and it turns out it has downgraded me to 3G.  I never thought i would consume 10GB in 2 days since from what i know, i just used it mostly to navigate.  but even then, it said that it would continue to have internet connection but at a slower speed, only to find out it would keep sending me no internet connection when i needed to connect on the 3rd day. I needed to get another esim since i really needed wifi for my travel."
        },
        {
          "Note": 2,
          "Lieu": "VN",
          "Pseudo": "CrazyLegoDad",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T03:54:44.000Z",
          "Titre": "Tiktok unavailable with this sim",
          "Contenu": "Something to note for nomad esim is that it doesn't allow tiktok. I have to turn off the Sim for tiktok to work on WiFi. For whatever reason if the nomad esim is active, it will not allow tiktok to connect to network. The Sim works otherwise but if you are needing social media access to tiktok, than avoid this."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Arsh",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T16:59:30.000Z",
          "Titre": "Turkcell - Local Esim from Nomad - Manipulation in Data Record",
          "Contenu": "My wife signed up with Nomad for their 3 GB with Turkcell to be used in Turkey as a local sim, The entire data plan got used up within 2-3 days, even though we were using it sparsely. Then we bought another package for 5GB esim, which again got used up within 2 days. I feel there is some sort of dishonesty in the data plans, my wife is a light-medium user and we were on holiday with Wi-Fi available at our hotel throughout. In total, we have spent around $18 in total for 3gb+5gb = 8GB data. The network has been excellent but there are some discrepancies with the data not honestly being shown."
        },
        {
          "Note": 2,
          "Lieu": "SE",
          "Pseudo": "Non sederti qui",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T09:00:25.000Z",
          "Titre": "I did not work when rained etc",
          "Contenu": "Going to Italy, I decided to use Nomad eSim. It started okay at the beginning, but, after, it went terribly. The problem was, that every time it rained, I lost my connection. And one day, out of nowhere, my connection was lost again for hours. The point I am making is that Nomad is ideal for infrequent use in a vacation, but you cannot count on Nomad."
        },
        {
          "Note": 2,
          "Lieu": "TW",
          "Pseudo": "Phil G",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T10:50:42.000Z",
          "Titre": "Slow Connection Everywhere",
          "Contenu": "Got an eSIM for Taiwan. It's very very slow and often unusable for anything other than maps. Wish I had got something locally instead."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Ahmed Rahman",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T14:40:27.000Z",
          "Titre": "I didn't got your signal everywhere in…",
          "Contenu": "I didn't got your signal everywhere in Europe and very bad experience in Porto , Portugal."
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "Ranadeep Sarkar",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T08:25:45.000Z",
          "Titre": "Poor connecitivity",
          "Contenu": "The connection through out the time of my stay in US was horrible. I had 4G or 5G connectivity, but mostly pages didn't load. Speed was comparable to dial-up connection. This was not the same experience I had earlier."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Roberta Welling",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T20:24:25.000Z",
          "Titre": "I was unable to log into the app the…",
          "Contenu": "I was unable to log into the app the second time I bought data so had to guess how much data remained. Fortunately I didn't run out. I had hoped to get a local phone number but apparently that is unavailable. I expected the esim option to be simple.  I wish I'd opted for a phone with physical sims instead"
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Sebastian",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T14:36:28.000Z",
          "Titre": "Bad internet: Messaging only, No photos or videos",
          "Contenu": "I stayed in NYC for two weeks and booked an esim with 10GB worth of data. Although I connected with LTE and 5G in the entire NYC area I never had proper internet. I could write and send messages on WhatsApp and iMessage but sending pictures or videos was almost impossible. A friend of mine bought a real SIM and had no trouble at all. If you only want to send and receive messages this is okay. But, I expect a better quality of internet for the price I paid."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Ursela",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T23:52:29.000Z",
          "Titre": "Nomad is great on this occasion eSIM was not",
          "Contenu": "Nomad is great and easy to use but the eSIM I got on this occasion was slow and though it’s advertised as spark network I definitely was not getting the full spark network speed it was very slow"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "KM",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T18:57:34.000Z",
          "Titre": "Not bad!",
          "Contenu": "for the most part, good service. but lack of signal at times, slow service at times. and after a flight from NJC to Austin it took 45min for the service to start working - this was after restarting the phone several times.Edit: the other thing I noticed was my data being routed through London (I am in USA). I believe this has caused me to be banned from some social networking apps."
        },
        {
          "Note": 2,
          "Lieu": "PL",
          "Pseudo": "Laura",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T13:14:04.000Z",
          "Titre": "Slow internet in USA",
          "Contenu": "ESim was easy to install and use, but internet quality was really bad in USA. Very slow and losing connection. Many websites took ages to load or never loaded and often I couldn't even receive and send messages on messaging apps"
        },
        {
          "Note": 2,
          "Lieu": "AD",
          "Pseudo": "Liran Ritkop",
          "Nb_Reviews": 1,
          "Date": "2023-07-22T17:06:31.000Z",
          "Titre": "Wouldn’t go for it again",
          "Contenu": "We started our trip in Spain, after only half a day the connection started to work at last. Now we are in Andorra and we don’t have any connection nowhere. We are counting on the internet connection for paying in electric charging points for our cars and till now local restaurants gave us their wifi credentials so we can do that.."
        },
        {
          "Note": 2,
          "Lieu": "JP",
          "Pseudo": "Yz",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T18:12:34.000Z",
          "Titre": "stopped working after 90% usage",
          "Contenu": "Sim worked fine for few days, but stopped working after reaching 90% of usage and before expiration date."
        },
        {
          "Note": 2,
          "Lieu": "JP",
          "Pseudo": "Laura S",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T13:50:15.000Z",
          "Titre": "Taiwan esim : service slow or not working",
          "Contenu": "Taiwan esim was working really poorly most of the time - either excruciatingly slow or not at all. When I contacted customer support more than once, pretty much all they had to say was \"oh I see your some data is being used, glad everything is working fine so I'll close the ticket\". Verbatim example: \"I can now see a huge increase in data usage from 2.976GB to 3.020GB / 15GB. It seems that the connection is better.\" A huge increase. Of 0.04G.News alert - just because it sort of works sometimes doesn't mean it's working as expected, or satisfactorily. Next time I'll use another company."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "BGordon",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T16:38:02.000Z",
          "Titre": "The activation of the esim was not as…",
          "Contenu": "The activation of the esim was not as straight forward as indicated. I spent a whole day on the chat with the wonderful Nomad staff trying to figure out why I still had no data despite properly following all the instructions. In the end it worked fine but it should not be this complicated. Nomad needs to do more work figuring out the interaction with every type of phone."
        },
        {
          "Note": 2,
          "Lieu": "ES",
          "Pseudo": "Jacki Torres",
          "Nb_Reviews": 2,
          "Date": "2023-07-11T10:43:24.000Z",
          "Titre": "It “works” if it’s your only option. Very frustrating",
          "Contenu": "I used 2 different e SIM card companies during a recent trip to the US and mexico. The other one, e travel sim worked perfectly. The nomad sim was extremely frustrating because so many websites kept blocking my access, and a lot of websites would automatically l come up in what looked like Chinese."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JL",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T05:20:44.000Z",
          "Titre": "Data speeds are extremely slow and…",
          "Contenu": "Data speeds are extremely slow and reception is spotty at best throughout the greater Los Angeles area. Would not recommend getting this in the future."
        },
        {
          "Note": 2,
          "Lieu": "ID",
          "Pseudo": "M L",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T01:43:15.000Z",
          "Titre": "Excellent Coverage - Dreadful Speed.",
          "Contenu": "Got a plan for Asia and used it in Singapore and Bali. The good: I'm connected everywhere. Coverage is excellent. The bad: Slow! it's hardly 4G. Connection is extremely slow. Loading a local page can take time. The Ugly: You can only use that plan for very limited data usage because it's so slow. I have used much better eSim providers in Asia before."
        },
        {
          "Note": 2,
          "Lieu": "SE",
          "Pseudo": "Dave",
          "Nb_Reviews": 1,
          "Date": "2023-08-06T14:10:54.000Z",
          "Titre": "Not great",
          "Contenu": "Sign up was straightforward. However, have to regularly switch on/off mobile data to regain a connection despite showing multiple bars, and speed is much slower than my partner who’s on a cheaper Lyca plan."
        },
        {
          "Note": 2,
          "Lieu": "ID",
          "Pseudo": "SG Business Trip",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T03:14:41.000Z",
          "Titre": "The connection in Singapore is not very…",
          "Contenu": "The connection in Singapore is not very good."
        },
        {
          "Note": 2,
          "Lieu": "CH",
          "Pseudo": "Désirée",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T12:10:18.000Z",
          "Titre": "No internet in Holbox",
          "Contenu": "I had 1GB in Mexico and went to Holbox. Once on the island I had absolutely no internet connection. It would be nice to have a map or some sort of information to check where an internet connection won‘t be possible."
        },
        {
          "Note": 2,
          "Lieu": "SE",
          "Pseudo": "Kenneth Pang",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T13:38:49.000Z",
          "Titre": "Very slow access even with perfect coverage",
          "Contenu": "Not the best SIM card, but it worked, at least in London. It uses a budget version of Vodafone UK for carriage, but A friend got a local Vodafone UK SIM card, I got the Nomad version. Same phone, same reception, he had fast internet, I had unusably slow to moderately fast internet. With perfect 5 bars, I was getting just under 5Mbps, but was often slower than that. It was routing all my traffic to Sweden which causes... interesting effects for Google recommendations and search results (finding results in Sweden rather than the UK). Other than that, the process was fairly smooth - just remember you need internet access to activate it which isn't provided through the SIM, so you won't have access until you find free Wi-Fi unless you activate it before you leave."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Andries Steyn",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T12:41:47.000Z",
          "Titre": "Intermittent connection to the network",
          "Contenu": "I installed my esim (Truphone) on 6 April in Sydney Australia. It worked perfectly for 3 days, until I landed in Melbourne Australia. The esim then started disconnecting from the network every few minutes, or even seconds, and worked only intermittently. I tried the trouble-shooting tips, i.e., turning on airplane mode for 30 seconds, switching esim on-and-off, rebooting my phone, but without success. I contacted the helpdesk and they gave me more tips. I made screenshots of all my settings and sent to the helpdesk. They confirmed that all setting was correct. However, the problem continued until I purchased, out of frustration, a physical sim card and disabled my Nomad esim. Thanks and have a lovely day"
        },
        {
          "Note": 2,
          "Lieu": "IE",
          "Pseudo": "Charles McCreery",
          "Nb_Reviews": 10,
          "Date": "2023-06-20T00:20:13.000Z",
          "Titre": "Caused a complete clash on my phone",
          "Contenu": "Caused a complete clash on my phone. Chose the data plan but then could not make phone calls. Info pages are not especially helpful. Had used previously in Australia and no prob, in the US had to delete and reset the phone, call my European carrier to get it sorted. Ended with no ability to make calls ( except Whatsapp). Reluctant to use again"
        },
        {
          "Note": 2,
          "Lieu": "MY",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T13:14:22.000Z",
          "Titre": "Internet connection often not working…",
          "Contenu": "Internet connection often not working in Malaysia. A lot of the time, I am connected to the network but there is not 4G connection. Turning mobile data on and off or even the phone doesn't work. It's very inconvenient... Thankfully I had friends with me to share their own internet so I wasn't too impacted by this."
        },
        {
          "Note": 2,
          "Lieu": "CO",
          "Pseudo": "Sheryl Traveler",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T15:47:05.000Z",
          "Titre": "The signal was unreliable and slow when…",
          "Contenu": "The signal was unreliable and slow when present.  The signal was best when on a taller point in the city.  We weren’t in a mountainous area of the USA but it was mildly hilly.  If I was in any way surrounded by hills or buildings then the signal was nonexistent.  Due to this experience, I do not anticipate using Nomad eSim on my next trip to the USA."
        },
        {
          "Note": 2,
          "Lieu": "BS",
          "Pseudo": "Allan Jurgens",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T18:24:41.000Z",
          "Titre": "Servise seemed slow"
        },
        {
          "Note": 2,
          "Lieu": "NO",
          "Pseudo": "Simen A",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T09:54:38.000Z",
          "Titre": "Easy to buy and install, but extremely slow",
          "Contenu": "It was really easy to purchase and install the eSIM, but the transfer speed was incredibly slow (USA/T-Mobile). I was forced to use WIFI where available, so wasn't really able to use more than 10% of the data I bought. Can't recommend this service to anyone who needs to work, or would like to use streaming."
        },
        {
          "Note": 2,
          "Lieu": "ZA",
          "Pseudo": "Keval Mehta",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T14:33:25.000Z",
          "Titre": "The quality of the signal is poor",
          "Contenu": "The quality of the signal is poor.  You never get 5G.  It is like one is on a lower level bandwidth.  Hardly ever reach more than 1 or 2 bars of signal on LTE.  Quality of connection is always poor even in large metros which dense coverage.  You can barely do anything with this connection."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "A",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T11:25:30.000Z",
          "Titre": "Slow and inconsistent",
          "Contenu": "Slow and inconsistent. But unsure if due to VPN used. After 2 weeks keeps being directed to Sogou instead of usual Chrome.Will not work with free Wifi, it needs to be turned off."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Adi",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T23:53:56.000Z",
          "Titre": "promising future,it needs a little more work",
          "Contenu": "an easy way to use the aplication but you have to work a little bit more about the internet because isn’t working (many clips on youtube or tiktok are freezing )"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JS",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T17:09:34.000Z",
          "Titre": "Cannot select lower that one star",
          "Contenu": "Cannot select lower that one star on the scale.Bought a Europe plan for my Wife's phone prior to her departure. It was installed prior to departure and she attempted to activate it once on hotel WiFi. Did not work. Verified settings and still no data. She completed the checklist of items off the \"Simple Troubleshooting Tips for your Nomad eSIM\" off their site. No data. She contacted Nomad and provided screenshots of settings as requested. No data. No luck. No Service. Looks like $35 down the toilet at this time.6/21/23 update: Nomad was not able to provide a solution and refunded the money. As such, I upgraded my review to 2 stars in that Nomad made an effort to solve the problem ending with a refund.My wife was able to use another eSim provider without any issues."
        },
        {
          "Note": 2,
          "Lieu": "IL",
          "Pseudo": "Eran",
          "Nb_Reviews": 1,
          "Date": "2023-06-03T20:20:12.000Z",
          "Titre": "Very Slow / Unstable Connection",
          "Contenu": "I have bought an unlimited data esim for the US for 25$. It was based on T-Mobile network. The installation was easy on iPhone13. During my stay at New York City it connected only with 4G. Most of the time the connection was unstable and very slow (less than 5Mbps). Often it didn't work at all. I don't recommend this product and will avoid in the future."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Ayngelina",
          "Nb_Reviews": 2,
          "Date": "2023-05-16T09:04:34.000Z",
          "Titre": "I have used this a handful of times and…",
          "Contenu": "I have used this a handful of times and have issues 50% of the time. I activate the SIM before I travel and somehow when I land it's not activated and I'm having issues in the airport - which is when I need it the most for ride apps.I'm going to look for a different provider as I can't rely on it."
        },
        {
          "Note": 2,
          "Lieu": "IT",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T08:29:43.000Z",
          "Titre": "Wouldn't recommend",
          "Contenu": "I arrived in Iceland for a layover and went to Blue Lagoon .  I had no data at all.  When I arrived in Bologna, the data service was slow-loadint at this mes and at other times non-existent.  I ended up buying a physical eSIM for the rest of my travels."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Patrick Juch",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T16:18:46.000Z",
          "Titre": "Unfortunately the covarage was in…",
          "Contenu": "Unfortunately the covarage was in Canada, Montana and Wyoming very bad. I dont know if it's general so in the US or Canada or of that's Problem of nomad."
        },
        {
          "Note": 2,
          "Lieu": "FR",
          "Pseudo": "Alex Ostar",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T18:54:15.000Z",
          "Titre": "I am not sure what exactly went wrong",
          "Contenu": "I am not sure what exactly went wrong , but it looks like the internet connection was not stable in the area I been, during my vacation. So it comes and goes with disconnections.And when it worked,  the tested download speed was between 0.5-1.3Mbps upload speed was around 0.3Mbps ."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Min Sides",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T19:10:18.000Z",
          "Titre": "I got cut off and couldn’t get back on…",
          "Contenu": "I got cut off and couldn’t get back on without internet so I had to use my daily internet roaming charge from Australian provider"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "C M",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T02:24:23.000Z",
          "Titre": "Unreliable unless visiting big cities in PNW",
          "Contenu": "I used this on a road trip from northern Washington to San Francisco. This esim was very unreliable— I pretty much only had service in Seattle, San Fran and Portland. My partner used ALO and had coverage in 95% of the areas I didnt."
        },
        {
          "Note": 2,
          "Lieu": "JP",
          "Pseudo": "Kaz Nakano",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T10:12:42.000Z",
          "Titre": "I purchased 1 GB data plan in the US",
          "Contenu": "I purchased 1 GB data plan in the US. I didn't use much data through cellular network but Nomad said it was expired. So, I purchased another 1 GB plan then I activated it. A couple hour later, previous 1 GB plan was coming back. I bought them twice. I had two eSIM plans at a same time. It was waste of money and time."
        },
        {
          "Note": 2,
          "Lieu": "KR",
          "Pseudo": "Laura",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T04:11:27.000Z",
          "Titre": "The plan itself was good..",
          "Contenu": "The plan itself was good and I could use the data nearly everywhere in South Korea. However the plan ended one day earlier than what I paid for which is unacceptable."
        },
        {
          "Note": 2,
          "Lieu": "IT",
          "Pseudo": "Gabriele",
          "Nb_Reviews": 4,
          "Date": "2023-05-15T13:09:49.000Z",
          "Titre": "Discontinued coverage in Monaco",
          "Contenu": "The coverage offered in specific countries such as Monaco should definitely be improved.Furthermore, Monaco was originally part of their extended Europe plan, but removed with no notice (now only available within the Global plan at 10x its cost)."
        },
        {
          "Note": 2,
          "Lieu": "HK",
          "Pseudo": "Steven",
          "Nb_Reviews": 3,
          "Date": "2023-07-18T10:44:47.000Z",
          "Titre": "expensive and cannot used",
          "Contenu": "I bought the esim in their app, but it cannot be used at all. I have to buy another esim in the other app, because I need the data plan in my travel. Anyway their plans are expensive as well. Do not recommend it at all."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Romee",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T14:19:32.000Z",
          "Titre": "Increase price + decrease quality",
          "Contenu": "The prices of the plans went up really high compared to last year and the quality of my internet connection (T-Mobile) is far lower than the last 4 times I used Nomad. I will be switching to a new platform. This has been disappointing."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Joachim",
          "Nb_Reviews": 2,
          "Date": "2023-06-23T14:28:17.000Z",
          "Titre": "Th is…",
          "Contenu": "The experience with Nomad as such is good, but unfortunately their partner in the US is T-Mobile. If you plan to visit Yellowstone or the National Parks ib Utah and Arizona you are much better of with Verizon"
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "Jean-Paul Mau-Asam",
          "Nb_Reviews": 2,
          "Date": "2023-05-15T14:30:58.000Z",
          "Titre": "Didn’t work in Mexico.",
          "Contenu": "Didn’t work in Mexico. Couldn’t activate the esim. Had the same problem last year with Nomad in Mexico.Fool me once, shame on you; fool me twice, shame on meCustomer service helped me good. Luckily they refunded me :)Nunca mas"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "JL",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T16:56:31.000Z",
          "Titre": "The connection was not easy",
          "Contenu": "The connection was not easy, very complicated. Also, I don't understand how 1gb can be spent in a single day just using google maps and email. Until the night of the first day, I had used 0.15% of the plan, but the next morning it said that I had used it all."
        },
        {
          "Note": 2,
          "Lieu": "IT",
          "Pseudo": "Guglielmina Armandi",
          "Nb_Reviews": 2,
          "Date": "2023-06-05T09:14:04.000Z",
          "Titre": "it took me a dozen of times to get the…",
          "Contenu": "it took me a dozen of times to get the payment done, charging my various credit cards over 7 times. I'm still waiting for reimbursement for some of the false charges"
        },
        {
          "Note": 2,
          "Lieu": "SE",
          "Pseudo": "Francois",
          "Nb_Reviews": 1,
          "Date": "2023-06-24T15:00:52.000Z",
          "Titre": "More expensive than getting a physical…",
          "Contenu": "More expensive than getting a physical sim card, and the network quality is abysmal. I can't use my phone for data in most locations. Very disappointed."
        },
        {
          "Note": 2,
          "Lieu": "IE",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-05-15T13:28:01.000Z",
          "Titre": "I had difficulty keeping the data…",
          "Contenu": "I had difficulty keeping the data connection alive. I had to turn mobile data on and off a few times a day to keep it working. Sometimes it didn't reconnect. I have a  new phone so I don't think that was the problem."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Pete V",
          "Nb_Reviews": 1,
          "Date": "2023-06-18T21:53:31.000Z",
          "Titre": "Moving from country to country",
          "Contenu": "Whenever i move to a different country, connecting isn't issue free. It took 2 days before I got connected in Switzerland, 1 in France and another 1 in London. Day 1 in any new country is critical."
        },
        {
          "Note": 2,
          "Lieu": "SG",
          "Pseudo": "YHWan",
          "Nb_Reviews": 2,
          "Date": "2023-06-06T05:00:18.000Z",
          "Titre": "Disappointed and frustrated using Nomad eSim in Australia.",
          "Contenu": "Worked for a few days and then couldn't even connect to wifi in Australia at all. Very disappointed and frustrated not able to use it in a foreign land."
        },
        {
          "Note": 2,
          "Lieu": "PT",
          "Pseudo": "Miguel Coxo",
          "Nb_Reviews": 1,
          "Date": "2023-06-24T20:47:53.000Z",
          "Titre": "Half the time didn't work",
          "Contenu": "Half the time didn't work. Had full signal with 4G yet the internet would do nothing. Then turn off and on a few times eventually it would work. Not reliable."
        },
        {
          "Note": 2,
          "Lieu": "IT",
          "Pseudo": "Francesco “Franz” Galassi",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T07:38:00.000Z",
          "Titre": "Very slow and bad connection",
          "Contenu": "The connection was very slow, and in many places didn't work, even if I was in common location in the capital! Very disappointed"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Lesley",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T00:56:25.000Z",
          "Titre": "Nomad didn't work well in Mexico",
          "Contenu": "Nomad didn't work well in Mexico.  The data was either really slow or non-existent so it wasn't very helpful."
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "Willem",
          "Nb_Reviews": 2,
          "Date": "2023-06-26T14:51:40.000Z",
          "Titre": "Not so good outside Australian cities",
          "Contenu": "I order esim for Australia, but it has limited coverage outside the cities in comparison to a competitor (mobimatter) from which I also bought an esim. I used the esim for a roundtrip Sydney-Melbourne. In the end I had to rely on competitor esim to stay connected."
        },
        {
          "Note": 2,
          "Lieu": "JP",
          "Pseudo": "Hn",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T12:14:43.000Z",
          "Titre": "Sometimes work but sometimes stop…",
          "Contenu": "Sometimes work but sometimes stop working. Not reliable. Set up not so easy. Likely move to other provider."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "JV",
          "Nb_Reviews": 2,
          "Date": "2023-06-11T19:46:22.000Z",
          "Titre": "4G service, very slow and low signal",
          "Contenu": "I was in several northern states in the US and the signal that I got was very low and it was always in 4G and very slow. In very large sections I did not get signal at all."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Vincent Masciotra",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T22:17:12.000Z",
          "Titre": "Your instructions for activating are…",
          "Contenu": "Your instructions for activating are not clear. One MUST use the App and that is not indicated in a clear fashion in the instructions."
        },
        {
          "Note": 2,
          "Lieu": "FR",
          "Pseudo": "Jacky Chan",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T04:54:42.000Z",
          "Titre": "Prices are more expensive than local…",
          "Contenu": "Not really \"unlimited data\". Prices are more expensive than local sim..."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Eve Lépine",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T21:09:53.000Z",
          "Titre": "It didn work if the wireless service…",
          "Contenu": "It didn work if the wireless service was not 100%. I had to buy another company that was working better …."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Ye Tia",
          "Nb_Reviews": 4,
          "Date": "2023-10-26T02:48:48.000Z",
          "Titre": "I can't use it for tiktok and sms",
          "Contenu": "I can't use it for tiktok and sms. The price of the plan is a little expensive than others."
        },
        {
          "Note": 2,
          "Lieu": "SG",
          "Pseudo": "Foley  Jerome",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T03:45:23.000Z",
          "Titre": "I bought both USA and Canadian E sim…",
          "Contenu": "I bought both USA and Canadian E sim but as best as I can determine I have to delete one to reactivate the other and loose the first even though there is lots of remaining credit on it"
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "Y. Ho",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T22:18:53.000Z",
          "Titre": "Every evening no connection for a…",
          "Contenu": "Every evening no connection for a couple of hours."
        },
        {
          "Note": 2,
          "Lieu": "SG",
          "Pseudo": "John Tran Harcourts",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T18:40:32.000Z",
          "Titre": "it works but its extremely slow"
        },
        {
          "Note": 2,
          "Lieu": "SG",
          "Pseudo": "frederic cohen",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T22:49:30.000Z",
          "Titre": "Unstable connection in San Francisco…",
          "Contenu": "Unstable connection in San Francisco area and north California. My friends with other operator had much Beyer serviceDisappointing"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Catherine",
          "Nb_Reviews": 2,
          "Date": "2023-09-18T11:19:47.000Z",
          "Titre": "No connection at all on 3rd day even…",
          "Contenu": "No connection at all on 3rd day even though I bought a 7 day plan"
        },
        {
          "Note": 2,
          "Lieu": "SG",
          "Pseudo": "Sarah Csizmadia",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T02:20:05.000Z",
          "Titre": "Its often does not work.",
          "Contenu": "Its often does not work.. I am disapointed"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Jan Vincent",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T08:35:54.000Z",
          "Titre": "Poor data connectivity",
          "Contenu": "Poor data connectivity- slow- would drop randomly"
        },
        {
          "Note": 2,
          "Lieu": "GR",
          "Pseudo": "ev sorkin",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T09:09:30.000Z",
          "Titre": "Coverage was very spotty",
          "Contenu": "Coverage was very spotty, especially in the. countryside and islands. Disappointing."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "M Troyer",
          "Nb_Reviews": 1,
          "Date": "2023-06-25T15:02:08.000Z",
          "Titre": "Slow cell service and lost connection…",
          "Contenu": "Slow cell service and lost connection often"
        },
        {
          "Note": 2,
          "Lieu": "CR",
          "Pseudo": "MMG",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T22:10:46.000Z",
          "Titre": "Signal in US wasn’t reliable"
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Volker Ahrens",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T14:35:32.000Z",
          "Titre": "Reception of service in Guatemala was…",
          "Contenu": "Reception of service in Guatemala was poor"
        },
        {
          "Note": 2,
          "Lieu": "IT",
          "Pseudo": "Pedro Gigollotti",
          "Nb_Reviews": 2,
          "Date": "2023-11-23T15:43:01.000Z",
          "Titre": "Internet service in Brazil",
          "Contenu": "It doesn’t work well in Brazil."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "traveler",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T13:53:23.000Z",
          "Titre": "Added more minutes",
          "Contenu": "Added more minutes, did not work. Had to create a new sim."
        },
        {
          "Note": 2,
          "Lieu": "GG",
          "Pseudo": "MRSKARENBOURGAIZE",
          "Nb_Reviews": 8,
          "Date": "2023-09-16T09:59:35.000Z",
          "Titre": "Sadly",
          "Contenu": "I’m afraid, sadly I didn’t get on with it at all."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Andrew Aird",
          "Nb_Reviews": 2,
          "Date": "2023-10-11T17:42:53.000Z",
          "Titre": "Struggled to get access in Beijing."
        },
        {
          "Note": 2,
          "Lieu": "TW",
          "Pseudo": "Naagii Turuu",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T10:08:18.000Z",
          "Titre": "Signal was very bad in Beijing city."
        },
        {
          "Note": 2,
          "Lieu": "SG",
          "Pseudo": "Finn Bauer",
          "Nb_Reviews": 1,
          "Date": "2023-07-29T23:13:12.000Z",
          "Titre": "Nice UI but very slow speed"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Kim Meam",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T15:41:41.000Z",
          "Titre": "Poor connection",
          "Contenu": "Poor connection. Slow connection."
        },
        {
          "Note": 2,
          "Lieu": "RU",
          "Pseudo": "Nikita Borzykh",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T10:02:58.000Z",
          "Titre": "poor LTE speed"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Ross",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T18:27:42.000Z",
          "Titre": "Erratic in the UK",
          "Contenu": "Erratic in the UK.  When it works it is seamless, but in 5 purchases it’s been fine three times and failed to register twice. Restarts often necessary to initialize or reset the eSIM.  Curious if it is a UK issue or a system issue."
        },
        {
          "Note": 3,
          "Lieu": "ES",
          "Pseudo": "Niklas Jingklev",
          "Nb_Reviews": 4,
          "Date": "2023-12-05T21:30:40.000Z",
          "Titre": "Easy payment and set up but slow",
          "Contenu": "Easy payment and installation, decent but not exceptionellt price. Only problem was that it was only 4g not 5g. That’s incredibly bad in 2023."
        },
        {
          "Note": 3,
          "Lieu": "CH",
          "Pseudo": "Nicolas",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T08:55:50.000Z",
          "Titre": "Bad experience in Laos",
          "Contenu": "Do NOT buy an APAC eSIM card from Nomad if you plan to visit LAOS! In the whole country the network speed is artificially limited to Nomad users to a point that it is not usable at all. My friend travelling with me had Holafly and had no issue when he used the same network provider than me. In Indonesia and Thailand the network was ok thought - no major issue there."
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "JOEP",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T22:00:16.000Z",
          "Titre": "Easy setup but",
          "Contenu": "Easy setup but, the frustrations of not having any signal whilst travelling in Sicily has been a real bugbear. Not sure if this would occur with other Esims or its an iphone 13 issue"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Michelle",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T06:14:27.000Z",
          "Titre": "Poor coverage in BCS Mexico.",
          "Contenu": "Poor coverage area in BCS. Only worked in Cabo and La Paz, I had no service in Todos Santos or Cabo Pulmo, or driving on the highways. But, Nomad offered me a partial refund and partial credit. So I feel they tried to remedy the situation as best they could. This is my first time using Nomad, hopefully their coverage is better in other areas I travel to."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Huu Nguyen",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T14:00:34.000Z",
          "Titre": "decent price europe pack avg speed",
          "Contenu": "i like the price for the 10g with 30 days. but not the performance . in Spain Italy and France the connection dropped around 20-25%. our kids got airalo and their connection are much better. when i got the signal the hotspot is soooo slow almost not worth it even fir basic stuff like google map."
        },
        {
          "Note": 3,
          "Lieu": "DK",
          "Pseudo": "Jose Gabriel",
          "Nb_Reviews": 2,
          "Date": "2023-10-23T10:43:17.000Z",
          "Titre": "The Internet signal was very very poor",
          "Contenu": "The Internet signal was very very poor specially in Florence. In Rome was a little bit better but still not super stable. I'm talking about normal use like using Google Maps, doing Google searches or at most using Instagram. Not even videos. Videos were absolutely impossible to see."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ken Nicolas",
          "Nb_Reviews": 2,
          "Date": "2023-10-16T22:47:02.000Z",
          "Titre": "Absolutely amazing experience using it…",
          "Contenu": "Absolutely amazing experience using it and setting up the e-sim. The usage was fine but I believe something is wrong with iOS17.0.3 where after using the e-sim, (meaning I returned to my home country and using my own simcard) the physical (original) sim can no longer accept sms messages from anyone. I have missed so many important text messages the past week of people trying to get ahold of me."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Logovo.ca",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T22:35:50.000Z",
          "Titre": "Patchy connection and long response time in urban CA and MI",
          "Contenu": "While I liked the setup and the plan price was adequate, I most often then not didn’t have the same reception quality as on my other device in roaming. Internet connection was iffy, ping response time was terrible. When it worked the speed was adequate for 4G though. I think next time I’m going to try a different eSim service."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Ivelin Grigorov",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T09:43:43.000Z",
          "Titre": "I’m happy with Nomad but Vodafone…",
          "Contenu": "I’m happy with Nomad but Vodafone network in Australia was deeply disappointing. It showed 1.5-2.0 Mbps download speed on speed test and was very slow as well."
        },
        {
          "Note": 3,
          "Lieu": "NO",
          "Pseudo": "Mr. Worldwide",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T17:38:08.000Z",
          "Titre": "Nomad eSIM worked well, but local SIM card was much cheaper",
          "Contenu": "The Nomad eSIM data plan worked well in Egypt. Nomad delivered as expected. However, the Nomad data plan was very expensive compared to local rates. When I arrived at the airport in Egypt, I got a local SIM card with 12 GB data for the same price as 1 GB data from Nomad. With the local SIM card I also got a local number and 450 minutes of local calls which came in handy when calling guides that had local numbers. I can only recommend Nomad eSIM if you are unable to get a local SIM card when arriving at an airport in Egypt."
        },
        {
          "Note": 3,
          "Lieu": "ID",
          "Pseudo": "Neil Cundy",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T08:58:29.000Z",
          "Titre": "Value for money.",
          "Contenu": "Value for money.Good reception in Bali.Quick to receive the link and setup. The app is good to monitor data usage.It took a while to actually get it working once we arrived. We could not connect to the internet. After lots of trial and error we managed it. Something to do with the roaming settings. Suggest clearer instructions to get working once activated. Hence I dropped the stars.Overall though we were very satisfied and will use again."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Cory  Tout",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T17:46:19.000Z",
          "Titre": "Deceptive advertising",
          "Contenu": "I liked the reliable 4G connection, that worked great in the remote areas of Norway.  I also appreciated the relative ease of activating my esim I didn't like that there was no customer support offline.  My sim card stopped working when I travelled into Sweden.  Your app is very deceiving in that it says it works throughout the EU, it wasn't clear that you had to buy a new plan with each country so I was only able to use 1/2 of the data and time I paid for .. not impressed with that"
        },
        {
          "Note": 3,
          "Lieu": "VN",
          "Pseudo": "Kevin",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T15:17:07.000Z",
          "Titre": "Could be better for returning users",
          "Contenu": "It was my second time using Nomad, wasn't sure I could reuse the same e-sim and didn't find the info anywhere. When I did mange to make it work by reinstalling a new one, the e-sim monitoring page was saying the card was not activated while I still had internet, meaning I couldn't monitor my data consumption. So yes it worked but was a bit of a frustrating experience."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Catherine  Howley",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T18:06:45.000Z",
          "Titre": "Fairly straightforward to use",
          "Contenu": "This was fairly economical to use while in Europe, amd allowed pretty smooth connectivity during the trip. TInitially there were some glitches with it, and I had to use my data plan coverage,  which was costly,  and couldn't use phone or access messages, but managed with Whatsapp and Messanger. Great short term."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Denis Vachon",
          "Nb_Reviews": 3,
          "Date": "2023-08-16T06:53:23.000Z",
          "Titre": "Automatic start to “Add On”",
          "Contenu": "I moved to France for a short work contract and I’m using NOMAD rather than getting a proper sim. The first one was fine and decided to do an “arson” before it expired. The problem is, the add on didn’t automatically start despite claiming it would, leaving me with no signal or connection. I had to go to local “Brasserie” at 11:30pm to order a drink to use their wifi to check emails, messages, etc and buy another esim to ensure I got through the days ahead."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Seki",
          "Nb_Reviews": 3,
          "Date": "2023-08-14T16:19:10.000Z",
          "Titre": "Awesome once it's set up correctly",
          "Contenu": "Once activated, this service worked super smoothly. However, I had issues getting Nomad to work initially. For the service to work, \"Data Roaming\" needed to be active on my iPhone, which I wasn't aware of. That information was only available via their online help page (which required internet, so I needed to find a free Wifi hotspot)."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "christian parent",
          "Nb_Reviews": 2,
          "Date": "2023-09-16T01:54:22.000Z",
          "Titre": "didn't work everywhere it was supposed…",
          "Contenu": "didn't work everywhere it was supposed to work. I had to go back to my carrier and buy an expensive amount of data so I could do some connections with hotels and other places. Update: In the last few weeks I have seen Nomad do serious analyzes of the situation to understand what went wrong and following that, made changes to make sure this kind of situation doesn't happen again. What I saw was a company that listens to the costumer and takes action when it's needed. The next time I have a similar need I will have no hesitation in trusting Nomad again. It's a company that just want the best for their customers."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Paul B",
          "Nb_Reviews": 1,
          "Date": "2023-08-27T17:20:20.000Z",
          "Titre": "It worked, but connection is routed via Hong Kong!",
          "Contenu": "It worked really easy and I didn't have any problems with connections. But I booked an eSIM for the US and yet my IP address was always in Hong Kong. As a result, I was often shown websites and search suggestions in Chinese and my logins locked up due to suspicious login locations. It is unacceptable that it does not state anywhere beforehand that the connection is routed via Hong Kong!"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Leo",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T10:39:25.000Z",
          "Titre": "Not the best in Germany",
          "Contenu": "It is easy to create an account and buy a data plan.However, when it comes to the data service, it's not the best. In Germany, O2 was selected as the preferred network. The webpages couldn't be loaded and the service was downgraded to 2G!!!Manual switching to Vodafone helped. However, the next day my phone was on O2 network again.Not the best experience."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T17:29:33.000Z",
          "Titre": "I bought 2 Europe e-sim card",
          "Contenu": "I bought 2 Europe e-sim card, installed on my wife’s and my iPhones and activated prior to our trip. My wife’s e-sim card worked very well throughout our time in Europe. I never got mine to work. In fairness to Nomad, their tech support was very responsive, more responsive than me, after several unsuccessful days I gave up and worked around it"
        },
        {
          "Note": 3,
          "Lieu": "NZ",
          "Pseudo": "Andrew",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T02:39:36.000Z",
          "Titre": "Constant E-sim restarts",
          "Contenu": "Pricing was good, and it was relatively easy to set up. For some reason, every time I dropped out of reception though, the E-sim would go wonky. I would have to turn the Sim off and on again, and sometimes restart my 4g connection in order to bring it back online. This happened numerous times and got really frustrating"
        },
        {
          "Note": 3,
          "Lieu": "BB",
          "Pseudo": "Adrian  Lorde",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T20:23:14.000Z",
          "Titre": "I was able to download the eSim but...",
          "Contenu": "I was able to download the eSim but had difficulty in activating it on my Android phone. They asked for fingerprint and did not give me the option of using a pattern.I will still use it again. Price is reasonable"
        },
        {
          "Note": 3,
          "Lieu": "SG",
          "Pseudo": "Chai",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T12:23:57.000Z",
          "Titre": "Reception was only good for the first few days",
          "Contenu": "The reception of the internet was good for the first 2-3 days but the internet connection became so unstable after that. I noticed the telco was changed to another one but I couldn't load google at all. Sometimes it even showed no service."
        },
        {
          "Note": 3,
          "Lieu": "HR",
          "Pseudo": "Nadav Bonen",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T08:58:21.000Z",
          "Titre": "It took few hours to get it working…",
          "Contenu": "It took few hours to get it working abroad and I needed to call the car agency. This is after I already installed the app and put the eSIM number as secondary. Tried activating through the app, scanning the QR code and what not. at home. I don’t remember what finally worked, maybe reboot. Once working it is working fine with good reception and 0 issues"
        },
        {
          "Note": 3,
          "Lieu": "SE",
          "Pseudo": "Miloš Sedak",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T11:07:32.000Z",
          "Titre": "The app is loading really slow",
          "Contenu": "The app is loading really slow, even on the Wi-Fi network. I’m stuck looking at the splash screen animation which stops and then it is static. Then you should include some more animation just to cut boredom waiting to see app and just to check how many Gb is left in my package. I’m using the IPhone 13pro max so it’s not a slow phone. And the 4G internet you have provided me with is of rather questionable quality, but I thing this is not what you asked to review."
        },
        {
          "Note": 3,
          "Lieu": "KZ",
          "Pseudo": "Margo Robinson",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T15:03:17.000Z",
          "Titre": "The plan worked pretty well",
          "Contenu": "The plan worked pretty well. I could have used a few more instructions on connecting to the new countries' network, it was hard to find. Also my main reason for only 3 stars is that I got no warning for when I was getting close to using my data and I got stuck in a big city in a country I didn't speak the language of with no way to contact my friends. If I had been warned I would've added more data when I was still able."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "carol theriault",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T04:03:33.000Z",
          "Titre": "Esim Usa with T-mobile speed poor 4G",
          "Contenu": "Essy to install on my Iphone 13. Instruction easy. Start my travel New Hampshire, Vermont, Maine. Coverage weak signal check a lot. Data transfert very slowIy. I disappointed. Question If take esim with order provider AT&T coverage it is best in the area?"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Rey",
          "Nb_Reviews": 2,
          "Date": "2023-05-22T03:21:10.000Z",
          "Titre": "Not completely reliable",
          "Contenu": "I bought a Europe eSIM and for the most part it worked ok. My two complaints, though, is that even though it said LTE+, it wasn't as fast as my LTE+ with my physical SIM card in Canada. My 2nd complaint and this is more serious than the speed, is that while I was in Vienna, Austria, my connection kept dropping! I don't believe I had the same issue in Bratislava, Slovenia, Budapest and Zagreb or at least it wasn't as noticeable or as frequent as in Vienna."
        },
        {
          "Note": 3,
          "Lieu": "SE",
          "Pseudo": "DOA",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T08:12:26.000Z",
          "Titre": "Great to use data, painful to install",
          "Contenu": "Overall I liked using Nomad and worked quite well for the period I purchased. However, the installation process is painful and the instructions were not clear. Perhaps the company should re-write the install instructions or even make a video with the steps."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Ben",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T15:45:53.000Z",
          "Titre": "Service was acceptable",
          "Contenu": "Service was pretty good. Had some issues with geofences for IP addressed (registering for local parking options), had to use a VPN to access a server in the USA to register. Setting up the e-sim wouldn't work unless on a wifi, using the QR code without internet, or copying and pasting the codes wouldn't work... Also, lost all of my contacts on iPhone until I got back to my original SIM card at home."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Passages28",
          "Nb_Reviews": 2,
          "Date": "2023-08-10T17:31:42.000Z",
          "Titre": "Uneven Connections",
          "Contenu": "Even though a lot of our journey along the corridor from Billings to Lake Tahoe involves a lot of rural areas, we were still getting only 1-2 bars of connectivity even in several larger centres. Downloading information was very slow because of it. There was no connection to Verizon at all as we were driving up to Billings on our return trip home though we did have connection to a network the following morning when we left Billings."
        },
        {
          "Note": 3,
          "Lieu": "MY",
          "Pseudo": "Dirk Polte",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T05:10:08.000Z",
          "Titre": "The 2nd time (Singapore) I had trouble…",
          "Contenu": "The 2nd time (Singapore) I had trouble to activate the eSim. Before in Thailand it worked well. I followed all your instructions but failed. After some time I gave up. Most probably it was my fault but generally I am smart enough to manage this kind of „technical challenges“. I think you could be more successful if the process of activation would be more simple. For the time being I will use other eSim providers but I will as well follow your App to see if you can make some effective improvements - in general I like your App. So - maybe I will be back one day. Best regards Dirk Polte"
        },
        {
          "Note": 3,
          "Lieu": "ES",
          "Pseudo": "Carlos  Adell Talayero",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T11:03:59.000Z",
          "Titre": "The connection issues",
          "Contenu": "The connection is fluent, when there is internet. however many times in public places or on specific times on the day, there is no connection"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "OV",
          "Nb_Reviews": 2,
          "Date": "2023-07-09T08:16:23.000Z",
          "Titre": "Set up was easy, but it stopped working",
          "Contenu": "Set up was easy.  It worked right away upon landing.  Everything seemed perfect until it stopped working.Settings weren't changed - I simply no londer had a connection.  I needed to find a place with free WiFi to reach customer service.Nomad customer service was really good and had me change settings and restart the phone.  It did the trick.The SIM stopped working a couple times more, but a restart got it going again.Unfortunately, I can't leave a high rating given that the SIM left me cut off away from our resort."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "TeeKeesla",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T15:28:49.000Z",
          "Titre": "Slower data speeds on T-Mobile US",
          "Contenu": "Gotta say that the data is significantly slower on the T-Mobile network. I switched from SimTex to Nomad and saw a decline in service. In addition, certain US sites are blocked since the IP address is originating from a foreign country."
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "Riccardo Lodi",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T11:27:52.000Z",
          "Titre": "Works on smartphone, impossible to use hotspot. Frequent disruptions in data",
          "Contenu": "Works well for basic stuff on your smartphone, but it is literally impossible to use it as a hotspot, I had chosen Nomad as it’s one of the few e-sims that allow hotspot in Spain. There are continuous disruptions and you need to switch on/off airplane mode to get the line. Will probably consider again for buying a few GB for my smartphone, but please don’t rely on Nomad to use your device as a hotspot (host server is in Sweden so ping is always extremely high)"
        },
        {
          "Note": 3,
          "Lieu": "ZA",
          "Pseudo": "NDM",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T06:12:13.000Z",
          "Titre": "Poor coverage",
          "Contenu": "Following my review below Nomad contacted me, offered to investigate, subsequently confirmed my experience, issued me a refund and assured me that they now have offerings that would address the poor coverage. Hence, I cannot fault the support they have offered. I will find out about the coverage when I next travel.I really like the ability to buy mobile coverage for trips in a convenient way. But for my recent US west coast trip the coverage provided was poor overall even in the SF Bay Area."
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "SH",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T16:37:23.000Z",
          "Titre": "App is good, plans are hit or miss",
          "Contenu": "The NOMAD app is pretty easy to navigate and the plan costs are reasonable. However, the plan I got was provided by T-Mobile and the coverage was very poor. On a trip from NYC to Niagara up state, the service dropped frequently. My cousin had Verizon on her phone and her service was very consistent (thankfully since we needed Google Maps for the journey)."
        },
        {
          "Note": 3,
          "Lieu": "SG",
          "Pseudo": "Sonja",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T06:00:02.000Z",
          "Titre": "Good package but sudden connection stopps",
          "Contenu": "If the coneection worked it was really good. But on some days I had no connection for hours and also on my 10th snd last day in Malaysia the internet didn‘t work what really annoyed.I don‘t know why it stopped working but it couldn‘t the end of my data package bc I had 15 GB and had only the 10th day. When it worked I had good connection and it was easy to install and also the price was good compared to others."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Leon H.",
          "Nb_Reviews": 2,
          "Date": "2023-10-03T07:21:52.000Z",
          "Titre": "Installation is easy, pricing is good, reception mediocre",
          "Contenu": "This is a good deal for traveling. However, in the US the reception isn’t too good. It’s very unstable, mostly AT&t (almost never Verizon)."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Marian",
          "Nb_Reviews": 3,
          "Date": "2023-05-16T08:25:48.000Z",
          "Titre": "Not what was promised",
          "Contenu": "I did not find this exerience as promised. My card failed to start on arrival, saying 'expired' before my holiday started. This took some time to be resolved. I had chosen to top up after the first month as I was not sure how much data I would use, however even though all instructions were followed to the letter, my top up did not kick in as expected. This meant that I lost the remaining data credit from the first card, then spent a day with no phone waiting for support. I am not likely to use again. Disappointing."
        },
        {
          "Note": 3,
          "Lieu": "BR",
          "Pseudo": "Octavio Aronis",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T04:01:38.000Z",
          "Titre": "We had some problems to connect by the…",
          "Contenu": "We had some problems to connect by the time we arrived in Austria.However, our son was able to assist as he was in Brazil and he entered in the platform to solver the problem.We also did not know that there would be a limit to use the system and I got really frustrated by the time that I could not mantain the operation.In this scenario, I do suggest to receive a message by the time that  the credit is finishing and offering the opportunity to renew it."
        },
        {
          "Note": 3,
          "Lieu": "IL",
          "Pseudo": "casual user",
          "Nb_Reviews": 2,
          "Date": "2023-08-22T06:33:20.000Z",
          "Titre": "Easy to purchase",
          "Contenu": "Easy to purchase, hard to cancel.The installation instructions are incomplete.I had to restart one device and take out the physical sim of another.Everything worked well after the initial issues were resolved."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Artur N.",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T19:37:16.000Z",
          "Titre": "Hard to get started, slow in USA",
          "Contenu": "I can say it works eventually, but it took one day before it started. If there was no Wi-Fi on the airport or I wasn't picked up by a friend i would be in bad position.I'm still giving 3/5 as the support is very responsive and definitely want to help, but the service in USA it's quite poor."
        },
        {
          "Note": 3,
          "Lieu": "TR",
          "Pseudo": "Kerem Zaglul",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T10:52:01.000Z",
          "Titre": "Poor to non internet connection",
          "Contenu": "The internet connection throughout our holiday in Greece was average to poor. Me and my brother both of us purchased a 30 day 20 GB Europe data package.We travelled from Alexandrapol to Halkidiki and Kavala. Overall we couldn't use the data plan almost at all. We ended up using 5 GB data each. Unfortunately I wouldn't advice this data plan to anyone who is going to travel the same path.Update:On 30th of July I sent an email to the mentioned address and shared our Order IDs. Since then I am waiting. I will keep the message updated if any change happens.Update 2:On 7th of August I received an email from Nomad Support Team that they refunded the unused amount of the price back to my credit card. Moreover they also provided a 3$ promo to my account.All in all even though we had a bad experience during our holiday, the support team and after sales handled the issue exceptionally. Thanks for the support and understanding.Thanks,"
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Prashant Nagpal",
          "Nb_Reviews": 3,
          "Date": "2023-06-05T06:53:31.000Z",
          "Titre": "Easy to use but poor coverage",
          "Contenu": "I went for a T-Mobile SIM - while the price was good there was hardly ever any network coverage, whether in big or small cities. In the end I never had to worry about using up my data, because I could hardly ever connect.The product was easy to use and compare, but the network quality was a crucial miss"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "j t",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T14:56:40.000Z",
          "Titre": "Useful but slow at times",
          "Contenu": "I've used Nomad on 4 trips to the states in the past 6 months for the sake of convenience and cost effectiveness. It is a cheap option compared to buying sim-card and it's easy to install as it doesn't require a physical sim. However during certain times on our trips, we would run into slow speeds from the connectivity to a point where nothing loads on our phones. This has caused frustration as we rely on apps such as Google Maps for navigation and other apps for Parking. One thing to point is that this doesn't happen all the time but at random times during the day and it would be consistent with all of the other phones that are using Nomad within our group. I really hope Nomad will work on maintaining the stability of their network speeds as this app is too useful to be malfunctioning."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Olena Zlatkina",
          "Nb_Reviews": 1,
          "Date": "2023-07-17T22:28:03.000Z",
          "Titre": "Overall experience was good",
          "Contenu": "Overall experience was good. It would be very helpful to send a notifications when the limit of data are coming to limit. Also after the eSim limit was used the app showed notification that I don't have internet connection instead of showing that all data limit was used. That was confusing and misleading.Otherwise the net worked pretty well, instructions how to set it up were clear to follow."
        },
        {
          "Note": 3,
          "Lieu": "NP",
          "Pseudo": "Paul Felstein",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T12:34:58.000Z",
          "Titre": "It’s an overpriced way of solving the…",
          "Contenu": "It’s an overpriced way of solving the sim issues with travel . I like the choice of large or small plans , but doing your homework realises the expensive option that often can’t be justified"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Diane Courtois",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T17:18:05.000Z",
          "Titre": "Hard to get access to everything on my phone",
          "Contenu": "I was not user friendly to use after the installation. We are 6 With  this application and we had a lot of problems to get all the services that se want."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kip True",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T04:20:37.000Z",
          "Titre": "eSim tech kinda cool, net cost savings nil",
          "Contenu": "The eSim itself worked well enough, but there was no net benefit because it didn’t save enough usage on my international roaming, and 1GB of data isn’t what it used to be.  My $9 experiment with an eSim taught me I don’t have much use for an eSim."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Travis",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T14:06:50.000Z",
          "Titre": "SIM card problems in 2 Countries",
          "Contenu": "Initially the sim card did not work in two countries I visited (France and Italy).  Customer support was helpful in providing the needed APN and network information (and directions on how update it) to make the sim card work.  Customer service was helpful in getting the sim card working again, but I would recommend requesting APN and network settings from Nomad prior to travel if you do not have a back-up option.Update:  Nomad did provide a link to changing the APN in one of the set-up e-mails.  Be sure to ask for the country specific networks in advance and know you may need to reset up the APN as you travel between countries."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Edward",
          "Nb_Reviews": 2,
          "Date": "2023-08-04T12:32:37.000Z",
          "Titre": "Easy to use but very slow connection",
          "Contenu": "First time user, refer from a friend who used Nomad for Spain trip.  I used for my 14 day USA tripPro: easy setup and use, price is reasonable.Con: very slow connection, there is no way this is 5g or even 4g.  Feels like 3g.  I did follow the instructions and triwd to switch between networks but doesn't make any difference.  The slow connection is not just 1 spot,it was the whole trip in big cities like Washington DC or New York city."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Siri C.",
          "Nb_Reviews": 1,
          "Date": "2023-07-01T14:14:05.000Z",
          "Titre": "Pros and cons",
          "Contenu": "I liked the ease of buying an eSim prior to my travel. It felt new and practical. My son had to install it for me. Once in NY it took me a while to understand I needed to press data roaming to get the internet (it was in the instructions). WhatsApp functioned well, but Google Maps and the GPS did not. I did not get internet on the street. I wish it had come with a telephone number. I am glad I tried it, but next time, unless you develop this more, I will probably get a physical sim card"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Steve",
          "Nb_Reviews": 3,
          "Date": "2023-05-15T13:38:58.000Z",
          "Titre": "Was OK, but will compare with other providers next time.",
          "Contenu": "Relatively easy to install and to use. Prices are just OK and below the exorbitant prices from main carriers when roaming. Network was quite slow and weak in Playa del Carmen, Mexico. Barely not 4G."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Vinesh Nair",
          "Nb_Reviews": 7,
          "Date": "2023-09-21T12:36:03.000Z",
          "Titre": "Data stops working at 0.6GB",
          "Contenu": "The data stops working when you have a balance of 0.6GB. Initially, I thought it was some trouble with the network, but later, when I add-on my package, it instantly continued working like a charm. Then it happened again when my data reached 0.6GB. It was a day left on holiday, and 0.6GB would have been enough, but I had to add-on again just to get it working. Disappointed."
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "Jennifer Zambelli",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T05:19:27.000Z",
          "Titre": "I am afraid that I found No ad very…",
          "Contenu": "I am afraid that I found No ad very difficult to set up. I am not a complete Luddite when it comes to technology but found it hard to get the settings right on my phone. I was the first five days of my trip without access and finally cracked the correct combination of this turned off and this turned on. I reached out to the help desk at day five and they did try to contact me to assist but when travelling these things can be tricky. Now that it is running, it is good. I would use it again but the instructions are not that clear for older people who may not be as tech savvy as more experienced or younger people."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Ajay",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T17:31:00.000Z",
          "Titre": "Promotion code did not work"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Lee",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T07:09:16.000Z",
          "Titre": "NOMAD is great but speed is terrible",
          "Contenu": "The purchase and activation process is easy, the SIM card activated as soon as I connected to the network and you can track data use in the app which is great.The issue is the data speed and stability of this service. I bought a 10GB Asia SIM to use in Singapore and India, it's with JoyTelecom. The connection was so bad in some cases I had to connect to a local's hotspot which was fast and stable. Video calls connect ok, but freeze every few seconds. Downloads are slow and in some cases they just stop as if they don't work. Even with this SIM card I was constantly looking for wifi. I would happily pay more for a faster more stable connection, but this is the only option. It's disappointing given everything else about my experience with NOMAD is positive."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Craig Simmons",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T10:56:17.000Z",
          "Titre": "Great when it worked",
          "Contenu": "Great when it worked - but kept saying I wasnt connected even though I had a strong 4G connection."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Janna",
          "Nb_Reviews": 3,
          "Date": "2023-05-15T13:29:33.000Z",
          "Titre": "E sim and a primary carrier don’t play well together if you have a major carrier",
          "Contenu": "I could never figure out how to not get travel pass charges from my US carrier - Verizon.  They just said to put the phone on airplane mode.  That totally defeats the purpose of using Nomad.  I just gave up and used their service, so wasted my nomad money.  Nomad help desk didn’t really help either.  Nomad is prob fine if you don’t have another carrier like Verizon.  Would love to know how to get it to work as we have other trips,  it am doubtful"
        },
        {
          "Note": 3,
          "Lieu": "TR",
          "Pseudo": "Furkan Kaynak",
          "Nb_Reviews": 2,
          "Date": "2023-07-12T07:54:09.000Z",
          "Titre": "Not good not bad",
          "Contenu": "I bought it for Germany, France, Luxembourg and Belgium. I have started to my trip from Berlin / Germany. And I almost could not connect to the internet in Berlin for 4 days. And this was also same for Nuremberg and Dresden. After 7 days I can use only 200mb internet. It was terrible. But outside Germany it was good."
        },
        {
          "Note": 3,
          "Lieu": "IL",
          "Pseudo": "Tal Cohen",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T19:23:45.000Z",
          "Titre": "Interface is nice and everything but…",
          "Contenu": "Interface is nice and everything but all I wanted is a data plan and somehow it didn’t work as expected.1. Since the customer are using it mostly on vacations, time is critical here and customer service that answer after a few hours or the next day is problematic. 2. Unlimited plans and very much limited to a 2 gigs a day, so basically if you’re on a 7 days vacation and you bought an unlimited plan you maybe got a 10 gig plan, and probably less than that.3. In my case, after using my 2 gig on 1 day, cx said I should be able to have my full bandwidth after 24h max which didn’t happen and basically never restored to the speed I first had. 4. Cx said you’ll refund me with half the  money, but it didn’t happen. Overall 3/5 because it worked fine for a few days."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Richard  G",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T20:39:46.000Z",
          "Titre": "many steps to switch over to the secondary or the nomad e-sim from the primary SIM card from my regular home service",
          "Contenu": "After clicking to install the E-SIM in the email sent after purchase, and finally arriving at my vacation Destination, I discovered there are many steps to switch over to the secondary or the nomad e-sim from the primary SIM card from my regular home serviceThen I was asked perplexing questions about icloud account settings and other little pop ups that were confusing and not clearly explainedDefinitely not a one click changeover to nomad!"
        },
        {
          "Note": 3,
          "Lieu": "SA",
          "Pseudo": "nasser alrshheed",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T23:54:51.000Z",
          "Titre": "Many times the service is interrupted…",
          "Contenu": "Many times the service is interrupted and there is no internetكثير من الوقت تنقطع الخدمة ولا يوجد انترنت"
        },
        {
          "Note": 3,
          "Lieu": "SG",
          "Pseudo": "Anwar Hussain",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T07:55:21.000Z",
          "Titre": "Data Connection",
          "Contenu": "It does work very well. It was quite difficult to connect for use. There are several times data connection got lost. Voice conversation has very low quality."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Naciye",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T13:00:12.000Z",
          "Titre": "Not good for hotspot usage",
          "Contenu": "Works great for one device but only messaging worked when I connected my other device via hotspot even though I should have had 4G"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Jean Sebastien --",
          "Nb_Reviews": 5,
          "Date": "2023-08-21T18:11:02.000Z",
          "Titre": "Good and easy to use when you install",
          "Contenu": "At first, it was easy for me to install the esim. When i tried to recharge it, I was unable to make it work. So I had to use my own plan which led me to pay 15$ plus taxes for one day. Instructions are not enough clear and example screen doesn't show tha same thing on my iphone. I will need to contact client support to make it work"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Ann  Prins",
          "Nb_Reviews": 3,
          "Date": "2023-05-15T14:18:42.000Z",
          "Titre": "The first time I used Nomad worked so…",
          "Contenu": "The first time I used Nomad worked so well , next time not so much . It wouldn’t work for me half the time so ended up just deleting before it expired so as I would have internet even though costing me more ."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nomad User",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T07:55:17.000Z",
          "Titre": "Product is solid but integration tricky.",
          "Contenu": "Product is solid, but integration with iphone is tricky. Installation instructions did not match what I experienced, so it required some research and experimentation to sort out. The app has disrupted imessages and integration of that function across my devices. WIll things return to normal once my plan is expired and I remove the esim? We'll see. As with many apps, nomad takes a breezy approach to communications that doesn't match the complications customers encounter. It's annoying and unnecessary."
        },
        {
          "Note": 3,
          "Lieu": "IL",
          "Pseudo": "Ronen",
          "Nb_Reviews": 2,
          "Date": "2023-09-11T09:12:10.000Z",
          "Titre": "I wasn't aware that SIM app-activation is required",
          "Contenu": "I wasn't aware that activating the eSIM in the Nomad App was a prerequisite for use. I assumed it would function once the eSIM was turned on in the destination country, similar to how Airalo operates. However, after activation, it worked flawlessly."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Julie Dumont",
          "Nb_Reviews": 1,
          "Date": "2023-07-23T18:59:02.000Z",
          "Titre": "The signal was poorly (interrupted…",
          "Contenu": "The signal was poorly (interrupted sometimes), mostly in small town. Maybe they miss the inclusion of 5G signal in your package for Greece. Furthermore, the application in general was good."
        },
        {
          "Note": 3,
          "Lieu": "SG",
          "Pseudo": "jay",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T12:03:16.000Z",
          "Titre": "Great, just need more data!",
          "Contenu": "I travel a lot and find the nomad sim great for when I first land in a new country and need mobile data for a day or two before I get a local sim. I appreciate the mobile app and how quick it is to spin up a new sim.My only gripe is the data packages are way too small on the lower plans. More than one I've used all the data wayyy before the sim expires."
        },
        {
          "Note": 3,
          "Lieu": "NO",
          "Pseudo": "HAMID BAHADOR",
          "Nb_Reviews": 2,
          "Date": "2023-10-15T17:37:46.000Z",
          "Titre": "USA and Mexico",
          "Contenu": "I used for my travelling in USA and Mexico. The US was ok but there was always problem to find reception in Mexico."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "SAMUEL",
          "Nb_Reviews": 7,
          "Date": "2023-06-21T17:11:17.000Z",
          "Titre": "It took me hole day to activate  ESIM…",
          "Contenu": "It took me hole day to activate  ESIM on my phone. Eventually I was advise manually  change my phone network setting, rename APN. Also communication speed wasn't great."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Minji Kim",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T18:13:45.000Z",
          "Titre": "The internet is too slow"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Ashton Clapp",
          "Nb_Reviews": 11,
          "Date": "2022-03-05T14:24:18.000Z",
          "Titre": "Decent app, lame spam emails",
          "Contenu": "The app works as expected and provided excellent coverage during a recent trip.The fact their marketing emails have no automated unsubscribe link, and that you have to fill out a form on their website to opt-out of spam is comple"
        },
        {
          "Note": 3,
          "Lieu": "JP",
          "Pseudo": "E. L.",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T11:47:57.000Z",
          "Titre": "App doesn't sync with purchase",
          "Contenu": "I purchased my data package online and downloaded the app afterwards to keep better track of my usage on my device, but the app didn't sync properly with the actual activation date.  The app only started counting the days when I activated the app, not the data package, so it's not useful at this point."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Judy M",
          "Nb_Reviews": 2,
          "Date": "2023-07-11T03:53:09.000Z",
          "Titre": "I had difficulty setting it up and…",
          "Contenu": "I had difficulty setting it up and didn’t think the help information offered enough detail. I finally got it working by trial and error."
        },
        {
          "Note": 3,
          "Lieu": "EE",
          "Pseudo": "Dagny Kungus",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T12:15:15.000Z",
          "Titre": "Setting up the e-SIM was unsuccessful…",
          "Contenu": "Setting up the e-SIM was unsuccessful couple of times and then it suddenly work. Although the SIM was installed as requested but the app didn't find it."
        },
        {
          "Note": 3,
          "Lieu": "SG",
          "Pseudo": "Ng",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T02:43:01.000Z",
          "Titre": "It was good and fast but for some…",
          "Contenu": "It was good and fast but for some reason I was unable to scroll tik tok till I turn off this e sim in msia"
        },
        {
          "Note": 3,
          "Lieu": "CO",
          "Pseudo": "Carlos Ventrillon",
          "Nb_Reviews": 2,
          "Date": "2023-05-15T13:00:44.000Z",
          "Titre": "The eSim works slowly",
          "Contenu": "The eSim works, but not at the speed of a physical local sim. Somehow the 4G connection is a lot slower and many areas with poor signal, more like a 3G"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 6,
          "Date": "2023-06-25T09:28:11.000Z",
          "Titre": "Good price but slow speed & coverage",
          "Contenu": "Pound for pound Nomad has best price for data. Mine was using T-Mobile network. Connection speed was only 4G (not LTE or 5G). Sometimes, signal is good but could not load a page in a browser, and had to use WiFi. Sometimes, I just don't get any data connection."
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "Kaisha Alisha Phillips",
          "Nb_Reviews": 2,
          "Date": "2023-06-13T14:28:46.000Z",
          "Titre": "Prompt when data is about to end would be nice",
          "Contenu": "Data does not kick in immediately,The app should give you a notification when your data is ending, and prompt you to purchase add ons"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Peter Fitzroy",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T23:25:20.000Z",
          "Titre": "I found it difficult to activate",
          "Contenu": "I found it difficult to activate, and it did not help me much in China, but that could be because I was unsure how to configure it"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Elee",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T08:51:54.000Z",
          "Titre": "Internet kept dropping out and taking a…",
          "Contenu": "Internet kept dropping out and taking a while to connect when leaving somewhere with Wifi. But when the internet worked there was no issues."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Crypto user",
          "Nb_Reviews": 2,
          "Date": "2023-06-05T10:02:01.000Z",
          "Titre": "After 100 mb, it's throttled in NZ",
          "Contenu": "After 100 mb, the usage on the network in NZ was throttled to the point where I can't get data.I'm supposed to get 10gb of data for 30 days. Nomad is a rip off. Avoid at all costs.Edit: they reenabled data almost immediately but I gave 3stars because the speed is slow."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T01:35:29.000Z",
          "Titre": "Dependable connection - slow speeds",
          "Contenu": "Dependable connection. But slow (under 10 mbps) in comparison to someone used to higher connection speeds. Priced properly,"
        },
        {
          "Note": 3,
          "Lieu": "SE",
          "Pseudo": "Zainab  Ibrahim",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T23:27:19.000Z",
          "Titre": "Some places there are no signal and…",
          "Contenu": "Some places there are no signal and some places the data discount but overall it’s a good app and easy steps to install"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "ManTek Yeung",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T00:27:25.000Z",
          "Titre": "Slow wireless speed",
          "Contenu": "Everything was fine expect the internet speed. I use airalo usually which provides might faster wireless connectivity."
        },
        {
          "Note": 3,
          "Lieu": "BA",
          "Pseudo": "Milan Skenderija",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T13:52:15.000Z",
          "Titre": "Internet wasn't very fast",
          "Contenu": "Internet wasn't very fast, although it's 5G, it was slower than 4G at my network operator back home."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Dani Padilla",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T00:44:15.000Z",
          "Titre": "Experience using Nomad eSIM",
          "Contenu": "Works great when in the lager cities. Very spotty and unreliable when travelling between states and smaller towns."
        },
        {
          "Note": 3,
          "Lieu": "LB",
          "Pseudo": "Rabih Khatib",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T15:01:39.000Z",
          "Titre": "easy to use, bad in crowds",
          "Contenu": "The Nomad eSim is easy to use; however in crowded areas the service becomes null as if there is no eSim at all."
        },
        {
          "Note": 3,
          "Lieu": "SG",
          "Pseudo": "HL Lim",
          "Nb_Reviews": 2,
          "Date": "2023-06-06T14:25:20.000Z",
          "Titre": "not so good in Johor",
          "Contenu": "Worked well previously in Europe but not so well in Bali and latest try in Johor.You need to get more coverage in Johor, Malaysia."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Fred",
          "Nb_Reviews": 2,
          "Date": "2023-08-08T15:44:06.000Z",
          "Titre": "Easy solution with limitations",
          "Contenu": "Easy to set up but since it used 4G and 3G network, coverage was difficult at some places."
        },
        {
          "Note": 3,
          "Lieu": "RU",
          "Pseudo": "STANISLAV STAROVOITOV",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T18:09:49.000Z",
          "Titre": "Was not able to activate my plan at…",
          "Contenu": "Was not able to activate my plan at website(the button was missed, some problems with layout apparently), only in app"
        },
        {
          "Note": 3,
          "Lieu": "FI",
          "Pseudo": "Seppo",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T13:59:09.000Z",
          "Titre": "eSIM install needs to be easier",
          "Contenu": "The idea and presentation of the app are good. On Android Nomad does not work as well as Airalo. With Nomad you have to take screenshots of QR codes to install instead of a single click."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "María Gómez",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T21:18:07.000Z",
          "Titre": "The signal is not that good",
          "Contenu": "The signal is not that good, sometimes I have no service where my friends do have.The purchase through the app was really easy and it was also easy to install on my Samsung."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Bob V",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T01:15:56.000Z",
          "Titre": "Slow spee, UK prices shown here n Google",
          "Contenu": "I was travelling in the US. Speeds were slow even when showing 5G. Any google searches showed pricing in UK pounds not US$. Google news was all UK based."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T16:35:47.000Z",
          "Titre": "More expensive than other companies but the speed and connectivity were great",
          "Contenu": "The internet speed and connectivity were both great, never had any problems with the speed or the connectivity. The only downside is that it’s pricy. It’s more expensive than all the other companies out there, there were most definitely cheaper options. That’s why I’m giving 4 Stars. The price can be matched with other companies, other than everything else was great about this eSIM internet."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Dancing Burningman",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T10:31:56.000Z",
          "Titre": "Most the Time Good only had 2 Days the…",
          "Contenu": "Most the Time Good only had 2 Days the connection could not be established but the Price is right half what my Provider asks for."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mahnoor",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T18:54:15.000Z",
          "Titre": "Easy, convenient but pricy",
          "Contenu": "I used nomad a lot as I was travelling, and choosing a package for a continent rather than each individual country was an excellent feature! However, I did find the prices pretty expensive."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Caroline D",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T07:19:14.000Z",
          "Titre": "Pretty reliable service & mostly seamless.",
          "Contenu": "Pretty reliable service.  Several hours offline when arriving in Cambodia. Wasn’t clear how to get support to fix the issue. Otherwise seamless and good experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shenny Tang",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T05:13:08.000Z",
          "Titre": "Average Coverage in Paris",
          "Contenu": "the coverage around Paris was not great at some places but overall it was okay."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "howard",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T22:53:11.000Z",
          "Titre": "Works well but complicated to activeate",
          "Contenu": "The eSIM worked well but was not as straightforward to install nd activate as described"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Sue Sue",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T04:45:04.000Z",
          "Titre": "Worth it. Recommend it",
          "Contenu": "Advantage: really easy to set up. Immediately connect once landed airport. No hassle to look for telco ship.No issue using in cairns cbd area-for payment, book Uber etc.Disadvantage: few locations had no data or totally unable to downloading such as Daintree  forest, cairns railway station, inside kuranda railway and on Great Barrier Reef cruise"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Catherine Angeles",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T14:36:57.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good. I've used it in Hongkong, Vietnam, Singapore, Indonesia, Australia. I've only lost signal in Cambodia but no big deal. 😀 i hope Nomad will have 5G soon as well."
        },
        {
          "Note": 4,
          "Lieu": "SE",
          "Pseudo": "Inese Mazurewicz",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T13:43:34.000Z",
          "Titre": "First time using eSim",
          "Contenu": "First time using eSim. Lot easier than I thought. Only glitch was when I added more time, I had to actually enter it, when the website told me it would do that automatically."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Maria Teresa moura",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T19:17:01.000Z",
          "Titre": "Problem with network selection",
          "Contenu": "I was at the bus and I needed my phone to show the bus ticket in the app and suddenly I noticed that internet was off. I explained the situation to the bus driver and he let me enter the bus. At home, reading Nomad FAQ I learned that network selection is automatic by default and if internet doesn't work you can change and select another network. Now everything is ok!"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Daniel Adu",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T14:14:17.000Z",
          "Titre": "To be honest l try many esim in Turkey…",
          "Contenu": "To be honest l try many esim in Turkey but  my son ask me to use your esim and am happy with it 😊. I will ask people going to use Nomad. Is the best 👌"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Gillian Lewis",
          "Nb_Reviews": 8,
          "Date": "2023-11-21T17:06:46.000Z",
          "Titre": "Well priced product that we used in China",
          "Contenu": "We used Nomad and it gave a really well priced and reliable service that we used in China. I have given a 4 star review as the set up was a little confusing as a UK user since the instructions were based on settings on US (I assume) mobile phones, and individual screenshots of the steps to take would have been useful rather than  quickly repeating video shots. It also took a couple of days for the esim to activate on one of our phones which we weren’t expecting and didn’t know how to speed up the connection process. Overall however, I would recommend and use when travelling again."
        },
        {
          "Note": 4,
          "Lieu": "HK",
          "Pseudo": "Nicholas Corr",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T00:45:49.000Z",
          "Titre": "eSIM works",
          "Contenu": "The one thing I don't really understand is why QR codes are the way phones have chosen to go for these sims.  The only way I could figure out how to activate was to ask a stranger to take a picture of the QR code on my phone, such that I was able to use my QR scan on the picture... There's got to be a better way."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-03T14:44:54.000Z",
          "Titre": "Was nice that I was able to immediately…",
          "Contenu": "Was nice that I was able to immediately use it and  the UX was not bad. The main problem is that the connection is not really good and sometimes I had to wait a bit until was able to find a network. But great value for the money 💰"
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Chris J",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T23:13:58.000Z",
          "Titre": "Works in Quintana Roo",
          "Contenu": "Works in Quintana Roo. Select the Truphone option to have access to Telcel as they have the better connectivity. You have enable roaming for it to work. The install was pretty straightforward. Mostly need this for Google Maps for navigation and you get 4G in most major roadway areas. Might have trouble in the jungle, but didn't go that far off the beaten track."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Published Author",
          "Nb_Reviews": 5,
          "Date": "2023-12-01T05:59:37.000Z",
          "Titre": "Great to have cheap international data",
          "Contenu": "The data was great, and so much cheaper than roaming. It was a bit fiddle to set up, but it was worth it. The texts worked in the country, but I couldn’t get them working with international numbers. But overall, really happy."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "YFL",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T03:08:58.000Z",
          "Titre": "Easy to connect",
          "Contenu": "Easy to connect, but I don't know why the speed is quite slow in Germany, especially when it has reached the limit of my package. I bought for 10 GB but the speed became slower when it reached 8 GB."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "James Newman",
          "Nb_Reviews": 11,
          "Date": "2023-11-14T19:37:03.000Z",
          "Titre": "Once set up great service and value",
          "Contenu": "I did have some trouble getting the settings right for a data only e-Sim for the USA but got there in the end. Once it was up and running it worked perfectly. It was good value for money and a lot cheaper than using a roaming package from my home mobile operator."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "James",
          "Nb_Reviews": 2,
          "Date": "2023-10-12T20:32:47.000Z",
          "Titre": "First attempt at using an eSIM",
          "Contenu": "Nomad made my first attempt at using an eSIM easy and straight forward mainly because of their App. It was also a lot less expensive than data roaming on my home country cell phone provider. I chose a multi-company eSIM for the UK to ensure I had good coverage from London to Scotland. It worked well except when I was moving (by train, bus or car) when it sometimes seemed to switch providers as I moved between towers causing Apps like Google Maps to freeze."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "LastBlow",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T14:19:14.000Z",
          "Titre": "eSIMs in Europe and UAE…",
          "Contenu": "Both eSIMs in Europe and the United Arab Emirats worked absolutely great! Only, to keep the price per Gb reasonable, had to get bigger cards, respectively 20 and 10 Gb - ended up using only 5 and 2 Gb?! Please, work on getting down the price per Gb, so people can buy what they will effectively use. Thank you for caring!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kyumin Lee",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T07:43:37.000Z",
          "Titre": "It was decent",
          "Contenu": "It was decent. Worked really well in Singapore, Thailand, and Taiwan. Worked less well in Malaysia, and not very well in Vietnam. So I think it really depends on the country."
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "Maysa Rossato",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T13:58:16.000Z",
          "Titre": "The e-card worked perfectly in Paris",
          "Contenu": "The e-card worked perfectly in Paris. Easy to install and nive connection. The only issue for me was that I recharge my e-card before my credits ended and I couldn't use this. When my first credit finished I had to buy another one to continuous using. I just recomend this :)"
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "Boh Ng",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T14:49:35.000Z",
          "Titre": "Very useful for overseas vacation",
          "Contenu": "Very useful for overseas vacation, but regret say that the signal was cut off for the last 21hrs."
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Werner",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T09:09:19.000Z",
          "Titre": "I was truly easy to use and set up",
          "Contenu": "I was truly easy to use and set up, had a connection straight through my trip. Data speed seemed to be lower than what other people with sim cards got, but not significantly enough to go through the sleep to buy a sim card at every destination. I travel allot for work and this will be my new go-to supplier for cell connection."
        },
        {
          "Note": 4,
          "Lieu": "KW",
          "Pseudo": "Saleem Alsaleem",
          "Nb_Reviews": 2,
          "Date": "2023-11-12T10:34:10.000Z",
          "Titre": "Was easy to install",
          "Contenu": "Was easy to install and amazed how automatically added Works great in 3 countries i was in On the beginning the usage get too high without using that much but in the 3rd day was fine even in high use , thanks for the offers was very nice 👍🏽"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Keong Lee",
          "Nb_Reviews": 8,
          "Date": "2023-11-03T10:53:53.000Z",
          "Titre": "Great app for travellers on the go",
          "Contenu": "Great app for travellers on the go. I managed with this e-Sim for Malaysia and Cambodia without switching to my primary provider whose charges are extremely high for Cambodia.I took out APAC package with 20GB at a reasonable price. Could have managed with just 5 GB for my duration of travel.Only annoying thing is the App does not warn you when you have nearly used up your quota. It just stop dead. And it is not easy to notice this is the status.Setting up could be tricky for those who are not savvy with your phone settings.Overall I am very happy to come across this travelling app.I will definitely use this service again."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Nigel",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T12:19:10.000Z",
          "Titre": "Easy to use, slight connection issues",
          "Contenu": "Was very easy to pick a plan, install the eSIM and monitor data usage.During the travel I lost data connectivity for about a minute once or twice a day at random times. Other people in my group also used Nomad and didn't have this problem so maybe it was because my phone is several years old."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 3,
          "Date": "2023-08-02T15:57:46.000Z",
          "Titre": "Highly recommend Nomad e-Sim for your travels but need more flexible/cheaper options",
          "Contenu": "Used Nomad e-Sim for 2week+ USA trip. Great to be able to use dual sim on my own phone - very flexible and easy. Online connectivity enabled me to navigate around cities easily, search for venues, hotels, sights, restaurants etc and stayed connected with friends and family all the time. Occasionally some web browsers would not load on service and had to wait for hotel WiFi to enable transaction.However, didn’t need 10GB for $20. Would like cheaper options for less GBs."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "S.C. Huka",
          "Nb_Reviews": 2,
          "Date": "2023-11-11T12:44:04.000Z",
          "Titre": "Perfect except for one thing",
          "Contenu": "Easy to install. Great prices. Worked perfectly. The only minus for me is that because of the Nomad esim, my phone thinks I’m in HK. I used esim for 2 week vacation, I saved tiktok vids for places to go to. I could not use my tiktok because it’s banned in HK.. So that was a bummer. Other than that, will be using Nomad for traveling abroad !"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Nadia C.",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T04:33:41.000Z",
          "Titre": "Loved it!",
          "Contenu": "Really great to be able to buy an e-sim and have cell service in England without having to change an actual SIM Card.  The only thing that would have made it a 5 star was to have the e-sim work immediately without having to actually take steps to activate it.  My mistake in thinking that when I switched on the e-sim, that it would work from that point onwards.  But that said, once I got past those first couple of steps, it worked like a charm."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Guest",
          "Nb_Reviews": 2,
          "Date": "2023-09-21T12:13:42.000Z",
          "Titre": "I’d like a bit more help with the instructions please!",
          "Contenu": "I’ve used Nomad several times now, and it always seems to take me a while at the point of arriving in the country to get the activation settings correct. The instruction are good, but I would really like a better blow by blow series of screenshots. I’m on iOS and i never seem to get things right until, eventually I work it out - But I’ll keep using Nomad - it works great!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Verity Easton",
          "Nb_Reviews": 12,
          "Date": "2023-10-20T16:50:05.000Z",
          "Titre": "Easy to use app & no need for a…",
          "Contenu": "Easy to use app & no need for a physical sim. The only negative is I lost connection fairly frequently - which is an inconvenience when U're trying to find your way around a foreign city."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "yoyo",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T02:08:41.000Z",
          "Titre": "Easy Purchase, Effortless Setup, and Outstanding Communication Quality",
          "Contenu": "During my trip to Taiwan, my SIM card was damaged, and I needed a new SIM card as soon as possible. That's when I discovered this eSIM service.The eSIM plan was easy to compare and purchase. The activation code was sent to me immediately, allowing me to use my phone effortlessly.Being able to purchase and start using it within minutes without the need to visit a physical store was incredibly convenient. The network quality was excellent, and I would definitely use it again for my future trip."
        },
        {
          "Note": 4,
          "Lieu": "HU",
          "Pseudo": "Adam K",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T14:22:28.000Z",
          "Titre": "a decent expirence",
          "Contenu": "Nomad was easy to setup and it worked like a charm. The only thing is (but this could be AT&T fault) that VoIP calls didn’t go through. When we were on wi-fi the same calls worked just fine. But on 4G it didn’t. We could watch videos, listen to music, even listen to the voice messages left on the same app.I got the package on a deal so it was well worth it!"
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "Lee",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T05:54:49.000Z",
          "Titre": "Value for money but occasional Network Issues",
          "Contenu": "Value for money and relatively easy to install with instructions provided.The network however kept dropping off and coming on at certain areas. We are outdoors in a city and it was frustrating at times. We were using the Asia Regional plan for Tokyo."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "chris",
          "Nb_Reviews": 14,
          "Date": "2023-10-12T15:27:04.000Z",
          "Titre": "I installed the Nomad E-sim to provide…",
          "Contenu": "I installed the Nomad E-sim to provide data for my iPhone & iPad whilst on holiday in the USA. I was able to use the iPhone hot-spot to connect my iPad. Everything worked well.The reason I am only giving 4 stars is because I had to buy a 1 month service when I was away for just 10 days, a cheaper 2 week option would be welcomed."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "ET",
          "Nb_Reviews": 4,
          "Date": "2023-08-07T17:49:28.000Z",
          "Titre": "Fair price for good service",
          "Contenu": "Fair price for good service. Having often used traditional SIM cards for regular travels in Asia, the NOMAD esim is easy to use and fairly priced. Recently some connectivity hickups in Japan but switching 5G providers manually solved the problem. So could have been a provider issue and not NOMAD"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-10-01T11:15:31.000Z",
          "Titre": "East Africa Safari",
          "Contenu": "East Africa - Generally worked well. Only downside was that I had to keep turning e-SIM off and back on to reset the connection as I moved between towers. Aside from that I had great coverage throughout most of our 10-day safari. Would happily use again."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Richard Ward",
          "Nb_Reviews": 7,
          "Date": "2023-09-10T17:12:33.000Z",
          "Titre": "Using Nomad ESIM for the first toime in the USA",
          "Contenu": "The Nomad offering was really good for us as it would have cost us a lot of money otherwise. The buying and installing of this product was easy to do although actually getting it to work in the USA when we arrived took a little bit of amending settings which some of the details were on the Website and some I had to try and navigate. Once activated and in the USA all was working okay and we didnt get any data charges from my UK carrier. Would use again."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Loan Kenney",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T17:52:44.000Z",
          "Titre": "Worked well",
          "Contenu": "The app is easy to use and I had no issue during my two weeks in South Korea. Initially the connection was slow but after I turned off auto switching and selected a carrier from the list, it worked well. I selected SK."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Mike Daniels",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T01:38:14.000Z",
          "Titre": "Perfect in 3/4 countries visited",
          "Contenu": "I bought this on my iPhone (at home on wifi about an hour before travelling) and it took all of 90 seconds to buy and install, so that’s great. I went to the Netherlands, then Germany, then Italy, and finally France. I had awesome connections in all but Italy. In Italy, I downloaded a one-hour podcast on the podcast app in Italy, and it took about 70 minutes. Just for fun I did it in France and it was like, 10 seconds. So I was glad to only be in Italy for 3 of a 15-day trip. Except for there, it was absolutely top-notch. Would recommend for travel to the 3 non-Italy countries above."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Peggy",
          "Nb_Reviews": 2,
          "Date": "2023-08-22T16:21:03.000Z",
          "Titre": "Worked well",
          "Contenu": "Got the data plan in Europe as we were in several countries. Generally no issues, sometimes it was slower than others even in larger cities (only 2 bars), typically 4G coverage. The app is easy to use, no issues with set-up."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Marcella",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T00:53:20.000Z",
          "Titre": "Good plan, difficult to set up.",
          "Contenu": "I found I used much less data than I thought. The price was good. The down side was that the e sim was difficult to set up. The instructions were not clear. I will use Nomad again."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "David",
          "Nb_Reviews": 4,
          "Date": "2023-08-20T06:10:45.000Z",
          "Titre": "When it works....",
          "Contenu": "When it works, it's great. But the first esim I got didn't work and it took 24 hours to really get customer service's attention. When you have their attention they are terrific; but I'm not sure their customer service software works well and it can be many hours before they respond to answers in a thread. Finally I got sorted.... but as a final joke the coupon code they gave me got rejected as expired. oh well."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "christina",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T14:08:50.000Z",
          "Titre": "Worth the money",
          "Contenu": "Overall the esim worked great, no issues with speed or connection. One thing tho, is that whenever I was looking at excursions to do in the area, the price was set to euros and if i looked at certain websites in the area, it would deny me access because I was outside of a certain region (I was in the states but my phone thought I was in London). Just a minor thing tho, overall it was awesome."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Francesco",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T13:36:15.000Z",
          "Titre": "Easy and friendly installation.",
          "Contenu": "Easy and friendly installation.Coverage not always great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "marie louise vanasse",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T15:21:08.000Z",
          "Titre": "starting esim in USA",
          "Contenu": "once i understood the installation was fairly straightforward but i thought that starting my new esim in the USA would be automatic, and it took a wifi and some fiddling to get it going.the visual explanation to change the settings was a little fast for me. You could maybe have a way to slow it down?"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Paul L",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T16:00:31.000Z",
          "Titre": "Great Data Plan",
          "Contenu": "This was awesome. I bought 10GB of data for my Europe trip, having seen that this is what I generally use in a month at home, and it was more than enough. The flexibility of using it in different countries seamlessly was great. What I didn't like, though, was the fact that it didn't give me a phone number that could send and receive sms messages which was a definite drawback, especially one I discovered that the European carriers have a flexible pay as you go plan that does let you do this. Still, this is a very affordable option for travel data."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Frau Hylton",
          "Nb_Reviews": 5,
          "Date": "2023-10-27T14:47:21.000Z",
          "Titre": "easy to purchase and install…",
          "Contenu": "Pretty easy to purchase and install eSIM - admittedly I did have some trouble activating it ( since you have to be online to activate) and it took me 2-3 attempts to get going— but once activated everything was super reliable; sting connection and service in Japan. Price was fair"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Teresa M",
          "Nb_Reviews": 2,
          "Date": "2023-10-11T07:38:16.000Z",
          "Titre": "The service was great everywhere in the…",
          "Contenu": "The service was great everywhere in the 6 countries I travelled in Europe. The only thing I didn't like was I couldn't figure out how to see how much data I had used, so had no idea when it would run out...(and it did run out 4 days before my trip was done). Otherwise would definitely use again!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "cqdurham",
          "Nb_Reviews": 2,
          "Date": "2023-08-27T14:26:46.000Z",
          "Titre": "Easy to use, spotty on train lines in the UK",
          "Contenu": "The service was easy to get set up with an eSIM on my phone and connected right away. It must have preferred Swedish carriers because I would often get suggestions from Google in Swedish when I was connected.Had some trouble maintaining service on trainlines in the UK - service was spotty. I don't have a point of comparison with other providers, but I would be surprised if it is normal to have gaps in coverage along main train tracks. That's the reason for 4 starts out of 5. In cities the service worked very well, though, so you should have no trouble."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Giles",
          "Nb_Reviews": 10,
          "Date": "2023-08-11T10:13:17.000Z",
          "Titre": "Good but don't try and set it up before travelling",
          "Contenu": "This is a cost effective and good way of getting data overseas that i have used a couple of times. The only problem is when you buy it before travelling (trying to be organised!), as then trying to activate it when overseas is highly confusing, problematic and takes time. If you just find some free wifi overseas then buy the nomad subscription, it works beautifully with a simple activation process throught the app."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Joy",
          "Nb_Reviews": 2,
          "Date": "2023-07-29T15:22:39.000Z",
          "Titre": "Quick to download, easy to use",
          "Contenu": "Easy to buy and activate - I bought a data only simcard for China in half an hour before I left on the flight. The simcard was immediately online and I could resume using my phone as normal. I would note however, there was an outage one day and it was extremely difficult to contact for help to understand whether it was going to be a short period of time or something was wrong; I could not even submit a help request via the app. Network speeds were not fantastic though but usable for sure."
        },
        {
          "Note": 4,
          "Lieu": "HK",
          "Pseudo": "H Bernard",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T06:12:13.000Z",
          "Titre": "Works great",
          "Contenu": "Works great! Very easy to install and internet connection works everywhere. Nevertheless, I found that local suppliers offer better deals in terms of price, but I am not sure if they work well or not. Overall, very good experience with Nomad."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Chad Boucher",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T17:40:19.000Z",
          "Titre": "Get the app",
          "Contenu": "Once you understand the activation process and how everything works, it's very useful. Even better once you have the app. Advice: Download your sim card before going to a country because you'll be stuck at the airport trying to get on the wifi to complete the process."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Ben Tan",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T22:50:42.000Z",
          "Titre": "Nice app",
          "Contenu": "Nice app ! EZ to use .Must set up contact transfer at home country, once at overseas u can’t activate bcos can’t transfer the contact , Ned to ask for refund ."
        },
        {
          "Note": 4,
          "Lieu": "AD",
          "Pseudo": "Vikas Saini",
          "Nb_Reviews": 2,
          "Date": "2023-08-21T12:27:15.000Z",
          "Titre": "Esim no signal, never worked",
          "Contenu": "Edit : They offered a full refund for the sim that was not working and I ordered another SIM (35 EU countries) which works fine.Thanks for helping me out.Original: I used to get airalo in the past. I read reviews about nomad and decided to give it a try.Purchased a Europe 20GB plan for 23€ but it never worked.First it got stuck at activating...I left it like this and after around an hour, it got activated itself but the esim is never able to connect to a network to get any signals.Waiting for several hours but it is still same. Tried all diagnostic mention in their app but still no luck.Also tried to contact support team but just received a generic reply, already sent them the settings screenshot but no reply thereafter."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mr Lee Hinchcliffe",
          "Nb_Reviews": 27,
          "Date": "2023-09-09T12:58:55.000Z",
          "Titre": "Excellent value for money & very good network coverage!",
          "Contenu": "Excellent value for money, very good network coverage in the United States, even in considerable National Park territory and the purchase process was extremely easy. The only very minor negative, and the reason not getting there full 5 stars is that the setup procedure was a little fiddly and the instructions didn't match my mobile device. I fully appreciate down to the make of the phone, the model and indeed the operating system to name a few, but someone not as tech savvy as me would have definitely found it a struggle. Would have no hesitation purchasing for my next trip. Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Linda",
          "Nb_Reviews": 3,
          "Date": "2023-09-23T12:40:57.000Z",
          "Titre": "Reasonably priced and good overall experience",
          "Contenu": "Nomad’s eSims were reasonably priced, easy to use and effective; I would use them again. We both got two eSims each for our time traveling in three countries (US, Turkey & Greece) for two weeks. For the most part, the eSims were reliable; however, we had three issues:1) Two of the four eSims wouldn’t let us use iMessage, but the third one did. We followed the instructions on the Nomad app to resolve it, but nothing worked.2) Otherwise, there were a few instances of performance issues (poor responsiveness), but those were resolved when I turned off my phone and turned it back on.3) No warning from Nomad that we were about to run out of data so we could buy more - which they acknowledge, but this needs to change. In our example, the only option was to pay our primary provider’s ridiculous roaming fees to get back online since we were driving and nowhere near wifi).None of the issues we had outweighed how much money we saved avoiding Bell’s outrageously expensive daily roaming fees - so as I said, I’d use them again."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "K Lim",
          "Nb_Reviews": 2,
          "Date": "2023-08-16T05:21:40.000Z",
          "Titre": "Needs data to activate on landing",
          "Contenu": "I used this esim with my iPhone 13 when travelling to South East Asia. it works very well but setup was a little fiddly and the instructions were not 100% clear about some things: 1. The esims expire 30 days after purchase. Do not purchase it too early before your trip!2. You can only activate the esim when you are in the destination country.3. Your phone will need an active internet connection to activate the esim: so find a wifi hotspot at the airport, or turn on Mobile Data roaming on your existing mobile carrier (for one day)These details were not clear to me while purchasing, and I needed to search the internet for clarity. But once activated, the esim is good value and worked well as I moved between countries."
        },
        {
          "Note": 4,
          "Lieu": "BG",
          "Pseudo": "Lina Varbanova",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T05:59:54.000Z",
          "Titre": "All was good after I managed to…",
          "Contenu": "All was good after I managed to activate the card. The UX is a bit confusing as there is an activation step upon adding the card to an IPhone 13 device, which left me with the impression that I am ready to go.After reaching my destination I had no mobile data.. I had to go back and figure that the actual activation is within the app. You might make that more visible in the communications send when purchasing the card. Hope that feedback helpsAll the best"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Sebastian Michaud",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T08:28:59.000Z",
          "Titre": "Easy to use service, really slow internet speeds",
          "Contenu": "I was debating between a 2-star rating or a 3-star rating. The service is really easy to use and install, everything was flawlessly. (5 stars on this)The issue came with the most important thing for me and it is speed, with my recent visit to India it was a hit or miss, most of the times I had to be looking for WiFi since the internet speed was really really slow and was unusable. I purchased 15gb since my plan was always to not connect to WiFi however I ended up just using 4 out of the 15 since I always ended up using WiFiUpdate:Nomad customer service was really helpful on this matter. I still think the app was great speed was really bad however, great customer service always trying to look for ways to make customer happy!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Sandy",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T16:34:03.000Z",
          "Titre": "Connection is always great",
          "Contenu": "Connection is always great, as we have been to Paris, London and NYC this year, we all used Nomad. However, the activation was not that simple. Especially you can only activate it when you arrived your destination and you will need to have wifi in order to activate it. Overall experience is excellent."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Alade",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T17:17:28.000Z",
          "Titre": "Great alternative to daily travel…",
          "Contenu": "Great alternative to daily travel plans! I used the Europe plan for 25 days. I traveled to 4 European countries in 12 days and the e-sim card worked great. I was able to get pretty good connection in France, Germany, and Greece. My only complaints are that my data didn't work in Switzerland at all and most of my home contacts were messed up while I traveled, and I still couldn't make international calls. Besides that, I had a good experience and will probably use this again."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Izzy",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T06:25:17.000Z",
          "Titre": "A first time user",
          "Contenu": "A first time user, I found that the activation instructions were not very good and there were no videos available. I have an iPhone XR, had installed the eSIM but when I landed to destination had to do the process again and took me time to work out if the eSIM was correctly activated and that no data of my primary card was being used. Even so, I could during the whole trip not phone or receive phone calls. I guess something in the settings was not correct, but then again as mentioned the activation was not so straight forwards"
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "Esref Gundogdu",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T03:03:30.000Z",
          "Titre": "It is good tool you provide.",
          "Contenu": "It is good tool you provide.2 feedback:-You use Singapore for main data providing. It makes me some problems. For example Nike customer support tied me Singapore. (I travelled to USA from Türkiye)-If the time ends and customer buy additional plan, I suggest you to transfer unused data to new plan.Thanks."
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "francisco",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T00:19:08.000Z",
          "Titre": "e-sim worked flawlessly but pricey"
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Jade Mendis",
          "Nb_Reviews": 2,
          "Date": "2023-09-14T23:24:56.000Z",
          "Titre": "Very easy to use",
          "Contenu": "Very easy to use. Only downside was having to use another device to scan the QR code. Setting up the manual way was not straightforward but once I had scanned the QR code, the instructions were great and the esim worked perfectly"
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "Gine Ramiri",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T10:23:29.000Z",
          "Titre": "Family room",
          "Contenu": "Family room Great location for tsujiri market, local restaurants and stations. But the bed is hard cause of a single thin twin mattress."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sarah M.",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T15:48:54.000Z",
          "Titre": "Easy to activate and use. Data service was usually good.",
          "Contenu": "I got the Europe e-sim for vacation. It was super easy to install and activate (did that the morning I left, while still in the US, just in case). There were a few times I didn't have service when I wanted it or it was very slow - a few times in fairly busy cities, and a few times in more remote areas - but overall it was good."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Hong-Dao Dang",
          "Nb_Reviews": 2,
          "Date": "2023-11-12T05:07:33.000Z",
          "Titre": "Good coverage and fast internet signal",
          "Contenu": "Good coverage and fast internet signal. Very happy. The only improvement is that your fee is a bit high"
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Juan D",
          "Nb_Reviews": 6,
          "Date": "2023-09-12T13:18:00.000Z",
          "Titre": "Very recommended for travelling in…",
          "Contenu": "Very recommended for travelling in Europe. They have good support in case something goes wrong. Make sure you follow the instructions properly after purchasing your plan"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mohammed Reman",
          "Nb_Reviews": 11,
          "Date": "2023-08-18T11:16:44.000Z",
          "Titre": "Easy to install and activate",
          "Contenu": "Easy to install and activate. Only criticism I can give is lagging sometimes. Reception wise. I would say 85% of times no issues. Only 15% of time.it lagged. Also.value for money. Didn't have to worry about kids rinsing the normal.data allowance you get from roaming."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Customer",
          "Nb_Reviews": 8,
          "Date": "2023-09-30T14:37:56.000Z",
          "Titre": "Easy access, but…",
          "Contenu": "Easy access, however the only thing  it didn’t work with was as our air BandB hosts security. We had to mobile connect and wait for a secure response on our phone number. It didn’t appear to work."
        },
        {
          "Note": 4,
          "Lieu": "BG",
          "Pseudo": "Vesse Tsvetkova",
          "Nb_Reviews": 2,
          "Date": "2023-08-17T08:40:35.000Z",
          "Titre": "The app is overall great",
          "Contenu": "The app is overall great, easy to use and offers good deals. Coverage in Greece is not ideal- although to be fair, the app advises you to check reception and network coverage before buying a plan. All in all, I am happy and would use Nomad again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joshua",
          "Nb_Reviews": 2,
          "Date": "2023-10-07T21:30:26.000Z",
          "Titre": "Nomad is a great and simple E Sim card…",
          "Contenu": "Nomad is a great and simple E Sim card solution. It worked for me very conveniently while I was traveling in France. It was very easy to set up. My only complaint is that it really went through the gigabits if I left it on. I was not using it for high data applications. I found the best way to deal with its voracious appetite would be to only turn it on just for the time I needed it and shut it off right away."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Henry Matthias Smith",
          "Nb_Reviews": 2,
          "Date": "2023-11-16T02:28:30.000Z",
          "Titre": "Works and is cheap",
          "Contenu": "Works and is cheap. Cuts out sometimes, but that might be my phone or operator error on my part"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Sadique Naeem",
          "Nb_Reviews": 54,
          "Date": "2023-09-07T21:37:31.000Z",
          "Titre": "A very simple app to use",
          "Contenu": "A very simple app to use. I just wish that it covered more countries as competitors offer more options. Pricing can also be a bit steep. However it’s much then coming back home to £100 plus a bill for roaming."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "SJL",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T08:01:08.000Z",
          "Titre": "not so easy to set up but once done was…",
          "Contenu": "not so easy to set up but once done was very easy to use and very handy being able to keep track of how much data you use - I bought 20GB for a 10 day trip to Thailand and used less than 5GB so next time will purchase less."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Maria Cristina Betancourt",
          "Nb_Reviews": 2,
          "Date": "2023-10-13T19:13:06.000Z",
          "Titre": "Recommended E-Sim, good service",
          "Contenu": "I recommend this E-Sim since I was visiting several ports on the cruise and if I managed to connect, sometimes the connection was a little slow, in some places there were several hours before the ship arrived at a port and I managed to have connectivity, which was excellent. I will have another trip soon and I have already bought the E-Sim from Europe again."
        },
        {
          "Note": 4,
          "Lieu": "SE",
          "Pseudo": "chris",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T16:13:35.000Z",
          "Titre": "Overall worked well",
          "Contenu": "Overall worked well, sometimes didn’t even though my partner’s nomad worked and vice versa. Wish there was a voice call option for calling hotels, taxis etc"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Nick",
          "Nb_Reviews": 5,
          "Date": "2023-07-02T15:25:26.000Z",
          "Titre": "Not easy to get started with",
          "Contenu": "I had a lot of problems loading up the esim and getting it to work, it would been helpful in the instructions had they highlighted that I would need to turn on data roaming for the new sim. I also found the lack of a local telephone number very difficult as I could not hat texts to load up local taxi apps"
        },
        {
          "Note": 4,
          "Lieu": "CZ",
          "Pseudo": "Ivana Kocova",
          "Nb_Reviews": 1,
          "Date": "2023-07-22T14:50:56.000Z",
          "Titre": "Good concept and services",
          "Contenu": "Experienced problems activating the account for Armenia. It wasn't communicated well to do that in the app, and the account took some time to come to life. After the activation, the eSIM worked well most of the time, but the data reception was poor more often than I expected. Might however be because of generally lower stsandards in Armenia. Switching between data providers was beneficial, it helped to stabilize the connection in the end."
        },
        {
          "Note": 4,
          "Lieu": "NG",
          "Pseudo": "Ehimhen  Eigbe",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T22:17:55.000Z",
          "Titre": "Nice one, keep up the good work!!!",
          "Contenu": "The experience using your product was quite nice!I didn't need to start looking for how to go on the net because it was right there on my phone!"
        },
        {
          "Note": 4,
          "Lieu": "PT",
          "Pseudo": "CLM",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T15:47:46.000Z",
          "Titre": "A valuable experience.",
          "Contenu": "This data solution was a valuable experience for use in USA, using an iPhone 14: in the places visited, it was excellent in cities, using 5G or 4G networks and weak in inland areas (no signal in many places in the western national parks). Excellent at automatic installation and activation (beginning with a QR code) and sharing data via personal hotspot. I recommend."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Caitlyn Bidochka",
          "Nb_Reviews": 2,
          "Date": "2023-09-27T08:21:08.000Z",
          "Titre": "Overall good but wish service coverage was a bit better",
          "Contenu": "Overall good but better in the cities. Service was much spottier and more limited in rural areas/when travelling through the mountains in comparison with local cell service providers. Only wished that the service coverage was more comparable to a Canadian SIM."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Liz H",
          "Nb_Reviews": 18,
          "Date": "2023-07-14T23:39:45.000Z",
          "Titre": "Great value",
          "Contenu": "Great value, easy to use (if you get the app, otherwise you need a second device, for Android at least). Coverage can be a bit patchy but hard to tell if that's Nomad or the NZ telco networks."
        },
        {
          "Note": 4,
          "Lieu": "IE",
          "Pseudo": "customer Miriam O’Brien",
          "Nb_Reviews": 4,
          "Date": "2023-08-08T16:33:43.000Z",
          "Titre": "Easy to set up and reliable",
          "Contenu": "Easy to set up and connectivity was very good.  I had problems connecting and Setring up with holafly so I changed to nomad and nomads feature to connect automatically is brilliant."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Karina Aviles",
          "Nb_Reviews": 6,
          "Date": "2023-09-23T11:28:29.000Z",
          "Titre": "I got 20GB and it was more than enough",
          "Contenu": "I got 20GB and it was more than enough! I used it all the time during 16 days and I consumed only half of it. The service was always good, except in Germany where was very slow and intermittent."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Cmc",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T01:33:59.000Z",
          "Titre": "The data worked in all 3 countries that…",
          "Contenu": "The data worked in all 3 countries that I visited and it was great that I didn't have to change SIM cards.  The only issue was that I had to reboot/log off/on again when I went from one country to another country."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Alessandro Fondrini",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T08:23:58.000Z",
          "Titre": "Coverage has always been good",
          "Contenu": "Coverage has always been good, speed not always excellent.In Kuala Lumpur and southern cities well, on the east coast and north less so"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Sander",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T20:17:18.000Z",
          "Titre": "e-sim worked in Canada and America…",
          "Contenu": "e-sim worked in Canada and America effortlessly! Very handy for route and music in the rental. Easy to install!"
        },
        {
          "Note": 4,
          "Lieu": "ID",
          "Pseudo": "Anthony  Kean",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T10:56:20.000Z",
          "Titre": "Technically",
          "Contenu": "Technically, so simple to operate. It just worked. Plan choice was a bit hard for me. A 9 day  holiday in Indonesia, that has WIFI everywhere. So what do I choose?  I chose thé 3 GB regular plan. I should have chosen the 5GB or 10GB plan."
        },
        {
          "Note": 4,
          "Lieu": "HK",
          "Pseudo": "Thy Nguyen",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T10:17:13.000Z",
          "Titre": "I really like this E sim",
          "Contenu": "I really like this E sim. It’s so easy to activate. It’s great. The only thing I didn’t like is I didn’t get the number just in case I need to communicate with families or friends."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Abeer",
          "Nb_Reviews": 2,
          "Date": "2023-07-05T17:10:56.000Z",
          "Titre": "Works great but didn’t notify me before reaching my data limit",
          "Contenu": "I never got notified that I was reaching my data limit and had to figure out why my data suddenly stopped working and then look for wifi to buy a new package AND install a new esim instead of simply upgrading my existing plan before it expired. Other than that it was a good service overall."
        },
        {
          "Note": 4,
          "Lieu": "HK",
          "Pseudo": "Peter Lee",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T06:51:11.000Z",
          "Titre": "Pretty seamless experience in Hong…",
          "Contenu": "Pretty seamless experience in Hong Kong. In Vietnam I have to turn on data roaming to gain access."
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "Giel Bouwen",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T16:09:20.000Z",
          "Titre": "Great app, great prices, good datapackages",
          "Contenu": "I like the simplicity of the app and installation process. The prices were very good for the unlimited and limited packages. A option I was missing in korea was an unlimited package for 30 days."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "H. T.",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T15:39:13.000Z",
          "Titre": "The activation took several hours",
          "Contenu": "The activation took several hours, it wasn’t until the next that the data started to work. Online it said it was activated but it wasn’t. Otherwise the service was good and fast."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ana Amorim",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T08:52:48.000Z",
          "Titre": "It is a great tool!",
          "Contenu": "It is a great tool!Coverage all over the places we went, but with some fluctuations in Paris."
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "MonKiwiLuffy",
          "Nb_Reviews": 2,
          "Date": "2023-07-28T12:16:05.000Z",
          "Titre": "Very nice",
          "Contenu": "Sometimes , we d'on't have enough connectivity for sending a message on messenger, it was very rarely. This is a realy good service for have data in USA."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "GUO-SHIONG",
          "Nb_Reviews": 2,
          "Date": "2023-12-22T01:28:39.000Z",
          "Titre": "Best eSIM for your NZ holiday",
          "Contenu": "As of December 2023, Spark is Nomad’s NZ partner service. I got through 95% of South Island with this service and can confidently say it has the best uptime. My family and I decided to use different providers between the big three to make sure someone had a connection throughout the road trip for Google Maps. For best bang for your buck, I bought the 15 GB and only needed around 6 GB for a 8-day itinerary. To be honest I was gaming a fair bit so you could probably get away with less."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "N T",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T09:51:43.000Z",
          "Titre": "Hassle free!",
          "Contenu": "Process to purchase and install an e-sim for travel was smooth and hassle free.Did not take long to get onto the target network upon arrival. After that it was good network connectivity though the entire trip"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Paul Birch",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T18:25:21.000Z",
          "Titre": "Crossed the border into usa from…",
          "Contenu": "Crossed the border into usa from canada,worked immediately,drove through several states into florida and no problems!! My canadian carrier wanted $13 a day for data,will be dropping them as soon as i get home."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T17:36:02.000Z",
          "Titre": "Works amazingly!",
          "Contenu": "It's worked so well in every Asian country I've been to (Hong Kong, China and South Korea), it works almost instantly every time I land in a new one. Strong connection. Absolutely would get it again!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Phil M.",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T23:01:29.000Z",
          "Titre": "Awesome App",
          "Contenu": "Awesome App. Saves a lot of time and you can use it straight after landing. Very convenient und easy to use. Definitely recommend it for frequent travelers."
        },
        {
          "Note": 5,
          "Lieu": "SA",
          "Pseudo": "Mo Yuz",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T14:40:48.000Z",
          "Titre": "very convenient and reasonable e-sim purchase and utilization experience",
          "Contenu": "I only ordered a data plan without a phone number (calling minutes) so the e-sim was provided almost instantly. the installation process was so easy and straightforward and so was the activation. I liked Nomad's feature that shows how much data I did use from my purchased plan. that helped me with pacing and optimizing my utilization of the data. I also got a notification to top-up when I used more than 60% of my plan. That can become handy in the future and I intend to buy more from them in the future."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jamie",
          "Nb_Reviews": 8,
          "Date": "2023-12-21T11:42:26.000Z",
          "Titre": "Easy to activate and good coverage",
          "Contenu": "The eSIM loaded on the phone and activated on arrival in the UK. The coverage has been good with data available as we travel around. My teenage son is very happy. All has worked well."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Dean Snodgrass",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T00:30:34.000Z",
          "Titre": "Great way to keep in touch while…",
          "Contenu": "Great way to keep in touch while traveling. Wish there was a full user manual for those that aren’t tech savvy but we did get it to work ok. Some messages weren’t getting through but I am sure that is on me."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Anastazja Debowska",
          "Nb_Reviews": 6,
          "Date": "2023-12-18T20:42:42.000Z",
          "Titre": "Fab service and smooth experience",
          "Contenu": "Fab service and smooth experience. I've purchased a plan ahead of my UAE trip. I have activated my eSIMa day before and it started working 3 minutes after I've landed in UAE."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Pedro Freitas",
          "Nb_Reviews": 6,
          "Date": "2023-12-19T04:11:09.000Z",
          "Titre": "A bit expensive but great service",
          "Contenu": "The speed of Nomad was superb in Canada. Much better then the Airlo one. Instalation also very easy. It is just a bit too expensive but you pay for the convenience."
        },
        {
          "Note": 5,
          "Lieu": "SV",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T01:43:13.000Z",
          "Titre": "Seamless Connectivity, Great Prices, Ultimate Travel Companion!",
          "Contenu": "Nomad has been a game-changer for me! I’ve never experienced a loss of connection, and the prices are fantastic. The service is incredibly easy to use, making it a breeze to manage multiple mobile numbers. It’s a real lifesaver when traveling – so convenient!"
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Eng Tan",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T04:23:58.000Z",
          "Titre": "First time user",
          "Contenu": "Super easy to use No issues with connectivity, signal strength or up and down / load speedsA bit on the pricey side compared to wireless router but most affordable out of all the other competing e-sim options (even after discount)"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "A. M.",
          "Nb_Reviews": 5,
          "Date": "2023-12-20T04:57:16.000Z",
          "Titre": "Easy way to book an esim",
          "Contenu": "Easy way to book an esim, multiple ways to pay, good overall package.  Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Krunoslav Marunic",
          "Nb_Reviews": 4,
          "Date": "2023-12-14T17:52:57.000Z",
          "Titre": "Amazing E-Sim card",
          "Contenu": "Amazing E-Sim card. We have used it throughout Europe with no issues and will use it when we go to South America. Couldn't be happier. Has made travelling and staying in touch seamless."
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "Wafi Supri",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T03:14:20.000Z",
          "Titre": "I saw the sponsored ads in social…",
          "Contenu": "I saw the sponsored ads in social media, luckily the first of various. I downloaded the app as soon as I landed at the airport. The whole process was straightforward & very easy even for non-tech savvy I’d say. So the user-friendliness is great with their UI/UX. My family & I went for Asia trip so my favourite feature is definitely the regional plan; skip all the tedious & hassle tasks."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Sony F",
          "Nb_Reviews": 5,
          "Date": "2023-12-20T08:27:55.000Z",
          "Titre": "From now on I will use Nomad on all trips",
          "Contenu": "It's so simple to use and you get a clear step-by-step plan to get everything in order. What a solution this is! and many times cheaper than through your own provider! From now on I will use Nomad on all trips outside the EU."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Mark Australia",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T11:53:59.000Z",
          "Titre": "First class app and service",
          "Contenu": "First class app and service. Have used this twice in last few months, in Europe (mainly Ireland) and Easy Asia (Taiwan). Best to setup before you depart as it's easiest if you can scan the QR code for setup of your esim. Had no downtime while using the esim which is contracted to good telcos when you're travelling"
        },
        {
          "Note": 5,
          "Lieu": "HK",
          "Pseudo": "Lan",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T01:29:20.000Z",
          "Titre": "This is my firsttime using esim",
          "Contenu": "This is my firsttime using esim, and it works great in my stay in the phillippines."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike P",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T00:41:49.000Z",
          "Titre": "I'm loving eSim data.",
          "Contenu": "Been using Nomad eSim for daily data on my phone for 2 months. I only use it when not at home. I'm surprised how well it has worked for voip & data texting. Goodbye cell phone provider hello data provider."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "S. Hellweg",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T15:06:20.000Z",
          "Titre": "Everything worked great",
          "Contenu": "Everything worked great. As an improvement it would be great to have it clearer how to add a new data plan instead of a new eSIM."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Roger Fredman",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T20:58:23.000Z",
          "Titre": "Just a really convenient service and…",
          "Contenu": "Just a really convenient service and affordable. Seemed to work in every area I was in and I like the fact it doesn’t start until you land in the country of usage."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Raphael P",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T04:38:43.000Z",
          "Titre": "Easy and practical experience",
          "Contenu": "Easy to hire, track data usage and decent speeds in the US. Except for a specific situation where not having phone and text services was an issue, this is far better and cost-effective than buying a US sim card from a carrier. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Sethupathi Muthuramalingam",
          "Nb_Reviews": 12,
          "Date": "2023-12-07T11:08:28.000Z",
          "Titre": "Turkey eSim",
          "Contenu": "I bought Nomad eSIM when I traveled to Turkey. Very easy and smooth process to install and activate eSIM. It worked like a breeze when I landed in the Istanbul Airport. The coverage was excellent when we travelled to other places like Cappadocia, Ephesus, etc. I could also check the usuage via Nomad app. Good value for money. Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Danielle",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T21:51:59.000Z",
          "Titre": "Vacay Data",
          "Contenu": "Easy to set up,  inexpensive cost, and it lasted for my entire 25-day vacation through multiple EU countries."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Christina M.",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T17:36:48.000Z",
          "Titre": "Great for France travel",
          "Contenu": "This was great for a week stay in France. Chose 10GB of data and the trip went smoothly thanks to online navigation, checking in and contacting airbnb hosts, etc. Would highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Heather Murray",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T06:49:47.000Z",
          "Titre": "Excellent access even in remote areas…",
          "Contenu": "Excellent access even in remote areas of Costa Rica"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Manjit Sadhwani",
          "Nb_Reviews": 5,
          "Date": "2023-12-13T14:36:26.000Z",
          "Titre": "Never used an esim before",
          "Contenu": "Never used an esim before, and actually brought a 2nd phone with me, luckily someone in the group I was travelling with showed me this app, and it has been seamless."
        },
        {
          "Note": 5,
          "Lieu": "HR",
          "Pseudo": "Legnum",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T08:45:55.000Z",
          "Titre": "Works as described",
          "Contenu": "Honestly, I just installed esim and forgot about it. Worked perfectly fine in Japan. Signal everywhere with no lag. I will use nomad on my next trip. Thx"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Karen",
          "Nb_Reviews": 7,
          "Date": "2023-12-03T22:22:55.000Z",
          "Titre": "Nomad ESim Highly Recommended!",
          "Contenu": "Have never used an ESim before but went to the US for a few days and wanted to have data without running up huge data roaming charges. The Nomad ESim was fantastic. Easy to set up, no issues with coverage and made life a lot easier! Would highly recommend and will definitely be using Nomad again on my next trip abroad!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "EL",
          "Nb_Reviews": 4,
          "Date": "2023-12-04T03:18:44.000Z",
          "Titre": "Great!",
          "Contenu": "With my new eSIM iPhone, I needed data while traveling overseas. While my family recommended Airalo, they were consistently 30% more expensive than Nomad. I will be using Nomad for their their great value."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ian",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T11:52:00.000Z",
          "Titre": "Does exactly what it says it will",
          "Contenu": "Does exactly what it says it will. Great travel accessory!"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Peter Francisco",
          "Nb_Reviews": 10,
          "Date": "2023-12-01T04:39:10.000Z",
          "Titre": "Best value for money I've ever experienced",
          "Contenu": "The 5G/LTE speed was consistent all throughout the experience.  There was no downtime and no throttling of speed unlike other mobile data plans for travelers.  And the best thing is the price.  I've been traveling for leisure two to three times a year for over 20 years and this is the best value for money for mobile data I've ever experienced!"
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T23:25:40.000Z",
          "Titre": "Nomad eSIM for a US trip",
          "Contenu": "Bought a Nomad eSIM for a US trip (visiting from Europe). Everything was perfect, from the purchase and the instructions to the actual quality and performance in the States. The app is a nice touch, too. Highly recommended"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Valentina Ventricelli",
          "Nb_Reviews": 4,
          "Date": "2023-12-05T09:29:34.000Z",
          "Titre": "Used the e-sim for my trip in Asia",
          "Contenu": "Used the e-sim for my trip in Asia, it was easy to set up and honestly worked great! Have ordered another one for the continuation of my Asia trip, and took advantage of the Black Friday sale to buy an e-sim for a trip later on in Africa."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Laurie O'Brien",
          "Nb_Reviews": 4,
          "Date": "2023-12-12T17:15:26.000Z",
          "Titre": "Easy to use - Reliable",
          "Contenu": "This is my 2nd time using Nomad.  My 1st experience was 30 days for Europe.   This time was 1 week in the US.  Both times I found the plan easy to purchase, easy to load and no issues at all with the data plan. Worked like a charm.  I like that you are able to check your usage and notifications are sent when you're close to 100% use.  Easy to top up."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Karen Young",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T14:03:32.000Z",
          "Titre": "Easy to install and had absolutely no…",
          "Contenu": "Easy to install and had absolutely no issues using it in India. in fact, my friends had to hotspot my data to get a better connection that their portable router"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MH, USA",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T04:36:37.000Z",
          "Titre": "Nomad ESIM was awesome and affordable.",
          "Contenu": "Great website that explained everything! Activated as it should have once crossing  into Canada. Service even in some remote areas while hiking."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Renu Raithatha",
          "Nb_Reviews": 13,
          "Date": "2023-12-13T16:40:16.000Z",
          "Titre": "Enjoying the eSIM … still using it.",
          "Contenu": "Enjoying the eSIM … still using it.. I’m in India and feel good that I can communicate with everyone .."
        },
        {
          "Note": 5,
          "Lieu": "MY",
          "Pseudo": "OS",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T11:51:19.000Z",
          "Titre": "Nomad eSIM on a new IPhone15Pro.",
          "Contenu": "Once I did a full network reset on my new IPhone15 the Nomad eSIM service worked seamlessly with my existing SIM and WiFi. Prior to doing the network reset the eSIM service would drop each time the iPhone went into screen lock.No issues with connectivity travelling around KL and Melaka in Malaysia."
        },
        {
          "Note": 5,
          "Lieu": "KR",
          "Pseudo": "Rosa Diaz",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T04:04:24.000Z",
          "Titre": "It couldn't have been easier!",
          "Contenu": "It couldn't have been easier!I got 2 eSIM plans for 1 week to use in Tokyo, at 1GB each (20-25 Nov). It, really, was more than enough for our time there. The online transaction was very clear and easy to follow. I shopped around for the same or similar plan and found Nomad's price to be exceptionally better. The app was helpful in keeping track of usage, even with multiple eSIMs under one account. The 2nd one was installed in my daughter's phone. I didn't know if usage for both would be visible when I got the plans, but they were! Installation instructions were simple and activation happened automatically. Thank you, Nomad!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Gaye E",
          "Nb_Reviews": 6,
          "Date": "2023-12-13T19:29:29.000Z",
          "Titre": "The e-sim was very easy to install data…",
          "Contenu": "The e-sim was very easy to install data service was reliable for our 30 day Italy package."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Riccardo Barile",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T12:57:08.000Z",
          "Titre": "The setup of the eSIM on my iPhone…",
          "Contenu": "The setup of the eSIM on my iPhone worked well with the provided instructions. 3 GB for 1 week in Morocco were optimal and basically everywhere I had good 4G connection with the main provider Moroc Telecom. 👍🏽At 20% remaining data, I received an email with the option to add more.Tracking of data use in the app and after a reset in the iPhone's setting - mobile data worked well to keep an eye on the usage."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Carina",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T07:59:32.000Z",
          "Titre": "This app solves a real problem - it's a Game changer!",
          "Contenu": "This app solves a real problem and I would rate with 10 stars if I could! So glad, that I found it for my travels in India. It's a game changer and disrupts finally the embarrassing expensive market of Vodafone & Co. I booked 3GB for 8$, but recommended to check Tiktok before to get a promo code which saves you 3-5 $. It was easy access and very user friendly. Will use this definitely again! Thank you so much Nomad team!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Earl Bennett",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T15:09:40.000Z",
          "Titre": "Oh so simple",
          "Contenu": "I found Nomad via a simple eSim google :-)So easy to follow and the documentation was 1st class. Bought the 30 day 3Gb package for a visit to Dubai. (from th UK) The eSim activates once you reach your destination. Only used 1.5 Gb of my allowance; coverage 100% - Cost me $11 - absolute bargin!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Antonin Hrbatsch",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T00:57:26.000Z",
          "Titre": "Straight forward & reliable",
          "Contenu": "So easy to order & install their eSIMs, great instructions & an app, too. Have only used their services in New Zealand & Malaysia but have had no issues in either country. Will definitely use again!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Marilyn Friesen",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T17:19:55.000Z",
          "Titre": "Travelled to the USA from Canada",
          "Contenu": "Travelled to the USA from Canada, and first time using Nomad. Worked great. One week traveling:  Las Vegas, Bryce Canyon, Grand Canyon, Sedona, Phoenix and had great coverage. Sometimes service dropped to 2 bars but that’s expected in some mountainous areas. Sent WhatsApp messages while hiking in Bryce and Grand Canyons. The app makes it easy to check how much data you’ve used. Loved that we could hotspot my husband’s phone as well."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Ludo",
          "Nb_Reviews": 3,
          "Date": "2023-12-10T15:35:02.000Z",
          "Titre": "Very nice service",
          "Contenu": "Travelled to India. Easy installation and easy everything, I had no problem whatsoever. I can only strongly recommend it!"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Trevor Francis",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T08:01:58.000Z",
          "Titre": "Nomad provided exactly what I needed…",
          "Contenu": "Nomad provided exactly what I needed i.e. a reasonably priced, once-off prepaid data bundle in the USA, via an e-sim, which allowed me to continue using whist roaming, my home country physical voice sim card."
        },
        {
          "Note": 5,
          "Lieu": "EC",
          "Pseudo": "Juan C. Mendieta",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T22:04:35.000Z",
          "Titre": "Excellent coverage",
          "Contenu": "Great service, excellent coverage, absolutely no issues.I used the service for 15 days in NY, VA, MA, PA, and NJ. I was always connected and with good reception."
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "Christian",
          "Nb_Reviews": 3,
          "Date": "2023-11-24T06:29:16.000Z",
          "Titre": "Perfect for globetrotters like me",
          "Contenu": "I am traveling the world and Internet is a must. So Roaming is important and with Nomad it is easy and affordable to have Internet around the world. With my Pixel 8pro I had never issues to download load the e-sim.  In the past I used other e-sim provider and checked price, but now use only Nomad easy to use working all good."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Richard D",
          "Nb_Reviews": 3,
          "Date": "2023-12-09T17:37:46.000Z",
          "Titre": "Reliable 5G in Singapore",
          "Contenu": "Got the 3GB eSIM for my 11 days in Singapore. The 5G service was via Singtel. Very reliable in my experience."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Bernard Marshall",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T00:18:41.000Z",
          "Titre": "Nomad in UK, Spain and Portugal.",
          "Contenu": "We used Nomad to provide data while travelling around UK, Spain and Portugal. I was very impressed with the whole setup. We purchased eSIMS, installed them on Android phones and everything just worked. The speed was great and we always seemed to connect to the fastest service provider. The price was easy on the wallet as well."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Richard Lemieux",
          "Nb_Reviews": 4,
          "Date": "2023-12-14T11:39:29.000Z",
          "Titre": "Easy to install works great and you can…",
          "Contenu": "Easy to install works great and you can hotspot with it no problem!The deal was 10 days 10Gb. Well I had 10 full days as I started on the 3rd in the afternoon and it worked until the 14. I have tried many e-sims and this one is BY FAR the best product out there. I will always choose NOMAD eSIM's for my travels. 100%"
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Dirk",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T11:17:45.000Z",
          "Titre": "I used the Nomad eSIM in China",
          "Contenu": "I used the Nomad eSIM in China. Worked fine there, after I figured out that Roaming needs to be turned on for the eSIM, even though I‘ve been in China using a China Telecom eSIM. High speed, no issue to use VPN. All good and better then expected!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "bjb",
          "Nb_Reviews": 4,
          "Date": "2023-12-17T17:39:59.000Z",
          "Titre": "Very easy and effective",
          "Contenu": "Very easy and effective - better than my experience with Airalo by far."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Mueller",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T19:11:03.000Z",
          "Titre": "Easy installation, good performance",
          "Contenu": "Buying and activating this Nomad esim was quick and easy. It provided good data coverage in most locations in New Zealand - less so on the highway out in the countryside, but that's to be expected. Overall a good experience for a traveler."
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Jisselle",
          "Nb_Reviews": 6,
          "Date": "2023-11-24T19:24:28.000Z",
          "Titre": "Overall a reliable data connections",
          "Contenu": "Overall, a great way to travel through Europe with reliable connections. I may have at times experienced bad reception but survived the trip nonetheless. Will subscribe again for sure when needed."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Ryan Penny",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T04:13:45.000Z",
          "Titre": "So convenient",
          "Contenu": "So convenientIt’s been really easy flying from country to country and not worrying about your data and sim. Coverage has been really good and great speed. I love getting off the plane and walking past the long lines waiting to get their SIM cards. I would definitely get this esim again :)"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "June",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T02:24:41.000Z",
          "Titre": "Incredibly easy to purchase",
          "Contenu": "Incredibly easy to purchase, install and use.  Just the right plan for my purpose so I could use Google, interactive maps and what's app on my short visit to NYC.  Thanks"
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Alie Jallow",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T07:07:33.000Z",
          "Titre": "Very good network coverage 4G & 5G certain areas",
          "Contenu": "Very good network coverage and in some areas I get 5G.  Secondly, I can tether with my laptop."
        },
        {
          "Note": 5,
          "Lieu": "RS",
          "Pseudo": "Goran",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T08:23:36.000Z",
          "Titre": "Travel to China was Excelent!",
          "Contenu": "It was really simple and secure during my travel to China, I have internet connection where ever  Ihave found my self, and this is very important when you find yourself alone sometimes! especially in China."
        },
        {
          "Note": 5,
          "Lieu": "SI",
          "Pseudo": "Robert",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T07:01:33.000Z",
          "Titre": "Excellent service, competitive price",
          "Contenu": "Competitive price, excellent service. I was using their eSim in China and it worked like a charm, together with access to services otherwise unavailable in China. Will definitely use their services again!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "AE",
          "Nb_Reviews": 3,
          "Date": "2023-12-02T21:49:56.000Z",
          "Titre": "Was easy to install very good well priced…",
          "Contenu": "Was very easy to install and works well with existing chip if you turn roaming off. Will use it anywhere I don’t have cover on my phone contract."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RobertD",
          "Nb_Reviews": 3,
          "Date": "2023-12-02T12:34:10.000Z",
          "Titre": "APAC esim works well in mainland China",
          "Contenu": "The APAC esim worked fairly well.  It worked in Singapore, Hong Kong, and parts of mainland China (Shenzhen, Chaozhou, Puning).  It did not work well in Huizhou.  Maybe just an issue with providers in the area?However, good enough that I bought a second one for the second part of my trip in mainland China."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Jock  Lay Yee",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T23:20:21.000Z",
          "Titre": "Very happy with Nomad esim coverage in Japan.",
          "Contenu": "I purchased two 10GB, 30 day Nomad esim plan for my wife and myself 2 weeks prior to leaving on our trip to Japan from New Zealand. We both have Samsung Galaxy S22 Ultra 5G smart phones.I do not know much about esims so it did take me more time than necessary, even though I followed instructions. I was able to work out what the instructions meant in the end. The instructions could have been a little clearer with regard to turning on esim for mobile data. I had to read in between the lines a bit.The activation step could also have been clearer. I turned on the esim just before I left home (while I had access to wifi. Very important to have wifi). When I landed in Japan the esim connected to the Internet and I was able use social media apps, WhatsApp and Messenger  use Google Maps etc.Coverage was excellent. Internet speed was very good. Two more days left in our 20-day trip we both each still have 8GB of data available. We got the 10GB plan to be on the safe side. It was the smallest plan. Nomad was recommended to me by my daughter. I have no hesitation recommending this esim (for Japan at least)."
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "Alan Tang",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T02:01:33.000Z",
          "Titre": "I bought 2 esims to be used in 2 phones…",
          "Contenu": "I bought 2 esims to be used in 2 phones for hong kong trip. I was very happy with it.  It allowed me to use map to explore hongkong for 4 days and discovered more places than the locals.  Totally recommended!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jim Goss",
          "Nb_Reviews": 14,
          "Date": "2023-12-07T05:01:42.000Z",
          "Titre": "Great data service.",
          "Contenu": "Excellent service, easy to install, use and buy. Super reliable so great for navigating the streets of Hong Kong."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Jo Ann",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T08:08:29.000Z",
          "Titre": "So easy to use and the quality of the…",
          "Contenu": "So easy to use and the quality of the data signal was consistent and effective."
        },
        {
          "Note": 5,
          "Lieu": "BS",
          "Pseudo": "LolaH",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T19:34:42.000Z",
          "Titre": "Fantastic find for all travelers!",
          "Contenu": "Easy to follow instructions on how to purchase & install & worked like a dream! I have used a Nomad data package in Canada (Nova Scotia) and in the US (Florida) now & both times were a blessing!"
        },
        {
          "Note": 5,
          "Lieu": "MY",
          "Pseudo": "Barry",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T03:12:20.000Z",
          "Titre": "User friendly",
          "Contenu": "User friendly Very good receptions in mainland China, HK, Taiwan,Singapore, and Penang, Heading out to Thailand  & Vietnam. That regional package works out great"
        },
        {
          "Note": 5,
          "Lieu": "VN",
          "Pseudo": "MB",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T08:16:48.000Z",
          "Titre": "Worked flawlessly",
          "Contenu": "No issues at all and good signal everywhere in Vietnam. Be aware that local ESIM cards are cheaper, but quality may vary."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Said",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T12:12:20.000Z",
          "Titre": "The USA eSIM I bought worked as…",
          "Contenu": "The USA eSIM I bought worked as advertised. It took only a few minutes to set up, and worked perfectly for the entire duration of my trip. No complains whatsoever."
        },
        {
          "Note": 5,
          "Lieu": "TW",
          "Pseudo": "Thomas Campbell",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T12:05:35.000Z",
          "Titre": "Used on China",
          "Contenu": "Used on China. The internet speed was fast and reliable in all locations. Easy to setup and easy to connect. Highly recommended and will use on all future trips"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mohsen Toorani",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T17:26:27.000Z",
          "Titre": "Excellent connectivity",
          "Contenu": "Connectivity is decent without any interruptions.Works well when you have no WiFi."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Kim Luu",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T21:27:05.000Z",
          "Titre": "Good speed and reception",
          "Contenu": "Good speed and reception. I was able to use it in Seoul, Macau, Hong Kong, Taipei, Tokyo. Really glad I got this. The price was good. Didn’t have to buy new plan when going to different countries. I had a Layover in Tokyo for 8 hours and use google map to travel to shibuya in downtown to kill some time. Was great that I didn’t need to purchase another plan. I did lose 1 hour signal in Taipei and thought it die on me. Luckily it came back in an hour. I was worried and was looking to get another local plan but then it came back and was great afterwards. So no complains."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T11:33:40.000Z",
          "Titre": "Efficient Experience",
          "Contenu": "The experience overall was smooth and simple and efficient, when I reached my destination and got out of the airplane, I just switched on the e-sim and I was good to go, the price as compared to the local sims was much more affordable."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Danilo Mariano",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T17:30:39.000Z",
          "Titre": "Very good and effective app for…",
          "Contenu": "Very good and effective app for roaming.  Prompt response on my query.  Thanks guys.  We need more apps like this. Kudos to your team."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Duaine Rockwell",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T03:43:23.000Z",
          "Titre": "Best costumer service ever",
          "Contenu": "The best costumer service I've ever gotten for anything!  I had trouble activating it on my phone.  It was to the point I had given up, thinking it was only $40.  They kept getting a hold of me when they saw I wasn't active.  Finally, after lots of back and forth we got it.  Thanks to all the Nomad folks for all your help!  Keep up the great work."
        },
        {
          "Note": 5,
          "Lieu": "BN",
          "Pseudo": "Deb",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T15:15:59.000Z",
          "Titre": "Easy n convenient",
          "Contenu": "Easy n convenient! Hassle free."
        },
        {
          "Note": 5,
          "Lieu": "CZ",
          "Pseudo": "Ilia",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T18:42:35.000Z",
          "Titre": "Smooth experience",
          "Contenu": "Smooth experience, easy to buy and activate, worked in Morocco without any problems.Will use again instead of a physical sim"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ng",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T05:23:10.000Z",
          "Titre": "Very easy to set up and super…",
          "Contenu": "Very easy to set up and super affordable option if you aren't using a ton of data to stream videos"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Chintan Patel",
          "Nb_Reviews": 4,
          "Date": "2023-12-04T14:04:31.000Z",
          "Titre": "Great service",
          "Contenu": "Great service. Easy to setup. Used it for multuple cuntries and worked excellent. Saved lots of money for roaming charges."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Christine L.Y",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T11:34:25.000Z",
          "Titre": "No issues with contacting others",
          "Contenu": "No problems staying in touch with family back home. Great cellphone coverage."
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Dan Astifeni",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T11:50:02.000Z",
          "Titre": "Highly recommend Nomad eSIM",
          "Contenu": "Highly recommend Nomad eSIM! Purchased 10GB data for Dubai and found the activation process seamless. The network coverage was reliable, but for enhanced functionality in Dubai, consider using a Pin VPN to unlock calls on WhatsApp and Messenger. Overall, a solid choice for hassle-free connectivity."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Alex Read",
          "Nb_Reviews": 2,
          "Date": "2023-11-26T23:23:34.000Z",
          "Titre": "Excellent Service and easy to use",
          "Contenu": "Plan hasn’t finished but it instantly connected on arrival and the speed has been flawless. Will be using again"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Lance Tebbutt",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T05:18:54.000Z",
          "Titre": "Worked like a charm",
          "Contenu": "Worked like a charm. Will highly recommend,  especially here in India. We found it nearly impossible to get a local SIM card. They wanted a local number and person to vouch for you, and then they would POST the Sim to you.   No good when you are on  a tour!Thanks for this great product!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Astrid F.",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T11:27:31.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use, nice special offers, works perfectly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marco Sommella",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T16:13:17.000Z",
          "Titre": "Easy and convenient",
          "Contenu": "Easy to activate, perfect covarage and good speed. 20$ for 10GB is a nice deal."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Anton J.",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T16:45:36.000Z",
          "Titre": "Quick to set up and intuitive",
          "Contenu": "I was able to set up Nomad e-SIM card at the airport from my phone got a discounted 20 Gb in Asia for 45 days for 30€. When landed it began working instantly. Be sure to turn off your original data roaming and switch to Nomad e-SIM. After two weeks in Asia I still have a ton of data left. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Joel Lawton",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T17:58:24.000Z",
          "Titre": "I used Nomad on a recent trip to…",
          "Contenu": "I used Nomad on a recent trip to Florida. Excellent coverage and easy to use. Not to mention a great deal! And....I didn't miss all the useless cell calls and texts while on holidays. Love it!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Andy B",
          "Nb_Reviews": 6,
          "Date": "2023-11-30T16:58:02.000Z",
          "Titre": "Excellent product",
          "Contenu": "Excellent product. Great prices. Good customer service.  Would definitely use again, easy to use!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "H Leung",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T08:13:43.000Z",
          "Titre": "Would buy again",
          "Contenu": "Cheapest option we found for our needs. Easy to purchase and install. Connection was great throughout the trip. I would buy from Nomad again."
        },
        {
          "Note": 5,
          "Lieu": "CL",
          "Pseudo": "Karin  Maree",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T20:46:45.000Z",
          "Titre": "Like using only one phone",
          "Contenu": "Like using only one phone. Withou chancing memory cards.   Was in USA, Brazil and now in Chile.  Easy to use.   No problems. 💪😎🌟"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "DaMo",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T10:12:06.000Z",
          "Titre": "Super easy set up and work installation…",
          "Contenu": "Super easy set up on iPhone 13 and worked great without any issues and instand as soon as we landed in NYC. Also the app is helpful. 10/10"
        },
        {
          "Note": 5,
          "Lieu": "QA",
          "Pseudo": "Badar",
          "Nb_Reviews": 3,
          "Date": "2023-11-26T06:14:30.000Z",
          "Titre": "Good Option",
          "Contenu": "The Sim worked seamlessly while in multiple countries in Europe. Activation was easy and got 5G in most places."
        },
        {
          "Note": 5,
          "Lieu": "HK",
          "Pseudo": "Kazzy",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T08:28:57.000Z",
          "Titre": "Painless experience",
          "Contenu": "From purchase to set up and actual use has been all painless and easy. Will use it again when I travel to different countries"
        },
        {
          "Note": 5,
          "Lieu": "AL",
          "Pseudo": "there , Ari",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T19:19:52.000Z",
          "Titre": "This service is very worthy and you…",
          "Contenu": "This service is very worthy and you save a lot of money, 5G internet all time."
        },
        {
          "Note": 5,
          "Lieu": "SR",
          "Pseudo": "Clyde Fernandes",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T16:33:43.000Z",
          "Titre": "Great eSIM data service product",
          "Contenu": "Quick and easy setup for the eSIM data service. The usage experience was great. Data doesn't seem to be used very quickly even though to my feeling it should have been used up faster. Great product. Power to the team."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "sashman",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T18:45:18.000Z",
          "Titre": "Easy to install and top-up",
          "Contenu": "Easy to install and top-up.  Affordable."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Craig Marshall",
          "Nb_Reviews": 3,
          "Date": "2023-11-21T21:21:51.000Z",
          "Titre": "Easy to add extra countries on the fly",
          "Contenu": "Easy to add extra countries on the fly. Connection speeds were great. Pricing options clear and understandable"
        }
      ]
    }
  ]
}