{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.textrequest.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "George",
          "Nb_Reviews": 2,
          "Date": "2023-11-11T17:39:43.000Z",
          "Titre": "Good Partner until they aren't",
          "Contenu": "Text Request was a great partner for the last 6 years.Pricing was fair. Service & functionality good.We moved to a VOIP system that included texting and AI and tracking of all communication for a customer.The process to \"port out\" has changed my referral of people that would have needed your service un-fortunately.  When I had to threaten FCC guidelines to obtain the proper porting info, that leaves a bad taste."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Still waiting",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T19:01:42.000Z",
          "Titre": "Lack of support",
          "Contenu": "I was sold the package to be up in a few hours... still not working, been over a week.Edit:Your records are incorrect and as of yesterday 11/15/23 I am in touch with a rep that is finally helping me, she is now my POC, the conversations in my app are now showing up and I am able to reply, the rep scheduled a call for today to assist me in utilizing the full potential of the system.  She is seeking a proration for the unused time.  I will update if that is a success."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T17:43:42.000Z",
          "Titre": "The pricing structure wasThe pricing structure was not completely disclosed not…",
          "Contenu": "The pricing structure was not completely disclosed. I was charged for incoming spam texts and if the texts were too long I was charged for multiple outgoing texts for every recipient. Canceling the service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Matthews",
          "Nb_Reviews": 1,
          "Date": "2023-08-27T22:02:41.000Z",
          "Titre": "I think this company is extremely rude…",
          "Contenu": "I think this company is extremely rude to new customers. I tried to signup for the service, I called in with my company number, included all the information reuested including my business EIN, website and case use for the service, the lady that was verifying the account said my name on the email has one letter than the owner, I said it doesn't matter because I use it either way as my name is Mathews and I use one or two T sometimes, She said I wan not verified after taking all my business personal information. She even called in to my business number, if that isn't verification enough I don't know what else is. She was extremely rude during the process, her name is Kami Rowe I believe, she wouldn't let me ask any questions, she left me on the call. I was really embarrassed. If this is how you treat people I can't imagine how you treat your workers or customers."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "CBD Steve",
          "Nb_Reviews": 3,
          "Date": "2023-05-17T20:52:50.000Z",
          "Titre": "They stopped delivering my text messages",
          "Contenu": "They stopped delivering my text messages and didn't send me any notification since April 1st. The campaign would send but 100% of the messages would fail in error, and they are refusing to refund me for April and May."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gabriel",
          "Nb_Reviews": 1,
          "Date": "2023-01-16T21:02:02.000Z",
          "Titre": "VP Of Operations 404-932-3802",
          "Contenu": "We find that when we reach out for major interruptionw to the sending of messages we get delayed responses and not a lot of details on the issue.  Your product seems more like a self serve and figure it out product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ezquidio",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T20:40:31.000Z",
          "Titre": "Bad Experience",
          "Contenu": "After  I had signed up and made a payment company will start asking for all kind of information including federal ID/EIN WHAT THAT THIS COMPANY HAS TO DO WITH EMPLOYER ID NUMBER?We are a Hair Salon that we have been in business for 33 years we do not have a website.When we signed up I entered a the information including company information such as address and telephones numbers, why do you want me to provide this information after I made a payment, I am demanding to return what I paid and stop this whole process,"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ROBERT",
          "Nb_Reviews": 1,
          "Date": "2022-04-06T12:51:58.000Z",
          "Titre": "We got Spammed!!",
          "Contenu": "I was generally happy but right after I signed up I started to get spam emails. They obviously sold my email!! We did so well for many years without having spam emails Infiltrate our inbox until we signed up!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Julie",
          "Nb_Reviews": 1,
          "Date": "2022-02-05T03:58:23.000Z",
          "Titre": "I have had two accounts created for me",
          "Contenu": "I have had two accounts created for me, both are not recognized. Very frustrating as a weekend RN Supervisor attempting to reach staff in bulk."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ART",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T00:17:54.000Z",
          "Titre": "When a business doesn’t pass the…",
          "Contenu": "When a business doesn’t pass the verification process, it should be told why [such as address/ phone#/ EIN discrepancy], so it can be rectified if appropriate."
        },
        {
          "Note": 1,
          "Lieu": "AE",
          "Pseudo": "Wayne",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T20:12:34.000Z",
          "Titre": "Very bad I hate you people u took…",
          "Contenu": "Very bad I hate you people u took people and lock acct"
        },
        {
          "Note": 1,
          "Lieu": "ZA",
          "Pseudo": "Jordan",
          "Nb_Reviews": 1,
          "Date": "2023-07-16T19:09:36.000Z",
          "Titre": "The textrequest are scam not return my…",
          "Contenu": "The textrequest are scam not return my fund to my accounts"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Luke",
          "Nb_Reviews": 1,
          "Date": "2022-02-04T16:53:24.000Z",
          "Titre": "Text line doesnt work and I havent…",
          "Contenu": "Text line doesnt work and I havent heard back"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "person",
          "Nb_Reviews": 1,
          "Date": "2022-02-12T20:14:21.000Z",
          "Titre": "I didn't get any code texted to me."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dawn Mangold",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T17:13:16.000Z",
          "Titre": "The inability to talk to someone is not…",
          "Contenu": "The inability to talk to someone is not great!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Liz",
          "Nb_Reviews": 1,
          "Date": "2023-07-01T01:46:07.000Z",
          "Titre": "The sales rep was not honest and…",
          "Contenu": "The sales rep was not honest and misrepresented the functionality of the system. I explained my texting needs and requirements to the rep prior to starting the service.  Over all the system has great potential. The pricing plan features was reasonable as presented by the rep prior to starting the service.  But very different after I started. They charge for incoming text, over 160 characters and attachments are considered additional text. Nickle and dime every thing. The number of allotted text for the price was not as present and not worth it once actually using the system. I would not recommend."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "George",
          "Nb_Reviews": 1,
          "Date": "2022-02-16T14:30:58.000Z",
          "Titre": "loved the program until one day it asks…",
          "Contenu": "loved the program until one day it asks me to reenter my user name and password again.  I have used many times since signing up and never ask before and when I hit \"reset password\" it says the URL is lost and I am asked to chat.  I' m through.    Was nice while it lasted."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T19:05:14.000Z",
          "Titre": "Mediocre",
          "Contenu": "I like the setting choices. I do not like the way the texts are formatted. The text screen is too busy. I wish it notified you of when texts come in."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Neil",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T15:30:53.000Z",
          "Titre": "There are a few features I would like…",
          "Contenu": "There are a few features I would like to see revised.  Entering a new contact....it would be much more efficient to be able to simply enter the number then the name after it and that would create a new contact, also would prefer the view I choose - list, etc - remain the chosen view instead it defaulting to the first view.  And it would be helpful to have the return messages flagged some way, so they would be easily identified when I need to review responses to my outgoing texts.  As I am new to textrequest - perhaps these are features I just havent fiigured out yet...."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lily",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T20:50:47.000Z",
          "Titre": "please stop sending so many \"how are we…",
          "Contenu": "please stop sending so many \"how are we doing emails\""
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "eye doc",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T18:45:29.000Z",
          "Titre": "If a patient tells us to cancel…",
          "Contenu": "If a patient tells us to cancel appointment then blocks our ability to text them again. ALso doesnt show a number of how many text waiting in the que like a cell phone"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T19:10:39.000Z",
          "Titre": "New customer moving over from zip whip",
          "Contenu": "Used ZipWhip for years, and was very happy. Text Request does not allow us to delete spam messages from our list of received messages.  When I type in a number for my first text, it wont allow me to change the phone number to a name to show on the text scroll.  much more difficult to navigate compared to zipwhip."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Traci",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T14:04:56.000Z",
          "Titre": "Not user friendly",
          "Contenu": "Coming from being a Zip Whip customer, Text request is not user friendly at all.  It is a lot more steps and we have been having issues with it since we started with it last week.  The only thing that was easy was transferring the info right from zip whip to text request."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michelle",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T07:56:28.000Z",
          "Titre": "Still new to TextRequest, missing Zipwhip.",
          "Contenu": "I appreciate good Support, I appreciate that the system tells me how many characters remain and how many texts my passage will require. I don't like the emoji character count, as it severely hinders customer service. I also feel the the system is much less efficient than ZipWhip and requires more steps to accomplish the same goal. I am less than a week into this new format and I hold out hope that my learning curve will level out."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T14:59:34.000Z",
          "Titre": "The rep I talked to said that we…",
          "Contenu": "The rep I talked to said that we wouldn't have to do anything and that they would have everything set up to work. We signed up and canceled our old service. After signing up it didn't work and we found out there were other things that had to be done before canceling the old service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MFDC",
          "Nb_Reviews": 1,
          "Date": "2022-03-17T22:04:45.000Z",
          "Titre": "I do like the way Text Request works…",
          "Contenu": "I do like the way Text Request works well.  However, every time you ask me I'll tell you the same thing - Users require more than 160 characters per text to get messages across without having to use two messages.  Not sure why there is a limit - but I know it can be done as my prior application gave us 600 characters per text.  Why is there a limit??"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "GPL",
          "Nb_Reviews": 1,
          "Date": "2022-02-04T18:16:50.000Z",
          "Titre": "Review",
          "Contenu": "I'm giving a star for the following:Pricing - competitiveEase of use - Easy to learn, teach and utilizeCustomer service - always good with decent response timesI'm not giving a star for:Reporting - Needs to be more robust, include historic trends and visuals to understand deliverability Links -the link shortener works good but should generate a way to track hits to the website that are initiated through text"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Connie",
          "Nb_Reviews": 1,
          "Date": "2022-04-06T17:38:45.000Z",
          "Titre": "The app on my phone does not function…",
          "Contenu": "The app on my phone does not function well and messages are slow and not in real-time. I have had a few instances where the text is held back and vital communications are stopped mid-business. There are some advantages over zip whip that is why the 3 stars."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-04T17:22:17.000Z",
          "Titre": "Works fine, but could be better",
          "Contenu": "The service works fine, but the interface is kind of awkward and clunky.Also, it would be helpful if there were a desktop app or program that could be installed independently, instead of having to load it up in a browser."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paeton",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T00:07:11.000Z",
          "Titre": "I'm not sure what happened",
          "Contenu": "I'm not sure what happened.  My issue was fixed but then we get this barrage of paperwork about a number being deleted."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alexis",
          "Nb_Reviews": 1,
          "Date": "2022-04-04T20:26:05.000Z",
          "Titre": "The interface is clunky",
          "Contenu": "The interface is clunky. It does the job it says it will do, but small inconveniences make it annoying to use on occasion."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Amy",
          "Nb_Reviews": 1,
          "Date": "2022-02-07T14:51:04.000Z",
          "Titre": "I find the search to look up…",
          "Contenu": "I find the search to look up interactions with certain #s confusing and unreliable.  I also find the service expensive, but reliable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vicky",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T00:04:06.000Z",
          "Titre": "Exceptionally helpful staff!",
          "Contenu": "The customer service reps made the process of switching over from ZipWhip to Text Request a breeze! The \"chat help\" responds very quickly, and the online trainings are very helpful also. We especially love the template feature and the groups option. This service is pricier than what we're used to paying for a texting service, but it's been a pretty smooth transition, and is quite user-friendly. I recommend this texting service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marissa",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T03:55:32.000Z",
          "Titre": "we need an ease or way to delete a…",
          "Contenu": "we need an ease or way to delete a message not the contact. sometimes we want to delete bank info, credit card or other sensitive materials"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Heather",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T19:05:42.000Z",
          "Titre": "Easy Transition",
          "Contenu": "The transition has been easy and relatively seamless. It will just take a moment to adjust to the new format. Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Erin",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T15:20:40.000Z",
          "Titre": "We had to make the switch as our former…",
          "Contenu": "We had to make the switch as our former texting software (Zipwhip) was shutting down. Text Request is definitely the best value in comparison to what we were paying with Zipwhip. We're fairly new to Text Request, but so far, the customer service and added features have been great!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Xavier Alisse",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T18:27:02.000Z",
          "Titre": "I was able to reach my client faster.",
          "Contenu": "I was able to reach my client faster.However just like any phone system there are rare tech issues"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrea",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T00:08:02.000Z",
          "Titre": "I liked the easy of transferring our…",
          "Contenu": "I liked the easy of transferring our information.  We did that on a bad that was not so great with a problem getting our number transferred.  Communication was great once we figured out the whole scope of the problem."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Fedora Transportation",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T17:59:47.000Z",
          "Titre": "The service does what it represents",
          "Contenu": "The service does what it represents, although more options would help. Customer service/tech support was prompt in responding to issues. I will continue to use the service for my business."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shea",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T17:28:53.000Z",
          "Titre": "TextRequest makes communication easy!",
          "Contenu": "TextRequest makes it so easy to communicate with employees and clients - especially for group messaging!  Being able to schedule texts in advance is one feature that we use a lot, and it's nice knowing we can schedule reminders in advance.  The only thing missing is the ability to edit contact numbers."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Genesis",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T17:32:42.000Z",
          "Titre": "Feeback",
          "Contenu": "I like that we can send messages and clients can read text, see images, and receive links all at once. However, many clients complain that they don't always receive the messages we sent. So, the service is spotty."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matthew Proffitt",
          "Nb_Reviews": 2,
          "Date": "2023-06-01T17:29:56.000Z",
          "Titre": "Great product for small business",
          "Contenu": "Better than previous experiences with texting companies. Only company out of 4 that would reply to my inquiry about learning more about the product. Would like to see more plan options for adding additional text but not additional dashboards. Overall had a great experience with product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ruben",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T01:20:16.000Z",
          "Titre": "Great service",
          "Contenu": "Great service.  Good product and price point.  Transition from Zip whip (with Farmers) was rough.  Not all the functionality and migration was able to take place and was not vetted properly on the front side."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "L.M.",
          "Nb_Reviews": 1,
          "Date": "2022-02-04T16:54:07.000Z",
          "Titre": "My office likes EVERYTHING about Text…",
          "Contenu": "My office likes EVERYTHING about Text Request. The platform, ease, simplicity, the updates, the ever evolving changes, the customer service. This is a great company and having a texting platform has been an EPIC game changer for our operations. The service itself is 5 stars. I had to deduct a star because the pricing is just too high. I've done some comparative estimates with other companies and Text Request is so significantly higher. The reason I haven't switched? I simply haven't figured out which direction I want to go in. With a heavy heart I say there is no other option for me in the near future, not with the pricing of the other systems out there. I will eventually be moving on from Text Request simply because of the pricing. But again the product itself is stellar."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RICH",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T14:47:40.000Z",
          "Titre": "EASY",
          "Contenu": "Text central has got to be the best way for customers to reach out without staying on the phone or not getting an answer on the phone."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chelsea",
          "Nb_Reviews": 1,
          "Date": "2022-04-11T21:36:34.000Z",
          "Titre": "Great so far!",
          "Contenu": "My experience using Text Request has been smooth so far. Sometimes it seems to glitch and show the same conversation twice, but otherwise it has provided exactly what I need for my job."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carson B",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T23:24:47.000Z",
          "Titre": "Solid communications app",
          "Contenu": "Always reliable and fast with only a few minor hiccups or bugs. Good range of accessories and ways to connect with clients or employees"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kristie",
          "Nb_Reviews": 1,
          "Date": "2022-02-04T16:58:24.000Z",
          "Titre": "I absolutely love text request but the…",
          "Contenu": "I absolutely love text request but the only negative thing I can say is if you don't use all of the text you pay for monthly they do not roll over for the next month, but the minute you go over you are charged a LOT."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Angela",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T13:54:36.000Z",
          "Titre": "Good experience",
          "Contenu": "Called Text Request with questions, they answered all the questions.  Good experience and I would highly recommend this business to others."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Maurice",
          "Nb_Reviews": 2,
          "Date": "2022-02-11T17:08:06.000Z",
          "Titre": "The texting option has been a great…",
          "Contenu": "The texting option has been a great addition to our business but we do get a lot of spam texts and there is no way to stop them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Greg",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T21:12:45.000Z",
          "Titre": "Super smooth transition onto the…",
          "Contenu": "Super smooth transition onto the platform."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Zak",
          "Nb_Reviews": 1,
          "Date": "2022-04-04T18:42:48.000Z",
          "Titre": "Some of the functions require more…",
          "Contenu": "Some of the functions require more steps than I think is necessary. But overall it is a good app"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Billy",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T23:05:46.000Z",
          "Titre": "User friendly",
          "Contenu": "The software is easy to use"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Fax",
          "Nb_Reviews": 1,
          "Date": "2022-02-04T16:57:17.000Z",
          "Titre": "PDF Attach",
          "Contenu": "It would be super helpful for us if we could attach PDFs."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "George",
          "Nb_Reviews": 1,
          "Date": "2022-02-12T23:31:05.000Z",
          "Titre": "Very helpful instrument for reaching my…",
          "Contenu": "Very helpful instrument for reaching my candidates."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patrick",
          "Nb_Reviews": 1,
          "Date": "2022-04-05T15:05:13.000Z",
          "Titre": "Good",
          "Contenu": "It is good for my needs"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Megan",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T23:15:00.000Z",
          "Titre": "Text Request has been so helpful!",
          "Contenu": "Text Request has been so helpful! The support team was not only quick to respond, but also highly knowledgeable, offering assistance whenever I had questions or concerns. I highly recommend Text Request for anyone seeking a reliable and user-centric texting solution."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nathaniel Andreas Ruzicka",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T23:11:03.000Z",
          "Titre": "TextRequest is a Reliable Friend in a Sea of Scoundrels",
          "Contenu": "TextRequest is an honest SMS provider that cares about our issues and responded to them as fast as we can reasonably expect. Other vendors like Klara, Nimble, and ZipWhip all played games to extract money out of us, TextRequest saved us from having to deal with all of them. 6/5 would get again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RB Fowler",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T18:49:32.000Z",
          "Titre": "My firm has not finished the on…",
          "Contenu": "My firm has not finished the on boarding process yet, but there is NO doubt that will happen.  I got a text reply from the CEO within 10 minutes of texting, then a follow up call from him, then a call from the business partner manager.  Great overall experience through out it all.  They remind me of our firm.... Customer Service MUST be 1st!  OOrah!  Randall FowlerOwner/CEOHBE InternetYakabit Business Phone"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "john",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T17:53:11.000Z",
          "Titre": "We signed up for text request due to…",
          "Contenu": "We signed up for text request due to Zipwhip closing down.  The transfer of service was seamless.  Everything went through quick and easy. The support staff helped with the transition."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Megan  Lott",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T17:02:35.000Z",
          "Titre": "Perfectly smooth transition from other…",
          "Contenu": "Perfectly smooth transition from other platform we were using.  Really great experience with the team."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Claudia Satori",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T20:46:20.000Z",
          "Titre": "INCREDIBLE SERVICE",
          "Contenu": "INCREDIBLE SERVICEWe have been working on replacing Zip Whip which was decommissioned by Twilio. Text Request made the process so simple, we were up and running in 15 minutes, while we waited over 24-48 hours to hear back from other providers. They worked to get Twilio to release our phone # over 72 hours."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T18:31:39.000Z",
          "Titre": "Perfect Solution For Our Needs",
          "Contenu": "Text Request is the perfect solution for our needs. We wanted a simple way to blast texts to employees and this fit the bill. We like how easy it is to use while still having fairly robust features."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeremy",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T23:34:25.000Z",
          "Titre": "Great replacement for ZipWHip so far",
          "Contenu": "Great replacement for ZipWHip so far, expense is more. There are a bunch more features in the system we have not worked on utilizing yet."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nina",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T16:27:08.000Z",
          "Titre": "Easy and Time Efficient",
          "Contenu": "Text Request is super easy to use and efficient. Makes texting our patients a breeze! Most loved feature is the pre-made templates you can make. No more typing the same thing over and over again! Just a few clicks and you can send the text!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mathnasium of Litchfield Park",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T03:13:18.000Z",
          "Titre": "Super Easy and Useful",
          "Contenu": "This texting app makes reaching customers super easy. I find the program very useful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bruce",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T18:38:41.000Z",
          "Titre": "Excellent Application and Extraordinary Customer Service",
          "Contenu": "The application is excellent, and the Text Request team members were extraordinarily responsive and helpful to get everything setup!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T21:36:53.000Z",
          "Titre": "Ideal for what we are looking for",
          "Contenu": "Ideal for what we are looking for. We needed a platform to communicate scheduling with customers that is a live dialogue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "C Boling",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T18:42:43.000Z",
          "Titre": "Loving it!",
          "Contenu": "So far the program is very easy to use and it is working perfectly for our needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joan",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T06:02:50.000Z",
          "Titre": "Transfer from ZipWhip texting to Text Request for my Glendora Kumon Franchise",
          "Contenu": "After using ZipWhip for 5 years I decided change to Text Request. I found that the similar format of the message pages and client information provided a smooth transition with the help of my Rep Kami Rowe. She made merging the ZipWhip information into the Text Request format as smooth as possible. Kami and her team have given me help, whenever I need it through texting and Zoom. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amanda",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T16:54:41.000Z",
          "Titre": "We just started using Text Request!",
          "Contenu": "We just started using Text Request at work, and so far everything has been great!! The website is easy to navigate!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Allen",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T11:17:57.000Z",
          "Titre": "Customer Service!",
          "Contenu": "Our branch just started using Text request less than a month ago and I was having technical issues and could not resolve them on my own. My support rep helped resolve issues asap and communicated with me the entire time (even followed up after it was resolved). I highly recommend them!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Age-Less Medicine",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T15:40:43.000Z",
          "Titre": "Coming from being a Zip Whip customer",
          "Contenu": "Coming from being a Zip Whip customer, Text request is not user friendly. It is a lot more steps and we have been having issues with it since we started with it last week. Group messages are a little difficult to put together. The only thing that was easy was transferring the info right from zip whip to text request."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T18:29:51.000Z",
          "Titre": "Great transition from Zipwhip!",
          "Contenu": "Great transition from Zipwhip!Much better setup"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephee Melucci Stephee Melucc",
          "Nb_Reviews": 2,
          "Date": "2023-11-14T20:43:44.000Z",
          "Titre": "Text Request is by far superior to ZipWhip",
          "Contenu": "Text Request is by far superior to the old text platform we used to use. Especially with ease of use and the way the dashboard is laid out."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DQ",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T04:01:45.000Z",
          "Titre": "Could not have been easier to migrate…",
          "Contenu": "Could not have been easier to migrate my extensive Zipwhip text data."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 3,
          "Date": "2023-09-07T03:02:52.000Z",
          "Titre": "10DLC hero and great user interface",
          "Contenu": "I was texting with my landline through Twilio using a third party front end.  However, with 10DLC, I wasn't able to get my number registered through Twilio.  I submitted my request 3 time with Twilio and I was rejected everytime.  I couldn't afford to wait any longer so I opened an account with Text Request and ported my landline number over.  Text Request had my campaign and number registered in less than 2 days.  Now I'm back online texting with my customers.  Also, my staff is happier with the interface compared to what I was using before."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Philip Gates",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T15:21:35.000Z",
          "Titre": "Best Texting Platform for our Business",
          "Contenu": "Text Request has been a perfect fit for our company. User friendly and a seamless transition from Zipwhip to Text Request. Text Request  has many options available to customize the service for our specific needs and we can finally say goodbye to  Zipwhip. The ability to schedule texts ahead of time is a huge time saver for the Dispatchers who are multi-tasking and this tool is a 5 star all day every day."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ANITA",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T04:19:23.000Z",
          "Titre": "I was a bit nervous about finding a…",
          "Contenu": "I was a bit nervous about finding a replacement for ZipWhip, and TextRequest made the transition super easy.  When I need support, I get to actually speak with a “live” agent and that is worth it all."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karla Martinez",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T19:39:14.000Z",
          "Titre": "Best Texting Platform for Business",
          "Contenu": "Text Request has been a wonderful company to work with. From the initial to demo to actual implementation it has just been a smooth transition throughout. The system itself is so user friendly set up is a breeze. My team and by extension our customers love it! We can't wait to continue to expand its use. Special shout out to our account rep Jess Olienyk. Appreciate everything you have done to make our experience so successful."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Thari",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T17:34:09.000Z",
          "Titre": "User Interfaces are incredibly intuitive",
          "Contenu": "We've used various text messaging tools in the past, but they were not as user-friendly as Text Request. Text Request's user interfaces are incredibly intuitive and easy to manage. So far, the experience has been awesome."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deb Taylor",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T17:36:31.000Z",
          "Titre": "TextRequest has been a game changer for us",
          "Contenu": "We are a real estate brokerage of almost 500 agents. Communication with them on the fly was daunting and spotty at best. TextRequest changed everything for us. Agents live by their mobile devices and emails were just getting lost in the shuffle. We can now send out reminder texts for training with short links, reminders of events and most of all, last minute changes within the company. We could not run our business without them!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Graves",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T22:27:36.000Z",
          "Titre": "Great product helping us to run our…",
          "Contenu": "Great product helping us to run our daily business with about 35 employees and 20-30 clients at all times. I like ability to manage one-off messages (and mark as done or leave un-done) and do group texts. Not perfect product but really good and won't be changing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Antonia Ventola",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T18:11:43.000Z",
          "Titre": "Text Request time saver!",
          "Contenu": "Text Request has saved me so much time in my workday answering FAQs with features like scheduled messages, templates, tec. It is so easy to navigate and learn to utilize!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Libby Lossing",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T19:32:21.000Z",
          "Titre": "Great Text Platform for Multi-Unit Operations",
          "Contenu": "My franchise uses TextRequest for all our locations. We love that we can use our landline numbers for texting. It's easy to select a location from a drop down menu so I can manage multiple locations from one login."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin and Victor",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T20:16:57.000Z",
          "Titre": "Seamless Transition",
          "Contenu": "I needed some guidance while setting up 4 lines and merging all four lines. Support was very helpful during this time. Kat was absolutely amazing throughout the entire process. Jessica and Kami from support have been amazing! :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amanda Mantegna",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T20:44:29.000Z",
          "Titre": "Great service!",
          "Contenu": "This service is very easy to navigate and reliable to communicate with our patients. If we have a concern, we message the support and it is answered very quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T20:36:58.000Z",
          "Titre": "Sean Stevens was a lot of help today in…",
          "Contenu": "Sean Stevens was a lot of help today in my transfer from Zipwhip to Text Request. He responded quickly and thoroughly explained the process. Was very friendly as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin Hajek",
          "Nb_Reviews": 2,
          "Date": "2023-04-27T17:13:32.000Z",
          "Titre": "Easy to Use and Lots of Great Options to Fit any business model",
          "Contenu": "Txt Request has been a great tool for our business over the last few years to make sure we can stay engaged with our thousands of clinicians and millions of members. This has made our customer support team's job so much easier and faster."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryan Hunter",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T21:06:49.000Z",
          "Titre": "Fully Interactable and Easy to Use",
          "Contenu": "It's fully interactive with employees and clients alike and keeps everything organized. Even your old phonebooks are full convertible into their system. Easy to use interface and fun to work with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elisia",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T16:38:44.000Z",
          "Titre": "Smooth transition from Zip Whip",
          "Contenu": "We were using Zip Whip and this has been a very smooth transition.  Everyone has been very helpful throughout the process.  We were able to easily bring our contacts and conversations over from Zip Whip.  It has been a great experience so far."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phil Manes",
          "Nb_Reviews": 2,
          "Date": "2022-02-07T00:20:39.000Z",
          "Titre": "Perfect. No improvements needed",
          "Contenu": "We find the Text Request program and app the best way for us to quickly communicate with our customers. Customer texts come to both our office computer and the duty cell phone.  So customer texts can be responded to quickly even after hours if needed. I cannot think of any way Text Request could be improved."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amy",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T16:59:11.000Z",
          "Titre": "The Text Request team has been…",
          "Contenu": "The Text Request team has been extremely helpful.  Kami Rowe has gone above and beyond.  We really appreciate all the effort on the onboarding process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Natalie M.",
          "Nb_Reviews": 2,
          "Date": "2022-03-15T20:17:05.000Z",
          "Titre": "We LOVE Text Request",
          "Contenu": "We LOVE Text Request.  We transferred over from ZipWhip and this experience has been 100 times better than the one we had using the prior service. Really like that multiple users have log ins, the group messaging feature as well as the ability to send attachments and being able to download conversations into a PDF."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erika Herman",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T15:30:51.000Z",
          "Titre": "We used to text via the old method",
          "Contenu": "We used to text via the old method - our cell phones - but that made it difficult to continue conversations with our clients when a staff member left for the day.  We switched to Text Request and now all of our team can continue conversations with any of our clients. Makes communication easy and effective!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alliance Video Productions",
          "Nb_Reviews": 1,
          "Date": "2022-08-25T22:37:42.000Z",
          "Titre": "EXCEPTIONAL!",
          "Contenu": "We just began our service and I couldn't be more pleased with the attentive, courteous, and professional exchanges we've had thus far! Howard, Savannah, and Ruth have been exceptional! I'm very happy we chose Text Request!  It's easy to see how much they all care!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Tim",
          "Nb_Reviews": 1,
          "Date": "2022-02-11T17:14:34.000Z",
          "Titre": "Text request has been a great asset for…",
          "Contenu": "Text request has been a great asset for our business. The accuracy from having customers send us their information has reduced errors in orders. Also, being able to see a picture of our customer's part(s) helps in quickly and accurately placing orders. There is also the benefit of having part numbers and quoted prices on record, so if there is a delay in placing an order, we can quickly find the original information. Texting also speeds up getting messages to customers - no more \"phone tag.\" The small financial cost is far outweighed by the savings in time and efficiency ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rob",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T15:23:22.000Z",
          "Titre": "Really easy to use!",
          "Contenu": "Text request has made it easy to send out reminders to our customers about upcoming events at our store. We've really enjoyed using the keywords feature; it has gotten a lot of positive feedback from our customers who can text buzzwords to our numbers and receive customized info on the products and services we offer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sidney Hooper",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T21:16:45.000Z",
          "Titre": "Fantastic Option for Engaging with Customers!",
          "Contenu": "The customer service is fantastic. The ability to customize messaging, keywords and responses to service our fans is something we haven't had before. We enjoy the ease of use of the platform. Overall, it's really helped our organization reach our fans in a more convenient way."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charley Rickey",
          "Nb_Reviews": 1,
          "Date": "2022-07-05T21:48:58.000Z",
          "Titre": "5 years as a customer, continue to be pleased",
          "Contenu": "We have been using Text Request since 2017. The service was great from the start and has continued to improve. We recently added an additional feature that required support to implement. The TR rep was responsive and helpful, and the whole process went very smoothly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 1,
          "Date": "2022-12-22T17:23:17.000Z",
          "Titre": "Amazing Support",
          "Contenu": "The best thing about this program is being able to import all of your contacts. I used the ZipWhip migration tool as well as imported from .csv files. They have a support person dedicated to your account as well as a tech support team that you can text. Overall this program is very user friendly. Even the older people in the office that are old school can use this!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dr. Linda Kelley",
          "Nb_Reviews": 1,
          "Date": "2022-02-11T17:11:41.000Z",
          "Titre": "We were early adopters to using text as…",
          "Contenu": "We were early adopters to using text as the primary way of communicating with leads and patients. Text Request has been a very helpful service for us. We are able to address problems and do lead follow up remotely from the office. Signing up for Text Request was one of the best business decisions I ever made."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bridget",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T15:43:04.000Z",
          "Titre": "Customer service is off the charts",
          "Contenu": "Customer service is off the charts, the company really is there to help. They help with any questions you have and work through any issues in real time, I would definitely recommend text request if you are looking for a new software!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matt",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T23:31:01.000Z",
          "Titre": "Awesome Customer Service!",
          "Contenu": "When we experienced some technical issues and authorization red tape on our newly-ported texting lines, Ruth took care of us and kept us informed of the work progress every step of the way (including on the weekend!).So glad we made the switch to TextRequest!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Bozeman",
          "Nb_Reviews": 2,
          "Date": "2022-06-29T20:16:32.000Z",
          "Titre": "Text Request vs. Zipwhip",
          "Contenu": "Text Request has been a great replacement for Zipwhip.  It does everything and a little more.  Their data migration tool made for an easy transition of our Zipwhip data (HUGE).  After we purchased their support/training was also great.  I would highly recommend this software."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gabi",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T20:32:07.000Z",
          "Titre": "Seamless transition and user friendly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Diane",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T18:56:20.000Z",
          "Titre": "The representative Audrey Turner was very informed and insightful.",
          "Contenu": "The representative Audrey Turner was very knowledgeable. She went over the website an gave examples of each area and how to use it in under 30mins."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wendy",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T15:21:23.000Z",
          "Titre": "Excellent!",
          "Contenu": "Had a couple of issues and these were solved very quickly! Customer service for Text Request is exceptional! Response time is almost immediate so I was never left waiting for a long time to get a reply."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michele",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T16:40:55.000Z",
          "Titre": "Still in the honeymoon phase",
          "Contenu": "Still in the honeymoon phase. On the first day of using, customer responses were positive and had a google review post 5 stars when customer responded to our thank you/completion template!  So that's a big plus, will continue to use and have recommended to my sister's company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Liz",
          "Nb_Reviews": 1,
          "Date": "2023-02-19T22:23:17.000Z",
          "Titre": "The system is so easy to use",
          "Contenu": "The system is so easy to use. And their customer service is top notch. I love how you can do the training just by a few clicks and it walked you through everything. Absolutely would recommend to any company looking to use text as an option for their customers!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Holly",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T02:23:09.000Z",
          "Titre": "I was nervous for transition from…",
          "Contenu": "I was nervous for transition from Zipwhip…but very smooth and great support from text request team."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jenni",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T18:06:45.000Z",
          "Titre": "Set up with Text Request was a breeze",
          "Contenu": "Set up with Text Request was a breeze! They walked us through the process step-by-step, transferring our contacts was easy. They followed up with us later the same day to see if we had any questions or concerns."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tania",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T13:15:29.000Z",
          "Titre": "Great communication",
          "Contenu": "Great communication, great service, great productThe transition process was wonderful. The customer service reached out to offer assistance to ensure everything was smooth. The product works great and I'm thankful to have reliable service for my company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Payton",
          "Nb_Reviews": 1,
          "Date": "2022-02-11T16:53:00.000Z",
          "Titre": "Text request has been such a great tool…",
          "Contenu": "Text request has been such a great tool for our company. So many great benefits and I love all the features available with this system. Nice job on molding this software and I am grateful that our company gets to experience all the benefits of having this."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charlie",
          "Nb_Reviews": 2,
          "Date": "2022-02-04T21:53:05.000Z",
          "Titre": "We are in contact with potential…Customers and employees",
          "Contenu": "We are in contact with potential customers, current customers and potential employees. I love being able to use Text Request as a business owner because nobody needs to know my personal cell number. It's been VERY useful ever since Merry Maids incorporated it into our business. Thank you!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "kara -stallion services inc.",
          "Nb_Reviews": 1,
          "Date": "2022-02-11T17:04:43.000Z",
          "Titre": "As always you can’t go wrong using this…",
          "Contenu": "As always you can’t go wrong using this service. The Roi is incredible if you are utilizing the program properly. It’s user friendly and their team will gladly assist in any issues you may have."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alexandria",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T23:04:46.000Z",
          "Titre": "We needed a texting platform to replace…",
          "Contenu": "We needed a texting platform to replace ZipWhip and Text Request was the winner. We have our whole office on board and we are all loving the simplicity and ease of the platform."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Courtney",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T13:35:11.000Z",
          "Titre": "Text request is simple to use",
          "Contenu": "Text request is simple to use. Very user friendly. It helps me communicate with customers that cant speak on the phone but need to make appointments and ask questions."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Ashley",
          "Nb_Reviews": 1,
          "Date": "2022-07-04T17:10:00.000Z",
          "Titre": "Amazing Experience!",
          "Contenu": "I just switched over from another text company and was hesitant at first (a little nervous to not get the same customer experience) but i had one minor issue and it was fixed right away they even called without me asking because we were going back and forth on email. I have never had such quick replies and better customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amy",
          "Nb_Reviews": 1,
          "Date": "2022-03-23T17:38:35.000Z",
          "Titre": "A worthy Zipwhip replacement",
          "Contenu": "When we learned that Zipwhip was shutting their doors, we went looking for a suitable replacement for our business. We landed on Text Request because they use the actual business landline number, and were also able to import and preserve all of our contacts and conversations from Zipwhip. Text Request is a robust service with several features that were not present in Zipwhip and we have been very happy with the switch."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Bozeman",
          "Nb_Reviews": 2,
          "Date": "2022-04-05T00:56:56.000Z",
          "Titre": "Switching from Zipwhip to Text Request…",
          "Contenu": "Switching from Zipwhip to Text Request was much easier than expected.   Their team has been very helpful.  We needed very little training because the functionality was very similar.   I highly recommend Text Request as a replacement for Zipwhip."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hannah Grace Mitchell",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T21:23:23.000Z",
          "Titre": "Easy communication for large groups",
          "Contenu": "We've been using TextRequest as a way for our athletic department to communicate with fans. It makes communicating with large groups so easy, and the possibilities are endless when it comes to segmenting and grouping. We love it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Katy Bauer",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T22:58:15.000Z",
          "Titre": "Great Customer Experience",
          "Contenu": "We're new to Text Request, but so far every experience has exceeded expectations. I've received timely, accurate, helpful support and assistance from sales, customer, and tech support. I'm thrilled!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Flo",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T20:50:30.000Z",
          "Titre": "This is an amazing tool we've added to…",
          "Contenu": "This is an amazing tool we've added to our software. It integrates seamlessly and clients are loving the real live conversations they can have with their patients."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shelley",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T00:41:55.000Z",
          "Titre": "Easy to Implement & Good Pricing",
          "Contenu": "We received a notice that our then current service, ZipWhip, was shutting down and that we needed to change to a new vendor. Text Request was the only one we could import our data to. It was very easy to get switched over. It took less than 5 minutes. And, it saved us money."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deanna Stonecipher",
          "Nb_Reviews": 2,
          "Date": "2023-06-14T17:07:56.000Z",
          "Titre": "Using Text Request is a Great Experience",
          "Contenu": "We are having a great experience using Text Request.  The program is very easy to use.  We just had our first experience with customer support and the representative was very helpful and was able to resolve our issues quickly and to our satisfaction."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Code Ninjas",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T20:37:06.000Z",
          "Titre": "Easy to navigate",
          "Contenu": "Easy to navigate. Did a similar text program before that had issues. Very easy to filter customers. Great customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lydia",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T21:34:07.000Z",
          "Titre": "Welcoming, Quick, Helpful",
          "Contenu": "Welcome call.  Scheduled training promptly. Training was easy to follow and learn how to use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Mac Gregor",
          "Nb_Reviews": 2,
          "Date": "2023-05-31T17:24:58.000Z",
          "Titre": "Text request has made it so much easier…",
          "Contenu": "Text request has made it so much easier for us to communicate with our customers, also for them to be able to send us pictures of thier HVAC issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chenoweth",
          "Nb_Reviews": 1,
          "Date": "2022-02-11T22:07:44.000Z",
          "Titre": "Text Request has been a great resource…",
          "Contenu": "Text Request has been a great resource for our flower shop to communicate with our drivers. It has made communicating with the delivery drivers so much quicker and has made order confirmation so much easier. In our world of text communication, Text Request is definitely the way to go!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ron Ashley",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T21:17:20.000Z",
          "Titre": "Best and Easiest",
          "Contenu": "Text request truly makes it easier to communicate with the Candidates and Officers in the field. I Would reccomend this to anyone"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JoAnn Berg",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T17:32:15.000Z",
          "Titre": "I like that I can connect with…customers",
          "Contenu": "I like that I can connect with customers without have to give out my personal number The scheduling feature is also a big plus- I can schedule messages at 4:30 am to go out when normal people finially are awake"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brenda",
          "Nb_Reviews": 1,
          "Date": "2023-02-27T17:24:32.000Z",
          "Titre": "Getting up and running is easier than tying your shoes!",
          "Contenu": "This was the easiest company to get started with! The service is swift and accurate. I could only dream of having this kind of service in other aspects of my business!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GBR",
          "Nb_Reviews": 1,
          "Date": "2022-02-11T17:34:49.000Z",
          "Titre": "Text Request is an amazing platform for…",
          "Contenu": "Text Request is an amazing platform for all businesses. We increased attendance every time we send out texts for our events."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tracy",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T22:47:13.000Z",
          "Titre": "I use this daily",
          "Contenu": "I use this daily. It is a great tool that allows businesses to text their members/clients and quickly share documents with them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dhruv Garg",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T13:25:22.000Z",
          "Titre": "For sure this company is better than…",
          "Contenu": "For sure this company is better than zipwhip. I like its referal program, payments system and special rewards program."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Isaac Loewen",
          "Nb_Reviews": 2,
          "Date": "2023-04-05T00:38:43.000Z",
          "Titre": "They are helpful...",
          "Contenu": "They are helpful in getting things fixed when something goes wrong which is not very often and they are very friendly to work with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2022-04-04T16:52:52.000Z",
          "Titre": "Text Request provided a seamless…",
          "Contenu": "Text Request provided a seamless transition from our former text platform. Everything was completed in the quoted timeline and that is important to our business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen Aller",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T19:07:10.000Z",
          "Titre": "TextRequest improves customer relations",
          "Contenu": "TextRequest is an easy to use tool that has made interacting with my customers so much easier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Danny Dukes",
          "Nb_Reviews": 2,
          "Date": "2023-08-07T05:40:42.000Z",
          "Titre": "Fantastic Text System",
          "Contenu": "This Text System is so much better than others in the market. There's more accountability and features"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jagadish",
          "Nb_Reviews": 1,
          "Date": "2023-04-29T23:20:59.000Z",
          "Titre": "Audrey was knowledgeable and patient",
          "Contenu": "Audrey was knowledgeable and patient. She helped me understand how to use the platform specific to my business needs."
        },
        {
          "Note": 5,
          "Lieu": "RS",
          "Pseudo": "Aleksandra",
          "Nb_Reviews": 5,
          "Date": "2023-04-28T04:20:03.000Z",
          "Titre": "Just some of Text Req perks",
          "Contenu": "The company is doing everything that nowadays modern mobile phone can via SMS messages, just without any carriers or signal interruptions and able to mass message which is also great feature!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Denise",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T13:36:56.000Z",
          "Titre": "Love the texting",
          "Contenu": "Love the texting!  I used a very generic product before and this one has so much more!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patti",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T15:19:44.000Z",
          "Titre": "ZipWhip to Text Request",
          "Contenu": "We recently had to do the switchover from ZipWhip and it was pretty seamless.... no issues, pretty quick."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sol",
          "Nb_Reviews": 1,
          "Date": "2022-02-11T17:14:58.000Z",
          "Titre": "Text Request is a great tool to keep in…",
          "Contenu": "Text Request is a great tool to keep in touch with our customers, is cost-effective, and is very much a part of our daily business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kim Teems",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T23:23:31.000Z",
          "Titre": "Using the texting program has been so…",
          "Contenu": "Using the texting program has been so easy and seems to get a lot more customer interaction than our old methods."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brenda Yeung",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T22:52:24.000Z",
          "Titre": "This application is an essential part…",
          "Contenu": "This application is an essential part of our business operations and it is very easy to use?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T05:27:55.000Z",
          "Titre": "Great customer service.",
          "Contenu": "Team was very helpful with the transition from Zipwhip."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas Duffy",
          "Nb_Reviews": 3,
          "Date": "2023-06-02T07:05:15.000Z",
          "Titre": "Easy to set up and use",
          "Contenu": "I don’t recall. The product works and was easy to set up. I am not sure what to say. Text Request is a tool. I feel like I am reviewing a tool. So I have never written a review about a hammer or a screwdriver. I guess I could. I will give it some thought."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shawna Russell",
          "Nb_Reviews": 1,
          "Date": "2023-04-26T18:03:30.000Z",
          "Titre": "Ruth did a great job resolving our…",
          "Contenu": "Ruth did a great job resolving our texting issue.  She helped me figure out our issue and was able to get it fixed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ashley",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T19:29:24.000Z",
          "Titre": "Easy + Helpful",
          "Contenu": "Text Request is super easy to use! Their support team is available when needed and very helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ming",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T00:00:54.000Z",
          "Titre": "Very useful for improving communication…",
          "Contenu": "Very useful for improving communication with customers , and for building up our business. The tech support is very helpful when we called with account issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kim",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T14:15:07.000Z",
          "Titre": "Great texting platform",
          "Contenu": "Text Request is very easy to use and setup.  The customer service is excellent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "erik",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T21:33:42.000Z",
          "Titre": "responsive and prompt",
          "Contenu": "text request were responsive and prompt"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cheryl",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T18:44:03.000Z",
          "Titre": "Excellent Customer Service",
          "Contenu": "Had an issue with text not going through.  Customer Service Presentative Sean was very thorough and his communication was superb!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gabrielle McCollum",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T15:59:00.000Z",
          "Titre": "Amazing",
          "Contenu": "Amazing! So grateful for the easiness. It has improved our communication with our clients so much!"
        }
      ]
    }
  ]
}