{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.dxsabers.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William Bird",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T17:01:14.000Z",
          "Titre": "If I could rate zero stars I would.",
          "Contenu": "If I could rate zero stars, I would. A compete waste of time and money. I've been dealing with their customer service for over 5 months for several products missing from multiple orders and getting nowhere. I've been told multiple times that the products will be sent the day of the emails back, and never receive any sort of tracking. Save your time and money and just order from another retailer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Colton Goodman",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T19:43:09.000Z",
          "Titre": "No charger received with lightsaber after months waiting",
          "Contenu": "I never received my charger for my lightsaber and I have asked them personally multiple times through messenger on Facebook and they reply how sorry they are every time but never send it. Without a charger I can’t even use my lightsaber and I’ve had it since February 2023. I’ve been patient for months with multiple messages before finally leaving this review. Don’t trust DX Sabers if they say they will do something."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joshua Lewis",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T14:47:15.000Z",
          "Titre": "Ordered A light saber and and it's came…",
          "Contenu": "Ordered A light saber and and it came in peices and when I turned it on it started smoking. Dx sabers are a scam drop shippers and the dx brand is hilts that are broken or rejects or returns and Paul makes his own sabers out of hot glue.  Took almost a year and my bank is opening a fraud lawsuit against dx sabers.  Avoid if you like money"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ron Lanning",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T05:06:15.000Z",
          "Titre": "Worst lightsaber experience ever.",
          "Contenu": "In my OPINION I would tell everyone that is looking to buy a lightsaber: DO NOT EVER PURCHASE ANYTHING FROM DX SABERS.I made my initial purchase on May 25 of 2023. I was told the saber will be shipped in 7-10 days. I was then informed that the shipping time would be increased by 2 more weeks.The 2 weeks went by and I did not receive any updates from Dx Sabers. I sent a few e:mails asking for an update to the status of my order and silence has been their reply.This situation has continued for the past 7 months.My e:mail requests are rarely answered, their promises or never fulfilled and I have been waiting to receive my refund for 4 months.I have sent 76 professionally worded e:mails and have received only 12 replies.Today i discovered that my e:mail capability has been blocked by Dx Sabers. I am no longer able to send an e:mail or reply to any previous e:mails.In my OPINION Dx Sabers is a dishonest company concerned only with taking your money and leaving their customers out to dry."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ron Lanning",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T00:46:54.000Z",
          "Titre": "Why a 1 rating?",
          "Contenu": "I want to thank the people at Dxsabers for responding to my review of their company.In the response Dxsabers states that my refund was deposited on November 30th. They had asked for my Venmo account and stated in the second paragraph that the monies would be deposited in this account on November 30.Today is December 1st. and I have yet to see the refund deposited in my Venmo account.This is exactly why I cannot give Dxsabers a rating any higher than 1.Ron,Thank you so much for reaching outWe have been letting you know that the date for your scheduled refund was November 30th, and that you did not have to send us 4 emails per day as we would reach out to you when the time came for us to refund you.We really appreciate it and if you could check your account you should see the amount has been refunded and we do really appreciate the feedback whether positive or negative.We are going to use the feedback to become a better company and to do a better job for each one of our customers to the best of our ability.Ron, despite the way you feel we are truly here for you and please email us if you need anything or have any issues as we are always here to help.The same goes for anyone who reads this review as we are always here for our customers no matter what happens.May the force be with you always, Ron, and we hope you are having an awesome day!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Highman JG.",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T03:12:52.000Z",
          "Titre": "Still waiting for a really long time….",
          "Contenu": "Hello everyone,   Unfortunately I am still waiting for my sabers since May 4th. It is with a heavy heart that the saber I purchased was for my nephew who was a very big Star Wars fan passed away. Never received his saber till this day I am still waiting that way his brother can put it on his mantle that he made. Hopefully I can receive them soon."
        },
        {
          "Note": 1,
          "Lieu": "CO",
          "Pseudo": "Jorge Martínez",
          "Nb_Reviews": 3,
          "Date": "2023-12-06T02:55:08.000Z",
          "Titre": "They kept lying and I stopped…",
          "Contenu": "They kept lying and I stopped believing, now ! For weeks they promised to give another saber cuz mine never came , and week after week they promised the same and I kept believing, I'm gonna copy-paste what they said But I'm done . I got no tracking,  no saber , no refund , you STOLE my time and money. Evidence : Jorge, we actually did send it out and I haven’t had a chance to send tracking to you because I have been in a comicon with my husband all weekend in New York City while also taking care of our two children who are extremely sick. Once we get into the office tomorrow I will send tracking to you and you should have your LightSaber within the next two weeks._____Thanks Jorge, once I get into the office this morning I will send you trackingMay the force be with you!_____..... We do not lie to customers and we are always here to help resolve any issues that they have with us or the shipping companies If you have issues please let me know and my husband and I are here to help you solve them I should have your tracking information from the factory by tonight _______We didn’t give you tracking yet? May the force be with you!(that's the last time they wrote days ago) And it's been months since I first bought it so you may understand , months of lies and excuses ..Update just minutes ago , as always they answer as soon as a one star review is posted and said this ..We have absolutely had it with your behavior and your multiple one star reviews and your poor treatment of us Unfortunately at this time due to your behavior being incredibly poor and your attempts to disparage our company we will no longer be able to help you with your warranty You keep saying we are so awful and all we have done is try to help you Best of luck as we don’t believe you ever liked our company and we wish your curse would just be gone May the force be with you!DX SABERSCUSTOMER SERVICEWe are always here for you!(AGAIN , LIES) HAVE A NICE LIFE"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ryan oneil",
          "Nb_Reviews": 1,
          "Date": "2023-07-29T20:45:43.000Z",
          "Titre": "Average dx saber experience",
          "Contenu": "I never got an actual tracking number but I mean in the past the sabers alrihjt it just takes awhile to come for some reasonUPDATE:it’s the next week. Still nothing.Update it’s been 2 months haven’t gotten my saber and the customer service has begun to be very stingy in the answers they want to give this I becoming and actual nightmare"
        },
        {
          "Note": 1,
          "Lieu": "CO",
          "Pseudo": "Jorge Martínez",
          "Nb_Reviews": 3,
          "Date": "2023-12-01T16:50:00.000Z",
          "Titre": "I never got my saber , and they kept lying to me",
          "Contenu": "I was asked a few days ago to delete my bad reviews cuz in the mean time they were going to send a new tracking number cuz I never received any lightsaber .. I believed in them , they gave me their word (which now I know It worth nothing) and for a few days they said \" yes we're going to send it (today , tomorrow) etc. But they never did .. believing again in their word I deleted all the bad reviews hoping to get my saber BUT I GOT NOTHING. AND NOW THEY DONT EVEN ANSWER MY MAILS OR DM'S ON IG .SO AGAIN AND FOR THE LAST TIME.I'm not gonna believe you guys again .. I HIGHLY RECOMMEND NOT TO BUY FROM THIS SITE , YOU MIGHT NOT RECEIVE ANYTHING All they give are excuses and promises they never make true . I'm really hurted DeceivedAnd I really trusted you guys , you just ruined my dream .UPDATE DEC 10 2023 .. I RECENTLY SAW YOUR RESPONSE TO MY REVIEW .. STOP LYING , YOU NEVER GAVE ANYTHING BACK TO ME AFTER THEY LOST, NOR A NEW TRACKING NOR SABER NOR MONEY , ANYTHING SO IF SOMEONE REALLY WANT TO TAKE THE RISK , NOW THAT YOU MIGHT GET NOTHING BUT LIES .   THE LAST TIME THEY PROMISED \"BY TOMORROW YOULL HAVE THE TRACKING\" THAT WAS A MONTH AGO .. AND AFTER HALF A YEAR I STILL GOT NOTHING.. JUST EXCUSES AND LIES"
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2022-04-18T21:25:33.000Z",
          "Titre": "Absolute scam",
          "Contenu": "Absolute scam, don't buy from these guys. After reading all the bad reviews, I was worried my saber was never going to arrive (ordered in November), I still haven't got it. It got my money back through the creditcard company, DX sabers started sending me emails saying that I would get my saber if I payed additional shipping costs (3 months after the order). Please don't let these guys scam you for your money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris Johnson",
          "Nb_Reviews": 1,
          "Date": "2022-12-03T01:16:58.000Z",
          "Titre": "Saber has not been delivered since 2…",
          "Contenu": "Saber has not been delivered since 2 years and 10 months ago when it was ordered. Constant emails recycling through excuses saying the hilt is on hand and waiting for the cores, then email stating cores on hand and waiting for the hilt to arrive in stock. Two messages stating it was shipped, one instance the shipper hasn't gotten the package from Dx Sabers and the other time they avoid communications and block all social media contacts. Worst customer service for a product costing $400."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Joséphine",
          "Nb_Reviews": 2,
          "Date": "2023-03-13T17:12:16.000Z",
          "Titre": "Ghosted",
          "Contenu": "Gosh.  It started so well.  Very kind and attentive customer service then I was completely ghosted. One month after making the order I received my money back yet a promise they have been posted, reassuring messages......Followed by being completely ignored. My boys were so disappointed. I think this company is very overwhelmed with orders so perhaps find somewhere else if you a re looking for a reliable company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christian Salinas",
          "Nb_Reviews": 2,
          "Date": "2022-04-18T20:55:57.000Z",
          "Titre": "No repair, no recommendation. Total Scam.",
          "Contenu": "Ordered a neopixel Wrath of Kylo Ren lightsaber back in March of 2021, stopped working entirely within 2 weeks. Sounds wouldn't turn on and saber connection became corrupted. I waited VERY PATIENTLY for the past year on repairs after mailing back this item and I continue to have excuse after excuse on why my item hasn't been repaired or replaced. Never buying from them again. Waste of $400."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Linda Simmons",
          "Nb_Reviews": 3,
          "Date": "2022-12-27T01:59:56.000Z",
          "Titre": "I ordered and paid for a saber in…",
          "Contenu": "I ordered and paid for a saber in November 2020 as a Christmas present for our son, I received a DHL shipping advice soon after, but months later nothing was delivered so I contacted DX Sabers, thus began a litany of lies, they said it was with DHL, I had to track down the correct DHL dept who said it was never picked up from DX Sabers, then they offered a refund, I’m still waiting for the money, over 2 years later. They just keep lying to their customer, very unethical and untrustworthy. I will keep reviewing them to warn others to stay away from DX Sabers. I can see so many others have been scammed as well. You reap what you sow…"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Wrong Ones",
          "Nb_Reviews": 1,
          "Date": "2022-10-13T22:40:59.000Z",
          "Titre": "Not worth anyones money",
          "Contenu": "Absolute garbage. No respect for their customers. Nothing was sent on time; to two weeks to receive a bulb with no electrical components and no coupling to connect the hilts. You've messed with cosplayers for far too long and it's time you finally get taken down."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Russ Sands",
          "Nb_Reviews": 2,
          "Date": "2022-08-08T00:50:39.000Z",
          "Titre": "Totally horrible experience",
          "Contenu": "Totally horrible experience! $300 for a Saber that showed up with pieces coming off of it and another loose. No instructions. When I finally got it working it was on for less than 5 minutes and I could smell plastic burning. Discovered the light was melting the blade. As soon as I sent photos and videos to customer service they ghosted me. Son BIG time disappointed since we bought it to have signed by Ewan McGregor next week in Boston. Total failure!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "toffloff Monkey",
          "Nb_Reviews": 1,
          "Date": "2022-08-04T18:41:33.000Z",
          "Titre": "Just don’t do it",
          "Contenu": "Just don’t do it. They will send generic emails when asked about orders saying “I am so sorry from the bottom of my hart” they will create a shipping label but will not ship anything. They will not offer a refund because they “used the money already “. Just do yourself a favor and buy from a different ccompany."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Preston Napoli",
          "Nb_Reviews": 1,
          "Date": "2022-07-19T00:11:06.000Z",
          "Titre": "Dishonest, Disrespectful, Poor Quality",
          "Contenu": "Please, PLEASE, read others’ reviews and experience with this company. I’ve never had a company take hundreds of dollars from me just to be completely rude and dishonest to a degree. It took nearly a year of begging to get my sabers or money, just to be blown off and disrespected constantly, if they respond at all. Once my sabers finally arrived, they were of such poor quality, I didn’t even bother sending it back to them for repairs. You deserve so much better with your money. There’s so many amazing people and companies in the saber community, this is not one."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jaime  Garcia",
          "Nb_Reviews": 2,
          "Date": "2023-11-21T23:30:49.000Z",
          "Titre": "A disturbance in the force",
          "Contenu": "My orders from May 2023 that  I fully paid over 300 for my sabers.Have been delayed but they keeping me in the loop which I truly appreciate. I will update when I receive them with pictures."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kindall Carter",
          "Nb_Reviews": 3,
          "Date": "2022-09-12T05:50:43.000Z",
          "Titre": "I recommend choosing a different company",
          "Contenu": "I ordered two sabers Nov. 2021 and have not received my purchase after ten months, all my emails would be met with reassurance that turned out to be direct lies, such as saying my sabers would ship within the week while not even having the product on hand, and Instagram messages were often met with verbal abuse. I have not contacted them in about four months and have received no updates, automated or otherwise, regarding my order. Meanwhile, I purchased a lightsaber from a different company and received it less than ten days after purchasing. I am not sure how they decide who gets their orders and who doesn't, but clearly they decided I would be left empty-handed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nicholas Williams",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T23:37:50.000Z",
          "Titre": "Horrible company",
          "Contenu": "By far one of the worst companies I've ever dealt with. Product Delivery was delayed with no updates, when I did talk to customer service they were rude. When I finally received the product the quality was not what was advertised. I would highly recommend avoiding this company and all of there products."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jesse Cebreros",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T05:04:22.000Z",
          "Titre": "NEVER AGAIN🚫DX SABERS",
          "Contenu": "Where do I begin ? This company is dishonest and now I learned why NO ONE in the saber community shops with this brand. To start off the neopixel builds are super cheap with really low quality batteries. I’ve had two sabers malfunction, it took over a year to upgrade/replace one, and the other didn’t make it back. I sent a neopixel blade and chassis in for repair and was told that my items were “lost” or “stolen”, and the owner basically played me on DMs and tried to get me to buy another saber. After my second purchase completely malfunctioning and waiting 2 months, I am back to give this 1 star review, and advise anyone to NOT shop with DX Sabers. The experience has been horrible, the owner is a liar. I would never do business with them again. Not a chance."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Erik Vleugel",
          "Nb_Reviews": 1,
          "Date": "2022-07-10T07:07:12.000Z",
          "Titre": "Terrible company",
          "Contenu": "Terrible company, do NOT order from them!I placed an order for one of their pre-made sabers over a year ago. I have yet to receive an order. Minimal communication, I had to reach out to them constantly for order updates. No tracking information, no offers for refund, nothing!They even had the gall to demand 75% of the purchase price back under 'restocking fees' when I asked for a refund! If you're in the market for a quality lightsaber, go elsewhere.Even worse, sending out a response on here attempting to make a customer out as the unreasonable party, outright falsifying information regarding conversations involving the order in question. No, you've never \"done right by me\" as a customer. I requested a refund for non-delivery of goods on an order you haven't filled in 14 months. You refused."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Duncan Griffin",
          "Nb_Reviews": 1,
          "Date": "2022-07-19T19:07:14.000Z",
          "Titre": "Deception and lies",
          "Contenu": "After a long delivery time our saber finally arrived late for Christmas 2021. The arrival was mainly due to my chasing and although it was promised to arrive pre-Christmas it finally arrived after the big day leaving my son without his main present. Upon receiving the saber all seemed fine, until it broke within 48hrs. After many emails we agreed to a refund after sending the saber back (at great expense) , the refund has not arrived as yet. After they said my refund had been issued (through a third party) they then had the cheek to ask if I would leave a 5 star rating on trust pilot. Here is My rating.Under no circumstances should you part with your hard earned money to this company. AVOID AT ALL COSTS!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cristian Jobe",
          "Nb_Reviews": 1,
          "Date": "2022-06-16T21:03:40.000Z",
          "Titre": "Horrible customer service across the board",
          "Contenu": "Not to mention the shipping time is horrible, which I can get by, but the customer service is horrific. I ordered 2 sabers, both broke down and stopped working out of nowhere. Sent them in for repairs in July 2021. It's now mid June 2022 and still haven't received them back. They told me they would arrive in May, it's now mid June. Haven't heard anything back despite multiple emails asking for updates. Do not buy from here. Sure, the prices are great and the quality of the sabers are actually pretty good, but the customer service experience I've received is the worst I've ever encountered with any company I've bought stuff from. STAY AWAY."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Gunner Walter",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T21:10:56.000Z",
          "Titre": "I cannot recommend DX Sabers",
          "Contenu": "I cannot recommend DX Sabers. I spent $400 a year ago and haven’t received my order. They keep pushing the date back every time I ask about when I can expect my order. Maybe I should have put in a dispute with my bank, but I didn’t because I trusted them. Now I regret that. Please be warned this could happen to you. Update: Today is 26-Oct-2023, they’ve replied, to this review, but they haven’t sent me any emails about where my sabers are."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dillon Klug",
          "Nb_Reviews": 1,
          "Date": "2022-12-24T16:07:39.000Z",
          "Titre": "Horrible customer service",
          "Contenu": "Horrible customer service. I’ve been waiting on my order for 2 years, they stopped responding to my emails. They’re trying to just bury me. I paid them 700$ for some sabers and have just been played. They won’t give me my money or my order. I’ve been patient until now. I would never recommend this company to anyone. Beware when buying from dxsabers. You may or may not get your order."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Rosalind Kipps-Meredith",
          "Nb_Reviews": 1,
          "Date": "2022-05-04T17:07:42.000Z",
          "Titre": "Do not buy from them",
          "Contenu": "I ordered my saber (order #859) over 6 months ago, while customer service are always polite they are over all completely unhelpful and I have still not received my saber and have been told they are not giving out refunds, only store credit, which for obvious reason I do not want. Do not buy from this company, they cannot be trusted."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Linda Simmons",
          "Nb_Reviews": 3,
          "Date": "2022-03-20T10:26:23.000Z",
          "Titre": "This is an update on my original bad…",
          "Contenu": "This is an update on my original bad review on Paul, the unethical scumbag owner who has no qualms in taking innocent people's hard earned money, including lots of young children's money & never sends anything. I ordered & paid in November 2020, but received nothing. Then come the many many excuses & lies upon lies that it was send & contact DHL, then when you get to the bottom of it, DHL advises it was never collected from scumbag Paul, then they spew more lies, then he says he will refund it, but never does. I am in the process of starting legal action against the most immoral person I have dealt with, on principal. He thinks he can keep scamming people & get away with it, very arrogant attitude, it will not end well for you Paul."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeanine Reilly",
          "Nb_Reviews": 1,
          "Date": "2022-11-03T07:35:06.000Z",
          "Titre": "Backing up our experience",
          "Contenu": "I'm posting a review to help others make better informed decisions before purchasing anything from this company. My husband has posted a review about our experience meeting and dealing with this company and everything there is 100% true and correct. We did not receive any proper and functional products from DXSabers and the experience overall feels like a scam 100%. Our only good experience from purchasing sabers for our entire family came from another company at this event that also helped us with our issues with DX products. The fact that they had to give us entirely different sabers that actually work properly and are assembled correctly shows that there are great companies out there that do care about us. DXSabers is not one of them and the owner is a liar and a thief that will not respond to emails. We support all of the reviews here that show them for what they are."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Fred Meyer",
          "Nb_Reviews": 1,
          "Date": "2022-06-16T22:33:18.000Z",
          "Titre": "Literal garbage",
          "Contenu": "Literal garbage. Ordered the Ahsoka sabers set and the install was so shoddy. After months of being told they will be shipped by end of the month and no sabers, I was so excited to finally get them. But they barely function. Incredibly disappointing. Do not do business with this company. Complete scam."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "caleb baker",
          "Nb_Reviews": 1,
          "Date": "2023-01-19T10:29:38.000Z",
          "Titre": "I would give it no stars if I could",
          "Contenu": "I would give it no stars if I could. I ordered the hatred of ren on January 19th 2021, still to this day I have not received the produced I purchased and ordered. I've had emails back and forth with their \"so called\" costumer service, literally every single email they sent me was another excuse why I haven't recieved my saber. My last email from them was on the 12th of December 2022 stating that it will be shipped that week and arrive before Christmas. Well I'm sure you know what happened. I wrote them another email and never heard nothing from them. I recommend saving your money and spending it with an actual reputable dealer. You will only lose your money to them if you purchase anything. Also what \"professional\" business runs out of a run down home in Pennsylvania, don't believe me, just Google map their location and see for yourself."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lyndsi Vaughan",
          "Nb_Reviews": 1,
          "Date": "2022-08-22T04:06:43.000Z",
          "Titre": "Extremely slow, meh quality, questionable practices",
          "Contenu": "My personal experience, they are extremely slow, you have to constantly email them to stay on top of your order. The quality of the hilts are not great. To clarify, the electronics are really cool but the hilts came with missing screws or screws that didn't fit causing the blades to be very lose. Even when I requested new/more screws, they also didn't fit and took months to even receive them along with the rest of my order that they seemingly ran out of to send.If you are someone who is very patient and willing to send an email every two weeks to get gaslit and false hope for when orders will be sent, then go for it. They make a lot of promises but either don't follow through or wait for you to give up. They seem to blame customers instead of changing their practice which feels very scammy. I personally will not be buying from them again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Saun",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T15:36:05.000Z",
          "Titre": "Absolutely the worst experience i have…",
          "Contenu": "Absolutely the worst experience i have ever had, im 100% sure this is a SCAM!! Just want my money back..SO YOU ARE SAYING THIS IS NOT AN AUTHENTIC REVIEW BUT I EMAILED YOU MULTIPLE TIMES WITH ZERO REPLIES. YES I DID GET SCAMMED. ALL IN WANT IS MY MONEY BACK.."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kevin Hoover",
          "Nb_Reviews": 2,
          "Date": "2023-06-15T04:29:15.000Z",
          "Titre": "4 Months and No Saber.  Not answering my emails now.",
          "Contenu": "I place an order with DXSabers on 2/21/23.  After 2 months, I get an email saying my order was disputed and they are not shipping the saber.  I didn't dispute the order and contacted my bank and there was not dispute.  They said it was there mistake and my order would ship within a week.  The next week came and no saber.  I contacted Brianne, customer support, and she sent me a USPS tracking number.  I checked the number and the saber wasn't picked up.  I kept checking it every few days and it was never picked up.  After a month, the number was deleted from the system.  I contacted Brianne once again and she was personally going to go to the post office and get to the bottom of the problem.  I was told I would have it by the end of May.  Tried the tracking number and it didn't exist on the USPS site.  Have been emailing DXSabers the last 2 weeks to get a refund or my saber and they are now not responding to me.  Not a great way to run your business."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hadley",
          "Nb_Reviews": 1,
          "Date": "2022-03-26T13:58:52.000Z",
          "Titre": "You’ll wait for eternity- and CONS STOP INVITING HIM",
          "Contenu": "I was one of the many this “company” scammed. Met them at a con and seemed awesome until my bank kicked back and contacted me with a fraud alert months later! Paul will make you wait… and wait…. And wait and- oh look you’re out the money!Also it shouldn’t be up to the consumer to contact them constantly asking for updates on their purchase. He claims email is “more professional” but it’s either never answered or really rip into you rude. Don’t order from here ever! They’re fraud, scammers and a mess! TO CON EVENT HOSTS- STOP INVITING THIS DUDE! HES NOT GOING TO BRING YALL PEOPLE BACK BECAUSE THEY’LL START TO WONDER ID YOU HOST SCAMS INSTEAD OF FUN!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Brent",
          "Nb_Reviews": 1,
          "Date": "2023-01-07T15:25:23.000Z",
          "Titre": "Don't get involved with DX Sabers!",
          "Contenu": "I placed an order for 2 sabers 6/19/2021 for 2 sabers that were listed as \"in stock\" and have been listed as such ever since. The order was for Halloween that year, but I still have not received anything to date, including a refund. As Halloween of 2021 neared, I got customer service involved in some slow email back-and-forth (several dozen - days between responses) and I was given various production excuses - but they were always supposed to be resolved and I'd receive my order soon. These sabers were supposed to be in-stock, don't forget. I eventually asked for a refund since I no longer  needed the sabers and was told I could only have store credit. They actually had the nerve to email me again 5/13/22 (6 months since my last communication with them, which was to request a refund and almost a year after placing the order) telling me my order will be ready now, if I could only send them more money to cover additional shipping costs they incurred. My original order was $500 USD with FREE shipping. I received nothing and no refund. Being from Canada, there is little recourse for me to continue pursuing the matter. I was defrauded.Don't get involved with DX Sabers!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "ruby",
          "Nb_Reviews": 1,
          "Date": "2022-12-08T16:16:55.000Z",
          "Titre": "DO NOT BUY FROM THIS COMPANY!!",
          "Contenu": "DO NOT BUY FROM THIS COMPANY!!! my boyfriend placed an order over a YEAR AGO and after being promised almost monthly that this order would ‘arrive soon’ they eventually cut contact. when i finally got into contact with them on instagram, they went on some rant about how their company had been scammed and they ‘couldn’t afford’ to refund us….. the owner then went on to try and guilt trip us by saying he couldn’t talk anymore because he was ‘babysitting his children’ and stopped responding to our messages. (so unprofessional!!!) we got an email a week later from his wife saying we would get a refund by the end of the month. it has now been over a month and a half later and we have been constantly ignored. I genuinely do not understand how these people have good reviews. I’m appalled at their customer service and the fact that they have scammed us out of nearly $300. really upsetting to see as i’m sure young/easy to scam people buy from here. DO NOT LET THEM DO THE SAME THING TO YOU. - dxsabers, if you are reading this, do the honest thing and give us our money back!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christina Thomas",
          "Nb_Reviews": 1,
          "Date": "2022-04-16T02:51:22.000Z",
          "Titre": "These people are criminals",
          "Contenu": "These people are criminals! They will send you a defective product on purpose to get you to send it back and then keep your money! It’s time for a class action lawsuit and  criminal charges!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Deeg",
          "Nb_Reviews": 1,
          "Date": "2022-08-02T01:42:47.000Z",
          "Titre": "It’s been almost  2 years since I’ve…",
          "Contenu": "It’s been almost  2 years since I’ve even heard from the company about my order. They just say “it will be there in a few weeks” I ordered it on January 23rd of 2021… it’s now august of 2022. I’ve been in contact over 20 times and it’s the same thing. Don’t buy it’s a scam. Still waiting on a refund or something but I am never getting that fs"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark Truitt",
          "Nb_Reviews": 1,
          "Date": "2022-04-22T19:33:56.443Z",
          "Titre": "Scammed and the lies continue...",
          "Contenu": "Ordered a $350 saber for my son in November 2020. 18 months later and have received nothing. I have dozens of emails with them filled with lie after lie about how they had to move their production back to the US and my saber will ship next week. They have even sent me two fake UPS tracking numbers. I asked for a refund and they just replied that they are broke and can't afford to refund money. They are the epitome of the term scammers. I have never written a review in my life but I took the time to write this one because they scammed my son out of the money he earned himself. Do not give these horrible liars your money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kim Gonzalez",
          "Nb_Reviews": 1,
          "Date": "2022-04-19T07:32:48.000Z",
          "Titre": "I purchased my Saver in 2021 for a…",
          "Contenu": "I purchased my Saver in 2021 for a birthday gift for my son. After 6 months of going back n forth they said they would send me accessories n what not, n after 12 months of going back n forth it was only promises. Never received my saver, and lost 350$ as it was too late to do a claim. Till this moment I haven’t received n we r in April 2022! DONT BUY, scam"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mata Reilly",
          "Nb_Reviews": 1,
          "Date": "2022-11-03T04:56:53.000Z",
          "Titre": "This company should not exist, period.",
          "Contenu": "I met the owner of this company at a recent event in Mesa Arizona and he presented as pleasant and caring. This turned out to be a scam very quickly. My wife, other family members, and myself purchased sabers at this convention and while some of us walked away extremely happy about our purchases my wife and I were not as lucky.My wife purchased a Leia saber and I purchased a much more expensive Dark Saber, both had extremely bad issues and should never have been up for sale in all of our opinions. The Leia was missing multiple screws, had stripped threads on multiple areas, and the emmiter was literally falling out. My Dark Saber stops working randomly, switches profiles randomly, and has sound issues galore. Both sabers are poorly machined, have very sharp edges, and overall feel cheap.The owner was apparently removed from the event, or left early to avoid selling underwhelming products, as he was not present the very next day and another saber vendor handled making sure that we were taken care of and gave us this owner's contact information. The owner has not replied to any of our emails and we will absolutely never deal with this company again.We were made aware of this site by fellow saber community members and wish that we had this information earlier. Overall terrible experience and there are definitely better, actual caring saber vendors out there that will take care of their customers honestly and properly."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeff Brandon",
          "Nb_Reviews": 1,
          "Date": "2022-12-26T23:38:28.000Z",
          "Titre": "Total scam",
          "Contenu": "Total scam, got a broke saber, paid to send back then got ghosted.   There  are a lot of reputable dealers just not this one…My son purchased a saber from this scammer, the product was broke when arrived and when he sent it back for repair he was ghosted.  DO NOT order from this source"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Geniesse family",
          "Nb_Reviews": 4,
          "Date": "2023-01-11T11:39:46.000Z",
          "Titre": "Decent to terrible",
          "Contenu": "Personally I have ordered from these guys in the past and have had some very good experiences and decent service so I decided to order from them again their newsletter said all orders would be shipped and delivered by Christmas time mine wasn't I contacted support and was told it's be delivered by the 1st of January and I'd receive shipping details within a day or two of the 26th December many days later now still no updates I messaged them again on the 31st December and here now on January 7th I've received no response or update on a 600 plus dollar order which is very concerning. I'm hoping that I actually receive this as it has been over a month since I placed the order and I have been guaranteed a delivery date twice. Update I have filed a fraud case with credit card company and gotten money back. I would not order from this company I believe they have scammed me. Bad place and horrible service. they even had the nerve to ask me to leave a good reviews as \"internet trolls\" people who have been scammed leave bad reviews. Just a pathetic experience this time around!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sith Lord",
          "Nb_Reviews": 1,
          "Date": "2022-07-25T14:36:19.000Z",
          "Titre": "If I can give DX Sabers a \"No Star…",
          "Contenu": "If I can give DX Sabers a \"No Star review I would. DX Sabers took me through HELL!! PayPal returned my money months later but trust the process was long and painful. You will be sorry if you do business with them. Try Seansolo Sabers on etsy. Much better experience. Don't walk run from DX Sabers!"
        },
        {
          "Note": 1,
          "Lieu": "TR",
          "Pseudo": "mnmmtl",
          "Nb_Reviews": 4,
          "Date": "2023-06-22T16:34:03.000Z",
          "Titre": "Never Again",
          "Contenu": "They said : Im preparing proffie core for you.They said : its gonna be a neopixel (Cuz i bought neopixel mystery box)Its been 2 months since i ordered.I recieved today from Turkey and its not worth it. Not worth to wait, not worth to money. Not proffie, not neopixel, not recommend it.."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kenneth Saunders",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T03:01:51.000Z",
          "Titre": "Ordered place for a saber on July 28",
          "Contenu": "Ordered place for a saber on July 28. It is Oct 16 and have yet to recieve the saber or any updates on order."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kathleen Wilson",
          "Nb_Reviews": 1,
          "Date": "2022-04-04T17:42:23.000Z",
          "Titre": "Waste of time and money. I never received what I paid for a year ago.",
          "Contenu": "I preordered a lightsaber duo in Feb 2021 for June release. I had to email in July about tracking information. Was given an excuse about factory issues and given a new delivery date of first week of august. I emailed in September and was told they’d ship out at the end of October. I emailed in November and was told they’d ship out in a few weeks. I emailed in January and was told they’d be delivered the next week. Well it’s April now and I never heard anything from anyone or received my order. It should never be on the customer to chase a business for looking for information on merchandise I’ve already paid for. Any shipping delays should always be communicated by the company in a timely manner. Don’t waste your money or time with DX sabers.Update from April 4, 2022: I requested a refund of my money and they told me they could only give me store credit because my money was already invested in making my product. Or I could accept paying a restocking fee of $159 AND a processing fee of $129. That is over half of what my original cost was for items I have never received. They also told me my items were shipped out Friday and I needed to wait 24 hours for tracking info to show up. While I doubt this is true, they should have emailed me the tracking info themselves if it is."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nic Uchiha",
          "Nb_Reviews": 1,
          "Date": "2022-06-09T22:18:24.000Z",
          "Titre": "Dxsaber is a scam",
          "Contenu": "DO NOT BUY FROM THESE PEOPLE THEY LIE AN STEAL FROM YOU IF YOU DONT BELIVE ME I HAVE EMAILS AS PROOF ALL THEY DO IS STALL AN LIE"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Tom Fair",
          "Nb_Reviews": 3,
          "Date": "2022-12-03T06:32:54.000Z",
          "Titre": "Two bad experiences with this company",
          "Contenu": "Two bad experiences with this company. Initially around two years ago I purchased two base lit sabers, that were meant to come with a bunch of extra things (kyber crystal and a few other things). It took months and months of being told \"they're shipping next week\" before they finally arrived. One didn't have the promised smooth swing, and the praetorian didn't have any holes drilled for the screws to secure the core, and the core was in pieces with a broken speaker. I found communication with them extremely difficult and ended up just accepting it was a bad purchase and left it at that.In February this year I noticed they had been really trying hard and apologising on social media, so I thought I'd give it another try. I ordered two proffie mystery boxes, and then waited 9 months for my product to arrive. Again getting the usual \"they'll be shipping next week!\"When they arrived, one was a baselit, again not even with smooth swing, and the second one was a broken neopixel, that very clearly wasnt a proffie, since it lacked a memory card. It took about a month to get a response, which basically boiled down to \"sorry, sent it back at your cost\".I believe in giving small businesses opportunities, and everyone deserves a second chance. Really wanted you guys to do amazingly the second time around, but it was just more of the same unfortunatly.Very long waiting times.Poor customer service.Orders were wildly incorrect, and products were not as advertised.Products were broken and poorly put together both times I placed orders.On the plus side they're a good price and the empty hilts I now have are quite good looking!Would recommend you avoid this company unless you're desperate."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kko",
          "Nb_Reviews": 1,
          "Date": "2022-03-04T21:46:26.000Z",
          "Titre": "This company is a fraud",
          "Contenu": "This company is a fraud! I ordered my son a $300 saber last March 2021. It never showed up. I’ve been given excuse after excuse and they refuse to refund my money. They told me I have to wait to receive the saber and then return for a minor refund. Total scam! Don’t be fooled by these people."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pumpkin Toast",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T13:51:46.000Z",
          "Titre": "Horrible Company - SCAMMERS  - READ UPDATE 12/10/2023",
          "Contenu": "Update - 12/10/2023As I mentioned - scammers. They have the nerve to lie on their response and I will not tolerate that. My package was NEVER mailed out. What they sent was a “pre transit” label to which was never updated and still not. Every few weeks I receive a promise of “your cores came in and they are in their way” no cores. No actual reply to my many emails asking them for an updated number and over 2 months later no cores. We have empty shells with no electronics to make it work. They keep promising with no delivery. 2 light sabers have no cores. I paid for it already with cash. Then they have the NERVE to send me email promising me it was mailed out and ASKING ME TO REMOVE my one star review. I will do no such thing because I still do not have the product which I was promised and PAID FOR OVER 2 MONTHS LATER! You want good reviews ? Do your job and do it well. Don’t make false promises and don’t you dare come in with a reply to very well deserved one star review and try to lie your face off. If I could give you a negative star I would at this moment. If you actually have it and shipping from the US it doesn’t take 2 months. I don’t care where your shipment comes from, you lied about that too. China. Not the US eh? Want it removed? Send my son his light saber cores for his 2 light sabers now and stop making false promises and flat out lying WITH A REAL apology and actual omission of why you keep lying. Until then believe nothing this company claims. They are great at ignoring people when they want. Original review on the bottom, I will NOT remove. Horrible company. Do not believe the “good reviews” they have been banned from numerous places / events due to their shady business practices. Take note of how they have their “excuses” in the replies for bad customer service. We met them at a Comic Con event on Sat Oct 14. They sold us 2 light sabers but did not have the electronics on hand. Swore and promised up and down how it would be mailed out on Tuesday and arrive the Friday. Promised my 14 year old child. Friday came and went. No tracking. No nothing. I entered my information into the owners phone because he didn’t have anything to provide me with a receipt. Either way, no replies. Days later a reply with some cock and bull story of how their shipment was delayed from China, etc etc. after numbers back and forth, mostly from myself checking in, still no parts. Sent me a “tracking number” 2 weeks later with no actual shipment attached. More BS. My poor son has an empty shell of a light saber. And yes, I have ALL THE EMAIL EXCHANGES BACK AND FORTH FOR PROOF. They are just shady salesmen who don’t deliver. Stay away, safe your money and buy elsewhere. They guys are a sham. Read the bad reviews and believe those."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kyle North",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T15:02:13.000Z",
          "Titre": "Shady company",
          "Contenu": "So this is a review I did not want to send but the unacceptably poor customer service from DX Sabers left me no choice as I will also send a report to the BBB. First the company odly sent me 2 reviews of my order before I ever even received it. During that time I reached out to Dx sabers a couple times to get no response in terms of just order status as why would I receive the review before the product. I never got a response from Dx sabers. Finally after a couple of months which I will say I did expect as I understand it’s a small company. However they did at the time state the response would be in 24 hours it was almost 2 months and no response. When the saber finally arrived, I ordered the Luke skywalker one, I opened it and it was clearly not as advertised, it looked entirely different than the picture. The picture was a chrome blade with an additional peice at the top, mine was a black steel color and no peice at the top. I also had issues getting it to work because the style they sent me was differnt again than the order and had no instructions on the website or the box. Also sent multiple e mails for help and again no response. It has now been 4 months sense I received the wrong product from Dx sabers and also when it arrived legitimately every peice was loose, was clear zero level of quality assurance went into this product. I have been emailing now for months and finally took a break , again giving the company the benefit of the doubt which they clearly have not deserved. So I decided after not looking into it for over a month I would logon and check the status of the now over 20 messages of communication I have sent. The website states an account does not exist for my email. I had to now reset up my account which I used in the first place because Dx sabers for some odd reason deleted the account. Now I still have the same gifted saber that was wrong and loose, no communication and my account t was deleted. Single handed the worst and most shady client experiance I have ever had. My advice is to order somewhere else, clearly this company is in over there head and there promise for customer service is just quite frankly a lie and should be removed from there website. I want my money back Order 2556"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "d.lastly",
          "Nb_Reviews": 1,
          "Date": "2022-06-18T14:23:45.000Z",
          "Titre": "Horrible customer service",
          "Contenu": "Horrible customer service. Arrives late, arrives defective, refuse to issue refund. Run from this company as fast as you can."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Wolf Helton HellWolves",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T11:53:09.000Z",
          "Titre": "Updating/Communication",
          "Contenu": "So Brianne email me immediately when I sent my complaint through. Ask thoroughly to give 5 stars for her service and I did. However. Tracking shipping states my saber arrived on the 24th. She I would be notify immediately when arrived. It's the 30th, and I understand weekend and memorial day holiday but I haven't been told DXSaber have received my saber or any updates. I've email Brianne a few times. Would love any feedback or estimate of how long this will be.Edited same day as posted. How can yall respond at 9am immediately after my first email and not at all now? Do not trust this company anymore, send my saber back to my address.So update. After I left bad service comments that's when they decided to make it a public post for all customer to stop spamming their email. Got on BBB and got the guys phone number and refused to speak to me on the matter. After that finally gotten a email back on how I should be ashamed of myself and how rude I was being. I will say I was passive aggressive due to the lack of communication and how they made it seem like I was the problem. Later they seen I have discovered the truth about the company and I learn of these \"hate groups\" when all they did was show facts on the matter of who DX Sabers really is. Last email was that I was scamming them, when I sent them my broken saber, and just so much nonsense. I did go on to each fb page and other communication to get there attention, and instead of asking me to stop they blocked me. They wanna play victim when they're creating victim of their company. Sorry if piled all together just really wanna get my point across. They don't care for your satisfaction.And they're reply is wrong. I wanna pay for shipping and never sent the link! I stated in my last email I was gonna pay. They never responded. I guess calling the local authorities for theft is my option if they don't send me this tracking info"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dxscam",
          "Nb_Reviews": 1,
          "Date": "2022-07-25T02:24:35.000Z",
          "Titre": "I order the scavenger lightsaber from…",
          "Contenu": "I order the scavenger lightsaber from DX sabers.   4 months later. Nothing e-mail then. His wife responds. I’ll get it in 2 weeks.   2 months later. Nothing again. Email them. Wife respond 2 weeks.  It now 9 months later. No lightsaber.  And they don’t return emails nothingThey are fraud.  They take the $$$$$$ and don’t give the saber.  Do not waste your time and get screwed outta your $$$ like I did."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Matthew Bull",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T05:17:31.000Z",
          "Titre": "So I order a saber it was supposed to…",
          "Contenu": "So I order a saber it was supposed to be Luke’s episode 6 lightsaber waited months for it just for it to be the wrong saber kept it since I waited so long didn’t want it wait longer then it just stops working gets in contact sends it back  beginning of may tells me I’m going to get it back soon around July ask for an update says I’ll get me saber mid august wait unit august doest show up ask about it again says September nothing then ask about it again after being confused for another customer saying I was refunded then situation clears up says we will resolve it next week that was a week ago I messaged them again about my saber and zero response hopefully this get their attention and I can get what I paided for don’t get me wrong this company make’s great sabers"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Aaron Lunger",
          "Nb_Reviews": 2,
          "Date": "2023-01-01T18:28:21.000Z",
          "Titre": "Go elsewhere or lose your money",
          "Contenu": "Final Edit 1/1/2023 : Luckily my credit card took my dispute and ruled in my favor, so I got most of my money back. I only disputed PART of my charges because I felt it only correct to dispute what I felt what I got was worth. Only decent humans would do that. That being said, I still would stay as far away from this company as possible. Poor business practices, and many promises made with none of them being kept. The only reason to buy from them, is if you don't mind losing your money.EDIT : Updating this review. After purchasing one via their website, getting the light saber that didn't match the pictures, was told the missing pieces would be shipped \"next week\" for over a month, was told the promos and other items would be shipped \"next week\" multiple times that it became a broken record. Realize that this guy is scamming people. He will get a few people sabers at a con, bug them to come here and write a positive review, and then ignore those that order online, or if he does deliver, it's a product that is much lower quality, may not match the pictures, and as someone who HAS taken them apart....a fire hazard inside due to poor electrical construction. I regret purchasing from him, and trusting his word over the many reviews and claims online. Claims those people are just haters, or 'have issues at home', or any one of many reasons to make him seem like he's being wronged.....Do yourself (and your wallet) a favor and believe what others say. Original Review Below :Met them at Thygeekdom con. Purchased both a neopixel saber and a mystery box on the spot. They had to actually go back to their shop, nearby, and he upgraded the hilt I wanted with a neopixel setup. That being said, the neopixel saber is fantastic. The smoothness of it, everything about it is fantastic. I love the effects, and everything about it. I'm concerned about durability, but this saber is more a prop for costumes than it is one for play.The mystery box I bought was a RGB lit saber, and while I did have some minor issues out of the box, it was easily remedied with some email support.While the email support wasn't immediate responses, I didn't have to wait longer than 48 hours for any response during the normal work week."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kelli",
          "Nb_Reviews": 1,
          "Date": "2022-10-12T07:34:30.000Z",
          "Titre": "Unprofessionalism At It's Finest",
          "Contenu": "I had originally purchased two lightsabers from DXSabers back in May 2022 on Mercari. I used them for a convention that I attended in July and discovered that one of the lightsabers ran out of power very quickly. After reaching out to the company on Instagram, I was told that the lightsabers have a \"lifetime warranty\" and that they would replace my lightsaber at no extra cost. At the time I was thinking to myself that this would be perfect, since I planned to attend New York Comic Con that following October and would need them in working condition for my cosplay.Fast forward to the rude email I received after reaching out to them about my exchange, and poor interactions I had with the company on Instagram. I sent my lightsaber back to them weeks before Comic Con, knowing that I needed to receive a new one back in time. Not only did they forget to package the entire lightsaber when sending it back to me, but the following package that they sent with the missing blade and attachment piece didn't arrive in time for the convention.The person who I was conversing with on Instagram frequently refused to respond to me, prompting my partner to have to reach out to them in order to get a reply. I find it entirely misogynistic and disrespectful for them to ignore me and that my partner had to go out of his way in order to maintain some kind of communication with them. I was never once rude to them in my conversations with them, and simply wanted a working lightsaber to use for my cosplay. Instead, I was promptly ignored and met with so much unprofessionalism that I didn't even have any motivation to attend Comic Con that day.I still have not received a reply from them after reaching out one more time and told them that I would write an honest review about my poor experience with their company. I will be taking my business elsewhere."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Erica P",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T04:01:56.000Z",
          "Titre": "Was not worth it",
          "Contenu": "Was not worth itMet these guys at a con. They seemed really cool and had some really awesome looking hilts, including the pair of specific character hilts I wanted. So, I decided to buy them through their online store the next chance I got. It ended up taking 7 months for me to receive my sabers. Customer service was very polite…once I finally got a hold of them. I had to reach out to them for any updates on my order. They were rarely (if at all) the first ones to give me any updates. Any update I would get just seemed like excuse after excuse. Even up to the shipping of the order. They sent me a tracking number and my order still didn’t ship for another month. Kept getting the “It will be sent out this week” or “So sorry for the delay. You should be treated like family and we are doing our best”. Or something along those lines. Got promises of free accessories AND a free saber for my patience. None of which came with my order. When I reached out about the lack of extra things that were promised. I got the same excuses of they’ll go out this week each week I asked about it. Finally did get some free accessories but never got that extra saber they promised, and they never acknowledged it again either. Now, I wish I could say the sabers were at least worth the cost, but I really can’t. Took them to a con for the first time and one was a constant struggle to work. Pretty sure both died before my friend’s sabers too, but then they miraculously were acting normal again without being charged. So not sure what’s going on there. Both kept falling apart, one was just pieces and the other was completely in half. Just not worth it when walking around a con all day."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scott Marble",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T00:59:32.000Z",
          "Titre": "Admins",
          "Contenu": "One need only do a search on Google, Reddit, and YouTube to see there are dozens upon dozens of people with similar experiences. Buyer Beware  Purchased a NeoPixel Dark Saber August 25th at Botcon from DX Sabers - Paid $424 via square.  Asked if they could ship it to me since I had other stuff to carry home.  They pleasantly agreed to do so.Aug 31st - No pressure, just asked what the usual time before it ships.  No response.Sept 6th.  - Contacted again.  Told I would get tracking 'Right away' Sept 7th - Asked what 'right away' meant.  Told I would get it 'later tonight'. Sept 8th - Contacted let them know I didn't get it.  No response.Sept 9th.  Contacted let them know I dididn't get it.  No response.  Stated I didn't want this to go down a negative route.  But at this point had already learned about their bad reputation.  Responded and said they were 'at another con' but would get it 'later tonight'.  Told them if they were unable I'd be fine with a refund.  Said they 'stand by their word' but it had just been a crazy couple weeks.Sept 10th.  Contacted as I hadn't heard back as they promised.  Another round of 'they were really tired but can guarantee he'd give me hourly updates(not sure why or how) given that he also stated his factory in china didn't open until the next day.Sept 11th.  Got a tracking number.Sept 15th.  Got a cheap hollow core round non-distinct saber.  Contacted them and they condescended and said 'you seem to forget we promised you a mystery saber with your purchase'.  I wasn't asking for the mystery saber to be sent.  I was asking for the Dark Saber I spent $424 on.  Told them I was disappointed because they never mentioned they were only sending out the cheap 'freebie' instead of what I actually ordered.  They defended saying they always answered me promptly when I had a concern.  Also said I'd receive tracking Monday on the Dark Saber.Sept 19th - Tuesday and no tracking.  Contacted.  No response.Sept 20th - Wednesday and no tracking.  Contacted.  No response.Sept 21st - Emailed and said their sons wer sick but that I'd have tracking in 24 hrs.Sept 23rd - No tracking after 48 hours.  Contacted.  No response.Sept 24th - Fed up I emailed and said I didn't know what to do here other than to pursue means to get my money back and warn others.  Told them if I didn't have tracking by Monday night I'd send the 'freebie' back to them on my dime and expect a refund.  They responded talking about the kids being sick again.  Hey I get it, I had 6 kids.  But I also am asking for nothing more than that they tell me when its going to ship and actually do so.  They give me a tracking number that doesn't show dropped off.Sept 26th - I email fed up because it doesn't show dropped off.  I stick to what I said on the 24th and I put the freebie in the mail and send them proof I dropped it off via USPS tracking.  I get a frenzied response pack and was told they were mistaken it actually sent through UPS and was given yet another tracking number.  I track it and that show that the destination is a completely other state and shows at .4 lbs.  When the Neopixel is over 2lbs just for the hilt alone.  Then I was told no, that's wrong it actually went USPS.  And to check.  It finally showed dropped off.Sept 28th - Finally get it in the mail.   It comes without a box for either the hilt or the blade.  Both were loose in a previously used and shipped plain brown box.  The hilt and blade were scared/marred.  No charging cable.  Tried using a charging cable I have and it wouldnt' charge.  Either it busted because it was shipped completely loose or they shipped me a saber already used and broken.I have all emails and text messages and pictures.  I waited over a year for my Moducase no problem.  Why?  Because they were forthright on what to expect.  Hell, we wait all the time for preorders as collectors.  But this was never about waiting.  This was about people who continually told me one thing and did another...or rather didn't.  At this point I just want others to know not to trust this company or anything they say or do"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Scott Beauchamp",
          "Nb_Reviews": 2,
          "Date": "2022-08-03T18:34:40.000Z",
          "Titre": "Take it from a former customer-",
          "Contenu": "I ordered a saber from Paul a couple years ago. It finally arrived 5 months later after many emails and DM’s. I was told shipping was free but had to pay $75 when I went to pick it up. At the time Paul was claiming they built all their sabers themselves even tho mine clearly had ‘89 Sabers’ written on it and the images he used on the DX site were lifted straight off the Alibaba site. He then told me that since they were ‘making’ a new model mine was a one of a kind, a laughable, outright lie. When I received my near 600$ saber the speaker was blown, the blade didn’t fit and the battery include was generic and dangerous. After approximately 3 months the saber quit working all together. In the past few weeks this site has been inundated with positive reviews, many of them double and even triple reviews from some people. This is typical as Paul offers discounts and free merchandise to people who leave positive reviews. If you read carefully you’ll notice some reviews mention only customer service (user hasn’t received defective product yet) or intent to buy (user hasn’t even purchased yet). Please do your research before purchasing from DX, there are many respectable saber builders to choose from.Edit after Paul’s reply:I purchased my saber 2 years ago, not 3. Paul’s first lie in his response to this review.I received no offers for DX to replace or any other offer in reference to my issues. Why wouldn’t I accept a refund if it had been offered? Paul’s second lie.I have not harassed any customers of DX. In fact I have screen caps of Paul asking me harass other individuals (or ‘put them on blast’ in his words) while I was feigning support for DX to try and expedite shipment of my saber. Paul’s third lie.  I have never mentioned Paul’s wife in any post. All business decisions are Paul’s and Paul’s alone and he is ultimately responsible for the actions of the company. Paul’s fourth lie.The only social media where I have talked about DX is on the Facebook page ‘DX Sabers Exposed’ where the multitude of dissatisfied customers gather to discuss the abhorrent business practices of DX Sabers amongst ourselves and seek professionals to help repair the substandard products we received. I have not said anything online about DX besides on the that page -with the exception of this honest review- certainly not on ‘every social media platform’ as I only have a Facebook and Instagram.  This Paul’s fifth lie.LGT is the one that severed ties with DX after blowback from customers. A statement from LGT can be found on their site. Paul’s sixth lie.Referring to a negative review as ‘spite’ and attacking reviewers is straight out of the DX disinformation playbook. This post is not spite, this is to assist others before their purchase. You’ll notice similar responses from him on all reviews from other dissatisfied customers. Paul’s seventh lie. Seven lies from DX in one online reply. Typical. As for DX not soliciting reviews with incentives, scroll down and you’ll see bulk positive reviews across single days, June 11th for example. Coincidence? Yeah, I didn’t think so either.UPDATE: Paul continues to make outrageous claims such as he has been threatened with death or rape (!) or kidnapping. Any rational person can see through these wild claims, the man is a delusional criminal who has caused serious damage to the saber community. I encourage anyone who is considering a purchase to visit DX SABERS EXPOSED on face book or visit the Saber Souce website entry on this company. Please, shop elsewhere!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ryan Loumis",
          "Nb_Reviews": 1,
          "Date": "2022-03-29T15:19:02.000Z",
          "Titre": "I wish I could give a zero stars",
          "Contenu": "I wish I could give a zero stars. We are over a year on our light saber order and still nothing. Please don’t waste your money here"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Graham Brandon",
          "Nb_Reviews": 1,
          "Date": "2022-08-27T02:11:17.000Z",
          "Titre": "TOTAL SCAM",
          "Contenu": "TOTAL SCAM.  Sent me a broke saber, I paid to send back for repair then got ghosted.  Go to a reputable source!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2022-04-13T01:01:22.000Z",
          "Titre": "Trash",
          "Contenu": "Trash! You order and they just keep telling you it's coming. Don't waste your money on these scammers"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nick",
          "Nb_Reviews": 1,
          "Date": "2022-08-05T22:52:51.000Z",
          "Titre": "This company is a scam",
          "Contenu": "This company is a scam. I haven't received the product and it's been a year since I ordered it. They will give you lie after lie. Don't order from them"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "D. Goodlin",
          "Nb_Reviews": 1,
          "Date": "2022-07-26T16:27:39.000Z",
          "Titre": "One star is too many",
          "Contenu": "UPDATE: Paul, I did in fact order from your company. I have communicated with you multiple times over email, Facebook, and Instagram in the past 9 months. Please refrain from gaslighting your customers. As someone who preaches \"be kind to others\", maybe you should take your own advice. You are correct many companies have a 30-day return policy, and usually, those 30 days start when the item is received. Not ordered. It took over 5 months for you to ship me my hilt. You would not take the return when it arrived broken. How can you have a return policy that is up before you even send the product out?!As for your claim about shipping labels, yes you are correct that you pay for the label when it is created. However, you all you need to do is go into your UPS dashboard and click \"void shipment\" and UPS will refund your money. I know this because I also have a UPS account. You can create HUNDREDS of tracking numbers, then void them, and get your money back. Your claim that none of your customers have had to file claims with their bank is also false, because I had to do just that. Additionally, there are other firsthand accounts of having to do just that from many other who you have scammed. All people need to do is look up DX Sabers on Facebook or YouTube and they will find a great many useful reviews of your business practices.  In summary, I have indeed ordered from your company, and I have been scammed by you, just like countless others. I am stuck with a nonworking saber that you have refused to help fix or refund me for. I had to go through the arduous process of claiming fraud with my bank. Once I provided them with screenshots of our communications, my claim was processed, and I finally got my money back. You have blocked me on all your social media and my emails have now gone unanswered for a month, so I assume you blocked me there as well. If you truly want to become a better company, you will start being honest with your customers. You are STILL reselling LGT hilts, despite your claim to the contrary. (At least as of 4 months ago when I received my \"Hatred of Ren\" with a Proffie board clearly labeled \"Darkwolf & LGT Saber Studios\" on it, and a battery that is labeled \"Saber Studio\")PLEASE DO NOT ORDER FROM THIS COMPANY!!ORIGINAL REVIEW:One star is too many! Paul and DX are known scammers in the industry. You need to look no further for proof than one of the most recent reviews where the review was written by Paul himself!! He makes fake accounts and gives himself glowing reviews to con unsuspecting and naive people into giving him money. If you order from DX, you will be lucky to receive your saber at all. Paul's predatory \"refund\" policy states that you can only request a refund within 30 days of ordering. Yet the shipping estimate on his website is at least 6 weeks. He will string you along by sending you fake tracking numbers, or even going so far as to print a real shipping label, but never actually drop the package off. By the time you realize that you have been conned, it is far beyond the 30 days that you ordered and now you have to file a fraud claim with your credit card company. Bottom line is DO NOT, EVER, UNDER ANY CIRCUMSTANCES, ORDER FROM THIS COMPANY."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joshua Lewis",
          "Nb_Reviews": 2,
          "Date": "2023-05-23T09:10:27.000Z",
          "Titre": "Paul sends out dangerous products",
          "Contenu": "Paul doesn't keep his shipping times and when you approach him about what's going on with the shipment he will give you attitude and get defensive and tell you to be patient without doing anything. Then when you're saber arrives it's a broken mess and you confront him with that. He says you broke it even though you just took it out of the box and it had no packaging or any type of securement. Everything was just strewn about the bottom was literally broken off in the speaker was hanging out. Terrible experience for a $300 mystery box. Currently in dispute with my bank because I can't send it back in the mail because it melted when I tried to turn it on because he crosswired it.EDIT AFTER PAULS REPLYPaul everything you said in that reply is a lie I have video evidence of the box coming out of the post office in the one single box at the saber comes in unless you're saying eye doctored government footage as well. I only got nervous and started asking questions when the package didn't show up when you said it would and then you got very defensive and stopped responding. You never asked for any video evidence of anything. As soon as I told you that I got the saber and it starts smoking when I turned it on. You immediately accuse me of breaking it and said I did it on purpose. I made an unboxing video and showed no foam or anything. You literally don't understand that when you do this Paul that some people actually have evidence against you. So when you make these allegations that everything's faults, you should probably make sure that these people don't have proof of doing what you are doing. I haven't even gotten the refund from my bank as it takes time to do the investigation so that's false as well. You're just refusing to refund because this is how you do business. You send out busted savers to people and then they return them to you to get fixed and then they never get them back. There's a reason why there's literally hundreds of these types of reviews on your site and all over the internet because you are a dishonest business personNobody and I repeat nobody talk to me about going to buy one of their savers. I did my research after you ripped me off and found a reputable company and guess what? I got my saber in the condition that it should have been in from you.The fact that you have to sit here and write short story reviews to these. Only kind of tells people that you are lying. I'm really truly disgusted by your behavior. Paul, especially when you try to use my veteran status to try to push your company. I know that was your plan because you were very adamant about me making a video and sharing it to you unboxing it. I know how you do business you drop ship so you don't order the saber until someone actually buys it and then you order it from another company. And the reason why my package didn't show up on time is because your dropship package from China didn't show up on time and so when I started the refund you just threw in some junk saber and threw it in a box so you could try to check that and cover yourself with my bank because you hadn't sent out my product because usually you like to wait for people to wait months until it's outside the chargeback. But I being a combat veteran and a purple heart holder have way way more sense than most and I don't let people off the chain with that kind of money. Paul says I broke the saber yet when I took it out of the box and I literally put the saber blade into it and turned it on. It starts smoking. I opened it up and looked at the core and the thing was just hotwired literally broken. The speaker was hanging out the bottom out of the box. No foam in it. Like I said everything Paul said in his reply to my comment was a lie. This is how this guy does business and it's pretty sad especially trying to use my disability as a veteran to try to say that's why I canceled my order which is total bsOh brandondale didn't tell me to do anything. He was just the guy that offered to try to make things right for me after you sent me something that literally caught fire trying to blame him for trying to do something right saying he orchestrated it. It's just a lie and honestly pretty pathetic of you. Paul. Take some responsibility for your actions.Also, Paul, I have all the copies of our email correspondence and you stopped responding to me when I told you that it came and damaged and it melted when I tried to turn it on and smoked and then you immediately accuse me of breaking it and cut off all communication with me. So don't try to say that I stopped replying to your emails when you offered to help because the help never was offered. And again I have all our email correspondence. I don't know why you think you can get away with all these faults things when people have evidence proving everything they say is 100% right DISGUSTING AVOID THIS COMPANY especially if you don't want a product that catches fire."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William Hanakahi",
          "Nb_Reviews": 2,
          "Date": "2022-12-05T06:04:00.000Z",
          "Titre": "Takes advantage of special needs",
          "Contenu": "Started over a conversation than him pushing the issue he wanted to contribute to my special needs son shows me a saber on video than sends us something entirely different not only that it was damaged and he admitted this long story short the experience was horrible my son received something very dangerous to hold and play with the electrical issues it had could had grounded out and exploded the lithium battery and that is the so called donation saber my saber I purchased came 3 months later and was the wrong core obviously to use on another saber which he sells to and caters to influencers he later threatened to legally have the saber returned to him I have filled compliants and legal proceedings because of this"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Megan Sharkey",
          "Nb_Reviews": 2,
          "Date": "2022-01-15T22:47:16.000Z",
          "Titre": "Do NOT buy from this company!",
          "Contenu": "Do NOT buy from this company! They are scammers! I accidentally ordered a empty Leia hilt from them and was told to ship it back to them so they can install a neo-pixel core inside and that was back in Feb 2021 and I have heard barely anything back about my hilt since.I have now learned so many people have been scammed from DX Sabers and it is completely ridiculous! There are way better lightsaber companies out there to order from."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Zachary Graham",
          "Nb_Reviews": 1,
          "Date": "2022-01-26T02:01:45.000Z",
          "Titre": "Waited 2 years and nothing",
          "Contenu": "I have waited for my saber for almost two years now and every time I email customer service they keep pushing it back another week another week oh it’ll be at the end of the month I it’ll be here next month it’ll be here next week oh next week for two years now I’ve asked for a refund multiple times had them say yeah we will give you your refund but you have to send your saber back I never got it so I never got my refund and I’m still trying to get my refund"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lania",
          "Nb_Reviews": 2,
          "Date": "2022-01-24T01:43:22.000Z",
          "Titre": "They deleted their Google reviews cause…",
          "Contenu": "They deleted their Google reviews cause of all the negative comments they received. This is A HIGE SCAM the positive review are the lucky few that actually got something from them but I promise you there is so many more out there that have been silence by these frauds. DO NOT TRUST THEM!!! STAY VERY FAR AWAY!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Furious",
          "Nb_Reviews": 1,
          "Date": "2022-01-05T03:46:54.000Z",
          "Titre": "STAY AWAY",
          "Contenu": "Absolutely terrible and I mean TERRIBLE experience. I spent about $500 a year ago for a saber I still have not received. The customer service will answer your emails and promise it’s coming in the next 2-4 weeks and it never does. No tracking, no updates unless you reach out. Do yourself a favor and do not order from here."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dave Taylor",
          "Nb_Reviews": 1,
          "Date": "2021-11-12T14:05:55.000Z",
          "Titre": "Theft and Fraud are the only things…",
          "Contenu": "Theft and Fraud are the only things you'll get from DXSabers. I was strung along for 9 months and have no Saber and no refund. This was to be a VERY special birthday gift for my son. I have had numerous emails back amd forth culminating in an authentic-looking notification about the order being refunded. It never showed up. The people at DXSabers are terrible people."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Raymond Jinzo",
          "Nb_Reviews": 1,
          "Date": "2021-11-09T10:23:57.000Z",
          "Titre": "I bought a lightsaber 7 months ago",
          "Contenu": "I bought a lightsaber 7 months ago, they won't refund me my money, they keep telling me in a month in 2 weeks over and over again and now they tell me after their wedding they will refund me, that life is not fair, I have to wait, like what the f*)$#, pay people back your wedding can wait they can't treat people this way and steal their money! They owe me close to 600 bucks they need to pay us people back! I have emails to prove all of this!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cody Kollinger",
          "Nb_Reviews": 1,
          "Date": "2021-10-01T21:20:14.000Z",
          "Titre": "DO NOT BUY FROM THIS COMPANY",
          "Contenu": "Ordered a saber back in March, and it was continuously pushed back. After posting a negative review on Google (which now they removed all company info and reviews), they claimed it was sent and that I should get a tracking email for it. Never received it, and now they are ignoring all my emails when I ask for a refund. I have sent 6 in the past week and not a single one has gotten a response. DO NOT BUY FROM THIS COMPANY."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "de cee",
          "Nb_Reviews": 15,
          "Date": "2022-01-06T18:54:10.000Z",
          "Titre": "Dxsabers worst",
          "Contenu": "As soon as I got a replacement for the piece of junk that I was sent then I will change my review but you have not done anything you have promised. Don't ever order from DX savers you will get a broken piece of junk do your homework and read the reviews all over the Internet especially on YouTube."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "owen davies",
          "Nb_Reviews": 1,
          "Date": "2021-11-03T23:11:03.000Z",
          "Titre": "This company is a total scam",
          "Contenu": "This company is a total scam. I paid in full last November 2020. I’m still waiting. Now they are saying that it was delivered.. The gift was for a relative diagnosed with cancer. Don’t waste your money. The lies the waste of time the promises. They should be ashamed of themselves. I trusted them and thought they were an honest company."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Sebnem",
          "Nb_Reviews": 2,
          "Date": "2021-08-26T09:32:34.000Z",
          "Titre": "I wasn’t even give them a star as my…",
          "Contenu": "I wasn’t even give them a star as my son is scammed,bought one and it wasn’t working plus it did arrive 3 months after the ordering.They just made him wait and told him that he was going o have goody box.Nothing turned up and unfortunately £200 odd went to bin.Shame on them well bad very bad experience we had so we ll go to report them bank way as it called :SCAM"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Thomas",
          "Nb_Reviews": 3,
          "Date": "2021-08-16T13:16:25.000Z",
          "Titre": "Crappiest company ever",
          "Contenu": "Crappiest company everIn December I had ordered the dark rey sword. Until today nothing has been delivered. Every month I was promised until the end of the month the sword would be there. After I demanded my money back, the communication has ceased. They do not answer me on any channel, neither via mail, Facebook or Instagram.I can only advise anyone not to order anything there. I will probably never see my 600 euros again. Sh**t store"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "AnonymousRider",
          "Nb_Reviews": 1,
          "Date": "2021-07-14T20:40:42.000Z",
          "Titre": "Previous LGT saber vendor is a scammer",
          "Contenu": "This guy is a scam artist. He was a vendor for LGT Saber Studios. LGT cut ties with him after they received numerous complaints and LGT even posted it publicly online for everyone to see. You're not fooling anyone. You've been exposed. To top it off, Sophie's Sabers foundation that he had on his page was fake. BTW, it's a crime to make a fake foundation, bud. Do NOT buy from this guy."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Alireza jannessaran",
          "Nb_Reviews": 5,
          "Date": "2021-06-13T03:21:52.000Z",
          "Titre": "Dxsabers",
          "Contenu": "Hi Everyone, best don't waste your time with Dxsabers, it is definitely scam, I have ordered about 3 month ago and I have not received anything, only promises they cant keep. I will be asking my bank to return my money and I am sure the positive reviews done by themselves. Before you order search, I have proof of order , don't order anything from these guys they are good scammers."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jim Asbury",
          "Nb_Reviews": 2,
          "Date": "2021-08-09T20:37:31.000Z",
          "Titre": "Ordered on 5/5/21- advised 4-6 weeks.",
          "Contenu": "Ordered on 5/5/21- advised 4-6 weeks.Repeated inquiries, with prompt replies.However, all promises made have not been kept.Requested refund, and told to wait until I get the product, and then return it.This date, 8/9/21, have not received.Turned over to credit card company for resolution.Suggest shipping elsewhere.Jim Asbury"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Dahlia Jourdain",
          "Nb_Reviews": 1,
          "Date": "2022-01-28T07:23:57.000Z",
          "Titre": "They WILL take your money and WASTE your time!!!",
          "Contenu": "I would give less than one star if i could, my order was placed on September 24th, 2021. Ive contacted the customer service multiple times asking about updates on shipping or anything. Ive been told that I would receive shipping info the next week, a week rolls by and nothing, they have refused to give me a refund stating that the money I’ve given them is used to manufacture the lightsaber and that because they are made to order the money has been used for that purpose. Yet here i am 6 months later, I don’t have my money or the lightsaber they say it was used to build. WTH?!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Peter Lanoue",
          "Nb_Reviews": 1,
          "Date": "2021-04-27T11:43:34.000Z",
          "Titre": "Trust the bad reviews.  Total scam!!!",
          "Contenu": "Just like everyone else says, do not buy from them period.  Been waiting on our Saber since 4 February.  I reached out to Nicole and she explained how backordered they are.  I then asked for a refund and she said she had to ask her boss.  I have sent numerous emails after that with no response.  How pathetic of a company to ghost people and steal their money.  Please, do not trust them.  We had to cancel with our bank."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "M R S",
          "Nb_Reviews": 1,
          "Date": "2021-04-22T15:50:48.000Z",
          "Titre": "4 months later, still no response or the item I ordered!",
          "Contenu": "I ordered an item in late December 2020. 4 months later, I still don't have the item I ordered. I have been ghosted by them, blocked on social media, and they won't return any of my emails. I have made my point with real details. Good luck DXSaberZ. Hope you decide to keep this account on Trust Pilot and not delete it. #exposedIf it walks like a duck, and sounds like a duck, it's probably a duck."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "jack boz",
          "Nb_Reviews": 2,
          "Date": "2021-04-29T21:13:59.000Z",
          "Titre": "I wrote a review of my experience a few…",
          "Contenu": "I wrote a review of my experience a few days ago and how I haven’t received my saber in 2 months from these guys and then they blocked me on everything … ordered a new one from crimson dawn and it shipped the next day!! If everyone on the internet is saying it’s a scam it probably is. Just order from a reputable company like crimson dawn or Vader’s vault!! I’ll let you all know if I ever get my saber from DX but I doubt it will ever come."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "jack boz",
          "Nb_Reviews": 2,
          "Date": "2021-04-26T01:33:27.000Z",
          "Titre": "DO NOT ORDER FROM DXSABERZ!!!!!",
          "Contenu": "I ordered a Neopixel from them on March 12th 2021. I was guaranteed delivery in 2-6 weeks and I have not even received any updates. these guys are clearly scammers and at the very least just buy sabers and sell them back to customers. Over Dms on Insta DX said Id get it in month but screw that im cancelling through my bank and ordering from Artsabers instead."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Redfox Drummer",
          "Nb_Reviews": 1,
          "Date": "2021-05-03T17:24:37.000Z",
          "Titre": "Check out DX Sabers Exposed on FB for…",
          "Contenu": "Check out DX Sabers Exposed on FB for many testimonials and proof that the majority of DX Sabers business is in lies, scams, and deceit. DX even got dropped by their supplier due to terrible business practices. They bribe for good reviews here by requiring these \"good\" reviews in order to be entered into their \"giveaways\". Bribing for reviews is against Trustpilots TOS."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jotile Jotilecom",
          "Nb_Reviews": 1,
          "Date": "2021-02-28T01:21:10.000Z",
          "Titre": "As other people are saying,DX Sabers is…",
          "Contenu": "As other people are saying,DX Sabers is truly a scam!!!I have been trying email,phone,and messenger with no real response.The only messenger conversation with Paul,he got offended when I called his company a scam and promised to make contact during business hours,but still nothing.Have not received the order,refund,only an order confirmation.Don't place an order,as you will be losing your money!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris Godin",
          "Nb_Reviews": 3,
          "Date": "2021-05-03T19:24:26.000Z",
          "Titre": "So far this has not been a good…",
          "Contenu": "So far this has not been a good experience. Ordered through this company in November of last year. I've sent numerous emails from my yahoo account as well as my Gmail. I even sent up an instragram acct so I could try to talk to them that way.I just want the product if they can't fulfill it ill gladly take a refund and go from there.I understand the challenges that companies have faced during covid.But I feel I have been more than patient with them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bri Powers",
          "Nb_Reviews": 1,
          "Date": "2021-03-27T16:26:27.000Z",
          "Titre": "I got scammed $300",
          "Contenu": "I got scammed $300 for Ahsoka Lightsabers that will never ship. It’s been five months and everything this company has said is a lie. I’ve been waiting for a tracking email, and still haven’t gotten one. Not only that but when you email their customer service, it’s an automated reply 99% of the time. DO NOT BUY FROM THEM! DO SOME RESEARCH! honestly wish i never bought from here, but thankfully learned my lesson and taking my money elsewhere."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stephanie Perez",
          "Nb_Reviews": 1,
          "Date": "2021-05-06T16:11:00.000Z",
          "Titre": "SCAM",
          "Contenu": "I purchased a saber originally in early november with a guarentee of arrival by christmas. It came in mid to late january. It came broken and with no charger.... For the past 6 months ive been trying to reach out to them in order to have the item and then they blocked me.... they literally suck and I will take them to court over this."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Marcus Fronkey Pollard",
          "Nb_Reviews": 4,
          "Date": "2021-03-04T22:12:55.000Z",
          "Titre": "Awful customer service and a bad product",
          "Contenu": "Got my son one of these for Christmas after 1 month it has stopped charging. He's not even used it as we have been in lockdown. Contacted them on fb no response. Contacted them on email nothing. If you think you are getting a quality item for the money you're not. If you think they will care about you they don't even though the website says they do. Just avoid and go to a reputable company it will stop your kids being dissapointed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "cole shefts",
          "Nb_Reviews": 1,
          "Date": "2021-06-08T16:19:56.000Z",
          "Titre": "i wish i could give this negative stars…",
          "Contenu": "i wish i could give this negative stars i ordered 6 months ago and no word on my order. i emailed the company 6 times throughout this period and no response at all, i go on the guys instagram page and he’s got tons of inventory so why aren’t these people getting their sabers? i put in a claim with my bank to get a refund cuz my emails weren’t being answered. i repeat don’t order from this company they will give you the excuses that their suppliers were scam or they just switched servers."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Addison",
          "Nb_Reviews": 1,
          "Date": "2021-06-18T02:34:09.000Z",
          "Titre": "It really was a scam. if its not, then they screwed me over.",
          "Contenu": "I paid over 600 for an order. I messaged them a week before it was supposed to have arrived since I still have not gotten any shipping info. I then tried to reach out to them, but no response. Then they had time to delete my comments reaching out to them, but not to respond to me. It is a scam, use other known stores that are not scams.Its a week after me trying to reach out and its still not here, no response and I am going to try to get my money back. This business has so much potential."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Operations Manager",
          "Nb_Reviews": 2,
          "Date": "2021-09-07T17:36:40.000Z",
          "Titre": "Untrustworthy seller DO NOT BUY.",
          "Contenu": "Untrustworthy seller. Lies about stock (extended wait times and continuously lies) and where the items are manufactured. They are Asian products, but he claims USA made. Overpriced for the merchandise. You can purchase from over a hundred other RESELLERS for a fraction of what they up charge."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Milan Ettema",
          "Nb_Reviews": 1,
          "Date": "2021-03-01T10:44:34.000Z",
          "Titre": "Scammed",
          "Contenu": "DxSaber seems very cool,I thought in the first place as well, but its a big scam. When I was going to investigate if I would buy my saber here there were a lot of red flags, but I still decided to buy from them. Turned out to be a big mistake, no saber received and no responce on any emails I send to them. DON'T BUY YOUR SABER HERE!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jenny W.",
          "Nb_Reviews": 1,
          "Date": "2021-05-01T07:41:49.000Z",
          "Titre": "Where to begin",
          "Contenu": "Where to begin? After dropping upwards of $400 on a saber via Etsy, I found Paul's store closed weeks later - with no way to contact through official channels to request a refund. Anytime I have reached out via social media (Instagram and Twitter), I have been blocked. Emails have never been answered, past the first two or three \"it will ship this week!\". Paul will claim that the saber community is after him, but in reality, his poor business practices have done this to his brand."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Christian Beal",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T20:22:30.000Z",
          "Titre": "Possible faulty tech or something wrong with it",
          "Contenu": "At first all was okay the saber was working fine but suddenly it got stuck on one color no sound and won’t turn off no matter what I tried not sure what happened it’s like it quit on me I’ve had issues in the past with these sabers not sure what to do"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Julie Manders",
          "Nb_Reviews": 1,
          "Date": "2022-10-12T01:33:55.000Z",
          "Titre": "Good CS, poor construction",
          "Contenu": "Responsive customer service, wide selection of sabers, and that's about it.Sent me a poorly constructed saber - constantly loose screws, poorly aligned, and a somewhat splotchy paint job.  Was informed that wasn't enough of a reason for refund but I was welcome to choose another product of equal or lesser value, or be sent a replacement.  Why would I want another item from them when they've already demonstrated their lower quality?They didn't even offer to send a return mailing slip and had to mail the saber back on my own dime.  Two hundred bucks down the drain.  I'd recommend going with a different company before DX."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ryder Bezner",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T16:13:00.000Z",
          "Titre": "Make ur delivery faster",
          "Contenu": "Make ur delivery faster. I ordered mine two weeks ago and estimated time said only 5 business days"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Quandale Dingle",
          "Nb_Reviews": 1,
          "Date": "2022-07-18T01:08:48.000Z",
          "Titre": "DO NOT ORDER FROM HERE",
          "Contenu": "I placed my orders In early 2020. One I’m February one in March. I received the one from March over a year later in may and the one from February I still have yet to receive. The saber I did receive the battery shorted out only 2 weeks after receiving. I ended up replacing my inside chassis with a golden harvest v3 from dark wolf sabers. Do not waste your money or time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Amy Gillespie",
          "Nb_Reviews": 1,
          "Date": "2022-01-22T21:16:01.000Z",
          "Titre": "Terrible.  Do not trust.",
          "Contenu": "Terrible.   Ordered on 11/20 and it took almost 2 months to receive.  After being told it would arrive by Christmas.  Contacted to update my address because we had moved since ordering.  Saber was still delivered to old address.  Was delivered in original packaging, taped to death.  Perfect way to get a package stolen.  Arrives, unwrapped with zero instruction.   Says it's baselit when I ordered a neopixel.    The way their digital receipts are organized, you can't don't get a complete description.  Shady business."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JP Kurisky",
          "Nb_Reviews": 1,
          "Date": "2021-09-01T15:50:08.000Z",
          "Titre": "A purchase to never make again",
          "Contenu": "I had to wait 5-6 months for my saber to even ship. But somehow it did, it’s great that it even turns on and can have sound with colors. But the light on the hilt that powers it doesn’t even work so I cannot know how many seconds it has been so I can change the color or sound (his YouTube shows how you can change stuff by flashing indicator on the button) or kind of clash. If they reached out and ask if they want to fix it, I would say no because I don’t want to wait a year for it to come back"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Mairon",
          "Nb_Reviews": 1,
          "Date": "2021-09-10T23:53:03.000Z",
          "Titre": "Ordered from here a while ago",
          "Contenu": "Ordered from here a while ago, the Anakin neopixel saber. Waited a while and never received it, didn't even get a notice to say it had shipped. Seems like this is a very common occurrence, though I was lucky enough to get a refund for it, I guess because it was ordered before this business came under fire for bad practices. Overall it really seems like a business to avoid, make sure you do research before purchasing sabers, there are many sites like this that seem too good to be true with their prices, and it's because they are. You get what you pay for, as they say."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Luna skywalker",
          "Nb_Reviews": 1,
          "Date": "2021-03-12T00:07:12.000Z",
          "Titre": "Not a scam but I don't recommend",
          "Contenu": "I was so excited to receive my Darth Maul V2 Neopixel lightsaber only for it to come damaged. Now it wasn't the company's fault it was Fedex and their terrible drivers. However what WAS the company's fault was their terrible customer service rep Vera. Not only did she not help me with my actual problems, but she tried to sell me parts that I didn't need to fix the saber. She wasn't even listening to the actual problems. I got ahold of a different service rep in late December and she was helpful to an extent. Other than telling me I could make a return she didn't tell me how or give me any useful info on how to make sure they knew it was my saber arriving. So in February after being ignored for a month and a half I payed 35$ to ship my lightsaber back to Dx Sabers with my order slip to verify its mine. It has been in their possession for 2 weeks now and all of my social media, and 3 emails have been blocked as I asked for my refund for the broken 380$ lightsaber I returned to them. I got fed up and opened up a fraud case with my bank and they are now arguing to win my money back for me. Overall I will say while Dx Sabers is not a scam, it's a terrible game of hit or miss when you order from them."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jack Kimball",
          "Nb_Reviews": 1,
          "Date": "2021-05-16T03:13:07.000Z",
          "Titre": "Keep Your Distance.",
          "Contenu": "I purchased a neopixel saber back in January. I believed for awhile that the owner of the company (Paul) was a very kind and professional business owner which I respected as an entrepreneur myself. Well... I was mistaken. After asking a few times for order updates I just kept getting dragged on and spoon fed lies which is rather unfortunate. After doing my research via reddit, google, etc, I came to find out that their supplier cut them off a couple months ago. I personally think the worst part is that he's taken down his google review page and tries to fabricate his reviews which is just a scummy business practice in my opinion. Not to mention, it's virtually impossible to get a refund because this guy will go ghost and the banks won't allow for it, especially if you've been waiting as long as I have. The only reason this isn't a 1 star review is because I do believe Paul is a nice guy with good intentions for the star wars community, but there's obviously been issues with suppliers, customer support, falsified reputation, and company staff. DX Sabers has got a lot to figure out, and I highly recommend pursuing a more reliable company for the time being whether you're a collector or just someone who wants a dang lightsaber."
        },
        {
          "Note": 2,
          "Lieu": "JP",
          "Pseudo": "Ryan Takacs",
          "Nb_Reviews": 1,
          "Date": "2021-02-09T06:48:14.000Z",
          "Titre": "just ignore this company",
          "Contenu": "I have been waiting on a saber for over 6 months now. It kind of hurts me to write this but i’ve been giving them the benefit of the doubt for quite some time. I’ve had to deal with two separate people “Master carsenic” and Brianne. I spoke with paul once and never again. I should point out that i’m military and currently live in japan. it is already hard to contact them without being ignored for days. My package was sent back for whatever reason according to my tracking number. Never actually got a reason for that. Took months to even try to get an answer. I personally believe it was shipped back to paul himself and on the map it shows a townhome neighborhood. I asked for either a refund or a new saber. Me and the other two people tried to work out a deal to get a new saber as a refund just seemed like a little to much work at the time. I had also asked if i could upgrade to a neo pixel saber since my package had already taken months to get figured out. They evaded that question everytime i brought it up in an email. they could’ve just said no and i would’ve been fine. They just decided to give me a refund now after several months.... AGAIN. the whole experience has been just overall bad. don’t buy from them as you will be treated poorly."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Tom Fair",
          "Nb_Reviews": 3,
          "Date": "2021-08-09T07:29:16.000Z",
          "Titre": "Unfortunate result",
          "Contenu": "Ordered a mystery box and praetorian back in February, and received extremely limited customer service, often with my emails going unanswered.Two months later I received my mystery box saber but still no communication or sign of the praetorian. It didn't have the smooth swing as promised on the website, but it worked ok and looked fine.I sent 3 emails asking if my order had even been sent because I hadn't received an update since the inital confirmation of purchase, heard nothing for 3 months, and then the first time I actually get a response its too late to receive, since they hadn't sent tracking details.When I finally managed to organize a reshipping of the saber from a holding facility in another country, the product I received was completely unusable. The hilt was missing screw holes to secure the core, the core was missing half of the chassis, the electronics were all over the place, it had no smooth swing, and the speaker was blown.After I contacted the customer service and providing a video, I was informed that I would have to return the product at my own cost, and send back the entire thing (accommodating the blade drastically increased the cost of the return).I hoped that this was just a small company struggling to get their feet on the ground, and wanted to help out a little. Everything that happened from the moment of my purchase was an exercise in what not to do, and I'm extremely disappointed with the service and product from DX Sabers.I recommend looking elsewhere for your sabers."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Ashley Knudson",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T02:22:26.000Z",
          "Titre": "Taking to long",
          "Contenu": "It's on its way hoping not too long custom design too hopefully pushes my competitions to a new level"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "M",
          "Nb_Reviews": 2,
          "Date": "2023-07-02T21:58:30.000Z",
          "Titre": "My order still says installation and…",
          "Contenu": "My order still says installation and testing underway so I can’t truly say the experience is perfect, but that may change once the saber gets here."
        },
        {
          "Note": 3,
          "Lieu": "CO",
          "Pseudo": "Jorge Martínez",
          "Nb_Reviews": 3,
          "Date": "2023-11-14T02:38:59.000Z",
          "Titre": "You guys are good...",
          "Contenu": "You guys are good but your take too much to answer a email or a DM , it's been 7 days since the last update of my order.Update Nov 13th - I got nothing .It never got to me and they promised almost every week to send a new one .. and that never happened."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Geniesse family",
          "Nb_Reviews": 4,
          "Date": "2023-01-07T19:27:46.000Z",
          "Titre": "Service experience",
          "Contenu": "I've ordered a total of 5 sabers from this company and everything has been decent quality and very timely delivery besides minor backups. They were pretty friendly with me when I tried to communicate with them though they weren't always timely responses. And then when I did have an issue with one of my sabers not charging correctly they managed to walk me through how to fix it."
        },
        {
          "Note": 3,
          "Lieu": "AT",
          "Pseudo": "Clemens",
          "Nb_Reviews": 2,
          "Date": "2022-06-17T18:42:59.000Z",
          "Titre": "The saber is cool the lights are also…",
          "Contenu": "The saber is cool the lights are also good the sound is ok (could be better). Unfortunately I live in europe and it took over a year for everything to arrive but the customer servise was nice"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rich Peters",
          "Nb_Reviews": 1,
          "Date": "2021-03-16T22:28:33.000Z",
          "Titre": "Getting annoyed",
          "Contenu": "Kinda getting annoyed now. My saber was suppose to ship by 2/26 its now nearly a month later. Was told they had issues with a supplier and that it would ship on the 10th then 2 days before that they posted that they would be going out on the 15th......messaged them and their new customer service rep over 24hrs ago with no response from either one. They are obviously overwhelmed with customer service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Phillip Giackette",
          "Nb_Reviews": 2,
          "Date": "2020-07-21T17:47:48.000Z",
          "Titre": "Honest review of DXSaber purchase",
          "Contenu": "I had a pretty good experience with DXSabers. I reached out looking for a specific model without breaking the bank and they responded quick and assisted me. I pulled the trigger and purchased. I stumbled upon some tough reviews which made me nervous if I would even get the saber. The communication was pretty good. All in all, it took about 3-4 weeks to receive it. The USPS tracking was a little suspicious at first but after nudging DX via social media it got a move on. Receiving the package was a bit rough. The screws and wrench were out of the bag and it was pretty messy in the packaging. The charging cable was NOT included when it should have been. Putting the blade together with the saber was fine and the quality of the hilt is very nice. The instructions are definitely a little confusing and I have not figured out how to lower the volume (it says you can). I had to purchase my own charger which was upsetting because I did spend money for something that was supposed to be included in the costs. Overall, the hilt and blade are exceptional. The timeline was ok, just need to be able to provide accurate info and timelines to customers.  The customer service was good until the bit about my charger. The packaging needs improvement along with instructions for the saber. Additionally, DX uploaded a great video on social media explaining the company, what was going on, why everything was happening, etc etc. and as a consumer I could appreciate that. It helped make me understand what was going on on their side of things. I will likely purchase again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert Stover",
          "Nb_Reviews": 1,
          "Date": "2021-10-08T01:29:39.000Z",
          "Titre": "My honest DX review",
          "Contenu": "Do I think DX is a total scam? Not necessarily. I received my saber but months after it’s order. I originally ordered the Luke Skywalker (episode VI and mandalorian) hilt on June 18th under the guise that the saber I was purchasing was chromed based on the photos available on the site at the time. Unfortunately, DX did not inform me that the hilt I was expecting was no longer the hilt being produced nor available to be shipped. I had to wait throughout June, July, and august as the new hilts were being assembled. I cannot recall exactly when the website was updated the new hilt began to be advertised, but I can provide a purchase receipt with the original chrome hilt to authenticate my purchase. I maintained communication with DX throughout my edit, of which I appreciated and they were very good at responding. I could’ve voiced my concern earlier but wanted to wait until I revive the saber as I wondered if i was alone in my confusion and alight disappointment that I did not receive the chromed hilt that I was led to believe was available on June 18th. The new hilt I received is very sturdy and doesn’t have moving electronics. It’s assembled well. The blade was 32” however and I wasn’t expecting that, I expected a standard 36” blade. I don’t think DX is totally scam, however, I do think they need to be less active on IG and more active in how they communicate as some other customers might be unintentionally led astray or receive incorrect information. Did I intentionally not receive a chrome hilt? I think so because I don’t think any were available and at the time, that wasn’t communicated on their site nor to me personally until the new hilts began production."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Adam",
          "Nb_Reviews": 2,
          "Date": "2023-09-16T06:52:17.000Z",
          "Titre": "Sent a lightsaber for an upgrade after…",
          "Contenu": "Sent a lightsaber for an upgrade and after two years they only sent it back after I said I would take legal action if they didn't, which they labeled as \"threats\".Only sent the hilt back which they had stripped out and they then made me pay to ship the remaining parts back.  Dx sent me a neopixel blade and a stand to make up for it,  but a part sent back was the wrong part and some are missing, but they are trying to resolve this."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "S. M.",
          "Nb_Reviews": 1,
          "Date": "2022-06-27T17:01:26.000Z",
          "Titre": "Sabers received",
          "Contenu": "We ordered from DX Sabers and received package. There were some parts missing, so we contacted them. The sabers were for our son's birthday. It took several e-mails (all pleasant - no issues there) and we did get all the parts necessary and DX sabers also sent a complimentary hilt for our trouble. Everything arrived before the birthday, everything works and our son is very happy. These are really great sabers."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ethan Kinyon",
          "Nb_Reviews": 1,
          "Date": "2022-06-14T23:46:18.000Z",
          "Titre": "Ups and Downs, but it was worth it!",
          "Contenu": "It’s a long story. However it ends completely on a good note. I ordered a saber a little over a year ago, and was told that it would arrive in 6-8 weeks (this was also during Covid times so I expected some delay) after about 3 months I decided to reach out to get a status on my order. It took a little over 2 months to get a response ( I learned later there was an issue with their current customer support person). Eventually the owner began helping me through the whole process and explained what was going on. It still took around 6 months for me to receive my saber but I had semi-decent communication that whole time. But when the saber arrived oh man was it sweet. I would definitely recommend I’d you are not on a strict time constraint!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matthew Savely",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T08:27:27.000Z",
          "Titre": "I liked the discount for the free…",
          "Contenu": "I liked the discount for the free neopixel on May the 4th. Your May the 4th deals are why i still come back and buy with you guys every year no one else compares."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anthony DiSalvio",
          "Nb_Reviews": 1,
          "Date": "2022-07-06T13:56:36.000Z",
          "Titre": "Dx sabers we’re so great to me and my…",
          "Contenu": "Dx sabers we’re so great to me and my wife and they were so helpful and nice they took care of showing us everything and my light saber had been amazing since I bought it so I just want to say thank you so much Paul"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TheHorseman",
          "Nb_Reviews": 1,
          "Date": "2022-08-05T18:28:10.000Z",
          "Titre": "MY personal experience",
          "Contenu": "I picked up a saber (Chaos Control) at a comic con and was very happy with it. I ended up buying the Darth Maul set and got a few mystery box sabers as well. While I am not a fan of the mystery sabers I received, my son likes them, so I guess it's a win there. I do really like the Darth Maul Set. The lights are bright, the sound is loud, and I can duel with no problem. There were some delays with my order, but customer service got on it and got me taken care of."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anthony Collazo",
          "Nb_Reviews": 1,
          "Date": "2023-02-11T03:45:25.000Z",
          "Titre": "The seller was super friendly and great…",
          "Contenu": "The seller was super friendly and great at communicating. My Saber came to me as described and I couldn't be happier."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gamer G",
          "Nb_Reviews": 1,
          "Date": "2022-07-17T04:43:02.000Z",
          "Titre": "Qui Gon Jinn",
          "Contenu": "I met Paul at C2E2 last year in December and bought the Invincible Jinn hilt. It was empty and said if I bought it then he’ll install the electronics so I did. He also said it would take only 2-3 weeks for it to come to my door based on where we were from. After those weeks I was being very worried I know all the drama vids dissing the company as a scam before I met him and wanted to give him a chance. I texted him for updates it took a while sometimes but delivered updating me with what’s the problem. It did take a few months to get the saber and I love it. Think he upgraded me with I neopixel cause I could’ve sworn I ordered it base lit but I’m not complaining my first neopixel and I’m loving it. I’ve had the saber for a few months and it hasn’t malfunctioned. Overall great hilt love the electronics and can’t wait to met them in a couple weeks. And he did tell me that all the hilts at cons would be installed so we won’t have that problem with delays anymore so that’s great. Hopefully pick up Kenobi’s or Starkiller’s hilt next purchase."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Flores",
          "Nb_Reviews": 1,
          "Date": "2023-06-04T21:14:16.000Z",
          "Titre": "worth the wait",
          "Contenu": "The end product is worth the wait. The price point is one of the least expensive."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Kirtie D",
          "Nb_Reviews": 2,
          "Date": "2022-08-09T16:32:52.000Z",
          "Titre": "Great Quality Sabers",
          "Contenu": "I've purchased several sabers from DXsabers and overall it's been a pretty great experience. The quality of the sabers have been top notch; they've got a good weight to them, can withstand a drop on the ground, are great to engage in combat without feeling like you're about to bust the blade at contact and they look great both of our lit up. It took a little time trying to figure out how to use them, but there are instructions both on the website and printed that arrived with my sabers to help figure out how to use them.For the sabers I purchased online, they did take longer than expected, but the seller was attentive and tried to give the best ETA possible to keep me in the loop. They were also very open and willing to address any concerns and ready to fix any issues we encountered. I would probably recommend if buying online, to allow for extra time allowance in delivery and, if concerned, to immediately contact the seller to keep lines of communication open for regular updates, if needed.The sabers I purchased at a recent convention were exquisite, honestly love how they look and work, and could not stop waving them around and showing them off. If I'm ever at another convention where they are, I'll most probably be purchasing at least one or two more because they really are excellent"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alissa",
          "Nb_Reviews": 1,
          "Date": "2021-03-22T22:04:40.000Z",
          "Titre": "Great communication and customer service!",
          "Contenu": "I ordered a saber in late February I believe. I understand that my saber will take a bit of time to deliver, as they are a small business and that’s normal. Even though it has taken about 4 weeks for my saber to ship, they have kept me updated in the process and answered every question I have. It should be coming in this week, and I know it will be well worth the wait!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "John Deckard",
          "Nb_Reviews": 2,
          "Date": "2021-03-03T09:47:45.000Z",
          "Titre": "Great sabers",
          "Contenu": "Honestly, apart from the long wait (2 months) I got my saber. And it’s absolutely great! I already owned one of the cheaper Aliexpress sabers but the DX Sabers have so many more features that are worth the money! Don’t listen to the small minority saying they’re a scam. Yes the wait time is long, but it’s also a small business doing all the leg work. Screw the haters."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "dil singh",
          "Nb_Reviews": 2,
          "Date": "2021-04-10T15:58:48.000Z",
          "Titre": "Just got my Saber and it’s ABSOLUTELY…",
          "Contenu": "Just got my Saber and it’s ABSOLUTELY AMAZING. Definitely worth going for the neopixle version. I had to wait a little longer than first anticipated but it’s well worth the wait and what you get for the price you won’t be disappointed. Paul kept in touch every step of the way. Looking forward to our next purchase from Dxsabers soon."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "dil singh",
          "Nb_Reviews": 2,
          "Date": "2021-03-12T13:40:08.000Z",
          "Titre": "Just received my helmet from Dx sabers…",
          "Contenu": "Just received my helmet from Dx sabers and it’s so comfortable definitely worth the wait. It got shipped to the Uk within 2 days of receiving the shipping number. Paul is a great guy and very helpful trying to run his family business. We are just waiting for our saber we ordered I’m sure it will be amazing. Will definitely us Dx sabers again."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Terry",
          "Nb_Reviews": 1,
          "Date": "2020-06-11T20:59:35.000Z",
          "Titre": "Dxsabers is not a scam",
          "Contenu": "There is a lot of bad stuff going around and people say that it’s a scam but it’s not, people are just saying this because it’s what everyone else is saying, everyone who is writing reviews on here has not bought a lightsaber from them while I on the other hand have and can say that their products are great, shipping takes a while but very good customer service and brilliant lightsaber!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Tier",
          "Nb_Reviews": 1,
          "Date": "2020-10-06T16:56:51.000Z",
          "Titre": "Worth the wait",
          "Contenu": "I placed my order in July and received my mystery box base lit saber yesterday(October).  My son loves his saber so much I decided to order a neopixel mystery box for myself.  I do recommend DX Sabers even if shipping does take a bit longer than expected.  You won't be disappointed with the product you receive!"
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "General Kenobi",
          "Nb_Reviews": 1,
          "Date": "2021-04-21T20:49:40.000Z",
          "Titre": "Very cool lightsaber",
          "Contenu": "At first, i was a bit worried because of the negative comments but IT'S AN AMAZING LIGHTSABER. It took a while to arrive but the lightsaber is so cool: 5 musics, 9 fonts for the different characters lightsaber and 11 colors. It's very bright and i am very happy about it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brandon Billmeyer",
          "Nb_Reviews": 1,
          "Date": "2020-10-07T18:19:19.000Z",
          "Titre": "Great design",
          "Contenu": "I do a lot of prop and cosplay design work. DXSabers have been on the mouths of many Star Wars cosplayers. Their replica sabers have great attention to detail. My only 2 complaints are  they can be slow to respond to emails and their website could use some love and cleaner navigation."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Raven",
          "Nb_Reviews": 1,
          "Date": "2020-07-07T04:21:10.000Z",
          "Titre": "Saber purchase",
          "Contenu": "Ordered my saber in May, got to me end of June it is a very cool saber little quirky till you get the hang of it. Only issues: 1) communication broke down and it got alittle hard to reach the shop, got quickly resolved once communication resumed.2) I had a tracking number for nine days saying the postal service didn't have it. Once it was put into the postal service got to me in 4 days would have been 3 (it was shipped priority mail) but there was a hang up on uspss' part.Really other than that dx was pleasant to do buisiness with."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "otto van oosterhout",
          "Nb_Reviews": 1,
          "Date": "2020-08-02T18:39:49.000Z",
          "Titre": "Dxsabers, great products but unreachable helpdesk",
          "Contenu": "I'm very very happy with my product and I would definitely order on Dxsabers again however, I do feel a little mislead because the shipping was supposed to be free but when it arrived I had to pay €42 and I haven't been able to contact the company about it since..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Beauregard Keo",
          "Nb_Reviews": 1,
          "Date": "2020-06-26T23:04:24.000Z",
          "Titre": "Mystery box",
          "Contenu": "Bought the mystery box a in May and it took a month to get to me. I was skeptical at first like everyone else was but the quick replies from DxSabers on Instagram were reassuring. Honestly if you want a budget lightsaber and have the patience then dxsabers is the way to go."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lou",
          "Nb_Reviews": 1,
          "Date": "2021-03-12T11:56:33.000Z",
          "Titre": "🛑STOP! Read First before Buying!🛑",
          "Contenu": "At first I thought this was a scam- but after looking though videos and more reviews with this company I knew I was taking a risk because of the 50/50 of bad and good reviews.After I bought it in Dec. I knew it would take 2-4 weeks for it to be ready then to be shipped. I waited but it was just kept getting longer, after talking to customer service and the owner- they got my order out, I got it and it was worth it for only $100-It was a basic but it was decent for my first lightsaber, thank youIf you want something different for higher price or something different then go for it and go to a different shop, don’t ruin a business because it’s small- Aliexpress has scams everyone but no one complains about that but this shop they do--Lou0420"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carter Nogle",
          "Nb_Reviews": 1,
          "Date": "2021-03-06T13:38:14.000Z",
          "Titre": "Dx Sabers review",
          "Contenu": "Company is very compliant and do a well job explaining any problems. Waiting for my second saber right now and am very excited. The quality and price of the sabers can’t be matched anywhere else."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marly Zachawerus",
          "Nb_Reviews": 1,
          "Date": "2021-03-06T16:45:49.000Z",
          "Titre": "Personally I had an overall great…",
          "Contenu": "Personally I had an overall great experience with DX. The only problem I had was the shipping time but that was all communicated with. I would highly recommend DX to others :)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sean David Lingenfelter",
          "Nb_Reviews": 1,
          "Date": "2020-08-02T21:16:04.000Z",
          "Titre": "Very nice sabers",
          "Contenu": "My son got a saber for a present and he is loving it.  it is amazing. the sound, the colors, lights and effects.....very well made and done.  These sabers are great."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "smeh oos",
          "Nb_Reviews": 2,
          "Date": "2021-03-02T12:06:52.000Z",
          "Titre": "lightsaber was in great condition…",
          "Contenu": "lightsaber was in great condition arrived with a few missing screws but not a big deal delivery was delayed but that is expected with today’s situation"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William Jenkins",
          "Nb_Reviews": 1,
          "Date": "2021-03-01T22:14:53.000Z",
          "Titre": "DX SABERS",
          "Contenu": "I have not ordered from them yet, but from all that I’ve seen so far, I’d say that their sabers look to be made in great condition and their sabers are pretty cheap for Neopixel lightsabers. While other companies sell them for around $700, DX Sabers offer Neopixel sabers as low as $300 and that’s a massive plus to me. Majority of the negative reviews I’ve seen have been about delivery time and damaged product and what I will say to those is that not everything you order online will come 100% perfect every order. There’s always gonna be complications and delays, not every time, but on small occasion. Especially with traveling and shipping, things can get damaged, so you can’t completely blame a company for damages when you account for shipping distance and when it’s in route to your home. Like I’ve stated though I’ve never ordered from them before, but I think the main thing is to just be positive and go into it with a positive mind."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Jake",
          "Nb_Reviews": 1,
          "Date": "2021-03-30T16:11:05.000Z",
          "Titre": "Awesome quality!",
          "Contenu": "The saber took a while, but it is incredible! The customer service is reliable and friendly! Would consider going through them again!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Alfie Newbon",
          "Nb_Reviews": 1,
          "Date": "2021-03-08T18:13:57.000Z",
          "Titre": "Great Product, long delivery",
          "Contenu": "Right after Christmas I ordered a mystery box from DX Sabers as I saw the controversy and I thought I'd give them a honest shot.I ordered it and after 6 weeks it didn't arrive so I contacted them, they replied basically immediately and informed me about delays that they were having due to a few reasons and my saber would be a week late.I am from the UK so I had to wait a extra week on top of this for the saber to arrive.Once the saber arrived I was very shocked to find a really nice saber hilt, I turned it on and it was genuinely really cool, it was bright, had basically very colour, multiple sound fonts, 3 light modes and even played music.I am very happy with what arrived and people saying it is a scam are lying, I feel that the money I spent was well worth it and the only reason it doesn't have a 5 is because of the delivery time. I ordered on the 29th December 2020 and it arrived on 8th March 2021.Cheers for the Saber, keep up the work.To prove I am real, my insta is @audegrien"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Quintin",
          "Nb_Reviews": 1,
          "Date": "2021-03-31T18:08:15.000Z",
          "Titre": "Great lightsabers",
          "Contenu": "Great lightsabers, only problem was timing, took a little while but the company is great, would recommend."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Brad",
          "Nb_Reviews": 2,
          "Date": "2021-03-05T21:56:00.000Z",
          "Titre": "Had nothing but pleasure working with…",
          "Contenu": "Had nothing but pleasure working with my order, always helpful when I've needed help."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gaming Sage Snps",
          "Nb_Reviews": 1,
          "Date": "2020-10-13T13:12:31.000Z",
          "Titre": "Dream lightsabers",
          "Contenu": "Lightsabers look clean and their in a affordable price 👌🏽👌🏽"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kail Lambert",
          "Nb_Reviews": 1,
          "Date": "2021-03-01T16:44:54.000Z",
          "Titre": "Amazing quality of the saber",
          "Contenu": "Amazing quality of the saber, waited longer than expected but it was totally worth it!!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "OWEN SMITH",
          "Nb_Reviews": 3,
          "Date": "2021-03-01T12:53:20.000Z",
          "Titre": "Great customer service and received my…",
          "Contenu": "Great customer service and received my saber in perfect condition and on time"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "OWEN SMITH",
          "Nb_Reviews": 3,
          "Date": "2021-03-03T13:05:34.000Z",
          "Titre": "Great customer service and the saber is…",
          "Contenu": "Great customer service and the saber is absolutely brilliant"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sarah keruskin",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T19:49:17.000Z",
          "Titre": "Thank you for helping",
          "Contenu": "I saw there sabers at the Pittsburg comic con I thought they looked really cool so I ordered on for my husband for Christmas. I’m giving them five stars because I know the product is quality and they have good deals going on their website.  The only issue was shipping times being longer than expected but they responded to my emails and gave good customer service. The saber is on the way I’ll give an update when it arrives."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ed W",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T23:01:58.000Z",
          "Titre": "I love this Saber",
          "Contenu": "I love this Saber! It's really well built and reasonable. Their customer service has been A+ the have responded to every question. I have a second coming as a gift for a friend I can't wait for them to open it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ken",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T15:01:21.000Z",
          "Titre": "Everything about this purchase was…",
          "Contenu": "Everything about this purchase was great from the ease of purchase to the wonderful interactions with the team to the package that arrived at our home. The hardest part is deciding which savers we are going to buy next."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "iko",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T22:22:08.000Z",
          "Titre": "These guys are amazing",
          "Contenu": "These guys are amazing, walked me step by step on how to charge my saber when I couldn’t figure it out, great response time and super friendly! Also they make great sabers!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dylan Bordon",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T19:35:23.000Z",
          "Titre": "I got greeted by a very kind man who I…",
          "Contenu": "I got greeted by a very kind man who I met at ANIME NYC and he had an awesome conversation with me and told me about his product. I was hooked on immediately and when business was concluded I was left very satisfied. I would highly recommend checking this place out for some high quality sabers and other blades if that’s your kind of thing :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zachary Cruz",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T21:24:52.000Z",
          "Titre": "Great light saber and good customer service",
          "Contenu": "I was pleasantly surprise how great the light saver worked. I have bought more expensive lightsabers in the past and they didn't have as many features as this one. After a year of using it as a nightlight/display peace It stopped working. Luckily the saber comes with a lifetime warranty. I was able to contact the owner via text and mail him the broken saber. He replaced it in a few weeks. The owner kept in touch with me the whole time, gave me updates and a tracking number after he shipped the saber."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jordan neri",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T01:30:11.000Z",
          "Titre": "I am jealous to everybody who bought…",
          "Contenu": "I am jealous to everybody who bought one getting the order one soon once I get the money it's a lot better than the Obi-Wan Kenobi Black series lot lighter to carry and you can dual and smack people"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kyle Davis",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T04:32:25.000Z",
          "Titre": "I absolutely love my sabers",
          "Contenu": "I absolutely love my sabers. I've purchased multiple times from DXSABERS and will continue to do so."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chloe",
          "Nb_Reviews": 3,
          "Date": "2023-12-07T00:47:31.000Z",
          "Titre": "Amazing lightsaber!",
          "Contenu": "Despite a bit of a wait, DX sabers got my lightsaber to me and I absolutely love it. I got the Sith Rey one and it’s so cool and is excellent quality. They are the sweetest people and their customer service is incredible. It’s a small business you should absolutely support!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "freddy Rosario",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T00:48:01.000Z",
          "Titre": "Started with a little misunderstanding…",
          "Contenu": "Started with a little misunderstanding but recieved it everything on tim impressive to say the least"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brandon",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T20:18:54.000Z",
          "Titre": "Sabers shipped and arrived on time!",
          "Contenu": "Sabers shipped and arrived on time!  They were definitely a hit when I gave them as a gift and even my in-laws enjoyed playing with the sabers!  I did contact customer service and they were quick to respond to my questions throughout the process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Connor Martinkovic",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T22:14:34.000Z",
          "Titre": "Good customer service",
          "Contenu": "Bought a neopixel dark saber a bit back, customer service is responsive and always does their best to assist in any issue you might have. Quality, fun blade and hilt as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Milton Lopez",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T15:59:21.000Z",
          "Titre": "Best service by far",
          "Contenu": "Not sure why people say they've had a bad experience. With this company. I've had nothing but a great experience with this company. I ordered my neo pixel lightsaber last year and received it within a reasonable amount of Time. I am very happy with my product. And I've never had any issues with customer service. Just recently for some unforeseen reason, My light saber core got damaged, When I contacted customer service they were very friendly and quick to respond. I sent back my Lightsaber and and got it back with two weeks I'd even say the lightsaber worked ten times better than before. I'm very happy with the company, the customer service, and of the owners who personally helped me.5 stars always."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Joey Buck",
          "Nb_Reviews": 4,
          "Date": "2023-11-10T19:55:41.000Z",
          "Titre": "My experience with DX started a few…",
          "Contenu": "My experience with DX started a few months back, I ordered a Mandalorian lightsaber (Not a dark saber) but unfortunately the emitter wasn't in stock. They reached out and explained that to me, and I was sent another saber of equal value. I had a neopixel saber and a RGB blade due to a mixup at the warehouse. Paul and Brianne were quick to pick this issue up and rectify it, they sent me a neopixel blade with a decent amount of time, they've remained in contact throughout providing valuable updates on the situation. On my next order they will send out the original emitter that I ordered and a RGB saber as an apology, how could you fault customer service like that? I think people forget that these guys are human like the rest of us, they have lives, they're busy, they go to conventions, they might not be able to sort it on day one but they do sort it! Thank you again Paul, hope you and your wife had a lovely anniversary!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen Sciacchitano",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T02:41:44.000Z",
          "Titre": "By far the best saber we've ever owned",
          "Contenu": "By far the best saber we've ever owned! You can tell they really care about making sure the quality of the product and the whole experience are the best they can be. Bought at a con and have been using it for display, dueling, and even home security!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ALONSO SERVIN",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T19:06:11.000Z",
          "Titre": "I had a fantastic customer service…",
          "Contenu": "I had a fantastic customer service experience with DX Sabers. Despite a few hiccups with delivery and order details, the team went above and beyond to ensure that I received the neopixel saber I had paid for. Their dedication to resolving any issues was truly commendable. Overall, it was a great experience, and I'll definitely be recommending them to others. Patience is key when ordering sabers, and I can personally vouch that DX Sabers delivers on their promises."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Petersen",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T15:35:43.000Z",
          "Titre": "We absolutely love our sabers",
          "Contenu": "We absolutely love our sabers, they are so realistic. It seems like every day we find something new on our light sabers!! The weight of them is just amazing, feels so real! Each part is super detailed and you can actually play with them… and not be worried they will break! Every time we have shown our sabers to friends & family they are so impressed. The owners are so friendly helped answer any questions we had, and really believe in their products!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "hrafn moretto",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T00:03:21.000Z",
          "Titre": "Great customer service!",
          "Contenu": "The guys at DX are great! Excellent customer service and product. I bought a dark apprentice saber 2 years ago and the charging cord died today when I inquired about purchasing a new one they just handed me one! No questions asked."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sierra Kramer",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T16:44:20.000Z",
          "Titre": "My brother in law got a saber that…",
          "Contenu": "My brother in law got a saber that didn’t come with the proper charger (at a convention). We went back the next day and he gave us the proper stuff. He was very nice and knowledgeable"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nick H.",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T16:00:10.000Z",
          "Titre": "Top notch sabers and service!",
          "Contenu": "Wonderful customer service and sabers! DX Sabers answered my questions promptly and helped me find the perfect saber for my collection. Look forward to my next purchase and with the holidays coming up the youngling sabers will make perfect gifts for my nieces."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Spoopykitt",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T03:50:36.000Z",
          "Titre": "Awesome customer service",
          "Contenu": "Awesome customer service! Super helpful, friendly and knowledgeable. Ive wanted a lightsaber for years and their prices are very reasonable. He also let me play with the lightsabers at the con (which was sweet) but what convinced me was the lifetime guarantee! The quality of the lightsabers are very solid and im a fan of differents led colors. (I have had trouble choosing which color to commit to with other lightsaber companies and now i have variety lol) im glad i got to catch the booth at the anime expo and had such a positive expierence 10/10 would recommend. :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sophia Cormier",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T19:00:57.000Z",
          "Titre": "Wicked awesome light sabers!",
          "Contenu": "I really love the sabers from this amazing company, DX Sabers! The quality is incredible, so many wicked awesome options! I love all the colors and different effects the blade can do. And I love how light-weight the whole unit is. It’s not heavy at all, which is super nice and convenient, especially carrying it around at cons and other events. And the product seems extremely durable as well. I highly recommend getting a saber, or two from DX Sabers. You won’t regret it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jordon",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T17:40:47.000Z",
          "Titre": "Everything from the saber to the box is…",
          "Contenu": "Everything from the saber to the box is absolutely top notch, customer service was absolutely incredible all the way through, always responds and is incredibly nice, I wouldn’t buy a saber anywhere else."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Pfeifer",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T21:09:31.000Z",
          "Titre": "Respect, Quality and Honesty",
          "Contenu": "The Owner and another Worker on Saturday of Baltimore Comic-Con were super helpful. They introduced me into the sabers, and told me the process of how they are made. AMAZING Quality and one of the Best sabers ive ever scene. They were able to help me use the device and any questions i had, They answered and with a smile."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cody Brandon",
          "Nb_Reviews": 3,
          "Date": "2023-07-03T21:54:56.000Z",
          "Titre": "purchased at AwesomeCon",
          "Contenu": "purchased at awesomeconcool booth setup, with demo units you could hold and feel, saw the guy working the booth smashing one on the concrete floor with no ill effects, i bough mine (dual saber with attachment piece)  to practice spinning staffs'"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Consumer",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T00:56:01.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "Bought a saber direct from these guys. Battery died within a year and he happily replaced no questions asked. Very happy with the customer service offered"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Oliver Calhoun",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T21:28:25.000Z",
          "Titre": "Great customer service/ communication",
          "Contenu": "The folks at DX sabers have been great with their communication and are most helpful.  I sent in a saber for repair from another company (who didn’t bother to return my emails), but DX were most helpful and responsive.  They are still working on the repair, but based on how they’ve worked with me so far, I know my saber is in good hands!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jaime  Garcia",
          "Nb_Reviews": 2,
          "Date": "2023-09-22T04:31:45.000Z",
          "Titre": "Customer service is on point",
          "Contenu": "My orders are a bit late but DX have been keeping my posted. It has been an interesting year and the customer service of responding is alone 5 stars. Thank you all for keeping me posted and can’t wait to see them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Timothy Brimble",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T22:48:25.000Z",
          "Titre": "Great saber",
          "Contenu": "Great saber, great customer service. If you’re looking to start your collection and want something affordable this is the right place to be, I had no problem at all getting my sabers they got delivered fast faster then I expected I love them, they are good for dueling, collecting or whatever you wanna do, thank you to the ex saber team I appreciate all y’all. Ps. All y’all have a wonderful day or night were ever you’re reading this from."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Kellogg",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T00:35:09.000Z",
          "Titre": "Great saber for the cost",
          "Contenu": "Great saber for the cost. The milled aluminium hilt looks and feels nice. It begs for some customization and, given the price, I'm comfortable throwing on some spray paint and O Rings. If you are looking for a low cost neopixel lightsaber and don't mind not being able to edit a micro SD card, then this may be the company for you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carnage is Red",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T20:38:46.000Z",
          "Titre": "Premium Service and Premium sabers DX Sabers Rock!!!!",
          "Contenu": "Dx Sabers is one of the Best Saber Companies I have come across by far. Excellent response times to all questions I had, very informative when it comes to knowledge of the products being sold. I actually got a chance to meet with the CXO of DX Sabers and we took some pictures together , such a great experience and I will definitely recommend people Shop with DX Sabers!! I will be buying all of my children’s sabers from here"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Oliver",
          "Nb_Reviews": 4,
          "Date": "2022-08-27T03:15:22.000Z",
          "Titre": "DXSABERS is by far the best",
          "Contenu": "DXSABERS is by far the best. I ordered the crimson maul and it is incredibly beautiful. Well made, the neopixel is fantastic, my favorite saber on any market. Paul is an incredible man, he definitely goes the extra mile. DHL messed up the delivery and lost my order, but Paul sent another straight away and covered the import tax. He is truly amazing!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristen Shephard",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T03:07:35.000Z",
          "Titre": "Best Lightsabers. Lifetime warranties. 16 colors AND every saber sound!",
          "Contenu": "The reviews for this company are shocking! These guys are INCREDIBLE and have lifetime warranties on their products. I've seen nothing but genuine care and concern for their consumers. They go above and beyond to be there for their clients. I truly hope some bad apple reviews don't stop others from experiencing the phenomenal products these guys create."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Toddrodd Newton",
          "Nb_Reviews": 1,
          "Date": "2023-01-24T17:19:08.000Z",
          "Titre": "Well well worth it!",
          "Contenu": "I saw them at the Cosmic Con in Flushing Queens, NY.Their products were displayed professionally and were very organized. There was no guess-work in knowing the prices of the items since the prices were displayed very clearly. And I must add that the quality of the sabers and especially the specific types of hilts (handles) were tremendous. They even have exact replica hilts to specific characters. (Luke Skywalker and Darth Vader just to name two)Well worth the investment and the customer service is top notch. I strongly suggest checking out their products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cliff Lashley",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T16:29:14.000Z",
          "Titre": "Coolest thing I've bought in a while",
          "Contenu": "Coolest thing I've bought in a while. Perfect instructions. Easy to operate. Ready to vank some Stormtroopers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kody Schweickhardt",
          "Nb_Reviews": 1,
          "Date": "2023-04-30T04:29:55.000Z",
          "Titre": "Stellar Customer Service any Jedi Deserves",
          "Contenu": "Customer service with Brianne has been exceptional. They have worked with me on every single occasion where I needed some extra help, and made sure I got my saber in time for May the 4th! Its clear they are willing to go above and beyond to make their customers happy and it has been an absolute pleasure working with Brianne as I've been going through my process of buying my first NeoPixel lightsaber!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ashley Werling",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T23:28:26.000Z",
          "Titre": "Absolutely amazing experience",
          "Contenu": "Absolutely amazing experience, I bought a light saber for my fiancé an it came packaged wonderfully, as well as shipped out very quickly!! 10/10 would recommend!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric Zamarripa",
          "Nb_Reviews": 1,
          "Date": "2023-02-26T23:39:32.000Z",
          "Titre": "Double Maul Saber, AMAZING!!!!",
          "Contenu": "I purchased the Maul double saber for my little brother and the quality surpassed my expectations! The attention to detail and features were spot on! The DX team kept me updated and informed throughout the entire process! Once your training is complete, I recommend getting a Saber from DX Sabers! I will definitely be buying myself one! Thank you for everything! A+++"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "nick andrei",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T20:13:40.000Z",
          "Titre": "DX Sabers is awesome",
          "Contenu": "DX Sabers is awesome.  Great prices, great customer service.  The top of the blade broke off my some saber.  We met them at a comic con showed it to them no questions asked they replaced it.  Amazing, hard to find warranties that are true to their word but DX Sabers is.  Very impressed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Errol Latibeaudiere",
          "Nb_Reviews": 2,
          "Date": "2023-09-21T20:57:55.000Z",
          "Titre": "Helped me resolve an issue with purchasing",
          "Contenu": "Great customer service! Had an issue with purchasing and they were able to help get it resolved. Purchased 3 light sabers from them at Baltimore Comic Con and they work great!Will buy from again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keefe strong",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T18:16:37.000Z",
          "Titre": "Best purchase in 2023",
          "Contenu": "I stop by the dxsabers booth at tekko 2023. I was hesitant at first at buying the item but after seeing their sabers in action. Seeing how durable they are. Plus the different light and sound optionsThen the biggest thing the LIFETIME warranty Not only did I buy one I bought two and me and my friends have been having so much fun Since we purchase these sabers. And again the lifetime warranty is the best thing about the product but my favorite thing is their durability If you're looking for a saber that is really combat ready This is the product i'm a very heavy handed person so I was thinking they will break easily but me and my friends have a several duels With them and no problems I rarely leave reviews for items but I think dxsabers may have earned themselves a lifetime customer. I will definitely be buying more in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alyssa O'Dougherty",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T05:38:12.000Z",
          "Titre": "Best lightsabers in the business!",
          "Contenu": "I really love my new sabers! I’ve had Master Replicas, Force Effects, and Ultra Sabers and I have to say these are by far the most durable and have the best features when it comes to colors and sounds. The next feature Im looking to do is make a double saber by buying another blade for my other and I look forward to purchasing that in the future!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan Nandalall",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T05:18:59.000Z",
          "Titre": "These lightsaber are hands down better…",
          "Contenu": "These lightsaber are hands down better and more affordable than what you can find on the market I personally bought a mystery box at cosmic comic con for $100 and got a Saber worth $200. They have incredible customer serivce. Must have if your a star wars fan."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mardie",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T04:04:45.000Z",
          "Titre": "Flexible people and geeat online customer service",
          "Contenu": "I bought a saber from them at Awesome Con, my and my bestie struggled a bit with making the payment to buy 2 mystery sabers but they were really nice and helpful. They take Venmo which was awesome and how we ended up paying for them. I also ended up emailing them because I messed with the saber and messed up the colour for some or the presets and they answered in the same day!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dennis Molner",
          "Nb_Reviews": 1,
          "Date": "2023-01-30T19:18:42.000Z",
          "Titre": "Great experience at GSCF...",
          "Contenu": "Met the crew at the Garden State Comic Fest at Sussex County Fairground. They had many amazing sabers on sale. They appeared well made and sturdy, with nice weight and felt great!  I purchased a surprise box and received the Fearless Jedi!!!! It is amazing! There was a minor issue of missing screws and customer service responded to my inquiry within an hour! Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Parnell Grenier",
          "Nb_Reviews": 2,
          "Date": "2023-07-11T15:40:04.000Z",
          "Titre": "Bought Two Sabers from a booth at Shore…",
          "Contenu": "Bought Two Sabers from a booth at Shore Leave 43 Sci-fi Convention in Maryland, The Salesman at the table whom I later learned is the company owner was super friendly. I bought two of the very affordable 99.00 Mystery Saber Box deals. My son and I have played with them very lightly so far so I cant speak to durability. But first impressions are the product seem well built, Sound great and worked well out of the box."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Johnny",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T22:56:18.000Z",
          "Titre": "The starkiller unleashed",
          "Contenu": "I placed the order before Thanksgiving, and received it the week after. The hilt is beautifully designed, and I could not ask for a better saber. The pictures online does not do the hilts justice. The customer service is phenomenal. Whether it be through email or on Instagram the reply back is almost immediate. This is by far my most favorite saber and I will definitely be making another purchase through them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ellie",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T22:07:50.000Z",
          "Titre": "So nice and really awesome products!!!",
          "Contenu": "I've had this saber for about a year now and it's really cool!!! I had trouble a little bit ago and their customer service was amazing and so helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ed",
          "Nb_Reviews": 1,
          "Date": "2022-09-27T01:34:13.000Z",
          "Titre": "Excellent Customer Service-Awesome Sabers",
          "Contenu": "Excellent Customer Service. Just placed an order for the Fallen Revan saber. I was having problems with the code for special offer. Contacted customer service after 7pm on a Monday night. Got a response in minutes. Customer service was very helpful. Placed the order. Excited to get the new saber. Have purchased some sabers at a Comic Con convention. These are awesome sabers. Great quality and build. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-02-17T18:08:12.000Z",
          "Titre": "The owner has responded to every…",
          "Contenu": "The owner has responded to every question I’ve had within the hour! He is also a super nice guy. Moreover, the product is amazing. The sound, feel, and color has been high quality for the few years I’ve owned it. I would recommend 100% because the quality is unbelievable and the price point beats out the other competitors."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fabian Salazar",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T15:09:38.000Z",
          "Titre": "Got a saber from Awsomecon",
          "Contenu": "Got a saber from Awsomecon. My kids love it. The craftsmanship and details of the saber are amazing. What we love compare to other vendors that were at the Awsomecon is that they give a lifetime warranty compared to most just giving 1 year. We bought 1 more saber online we can't wait. They also have specials. Highly recommend Thanks guys."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Sheehan",
          "Nb_Reviews": 2,
          "Date": "2023-01-19T16:23:13.000Z",
          "Titre": "I experienced great customer service…",
          "Contenu": "I experienced great customer service with these guys every time ive dealt with them. I picked up my saber at a convention and as long as ive had it its worked amazingly. They even offered to replace the electronics in my blade when i ruined mine using a power adapter that was for something completely different. I chose to purchase and upgrade to a smooth swing instead and install it myself but even then they offered to install the parts for me free of charge. The upgrade was very simple, the sabers are very well designed and these guys are awesome!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vincente DeStasio",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T23:24:11.000Z",
          "Titre": "Great Customer Service!",
          "Contenu": "The sabers are great if you're looking for something durable and affordable but also want alot of features. The customer service I received from Brianne Sweeny was fantastic. She helped explain things to me and was very responsive!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zack W",
          "Nb_Reviews": 1,
          "Date": "2022-09-30T21:34:46.000Z",
          "Titre": "Amazing family business",
          "Contenu": "Amazing family business. Customer service always helped; they answered every email and direct message I sent. Mine is now on the way after getting it fixed FOR FREE! I don’t see myself buying another lightsaber anywhere but here."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bailey",
          "Nb_Reviews": 1,
          "Date": "2022-08-24T23:33:45.000Z",
          "Titre": "Dxsabers are Awesome",
          "Contenu": "The work done on these sabers is amazing. This obviously took a lot of time to do but it’s worth it. A very small company that I suggest actually looking into with amazing customer service as well that tries to stay involved with their customers. I suggest you give them a shot as they are nothing like the bad reviews say they are but understand that at most there are 2 people working on the sabers so be patient. Definitely a 10/5 from me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Evan Sorel",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T18:58:22.000Z",
          "Titre": "Great Deals! Great People!",
          "Contenu": "I have ordered twice from them, and have been very happy both times. The sabers were all in nice, working condition, as ordered. All my sabers were battle ready, with voices and sounds, contact flashing, and full spectrum beautiful RBG colors. Brianne from customer service is awesome, and they always reply to me fast, and help with anything I need. Best priced sabers, and great quality."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deanna Moskowitz",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T03:36:59.000Z",
          "Titre": "Attentive customer service!",
          "Contenu": "This is technically my second time ordering from DX sabers, but the first time that I was getting something for myself. Customer service as been very attentive and helpful, answering any and all questions. They reached out to me to inform me that the triple stand I had ordered was out of stock, and offered to send a different stand. I did realize that there was something missing from my order when I recieved it, but customer service was quick to reach out when I emailed them. They were very quick to offer solutions. The neopixel mystery saber that I got was absolutely gorgeous and you really can't beat the price I got it at either! Shipping was fast!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen Rose",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T18:26:26.000Z",
          "Titre": "Super high quality and great designs",
          "Contenu": "Super high quality and great designs. They are incredibly durable and have a lifetime warranty. Does custom designs and is incredibly passionate. 20/10 would recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eddie",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T13:50:03.000Z",
          "Titre": "100% recommend ✅✅✅",
          "Contenu": "100% recommend DXSabers has great quality sabers, with great quality service. If there are any concerns with your order, they are right on it. No reaching out to them and not hearing anything for a while. They get right back to you. I’ll be doing business with them again. You’ll definitely want to do the same."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roger B.",
          "Nb_Reviews": 1,
          "Date": "2022-09-20T16:09:50.000Z",
          "Titre": "Best sabers hands down",
          "Contenu": "I am a sword and saber collector. I've owned many sabers that just weren't good enough. More often than not they have the look but not the weaponistic feel I recommend DX sabers to all who are looking for the best saber experience they can find. Awesome craftsmanship great durability."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Taylah McIntyre",
          "Nb_Reviews": 2,
          "Date": "2022-09-15T04:19:55.000Z",
          "Titre": "I would not buy a saber from anywhere else now that I have found DXsabers.",
          "Contenu": "I received my lightsaber yesterday, I opened it today and I genuinely cried. The hilt of my saber was something so incredible, I have seen the replicas other companies sell and truly nothing compares to DX sabers. I am so happy that I was patient, because I now have everything I ever dreamed of. This family works their butts off to give their customers the best service possible & it really shows. I would not buy a saber from anywhere else now that I have found DXsabers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T04:53:43.000Z",
          "Titre": "Fantastic customer service!",
          "Contenu": "DXSabers has fantastic customer service. They are quick to reply to email concerns, and leave you knowing just how important you are to them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Diane T",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T20:07:06.000Z",
          "Titre": "High 5 experience !!!!!",
          "Contenu": "Although I don’t own a Saber DX I had an up & personal experience with one & I will tell you I was very excited !! I hope in the near future to own one it would definitely bring a smile to my children’s face !! Thank you Captain A for letting us experience this !!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ty M",
          "Nb_Reviews": 1,
          "Date": "2023-05-28T06:13:09.000Z",
          "Titre": "Good Customer Service",
          "Contenu": "I bought a pretty expensive saber and was a bit worried about the purchase i had some issues when i got it at a con but I emailed the company about my issues and was responded too in minutes. whether it takes a week to fix or a few minutes its clear to me the company stands by there lifetime warranty and i appreciate that."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Y Gardner",
          "Nb_Reviews": 1,
          "Date": "2023-08-06T17:04:50.000Z",
          "Titre": "Childhood dreams made!",
          "Contenu": "My friend and I bought a few at momento con! Literally had several battles with each other and a couple other people. So much fun. 💚💚💚 great quality and they were super super nice to deal with 😁😁😁 childhood dreams made"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alexis Espinoza",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T04:13:21.000Z",
          "Titre": "Awesome saber",
          "Contenu": "Really like the Saber with all the features and that it feels really sturdy."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-01-13T00:52:40.000Z",
          "Titre": "I bought an Inquisitor Grande Sabre for…",
          "Contenu": "I bought an Inquisitor Grande Sabre for my son for Christmas. The delivery to me in Australia and follow up from the company was excellent. The sabre itself is impressive and well made. The swing is smooth and the quality and features are first class. The sabre length and hilt design are excellent. I also received a bonus sabre which has proved excellent for our entertainment."
        },
        {
          "Note": 5,
          "Lieu": "TR",
          "Pseudo": "mnmmtl",
          "Nb_Reviews": 4,
          "Date": "2023-05-01T08:42:04.000Z",
          "Titre": "Hello from Turkey",
          "Contenu": "Hello from Turkey! I searched an affordable neopixel saber for days and i found DXSabers. I always dreamed of my first lightsaber but couldnt decide about which one i should get. So i bought a mystery box. I didnt expect something premium for that price of course. But... I GOT A FRICKING LORD VADER REPLICA! And now after a year im finally getting another mystery box and i couldnt be more excited about the results. This man is an honest man about his work. God bless you DXSabers team!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elizabeth R Lizzy",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T18:24:31.000Z",
          "Titre": "This lightsaber is amazing",
          "Contenu": "This lightsaber is amazing! I couldn't believe how amazing this product is! It's so durable and fun to use. The features on it are so cool, too! 5 stars!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Allan Liska",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T15:38:16.000Z",
          "Titre": "Quality Sabers with Great Response and Effects",
          "Contenu": "The sabers from DXSabers are really well made. The quality of the sabers is evident from the moment they come out of the box. The sounds and the response are incredible and using their sabers are an enjoyable experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Francisc Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2023-04-09T19:57:32.000Z",
          "Titre": "This is an amazing lightsaber",
          "Contenu": "This is an amazing lightsaber, I love the sounds it makes when you move it around and how it lights up the room, it looks just like the lightsaber in the show. I highly recommend it to people who likes to watch Star Wars, it has very good quality and you won't regret buying it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Ruffin Jr",
          "Nb_Reviews": 1,
          "Date": "2023-01-02T17:24:00.000Z",
          "Titre": "It's Luke - reincarnated",
          "Contenu": "It's Luke (Typo: like) youve actually taken an energy into your Hands! You almost can't help but become who you imagine you are when you hold a DXS! Every dream I have that requires me to defend myself, finds me with My Saber in hand! Awesome style, sound, weight and lumens! Never look anywhere but here! #DXS4L"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony Robinson",
          "Nb_Reviews": 2,
          "Date": "2023-04-11T01:02:57.000Z",
          "Titre": "I have purchased from DX sabers twice…",
          "Contenu": "I have purchased from DX sabers twice now. The first time was a bit rocky, but the owner was very helpful and responsive the entire time. I knew that they where going through a difficult time as a company which is why I was willing to give them another chance. Flash forward to now and I must say that I am glad I gave them another chance. Not only did they update me in real time about my order, but the customer service was beyond top notch. They even sent me a video of my order without me even asking for that. I now officially recommend these guys and I will be buying from them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicholas Schoepfer",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T04:09:29.000Z",
          "Titre": "Everything you could want in a lightsaber replica",
          "Contenu": "I've always wanted a model lightsaber but never found one worth the price. DX Sabers changed that. These things are amazing. They have every replica you can think of or you can build your own. They are made of real metal, so they feel substantial and real in your hand. There are many colors to switch between,  so you're not just stuck with one. But what really blew my mind was that you can even change the sound effects. Ren's sounds to a normal saber to the dark saber. There is even laser deflection and crossed saber effects. They also play music like the theme and Imperial March!You can tell the owner and designer, Paul is passionate about his work because it shows in the quality. I would highly recommend these if you are a collector, fan, or even a flow artist."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Launa",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T23:24:29.000Z",
          "Titre": "Owner was very helpful and responsive…",
          "Contenu": "Owner was very helpful and responsive the whole way through the shopping, purchasing and shipping. Products are as described and great quality. I got ashokas dual sabers and the look and feel great and all the fun sounds and lights are amazing"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rob Stephenson",
          "Nb_Reviews": 1,
          "Date": "2022-11-02T18:55:21.000Z",
          "Titre": "I met the gentlemen of DXSabers at…",
          "Contenu": "I met the gentlemen of DXSabers at Galaxycon in Richmond, VA. I bought the last \"Fate of Leia\" saber from them. This saber looked like a masterpiece! Nice weight, great look, balance and feel! Perfect showpiece for any collector! When found I had some missing screws, I contacted them and they got the parts to me immediately! The service was friendly along with the follow up to make sure I got the parts. A wonderful experience!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Ping Ding",
          "Nb_Reviews": 1,
          "Date": "2022-11-03T16:26:15.000Z",
          "Titre": "Don't listen to the other reviews",
          "Contenu": "I don't know what everyone else here is saying about DX sabers, but they've been fantastic so far. Couldn't name a single issue, my order literally even came 2 days early. I got the luke (which came with an extra baselit as well which I gave to my son) and it was much brighter than I expected, and worked perfectly out of the box. I've been wanting a DX for a while now and they did not disappoint. Compared to the stuff Disney makes at galaxy edge, it's so much better quality and more durable. Will be buying again when I get my paycheck! Stay strong DX 💪"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sharon",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T18:48:40.000Z",
          "Titre": "Great company. We brought my grandson and they were…",
          "Contenu": "We brought my grandson and they were amazing with him. They were patient and answered all his questions. He loves the Light Saber.  They go out of their way to ensure everything is just right and stand behind their products. Their customers service can be a role model for other companies large and small."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David B",
          "Nb_Reviews": 1,
          "Date": "2023-07-22T21:27:21.000Z",
          "Titre": "Tekko 2023",
          "Contenu": "Met them at Tekko 2023 and purchased a NeoPixel mystery box. I'd never been able to justify buying one before, but it was a sign seeing them at the convention."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lynne Spooner",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T21:39:59.000Z",
          "Titre": "While some concern that I might not…",
          "Contenu": "While some concern that I might not receive my order, I did , within six weeks of the order. It came very well packaged and the sabers exceeded expectations. I am extremely pleased with my purchase of the darth mail light dual sabers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Evan Schirf",
          "Nb_Reviews": 2,
          "Date": "2023-03-11T18:36:47.000Z",
          "Titre": "Great Customer Service during Warranty",
          "Contenu": "I contacted their customer service to warranty a broken speaker on a saber. They were very responsive and showcased their lifetime warranty, which was very easy to take advantage of. Once they received the saber, their service and communication back was very swift and just what I needed. 10/10 would recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eva Gigis",
          "Nb_Reviews": 1,
          "Date": "2022-08-29T17:31:54.000Z",
          "Titre": "Incredible Sabers and incredible Customer Service!",
          "Contenu": "I’ve ordered 2 sabers from DX Sabers, and they are incredible! From the color change, to the voice fonts, and from how durable they are when practicing them in dueling with other sabers, they are so worth it!! I love my Fulcrum and Kenobi Legacy lightsabers!! I truly can’t wait to order more sabers from this company! DX has also been so wonderful in communicating when my sabers will be shipped and if I needed help with anything, they were incredible! I’m so so glad to have found them, and can’t wait to get more sabers from them!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Minister DeJesus",
          "Nb_Reviews": 1,
          "Date": "2023-03-18T02:57:01.000Z",
          "Titre": "I got my Saber and was so Happy .",
          "Contenu": "I got my Saber and was so happy .. I love it the quality and everything about it .. I would highly recommend them. Since the moment I got in touch with them. They have been on point . Always returning and answering my questions. I spoke with them ,I am the type of person that is always asking questions, and I love how this company started and the mission that started them. Please continue doing what you do and don't allow anyone to take your shine   Continue being attentive and responsible.I'm sending my Jedi fans to go to you .God bless this company and the team .."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Palmer",
          "Nb_Reviews": 3,
          "Date": "2023-05-12T19:33:25.000Z",
          "Titre": "They're a great saber shop!",
          "Contenu": "They're new shipping speed on ready to go sabers is exactly as advertised.  And they're quality is on par if not better than most of the other well known saber shops but for a fraction of the cost"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stacy Brahm",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T17:49:46.000Z",
          "Titre": "y sons met them at a convention and…",
          "Contenu": "y sons met them at a convention and…My sons met them at a convention and ordered a buy one get one free lightsaber and had it sent to them. The sabers were sent ahead of time and tracking was delivered to my sons email the next day. He sent me the email and I was like totally shocked that this place was so fast. We got ''em a couple days later and the tracking was active pretty quick too with a day for a delivery. Thanks guys for answering my questions about instructions too. Five stars for ya"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Caleb Cassano",
          "Nb_Reviews": 1,
          "Date": "2022-12-03T19:19:16.000Z",
          "Titre": "Support this amazing local buisness",
          "Contenu": "Honestly one of the best saber companies I've ever worked with. Wait time is a little slow, but what could you expect when it's basically one man doing all the work. Great customer service and someone I could genuinely call a friend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tanner Derby",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T17:50:24.000Z",
          "Titre": "I recently bought my first saber at my…",
          "Contenu": "I recently bought my first saber at my local comic con and the experience was absolutely amazing I had a problem a few days later and they got back to me within seconds!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dylan Shintaku",
          "Nb_Reviews": 1,
          "Date": "2022-09-28T18:09:32.000Z",
          "Titre": "Amazing customer service, great sabers.",
          "Contenu": "The experience was awesome, at first the lightsaber broke, and the description was a bit confusing, but they backed me up with some awesome customer service, sent me over some new stronger blades, and explained the lightsaber to me! definitely would buy from these guys again."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Damien Mocata",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T01:35:54.000Z",
          "Titre": "Very communicative",
          "Contenu": "Very communicative, kept me informed at all stages, and the quality of the sabers was mind blowing. It really feels like having a movie prop in my hand. Was happy to answer all my questions, and also chat fandom. I’ll certainly be sharing DXSabers with my friends here!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kirsten",
          "Nb_Reviews": 2,
          "Date": "2022-12-24T17:09:20.000Z",
          "Titre": "DX Sabers is an amazing brand…",
          "Contenu": "DX Sabers is not only an amazing brand but the people are amazing as well. They will go out of their way to make sure their products are safe, fun, and amazing. My son has 2 of the Sabers now and still asks for more. Remember folks these are an Art and this is someones small business. When you shop small you are supporting that person and their driven passion for their art. The owner of this company takes his business seriously and wants all of his customers to enjoy his products. We think you are doing amazing. Keep up the work because we love it!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T21:14:42.000Z",
          "Titre": "Excellent saber",
          "Contenu": "Excellent saber and great feel. Felt like a kid when I got it as I always wanted to know what it could be like owning what real saber would feel like instead of the plastics I got as a kid. Brianne was very helpful in emails ensuring I got my saber as quick as possible and made me feel that I was a customer and not an order number. I can't wait when I get my home to mount this on my wall."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chi-Town Pyro",
          "Nb_Reviews": 2,
          "Date": "2022-12-20T05:33:41.000Z",
          "Titre": "Amazing Christmas gift",
          "Contenu": "This is my second online order from DX Sabers.  The Twin classic Tano sabers I got my wife for her birthday was amazing.  So, this year I ordered neopixel upgrade for her Rose Gold saber, (we picked it up at C2E2 when we met DX Sabers), for Christmas.  I requested to have it before Christmas, and as they promised, I have received it.  It's going to be a amazing upgrade."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin",
          "Nb_Reviews": 1,
          "Date": "2022-08-28T04:47:09.000Z",
          "Titre": "Not a paid review or someone who works…",
          "Contenu": "Not a paid review or someone who works for DX, just an honest experience.  Ordered their starkiller saber on August 18th and it shipped a few days later.  Was delivered today 8/27.  Not a bad experience at all."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chi-Town Pyro",
          "Nb_Reviews": 2,
          "Date": "2022-08-09T17:20:08.000Z",
          "Titre": "Ashoka Past Pair and Dark Rose",
          "Contenu": "Ordered my wife the Ashoka Past Pair. When they arrived, they ignited perfectly.  Loved the color changes, great quality.  Then when we saw them at C2E2, we brought the Dark Rose and Imperial Sabers (hope I got the name right).  Imperial Sabers joined together to make a fun staff. Great sabers, had a lot of fun battling with them.  Definitely battled ready and tested."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kirsten",
          "Nb_Reviews": 2,
          "Date": "2022-10-10T16:41:16.000Z",
          "Titre": "Dxsaber are absolutely amazing",
          "Contenu": "Dxsaber are absolutely amazing. Wonderful, friendly, and super helpful. They went out of their way to make sure my son got the saber of his dreams. Amazing family of jedi and a wonderful small business to support. #shopsmall"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Matt",
          "Nb_Reviews": 1,
          "Date": "2022-08-20T01:32:19.000Z",
          "Titre": "The Best Sabers Around",
          "Contenu": "I can not say enough great things about Dxsabers. The quality of the sabers are incredible, the blades are durable and the hilts are a great quality metal. The sound effects are authentic, and the variety of colours allows you to feel like a Jedi or Sith or anything in between. I should also mention I had a slight issue with my order so I promptly reached out to them to check in. I can safely say they wanted to do everything they could to make the situation right and they did just that. They have amazing customer service and I would not hesitate to reach out to them again.If your considering purchasing a saber, I highly recommend Dxsabers. You will get an excellent saber in return for a great price that is ready for display or combat."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sam",
          "Nb_Reviews": 1,
          "Date": "2023-01-23T05:39:49.000Z",
          "Titre": "DxSabers Amazing Product! Amazing People!…",
          "Contenu": "DxSabers is dialed into their consumer base and know how to cater to their customers while still keeping their prices low. The attention to detail on their product AND their service is what sets them apart. I will be going back very soon!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stella",
          "Nb_Reviews": 8,
          "Date": "2023-03-29T21:37:04.000Z",
          "Titre": "Best Customer Service",
          "Contenu": "I bought the Reva’s Revenge staff or double saber. I let them know there was a minor issue with one of the sabers. They literally sent me a replacement without a blink! And fast!!  I didn’t have to argue or debate at all. Their customer service was beyond what I would have expected. I Will absolutely buy from them again!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rachel",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T23:17:27.000Z",
          "Titre": "Amazing",
          "Contenu": "This was my first experience purchasing a lightsabor and I couldn’t be happier! My Mara Jade replica is gorgeous! I’m not sure who squealed loudest when we first lit it up, me or my kids."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Robert Richardson",
          "Nb_Reviews": 1,
          "Date": "2022-11-04T12:32:16.000Z",
          "Titre": "Great company, amazing products!",
          "Contenu": "They have an amazing team who really do care for the products they're making. Always going above and beyond to provide excellent customer experience. The quality and finish of the sabers they sell are astonishing!"
        }
      ]
    }
  ]
}