{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.pitbullaudio.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "CEO KILLER",
          "Nb_Reviews": 4,
          "Date": "2023-06-30T22:57:07.000Z",
          "Titre": "Bought a Tascam cd recorder",
          "Contenu": "Bought a Tascam cd recorder, they said it was B stock, got it and the inside was making noises of loose parts. The top cover had damage. Open it up and the cd mechanism was loose. Called Tascam and they said they don’t sell B stock items or even sell anything like this. Yet Pitbull claims they are from Tascam, hmmm I wonder who’s lying? These were boxes of players in a pallet more than likely that got dropped or some violent mishap. They probably got it from insurance write off after sales. F you Jew"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Williams",
          "Nb_Reviews": 2,
          "Date": "2023-07-06T21:16:26.000Z",
          "Titre": "The amp i purchased was not new as…",
          "Contenu": "The amp i purchased was not new as advertised and was dead on arrival"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daling Xu",
          "Nb_Reviews": 1,
          "Date": "2022-09-23T18:09:40.000Z",
          "Titre": "Very disappointed with Pitbull Audio and Roland",
          "Contenu": "I purchased a Roland AE 20 from Pitbull Audio website in late August.After I received the instrument, I watched all the online tutorial videos and used Roland AE Lesson app on my phone to confirm that I am using the right fingering.  But the instrument is stubbornly off pitch, e.g. when I pressed the keys for E4 and F4, my tuner shows the sound from the instrument is B5 and C5 respectively.   At the same time other keys are fine with the right sound pitch.I contacted Pitbull Audio customer service, they told me to contact Roland directly;  I tried to contact Roland, but there is no phone call or live chat support available;  I tried to set up a video call support session, it was cancelled with no reason.So I paid ~$1000, and now end up with an off pitch instrument in my hand.  Very frustrated and disappointed.The only lesson I learned is not to buy on line from now on; If it's a local store, I can at least drive to the store to ask."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "D.T",
          "Nb_Reviews": 1,
          "Date": "2021-12-12T01:25:52.000Z",
          "Titre": "Poor customer service",
          "Contenu": "I ordered an item that was shipped and lost by FedEx.   Pitbull did not send out a new item and left it on me to deal with the shipping issue.  It was very disappointing and frustrating dealing with their customer service.  I will not order from them again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeffrey Freer",
          "Nb_Reviews": 1,
          "Date": "2023-02-13T00:18:39.000Z",
          "Titre": "Buckle on the feet instead of black no…",
          "Contenu": "Buckle on the feet instead of black no black screws I will find my own at Daytona nut and bolt they have them"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Faith Soares",
          "Nb_Reviews": 23,
          "Date": "2021-09-11T03:44:24.000Z",
          "Titre": "The audio is not functioning very well"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Johnathan Mitchell",
          "Nb_Reviews": 1,
          "Date": "2020-06-07T20:37:37.000Z",
          "Titre": "Pitbull Audio sent me a broken guitar",
          "Contenu": "Pitbull Audio sent me a broken guitar.  When I called to let them know, they asked that I send it back for a refund.  The guitar was apparently damaged during the return shipping process and they refused to give me a refund.  They accused me of damaging it and never addressed the fact that they sent me a broken guitar to begin with.  It's been months now and I don't have a guitar or my money back.  Avoid this place!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Will Caldwell",
          "Nb_Reviews": 1,
          "Date": "2020-06-13T01:16:16.000Z",
          "Titre": "There was no opportunity to review…",
          "Contenu": "There was no opportunity to review purchase after returning from Paypal's page. I immediately emailed customer service and the email receipt I got asking for the order to be canceled. No response. A few days later I got another email saying that my purchase shipped. Super annoyed. Apparently their customer service doesn't exist."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brandon Curry",
          "Nb_Reviews": 1,
          "Date": "2019-10-24T12:44:28.000Z",
          "Titre": "Pitbull Audio violates their own Policies",
          "Contenu": "Pitbull Audio violates their own policies, if you buy a defective from them they will charge you a restocking fee simply because their business can’t handle taking back defective items that they will be fully reimbursed by the manufacturer. I would absolutely recommend to anyone NOT to order from this company unless you want to get screwed when your item doesn’t work and you have to order from a more reputable company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paras G.",
          "Nb_Reviews": 4,
          "Date": "2019-09-11T18:13:24.000Z",
          "Titre": "I contacted them for a return and buy…",
          "Contenu": "I contacted them for a return and buy another Cajon and they did not respond. I emailed them and also gave my direct contact # so I can talk about the return and the new buy. The rep emailed with a response that I would receive a call tomorrow.... and that tomorrow has not arrived yet. I usually do not give bad reviews but, sorry to say, this is really very poor customer service."
        },
        {
          "Note": 1,
          "Lieu": "BR",
          "Pseudo": "Roberto Cesar Massarenti",
          "Nb_Reviews": 2,
          "Date": "2021-02-18T22:16:40.000Z",
          "Titre": "The shipping method choiced by Pitbull…",
          "Contenu": "The shipping method choiced by Pitbull Audio does not work because that is not have space on the airplane to send the package. So I wait to send for 4 weeks. But I receive other packages that I bought after that, for USPS shipping as more cheaper and more sized than this one"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Jack Fowler",
          "Nb_Reviews": 1,
          "Date": "2017-11-09T05:44:38.000Z",
          "Titre": "No communication whatsoever, poor service.",
          "Contenu": "Purchased a set of speakers for $600 and they’re dud. Tried contacting pitbull audio to either help me troubleshoot the problem or send the speakers back and the only contact i have received is this request for a review. Very poor service and very frustrated, if contact isn’t made soon i’ll be going through paypal and getting my money back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jerry Mcmackin",
          "Nb_Reviews": 2,
          "Date": "2018-01-02T02:12:32.000Z",
          "Titre": "Bad experience",
          "Contenu": "Paid extra money for 3 day shipping that I didn't get. When I finally did get my order one of the strings in the set was wrong and they wouldn't do anything about it! I had to call the manufacturer of the strings my self and get a replacement. Will never order from again!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Frank Hoffmann",
          "Nb_Reviews": 1,
          "Date": "2018-06-18T05:59:25.000Z",
          "Titre": "The company has been extremely slow and…",
          "Contenu": "The company has been extremely slow and nonresponsive about refunding money for a defective guitar return.  Despite verification from USPS that  item was received, after 4 weeks Pitbull still hadn't issued a refund.  Furthermore, they exhibited lax quality control in sending out a guitar with broken parts (clearly not caused by shipping), and engaged in fraudulent activity by issuing me an invoice lacking Reverb sponsorship (I had discovered the company's product through Reverb, and we had initially communicated and agreed upon a price through that platform)."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Angry in NY",
          "Nb_Reviews": 3,
          "Date": "2019-03-08T05:46:31.000Z",
          "Titre": "This company needs to require…",
          "Contenu": "This company needs to require signatures upon delivery.  Someone stole my package and apparently there was no insurance provided or signature necessary. As a result I am out $87 and this company has offered no chance of any remittance."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Don",
          "Nb_Reviews": 1,
          "Date": "2019-04-02T15:07:52.000Z",
          "Titre": "There is no customer service & the…",
          "Contenu": "There is no customer service & the return department NEVER ANSWER THE PHONE !!the worst service iv EVER Had in my life they only answer the phone when your buying something  otherwise I don't answer it !!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hillary Sanford",
          "Nb_Reviews": 1,
          "Date": "2018-05-26T13:22:28.000Z",
          "Titre": "fraudulent activity",
          "Contenu": "I received some kind of equipment in the mail from Pitbull audio. There was no receipt. I did not order it, but my credit card was charged 349.00. I don't know how I can return it without a receipt. Not cool."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Laura",
          "Nb_Reviews": 4,
          "Date": "2021-01-28T20:08:52.000Z",
          "Titre": "Everything was going well and my item…",
          "Contenu": "Everything was going well and my item arrived in the UK very quickly. However, due to a Fedex error, a Big error, my $800 bass guitar I ordered for my partners birthday was left on my doorstep and alas, was not there when I arrived home. FedEx acknowledged this error and said they would process the claim with pitbull and to contact them for my refund. A month later and all I have back is multiple rude messages off a lady named Frances, now I'm getting no reply at all and I still don't have my money back even though FedEx ha e authorised and informed the claim has been processed to Pit bull. Disappointed and angry is an understatement, the 1 star is purely for the shockingly poor customer service from one Frances Green, who is apparently a customer relations manager!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hunter Hutchings",
          "Nb_Reviews": 1,
          "Date": "2017-02-15T03:40:08.000Z",
          "Titre": "poor customer service",
          "Contenu": "I ordered a product based on an image that was not the product i received. Pitfall audio has not returned any of my emails regarding the purchase, I hope they fix the issue soon."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andrew Ferrell",
          "Nb_Reviews": 2,
          "Date": "2017-03-21T16:29:10.000Z",
          "Titre": "Serato Software",
          "Contenu": "I purchased the Serato Software, from Pitbull Audio for $99 and only received the free trial. I also sent an email stating my problem and I'm yet to receive a reply."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shannon Connell",
          "Nb_Reviews": 3,
          "Date": "2019-12-19T00:51:08.000Z",
          "Titre": "Very Poor Quality of Service",
          "Contenu": "Poor customer service. We ordered a guitar online and their shipping methods made it impossible to pick up the order at a location and it seems they expected me to take a day off of work to sit at my apartment to wait for an in person signature. Manager AJ told me it was my fault for not being home at 10 on a weekday and told me he would fix it with FedEx. FedEx said they had no record of any changes to the account and said the guitar would be shipped back. I ordered this on 12/10 and on 12/18 we were told it was being shipped back. This was a Christmas gift and now we were left with no guitar and a canceled order. I feel we were misled by staff members several times and AJ said that everyone else was wrong about the situation and he was correct. He would not acknowledge mistakes that his staff had acknowledged and told me that things had been taken care of when they had not been. Very poor choices and very poor service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark Aulick",
          "Nb_Reviews": 1,
          "Date": "2020-12-10T16:04:21.000Z",
          "Titre": "I bought a Gemini speaker from Pitbull…",
          "Contenu": "I bought a Gemini speaker from Pitbull audio, it was delivered on November 3. I used it on November 6, it seemed to work fine during the sound check. I did not need it again until December 4, which would be its second time in use. During the sound check, it was easily discerned that there was no high end coming from the unit. Apparently either the horn or the crossover had blown. As this speaker was rated 2000 W, well above the ratings of my other speakers, I do not believe there was too much signal fed to it. I contacted pitbull audio on December 5, they told me I had no choice but to go to the manufacturer, as it was beyond their 30 day return policy. Gemini will accept it back for repair, but only if I pay shipping. In the meantime, I will have to buy another speaker, as I cannot wait for this one to be repaired, and then pay for shipping to repair a speaker that I will no longer need. As a struggling musician who has had half of his 2020 gigs canceled this year, I am very disappointed that neither the vendor nor the manufacturer is willing to help. My advice is to not buy Gemini, nor to buy from Pitbull audio."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2018-06-09T05:01:04.000Z",
          "Titre": "Never shipped my order",
          "Contenu": "Never shipped my order. Would not reply to calls or emails. Plenty of better companies out there. Avoid at all costs."
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2017-11-08T16:56:48.000Z",
          "Titre": "They always close my orders",
          "Contenu": "They always close my orders, and they take a long time to answer my questions. I couldn't buy anything with them."
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "Mora",
          "Nb_Reviews": 1,
          "Date": "2017-10-07T15:12:32.000Z",
          "Titre": "Cancelled shipment but made the charge",
          "Contenu": "Gave me a shipping tracking number but cancelled it with out notice. I had to go to the bank to get my money back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gerald Hawkins",
          "Nb_Reviews": 1,
          "Date": "2016-08-10T21:38:06.062Z",
          "Titre": "Never received what I paid for",
          "Contenu": "Wish I wasn't cheated out of the purchase price!  Never received what I paid for！"
        },
        {
          "Note": 1,
          "Lieu": "AT",
          "Pseudo": "Robin W",
          "Nb_Reviews": 1,
          "Date": "2015-07-27T18:21:41.696Z",
          "Titre": "Very bad",
          "Contenu": "Very bad experience with custom service, keep you away from this company."
        },
        {
          "Note": 1,
          "Lieu": "CO",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2017-06-05T16:48:48.000Z",
          "Titre": "unacceptable experience",
          "Contenu": "unacceptable experience, unreasonable and rude conduct."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "pavel shtevnin",
          "Nb_Reviews": 2,
          "Date": "2019-05-10T22:52:21.000Z",
          "Titre": "Not recommended to anyone to buy from…",
          "Contenu": "Not recommended to anyone to buy from this seller"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ron Lowe",
          "Nb_Reviews": 1,
          "Date": "2023-03-08T07:01:29.000Z",
          "Titre": "Sales / customer service",
          "Contenu": "Sales, Shane was helpful and knowledgeable. I ordered the Sire V10 Marcus Miller T S with Gold tuners and knows , fast shipping, I was playing out that weekend and really wanted to play my new bass, however to my surprise when opening it was the wrong bass guitar, Customer service Ariel sent me a return label,  5 days passed,and I was told it still was NOT inspected and it would probably be the next day to look at it, plus days to ship it out to me. So,, I canceled my order."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Matt Steele",
          "Nb_Reviews": 1,
          "Date": "2022-11-04T03:46:27.000Z",
          "Titre": "Mixed - awesome service but messed up guitar",
          "Contenu": "Website had some issues but called and got some awesome service from the salesperson to get my order all settled. Was quite happy as was told would take a day or so before ships as they do a full inspection and setup of the guitar. When it arrived I was shocked to find the guitar unplayable. Neck had no relief at all/lot of back bow and the lower strings were in contact with the fretboard just sitting there. I called and was told to call back in few days when tech who supposedly did setup would be there. Guitar was driving me crazy just sitting there, plus wasn't keen on the idea of having to ship it back for repair, so decide to spend those few days working on it. After MANY hours of adding relief, letting neck relax and then continuing to adjust the guitar is functional now. Still not great, so may have to contact ESP about the issue. Really wish experience could have been more positive."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jay Dewitt",
          "Nb_Reviews": 1,
          "Date": "2020-11-18T20:15:53.000Z",
          "Titre": "The product arrived on time and was…",
          "Contenu": "The product arrived on time and was accurate.  Unfortunately, customer service is non existent.  I tried to email and call Pitbull Audio, and have not received a response.  I contacted the manufacturer directly, and my questions were quickly answered.  I wish Pitbull Audio could have don the same."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Not a great experience",
          "Nb_Reviews": 6,
          "Date": "2021-03-03T19:29:03.000Z",
          "Titre": "Meh... 👎",
          "Contenu": "The seller refused to throw in a $4 pack of strings (his cost) on a $2200 guitar. Then after the purchase I was informed the (factory new) guitar was broken and had to be sent back to the factory. They shipped it back and the manufacturer repaired it- finally it shipped a month later. I have bought from PB before, and I believe I just got the wrong salesperson. Did they have what I wanted? Yes - did I get a good price? Yes, but it was overall a miserable experience and there are many others looking for business in this climate that know what’s up."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2017-02-04T22:54:46.000Z",
          "Titre": "Guitar setup...case scratched",
          "Contenu": "Sent an email to Pitbull about an ESP Signature guitar I ordered from them.  Never got a response back.  Received the guitar in the case.  The case was scratched.  There wasnt even an attempt at setting up the guitar....action was high but tuned to pitch.....  I had to get a luthier to level/dress the frets & the reinstall the pickup.  All this for a $1k guitar."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Francisco J. Ramirez",
          "Nb_Reviews": 10,
          "Date": "2017-01-10T20:50:06.000Z",
          "Titre": "Customer Service",
          "Contenu": "I was very glad to find BareKnuckle pickups, but starting from glitches in the website when ordering, and then trying to call several times during the day with no answer, after all that I decided to call a salesperson but he was \"too Busy \" , ok one more calll, he had no interest in helping me out with another item, never call back, I ordered delivery overnigh (which I paid  for), 4 days....I wasted half a day dealing eith a simple purchase, no apologies of any kind."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kaw Liga",
          "Nb_Reviews": 1,
          "Date": "2020-09-01T17:24:36.000Z",
          "Titre": "Checkout fail?",
          "Contenu": "Wanted to do business. Checkout was one of the lamest experienced. Spun over and over.Could not get to conclusion with credit card so switched to PayPal. Another fail...actually gave up and bought product from another vendor, who also included a high quality brand name 20 ft. Instrument cable for the same amount Pitbull charged (without sales tax btw). Competitor's merchandise arrived the next morning, and it was surprising to see a Pitbull purchase and shipping confirmation about the same time. I generally I prefer to buy from you when possible. Hope this was a one-off. I will keep duplica"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dolores  Berger",
          "Nb_Reviews": 1,
          "Date": "2021-12-01T15:31:57.000Z",
          "Titre": "I ordered 2 sets of guitar strings .",
          "Contenu": "I ordered 2 sets of guitar strings .I was charged and was sent 4 sets of strings"
        },
        {
          "Note": 2,
          "Lieu": "VE",
          "Pseudo": "Jose",
          "Nb_Reviews": 1,
          "Date": "2016-07-03T13:43:30.000Z",
          "Titre": "Payment Gateway",
          "Contenu": "Due to a misjudgement of the payment gateway a good shopping experience is completely ruined."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Edgetone Studios",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T20:10:37.000Z",
          "Titre": "Great bass, poor setup",
          "Contenu": "The bass is wonderful, and shipping was quick. But I was sent an email that there would be a full setup before it was shipped. The tuning at the 12th fret was the worst I have ever had on any bass purchase, even used items. Especially the D and G strings. I ended up having to pay for a local setup afterall."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jx",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T16:49:34.000Z",
          "Titre": "Great deal, bad packaging",
          "Contenu": "Got an amazing deal on a guitar however, the packaging was very poor. They threw my new guitar in a large box with one small piece of bubble wrap to \"protect\" it. And by small I mean, it had to be about a 6in by 6in square piece. If you've ever had anything delivered by UPS or FedEx you know how they work. I expected a bit more safety and caution from a company that sells music gear and equipment and don't know if I'd order from here again given how they handled the packaging."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Frederick Westcott",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T18:50:06.000Z",
          "Titre": "PRS guitar, cost me $85 to fix.",
          "Contenu": "I ordered my PRS guitar, when it arrived it looked fine, I went to change the strings and discovered that the tail stop was defective, the  ball end of the low E string kept slipping out of it, instead of going through the trouble of shipping it back, I bought a new PRS tail stop online and installed it, now the guitar is fine.. although it cost me an extra $85 to fix.. aside from that, the guitar looks great, and plays great..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ryan Crawley",
          "Nb_Reviews": 1,
          "Date": "2022-10-03T22:20:10.000Z",
          "Titre": "Sent wrong product",
          "Contenu": "I ordered mogami cable and was sent the wrong size. It cost me a good deal of time making it hard to get my pedalboard wired up with patch cables. I was given a return label to send the wrong cables for the right ones. Still awaiting correct parts. I understand problems happen but this was an unfortunate problem for my first order from Pitbull."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Vince Harris",
          "Nb_Reviews": 1,
          "Date": "2022-05-03T19:09:29.000Z",
          "Titre": "The correct product was sent and works…",
          "Contenu": "The correct product was sent and works great, however when I called this order in I told them I needed it shipped THAT day to arrive in time for my installation.  After being promised it would it was not shipped until the next day.  This held up our installation by one day which really caused some issues."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "H Newmanous",
          "Nb_Reviews": 1,
          "Date": "2023-06-03T05:10:22.000Z",
          "Titre": "the salesman inadequately described the…",
          "Contenu": "the salesman inadequately described the action of the guitar, thus the return.... otherwise shipping was prompt & return was easy..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "SD Guy",
          "Nb_Reviews": 1,
          "Date": "2022-04-05T16:08:52.000Z",
          "Titre": "Fender makes some great guitars.",
          "Contenu": "Fender makes some great guitars. Fernando was excellent to work with. Others not so much."
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "Aeliz",
          "Nb_Reviews": 2,
          "Date": "2016-06-01T07:45:21.000Z",
          "Titre": "Mind custom fees!",
          "Contenu": "Product is exellent, website clear to use, payment on line done properly, packcage well wrapped, these are the good sides.The bad side is the price of international shipment which doesn't include, or even just mention to add customs fees. I wouldn't have bought the product if I had known in advance their cost of 43€."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MICHAEL CAMPBELL",
          "Nb_Reviews": 1,
          "Date": "2021-02-02T18:45:22.000Z",
          "Titre": "I only give this a 3 star because I…",
          "Contenu": "I only give this a 3 star because I purchased this on Sunday needing the items by the following week for our Church praise team. They didn’t ship until Tuesday which made the items late and not arrive until after the weekends church services."
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "devon",
          "Nb_Reviews": 3,
          "Date": "2018-07-18T18:52:46.000Z",
          "Titre": "wish i could of give more  3 stars but…",
          "Contenu": "wish i could of give more than 3 stars but i'am only giving a ratings base on  my package being delivered on time an a great discount received that i just had to purchase another item because the prices was to hard to beat but the only sad part is my item was ship to my brother in the states because i live in the caribbean an he had a break in so i'll never get to know if my product was in good condition or even working so i can't  give a review on that but anyway thanks pitbull audio,i will shop again  an the only thing customer service could be a little better"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 1,
          "Date": "2021-06-02T15:57:17.000Z",
          "Titre": "Average price but cheap quality",
          "Contenu": "Price was average but the product was definitely not worth it. It was a cheap version of similar products. I expect it to break with regular use.  The shipping was a bit slower than I expected"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Christian Hansen",
          "Nb_Reviews": 1,
          "Date": "2017-05-19T21:43:13.000Z",
          "Titre": "I did better buying from them on ebay",
          "Contenu": "I did better buying from them on ebay. They sent me a coupon when I bought on ebay so I went to their website to buy directly. At checkout, my coupon was no good. I bought anyway, but probably not again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mary L",
          "Nb_Reviews": 1,
          "Date": "2019-05-02T18:46:32.000Z",
          "Titre": "It looked like a nice guitar..",
          "Contenu": "It looked like a nice guitar... except it arrived broken in two pieces. Whoever packed it threw a guitar (and it’s flimsy fabric case) into a cardboard box with NO packing material, bubble wrap, NOTHING! No replies to emails or calls about returning the product. I was going to give up, but my husband called a third time, this time for the SALES line, and got someone to help him right away. We did get a return label to send it back, and they sent us an a replacement. Thank you, Benjamin! (It was packed nicely this time, too.) What happened with Fedex and the hassle of returning wouldn’t have been so bad if I had just gotten a timely response to my emails/calls. The guitar was a gift for my husband and now that he can actually play it, he really likes it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Victor S.",
          "Nb_Reviews": 2,
          "Date": "2017-09-26T00:19:22.000Z",
          "Titre": "Pitbull looks a nice store, but the website doesn't feel really secure (yet).",
          "Contenu": "Pitbull Audio looks like a nice store, with some cool guitar brands, and they are investing in marketing and awareness. After they released the customer points program, I gave them a try and bought a set of strings. They delivered it on time, safe and sound.But, unfortunatelly, my debt card was hacked 1 day after the purchase, probably through Pitbull website.Well, my bank got the fraud and I didn't lose my money. However, I lost one card and my time calling to the bank, discussing that issue.  I know no one is safe and I can't say that PA was negligent about their website security (maybe yes, maybe not - I don't know). I want to buy again with those guys but I need to feel confidence on Pitbull's website. Anyone else have a similar issue with them or just me?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alex Mijangos",
          "Nb_Reviews": 3,
          "Date": "2023-04-04T07:22:24.000Z",
          "Titre": "Bad Shipping",
          "Contenu": "Shipping was really bad"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "dookusmucus",
          "Nb_Reviews": 4,
          "Date": "2020-06-02T02:05:13.000Z",
          "Titre": "Had an issue with an item so I emailed…",
          "Contenu": "Had an issue with an item so I emailed but received no response. Instead, I went to the manufacturer to resolve the issue. They (Hipshot) were very attentive"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark Center",
          "Nb_Reviews": 3,
          "Date": "2020-09-07T19:41:37.000Z",
          "Titre": "I’m a huge Larry Carlton fan",
          "Contenu": "I’m a huge Larry Carlton fan. I ordered the Natural S-Style as soon as I could. The Pit Bull people were great; answered the phone and e-mails, fast shipping, no issue there.The fit and finish on this guitar is top notch, especially at that price point. The neck is rolled more than I’ve seen a production guitar before, making it super smooth to play. The C shape is swallow which also helps out. The hardware is very good, no issues there at all.The issue is the electronics. The volume pot had the wrong capacitor attached to it, it no longer had the audio taper; setting 1 was the same volume as 10. Also, the pots and the selector switch were a little noisy from dust. When you move the selector switch from position 4 to 5 a very loud CLACK came outta the amp. After I repaired those issues (new pots and a new selector switch) the pickups were a bit weak for my taste, I changed them out to Seymour Duncan’s. Now it’s a kick ass guitar all the way around.Was it worth the money? Yes, at a little less than a $1000 (after the repairs and modifications) it plays and sounds way better than a Fender Professional Stratocaster which costs hundreds more. And, I have a Larry Carlton guitar."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Hatley",
          "Nb_Reviews": 1,
          "Date": "2017-01-20T20:13:30.000Z",
          "Titre": "On time delivery -- but charged twice",
          "Contenu": "They did refund the money.. just wasted time having to send emails and follow up"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steve S.",
          "Nb_Reviews": 2,
          "Date": "2020-08-03T17:30:48.000Z",
          "Titre": "Should of offered me a better discount…",
          "Contenu": "Should of offered me a better discount off of that price range of guitar!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe A.",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T22:57:06.000Z",
          "Titre": "Great guitar",
          "Contenu": "The guitar is great, stays in tune. I had a Fender Strat and hated it, I could never keep it in tune and it had a V neck which I really didn't like, but that's my fault. I had to do some work on the fret ends which I expected and had to put some relief in the neck. I will probably work on lowering the strings a little. All and all this is a great guitar for the price."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brendan R.",
          "Nb_Reviews": 4,
          "Date": "2023-03-10T21:32:05.000Z",
          "Titre": "They provide a fantastic customer…",
          "Contenu": "They provide a fantastic customer service. In my case they facilitated the replacement of an Ibanez bass that developed a cracked neck months after I purchased the it. They were my liaison to Ibanez; I never had to engage Ibanez other than to ship the original bass to them. I can’t ask for better customer service than that."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David E",
          "Nb_Reviews": 1,
          "Date": "2022-03-03T17:09:23.000Z",
          "Titre": "Good stuff",
          "Contenu": "Good service, setup, and shipping. Didnt like that the tools were out of compartment while guitar was shipped! Thankfully no scratches on finish.. Still overall happy with experience and love new guitar. Thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2022-01-03T17:21:00.000Z",
          "Titre": "Great return policy",
          "Contenu": "Great return policy! Helpful and friendly customer service."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Samuel Tiger",
          "Nb_Reviews": 1,
          "Date": "2022-09-21T14:27:02.000Z",
          "Titre": "Ок, i like it",
          "Contenu": "Ok? all good. Servis very baet? timing good."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Wayne Wormald",
          "Nb_Reviews": 1,
          "Date": "2018-10-03T23:21:22.000Z",
          "Titre": "Great seller..",
          "Contenu": "Great seller. Only issue was international delivery- I paid $50 to have pedal delivered ( instead of $20 for a cheaper service) for a priority international service that took longer than other sellers.. at least 2 weeks or longer anyway....  I would recommend just using their cheapest international post option - there’s no point in paying the extra"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "BB",
          "Nb_Reviews": 1,
          "Date": "2015-12-05T22:45:09.408Z",
          "Titre": "Everything was fine, but would have liked package tracking info",
          "Contenu": "Everything went smoothly with the order, but as far as I could tell there was no way to get package tracking info for the items they sent me.  That's pretty standard these days.  Most people are following Amazon's lead and sending out emails saying \"Your package has shipped!\" along with tracking info when the package actually goes out.  Didn't get anything like that from Pitbull."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "D",
          "Nb_Reviews": 1,
          "Date": "2020-08-06T16:16:11.000Z",
          "Titre": "You get the product you ordered",
          "Contenu": "You get the product you ordered. You don't pay sales tax.  You will not get pampered. You will pay market prices. So an experience that most online shopping provides, I gave 4 stars instead of 3 because no tax is collected.  This is not 5 star like Sweetwater, but solid."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Sanjay Bahal",
          "Nb_Reviews": 1,
          "Date": "2015-08-05T21:14:27.000Z",
          "Titre": "precise to the point dealings.",
          "Contenu": "I am residing in India and made my purchase from India . It took a bit of time to  understand the accent but after that it was peice of cake.  I have my sister there in the US who was supposed to bring it.  Shipping and delivery were bang on time. Goods were as expected. Fresh and sealed. Full marks to you guys..hope to catch up soon with more requirements"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dawg",
          "Nb_Reviews": 2,
          "Date": "2021-01-04T18:35:01.000Z",
          "Titre": "Near perfect......",
          "Contenu": "Nice job...delivered quickly....only one flaw (you double billed me!) but after a quick phone call to PBA that was corrected and the funds returned - Big thumbs up to Nikko for the quick response. Good enough to put a bookmark on your web site. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Javier Alvarez",
          "Nb_Reviews": 2,
          "Date": "2016-01-28T00:02:19.804Z",
          "Titre": "Good  service",
          "Contenu": "The buying process was straight-forward and the checkout uncomplicated. I bought a Nektar keyboard controller and It arrived in time and well packed. If anything, I would have liked for the item description to give  precise  information on the accompaning bag, as this turned out to be oversized for the keyboard. Had I known this fact I  probably would have not gone for the package deal. Otherwise the whole experience was good and I am likely to check  here again in the future..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JMB in AZ.",
          "Nb_Reviews": 2,
          "Date": "2018-11-01T20:49:06.000Z",
          "Titre": "Mostly good",
          "Contenu": "Mostly good.  I have very good transactions with Pitbull.   So why not 5 stars?  I recently bought a case for my Helix over a week before I needed it.  After 5 days I had no received any notification of it being shipped so I called.   I was told that item was out of stock.    But it couldn't have been because I was chatting with someone at Pitbull when i bought it and was told it was in stock.  They managed to get it to me in time but if i hadn't called i would have most likely been waiting a very long time.So that transaction brings my rating to 4 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 2,
          "Date": "2015-07-27T19:08:12.000Z",
          "Titre": "Excellent company",
          "Contenu": "Pitbull Audio rocks.  I always try to order from them first, as they have free shipping to HI, and their discount program is unrivaled.  The only reason I gave them four stars is that if it's not in their online store, give up.  You can email in and request a product, and you likely won't receive any communication back, even if it's a product from a line they carry that isn't in their online catalog.  However, if the product is in the online catalog, you won't find a better price, faster shipping, or better discount program anywhere."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "pbinCA",
          "Nb_Reviews": 1,
          "Date": "2017-03-04T17:24:27.000Z",
          "Titre": "Got terrific deal on keyboard",
          "Contenu": "It was a pleasure dealing with Pitbull Audio.   I don't quite get the appeal of the business name, but Shane had exactly what I wanted for a new stage keyboard, and gave me a terrific deal.   I don't live in San Diego, but distance was never an issue."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dave Minor",
          "Nb_Reviews": 1,
          "Date": "2022-03-01T21:33:47.000Z",
          "Titre": "Fernando is great",
          "Contenu": "Fernando is great, always quality service and good communication!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kukui",
          "Nb_Reviews": 2,
          "Date": "2018-12-07T16:33:09.000Z",
          "Titre": "The staff is ALWAYS supportive and…",
          "Contenu": "The staff is ALWAYS supportive and courteous!  I love this place!  They don't always have the gear I want, but they always have what I need!  Pitbull audio reminds me of what music shops were like back in the day."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Manuel Bergher",
          "Nb_Reviews": 1,
          "Date": "2018-10-04T01:20:21.000Z",
          "Titre": "Long shipping time but it came!",
          "Contenu": "Took some time to get item, after estimated time passed and didn't received the item, but after a quick email, it came to me. Good quality by Rode and thanks Pitbull Audio."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Larry McKinney",
          "Nb_Reviews": 1,
          "Date": "2022-09-06T21:28:00.000Z",
          "Titre": "4 string cigar box guitar",
          "Contenu": "Very good nothing wrong"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 3,
          "Date": "2018-03-01T18:31:46.000Z",
          "Titre": "Mostly Good",
          "Contenu": "Pedal Box came dusty and with signs of tape removal. Everything else was great, shipment was fast and item was as described"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "christian nadeau",
          "Nb_Reviews": 1,
          "Date": "2015-12-12T19:26:25.021Z",
          "Titre": "ESP eclipse E-II cherry sunburst (B-Stock)",
          "Contenu": "i receive my guitar, its a nice guitar ,very fast shipping,\rthanks Pitbull Audio!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Posada Jr",
          "Nb_Reviews": 2,
          "Date": "2016-07-13T20:35:54.000Z",
          "Titre": "Awesome",
          "Contenu": "Great customer service - this place is a musicians and DJ's candy store."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "julius davis",
          "Nb_Reviews": 1,
          "Date": "2016-08-09T17:21:15.695Z",
          "Titre": "Great Company",
          "Contenu": "Works with you on freaking the right equipment for the money you have."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Peter Griss",
          "Nb_Reviews": 1,
          "Date": "2017-02-19T12:05:23.000Z",
          "Titre": "Comunication...?",
          "Contenu": "While my stay in the Gem&Mineral show in Tucson this year I finally decided to fullfill my dream of a 12string guitar and found the Godin A12 on the Pittbull Audio website. I sent an offer of 750$ instead of 799$, which was accepted with the offer of an additional hardcase, if I would pay $ 799.As I had to take the guitar on 3 different flights back home to Germany I was happy to get the case instead of the gigbag the A12 comes with originally.Guitar arrived within a few days and I am still happy with it. The case seemed to be a problem as they didn't find any where the A12 fitted in and finally decided to order the original Godin hardshellcase in Canada and I would be informed about the tracking number... After a week or so I asked by mail what happened to the case as I never received a tracking number. \"I'll check status now\" was all I got for another few days. And then the day of my departure arrived and so I sent another mail to all the Pittbull contacts I had so far asking what happened in the end with my case and if they will credit the difference of 49 $. All I got was an forwarded mail from one guy to another as my address was in the header as well asking if he has any info about the case. Till today nobody apologized about anything but (!) the 49 $ arrived on my creditcard account and the A12 arrived with me in perfect condition in Cologne, even if United urged me on one flight to let them carry the guitar with other dropped off carry-on's. So in the end - all fine - but very poor comunication!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas Kahelin",
          "Nb_Reviews": 2,
          "Date": "2018-02-06T14:08:03.000Z",
          "Titre": "Had a good experience and will shop …",
          "Contenu": "Had a good experience and will shop here again"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kenneth Pack",
          "Nb_Reviews": 1,
          "Date": "2017-01-18T22:46:37.000Z",
          "Titre": "Fast",
          "Contenu": "Fast delivery"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 4,
          "Date": "2023-12-18T23:04:47.000Z",
          "Titre": "Multiple Seamless Orders",
          "Contenu": "I've ordered multiple times (3 or 4) from Pitbull Audio and never had any problems. They ship promptly, have good deals, and a solid rewards program too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Howard Rosario",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T02:47:56.000Z",
          "Titre": "Best place online to purchase any of…",
          "Contenu": "Best place online to purchase any of your music needs!They know their stuff! You can talk to any associate. They are very courteous and attentive to your needs! As for the REWARDS points, you never lose them! You just accumulate them and use them when you need them! They also run specials deals throughout the year! Thanks Pitbull Audio! Keep up the GOOD work!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Dicosmo",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T20:19:12.000Z",
          "Titre": "Caleb Bishop was my sales person and he…",
          "Contenu": "Caleb Bishop was my sales person and he went far and beyond to help me get the right Guitar. He gave me a great deal and was very helpful. He made sure everything went according to plan. I can be a pain in the butt sometimes, but he was very understanding, and made my buying experience a great one."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Williams",
          "Nb_Reviews": 6,
          "Date": "2023-12-05T20:16:18.000Z",
          "Titre": "Smooth sailing buying a guitar",
          "Contenu": "Pitbull Audio is just super reliable with shipping and sales support. I recently ordered a Schechter guitar and it arrived in perfect shape in record time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick Hicks",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T21:25:09.000Z",
          "Titre": "The Best music Store In 50 years of buying Music",
          "Contenu": "I have been buying from music stores for over 50 years, as a consumer, as an employee in sales, and teaching.Pitbullaudio is the best Music Store, by far, I've ever dealt with . Three cheers for Shane, Santino, and AJ.Peace,Rick Hicks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom Jones",
          "Nb_Reviews": 3,
          "Date": "2023-12-06T20:02:49.000Z",
          "Titre": "Great place to get gear!",
          "Contenu": "Good discounts, gear arrived super fast, and the point system keeps me coming back!"
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Fabio Lima de Siqueira",
          "Nb_Reviews": 3,
          "Date": "2023-12-05T12:00:41.000Z",
          "Titre": "excellent",
          "Contenu": "excellent ! the better price for this item on the market. Fast shipping. I recommend 100% ! Thank you !!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Fay",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T23:10:43.000Z",
          "Titre": "Great transaction, perfect gear",
          "Contenu": "Great transaction. Gear was exactly what I was expecting. Packaging was A+. Will buy from again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Allen Bui",
          "Nb_Reviews": 3,
          "Date": "2023-10-24T20:01:09.000Z",
          "Titre": "These guys will set you up solid.",
          "Contenu": "These guys will set you up solid.I've purchased a few times from Pitbull Audio now and I'm always happy with the service here. While sometimes things can go wrong with manufacturers and QC they've done what they could to set things right.Not to mention the deals you can find here are great. Definitely keep an eye out on their online limited-time deals or mystery deals of the week. 5% back in rewards as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "C Dennis",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T21:17:25.000Z",
          "Titre": "Always get what I've purchased in just…",
          "Contenu": "Always get what I've purchased in just a couple days. Good selection of products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sean Mack",
          "Nb_Reviews": 4,
          "Date": "2023-12-05T20:31:17.000Z",
          "Titre": "Fast service, Great Pricing, Quality Products",
          "Contenu": "Fast service, great price. Appreciated the quick shipping and great service. Will definitely recommend them to others."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Slape",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T22:59:58.000Z",
          "Titre": "Best Place to Shop for Music Gear",
          "Contenu": "Easy to navigate and find the gear I was looking for. Great payment options!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trent Brooks",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T13:54:02.000Z",
          "Titre": "Go with Pitbull Audio!",
          "Contenu": "Pitbull Audio has always been a great resource for sound equipment and like purchases. They are like having my own fully stocked warehouse of gear. Their sales department is always eager to help, and on the rare occasion I've needed to return something, they are very easy to work with. I'm a customer for life. -Trent BrooksThe Trent Brooks Band"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gilbert Moya",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T23:05:47.000Z",
          "Titre": "Purchased a Spector NS Dimension 4…",
          "Contenu": "Purchased a Spector NS Dimension 4 B-Stock and to this day I still cannot find why it is a B-Stock. The pictures were spot on with the bass, shipping was quick and received a nice discount on it. That was my third purchase with Pitbull Audio and I will definitely be purchasing from here again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 2,
          "Date": "2023-08-02T13:47:03.000Z",
          "Titre": "\"B\" stock my foot!",
          "Contenu": "The chat associate was great and gave me a nice returning customer discount as Pitbull always does. They treat the loyal customers well. The D'Angelico that was supposedly \"B\" stock was perfect, not sure why it was considered that because I couldn't find a flaw on it nowhere. It looks, plays, and sounds great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "microlar",
          "Nb_Reviews": 6,
          "Date": "2023-09-05T00:18:52.000Z",
          "Titre": "I was looking for a Suhr guitar and…",
          "Contenu": "I was looking for a Suhr guitar and Pitbull provided me with exactly what I wanted.They have a genuinely nice selection of high-end guitars and gear at competitive prices.The two sales guys I spoke to on the phone were very friendly and knowledgeable.Very satisfied with the experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arthur BJr",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T02:06:57.000Z",
          "Titre": "One very happy Dj",
          "Contenu": "I've looked all over the internet and could not find a pair of new Pioneer CDJ-900 Nexus Table Top Multi Media Player, every site I went to was out of stock and I had to put up with aggressive sales people with Shady sales tactics, then out of nowhere I found Pitbull Audio and I'm so grateful I did. I was very happy to give them my money. I had my players in two days, thanks Pitbull Audio. I will be doing business with you again and I'm telling all my friends who are Dj's too about your company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MICHAEL DAYAN",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T21:19:47.000Z",
          "Titre": "Fernando is excellent",
          "Contenu": "Fernando is excellent! Love working with him!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frankie Uchman",
          "Nb_Reviews": 3,
          "Date": "2023-03-01T22:47:35.000Z",
          "Titre": "Dealing with Fernando at PBA was always…",
          "Contenu": "Dealing with Fernando at PBA was always easy as we stayed in contact concerning the special order I had placed. PBA's policies gave me confidence that I would get the best customer satisfaction throughout our business dealings. They are honorable, true to their word. I'm satisfied with how everything turned out."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Calvin Brown",
          "Nb_Reviews": 1,
          "Date": "2023-07-01T17:58:20.000Z",
          "Titre": "Best price on top quality.",
          "Contenu": "You had the best price for the Yamaha DGX670 keyboard and the sales associate was very good to work with. However, you might consider using a different carrier than FedEx. Several delays and it seemed like it would never get here. BUT, it was free shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony Coppola",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T20:00:37.000Z",
          "Titre": "Jazzmaster player",
          "Contenu": "Is it great upgrade my guitar very easy to install. I do have a Jazzmaster remastered into a rock and roll machine. Put high powered humbuckers made by a Tim Shaw at the neck humbucker number 1neck in the bridge.2  Now hold on I still got it soldered all the harness that you sent me can't wait hear that sweet fender Jazzmaster player."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Tinsley",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T18:26:00.000Z",
          "Titre": "Pitbull Audio. The professional's choice.",
          "Contenu": "Shane made my experience very pleasurable. Great price on 2 5.8 NU>X Wireless kits. Patient and professional customer service. Thanks to Pitbull for making my access to sales and Shane quick and easy not going through a bunch of prompts and call backs that never happen. I own a sound company and am a working bassist. The 5.8 will go out tomorrow on a corporate show for City of Houston on a large stage with the mayor and Congress members in attendance and I have no doubt will be a critical part of my performance. Peace of mind. Guarantee my next purchase will be from Pitbull audio. Thanks so much, Mike."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "faaqna",
          "Nb_Reviews": 1,
          "Date": "2022-06-07T11:33:05.000Z",
          "Titre": "Serious customer service issues",
          "Contenu": "Ordered and paid for guitar online. Email confirms purchase with invoice. No communication on shipping. Waited 3 days and sent email asking for status. Nothing. Finally a message arrives stating that the guitar now isn't in stock. Refund \"memo\" issued, but never credited back to my account. Had to call PayPal to get money back. Worst online experience ever."
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Garrow Peterson",
          "Nb_Reviews": 3,
          "Date": "2023-11-16T11:02:21.000Z",
          "Titre": "This audio store is pure magic for…",
          "Contenu": "This audio store is pure magic for audiophiles! Hoge selection, professional consultants and excellent service. I bought headphones here, the sound quality  exceeded my expectations. We also welcome frequent discounts. Very satisfied!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "michael falaguerra",
          "Nb_Reviews": 3,
          "Date": "2023-06-02T22:38:44.000Z",
          "Titre": "I always have a great purchase…",
          "Contenu": "I always have a great purchase experience with my salesperson Shane.  He is super knowledgeable and helpful.  I will continue to purchase guitars because of Shane.  Otherwise, the experience is just generic.  One point for improvement.  I was about to purchase a PRS Wood Library guitar and prices were raised by $500 on current stock.  This is a bad idea and will turn off your customers who are interested in current items.  You lost my business on an expensive guitar because of this greedy move.  Now, I will NEVER purchase a PRS from Pittbull.  Think about this before you do it again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sebastian",
          "Nb_Reviews": 2,
          "Date": "2023-06-07T04:52:59.000Z",
          "Titre": "Pitbull Audio has been great!",
          "Contenu": "Pitbull Audio has been great! The first time I used them was to purchase a mic system for my specific needs. I recently turned to them again to help me figure out what the best portable PA system would be and they gave me an excellent recommendation. They had the item drop shipped to my house and I ABSOLUTELY LOVE the system they recommended! It is portable and sets up in 2 minutes with the mic system I purchased from them back in 2019."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sal",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T19:57:41.000Z",
          "Titre": "I live in Las Vegas",
          "Contenu": "I live in Las Vegas, so not having to pay taxes on items is awesome.  Shipping is fast and free, plus they have a discount point system that accumulates every time you buy something. Communication is great as well. I'm definitely going to continue purchasing from Pitbull."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nick Nguyen",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T18:32:47.000Z",
          "Titre": "Fernando at Pitbull Audio",
          "Contenu": "Fernando was my salesman. He was very patient with my questions and requests, and took his time in the process of helping me find what I want. In my opinion, Pitbull audio has better service than Sweetwater and Chicago music exchange combined."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carlo Tanori",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T22:17:11.000Z",
          "Titre": "Sire P5!",
          "Contenu": "I ordered a Sire Marcus Miller P5, 5-string bass and received it the next day!   Wow!  I had seen all the positive reviews on YouTube of this instrument and decided to order.  Yes, they're THAT good!  Order one, you won't be disappointed.  And Pitbull Audio, excellent customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T00:49:27.000Z",
          "Titre": "Shopping here is always great!",
          "Contenu": "Shopping here is always great! Products are excellent as described and shipped quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff Moss",
          "Nb_Reviews": 1,
          "Date": "2022-10-04T23:23:54.000Z",
          "Titre": "Phone sales rep was exceptional and…",
          "Contenu": "Phone sales rep was exceptional and very helpful. Purchase was easy and came on the date estimated. Very friendly staff that cares about their customers no matter how much the purchase is. Thank you Pitbull Audio. Will definitely do business with you again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Swagger Guitarist",
          "Nb_Reviews": 4,
          "Date": "2023-05-31T17:24:13.000Z",
          "Titre": "Go-To Gear Store!",
          "Contenu": "Great selection of gear, good prices, incentives (loyalty points, sales, and other promotions), and fast shipping.  Pittbull Audio is always on my list of places to check when I'm in the market for new gear."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roel Hernandez",
          "Nb_Reviews": 1,
          "Date": "2022-12-05T20:58:05.000Z",
          "Titre": "Pitbull audio live chat is 5/5 !",
          "Contenu": "Having a live text really helped me make my decision in purchasing with Pitbullaudio.com! Everything was smooth from setting up my account to making my purchase. Also the point system is really neat, it helps musicians like me by not breaking the bank."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Williams",
          "Nb_Reviews": 6,
          "Date": "2023-02-28T00:33:33.000Z",
          "Titre": "Always a good experience at Pitbull…",
          "Contenu": "Always a good experience at Pitbull Audio. I've placed a lot of orders over the last couple of years, and they are universally well packed, shipped out quickly, and exactly as described. I had to return a couple of defective IK Multimedia guitar pedals and Pitbull was pretty swift about getting it resolved. In particular I have received some pretty big and delicate items without any damage, which is something I can't say for GuitarCenter. I can order cymbals and other gear with full confidence that they will arrive safely."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RON BOSTER",
          "Nb_Reviews": 2,
          "Date": "2023-08-04T16:19:00.000Z",
          "Titre": "Excellent Customer Service",
          "Contenu": "They worked with me on placing my order.  When one item was on backorder, I received updated communication on when to expect delivery.  I couldn't be happier with my purchase.  Ron B."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Judge Holden",
          "Nb_Reviews": 1,
          "Date": "2022-06-05T16:29:53.000Z",
          "Titre": "Excellent Customer Service",
          "Contenu": "I had a good experience with Pitbull Audio. A staff member answered my questions about an instrument, a bass guitar. Then, on the day that I purchased the bass, another staff member emailed and said the instrument would be set up before shipment. Pitbull shipped the next day. Within days,  the bass arrived set up as promised. In short, they know how to do business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher Escalante",
          "Nb_Reviews": 1,
          "Date": "2022-05-31T00:22:23.000Z",
          "Titre": "Pitbull Audio is #1!!!",
          "Contenu": "Pitbull Audio is currently my favorite music store to order from.  Ive always recieved what I ordered and its prompt and well packaged. I really love the fact they have reward points for purchases.  Its a big factor that keeps me from ordering from Amazon or other stores.  Im hoping to make a trip down to the storefront soon to check it out in person!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Desilva",
          "Nb_Reviews": 2,
          "Date": "2023-06-02T06:40:14.000Z",
          "Titre": "5 stars as usual..",
          "Contenu": "5 stars as usual... always have had a great experience dealing with pitbull audio... I have bought 6 guitars , an amp , and multiple smaller items and will continue doing biz with them.."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marty Dobos",
          "Nb_Reviews": 1,
          "Date": "2022-10-05T19:37:01.000Z",
          "Titre": "Caleb was my contact",
          "Contenu": "Caleb was my contact.  I hope I spelled his name correctly.  I've been purchasing music gear for over...I'd better not say...many years.  Caleb was super customer oriented and a very knowledgeable geat consultant.  I was pleased with the service he provided and I will buy more stuff from you without a doubt.   Thanks again for an alternative solution!   Marty"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom Stone",
          "Nb_Reviews": 2,
          "Date": "2023-04-04T03:30:09.000Z",
          "Titre": "I placed an order for a p90 pickup",
          "Contenu": "I placed an order for a p90 pickup. As I continued shopping online I noticed that pup showed out of stock. I called to make sure I bought the last one. The person I spoke with verified the inventory correct and my order would be filled. He personally went and checked the warehouse slot to make sure it was there while I was on the phone with him. I didn’t even ask him to. My first experience buying from Pitbull a very positive one."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 2,
          "Date": "2023-07-04T02:42:04.000Z",
          "Titre": "Pitbull's site was easy to navigate",
          "Contenu": "Pitbull's site was easy to navigate. Strings (two different sets from different brands) were in stock. Check out was a breeze, and receiving the strings in the mail was greatly appreciated!!! Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jordan",
          "Nb_Reviews": 3,
          "Date": "2023-05-04T12:55:24.000Z",
          "Titre": "Excellent store",
          "Contenu": "I've bought from Pitbull Audio multiple times.  Each time, prices are great, selection is excellent, and their shipping is really fast.  I wouldn't hesitate to buy from them again and again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert McDowell",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T00:20:17.000Z",
          "Titre": "Everyone at Pitbull from the sales…",
          "Contenu": "Everyone at Pitbull from the sales staff and tech services are top notch personnel.  Their knowledge is second to none.  What also makes it my go too place is they are only 3 miles away. They usually have everything I really need."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KBR",
          "Nb_Reviews": 1,
          "Date": "2022-11-01T05:55:42.000Z",
          "Titre": "Bought a couple of basses from Ben",
          "Contenu": "Ben Aderson is pleasure to work with. He is attentive and answers all of my questions in a timely manner. He is one of the main reasons I keep going back to Pitbull Audio/Music Store Live. I have bought a couple of basses from them. More recently I acquired a Spector Euro Classic 5. It plays like heaven. It was shipped fast and secured!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harry Moore",
          "Nb_Reviews": 1,
          "Date": "2022-10-04T05:09:41.000Z",
          "Titre": "The purchase was handled quickly and…",
          "Contenu": "The purchase was handled quickly and accurately. The guitar was double boxed with sufficient padding to arrive in perfect condition. This seems to be one of very few retailers for the FGN line of top quality Japanese built guitars."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Austin Lewis",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T18:42:27.000Z",
          "Titre": "Pitbull Audio was fantastic",
          "Contenu": "Pitbull Audio was fantastic. I bought the guitar online. I had special setup instructions and they took care of it for me. They were super helpful and friendly and guitar arrived perfect and setup exactly as requested."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Warlandermusic.com",
          "Nb_Reviews": 1,
          "Date": "2022-11-01T03:07:55.000Z",
          "Titre": "Great Company",
          "Contenu": "Good price, quick ordering, quick shipment and delivery, on a hot new percussion/ sample pad, which was out of stock at most of the other music equipment/ pro-audio/ instrument stores across the country. Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Desilva",
          "Nb_Reviews": 2,
          "Date": "2022-12-06T00:25:25.000Z",
          "Titre": "Satisfied customer…",
          "Contenu": "I've purchased 4 guitars and multiple other items from pitbull audio and have always had a pleasant experience.. infact if I'm looking to buy gear I look here first.. not to mention the amazing loyalty perks they offer.."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryce Purvis",
          "Nb_Reviews": 6,
          "Date": "2023-08-05T00:16:02.000Z",
          "Titre": "A++++ Service every time!",
          "Contenu": "I've been purchasing music gear for a few years from Pitbull. I have never has an issue and would recommend everyone to buy their gear from Pitbull!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Juan Novoa",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T19:42:55.000Z",
          "Titre": "Got a great deal on a great guitar",
          "Contenu": "Got a great deal on a great guitar. The included setup was a great plus, since the guitar felt amazing straight out of the box. I will definitely give them my business again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lance Holland",
          "Nb_Reviews": 3,
          "Date": "2023-12-05T02:56:04.000Z",
          "Titre": "Perfect as always with Pitbull!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "T Ernest McCaslin",
          "Nb_Reviews": 1,
          "Date": "2022-12-04T23:52:25.000Z",
          "Titre": "Excellent Price, Fast",
          "Contenu": "Excellent Price. Fast, helpful, laid back customer service. Quality shipping. Never thought I would buy a guitar through the mail. I was quite impressed. I'm a happy customer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kenneth Jung",
          "Nb_Reviews": 1,
          "Date": "2022-06-04T01:07:23.000Z",
          "Titre": "Great deal",
          "Contenu": "Great deal, fast shipping, and item arrived well packed and in great condition. Never had to try to return anything so I can't speak to that, but as far as my transaction is concerned, Pitbull Audio was excellent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeremy Mendenhall",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T17:49:45.000Z",
          "Titre": "They tend to have new and hard to find…",
          "Contenu": "They tend to have new and hard to find items when others are in back-order or preorder mode. They’ve had what I’m looking for and the shipping is free 2day shipping which I appreciate."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom Stone",
          "Nb_Reviews": 2,
          "Date": "2023-05-13T03:27:21.000Z",
          "Titre": "Great service and product",
          "Contenu": "First purchase from Pitbull was great experience. Only place that had the pickup I wanted. Great price too plus discount for signing up. I ordered it and noticed afterward when I went back to check the description again, it showed out of stock. I called to make sure I hadn’t missed that and was told the order would be fulfilled. While I was on the phone, without asking, the rep went back to the warehouse and checked the slot to put his eyes product. He confirmed I bought the last one. I thought that was cool. It was also packaged great for protection. The pup was awesome as well"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Juan UGLYFINGERS Blair",
          "Nb_Reviews": 6,
          "Date": "2023-09-06T20:49:12.000Z",
          "Titre": "Enjoyable shopping experience",
          "Contenu": "Great service. Item was packed well and I received it faster than expected. The 10% discount saved me $53. Greatly appreciated! I will buy from them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ROBERT BAGNELL",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T08:36:10.000Z",
          "Titre": "I always enjoy shopping here"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "George  Skoupas",
          "Nb_Reviews": 1,
          "Date": "2022-09-02T09:50:19.000Z",
          "Titre": "I love Cerberus Guitars",
          "Contenu": "I love Cerberus Guitars-Pitbull are an Authorized Dealer and had a sale on the exact Erebus 6-string I wanted. Win Win all around! Thanks for being awesome Pitbull Audio!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim Rowell",
          "Nb_Reviews": 3,
          "Date": "2023-02-02T19:48:43.000Z",
          "Titre": "Great response and communication from…",
          "Contenu": "Great response and communication from the staff.  They did exactly what the said they's do and were perfectly on schedule. I love this guitar!  Overall a great experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeremy",
          "Nb_Reviews": 1,
          "Date": "2022-07-02T00:53:27.000Z",
          "Titre": "Extremely happy with my interactions…",
          "Contenu": "Extremely happy with my interactions with Pitbull Audio so far! Very responsive and wonderful support team, great selection, killer rewards program. Buy confidently and buy often from them knowing you’re supporting one of the best shops in the business."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Victor Marco",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T22:49:35.000Z",
          "Titre": "Perfect feedback",
          "Contenu": "Perfect feedback, the service was very in touch with my questions and doubts. Great performance for sure."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Hill",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T23:13:01.000Z",
          "Titre": "Frenando is the man,",
          "Contenu": "Frenando is the man,Quick responce, attentive, everything in the transaction went smooth.My guitar came packed well and in good order when I recieved it.Brian"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cedric Black",
          "Nb_Reviews": 3,
          "Date": "2023-07-05T21:00:13.000Z",
          "Titre": "This is my second order and I am…",
          "Contenu": "This is my second order and I am definitely a repeat customer! No problems with my order. Everything arrived a lot faster than expected."
        },
        {
          "Note": 5,
          "Lieu": "CO",
          "Pseudo": "Jose Arenas Gomez",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T16:54:01.000Z",
          "Titre": "Amazing customer service",
          "Contenu": "Fernando from Pitbull was beyond fenomenal. He was helpful, patience, gave amazing information and advice. Customer service at Pitbull is topnotch in my experience. I will be back to Pitbull for my next purchases."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julian Velazquez",
          "Nb_Reviews": 1,
          "Date": "2022-07-01T23:41:50.000Z",
          "Titre": "A fun environment for synth and guitar nerds alike!",
          "Contenu": "I’ve bought a bunch of gear from Pitbull Audio, more than I’d care to admit to. And every single experience I’ve had at this store has been excellent. The staff is always helpful, they’ve always helped me get more bang for my buck."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Miguel Cazares",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T15:43:40.000Z",
          "Titre": "Honestly i love this place",
          "Contenu": "Honestly i love this place. Everyone is always super nice. They answer all my questions and dumb or not. I always come out more informed about gear."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Jairo Souza",
          "Nb_Reviews": 1,
          "Date": "2022-11-04T05:55:46.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service, I asked for a discount, I didn't have it, but the owner was very polite Cortez and always explained the reason for the price fees! The store's scoring system is excellent, it's actually a discount for the next purchase.To the store owners, I recommend a better follow-up of the delivery, because this one was very bad, the FEDEX took a long time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike D.",
          "Nb_Reviews": 2,
          "Date": "2023-07-31T15:55:13.000Z",
          "Titre": "Super easy transaction!",
          "Contenu": "The Sandberg bass arrived quickly and in good shape.  Super easy transaction, and it's a great instrument.Thanks very much!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard P",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T20:06:16.000Z",
          "Titre": "Highly recommended company",
          "Contenu": "Excellent product, great price and impressive delivery time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim in Florida",
          "Nb_Reviews": 1,
          "Date": "2022-09-03T00:32:55.000Z",
          "Titre": "Fernando and the guys at Pitbull have…",
          "Contenu": "Fernando and the guys at Pitbull have always been awesome to work with.  Prices are the best I have seen, on just about anything. Even though I'm in Southwest Florida, the gear always gets here really quickly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wade Wilbur",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T18:47:48.000Z",
          "Titre": "My question answered quickly",
          "Contenu": "My question was answered quickly and efficiently. The person I chatted with took care of my issue and we completed the sale all in under 5 minutes! I’m very happy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 1,
          "Date": "2022-11-03T21:35:39.000Z",
          "Titre": "There was a problem with the product…",
          "Contenu": "There was a problem with the product that I ordered... absolutely not the fault of Pitbull, but they handled the refund quickly and painlessly.  I definitely plan to do business with them in the future... great company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PJ Newman",
          "Nb_Reviews": 1,
          "Date": "2023-01-01T00:03:46.000Z",
          "Titre": "As with each of my previous Pitbull…",
          "Contenu": "As with each of my previous Pitbull purchases, I got quick service and the best price. When I had to call customer support, I talked to a real person there in the shop. Can't beat that!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dennis Marshall",
          "Nb_Reviews": 2,
          "Date": "2022-12-02T00:26:18.000Z",
          "Titre": "Pitbull Audio is the best",
          "Contenu": "Pitbull Audio is the best!  Great staff, amazing inventory, excellent policies, fast and free shipping - what's not to love?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Campion",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T20:06:26.000Z",
          "Titre": "Great deal and service on Tele",
          "Contenu": "The company was a good faith negotiator pending their proactive discounted offer for the Telecaster that I was following on Reverb. They did an excellent set up on the guitar after the sale, and provided friendly customer service to me in store."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trevor Gorz",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T20:14:21.000Z",
          "Titre": "Rewards points and fast shipping makes…",
          "Contenu": "Rewards points and fast shipping makes Pitbull my go to gear provider."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeremy Copp",
          "Nb_Reviews": 1,
          "Date": "2022-08-01T16:41:29.000Z",
          "Titre": "I love these guys",
          "Contenu": "I love these guys. I work with them any time I can. I live in San Diego, and it might seem lazy not to drive the 15 miles to go see them. But I call, or order on  reverb, and my stuff arrives the next day. I needed a refund recently...it was my mistake. Easy peasy. Canceled. Refunded within minutes. LOVE them. If I want something new, I'm more often going to their site now rather than reverb...I still get the free shipping, and the price is quite often the exact same."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gregory Spack",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T20:22:56.000Z",
          "Titre": "I had a very good experience with…",
          "Contenu": "I had a very good experience with returning an item that I mistakenly ordered the wrong item and they handled the return and full refund graciously!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TC Spector",
          "Nb_Reviews": 1,
          "Date": "2022-06-01T18:03:29.000Z",
          "Titre": "I couldn't find the Mogami cord with a…",
          "Contenu": "I couldn't find the Mogami cord with a right angle Neutrik Silent Link that I wanted anywhere. I ordered one but was told end of July at best. Found one on the Pitbull site, ordered it and it was at my house in 5 days 30$ less than Sweetwater. I am now a fan!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jack Jackson",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T19:52:17.000Z",
          "Titre": "Great store",
          "Contenu": "Great store. Had a little bit of a shipping hiccup. Customer service help fix the problem quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony M.",
          "Nb_Reviews": 1,
          "Date": "2022-06-04T01:52:17.000Z",
          "Titre": "Morley Wah Pedal",
          "Contenu": "Shipping was prompt, and my order arrived well packaged. I’m very satisfied and will be purchasing from Pitbull Audio again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chad Salls",
          "Nb_Reviews": 2,
          "Date": "2023-09-07T17:51:15.000Z",
          "Titre": "Great product and customer service",
          "Contenu": "Great product and customer service! I will definitely buy strings from here again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greg McKay",
          "Nb_Reviews": 1,
          "Date": "2022-07-01T21:00:30.000Z",
          "Titre": "Pitbull audio was there for us when the…",
          "Contenu": "Pitbull audio was there for us when the other big box stores weren’t. Fernando made it super easy to choose Pitbull,  thanks Fernando!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trustpilot sucksass",
          "Nb_Reviews": 3,
          "Date": "2023-02-02T04:36:59.000Z",
          "Titre": "Always a worry free experience",
          "Contenu": "Always a worry free experience. Fast shipping. Great discounts. Whats not to love about Pitbull?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dennis",
          "Nb_Reviews": 2,
          "Date": "2023-08-04T04:18:24.000Z",
          "Titre": "Pitbull audio is great!",
          "Contenu": "Pitbull audio is great company and have done business with them many times."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike B",
          "Nb_Reviews": 1,
          "Date": "2022-08-02T16:37:43.000Z",
          "Titre": "ESP USA M-II",
          "Contenu": "I purchased a ESP USA M-II and could not be more happy with the guitar and customer service I received. Thank you so much for all your help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John R",
          "Nb_Reviews": 2,
          "Date": "2023-10-02T18:28:11.000Z",
          "Titre": "Fast shipping on a unique product",
          "Contenu": "Fast shipping on a unique product! First time buyer from Pitbull but it won't be the last.I'd give them 10 stars if I could."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pedro Jauregui",
          "Nb_Reviews": 1,
          "Date": "2022-10-06T23:06:18.000Z",
          "Titre": "I'm happy with the purchase …",
          "Contenu": "I'm very happy with the new guitar  ,delivery was fast and a good deal oportunity with this purchase .thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Louis Dunn",
          "Nb_Reviews": 1,
          "Date": "2022-10-06T00:48:16.000Z",
          "Titre": "Five star ⭐⭐⭐⭐⭐ service",
          "Contenu": "Five star ⭐⭐⭐⭐⭐ service. Fast dependable. Received pedal in two days! Will shop again!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Shirley",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T00:45:54.000Z",
          "Titre": "Super friendly sales and customer…",
          "Contenu": "Super friendly sales and customer service! Nice selection of pro gear."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Curt Krouze",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T19:01:09.000Z",
          "Titre": "Provided excellent price...prompt…",
          "Contenu": "Provided excellent price...prompt service and great follow up when I had a small problem. The staff was very friendly and helpful...I will be back!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Len Lochmiller San Diego",
          "Nb_Reviews": 9,
          "Date": "2023-02-06T16:47:25.000Z",
          "Titre": "knowledgeable friendly staff",
          "Contenu": "I had a pleasant experience purchasing from a knowledgeable staff that kept me informed as to order and shipping status ( which was quite fast)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Martin",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T17:01:07.000Z",
          "Titre": "As always",
          "Contenu": "As always, Pitbull and AJ are the best! 10/10 recommended from wherever you are in the country."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ben Gelbard",
          "Nb_Reviews": 2,
          "Date": "2022-06-04T02:38:05.000Z",
          "Titre": "5 stars all round !",
          "Contenu": "Amazing, professional and fast service. Loved it and will 100% buy from pitbull audio again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DonnaS",
          "Nb_Reviews": 5,
          "Date": "2023-10-05T00:51:01.000Z",
          "Titre": "Caleb was GREAT",
          "Contenu": "Caleb was GREAT! He was very patient as we waited for the arrival of a back-ordered item."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Albert Ezell",
          "Nb_Reviews": 1,
          "Date": "2022-11-01T21:58:05.000Z",
          "Titre": "Excellent all around service.A pleasant…",
          "Contenu": "Excellent all around service.A pleasant buying experience.Love the reward points system,it helps on future purchases.👍🏽"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Derek Felber",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T23:18:03.000Z",
          "Titre": "PBA, astounding!",
          "Contenu": "PBA is the source for great gear and deals!  Outside of a place that has sweet water (wink), PBA is the only other place I look."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T01:26:33.000Z",
          "Titre": "Best company for guitars",
          "Contenu": "Got an amazing deal on a bass.  Showed up fast and perfect.  Way better than sweetwater."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arman V",
          "Nb_Reviews": 1,
          "Date": "2022-11-01T21:13:09.000Z",
          "Titre": "World class service from a local…",
          "Contenu": "World class service from a local business! Looking forward to the next order."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim H",
          "Nb_Reviews": 2,
          "Date": "2022-11-03T23:58:41.000Z",
          "Titre": "After Epiphone failed to deliver on a…",
          "Contenu": "After Epiphone failed to deliver on a preorder through Pitbull, AJ really took the time to make my experience excellent."
        }
      ]
    }
  ]
}