{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.newshosting.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Roo Nugget",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T18:26:36.000Z",
          "Titre": "Shady billing tactics",
          "Contenu": "Shady tactics! These thieves tricked me into purchasing a year's worth of their service by listing the MONTHLY price on the payment page and only listing that I will be paying the full year's worth of service in small text down below.  Any company that needs to hide their terms like that are thieves and untrustworthy.  Do not trust this company!  I got a refund but I should not have to ask for a refund!  The sign up process should be clear and plain as day if you have a product that is worth buying!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "AL Stroh",
          "Nb_Reviews": 7,
          "Date": "2023-11-26T02:52:44.000Z",
          "Titre": "Newshosting.com are thieves!",
          "Contenu": "Newshosting.com are thieves! They increased their yearly rate by 24%, and when I asked them to switch me to a monthly rate, they ignored me, so I canceled my account, requested a full refund, they ignore my emails, and I STILL haven't received a refund!DON'T TRUST NEWSHOSTING.COM FOR A MICROSECOND! THEY ARE THIEVES!"
        },
        {
          "Note": 1,
          "Lieu": "BE",
          "Pseudo": "WP",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T10:42:28.000Z",
          "Titre": "Unable to get refund after trial",
          "Contenu": "Unable to get refund after trial. Website to contact support is broken and hangs on captcha. Company not worth your money"
        },
        {
          "Note": 1,
          "Lieu": "BE",
          "Pseudo": "Jg",
          "Nb_Reviews": 5,
          "Date": "2022-11-10T22:21:58.000Z",
          "Titre": "trash service",
          "Contenu": "tried trail version on sep 26, ended it after 2 days and canceled subscription through paypal. got charged 2 weeks later, they refuse to refund because of time passed lol"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2022-01-07T18:38:20.000Z",
          "Titre": "No clear way to look at renewal from…",
          "Contenu": "No clear way to look at renewal from your dashboard. Couldn't figure out how much you will charge me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Dillon",
          "Nb_Reviews": 3,
          "Date": "2023-03-14T21:40:10.000Z",
          "Titre": "newshosting opens and then crashes…",
          "Contenu": "newshosting opens and then crashes within 5-10 seconds---reinstalled and still keeps crashing had this problem before--why does this keep happening?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Unhappy Subscriber",
          "Nb_Reviews": 1,
          "Date": "2021-12-31T18:40:16.000Z",
          "Titre": "I am only giving this one star because…",
          "Contenu": "I am only giving this one star because I am unable to give zero stars. After almost one year of subscribing to Newshosting, I am still unable to post to newsgroups.If you want to post to newsgroups for any reason, this may not be the service for you.Had I known this I would have found a different service. When I signed up I did not see that I would be unable to post for an undetermined amount of time. This should be a two-way service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Astrolo-G",
          "Nb_Reviews": 3,
          "Date": "2021-06-14T14:12:52.000Z",
          "Titre": "I was automatically renewed back in…",
          "Contenu": "I was automatically renewed back in January and did not want to be renewed. I wrote back multiple emails asking for a reimbursement of the new year within 24 hours of this renewal (a reimbursement that I never received) and am now out $100 for a year of service that I won't be using. Not good service in my mind unfortunately. The reason I was canceling in the first place was because download speeds had slowed to a crawl with no explanation. I have since found better providers with the speeds that they claim."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-04-28T19:57:04.000Z",
          "Titre": "This app consumes so much memory that…",
          "Contenu": "This app consumes so much memory that I’ll get a prompt in Mac OS about it. I have seen it hit more than 130 GB! I tried many things but the best solution was to not use the newshosting app at all, and use a free browser based app instead. Still use newshosting for the data connection but not the app."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Dave G",
          "Nb_Reviews": 2,
          "Date": "2021-03-05T19:11:57.000Z",
          "Titre": "Newshosting as a site is fine",
          "Contenu": "Newshosting as a site is fine.  I actually love it.  It's the password setup that is killing me.  I put in my user name (email address) and then tried what I thought was my password.  When that failed I chose forgot password. After getting the change email from Newshosting I carefully entered my new password twice.  Then I tried to log on and was told that username and password were incompatible.  I tried again.  Nothing.  Then after another try I was booted off as |I had tried too many times. This just sucks."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-12-22T15:06:37.000Z",
          "Titre": "Did not allow me to take advantage of…",
          "Contenu": "Did not allow me to take advantage of the black friday deal. Even though I have been a loyal customer for some time. It just left a bad taste and I will no longer be giving my money to a company that does not value thier existing customers"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "David",
          "Nb_Reviews": 9,
          "Date": "2021-12-10T00:49:35.000Z",
          "Titre": "Worked fine on old pc",
          "Contenu": "Worked fine on old pc.  It shows you what you have already downloaded.  But when you move to a new pc - we all do eventually - there is no software way to enable the transfer to enable the new pc yo “ know “ what you have already dl and seen"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "antoniowolf",
          "Nb_Reviews": 1,
          "Date": "2021-12-28T15:00:45.000Z",
          "Titre": "I ask about the price I have to pay for…",
          "Contenu": "I ask about the price I have to pay for another year..they give me a different cost ..I found the real cost when I checked my bank account..call back to you guys….they told me was a mistake the price originally told me…!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Disappointed",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T06:51:24.000Z",
          "Titre": "No notice of impending annual fee!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "User",
          "Nb_Reviews": 5,
          "Date": "2021-01-13T14:38:07.000Z",
          "Titre": "Too much incomplete",
          "Contenu": "Price is good, speed is good, but too many missing pieces of articles.Good price and good speed are useless when there are too many incomplete files.300PB of data stored (over the last 12 years) is meaningless when many of the files are incomplete."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Wayne Plonker Crowe",
          "Nb_Reviews": 74,
          "Date": "2016-05-03T06:01:40.000Z",
          "Titre": "Auto-billing",
          "Contenu": "Changed to one star after it was billed automatically from PayPal. I know I should check for this, but its always a mark of a scummy company if they do this, as they know lots of people will end up paying and never realise or not want it.\r The price is competitive (special offer, which always appears to be available). I no complaints in terms of retention or speeds. My download is always as fast as my connection allows. Importantly they also have a solid client for Linux."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Dave",
          "Nb_Reviews": 1,
          "Date": "2021-08-14T15:59:53.000Z",
          "Titre": "I signed up for an promotional offer…",
          "Contenu": "I signed up for an promotional offer they were running but somehow it  charged me full price, when i contacted support, they admitted the fault and then refused to fix it or refund it as i had already started using the service."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2022-01-01T14:18:12.000Z",
          "Titre": "Cannot use",
          "Contenu": "I cannot use you product because I cannot download the reader or install it , a waste of time and money, and when I try to contact you it appears to be impossible to reach anyone to listen or get back to me!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 3,
          "Date": "2021-12-21T15:15:53.000Z",
          "Titre": "Not all that great",
          "Contenu": "too slow.  Many times end up with empty folders.  hard to tell if file has been previously downloaded.  Takes too many computer resources, especially when assembling parts of a large file."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Andrew",
          "Nb_Reviews": 6,
          "Date": "2018-08-13T13:23:18.000Z",
          "Titre": "Poor",
          "Contenu": "It's poor and doesn't work, I tried repeatedly over months to use it but was never able to use.  Didn't stop them charging and when raised they didn't want to know anything about it, not accountability.Stay clear"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-12-13T19:33:12.000Z",
          "Titre": "Bait and Switch",
          "Contenu": "i joined lifetime renewal, after approval on credit card they changed it to one year and changed the price higher. It didnt show up till after almost two months on account."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-12-28T14:59:57.000Z",
          "Titre": "I have problems with connections",
          "Contenu": "I have problems with connections, and connection reset by peer connections all the time requiring my news client to disconnect and find an alternate server to connect to."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "R Vohra",
          "Nb_Reviews": 14,
          "Date": "2021-12-09T22:08:47.000Z",
          "Titre": "Service is very slow and I went back to…",
          "Contenu": "Service is very slow and I went back to my provider because their services are 1/3rd of the speed as my current one Cubenet has been a better choice for me"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-12-14T01:48:44.000Z",
          "Titre": "Very Slow download speeds.",
          "Contenu": "It is bad when I can dowload torrent data faster than I can from Newshosting, tech support was not alot of help. Will not renew my membership there."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "sam kool",
          "Nb_Reviews": 2,
          "Date": "2021-12-28T19:21:57.000Z",
          "Titre": "availability of new content (software",
          "Contenu": "availability of new content (software, movies, tv shows) has been falling quite a bit since 2019. i will be trying a different news service."
        },
        {
          "Note": 1,
          "Lieu": "JP",
          "Pseudo": "Magikarp warrior",
          "Nb_Reviews": 1,
          "Date": "2020-04-12T05:02:20.000Z",
          "Titre": "Full charge even with free trial. Not clearly in transaction",
          "Contenu": "Full charge even with free trial. Never take money back.Even with a trade is real life not just in internet. Tell customer this is just a free trial. But take them full money for 1 month (10$) for a precharge is totally unacceptable. How dare their take money like that. Even Google just charge 1 $ and refund after several hours, it is just a way for google to check the payment is working or not. Free trial is free, no reason to take 1 month billing like this Newshosting, and when I want to shut down my account, I must tell their supporter how to refund my free trial charge, they tell me must wait after 2 week(or 1 month I dont remembered exactly), funny than ever. That totally a fraud. How I can trust a provider like that, a seller that is not fair and clearly in even their transactionI test with several Usenet provider. But news hosting is the only server cannot acceptably like that."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "NO",
          "Nb_Reviews": 1,
          "Date": "2021-12-28T02:38:00.000Z",
          "Titre": "Failed to create account.",
          "Contenu": "Failed to create account.Got charged on credit card anyway.Can't log support ticket.Scam."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "User",
          "Nb_Reviews": 2,
          "Date": "2021-12-15T12:49:29.000Z",
          "Titre": "Never found anything useful that was…",
          "Contenu": "Never found anything useful that was corrupt from your service. Not worth the service then."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Billy McIntosh",
          "Nb_Reviews": 40,
          "Date": "2021-12-24T12:09:02.000Z",
          "Titre": "Since signing up with Newshosting my…",
          "Contenu": "Since signing up with Newshosting my download rate has dropped from 6.8Mbs to 12Kbs :-("
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-03-15T16:37:49.000Z",
          "Titre": "The VPN included used to be decent…",
          "Contenu": "The VPN included used to be decent until they switched to Privado VPN which is useless."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anthony",
          "Nb_Reviews": 6,
          "Date": "2021-12-15T14:40:29.000Z",
          "Titre": "Not user friendly",
          "Contenu": "Slow.... Limited Access.  Hard to concentrate on and browse newsgroups"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-12-21T14:29:20.000Z",
          "Titre": "I wanted to renew my service and they…",
          "Contenu": "I wanted to renew my service and they gave me nothing but trouble."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-12-22T15:49:56.000Z",
          "Titre": "Never was able to connect to Grabit.com…",
          "Contenu": "Never was able to connect to Grabit.com like I use to"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "coxie",
          "Nb_Reviews": 1,
          "Date": "2021-02-19T18:17:51.000Z",
          "Titre": "Lots of larger files do not download",
          "Contenu": "Lots of larger files do not download. Hundreds are missing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-12-30T20:10:56.000Z",
          "Titre": "The worst subscription service I have…",
          "Contenu": "The worst subscription service I have ever had."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-12-16T21:49:13.000Z",
          "Titre": "Miss a lot of newsgroup",
          "Contenu": "Miss a lot of newsgroupNewsgroup empty"
        },
        {
          "Note": 1,
          "Lieu": "AT",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2022-01-04T00:53:10.000Z",
          "Titre": "Very good performance"
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-10-01T16:16:44.000Z",
          "Titre": "No aftersales feedback"
        },
        {
          "Note": 1,
          "Lieu": "CH",
          "Pseudo": "John doe",
          "Nb_Reviews": 1,
          "Date": "2021-12-31T15:52:06.000Z",
          "Titre": "I don't find a lot of content my friends do on other providers. Very disapointed",
          "Contenu": "I find a lot of"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-12-23T03:44:37.000Z",
          "Titre": "Too expensive."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Tony Cook",
          "Nb_Reviews": 3,
          "Date": "2021-12-17T21:40:01.000Z",
          "Titre": "I am currently locked out of my a/c and…",
          "Contenu": "Problem solved"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "RMA",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T05:31:17.000Z",
          "Titre": "Lousy customer service",
          "Contenu": "So my credit card was lost and I cancelled it.   Newshosting cancelled my login immediately.   I had no way to update the card and for some reason they could not let me on to the system to add a new credit card.   I think they deleted my id and so I could not reset the password.   Lousy response to a simple problem.  They would not give me access to add a credit card.   I like their app, but what should have been an easy thing to resolve has been going on for 2 days and I still can't add a different credit card.   For some reason they cannot let me on to fix the issue."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Derockonroll",
          "Nb_Reviews": 2,
          "Date": "2022-01-05T23:45:24.000Z",
          "Titre": "Terrible search engine",
          "Contenu": "Terrible search engine. No results for popular shows like \"Squid Games\" and \"Yellowjackets\". Usenet has become passe and reflects this, now that people have so many file-downloading options available to them. Torrents for example."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Peter Pride",
          "Nb_Reviews": 3,
          "Date": "2022-01-03T05:19:13.000Z",
          "Titre": "The usenet groups are just ok",
          "Contenu": "The usenet groups are just ok, but the Newshosting software is totally useless to the point that I never use it , it is so bad, I dont understand why you even offer it?I now understand that this is not a real review but an add for trustpilot, to trick users into joining.I doubt that anyone will see this"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-12-23T19:00:08.000Z",
          "Titre": "Disappointed in the handling of the…",
          "Contenu": "Disappointed in the handling of the migration  of lunarpages customers who have been with lunarpages 15+ years. Was forced to a different plan that affected our mail storage. Ended up migrating most e-mail to Apple iCloud mail hosting as a result. We have another account that we will be doing the same for."
        },
        {
          "Note": 2,
          "Lieu": "FR",
          "Pseudo": "LEROY FREDERIC",
          "Nb_Reviews": 5,
          "Date": "2021-12-28T13:45:49.000Z",
          "Titre": "the search engine is not efficient…",
          "Contenu": "the search engine is not efficient enough, it is not possible to search with a criterion for example:Car only without red headlight (car + red -light).The software takes a long time to analyze and decompress the downloaded files."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-12-15T12:58:30.000Z",
          "Titre": "The service works well, but",
          "Contenu": "The service works well. I have been using it for over 4 years. However, recently I needed help from customer service for the first time and had a really bad experience. I plan to try another service now."
        },
        {
          "Note": 2,
          "Lieu": "ES",
          "Pseudo": "jose antonio lozano mateos",
          "Nb_Reviews": 2,
          "Date": "2022-01-07T20:30:39.000Z",
          "Titre": "i only can download 50  mbs and i have…",
          "Contenu": "i only can download 50  mbs and i have got 1 gb/ 1gb :("
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-12-24T03:11:49.000Z",
          "Titre": "The site does not show or have the…",
          "Contenu": "The site does not show or have the advantages it offered until a few years ago.  I believe I have overstayed with the subscription as in as much as 3-4 years."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Matthew Smith",
          "Nb_Reviews": 3,
          "Date": "2021-12-15T13:52:15.000Z",
          "Titre": "Not good",
          "Contenu": "Not good - Not bad.Unhappy about the automatic renewal BS, it's pretty sketchy to do that as a business."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 2,
          "Date": "2021-04-20T13:20:52.000Z",
          "Titre": "Download speed much slower than…",
          "Contenu": "Download speed much slower than expected. No status or explanation of slow downs on website that I could see either."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-12-21T02:23:12.000Z",
          "Titre": "Content and speed is fine but cost is too high",
          "Contenu": "Content and speed is fine, but cost is much more than competitors on the same backbone"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "User of the service",
          "Nb_Reviews": 1,
          "Date": "2021-12-28T19:57:19.000Z",
          "Titre": "The application was changed so that…",
          "Contenu": "The application was changed so that split-file binaries go through a processor-intensive process before showing up in the destination folder.  This process has crashed my computer more times than I can count.  Not only this, but if i cue multiple binaries, the files for each successive download are delayed in propagating until all files in the cue are downloaded and are sent through whatever processor-intensive process they must pass.It used to be that downloaded files appeared almost as soon as the download was finished.  Now, if I am downloading more than 100MB at a time, I can expect huge delays, possibly the lockup or crashing of my computer, and possibly the loss of the files that caused the processing logjam in the first place.I adore the search feature, the completion levels, and most of the features of the application, but now, if I want to download binaries without crashes, I have to go a little bit at a time.Also, as a Mac user, it's unfortunate that Newshosting is again neglecting us by failing to explicitly stating whether or not the news reading app is compatible with the latest OS or the new M1 chip Macs.  The last time I upgraded my OS, the news reader was not updated for a few months.  I was lucky enough to have another computer which I did not upgrade, but it was a hassle to figure out why Newshosting's app did not work."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kyle",
          "Nb_Reviews": 2,
          "Date": "2021-04-28T19:55:19.000Z",
          "Titre": "Software seemed to have some issues…",
          "Contenu": "Software seemed to have some issues finishing downloads without encountering errors."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-12-15T13:06:27.000Z",
          "Titre": "Software still not working on Windows…",
          "Contenu": "Software still not working on Windows 11, Can't save group bookmarks."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "john",
          "Nb_Reviews": 3,
          "Date": "2021-12-16T14:12:14.000Z",
          "Titre": "VPN provider is flakey and disconnects…",
          "Contenu": "VPN provider is flakey and disconnects over 50 percent of the time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joe Lowrance",
          "Nb_Reviews": 2,
          "Date": "2021-03-03T00:52:44.000Z",
          "Titre": "Signed up for a trial",
          "Contenu": "Signed up for a trial, got billed for a year."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-12-28T08:54:57.000Z",
          "Titre": "Not really new things to download!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-12-13T20:33:33.000Z",
          "Titre": "Their is no help if need."
        },
        {
          "Note": 2,
          "Lieu": "CH",
          "Pseudo": "Michael Kern",
          "Nb_Reviews": 1,
          "Date": "2022-01-04T03:36:28.000Z",
          "Titre": "High price",
          "Contenu": "High price, service ok"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "PW",
          "Nb_Reviews": 2,
          "Date": "2021-12-21T14:43:04.000Z",
          "Titre": "Average",
          "Contenu": "Average experience"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "CTH",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T18:16:40.000Z",
          "Titre": "I'm constantly getting API errors",
          "Contenu": "I'm constantly getting API errors, even though it never affects my download progression. Really weird."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "rrgaw",
          "Nb_Reviews": 1,
          "Date": "2022-01-07T17:03:28.000Z",
          "Titre": "Some Gems, But Mostly Too Difficult To Use",
          "Contenu": "Occasionally I can find something I'm looking for on Newshosting.  But browsing or otherwise using is too hard as all one sees are nonsense titles.  So I guess if you are in the 'know' you can decipher all that, but I sure can't.  Not really getting my money's worth otherwise.  It's my last gasp place to look for something.  On the plus side, when I do find something I want to download, Newshosting is pretty quick."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Ron H",
          "Nb_Reviews": 2,
          "Date": "2022-01-06T10:32:59.000Z",
          "Titre": "A moderatley happy customer",
          "Contenu": "The program supplied gives little feedback when things go wrong, and it does happen. Occasionally downloads that look OK just won't decode and un-compress. There is no feedback on why from the program, it thinks it succeeded. There are virtually no settings to help you arrange a better experience like more granular filtering of posters and or content. The program has never to my memory been updated. The online help is sparse and cursary. I started with newshosting being offered an ongoing lifetime renewal discount that was only honoured the first year, so now I will have to cancel my renewal each year and wait for a discount to be offered instead of being rewarded for continued custom."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T22:24:09.000Z",
          "Titre": "Retention is not as good as others",
          "Contenu": "Retention is not as good as others.  Seem to get a lot of bad nzb's than when on others Usenets"
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2022-01-07T15:40:47.000Z",
          "Titre": "Expensive",
          "Contenu": "ExpensiveSometimes the speed is not as high as expected.Searcher is not so practical.Thanks"
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2022-01-11T19:09:15.000Z",
          "Titre": "Unclear why I had to reenter my payment…",
          "Contenu": "Unclear why I had to reenter my payment method. All was working fine until a two weeks ago."
        },
        {
          "Note": 3,
          "Lieu": "MY",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2022-01-08T01:23:04.000Z",
          "Titre": "A few saw the titles but when…",
          "Contenu": "A few saw the titles but when downloading those weren't able to download."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2022-01-05T18:00:29.000Z",
          "Titre": "i've got usenet access",
          "Contenu": "i've got usenet access, a VPN that is good and useful 90% of the time. the price is decent. so, overall i give it a meh, it's good for what i need it for."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Donald Sanford",
          "Nb_Reviews": 2,
          "Date": "2022-01-23T18:13:13.000Z",
          "Titre": "Everything is good except for your…",
          "Contenu": "Everything is good except for your search engine, which is fair at best."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T21:58:16.000Z",
          "Titre": "I would give 5 stars if it was cheaper"
        },
        {
          "Note": 3,
          "Lieu": "CH",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-12-28T20:33:20.000Z",
          "Titre": "Newhosting is OK - But . . . Too many bad blocks",
          "Contenu": "Newhosting is OK, speed, service . . .should be 5 starts butthe programm \"Newshosting x64 2.9.9\" have some problems !!!30% of the downloads are not ok.You can be improve your programm: after 3 bad blocks, stop transfer/download for 1-3 sec and than go on with transfer/download. I do that now manually and repair the files, that works. After stop and go on there are no more bad blocks."
        },
        {
          "Note": 3,
          "Lieu": "DK",
          "Pseudo": "Gheorghe Tufeanu",
          "Nb_Reviews": 37,
          "Date": "2021-12-28T02:52:52.000Z",
          "Titre": "Newshosting looses with Privado",
          "Contenu": "I don’t use Newshosting as I used in the past. All that I find in user net it’s available elsewhere as well. Besides that point Privado vpn is dreadful and even after months of trying to make them understand that this app doesn’t work in Mac OS X, it’s still unusable. I’m thinking to stop the whole service after bout 20 or even more years with Newshosting."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-12-21T15:35:58.000Z",
          "Titre": "Reliable, but...",
          "Contenu": "Reliable service that *just works* (and that's all that's needed to keep me happy), but where Newshosting is losing *major* points in my view is automatically renewing / charging my CC without even the courtesy of a notification email.I tried to renew ahead of time a few weeks ago but there's no such option on their site (that I could find anywhere).  This should be prominent on any existing customer service page."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "User",
          "Nb_Reviews": 3,
          "Date": "2021-12-22T17:23:46.000Z",
          "Titre": "Overall not a bad service and I've not…",
          "Contenu": "Overall not a bad service and I've not experienced any down time but I've lately been unable to download many of the items I have attempted.  It will connect and start but throttles back to about 6 bytes per second as opposed to the up to 60 Mb I should be getting on Xfinity gig service.  No error messages or warnings, just horrible performance.  I've also received files loaded with malware but that is probably beyond their control."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeradsyn",
          "Nb_Reviews": 1,
          "Date": "2021-12-23T15:46:01.000Z",
          "Titre": "I have been finding many of the uploads…",
          "Contenu": "I have been finding many of the uploads contains viruses and malware.  More care should be taken to scan the files before making them available for users to download.  Users that upload infected content should be blocked and/or banned from your/our site.   You offer a good service, but you are only doing half the  job.  Help us all be safer."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "User",
          "Nb_Reviews": 2,
          "Date": "2021-12-31T14:38:37.000Z",
          "Titre": "SSL certificate issue",
          "Contenu": "The contact us/support online form doesn’t seem to be working. I wasn’t able to submit a ticket regarding newshosting’s ssl certificates. SABNzbd reported the issue suddenly last week and do we have a fix yet? I can’t be the only one seeing this issue. Thx. Once fixed, please consider my review to be “excellent” instead."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-12-21T16:03:37.000Z",
          "Titre": "I gave only 3 stars because the content…",
          "Contenu": "I gave only 3 stars because the content that I do attempt to download is generally sound and good quality,however the number of good movies ,which is why I have it, is definitely getting poorer.Conversely the amount of porn is growing exponentially and for that reason i couldn't give it more stars."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Michael Cochrane",
          "Nb_Reviews": 4,
          "Date": "2021-12-16T14:20:43.000Z",
          "Titre": "I only gave a 3 star review because…",
          "Contenu": "I only gave a 3 star review because your search engine is HORRIBLE. You type in a word or phrase and any variation of those words or phrases comes up. For example: Type in goat on a roof and you get 12000 results that say gote, 12000 that say oat 125,000 with roof, 52,000 that say oof,"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Burkely",
          "Nb_Reviews": 1,
          "Date": "2021-08-02T18:08:03.000Z",
          "Titre": "Only beef I have is....",
          "Contenu": "Only beef I have is it seems Newshosting is picking and choosing who now get their 100 connection service. Not impressed with how this is being conducted.. I personally think if you say you're going to provide everyone (with that specific package) 100 connections, up from 50, then everyone should get those 100 connections."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "evilwolf",
          "Nb_Reviews": 1,
          "Date": "2021-06-29T14:26:05.000Z",
          "Titre": "I continue to run across downloads that…",
          "Contenu": "I continue to run across downloads that Newshosting cannot extract properly and I end up with a folder of useless files.  In these cases I have to re-download using NewsLeecher.  NewsLeecher never fails to download correctly.  There are also times when it takes quite a while for Newshosting to make a connection to its servers"
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-12-31T14:34:45.000Z",
          "Titre": "Your Product ist a good One but i dont…",
          "Contenu": "Your Product ist a good One but i dont have so much Money i have to now the Special Deal 2020 this was a good Price that i cant pay but >150 Dollars are too much so i must Cancel my Account . A Nice Offer would be nice of but i think im too late for This"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Baron",
          "Nb_Reviews": 2,
          "Date": "2021-02-26T22:37:46.000Z",
          "Titre": "The newsreader sucks",
          "Contenu": "The newsreader sucks. You could take a lot of the features that the old Xnews reader had and see how useful they were. The most important (to me, anyway) was the ability to not show read messages as well as an ability to mark all existing messages as read. I get no use in having thousands of articles or messages that have no interest to me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-12-09T22:47:00.000Z",
          "Titre": "I like newshosting",
          "Contenu": "I like newshosting, however, the search could be better.  There are times when I search for something, i.e. monk, and I will get \"Mega moms\" and over 7,200 video files.  How does \"Mega moms\" fall into a search for \"monk\"?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2021-01-12T16:45:00.000Z",
          "Titre": "You are my first Usenet provider",
          "Contenu": "You are my first Usenet provider, my biggest complaint is the speed. All over you are regarded as one of the fastest yet I just can't get really good speeds. 150Mb just isn't possible and it is more likely to be around 75 or even lower. The way I use it that's workable but not what I expected based on the reviews I read. Completion rates are good but not great, propagation times for new articles are reasonable though. I may not have anything to compare you against but I'm mostly neutral about the whole service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Petandy",
          "Nb_Reviews": 1,
          "Date": "2021-04-20T22:51:27.000Z",
          "Titre": "Excellent for the post that you can get…",
          "Contenu": "Excellent for the post that you can get but a lot of the older files are still not downloadable and you end up downloading Hugh files that most is missing and i have the option selected to ignore incomplete files also the VPN service is no good it is a waste of money"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tim",
          "Nb_Reviews": 2,
          "Date": "2021-06-06T18:22:59.000Z",
          "Titre": "While the service is great and the…",
          "Contenu": "While the service is great and the binary side of your software is flawless and the search function works very well I have never been able to use the text function in the software.  I had maybe 8 emails with your support people with no resolution.  You finally just quit contacting me.  I asked you about the lack of contact and you said your people were seriously looking into it, but that was months ago.  I am able to access your text groups through other software (Mozilla and Agent) but it would be nice to get your software working.TimEdit:  I had an immediate response from Newshosting and now my issue has been resolved.  Thank you!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mick",
          "Nb_Reviews": 3,
          "Date": "2021-05-21T16:16:31.000Z",
          "Titre": "Your \"Newshosting program v 3.1.0\" poor search function, the most important one.",
          "Contenu": "Your \"Newshosting program v 3.1.0\" it is cumbersome and does not retain what was downloaded already after turning of and returning to program! The search engine is terrible, not an easy way to find something if ever. Not enough search options. The downloaded files are completed, so no complaints here, if you're able to \"Find\" them. Your web search for files is a bad joke, and multi processor use is absent in your program. Looks like a poor \"NewsLeecher\" or \"Newsbinpro\" though you have to pay extra for them. I am ok with it, but it is much room for improvement, and then it will be a Prime tool."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-03-13T16:01:25.000Z",
          "Titre": "User interface needs improving.",
          "Contenu": "The search function is not good, it doesn't report accurate results against the search term, it will report back findings that are similar, which makes it hard find the results that are accurate to the search word, and also it doesn't find all items that do match with the search term.Also, organizing the download items is clunky and clumsy to do. It should be able to move multiple  items up and down the list at a time, and there should be a secondary way of sorting that doesn't require right clicking each line one at a time.THIS REVIEW IS NOT MEANT TO DISCOURAGE PEOPLE FROM USING THIS GOOD SERVICE, BUT TO GIVE THE DEVELOPERS IDEAS ON HOW TO MAKE IT BETTER."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "lou wilsam",
          "Nb_Reviews": 2,
          "Date": "2021-12-29T15:56:14.000Z",
          "Titre": "Many files are shown as complete and are not",
          "Contenu": "Many files are shown as complete and downloadable but, they do not download completely.  Especially, the PAR files are shown but are not downloaded.  Better tracking of file status is needed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2021-12-21T22:40:57.000Z",
          "Titre": "Newshosting Speeds",
          "Contenu": "I have been subscribing to and using Newshosting for years, but despite a 400 mbps D/L pipe from Charter Spectrum, I never get close to the max capable speeds using Newsleecher as the client."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Four Year user",
          "Nb_Reviews": 1,
          "Date": "2021-12-08T18:22:05.000Z",
          "Titre": "Menh, Good enough",
          "Contenu": "Only used for Usenet. Average product in that regard. Nothing exceptional with regards to speed, retention or availability. In real world use, found it just like other products I've used"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Steve Duncan-Turnbull",
          "Nb_Reviews": 28,
          "Date": "2021-12-20T19:33:33.000Z",
          "Titre": "All in all a great service but given I…",
          "Contenu": "All in all a great service but given I have a 500mbs connection I find get anywhere near that - 160mbs max.So a good service let down slightly by having such a slow connection."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-12-08T22:46:51.000Z",
          "Titre": "The speed is slow",
          "Contenu": "The speed is slow, around 75 - 110 Mbps...  I have a 1 Gbps internet connection...  It sometimes peaks at 400 - 500 Mbps, but it doesn't last for too long..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-12-24T05:04:22.000Z",
          "Titre": "Shop around...",
          "Contenu": "The news reader is the biggest drawback. It hasn't had any new features in years.Their retention is good, but pretty much the same as other services."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert Richards",
          "Nb_Reviews": 3,
          "Date": "2021-12-24T00:00:26.000Z",
          "Titre": "The Newshosting service is generally pretty good",
          "Contenu": "Positives:  The user service is generally good, with server down time typically very short, and good download speeds.  Content availability and retention is pretty good too.  Service price is pretty much competitive.  Overall, I'd rate the service a 7-ish.Negatives:  Most of the negatives are associated with The Newshosting browser: Its interface functionality needs work. The search function is not discriminating enough. It has 'way too wide match parameters for content--one constantly gets overwhelming numbers of results, most of which have absolutely nothing to do with specific content searched for. The browser app also does a very poor job of deciphering the current content obfuscation methods in use in most Usenet forums, so oftentimes the results are difficult to understand.  Also, there needs to be some way to in your browser download function to Shift-select a whole chunk of radio-boxes en-mass, rather than having to laboriously select each box individually (the lack of that function alone is a real pain.)"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-12-23T11:03:02.000Z",
          "Titre": "Great for video content but terrible…",
          "Contenu": "Great for video content but terrible when trying to download pictures. I cannot get it to download pictures from newsgroups."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Dave G",
          "Nb_Reviews": 2,
          "Date": "2021-07-26T14:57:34.000Z",
          "Titre": "I really dislike the Newshosting…",
          "Contenu": "I really dislike the Newshosting software. Now don't get me wrong, I like Newshosting as a newsgroup provider a lot.  It's fast and reliable. But the Newshosting software needs to be improved. The search engine is very non-specific and there doesn't seem to be any way to filter out results. For example if I type in a search for Mash Season One I'll get ALL of the Mash episodes along with a bunch of stuff that doesn't have anything to do with MASH.  I'd like to get results, then re-filter those results. I'd also like better customization. Every time I use it I have to go in an resize the date cell so I can see all of it. I'd really like there to be a workspace that I could set up and have that every time.I'd like there to be a much better user manual for the software. It could be in the form of a YouTube video but I'd like to get an explanation for how each part of the Newshosting app works. I suspect that I'm only using a small percentage of Newshosting's capabilities simply because I don't know that certain features are there."
        },
        {
          "Note": 3,
          "Lieu": "NO",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-12-31T15:04:54.000Z",
          "Titre": "Slow we interface when I login",
          "Contenu": "Slow we interface when I login. Please using m.2 add if your data center dosent have it. It slow. Fix it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-12-11T00:16:24.000Z",
          "Titre": "While the service itself is very good…",
          "Contenu": "While the service itself is very good their browser is really bad and with each update gets even worst!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "nobody",
          "Nb_Reviews": 1,
          "Date": "2021-12-22T19:15:20.000Z",
          "Titre": "no clue not really a hardcore user so…",
          "Contenu": "no clue not really a hardcore user so can’t really be a good judge of services - seemed ok i suppose?"
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-12-31T23:44:11.000Z",
          "Titre": "pretty good overall",
          "Contenu": "pretty good overall but the search function is terrible. It hardly ever gives a proper result"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-12-28T17:24:48.000Z",
          "Titre": "Items get removed too quickly",
          "Contenu": "Items get removed too quickly. If you don't grab it within the first 24hrs its gone."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-12-28T18:10:25.000Z",
          "Titre": "download stops many time",
          "Contenu": "download stops many time, takes much longer to get files stops for ten minutes or more."
        },
        {
          "Note": 3,
          "Lieu": "ES",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2022-01-04T21:25:20.000Z",
          "Titre": "There are some packages with errors",
          "Contenu": "There are some packages with errors. Search files is a little bit complicated"
        },
        {
          "Note": 3,
          "Lieu": "KR",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-12-31T21:46:35.000Z",
          "Titre": "Subscription process is always a…",
          "Contenu": "Subscription process is always a nightmare. Otherwise the service is good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "CRAIG KOHLER",
          "Nb_Reviews": 2,
          "Date": "2021-12-22T15:49:58.000Z",
          "Titre": "Product goes into pause and doesn’t…",
          "Contenu": "Product goes into pause and doesn’t give any reason or help to fix it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "christian",
          "Nb_Reviews": 1,
          "Date": "2021-12-15T15:38:17.000Z",
          "Titre": "I am offended by so many Queer's",
          "Contenu": "I am offended by so many Queer's in some of the programs."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "UserMe",
          "Nb_Reviews": 1,
          "Date": "2021-06-29T14:16:33.000Z",
          "Titre": "Had some problems with downloads",
          "Contenu": "Had some problems with downloads. May have been my computer."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-12-09T21:54:19.000Z",
          "Titre": "Price is great",
          "Contenu": "Price is great. Completion could be better."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-12-24T14:33:46.000Z",
          "Titre": "hard to find news groups"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "StickyD",
          "Nb_Reviews": 1,
          "Date": "2021-03-08T18:18:44.000Z",
          "Titre": "Too many incomplete items."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Margozzi",
          "Nb_Reviews": 3,
          "Date": "2023-12-16T02:25:18.000Z",
          "Titre": "Retention is great.",
          "Contenu": "Retention is great.The User Interface for the News Reader needs to be improved.Lots of postings have unsearchable titles as they are scrambled. Not sure if they are hashed or encoded in some way.I have 1G Fiber to the home. Using 60 threads, it only ever gets to about 250 Mbps.Biggest bug that I hate is that if I minimize the app while downloading, it crashes. If I don't minimize, it does NOT crash."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim in Dallas",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T15:13:50.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use. Great price. Good speed.  Good aumatic tools (eg:  decoding RAR files).  FFMPEG and FFPROBE included.  Possible improvement:  Better search, eg: A way to do exact search containing only the keywords I input (or documentation on how to do this if it already exists), which is why I rate 4, not 5, stars."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "NewsNerd",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T00:14:01.000Z",
          "Titre": "The price for what you get is the best…",
          "Contenu": "The price for what you get is the best feature. Wish the software could be worked on a little more. With Win11, I need to manually expand the preview pic window, on Apple it takes one click. Also would be nice to copy text from the posts list by highlighting them. Three years later I'm still here, no need to say more."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "New hosting user for over yrs",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T01:49:14.000Z",
          "Titre": "Solid Usenet provider with very good…",
          "Contenu": "Solid Usenet provider with very good retention times. Only ever had to reach out to them once in 5 years for an email change. If News hosting sees this please give us proper logins and MFA so we can change our own email accounts when needed"
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Kazo",
          "Nb_Reviews": 4,
          "Date": "2022-03-19T16:37:16.000Z",
          "Titre": "Very good Newsgroup provider but things to improve.",
          "Contenu": "Very good Newsgroup provider.Excellent price for unlimited plan and VPN included.Flow rate is great.Things to improve:1) User's control panel was better before: now it's impossible to know the renewal date for your plan.2) Payment with European Mastercard (Euros currency), systematically fail. Need to use a Paypal account and configure an automatic payment authorization that is not very cool"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2022-01-12T07:52:57.000Z",
          "Titre": "Satified with the service provided",
          "Contenu": "The download speed is good, the data are available for a long time and are complete.The logic of your dash board isn't always easy to understand and hopefully you won't get any technical problem you can't solve by yourself with the help pages, because technical support is difficult to reach.Manpower is expansive and most companies try to cut it, so nothing surprising.For the price, the service is excellent and that's what matters the most for me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2022-01-21T21:17:49.000Z",
          "Titre": "Good service with  1 main issue...",
          "Contenu": "I am a long time user and love the good service. Only 1 issue that i have is that several newsgroups are missing many articles. I had hoped that Newshosting would not censor any newsgroups as I, and many other users, believe in freedom of speech. Even though I don't like some of the newsgroup topics and articles, it is not my right to determine their value to other users.  No articles should be banned, however a warning could be displayed next to a newsgroup which would be sufficient to users.  Several groups are almost bare of articles.      Otherwise, thanks for your service."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Ados",
          "Nb_Reviews": 1,
          "Date": "2022-01-24T09:02:20.000Z",
          "Titre": "Great Service",
          "Contenu": "Great reliable service with room for improvement.Over the years its never been offline or performing poorly but I don't always achieve the maximum line speed.However, the experience thus far gives no reason to jump ship."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2022-01-08T02:16:57.000Z",
          "Titre": "In general",
          "Contenu": "In general, the service is pretty good as a base account. Speed is good. Sometimes popular uploads are taken down (missing articles) so other block accounts are still needed."
        },
        {
          "Note": 4,
          "Lieu": "RO",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2022-01-17T17:44:52.000Z",
          "Titre": "Good newshosting archive and speed",
          "Contenu": "Good newshosting archive and speed, however the VPN provided has no open ports, making torrent some low seeded downloads a crawl or non-starters."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Doctor KF",
          "Nb_Reviews": 8,
          "Date": "2022-01-06T10:44:14.000Z",
          "Titre": "Great price value",
          "Contenu": "Great price value. Excellent speed... I don't give it 5 stars because it's getting more difficult to find content in the usenet over the years. Not very sure if this is something they could improve."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T20:58:54.000Z",
          "Titre": "Ease of use."
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "creemyv",
          "Nb_Reviews": 2,
          "Date": "2022-01-10T07:32:15.000Z",
          "Titre": "Perfect service, strange billing issue",
          "Contenu": "Perfect service, it is a pity that I couldn't switch from a yearly to monthly subscription without having to cancel first."
        },
        {
          "Note": 4,
          "Lieu": "AT",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2022-01-05T10:48:34.000Z",
          "Titre": "The only thing that is annoying ist the…",
          "Contenu": "The only thing that is annoying ist the time to connect. Sometimes it takes 20 seconds or more. Download speed is excellent."
        },
        {
          "Note": 4,
          "Lieu": "CZ",
          "Pseudo": "Jerry",
          "Nb_Reviews": 1,
          "Date": "2022-01-11T16:39:33.000Z",
          "Titre": "I think for the most part it's great",
          "Contenu": "I think for the most part it's great.   I wish it would be easier to do specific searches in the newshosting program though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Clarence Obert",
          "Nb_Reviews": 3,
          "Date": "2023-06-28T23:29:04.000Z",
          "Titre": "Block Spam Posters",
          "Contenu": "I hope in future updates you'll have an option to block posters.  This will reduce the amount of spam that you see."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Hans Nieuwkerk",
          "Nb_Reviews": 3,
          "Date": "2022-01-08T11:06:04.000Z",
          "Titre": "My opinion about Newshosting",
          "Contenu": "The speed is alright. But with VPN less.I am not quit satisfied with the helpdesk. Once I asked them someting and I did not get an answer."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Jelle E. Hoekstra",
          "Nb_Reviews": 5,
          "Date": "2023-03-22T20:07:52.000Z",
          "Titre": "I can usually find what I m looking…",
          "Contenu": "I can usually find what I m looking for, which is a great PLUS, so thank you"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "rick",
          "Nb_Reviews": 2,
          "Date": "2023-08-06T20:36:36.000Z",
          "Titre": "cant complain",
          "Contenu": "cant complain . its fast and reliable"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Aaron Griffith",
          "Nb_Reviews": 2,
          "Date": "2022-01-11T08:15:43.000Z",
          "Titre": "Still up and running but sometimes I…",
          "Contenu": "Still up and running but sometimes I can not connect"
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Christiaan Jacobus",
          "Nb_Reviews": 2,
          "Date": "2022-01-07T18:58:13.000Z",
          "Titre": "Would be even better if you had an…",
          "Contenu": "Would be even better if you had an indexer"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Boris",
          "Nb_Reviews": 1,
          "Date": "2022-01-07T18:15:00.000Z",
          "Titre": "Good",
          "Contenu": "Cheap, but Performance not always great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2022-01-17T02:17:49.000Z",
          "Titre": "I would give 4.5/5",
          "Contenu": "I would give 4.5/5, cause some archived can't be downloaded sometimes."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2022-01-07T21:27:00.000Z",
          "Titre": "Love it",
          "Contenu": "Love it, simple yet effective."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2022-01-08T15:18:22.000Z",
          "Titre": "It's good but a little bit expensive."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2022-01-04T19:32:39.000Z",
          "Titre": "A very good service with but one quibble",
          "Contenu": "A very good service that probably actually deserves 5 stars. Everything behaves as it should and as you would hope.My one gripe is there seems to be no [Shift] or [Ctl] means of selecting or deselecting a block of files in the detail window. This means sometimes individually selecting dozens of individual files to either download or reject. If they could fix that Newshosting would, in my opinion, be a 5 star+ service."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "horacecuriaces",
          "Nb_Reviews": 1,
          "Date": "2021-12-28T09:43:05.000Z",
          "Titre": "I'm happy with the service quality…",
          "Contenu": "I'm happy with the service quality offered by Newshosting in terms of availability and download speed. There are two points preventing me from allocating 5 stars, so two points to improve: - Sometimes, the download speed is not as good as usual. - Recording a new credit card and renewing the account is usually slow and I always cross my fingers hoping everything will be fine."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-12-31T15:53:18.000Z",
          "Titre": "Added Newshosting to replace my old…",
          "Contenu": "Added Newshosting to replace my old news server which went belly up with little to no warning. Newshosting is considerably faster and more reliable in so far as I can tell.Only reason I didn't give five stars is that I found navigating the setups for my news reader apps was a bit difficult. And in fairness that might just be operator error on my part."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "User",
          "Nb_Reviews": 3,
          "Date": "2021-12-31T16:11:39.000Z",
          "Titre": "Better than UseNext",
          "Contenu": "I was a customer of UseNext for years, but switched to Newshosting and am glad I did. Retention seems to be better, although occasionally searches do not find postings that are there (using .nzb files from elsewhere and then the postings appear). Once I had switched, I received threatening emails from UseNext - great customer service I don't think."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "pmsevern",
          "Nb_Reviews": 1,
          "Date": "2021-12-16T17:17:01.000Z",
          "Titre": "Top notch service, with a miniscule shortcoming.",
          "Contenu": "Newshosting advertised an over 13 year binary retention. I can't attest to the 4871+ Days Binary Retention, but it is very good. The supplied NewsReader works well, and fast, however some binary files simply do not show up when searching. If the exact name of the file is searched for, still nothing is returned. This is the only flaw I see in an otherwise top notch service."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Robert Ikin",
          "Nb_Reviews": 4,
          "Date": "2021-12-31T21:21:35.000Z",
          "Titre": "Reliable news service.",
          "Contenu": "Newshosting is easy to install,  the setup requires some degree of background knowledge but once completed it is easy to use and reliable. The performance and history indicators keep track of all activities so any faults and failures are easily traced. The only negative is the upgrade procedure,  I've yet to upgrade successfully."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Curtis Fisher",
          "Nb_Reviews": 3,
          "Date": "2022-01-22T14:05:33.000Z",
          "Titre": "Long file retention",
          "Contenu": "Long file retention, fast downloads."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Reggie Penski",
          "Nb_Reviews": 1,
          "Date": "2021-12-28T07:19:22.000Z",
          "Titre": "The only thing missing is a decent VPN",
          "Contenu": "The only thing missing is a decent VPN. The previous service use to be great, then they partnered with a 3rd party and the experience was horrible. NewsHosting service is solid, but the included VPN doesn't cut it. If a VPN is important to your usenet experience - expect to shop around for a dedicated supplier."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-12-29T01:47:20.000Z",
          "Titre": "The newsreader must be improved soon",
          "Contenu": "a) The build-in search has to be improved. Many articles cannot be found :-(b) Downloads are often incomplete. When using the NZB which you can save in Newshosting then other download-tools will download 100% error free :-(Speed and retention of Newshosting are great :-)Improve a and b and you would get 5 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2022-01-04T19:51:14.000Z",
          "Titre": "Newhosting is a quality USENET provider…but",
          "Contenu": "Newhosting is a quality USENET provider with exceptional retention.  However, when canceling a subscription, there is only a brief notification on the account web-page.  I recommend that an email be sent to the customer specifying date/time of cancellation and when the account/service will be deactivated (no longer accessible). It should also include a notice if any prepaid fees will be refunded.  The aforementioned is standard business practice, alleviates any confusion, and improves customer relations."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2021-10-09T08:26:31.000Z",
          "Titre": "Great .. but not Excellent from just one reason only...",
          "Contenu": "Fast servers, great retention times, speedy support, good price, good newsreader.. Actually there is only 1 thing that is holding me back from the 5-star rating: DMCA removed files should also be removed from the index. Right now they still show up in the newsreader, which obviously makes no sense and a waste of time trying to download them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-12-16T15:26:20.000Z",
          "Titre": "Speed is excellent",
          "Contenu": "Speed is excellent, retention is superb and the VPN really helps supplement downloads in a safe way. Would have given you 5 stars if your UI was a little more responsive (font size too big, window sizes not convenient, etc). 4 1/2 stars if you had them...! Very satisfied user, keep up the good work"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gary Walloch",
          "Nb_Reviews": 1,
          "Date": "2021-12-16T14:55:05.000Z",
          "Titre": "Only 4 stars",
          "Contenu": "Only 4 stars, really 3 and a half stars.  Primary reason is that other newsreaders have more features.  So I have to use Newsrover, for example, to request that someone upload a book, music, tv show or movie.  Big missing feature of Newshosting.  Also the lag time of when I can get items from using other newsreaders appears to be about 12 hours ahead of Newshosting.  I love the format of Newshosting, but it does lag behind other more developed news readers. Please include the ability to request uploads as another feature."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lee",
          "Nb_Reviews": 4,
          "Date": "2021-12-15T14:18:57.000Z",
          "Titre": "We started out a little rocky as I…",
          "Contenu": "We started out a little rocky as I could not access my account and it was only after I left a negative review did someone get in touch with me.Since then I've been very impressed with their retention and speed. Only downfall: I cannot post any comment to groups."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "A User",
          "Nb_Reviews": 1,
          "Date": "2021-05-14T00:39:44.000Z",
          "Titre": "Great, overall.",
          "Contenu": "Overall, I am extremely satisfied with Newshosting.  its retention is excellent, its pricing is great.The newsreader client is very good, but not great.  Also, there is no version that runs on Android, and the Linux version doesn't support Mediatek CPUs (which are used in some Chromebooks)."
        },
        {
          "Note": 4,
          "Lieu": "ID",
          "Pseudo": "HT-Fanatic",
          "Nb_Reviews": 1,
          "Date": "2021-12-28T00:54:54.000Z",
          "Titre": "Best of them all",
          "Contenu": "I tried other 3-4 newsreaders before for the last over 20 years, Newshosting is the latest and to my experience is the best among them.High speed, user friendly menu, easy to maneuver, and most important searching is no brainer. Keep improving."
        },
        {
          "Note": 4,
          "Lieu": "AT",
          "Pseudo": "Puschl",
          "Nb_Reviews": 2,
          "Date": "2022-01-02T10:28:00.000Z",
          "Titre": "missing functions",
          "Contenu": "i´m missing the - sign in the search line to exclude words.The groups-field in extended search shoud be empty by default.A checkbox \"only files w.o. PW\"The extraction of downloaded files is very slow and uses to much resources"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-12-28T21:39:35.000Z",
          "Titre": "No complaints about the servers",
          "Contenu": "No complaints about the servers. Reliability, retention, and speed are all great.With respect to a newsreader, a user manual, or explanation of the regular expressions used for searches (assuming there are regular expressions) would be useful."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Pete Coventry",
          "Nb_Reviews": 14,
          "Date": "2021-12-14T14:13:32.000Z",
          "Titre": "The Speed and retention is good but...",
          "Contenu": "The Speed and retention is good - but I am taking off a star because nothing over 300GB seems to work for me. I get told the Disk is full - Even when I use a brand new 8TB SSD.For OSX there are few choices - but at least this choice works ok."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "AO",
          "Nb_Reviews": 1,
          "Date": "2022-01-04T20:03:31.000Z",
          "Titre": "Cool money/Value, but some issues left.",
          "Contenu": "Newshosting Software: Great.VPN : good, but some software versions of the bundeled privado vpn Software (AutoUpdated) will produce false virus alarms.Usernet usability: Miraculously, I can find much more .bin (NOT PQRN) content with the competition (e.g.Unsernet.nl) software than with Newshosting Software. It may be due to the different search index. Due to the great performance-for-money ratio, I would like to remain a Newshosting customer. Maybe Newshosting can add the search index used by the competition Usernet.nl to the Newshosting package? That would be a huge improvement and it would definitely attract a lot of new customers."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-12-21T14:39:49.000Z",
          "Titre": "Because I'm a \"light\" user",
          "Contenu": "Because I'm a \"light\" user - due to limited bandwith - the service up time has been very good and new uploads propagate promptly. On the downside, the few times I have needed to contact support - they have been useless... :("
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-12-22T16:34:34.000Z",
          "Titre": "Great retention",
          "Contenu": "It appears that some times posts are incomplete but that may be an issue with the poster. Plus you have great retention so that's a real positive. Is there an explanation of why or how this happens or is it just sloppy posting?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "cerf",
          "Nb_Reviews": 1,
          "Date": "2021-02-26T17:51:46.000Z",
          "Titre": "10,12 year Retention is unbelievable",
          "Contenu": "10,12 year Retention is unbelievable. I've hardly seen a broken binary since I've switched to Newshosting. So, Newshosting if your listening... Your doing a superb usenet hosting,I use Newsbin Pro but wasn't able to do a upload or I would have given 5 Stars"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2021-12-17T22:07:34.000Z",
          "Titre": "TOO MUCH TIME WASTING",
          "Contenu": "Too many times you have incomplete binaries.  This may or may not be your fault but it is very annoying.  Also, your newsreader doesn't have a way to block posters whose content you don't want to see or be bothered with."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Mike",
          "Nb_Reviews": 3,
          "Date": "2021-12-30T04:46:57.000Z",
          "Titre": "Good service and retention.....BUT!",
          "Contenu": "Good service and retention time on files, easy to setup. Just not a fan of monthly subscriptions, prefer block purchases with no expiration date. This most likely will be the sole reason why I ditch the service. Pity really."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-02-26T23:53:12.000Z",
          "Titre": "A Brief Review of Newshosting",
          "Contenu": "The service is fast. I just wish there were more directions for things, like being able to make requests in groups automatically, and setting up a reader like Agent with it. I see this as a weakness.The price is reasonable and worth it. I recommend it on the basis of cost and speed. If I can ever shake my old VPN, I will use the one offered by Newshosting.In the past, I was disappointed with customer support not getting back with me. I saw that as a definite flaw.I do plan on keeping Newshosting and hope they take my review into account as they continue to provide this service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-12-22T17:49:58.000Z",
          "Titre": "Minor complaints",
          "Contenu": "Occasional download speed variations, dropped connections causing manyretries. Certain times of day more congestion occurs than normal.In general, service is overall satisfactory. File completion is top notch."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "David J",
          "Nb_Reviews": 4,
          "Date": "2021-09-22T11:38:24.000Z",
          "Titre": "Works great most of the time",
          "Contenu": "Works great, most of the time. Just some small annoyances;1- desktop app; I restart my desktop computer every 24 hrs. Sometime an automatic connection fails. There used to be a way to quit certain apps when no von connection could be established. This option disappeared a while back.2- desktop app; often after an update I have to re-enter all my credentials before the app will function again. Sometimes I do not check on the headless desktop to see if everything is still working. So in those cases there is no vpn but my apps are still running, but unsafe. See point 1.Smart dns for my smart tv is brilliant! Only wish it was a bit.more flexible. My isp sometimes changes my ip."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Len",
          "Nb_Reviews": 3,
          "Date": "2021-12-20T17:11:47.000Z",
          "Titre": "Would be nice when Newshosting is down…",
          "Contenu": "Would be nice when Newshosting is down for routine maintenance that a message is posted letting client know the date and time so we can plan accordingly. Also an estimated time outage. Otherwise all is well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daily User",
          "Nb_Reviews": 1,
          "Date": "2021-12-23T00:33:27.000Z",
          "Titre": "Thank you for the survey",
          "Contenu": "Thank you for the survey. I find the connection speed per connection slower than it should be.Please increase speed per connection. Also good to limit the number of simultaneous connections if necessary."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-12-15T13:13:48.000Z",
          "Titre": "The service itself is excellent",
          "Contenu": "The service itself is excellent. The client is great and the download speeds are fantastic. The content is a little old and many binaries or files can have missing parts. Making the download unsuccessful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "cooknclean",
          "Nb_Reviews": 2,
          "Date": "2021-12-16T18:16:10.000Z",
          "Titre": "Good downloading service but poorly designed search app.",
          "Contenu": "I have been a subscriber to Newshosting for several years and always been pleased with the service as far as availability and speed. I recently installed their app on my Mac. Aside from the fact that is seems to return results deeper in time than other Usenet searches, it is pretty crummy. It is very difficult to narrow down searches; the engine seems to include every variation of my search terms plus any words that seem to have 50% of the same letters. In addition, the creation of NZB files is awkward, it must be done one at a time and there doesn't seem to be any way to change the default directory they are saved in. Maybe I am missing out on some functions but since a manual is practically nonexistent, I may never know."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-12-20T17:03:30.000Z",
          "Titre": "You are doing fine",
          "Contenu": "You are doing fine. I don't give out 5 star ratings. I'm still learning how to navigate through to get what i'm looking for. The speed is good and I like the search feature. Very helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Zer0future",
          "Nb_Reviews": 4,
          "Date": "2021-03-06T01:47:03.000Z",
          "Titre": "Great value service.",
          "Contenu": "Newshosting offers a good service at pretty low prices. The retention is ridiculously high and speed is consistent for the most part. I have only experienced a bit of drop in speed a couple of times. Overall very good service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-12-29T21:35:52.000Z",
          "Titre": "Great source of files that I am looking…",
          "Contenu": "Great source of files that I am looking for. I don't like that it can't filter out the porn. And searching for words and phrases, doesn't always give me the exact word or phrase"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Freddy Jackson",
          "Nb_Reviews": 2,
          "Date": "2021-12-10T04:39:12.000Z",
          "Titre": "Pricing is great",
          "Contenu": "Pricing is great, number of connections is great, provided news client is not.  The free NZBget program is far superior and documented way better. Other than that, I'm a happy customer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris from Canada",
          "Nb_Reviews": 2,
          "Date": "2021-12-16T22:11:59.000Z",
          "Titre": "Great service, good speeds, great value.",
          "Contenu": "Service is great, always available. Speed isn't as much as I'd like, but I'm probably far away, and it's more than fast enough. Would recommend using NewsHosting for sure."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "don_d",
          "Nb_Reviews": 1,
          "Date": "2021-12-22T17:48:57.000Z",
          "Titre": "I really appreciate your service.",
          "Contenu": "I have not experienced any problems communicating with this company, as I haven't had any issues to complain about!  Guess that's a good thing, isn't it?  There has only been one problem:  the graphical input that shows up when I want to do something with a file (save, make .nzb, etc.) sometimes disappears but I have found how to deal with that, so no big problem. I really like being able to download an .nzb file, instead of the whole, data consuming, original file. I do like the fact that you do not appear to age limit the queried newsgroup, but seem to give up ALL the files, regardless of age.  And quickly!  My wish list?  I wish that there were more newsgroups available on the access list on the left side of the page, as there are other groups that I would like to access."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-12-13T16:34:35.000Z",
          "Titre": "Service is great and affordable",
          "Contenu": "Service is great and relatively affordable, wish they could check files for corruption as ive had many files fail download because its missing files or the file is otherwise corrupt."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sidharth Chaubey",
          "Nb_Reviews": 2,
          "Date": "2021-12-31T10:50:20.000Z",
          "Titre": "Very useful to have a visual look",
          "Contenu": "Very useful to have a visual look at the incoming posts. It makes Newshosting very unique in that sense. You can get up to 30 Mb/sec (240 Mbit) download which is pretty good."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Erwin",
          "Nb_Reviews": 6,
          "Date": "2021-09-22T07:30:18.000Z",
          "Titre": "Overall Newshosting works very well…",
          "Contenu": "Overall Newshosting works very well great retention and download speeds, the only issue is that often downloads don't work because they have been damaged or (partially) removed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Larry",
          "Nb_Reviews": 3,
          "Date": "2021-03-05T19:51:52.000Z",
          "Titre": "I've been happy with the performance of…",
          "Contenu": "I've been happy with the performance of news hosting, their customer service was a little bit lacking. Used to be able to call and speak with a real person rather than email and wait."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "CCP",
          "Nb_Reviews": 1,
          "Date": "2021-12-16T15:34:14.000Z",
          "Titre": "Generally Newshosting does a good job",
          "Contenu": "Generally Newshosting does a good job. My only observation is that it sometimes doesn’t show filed etc that one can see elsewhere it is also slow in showing postings."
        },
        {
          "Note": 4,
          "Lieu": "DK",
          "Pseudo": "Ron Strauss",
          "Nb_Reviews": 2,
          "Date": "2021-12-21T18:36:02.000Z",
          "Titre": "It really works great but sometimes it can be slow",
          "Contenu": "It really works great but sometimes it can be a little slow, maybe if the traffic is high. It is very easy to use. I would highly recommend it and I use it a lot."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Richard",
          "Nb_Reviews": 3,
          "Date": "2021-12-29T16:38:49.000Z",
          "Titre": "A brilliant usenet service let down my a poor app.",
          "Contenu": "Their core service of providing a 24/7 Usenet is feed is absolutely excellent.  I've been with them for many many years and I can't even remember when their service has ever been down.  It has good coverage too.My only gripe is the Windows application they provide. It's functionality is very basic and the search function in particular is very poor compared to, say, Newsbin.  Development of this app is almost non existent and when they do actually provide an update it usually breaks the app. This is currently the case. Rather than fix it, the support team simply inform me to downgrade the app to an old version. This has happened to me twice and if you try and get further information from support, they simply ignore you.I'd actually like to offer a 4.5 star review but it's either  4 or 5.In summary, a brilliant usenet service let down my a poor app."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Colleen",
          "Nb_Reviews": 2,
          "Date": "2021-12-25T05:15:54.000Z",
          "Titre": "Great product, great price.",
          "Contenu": "Great deal for the money, very reliable product. The only complain is that the website to contact customer doen't work other wise I would give it 5 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-05-12T21:34:33.000Z",
          "Titre": "Good retention",
          "Contenu": "Good retention.  App is fairly easy to use.  The pop up’s of the sample frames are a bit annoying when passing the cursor over them to get to the left of the app however."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gnomex",
          "Nb_Reviews": 3,
          "Date": "2021-06-30T10:20:14.000Z",
          "Titre": "Strongly   Recommend News Hosting",
          "Contenu": "I have used news hosting for several years. There price to performance ratio is excellent. I strongly recommend this service for anyone needing a news server provider."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "John L",
          "Nb_Reviews": 1,
          "Date": "2021-12-28T00:46:28.000Z",
          "Titre": "Consistent reliable Usenet provider",
          "Contenu": "I’ve been a customer with annually renewing subscriptions for many years now with no issues. Reliable, no downtime, great article retention, well priced!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "dodgedart",
          "Nb_Reviews": 1,
          "Date": "2020-11-20T10:47:11.000Z",
          "Titre": "Reliable and Fast",
          "Contenu": "My ISP provides 1 Gb/sec internet and Newshosting fully utilizes it most of the time. Completion is very high and the service is rarely down. I am happy with Newshosting."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Elton",
          "Nb_Reviews": 2,
          "Date": "2022-01-08T07:53:14.000Z",
          "Titre": "Great service"
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-12-30T10:55:29.000Z",
          "Titre": "the search engine is not efficient and…",
          "Contenu": "the search engine is not efficient and privado crashes regularly without disconnecting the open programs...dangerous !  otherwise I am satisfied"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-12-16T21:09:31.000Z",
          "Titre": "Great service at a great price",
          "Contenu": "Great service at a great price.  Sometimes it is hard to get the older tv shows which is why I gave it 4 stars.  Service has always been reliable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "P. K.",
          "Nb_Reviews": 1,
          "Date": "2021-12-30T13:13:05.000Z",
          "Titre": "All good",
          "Contenu": "All good. The newsreader could use a better search engine. During search many non-relevant articles appear in list. Other than that all good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Korbendallaz",
          "Nb_Reviews": 1,
          "Date": "2021-03-10T16:25:02.000Z",
          "Titre": "I've enjoyed using Newshosting again",
          "Contenu": "I've enjoyed using Newshosting again, I've been able to catch-up on those things that interest me and help with several hobbies that I am pursuing."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "P. Krabbe",
          "Nb_Reviews": 15,
          "Date": "2021-09-21T15:22:08.000Z",
          "Titre": "Generally OK",
          "Contenu": "Generally OK. Sometimes the connection speeds drops. Retention seems OK. Overall I am fairly happy with Newshosting. The application works fine."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Raven",
          "Nb_Reviews": 1,
          "Date": "2021-12-22T04:58:35.000Z",
          "Titre": "Love the app and the service",
          "Contenu": "Love the app and the serviceSometimes the archive doesnt' seem quite so accurate as it could be, but overall its a great servcie."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mr Addison",
          "Nb_Reviews": 18,
          "Date": "2021-12-15T12:49:59.000Z",
          "Titre": "Brilliant",
          "Contenu": "BrilliantNew feature would be helpful if we could block specific users in a single news thread or all.  Just a thought to cut the spam"
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Michel",
          "Nb_Reviews": 7,
          "Date": "2021-12-31T16:55:53.000Z",
          "Titre": "Good and quick service",
          "Contenu": "Good and quick service. Missing binaries is often an issue for the larger groups but that's par (unintended) for the course."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-02-19T15:57:36.000Z",
          "Titre": "Overall it's a great service",
          "Contenu": "Overall it's a great serviceThe issue I have is with the speed. I wish I could max out my Internet connection which is 1 gigabit down."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "splork",
          "Nb_Reviews": 1,
          "Date": "2021-12-13T23:30:12.000Z",
          "Titre": "service works as it should",
          "Contenu": "service works as it should. have never experienced any throttling. they have heavy discounts now and then. well woth it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tommy",
          "Nb_Reviews": 7,
          "Date": "2021-06-29T13:50:14.000Z",
          "Titre": "Great Service",
          "Contenu": "I like and use this a lot, good service & fast. I would like to see improvements in the browser, maybe language filtering."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "User",
          "Nb_Reviews": 2,
          "Date": "2022-01-08T14:03:32.000Z",
          "Titre": "Thanks",
          "Contenu": "Thanks for your free offer"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "sunshinefortyseven",
          "Nb_Reviews": 1,
          "Date": "2021-03-12T16:55:29.000Z",
          "Titre": "DCMA makes it impossible to give any…",
          "Contenu": "DCMA makes it impossible to give any newsgroup a 5 star but your company is the closest to the best. 20 Years using the Usenet"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "murdridge",
          "Nb_Reviews": 1,
          "Date": "2021-12-13T16:35:24.000Z",
          "Titre": "Newshosting is a good service",
          "Contenu": "Newshosting is a good service, everything I can ask forTheir news reader does not search well.Overall satisfied!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Diigii",
          "Nb_Reviews": 4,
          "Date": "2021-12-28T18:17:15.000Z",
          "Titre": "Almost 5 star",
          "Contenu": "Almost 5 star.  The speed does not quite seem what is used to be, I can no longer download at my full bandwidth."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Tony",
          "Nb_Reviews": 6,
          "Date": "2021-12-14T06:26:26.000Z",
          "Titre": "on the whole good",
          "Contenu": "on the whole good, just very occasionally I get denied access for no reason. I will return later and no problem."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Ronald van Dijk",
          "Nb_Reviews": 5,
          "Date": "2021-09-21T15:17:29.000Z",
          "Titre": "great news server.",
          "Contenu": "great news server.. and had a great life time deal.. the vpn is also getting better.. very satisfied customer. 8/10"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "justjim",
          "Nb_Reviews": 1,
          "Date": "2021-12-22T17:31:13.000Z",
          "Titre": "Some unfiltered crap in with quality…",
          "Contenu": "Some unfiltered crap in with quality files, but generally good. Alot of Mp3 music masquerading as FLAC."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Thomas",
          "Nb_Reviews": 6,
          "Date": "2021-12-23T13:33:23.000Z",
          "Titre": "Great most of the time.",
          "Contenu": "Hate wasting my time on incomplete/missing or corrupt downloads. Otherwise works well and fast speeds."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Klant",
          "Nb_Reviews": 5,
          "Date": "2021-09-21T16:02:21.000Z",
          "Titre": "Excellent retention rate for a fair…",
          "Contenu": "Excellent retention rate for a fair price. Fast servers. No 5 stars because there is still no iPad app"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-12-21T18:31:08.000Z",
          "Titre": "wonderful reception",
          "Contenu": "wonderful reception - I just wish you would fix your payment page so it would accept credit cards."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Denzelle",
          "Nb_Reviews": 2,
          "Date": "2021-12-22T17:41:14.000Z",
          "Titre": "Privado VPN sucks but not your service",
          "Contenu": "The only thing I can day i don't like is the Privado VPN. Everything else has been wonderful"
        },
        {
          "Note": 4,
          "Lieu": "BG",
          "Pseudo": "User",
          "Nb_Reviews": 2,
          "Date": "2021-12-31T15:21:01.000Z",
          "Titre": "Often it could hang on the last few…",
          "Contenu": "Often it could hang on the last few bytes and retention is not always what it seems should be"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Bill K.",
          "Nb_Reviews": 2,
          "Date": "2021-12-21T14:32:51.000Z",
          "Titre": "Some downloads a very slow",
          "Contenu": "Some downloads a very slow . . . not with the actual download; but with the decoding process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tony Yeatropoulos",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T23:30:21.000Z",
          "Titre": "'Newshosting' is Fantastic!!",
          "Contenu": "The 'Newshosting' site is always reliable, fast, and I can't recall a time when it ever went down. It retains posts for a very long time, and I have never received any virus's or malware of any kind.  My only constructive issue is with many of the posters that feel it necessary to add a suffix-(numeral), and/or a suffix-(personal moniker), to the end of each song title.  This leave me/us to have to delete each one manually, which is a huge PITA.  But as far as 'Newshosting' itself, it's fantastic, and I would be devastated if it ever went away!! Keep up the great work!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "heldka",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T04:31:43.000Z",
          "Titre": "Awesome service and support.",
          "Contenu": "Awesome service and support. I've been with Newshosting for 18+ years and will continue to remain with them exclusively. They have always been very responsive to any concerns with which I've contacted them."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Christopher",
          "Nb_Reviews": 5,
          "Date": "2023-12-15T21:13:33.000Z",
          "Titre": "Fantastic service",
          "Contenu": "Fantastic service,great price,large retention.This service has been reliable for the many years I have been with them.Its good to know I never have to look elsewhere."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T21:25:41.000Z",
          "Titre": "Great connections always",
          "Contenu": "Great connections always. Content not censored. Service has never failed me for many years. Great value for the price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T21:32:51.000Z",
          "Titre": "It just works",
          "Contenu": "It just works. I can find what I'm looking for very easily. The entire process of starting with newshosting is simple. I think it took 5 whole minutes."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T22:32:53.000Z",
          "Titre": "The provided apps is easy to setup and…",
          "Contenu": "The provided apps is easy to setup and use. Keep in mind that usenet is not as active as it was 10 years ago ;-((  Nothing to do with Newshosting"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Coenraad Carels",
          "Nb_Reviews": 3,
          "Date": "2023-12-15T21:14:14.000Z",
          "Titre": "Always good and no troubells in the…",
          "Contenu": "Always good and no troubells in the Twenty years that i enjoy newshosting"
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T15:16:19.000Z",
          "Titre": "Great usenet provider, for many, many years.",
          "Contenu": "Unlimited download capacity an great download speeds. Very friendly support team."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T11:54:08.000Z",
          "Titre": "Perfect",
          "Contenu": "Just great, working flawlessly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "yossi",
          "Nb_Reviews": 3,
          "Date": "2023-12-16T06:03:26.000Z",
          "Titre": "Thay are the best period .",
          "Contenu": "Thay are the best period .I have no other word to say"
        },
        {
          "Note": 5,
          "Lieu": "CZ",
          "Pseudo": "Jerry and Bella Salem",
          "Nb_Reviews": 5,
          "Date": "2023-08-20T12:24:21.000Z",
          "Titre": "Hands down the best Usenet service",
          "Contenu": "I've been a subscriber for many years and they really deliver.  Their newsreader app makes downloading from them dead simple, everything is taken care of for you behind the scenes, you don't have to worry about the technicalities they take care of it for you.  Everything is well organized, including snapshot pictures of video files.  Worth every cent."
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "Michael B",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T21:27:15.000Z",
          "Titre": "Great performance and retention",
          "Contenu": "Great performance and retention! No problems!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John F Ehrhardt",
          "Nb_Reviews": 3,
          "Date": "2023-09-29T21:16:55.000Z",
          "Titre": "Newshosting is the best!",
          "Contenu": "Newshosting provides over 110,000 newsgroups with excellent retention of up to 15 years.  They provide an excellent newsreader that is easy to use.  Also, they allow for unlimited speeds and unlimited downloads.  The price is fair and the provider is dependable."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "ykyng",
          "Nb_Reviews": 1,
          "Date": "2022-02-06T12:50:23.000Z",
          "Titre": "Very good performance / hidden added value",
          "Contenu": "Very good performance, fast reaction to tickets - only needed so far for activating posting access, was answered within 13 (thirteen!) minutes.Another feature is their own news client which is very good for searching when other means fail - adds value most people don't even know about!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Werner Mueller",
          "Nb_Reviews": 2,
          "Date": "2023-07-29T00:40:55.000Z",
          "Titre": "Newshosting is first class",
          "Contenu": "Newshosting is first class. I started with Usenet Monster (I knew the founder for a long time) and they got aquired by Newshosting. They honored my low rate (I had this account for almost 20 years) and the one time I had an issue it was resolved very fast through their competent support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joel P",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T21:57:45.000Z",
          "Titre": "Nothing but good experiences!",
          "Contenu": "Great retention, almost never has gone down.   Excellent client software! Chat support is helpful when I've needed it.  And pricing is definitely good value for the money. Been with them for many years now."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeremy",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T00:02:12.000Z",
          "Titre": "Worth every penny!",
          "Contenu": "I've been using Newshosting for over a decade.  It's been rock solid since day 1.  The few times that I've had to contact customer service, (due to my errors), that has been stellar as well."
        },
        {
          "Note": 5,
          "Lieu": "DK",
          "Pseudo": "Johnny",
          "Nb_Reviews": 6,
          "Date": "2022-04-25T10:32:42.928Z",
          "Titre": "Great Usenet Provider!",
          "Contenu": "Top notch usenet service; solid uptime, speed, retention. It literally just works.I accidentally paid twice for a year of subscription, and they had it resolved within hours of my email, so customer service is top notch too.The addition of PrivadoVPN is great although their app feels slightly wonky - but the VPN service is solid and speeds are as expected.Will absolutely recommend for both usenet alone and the bundle with VPN"
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Ingmar Verelst",
          "Nb_Reviews": 27,
          "Date": "2023-06-21T19:51:47.000Z",
          "Titre": "Excellent",
          "Contenu": "After being a customer for over 3 years the only negative is that sometimes the account management window on the website is down. I also have to note that I never had to contact customer support because I never needed them. The service is very fast (It uses the full capacity of my 1Gbps connection) and reliable. I had 0 issues since I switched to newshosting. I can recommend this service to all users, retention is very good as well."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "sire",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T02:16:41.000Z",
          "Titre": "/\\/\\ Newshosting #1 /\\/\\",
          "Contenu": "You guys are awesome.  I'm coming up on my 20th year with Newshosting.  I always get my top speed with you guys.  I've showed so many people why newsgroups are a way better solution then using torrents or downloading from the web.  It would really suck if you guys weren't around.  Thanks for the great service. It always works perfectly."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Richard Monaghan",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T10:32:10.000Z",
          "Titre": "Renewal date isn't shown",
          "Contenu": "Renewal date isn't shown, so it is difficult to known in advance when renewal is due. Renewal is automatic and there is no way to change that. no refunds are given. So once you join it is made difficult to leave. A pity because the service is otherwise excellent.Contacted support and cancelled automatic renewal. Now happy with service."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mike Berry",
          "Nb_Reviews": 27,
          "Date": "2023-03-14T21:04:48.000Z",
          "Titre": "Second to none. 100% recommended.",
          "Contenu": "I've been with Newshosting.com for 12 years now. Not once have I experienced any kind of major outage.  Their service has always been fast and reliable (though I could do with a few more connections for the plan I'm currently on!).Would 100% recommend them to anyone."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "panhead",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T02:15:29.000Z",
          "Titre": "Thanks",
          "Contenu": "Recommended by Telus when they ceased providing access to their usenet servers. I've appreciatedusenet since my university days almost 50 years ago.Keep up the fine work."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Vanuci",
          "Nb_Reviews": 1,
          "Date": "2022-01-07T16:42:55.000Z",
          "Titre": "Simply the Best",
          "Contenu": "Used another one ( Gig...news) for many years. They claim to be the best provider. It makes me laugh!!.Newshosting : Great speed, great retention time, no downtime, appropriate price.To date, everything's positive."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2023-07-01T07:35:25.000Z",
          "Titre": "works well is reliable and fast",
          "Contenu": "works well is reliable and fast. has great retention, not much that doesn't complete without missing parts, been a customer for about 8 years"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "MiseryGuts",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T21:57:30.000Z",
          "Titre": "Outstanding Service and Speed",
          "Contenu": "I've been using Newshosting for some time now, and I must say that their service has been consistently outstanding. As someone who appreciates efficiency and reliability, I've never encountered any issues with their server speeds.Newshosting's servers are not only fast but also incredibly reliable. I've never experienced any downtime or slow connections during my time with them. This level of reliability is crucial for someone like me who values a seamless online experience.The ease of use of their platform is also worth mentioning. It's user-friendly and intuitive, making it simple to navigate and find what you need, even for someone like me who enjoys tech-related content.Moreover, their customer support has been exceptional. Whenever I've had a question or needed assistance, they were quick to respond and provided clear, helpful guidance. This level of support gives me confidence in their service.In summary, Newshosting has been a reliable and speedy service provider for me. If you're looking for a top-notch Usenet service with excellent server speeds and dependable customer support, I highly recommend giving them a try."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "RiDi",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T15:53:25.000Z",
          "Titre": "user experience since nearly 20 years",
          "Contenu": "Since more than 19 years (2004) I am going with newshosting. Never had any problem. Super speed and most of all the best retention time of all competitors."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "PleasedUser",
          "Nb_Reviews": 1,
          "Date": "2022-01-11T18:45:22.000Z",
          "Titre": "By far the most stable und fastest…",
          "Contenu": "By far the most stable und fastest provider I ever had. One great feature would be a smart  auto re-connect function in case speed of current server decreases."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "WDizzle",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T18:32:15.000Z",
          "Titre": "Outstanding service for the price",
          "Contenu": "Outstanding service for the price. Worth every cent in my opinion. Retention is great, speed is more than sufficient and absolutely zero BS."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Carl",
          "Nb_Reviews": 4,
          "Date": "2023-09-29T17:57:12.000Z",
          "Titre": "newshostings loyal customer",
          "Contenu": "Been with newshostings for years never had any issues happy with there service would highly recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "theoldrock",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T02:06:33.000Z",
          "Titre": "You can't go wrong with Newshosting!",
          "Contenu": "Uptime and reliability is of the utmost. Never had a complaint since using your product. I will continue to use it as long as I am around. I have used it for years."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T19:51:08.000Z",
          "Titre": "Has never had any down time in the…",
          "Contenu": "Has never had any down time in the years I have used it and retention is great. Good speed, good pricing, helpful newsreader with added vpn is great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T02:52:57.000Z",
          "Titre": "Newshosting is excellent",
          "Contenu": "Newshosting is excellent! I've had it for many years and would never switch. Unbelievable retention rate and their free newsreader is top of the line."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Paul Bennett",
          "Nb_Reviews": 3,
          "Date": "2023-05-08T10:33:27.000Z",
          "Titre": "The best Usenet provider I've used",
          "Contenu": "The best Usenet provider I've used - MASSIVE retention and incredible prices.The Newsreader they offer is pretty damn good too!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T16:36:52.000Z",
          "Titre": "everything!",
          "Contenu": "everything!! very easy to search for articles seeming removed but aren't. Have been using it for many years and still the best. absolute excellent product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mcosenza",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T00:06:06.000Z",
          "Titre": "Newshosting",
          "Contenu": "I have used newshosting for 2-3 years now and they have great customer service and reliable newsgroups and uptime.  I highly recommend them as a service"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "grub",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T20:29:54.000Z",
          "Titre": "Newshosting is great!",
          "Contenu": "Great service, they always seem to have the stuff we need.Have used them for several years and see no reason to switch Usenet providers."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T22:51:45.000Z",
          "Titre": "Reliability",
          "Contenu": "Good price ReliabilityPropose its own newreaderI’m happy now for more than 10 years."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Grinthark",
          "Nb_Reviews": 2,
          "Date": "2022-01-12T12:44:16.000Z",
          "Titre": "Been a multi year (4+) member of…",
          "Contenu": "Been a multi year (4+) member of Newshosting and have had 0 issues in that time with a minor exception with the changing of VPN providers which was just a hickup. A+ service."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "H. Hansen",
          "Nb_Reviews": 2,
          "Date": "2023-08-05T00:00:49.000Z",
          "Titre": "Best Usenet Provider ever",
          "Contenu": "I hope that the service will be the same in the future as now. The time between updates of the newshosting app should be a little bit shorter."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-05-25T16:47:24.000Z",
          "Titre": "I've been a customer for over 15 years",
          "Contenu": "I've been a customer for over 15 years. Recommended to several other people.Never had a single issue with this company."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Rohin",
          "Nb_Reviews": 2,
          "Date": "2022-01-10T10:14:24.000Z",
          "Titre": "I have been using the service for a…",
          "Contenu": "I have been using the service for a quite some time now. They offer good speeds and customer service. I have tried a couple of other service providers but came back to newshosting"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trucker Alex",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T20:40:32.000Z",
          "Titre": "Never have ANY problems",
          "Contenu": "Never have ANY problems, just works great! Nice retention time slso"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Hermann D.",
          "Nb_Reviews": 1,
          "Date": "2022-01-07T14:40:33.000Z",
          "Titre": "Great price performance ratio!",
          "Contenu": "Have been a customer for a few years. Top performance at a very good price! Never had any problems so far. Great price performance ratio!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Udo",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T19:38:30.000Z",
          "Titre": "Very fast and reliable",
          "Contenu": "Very fast - always full speed of my 400Mb/s line can be used. Over 14 years retention time and VPN access is included."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Matthew Weaver",
          "Nb_Reviews": 3,
          "Date": "2023-03-15T16:33:48.000Z",
          "Titre": "1st class service",
          "Contenu": "Been a member for many years now, never had anything to complain about, the service has always been rock solid"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "dgelhats",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T12:27:31.000Z",
          "Titre": "The best for retention",
          "Contenu": "The best for retention. Almost 25 years retention!!! This is by far the best usenet provider I've ever used!!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "User Lifeforce",
          "Nb_Reviews": 2,
          "Date": "2022-01-12T02:59:15.000Z",
          "Titre": "Take a punt.",
          "Contenu": "Like the world we live in, not always perfect, but a wonderful experience along with a learning curve. A great ride !"
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Evelien de Ridder",
          "Nb_Reviews": 11,
          "Date": "2022-11-05T05:20:21.000Z",
          "Titre": "good",
          "Contenu": "never have anny probs whit this provider evryting works and is nice fast top 99% complete also the extreme hige retension days i like  the  software you get is not bad it works  in the 4 years i have this i have never needed to get suport so yea  iam hapy whit this"
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Cătălin B.",
          "Nb_Reviews": 2,
          "Date": "2022-01-22T07:04:55.000Z",
          "Titre": "Good retention",
          "Contenu": "Good retention, reliable service. Can't say about support, there was no need for support as the service worked fine with no interruptions."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Peter",
          "Nb_Reviews": 5,
          "Date": "2022-01-11T11:43:08.000Z",
          "Titre": "So far all good",
          "Contenu": "So far all good, always available very good download speeds and very few incomplete posts, which was the reason I changed to them."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Duckysan",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T22:29:14.000Z",
          "Titre": "Consistent high speed connection",
          "Contenu": "Consistent high speed connection.  Long retention.  Great app makes it easy to find posts."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mikey",
          "Nb_Reviews": 3,
          "Date": "2022-01-07T16:21:14.000Z",
          "Titre": "This is a very good product",
          "Contenu": "This is a very good product.  I haven't done newgroups for quite sometime.  Its changed quite a bit but it is still a solid way of downloading content.  NIce service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Murphy",
          "Nb_Reviews": 3,
          "Date": "2023-05-16T22:27:22.000Z",
          "Titre": "Newshosting fixed my support issue",
          "Contenu": "Newshosting explained the situation and issue resolved and gave me a discounted 12 month rate.Thanks"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Sophie D.",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T16:55:35.000Z",
          "Titre": "Nice service",
          "Contenu": "Nice service. I had an ultimate plan one year. Everything worked smooth all time. Support answer me quick as well."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "User in Sydney Australia",
          "Nb_Reviews": 1,
          "Date": "2022-01-14T01:55:31.000Z",
          "Titre": "Consistently delivering promised…",
          "Contenu": "Consistently delivering promised speeds. Recently helped me avail of the black friday promo even when I am an existing customer. Customer service responded promptly everytime."
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "UserAnon",
          "Nb_Reviews": 1,
          "Date": "2022-01-12T16:20:54.000Z",
          "Titre": "Great service",
          "Contenu": "Fast and durable. No problems with contacting support. What can I say more - I'm satisfied."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "mykl",
          "Nb_Reviews": 1,
          "Date": "2022-02-22T21:27:07.000Z",
          "Titre": "Newshosting is a great service with…",
          "Contenu": "Newshosting is a great service with long time availability and always seems to be on when I need it.  Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert O",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T19:52:47.000Z",
          "Titre": "One of the best Usenet providers",
          "Contenu": "Great price. Fast and reliable service. Decent retention. Been using them for several years."
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "Internet User",
          "Nb_Reviews": 1,
          "Date": "2023-07-29T02:45:47.000Z",
          "Titre": "Best Newshost !!!",
          "Contenu": "Best Newshost !!!! No Problems sience i am using it and best connection."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Thomas",
          "Nb_Reviews": 1,
          "Date": "2022-01-07T18:32:39.000Z",
          "Titre": "Reliable and stable",
          "Contenu": "Newshosting has been a very reliable and stable service for years. I have been a very satisfied customer for years!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "spodula",
          "Nb_Reviews": 4,
          "Date": "2023-09-30T12:43:06.000Z",
          "Titre": "Does exactly what it does on the tin with no fuss.",
          "Contenu": "Does exactly what it does on the tin, with no fuss. Works on both Linux and Windows flawlessly."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Videoed",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T19:40:37.000Z",
          "Titre": "Very good service",
          "Contenu": "Very good service. Don’t remember any outages at in the time I have been a subscriber."
        },
        {
          "Note": 5,
          "Lieu": "CZ",
          "Pseudo": "Some_USER_in_central_europe",
          "Nb_Reviews": 1,
          "Date": "2022-01-07T18:17:34.000Z",
          "Titre": "Everything just works perfectly and…",
          "Contenu": "Everything just works perfectly and flawlessly.I have full internet speed for the download -- 300mbit."
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "FarrelK",
          "Nb_Reviews": 1,
          "Date": "2022-01-07T08:23:01.000Z",
          "Titre": "Not much to say other than Newshosting…",
          "Contenu": "Not much to say other than Newshosting is absolutely first rate and definitely worth a 5 star rating!!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "ein Kunde",
          "Nb_Reviews": 3,
          "Date": "2023-05-04T13:31:55.000Z",
          "Titre": "Best news hoster I've ever tried",
          "Contenu": "Best news hoster I've ever tried. Both retention and speed are excellent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Long time Newshosting user",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T23:26:57.000Z",
          "Titre": "Timely postings",
          "Contenu": "Timely postings, ad and junkware-free posts, good retention, and very fast downloads."
        },
        {
          "Note": 5,
          "Lieu": "DK",
          "Pseudo": "Anders Jessen",
          "Nb_Reviews": 7,
          "Date": "2022-01-07T21:59:27.000Z",
          "Titre": "Does what it says on the tin",
          "Contenu": "Does what it says on the tin. Fast, reliable and no hiccups in service. And the added bonus of a vpn is also very nice."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Shaun Robert",
          "Nb_Reviews": 3,
          "Date": "2022-01-07T14:39:54.000Z",
          "Titre": "Always found the service to be there…",
          "Contenu": "Always found the service to be there when I need it.....Search Engine is easy to use and intuitive......keep up the good work"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Rick",
          "Nb_Reviews": 1,
          "Date": "2022-03-31T12:49:06.000Z",
          "Titre": "Very satisfied.",
          "Contenu": "I've been a user for a couple of years. Solid and trustworthy service. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "sdb",
          "Nb_Reviews": 2,
          "Date": "2022-01-07T15:01:21.000Z",
          "Titre": "Using Newshosting for a few years now",
          "Contenu": "Using Newshosting for a few years now. No issues and great retention."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2023-07-29T00:10:55.000Z",
          "Titre": "I get a lI t of use out of it",
          "Contenu": "I get a lI t of use out of it, as I'm a bedridden veteran."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Michael",
          "Nb_Reviews": 6,
          "Date": "2022-06-05T12:13:26.000Z",
          "Titre": "Professional service and professional…",
          "Contenu": "Professional service and professional support. I really appreciate that they dealt with my request (after the cancelation of my subscription) very friendly and professional. I definitely recommend them, although I am no longer using the Usenet personally."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "User",
          "Nb_Reviews": 2,
          "Date": "2022-01-07T14:32:24.000Z",
          "Titre": "Best Usenet Provider!",
          "Contenu": "Used Giganews for years. Sorry I hadn’t discovered this service sooner."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "A User",
          "Nb_Reviews": 1,
          "Date": "2022-02-06T18:56:51.000Z",
          "Titre": "Just works!",
          "Contenu": "Just works! Never any issues or downtime. Good support, too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ljarvis",
          "Nb_Reviews": 1,
          "Date": "2023-07-29T01:03:03.000Z",
          "Titre": "Account upgrade",
          "Contenu": "If I asked a question, a real person responded"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Discrete user",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T21:34:12.000Z",
          "Titre": "Steady service through the years",
          "Contenu": "Steady service through the years. Something you can trust will work."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Ralf",
          "Nb_Reviews": 3,
          "Date": "2022-01-08T08:52:21.000Z",
          "Titre": "Super",
          "Contenu": "Super. Never missed a File. The very few broken files could easily  be repaired."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2022-01-10T04:36:39.000Z",
          "Titre": "Happy customer",
          "Contenu": "Questions posted on forums were answered quickly and politely"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "User",
          "Nb_Reviews": 2,
          "Date": "2022-01-08T00:09:56.000Z",
          "Titre": "It is my go to for finding files",
          "Contenu": "It is my go to for finding the files I need. Easier to use and more complete than any other source."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2022-01-12T00:10:57.000Z",
          "Titre": "best service for less money",
          "Contenu": "best service for less money. Retention Time is perfect"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "M. Heilmann",
          "Nb_Reviews": 4,
          "Date": "2023-03-22T12:33:28.000Z",
          "Titre": "Very reliable",
          "Contenu": "Very reliable - never experienced any problems - using it now for 6 years with daily downloads"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Wookie",
          "Nb_Reviews": 3,
          "Date": "2022-01-10T12:09:42.000Z",
          "Titre": "Recommended service",
          "Contenu": "Never had any problems with the service.Speed was as promised."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Friedrich Rosendhal",
          "Nb_Reviews": 2,
          "Date": "2023-10-07T12:23:57.000Z",
          "Titre": "I simples never had problems."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "User for couple of years",
          "Nb_Reviews": 1,
          "Date": "2022-01-07T16:47:02.000Z",
          "Titre": "I won't change!",
          "Contenu": "Simple, reliable, fast, cheap....All qualities that I expect."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T22:39:47.000Z",
          "Titre": "Great usenet service",
          "Contenu": "Great usenet service. Awesome retention. Easy to use software package available. Reasonable fees."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T16:49:45.000Z",
          "Titre": "Never any issues",
          "Contenu": "Never any issues, best service around."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TGheavyuser",
          "Nb_Reviews": 1,
          "Date": "2023-08-06T01:16:52.000Z",
          "Titre": "Great app",
          "Contenu": "Great app! Always on. Always complete posts."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Ferguson",
          "Nb_Reviews": 2,
          "Date": "2023-03-15T16:14:35.000Z",
          "Titre": "Never had an issue",
          "Contenu": "Never had an issue. Great retention and fills."
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Christian Buysschaert",
          "Nb_Reviews": 36,
          "Date": "2023-08-05T22:21:16.000Z",
          "Titre": "It does what it promises to do!",
          "Contenu": "It does what it promises to do! Never had issues..."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "David warren",
          "Nb_Reviews": 10,
          "Date": "2023-03-15T16:28:13.000Z",
          "Titre": "Does exactly what it should do",
          "Contenu": "Does exactly what it should do. Never any problems."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "alice",
          "Nb_Reviews": 2,
          "Date": "2023-05-01T12:03:16.000Z",
          "Titre": "Retention and speed is almost what was…",
          "Contenu": "Retention and speed is almost what was promised"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "User",
          "Nb_Reviews": 2,
          "Date": "2022-01-07T14:38:39.000Z",
          "Titre": "Top notch service",
          "Contenu": "I havent got a bad thing to say. I've had a flawless experience."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Dhr. J.A. van Hengel",
          "Nb_Reviews": 11,
          "Date": "2022-01-07T15:11:27.000Z",
          "Titre": "I AM very satisfied with the speed and…",
          "Contenu": "I AM very satisfied with the speed and quality of service"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Park",
          "Nb_Reviews": 1,
          "Date": "2022-02-08T12:46:06.000Z",
          "Titre": "Lifetime subscription",
          "Contenu": "Lifetime subscription ! All is good  ! Vpn also excellent .. 9/10"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2023-06-24T16:22:08.000Z",
          "Titre": "Great retention",
          "Contenu": "Great retention, fast speeds - been a user for many years."
        },
        {
          "Note": 5,
          "Lieu": "CZ",
          "Pseudo": "Evzen",
          "Nb_Reviews": 1,
          "Date": "2022-01-09T20:40:34.000Z",
          "Titre": "I'm with Newshosting for 20 years",
          "Contenu": "I'm with Newshosting for 20 years, that speaks for itself."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "user",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T20:19:06.000Z",
          "Titre": "Articles are complete and long…",
          "Contenu": "Articles are complete and long retention times."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2022-01-11T20:31:12.000Z",
          "Titre": "Excellent",
          "Contenu": "Excellent, everything is great also the included VPN"
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "Andreas Hierzenberger",
          "Nb_Reviews": 3,
          "Date": "2022-01-11T18:27:29.000Z",
          "Titre": "Excellent, 100% up and lighting fast",
          "Contenu": "Tried it, never looked back. Best Newsserver around"
        }
      ]
    }
  ]
}