{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "www.mouser.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Hudson",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T22:15:57.000Z",
          "Titre": "Edgar iglesias held all of our orders…",
          "Contenu": "Edgar iglesias held all of our orders for an unpaid invoice from over a year ago for $500.  We have spend $1000s of dollars since then, clearly this is a paper work issue.  If this the kind of service you offer to regular customers, I'll take this companies business elsewhere."
        },
        {
          "Note": 1,
          "Lieu": "GE",
          "Pseudo": "Dmitry Negoda",
          "Nb_Reviews": 3,
          "Date": "2023-11-30T22:18:38.000Z",
          "Titre": "Terrible",
          "Contenu": "I made three orders on this website. Only one order fulfilled. One order backordered and never completed and another they asked to email my billing address. I emailed the address, then the automatic system asked for the billing address again and so on. I emailed three times, they ignored my emails and kept asking for the billing address."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Accounts Payable",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T22:59:12.000Z",
          "Titre": "The subscribe button kept popping up",
          "Contenu": "The subscribe button kept popping up.  Took me a longer time to place an order than I expected."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hector Morales",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T15:25:14.000Z",
          "Titre": "Bad shipping estimate",
          "Contenu": "The online order in certain amount of time to ship is a lie. I ordered within the 12 hours it said and my order didn't ship until the next day. It's just a way for mouser to secure in order."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Ed Lalo Taylor",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T21:42:35.000Z",
          "Titre": "Worst treatment of my life!",
          "Contenu": "I purchased some automotive switches from them and needed to return them as my customer changed their requirement. The agreed to the return, but when they received them they claimed that the switches did not come from them and I had a choice to either have them returned or they would discard them.I tried communicating this and was given the contact information of Carlo Gutierrez. He doesn't return calls and they just blow you off essentially calling me a liar and a cheat. They are a terrible company to do business with!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Geoff Scott",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T18:46:56.000Z",
          "Titre": "An absolute nightmare to deal with",
          "Contenu": "Easily the worst electronics company I have ever done business with. Ordered parts for a small prototype run (~$500usd) due to Mouser having stock that my normal suppliers didn't. Proceeded to spend two weeks of back and forth over the phone having order after order cancelled (with no follow up at all) due to completely opaque reason. Eventually settled on wire transfer to \"verify\" the company. Spend 3 days waiting for information on customs. Eventually had to change the shipping address and then had them ship the order without indicating I would need to provide self-brokerage (adding additional cost you typically never need with electronics firms). No remorse whatsoever from anyone I spoke with. Could not imagine placing a larger order with them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "AP",
          "Nb_Reviews": 5,
          "Date": "2023-06-16T17:54:39.000Z",
          "Titre": "Absolutely terrible",
          "Contenu": "Absolutely terrible. Without any due diligence they will label you as a distributor and cancel your supply line orders for products you build. They then make you wait weeks to prove yourself that you are the end consumer and involved in manufacturing and not reselling. I will never do business with them again and I really recommend no one else building a small business do so either. They could at least ask what you're doing.....before cutting off critical supplies as your tiny business grows. Basically they are just forcing you to just get them cheaper from overseas and sending money outside the American economy."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marcelo Mesina",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T19:11:47.000Z",
          "Titre": "Horrible return policy",
          "Contenu": "Horrible return policy. If the product and the packaging is not in pristine condition they will NOT take it back. Steer clear from them if you’re not sure your keeping your purchase!"
        },
        {
          "Note": 1,
          "Lieu": "SE",
          "Pseudo": "Andreas",
          "Nb_Reviews": 5,
          "Date": "2023-11-13T15:05:33.000Z",
          "Titre": "Beware: Broken payments and awful customer support",
          "Contenu": "My hope is that this review serves as a warning for any potential customers thinking of ordering from Mouser. If you have any type of issue whatsoever with your order you will instantly regret it as soon as you have to interact with their customer service.The saga unfolded as follows:1. Following an order on their website, I received an immediate request to complete the End-User Certification form.2. Despite promptly submitting the form, there was an inexplicable month-long silence, prompting my inquiry into the status of my order.3. A delayed response indicated the need for more specific information on my form, leading to a revised submission, eventual order release, and a tracking number.4. Mouser then fails to charge my credit card, which results in a post-shipment refund.5. I then get an email from Accounts Representative (AA#1). The correspondence with AA#1 included baseless accusations of a \"chargeback,\" requiring a protracted seven-email exchange for an acknowledgment that the error was made by them.6. I informed AA#1 that I had already entered my credit card details into my Mouser Account, but apparently they are not able to charge those cards? AA#1 instead directed me to a separate, seemingly unaffiliated and non-functional website for credit card details submission, and then stopped responding when I informed them that the site does not work.7. After a few days I get a new email from completely different Accounts Representative (AA#2) that displayed a concerning lack of awareness having no knowledge of my correspondence with AA#1 which necessitated the manual transmission of the entire email thread to avoid having to start the whole thing over again.8. AA#2 then sends me a receipt for my order and ask me to send them a wire transfer, and then completely ignores me when I tell them that the receipt does not actually contain any payment information or instructions whatsoever.9. I finally manage to perform a wire-transfer, which my bank charged 6% of the total price for, erasing any price advantage Mouser might have had. Not to mention the stress and time lost of having to deal with their abysmal custom support.But honestly, the worst part has to be the almost complete lack of remorse or good will for the avoidable challenges stemming completely from Mouser's unwarranted refund initiation. Especially from AA#2."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T18:26:17.000Z",
          "Titre": "My order was cancelled, I was not told",
          "Contenu": "my order was cancelled and I was never contacted. They said they couldn't look up my order on information without an account number but nowhere on my account can i an account number (only my login info).. online help was terrible. Rez was the only bright spot. He was very helpful."
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Casper R.",
          "Nb_Reviews": 13,
          "Date": "2022-12-10T15:05:51.000Z",
          "Titre": "Not a trustworthy company",
          "Contenu": "Not a trustworthy company, try to avoid. Great stock of components, and useful for hobbyists, but you can never trust them when items are backordered. We have, for several times now, experienced that parts that we ordered, and confirmed to be in stock by mouser, was sold to other customers, and then \"our\" \"in stock\" status was changed to backordered with very long lead times. Very unprofessional."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Kevin Parker",
          "Nb_Reviews": 9,
          "Date": "2023-05-23T02:34:32.000Z",
          "Titre": "Access Denied on their website frequently...",
          "Contenu": "I'm on Cable Internet without a public IP... Its more common now that IPv4 is exhausted. They block my connection from just shopping on their website with Access Denied. I have to use a VPN and clear my cookies. Bad for business since their product categorization is better than DigiKeys for many of the parts I look for."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Maxwell",
          "Nb_Reviews": 2,
          "Date": "2023-02-14T21:26:37.000Z",
          "Titre": "Payment runarounds. Terrible experience.",
          "Contenu": "Super difficult company to give money to. Tried to place an order with a credit card and they left it sitting “under review” for 5 days until I called and asked what was happening. They just say they “can’t verify the buyer lives at the address stated” not sure how that justifies anything or remotely makes sense to not process the payment. I see the pending charge clearly on my credit card yet they won’t send it through or prepare my order. They’re requesting me to send a wire transfer instead because that somehow is magically better and able to verify I live at the address? Terrible experience."
        },
        {
          "Note": 1,
          "Lieu": "RS",
          "Pseudo": "Miomir Nikolic",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T14:54:24.000Z",
          "Titre": "Never delivered order",
          "Contenu": "Never delivered order, even not answering on my email asking for the delay. Be careful!!Miomir Nikolic"
        },
        {
          "Note": 1,
          "Lieu": "BE",
          "Pseudo": "Sriram Muddam",
          "Nb_Reviews": 1,
          "Date": "2022-09-20T12:16:07.000Z",
          "Titre": "Improper Communication",
          "Contenu": "There was no proper communication from Mouser for the order number 26569695. Even after receiving confirmation from Mouser that the end use certificate from our end was in par with the needs, it took 22 days for Mouser to declare that they cannot ship the items. This should have been done within few days of placing the order. Moreover, we don't understand why we do not get the chips when we declare the end use clearly."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kevin O'Connor",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T00:38:18.000Z",
          "Titre": "Your latest packaging effort sucks",
          "Contenu": "Your latest packaging effort really sucks. I dont expect to receive packages with parts sticking out and box flaps half open. Poor packing & poor taping. I didnt loos any parts, but it wasnt for their lack of trying...."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T20:50:44.000Z",
          "Titre": "You sent me another customers parts",
          "Contenu": "You sent me another customers parts.  The label on the box was correct but the parts inside were for Yotta Energy in Austin Texas. I called and told customer service and was told a second order was being delivered later on Friday. It never came. So I reordered the parts I never got. Now I need the ASAP!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bruce Harvey",
          "Nb_Reviews": 2,
          "Date": "2023-09-26T22:33:53.000Z",
          "Titre": "I produce through hole products.",
          "Contenu": "I produce through hole products, have been for 20 years. You have been my main parts supplier, we are now down to 1 part. YOUR MINIMUM QUANTITIES ARE TOO LARGE."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steven",
          "Nb_Reviews": 1,
          "Date": "2022-09-10T03:00:36.000Z",
          "Titre": "Friday PM order placed for Saturday…",
          "Contenu": "Friday PM order placed for Saturday delivery. Went to my account to track the order at 8pm only to find that the order was flagged for export control. I called support only to be told that the export department was closed and would return Monday, at best the order would ship on Monday and arrive TUESDAY!I had the agent cancel the order and I was able to place the order again with enough time for it to still ship the same day - only this time I had missed the Saturday delivery cutoff, leaving Monday as my only option. Fingers crossed it ships this time!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Drewscruis",
          "Nb_Reviews": 1,
          "Date": "2023-04-24T16:07:01.000Z",
          "Titre": "Parts ordered on 4/1/23 shipped 4/3/23…",
          "Contenu": "Parts ordered on 4/1/23 shipped 4/3/23 with estimated delivery on 4/12/23. Parts were in stock when ordered. It's 4/24/23 parts are still not here. Called today and was told that because I used economy shipping it can take 3-4 months to receive the parts. I have used economy shipping from other electronic supply company's and it has never taken more than a week. It was never stated that it would take months if I used economy shipping. I ended up ordering parts from another supplier using economy shipping and it was here in 5 days. Was told the tracking number provided was just a number and not a real tracking number, eventhough it states label created package not received by carrier. Not that they care, but they lost a customer over $20 in parts."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Frederick C Love",
          "Nb_Reviews": 2,
          "Date": "2023-08-22T20:30:08.000Z",
          "Titre": "HP Digital probe P6136 sold without license.",
          "Contenu": "You sold a P6136 digital probe set for my MSO22 scope, which I could not use and could not return, due to a missing license. There was no data when I made this purchase that a license was necessary. Your customer support person, I think George was his name, told me to open the bags, as the license should have been included. A rip-off of over a thousand dollars. I've spent many times this amount over the years. I do not think I will ever get over this purchase.Thanks for your response, but no joy. I was forced to spend another $1,000 with Tektronix to acquire the license, which comes with a digital probe. Now I’ve got two probes, one of which I’m not permitted to return to Mouser because the bag has been opened (your customer support person suggested I open it to find the missing license).You sell the probe without a license, when it doesn’t work (because you did let the buyer know a license was required) you’ve just cost your client over $1,000 for something you Know he won’t be able to use. Very misleading business practice."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "James",
          "Nb_Reviews": 11,
          "Date": "2022-05-27T22:04:09.000Z",
          "Titre": "Parts claimed to be in stock, but actually the other side of the planet.",
          "Contenu": "Parts claimed to be in stock. But actually in Texas although ordered via the uk web site site. So I wait for Fedex to delivery them by 'express' - snail maybe? Fedex have not delivered, so now we are behind and have nobody to contact. Dreadful Service, and the order accepted on false premises."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Donald Crossley",
          "Nb_Reviews": 1,
          "Date": "2022-04-25T22:07:36.731Z",
          "Titre": "First your search is atrocious",
          "Contenu": "First your search is atrocious, finally had to lookup the part number from last time.Second, the default shipping was $ 126.00 for UPS Ground, I shipped this same item UPS Ground charged to my account and in January it was $ 23.28.  Companies need to decide what business they are in, in your case electronics or transportation.  Fortunately, for me I have the option of paying the transportation charges on my company UPS account."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "DJP",
          "Nb_Reviews": 40,
          "Date": "2022-05-12T22:25:35.000Z",
          "Titre": "Follow up review.",
          "Contenu": "Follow up review.After having to get mouser’s attention by leaving a poor review here, they did indeed get in touch with an apology. I again followed their suggested process given I believe I have been sent the wrong parts. Silence again. They really have no concept of customer support are are extremely poor communicators. This is a U.K. experience. Not sure where this leaves me.Edit: Another response asking me to do the same thing. Mouser are not committed to helping with the issue. They just throw statements out here to make readers think they care. Absolute rubbish.Mouser, you have my emails, you have my contact details Etc.Why would I need to do this in a public forum if you actually did your job and actually cared!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "DJP",
          "Nb_Reviews": 40,
          "Date": "2022-05-11T05:26:30.000Z",
          "Titre": "Based on customer support",
          "Contenu": "So customer support gets in touch and says sorry. They make be go through a process again. They then do absolutely nothing. I follow up dead silence. I’d remove this on star if I could.Shocking!Based on customer support. You are keeping me waiting for days and days to determine whether you have sent me the wrong parts. You have had photographs twice. I’ve written to customer service to follow up and nothing. My first and probably last experience with mouser."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Abby",
          "Nb_Reviews": 2,
          "Date": "2023-06-22T02:38:53.000Z",
          "Titre": "Your chat is totally worthless",
          "Contenu": "Your chat is totally worthless.  I had a payment page problem.  I tried the chat.  BAD IDEA.  It is automated and it is STUPID. To be fair, so am I for trying to use it.  It offers three options for the nature of my problem.  I choose one.  The error message says it cannot understand the option I chose.  You proposed the options!!!  What do you mean, you do not understand.  Your wrote them and programmed them!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sam",
          "Nb_Reviews": 1,
          "Date": "2022-12-15T17:45:32.000Z",
          "Titre": "This company is horrible",
          "Contenu": "This company is horrible. I placed an order on December 12 and went to check the status on December 15 and found out the order was cancelled. I called and was told I could not use a credit card only a wire transfer, which sounds like a lot of BS. They never notified me my order was cancelled. Don't ever do business with these crooks."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "bretep",
          "Nb_Reviews": 1,
          "Date": "2022-07-21T21:51:14.000Z",
          "Titre": "Mouser customer service",
          "Contenu": "Attempted to purchase/import an item from US to UK and was given the run around, excuses and lies before having to cancel the order and purchase same item elsewhere. Utterly hopeless company and I won't be going near them again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steve Seth",
          "Nb_Reviews": 1,
          "Date": "2022-10-25T18:11:33.000Z",
          "Titre": "Extremely rude and bad customer…",
          "Contenu": "Extremely rude and bad customer service. I shop about $300-500k each year from them and yet, they treatment like an animal. Manufacturers should move to other suppliers."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Billy Armstrong",
          "Nb_Reviews": 1,
          "Date": "2022-05-25T00:32:15.000Z",
          "Titre": "LIMITS AND NOT THE SAME BATCH",
          "Contenu": "I know parts are hard to come by, but limit me to only 100 per month and then on the 100 pieces on MOSFETS cant even make them all the same batch number. I do amplifier repair and 100 mosfets will only do 2 amplifiers at a time. So that limits me to how much I can make. This is very hard on me. You may want to rethink you limits on parts."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "stuart werner",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T04:31:08.000Z",
          "Titre": "I searched for a part by specific mfg…",
          "Contenu": "I searched for a part by specific mfg part number. Your app said you had NOTHING like it in stock, no products at all by NKK. I checked Digikey’s app. Worked great but they're a ripoff so I tried your website based on a funny feeling that it'd be nuts yall didn't carry them. Sure enough your website said you had 300 of the switch I need. Go figure. App is fkn useless"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jon Carleton",
          "Nb_Reviews": 1,
          "Date": "2022-07-23T17:17:34.000Z",
          "Titre": "Search Enging Can't Find Simple Part Without Part #",
          "Contenu": "I want a simple part.  I have ordered it before but ALWAYS have trouble finding it.  I got frustrated enought to go to showmecables.com to see if I would have better luck.  Fortunately for you, their search engine was even more inept than yours.  I finally had to got switchcraft to find the part number, whereupon I got your search to work.  It is a simple, chassis mount, female phone jack, but .206 inch rather than .25 inch.  It is used as a microphone jack for EVERY airplane.  Alas, if you do not know that it is a switchcraft s12b, it cannot be found with your search engine."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Tim Leger",
          "Nb_Reviews": 1,
          "Date": "2022-08-27T18:13:41.000Z",
          "Titre": "Talked to tech person as I was unsure…",
          "Contenu": "Talked to tech person as I was unsure if the micro grabbers the 6352 would be what I needed he never said no when I received them Big mistake I opened the plastic bag they were in and then the plastic box takeing extreme care not damage them took 2 out to try on chip But they were not right for my application tech guy was wrong they would not stack side by side on tssopRepacked them tryed to get rma to return 6 days later got Rma number sent them back on my expense 19 days later get email saying they are unsellable and do I want them back or do they throw them out. Oh as the final  insult I get to pay return shipping on them Even though they are no good to me Only cost me with shipping to date $1277.00For the tech guys screw up Thanks for the lesson Don’t deal with Mouser electronics"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steve Jones",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T04:02:07.000Z",
          "Titre": "What happened to Projects?",
          "Contenu": "What happened to using the Project function to build BOMs before committing to adding to a cart? Been using it for years and now it’s gone! That whole process is lost on my iPhone!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "AMIR GUR",
          "Nb_Reviews": 1,
          "Date": "2022-10-26T21:57:02.000Z",
          "Titre": "YOU ADD SALES TAX BUT IT IS ISRAELI…",
          "Contenu": "YOU ADD SALES TAX BUT IT IS ISRAELI COMPANY - MY CATALOG HAVE BAD SERVICE SO WE CAN NOT ORDER FROM THOSE GUYS. PLEASE RETURN THE SALE TAX"
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "Jacob",
          "Nb_Reviews": 1,
          "Date": "2022-07-12T18:25:45.000Z",
          "Titre": "My experience used to be great",
          "Contenu": "My experience used to be great. They had a very fast order processing and shipping no matter what, local or export. You used to get a one person customer service who made responsible for any issues related to your purchase. Now your order can fall in the “export review” process for weeks without getting any updates or estimated shipping date. In case you get an answer or customer service emails they´re signed by “Customer Service Representative”, so you cannot make sure someone is making responsible for the follow up. They keep asking for the same information you already provided. If your order is international, the US representatives ignore it and, if you persist, they refer your case (without giving an answer to you) to your country´s representative, who has no idea about your actual situation and assume your order is going to be exported even if it is not. It is really frustrating. I understand they have their own policies and must have a lot of work due to COVID and chip shortages, but they waste more time by being inefficient in their customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Neal Baker",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T22:00:43.000Z",
          "Titre": "why has my tax exempt status suddenly changed",
          "Contenu": "why has my tax exempt status suddenly become an issue with every order?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Otaku",
          "Nb_Reviews": 1,
          "Date": "2022-12-08T20:04:39.000Z",
          "Titre": "they used my stolen credit card and refused to help me",
          "Contenu": "company id very ok with the use of stolen credit cards and will not help  you once they find out i will never be a customer here way to rip ppl off and they are so so rude just spend ur money on products that are probably not taken by thiefs  and probably are broken anyway vilis mouser"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "privater Kunde de",
          "Nb_Reviews": 9,
          "Date": "2022-04-16T15:03:47.000Z",
          "Titre": "No service on urgent spare parts, no information about horrible delays",
          "Contenu": "Es werden dringend Ersatzteile von Infineon benötigt, die in ausreichender Stückzahl auf Lager sind (Wert ca. 500,00€). Bei Mouser geht niemand ans Telefon, den ganzen Tag am 08.04.2022 nicht, es ruft auch niemand zurück. Also bleibt nur online-Bestellung. Ware bezahlt und für Dienstag, 12.04.2022 bestätigt bekommen.Die Ware ist bis Samstag, 16.04.2022 nicht geliefert, Mouser wollte eine aktuelle Bestätigung nun versenden, auch dieses war eine leere Zusage. Man hätte in der Woche vor dem Bestelltag Streiks gehabt, also hätte ich die Ware auch über den Wettbewerb i England beziehen können, was normal 2 Tage länger dauert, also jetzt längst erledigt wäre.Am Telefon dieses Mal jemand erreicht, aber eine sehr unwillige Dame ohne Verständnis für die ärgerliche Situation.Mouser sitzt Probleme auf Kosten der Kunden aus, informiert nicht, ist nicht erreichbar, ruft nicht zurück, sendet trotz Zusage keine Infos - man steht im Regen.Sendung könnte nun am Dienstag, also eine Woche später eintreffen als zugesagt, oder auch wieder nicht. Fazit: wer Ware wirklich benötigt, darf hier nichts ordern. Vorkasse ist geleistet, Lieferung oder gar Auskunft darüber = Fehlanzeige, auch auf Verlangen keinerlei Unterstützung. Nie wieder Mouser Deutschland.Urgent spare parts needed, moduls from Infineon, on stock at Mouser (system information).Friday morning 8th April no one at telephone, no reaction to urgent recall at answering machine. So online order placed and payed in advance (500,00€). Delivery time given by the system is Tuesday 12th April = o.k.Nothing arrived up today (Saturday 16th April), delayed delivery might arrive on Tuesday 19th April or later.Asked for further information on phone on 14th April (day before holiday) (very long time to wait for service, 1x hanged up by the mouser system). Unpolite and not really interested female assistant on phone, given information: some days before I placed the order has been a strike in another European country, that might cause delays, but no info given to the system. So I did not order the goods at a competitor, who has had the units on its British stock, because of 2 days longer delivery time, but meanwhile it would have been far in advance! The promises email about an update about estimated delivery time or situation has never been sent to me. Conclusion: if you really need some parts, do not order them at Mouser. No replies on phone calls, no or bad service, no responsibilities. Cocksure of oneself staff instead.So never again Mouser Germany (Munich)"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "cheryl alley",
          "Nb_Reviews": 2,
          "Date": "2023-09-06T22:33:37.000Z",
          "Titre": "when I put my order it it said you had…",
          "Contenu": "when I put my order it it said you had 3 now its telling me they are on backorder"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joe Zeimetz",
          "Nb_Reviews": 2,
          "Date": "2022-06-22T16:51:39.000Z",
          "Titre": "They don't know what they are doing…",
          "Contenu": "They don't know what they are doing with the out of state collection of taxes. Completely clueless."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jody Cramer",
          "Nb_Reviews": 1,
          "Date": "2022-05-24T13:52:30.000Z",
          "Titre": "Mouser never sends confirmations to correct email address",
          "Contenu": "My account calls out me email address and yet mouser NEVER sends confirmations to correct email address"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "John Whitefoot",
          "Nb_Reviews": 1,
          "Date": "2022-06-29T17:46:10.000Z",
          "Titre": "Complete scam",
          "Contenu": "Complete scam, part never came and when I tried to return it I never got my money back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel Bell",
          "Nb_Reviews": 2,
          "Date": "2022-08-12T09:49:58.000Z",
          "Titre": "Buyer Beware: Export Review Delay",
          "Contenu": "your export department has delayed every order I have made. Last time it was 4 days."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "N D",
          "Nb_Reviews": 1,
          "Date": "2022-05-06T20:27:27.000Z",
          "Titre": "Used shipping address as billing…",
          "Contenu": "Used shipping address as billing address and would not accept order"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeff Dickerman",
          "Nb_Reviews": 1,
          "Date": "2022-06-01T00:24:39.000Z",
          "Titre": "Your new policy of rationing components…",
          "Contenu": "Your new policy of rationing components sends me to your competitor's websites."
        },
        {
          "Note": 1,
          "Lieu": "AR",
          "Pseudo": "Gaspar de Elias",
          "Nb_Reviews": 1,
          "Date": "2021-12-22T01:44:35.000Z",
          "Titre": "Mouser owes me 1700usd",
          "Contenu": "Mouser owes me 1700usd. One order ( 256380915) sent via FedEx stuck in customs. No refund after 4 months???Second order (256589187) sent via DHL this time. Turns out DHL acknowledged the package got lost in their warehouse. Mouser has not issued a refund yet ( 3 months waiting???)This company is a joke. Get your stuff in DigiKey or some other supplier.Miriam Perez  has not.been able to solve this for.months. I lost all my hope."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Tim  Jones",
          "Nb_Reviews": 43,
          "Date": "2021-11-03T09:11:50.000Z",
          "Titre": "Customer Sevice not proactive",
          "Contenu": "I placed an order with Mouser and it got put on Credit Hold.I understand that orders sometimes get put on hold, this is not what I am complaining about.What I am complaining about is that nobody at Mouser could be bothered to reach out to try to contact me.There was ZERO proactive behaviour at Mouser. I did not discover my order was on hold until I happened to log in and check status.I could have been waiting days and never known if I did not login.Disgusting."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Chris",
          "Nb_Reviews": 2,
          "Date": "2021-09-29T22:29:46.000Z",
          "Titre": "Bad Customer Service",
          "Contenu": "Bought a DIGI device and it did not work. After spending lots of time with technical support I had to contact customer service to return the device and they refused pretending they could not take it back because the box was opened. The worst customer service and very bad customer service. A dispute was opened with Pay Pal. Don't buy from them."
        },
        {
          "Note": 1,
          "Lieu": "PT",
          "Pseudo": "Dave Rigsmith",
          "Nb_Reviews": 4,
          "Date": "2021-03-17T09:15:34.000Z",
          "Titre": "The ongoing Covid issues need resolving…",
          "Contenu": "The ongoing Covid issues need resolving quickly.the delayed packages have been happening most of this year 2021 and getting worse. they even have a automated email system now to deal with the delayed packages. And to add to this Fedex are now taking double time to ship. I am already placing orders much in advance. but I am starting to get tired of this company's hopeless dealing with Covid."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "HaraldB",
          "Nb_Reviews": 2,
          "Date": "2021-04-07T13:20:28.000Z",
          "Titre": "Completely unprofessional service",
          "Contenu": "Completely unprofessional service. Sales representative not aware that UK is no longer member of the EU, making up lies just to avoid telling truth: company is not prepared/willing to pay UK VAT.Accepting sales to UK end-users then reversing it. There are other electronic parts suppliers knowing how to do their job. If there is such big problem with sales, I don't want to know how big problem it will be to exercise your rights like warranty."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Selfors",
          "Nb_Reviews": 1,
          "Date": "2021-06-09T15:41:46.000Z",
          "Titre": "Poor Customer Service and communication",
          "Contenu": "Order charged to my credit card.  Order shows complete.  Shipping tracker shows  printing label.  Used the help system and I received an Email with a form response we will get back to you.  4 days later still no response.  I had to initiate the follow up.  Seems like a small garage operation where the owner went on vacation."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ian L",
          "Nb_Reviews": 1,
          "Date": "2021-01-20T23:59:15.000Z",
          "Titre": "Your iOS phone app is really bad !",
          "Contenu": "Your iOS phone app is really bad !Forgets logins during checkout.Show blank screens during checkout.Shows blank screens when transferring to PayPal payments.Does not remember login credentials, ever !Does not show associated items or suggested items when browsing parts.Take a look at Digi-Key’s app as a reference standard ?"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Tri",
          "Nb_Reviews": 1,
          "Date": "2021-06-01T23:21:51.000Z",
          "Titre": "Wrong photos of the product in the website",
          "Contenu": "Though the picture for their product shows the main unit, it is actually an accessory for it.  The TDS link to the production didn't show any document.Only found out, after receiving the product, which was not the product I wanted to order.  I asked for a refund straightaway.  Received just an email  saying they will look at it.  After 1 week, still have not received any update on returning the goods.Have used them in the past, but seeing their poor response to resolve the issue,  won't be using them anymore."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Esteban Regio",
          "Nb_Reviews": 1,
          "Date": "2020-08-11T20:31:07.000Z",
          "Titre": "Very poor communication, too many surprises.",
          "Contenu": "Very poor communication, too many surprises. Didn't communicate with me when the order was delayed until I asked what was taking so long. Asked me to provide copies of a bank statement to prove the shipping address when it was the registered billing address. Never responded to my several emails about the unusual request for banking statements. To be avoided."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "James Miller",
          "Nb_Reviews": 14,
          "Date": "2020-08-12T09:17:57.000Z",
          "Titre": "Mouser let down by their inability to get the product to you - Digikey much more reliable",
          "Contenu": "Mouser let down by their inability to get the product to you - Digikey  are much more reliable, my product has been stuck with fedex who simply do not care since last Friday, they have delivered here before but yet again the item is stuck. Buy Mouser if you want the mystery of your item turning up on time, if you want it to arrive as expected buy Digikey"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Baz G",
          "Nb_Reviews": 5,
          "Date": "2021-02-21T17:22:48.000Z",
          "Titre": "Still waiting, and waiting and waiting some more",
          "Contenu": "When you read fast shipping from some contributors and my simple fuse order is still at the warehouse 10 days after placing the order I get miffed. I placed an order on their UK website and nowhere prominent does it say orders come from the USA. So, it's looking like a minimum of 3 weeks delivery time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paul Fayet-Faber",
          "Nb_Reviews": 1,
          "Date": "2020-08-12T21:41:28.000Z",
          "Titre": "Purchased UPS 2nd day air and after…",
          "Contenu": "Purchased UPS 2nd day air and after ordering was told that it needed to go with standard ground because it contained hazardous materials. It was not listed anywhere on the site and has delayed my order significantly communicating with personnel. Could not get shipping refunded either. Terrible service go buy from DigiKey instead."
        },
        {
          "Note": 1,
          "Lieu": "SI",
          "Pseudo": "Aleš Eržen",
          "Nb_Reviews": 1,
          "Date": "2019-10-29T08:46:09.000Z",
          "Titre": "No customer support",
          "Contenu": "Ordered wrong item. Immediately contact support via email if they can modify order. No reply. Then via live chat window chat with agent. And the answer was there is no way to modify order because order is already in the \"processing\". Ok, Can I add another item to existing order ? No, you can only create new order (above 60$ to evaluate for free shipping :))"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Chan",
          "Nb_Reviews": 2,
          "Date": "2019-07-04T22:26:30.000Z",
          "Titre": "I had to order the parts twice because…",
          "Contenu": "I had to order the parts twice because of having to review and confirm twice. I had order on 6/2 and couldnt figure out where my order was. When I reordered I realized that unlike Amazon or almost any other site yours requires two reviews and confirmations. My first order was check and verified and I stopped there. Your site needs some sort of warning that two review and confiamtions are needed to order."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pierce Colman",
          "Nb_Reviews": 1,
          "Date": "2021-03-10T15:50:26.000Z",
          "Titre": "We have done business for decades with…",
          "Contenu": "We have done business for decades with you guys. This last order was an incredibly poor experience. 4 Packages were attempted to ship to us. All of them were extremely late. The fourth one still hasn't arrived. It has been one month. Did not get much help then I got no response."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Sasa Djuric",
          "Nb_Reviews": 2,
          "Date": "2021-03-09T16:02:08.000Z",
          "Titre": "Disgrace",
          "Contenu": "For 20€ shipping cost, I would expect at least shipping in a week after ordering, which is not the case. This is the first time I have tried their service, and surely the last. They just move expected shipping date further, day by day. I have manufactured PCBs by JLC, and received it from China in the time Mouser didn't even ship it, and their service is extremely popular. After talking to tech support, thsy told me I cannot cancel my order, and lady started to talk that they work in 3 shifts, like it is something special. Shame on you Mouser!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Peter Donich",
          "Nb_Reviews": 1,
          "Date": "2019-05-23T00:30:56.000Z",
          "Titre": "I'm shipping parts to board assembly…",
          "Contenu": "I'm shipping parts to board assembly house in Bellevue Washington.  Once PCB are assembled, they are returned to my company for Final Assembly.    I don't have a presence in state of Washington, and thus can't generate a Sales Tax Exemption document.  Other parts distributors (Digikey) allow for this without a sales tax event.   We don't have a VAT in the USA../r  Peter Donich Chief Engineer PDATAComm/MaidenRock Communications"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Matthew",
          "Nb_Reviews": 1,
          "Date": "2019-10-03T23:07:02.000Z",
          "Titre": "I have spent 3 days trying to submit an…",
          "Contenu": "I have spent 3 days trying to submit an order because you are now asking for data previously not required (like to reconfirm tax exempt status). I hit process order on Monday the 1st of October and had to re-submit the order today. Mouser should be paying for overnight service when the web-system errors at the expense of your customers."
        },
        {
          "Note": 1,
          "Lieu": "SE",
          "Pseudo": "Thomas Nilsson",
          "Nb_Reviews": 3,
          "Date": "2021-01-14T00:43:58.000Z",
          "Titre": "Horrible service.",
          "Contenu": "Horrible service.Says they ships the same day and 2-3 days shipping time.After three days they still haven't even shipped the goods and all they can say is they are busy, my order is \"almost\" ready and will \"hopefully\" ship \"soon\"."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Denise Andersen",
          "Nb_Reviews": 1,
          "Date": "2020-12-03T17:24:57.000Z",
          "Titre": "I put my name and address in on a…",
          "Contenu": "I put my name and address in on a Christmas present for my husband and you change the shipping to go to him because his name is in your database, even though I put it MY and address in the shipping and billing info. I hate you. See if I buy through you ever again. Not."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "O. Sneed",
          "Nb_Reviews": 1,
          "Date": "2018-05-24T23:27:39.000Z",
          "Titre": "The website is way too technical",
          "Contenu": "The website is way too technical. I went to school and studied electronics and still can't find what I need. You can not type in commonly used terms like heatsink grease or thermal compound  and find what you are looking for. With the close of Radio Shack Mouser is on the last places to turn for electronic parts."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Kelsoroom",
          "Nb_Reviews": 1,
          "Date": "2020-12-01T09:02:08.000Z",
          "Titre": "DODGY",
          "Contenu": "DODGY! Tried to get personal details to verify an address which is very clearly stated on my order. Took 2 payments which neither were the figures I had ordered, they kept saying they hadn't when they had. Had to report as fraudulent to my bank. Keep away from!"
        },
        {
          "Note": 1,
          "Lieu": "UA",
          "Pseudo": "Pxb",
          "Nb_Reviews": 2,
          "Date": "2018-04-25T19:53:04.000Z",
          "Titre": "possible scam",
          "Contenu": "not sent order and last 2 weeks not react to emails. How can  I refund my money? site even have no cancel order buttons----Definitely scam. Another month pass and nothing heppens. Only ask to wait more . No money, no No proof of thay do anything. I have to ask bank, maybe it can return money and block this scammers"
        },
        {
          "Note": 1,
          "Lieu": "NO",
          "Pseudo": "Adrian",
          "Nb_Reviews": 1,
          "Date": "2020-09-08T16:43:40.000Z",
          "Titre": "Mouser Electronics needs more time…",
          "Contenu": "Mouser Electronics needs more information from the supplier to be able to export the order after i've sendt all the documents they required, paid for the items and made sure that every single item was on stock. Cancelled my order after 4 days. A waste of time!"
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Arne",
          "Nb_Reviews": 29,
          "Date": "2020-11-11T17:24:21.000Z",
          "Titre": "Nordic: Worst Customer Support ever experienced",
          "Contenu": "Received a wrong part. Complained immediately by e-mail and wrote I urgently needed a replacement. Gave all relevant info in first e-mail. The reason was clear from the start: A mismatch between part description and internal part no. in Mouser database. Anybody could verify this by looking up the part on the website. Now Customer Support dragged me through 6 email rounds each time asking new irrelevant questions and photo documentation. I answered right away. Next email from Mouser came at best next day. I complained first time October, 22 and still not got the right part November, 11. Incredible."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "anon",
          "Nb_Reviews": 2,
          "Date": "2017-09-15T13:02:41.000Z",
          "Titre": "Your site is poor",
          "Contenu": "Your site is poor. The part Kycon STPX3501C should come with the hardware to be able to mount it without having to struggle to get the information and use the part. Mouser is currently set up for the customer to miserably fail all the time. We are going to shift business away from Mouser because of this."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric Gerstnecker",
          "Nb_Reviews": 1,
          "Date": "2020-04-07T15:05:08.000Z",
          "Titre": "Can't find stuff without assistance",
          "Contenu": "Can't find stuff without assistance. Can't fix email in my account and now there is a problem with my company name, was fine before.This site sucks. I used this site with no problems in the past.Wasted about a hour! Not happy. I will find a different vendor."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "DTC",
          "Nb_Reviews": 5,
          "Date": "2015-11-18T00:50:07.000Z",
          "Titre": "Component Filtering Choices for items",
          "Contenu": "I can never get the \"filters\" to apply so I can narrow down the available choices. I have never liked the filtering the way it is set up now. You have to hunt, pick, try, change to get to a component you would like. I make my choices but the \"APPLY FILTERS\" never highlights. MOUSER is trying to tree down to far with to many choices per component! I have been buying parts from Mouser for years... I like things before the \"extensive\" filtering... it could be made simpler again."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Paul Ferragut",
          "Nb_Reviews": 6,
          "Date": "2017-10-09T15:38:44.000Z",
          "Titre": "Deceiving experience",
          "Contenu": "Deceiving experience-I ordered only products available in stock, however only half of my order was delivered, the other half was back ordered and available 1 or 2 months after.I asked for a refund instead of waiting for the backorder, the refund takes 2 to 3 weeks.-I wanted to pay with normal online checkout. However they did not accept the online payment and asked to create a customer account and required a bank transfer. The payment process validation took 3 days before the order got fulfilled. Thus more delays for the order."
        },
        {
          "Note": 1,
          "Lieu": "PT",
          "Pseudo": "ND",
          "Nb_Reviews": 4,
          "Date": "2021-02-11T19:04:29.000Z",
          "Titre": "Dreadful service so far",
          "Contenu": "Ordered a sensor, plenty in stock, company takes pride in its \"same day dispatch policy\" where it's plastered everywhere, yet 48 hours later still no signs of it being sent out.Edit: Turns out that the site makes 0 mention to shipping strictly from the US, and you'd might think that with several branches in the EU there'd be a warehouse in the EU.Proceeded to cancel order with assistant via live chat and no refund so far.Edit 2:Despite the service provider's casual response below would just like to point out that the refund was not processed so far, nor have they responded to my email in this regard."
        },
        {
          "Note": 1,
          "Lieu": "FI",
          "Pseudo": "regular buyer",
          "Nb_Reviews": 1,
          "Date": "2020-11-02T07:32:15.000Z",
          "Titre": "Think many times before you order from mouser",
          "Contenu": "Think many times before you order something from mouser. They send me defective + incomplete products and do not accept returns. For 30 days they claim to need time to investigate the case, but eventually the mouser stops responding to my emails."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sam Brandom",
          "Nb_Reviews": 1,
          "Date": "2019-12-26T17:16:23.000Z",
          "Titre": "Horrible company",
          "Contenu": "Horrible company! Stole our money the day before Christmas! Wouldn’t even tell us what was ordered by our credit card UNAUTHORIZED. Said the would need a subpoena. So essentially protected the thieves over us, which is essentially aiding and abetting!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeffrey Brown",
          "Nb_Reviews": 1,
          "Date": "2021-06-18T21:33:57.000Z",
          "Titre": "Charging shipping for backordered…",
          "Contenu": "Charging shipping for backordered items?! Reply 6/18/21:But you don't offer any discount on the initial shipment to offset cost of backorder shipment. Not right to charge customer extra for your lack of product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David De",
          "Nb_Reviews": 2,
          "Date": "2021-08-08T06:24:48.000Z",
          "Titre": "I had to build my freaking cart 3 times",
          "Contenu": "I had to build my freaking cart THREE or FOUR times and even then I had to submit order a dozen times.   And there were even more problems after all THAT.    Usually, you guys are great, but this experience sucked."
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "Amir",
          "Nb_Reviews": 1,
          "Date": "2018-08-15T11:27:40.000Z",
          "Titre": "Do not buy from mouser!",
          "Contenu": "Do not buy from mouser! Their customer service is unacceptable! They would not refund a purchase that had shipping issues.EDIT: After seeing mouser's comment I reached out to them but got no response. I still recommend any prospective customers to stay away."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anthony Andriano",
          "Nb_Reviews": 2,
          "Date": "2015-09-21T14:59:24.000Z",
          "Titre": "Very inconvenient order status",
          "Contenu": "I just submitted an order and the Print PDF option didn't include shipping. Why the hell wouldn't I want to see the shipping charge in my total bill? I'm trying to keep track of receipts for a business and shipping is part of my cost. Ridiculous. Back to Digikey."
        },
        {
          "Note": 1,
          "Lieu": "FI",
          "Pseudo": "EH",
          "Nb_Reviews": 2,
          "Date": "2022-03-10T20:00:22.000Z",
          "Titre": "Poor service after receiving incorrect item",
          "Contenu": "Ordered a bunch of products. One product in the shipment was wrong. Been trying to get a resolution via e-mail and phone for the past three weeks to get a resolution (preferably shipment of the product I have actually paid for). According to the web store there is stock for the product in question and about 50 alternatives for it in stock. Was first offered a refund due to insufficient stock of alternative items (even though there seemed to be stock for the originally ordered item too). After asking why can't Mouser just ship the original item, I have been just told repeatedly that \"We will get back to this soon...\" and no contact from Mouser after that. The reason why I chose Mouser over Aliexpress etc. was that I needed the correct parts fast. Won't make that mistake again."
        },
        {
          "Note": 1,
          "Lieu": "PR",
          "Pseudo": "Shark Claus",
          "Nb_Reviews": 1,
          "Date": "2021-04-26T20:11:00.000Z",
          "Titre": "Whole process was delayed by 3 days. Refuse to do anything",
          "Contenu": "Whole process was delayed by 3 days because they forgot to confirm my order. A time sensitive package which is the whole reason I paid for better shipping, and they didn't give me anything to compensate for it. n"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Stephen Gleeson",
          "Nb_Reviews": 17,
          "Date": "2018-07-13T21:16:11.000Z",
          "Titre": "Cancelling orders for parts they have in stock without any explanation",
          "Contenu": "Dreadful company to do business with. I placed another order and paid by Visa Debit only for them to cancel it a few hours later with no explaination. Go to Digikey the process is much easier and they never cancel orders for parts they have in stock."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Dettmer",
          "Nb_Reviews": 1,
          "Date": "2018-01-29T18:32:14.000Z",
          "Titre": "This \"CAPTCHA\" & JAVA crap is extremely …",
          "Contenu": "This \"CAPTCHA\" & JAVA crap is extremely annoying coming up all the time. Makes me lose what I am thinking about and some times won't even let me add things to my project. Called customer service this morning and talked with \"Misty\". She insisted that it has to be there to protect me and the web site. It only protects me from purchasing things from you. She suggested that I buy from some other source. Sorry, but I have to agree. After a lot of years with Mouser, this may very well be my last order if you continue to make it so difficult to order, and you don't care if I do."
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "casper.usenet",
          "Nb_Reviews": 1,
          "Date": "2019-10-31T07:46:18.000Z",
          "Titre": "They never ship as promised.",
          "Contenu": "They never ships out in time, even when ordering well before cut-off times. Especially when ordering on fridays. This is for both CC orders and NET orders. Never have problems with DIgiKey, Avnet or Arrow. We will not use Mouser anymore."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scott Ramirez",
          "Nb_Reviews": 1,
          "Date": "2017-12-06T20:23:01.000Z",
          "Titre": "Very terrible customer support",
          "Contenu": "Very terrible customer support. I bought a beagle board blue from them. It arrived with a connector that was broken off and another connector that was barely hanging on. I am using the board for a robotics project and its completely useless as it is. I emailed mouser thinking i was going to get a replacement sent out right away. Instead, they chose to interrogate me, ask me questions that take them a day or more to reply to, and then proceed to ask for pictures. Its been 5 days and I have still not received any instructions on how to get a replacement from them. I will personally never use this company again."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Lucy Cole",
          "Nb_Reviews": 1,
          "Date": "2018-06-04T12:50:10.000Z",
          "Titre": "Very poor customer service",
          "Contenu": "Very poor customer service, order arrived 6 months late and was still sent with the more expensive delivery service (next day) with no option to change it even though the order came 6 months late!!! Absolutely will not use Mouser UK again."
        },
        {
          "Note": 1,
          "Lieu": "SE",
          "Pseudo": "Mikael Fernholm",
          "Nb_Reviews": 3,
          "Date": "2017-06-19T13:58:06.000Z",
          "Titre": "I tried to order items for a project …",
          "Contenu": "I tried to order items for a project that is ongoing.First I get some email that is basically exactly formulated as a Phishing Scam. I reply to it since it is important that I get my parts to the developer since there is a deadline, but exactly as a Phishing Scam I get no reply.Some days go and I start to wonder where the parts are so I send another email and yet again no answer.Some time goes again and I get worried why there is such a big delay, I check my account and I can not find the transaction so I send another Email. Yet again, no reply.This is the first time I buy from \"Mouser\" and probably the last."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "W. Crowe",
          "Nb_Reviews": 1,
          "Date": "2016-09-20T17:31:43.000Z",
          "Titre": "Ordering errors nightmare",
          "Contenu": "The Mouser ordering app is broken.  When any error is detected in the order submission, the app directs the customer to correct the error.  However, the app gives the customer NO INDICATION of where the error occurs.  Flippin' moronic code!"
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Patrick",
          "Nb_Reviews": 6,
          "Date": "2021-06-23T16:34:52.000Z",
          "Titre": "Very poor customer service - returns",
          "Contenu": "Needed a soldering station and Mouser had the right kind of product, but only upon receipt did. I notice they were marketing North American rated product (120V/60Hz) product in Germany (220V/50Hz). No reply to electronic returns request. Calls to local customer service dropped upon transfer to person without any interaction. Chat function gets India in out of local office hours, very friendly, but can’t help in this case. In office hours could get transferred to local chat team, but unfriendly and unable to help. Escalate feature on website resulted in a bounced mail, e-mail address at Mouser no longer valid! Guess I have to drive to Munich, lucky for me just 50km away. Seems I have a destination to aim for as soon as I clear isolation"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian Mellea",
          "Nb_Reviews": 1,
          "Date": "2020-09-28T20:03:29.000Z",
          "Titre": "Incredibly hard to use checkout…",
          "Contenu": "Incredibly hard to use checkout process. This is something from 2001. No easy create an account, add another credit card, more.  One of the worst checkout processes. I'll go back to DigiKey, TD, L-Com more."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Tom S",
          "Nb_Reviews": 19,
          "Date": "2023-03-10T22:46:35.000Z",
          "Titre": "Received broken components",
          "Contenu": "Received broken components, Mouser customer service was genuinely awful."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jake Withecombe",
          "Nb_Reviews": 5,
          "Date": "2020-12-30T08:42:07.000Z",
          "Titre": "Incompetent",
          "Contenu": "My experience with Mouser has honestly been one of my worst ever experiences. Placed an order, 2 days later (after promising to ship the order immediately), they ship it.They screw up the shipping information so Fedex reject the order and send it back to them.They do nothing.I chase, they say I have to wait for them to handle the 'return' before they can reship it.They eventually reorder it for me 9 days later and the order STILL HASN'T SHIPPED.What is wrong with these people? They are utterly incompetent at fixing a mistake.To make matters worse, their customer service teams just tell lies and the complaint escalation form on their website doesn't get answered after 72 hours.ORDER NO. 252946633"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian Winter",
          "Nb_Reviews": 1,
          "Date": "2021-03-19T07:54:30.000Z",
          "Titre": "After 5+ years of excellent service....",
          "Contenu": "After 5+ years of excellent service, I’ve recently run into several issues during the last few weeks (prompting me to search online to see my issues are isolated).  After reading these multiple reviews, clearly there is a systemic problem that we’re not being informed of.Why suddenly, in the last few week, is COVID being a scapegoat (that hasn’t existed for the last year)?Delayed in orders, then received an incorrect part.  Delayed customer-service contact with no follow-up on how to return the incorrect shipment.  Had to go ahead and re-order (on my own $) with a product that was in-stock, only to find out that it isn’t actually in-stock and now delayed for months.  I certainly wouldn’t have ordered/paid for a product (TWICE), that isn’t available."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mr Cris Matthews",
          "Nb_Reviews": 26,
          "Date": "2021-03-26T09:52:44.000Z",
          "Titre": "2 Weeks, Still No Delivery!",
          "Contenu": "I get it, Covid, Brexit etc... these are problems, but they seems to being used as excuses to not put things right.Why am I sat here 2 weeks after ordering still waiting for a delivery, when just about all their competitors have managed to avoid these problems and deliver in a reasonable time frame?Firstly it took over a week to pack and ship my order. Up front their said a possible 2 day delay. Unacceptable.Then FedEx got their hands on it, ohhhhh my word they are terrible at the moment. I've had shipments from UPS and even USPS within these timescales deliver pretty much on time. It's been sat in their UK warehouse for 2 days now without moving. Frustrating is not the word! Come on Mouser, you were once incredible, what has happened to you?"
        },
        {
          "Note": 1,
          "Lieu": "PH",
          "Pseudo": "Carlo P Somontan",
          "Nb_Reviews": 2,
          "Date": "2021-10-28T23:13:06.000Z",
          "Titre": "this company will take money from you…",
          "Contenu": "this company will take money from you debit card and cancelled your order. costumer support sagar will ask you credit card details. then cancelled. dot buy from this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "patham",
          "Nb_Reviews": 1,
          "Date": "2020-09-08T17:12:11.000Z",
          "Titre": "After they charged my card they wanted…",
          "Contenu": "After they charged my card they wanted me to verify my address/billing by sending in a driver's license and bank statement? My address is good and the same for both. Never had this happen anywhere I've shopped online and not willing to jump through hoops to get the order delivered. Cancelled, awaiting a charge back on my CC now.I'm not buying your canned response. My CC even said they never heard of that before. You had all the information you needed to verify it was my card and I was who I said. And if you were so concerned about the safety of your online customers then why did you charge the card BEFORE you requested additional information? If the info you had raised some sort of red flag for you why would you not address that first? First time buyers beware."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Emmanuel W",
          "Nb_Reviews": 3,
          "Date": "2021-04-27T19:03:18.000Z",
          "Titre": "Website running extremely slow…",
          "Contenu": "The website has been running extremely slow for a lot of months now. We are losing production time waiting to navigate from one page to another. Please fix this problem."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "charles fox",
          "Nb_Reviews": 5,
          "Date": "2023-11-28T19:51:37.000Z",
          "Titre": "Difficult to navigate parts catalog - refused return",
          "Contenu": "Bought a pair of Google Neural Processing units. There is one versions using PCIe interface and two other wih oddball M.2 interfaces. Its unclear which one they will deliver seems hat they were out of stock on the PCI versions so they just shipped me 2 impossible to use M2 devices. They asked for a picture of what was delivered and said sorry you cant return it because its open. Nice huh? not sure how I was supposed to make that work. Just remember there are options like seedstudio, Microcenter etc that carry a lot of these things. Sorry that Mouser doesn't seem to care about the customer experience."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Daniel Riegel",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T17:30:16.000Z",
          "Titre": "My order was cancelled without any notification",
          "Contenu": "My order was cancelled without any notification. I am so irritated - could you not send an email to notify a customer that there was an issue with their order? And I called customer support today, and they had no idea why it was cancelled, instead wasting my time speculating about whether the cc address was wrong (it was not). Then, the second person I spoke to on the call just dropped the connection. When I called back, the first person who answered seemed to recognize that I was very frustrated, and connected me to a much more helpful person who (it appears) is going to fix things up. But really, why don't you email the customer when you cancel their order. It's a really bad customer experience. However, I upgraded this review from 1 star to 2 because the last person I spoke to was friendly and helpful."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David Jones",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T20:42:31.000Z",
          "Titre": "Check out your website",
          "Contenu": "Check out your website! I'd select an item then buy X amount and it would come up and say X ordered item for $ amount and under that proceed to checkout or continue shopping. When I select continue shopping it did nothing! I would have to go to your search at the top of your page and the item I wanted from there to continue shopping."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Terri O",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T17:15:29.000Z",
          "Titre": "I don't like the layout of the online…",
          "Contenu": "I don't like the layout of the online ordering process.It should be streamlined.The purchase order number and the ship via need to go in the front/first portion of the form.  Ship via s with our account number for FEDEX or UPS should come up automatically.  We shouldn't have to every time check off N30, ETC.  Or did I miss something when i signed up?Let me know.  Thanks,Terri Oberinger"
        },
        {
          "Note": 2,
          "Lieu": "JP",
          "Pseudo": "SR",
          "Nb_Reviews": 3,
          "Date": "2022-08-05T10:38:51.000Z",
          "Titre": "Lack of responses to emails is irritating",
          "Contenu": "Mouser will deliver what you order; just don't expect a response to your emails.  I placed an order and realized I ordered less of a part than what I needed.  I emailed immediately and got no response.  My order has shipped and I still haven't received a response.  I ended having to pay shipping twice, which is not cheap.  If I didn't need the exact same part I would have ordered elsewhere.  Disregarding standard business courtesy by not replying to emails at all or in a timely manner is a big pet peeve of mine.  I will be ordering elsewhere for my future orders.  UPDATE: I sent the email as requested.  Received one reply asking for more details and after I provided them, radio silence again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jim Fillman",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T01:07:03.000Z",
          "Titre": "Disappointed in Live Chat…",
          "Contenu": "I was disappointed your Live Chat feature was closed when within your posted hours. I tried Saturday at 5:53 pm Central time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jacob Rubin",
          "Nb_Reviews": 2,
          "Date": "2022-05-04T02:47:40.000Z",
          "Titre": "Sluggish online ordering system!",
          "Contenu": "I love purchasing from Mouser but your online ordering process sucks. Multiple minutes to complete searches, update my cart, and check out. Often sends me to Digikey!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "M.I. Blachowicz",
          "Nb_Reviews": 1,
          "Date": "2023-01-23T00:37:12.000Z",
          "Titre": "Telephone number requirement",
          "Contenu": "Drop the assumption that everyone has a telephone, and therefore it's okay to REQUIRE the number to be entered to place and order.Telephones are not a prerequisite of living in the US."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joseph Holtzinger",
          "Nb_Reviews": 14,
          "Date": "2023-07-16T05:38:06.000Z",
          "Titre": "Very difficult to “drill down” to the…",
          "Contenu": "Very difficult to “drill down” to the 27 ohm, 1/2 Watt resistor I was looking for. Filters not as helpful as I expected"
        },
        {
          "Note": 2,
          "Lieu": "JP",
          "Pseudo": "Tivadar J Horzsa",
          "Nb_Reviews": 7,
          "Date": "2023-06-05T04:19:44.000Z",
          "Titre": "I tried you on line Chat and got no…",
          "Contenu": "I tried you on line Chat and got no response for 10minutes and I also sent an email and got no response."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joe W.",
          "Nb_Reviews": 2,
          "Date": "2023-03-16T22:59:08.000Z",
          "Titre": "Painfully slow site",
          "Contenu": "I usually like how the site works, but it's painfully slow today, which cost me a lot of time."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "DS",
          "Nb_Reviews": 2,
          "Date": "2021-11-27T14:27:05.000Z",
          "Titre": "Parts from around the world.",
          "Contenu": "Ordered from the UK website which had a UK contact number also. Turns out the 3 small items I ordered were in fact located and shipped from the US. Alarm bells should have rung when the shipping was £12 International courier.Had I know the air miles this would have clocked up I may have chosen not to purchase from this company.One item was faulty and after a week of waiting for a response I finally have a replacement being sent from the US......again. Fingers crossed this one is ok."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Patrick McGuire",
          "Nb_Reviews": 1,
          "Date": "2021-10-26T05:47:34.000Z",
          "Titre": "I resell what I purchase",
          "Contenu": "I resell what I purchase. Nevertheless, you have decided to charge me CA sales tax on some items. I have executed a CA resale certificate. That doesn't seem to matter. I realize Mouser has nexus in CA, nevertheless, I am reselling, not consuming, these items. Now I have to jump through accounting hoops to reclaim the funds from CA."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Billy Parrish",
          "Nb_Reviews": 1,
          "Date": "2022-03-06T17:07:00.000Z",
          "Titre": "This has to be the most confusing site…",
          "Contenu": "This has to be the most confusing site I have ever tried to order from. It took me 4 o5 tries to figure out how to and I really don't know if the order is correct. I finally just hit the checkout button to see what I get.  Terrible ordering format !"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "CharlesL",
          "Nb_Reviews": 1,
          "Date": "2021-03-19T11:52:25.000Z",
          "Titre": "What is the real cause for order delays?",
          "Contenu": "Until a few weeks ago I would have given Mouser 5 stars. After almost a year of covid barely slowing them down they have come to a screeching halt and are blaming it on covid. It seems the problems started after the February freeze that impacted most of Texas. Mouser's warehouse utilizes a lot of automation and I have to wonder if something happened to their system that forced them to fill orders manually."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Tim",
          "Nb_Reviews": 3,
          "Date": "2021-03-01T18:12:45.000Z",
          "Titre": "Shipping delays",
          "Contenu": "I've used Mouser on numerous occasions without undue delay, but recently shipping and delivery times have become excessive.  Mouser put this down to Covid and trouble in Texas, maybe so but other companies do not seem to be having the same problems.  I'll stick with Digikey in the future who also ship from the USA but don't seem to suffer the same problems."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael L",
          "Nb_Reviews": 5,
          "Date": "2021-06-20T01:38:46.000Z",
          "Titre": "Your online service us terrible. I can't cancel and order in progress",
          "Contenu": "Your website deleted one of my ship to addresses and caused me to have to reenter the address and double order. On top of that I can't cancel the first order that had the bad address. There is no way to cancel and order in progress and there is no way to reach a real human to try to cancel it that way."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David Haessig",
          "Nb_Reviews": 1,
          "Date": "2020-06-26T00:09:35.000Z",
          "Titre": "online order failed",
          "Contenu": "I placed an online order earlier so I would get the parts on Monday.  Now I find the order didn't enter and had to order now, costing me an extra day.  This all had to do with setting it up as a project.  That was confusing and somehow doubled the order.  When I fixed that, it must have dumped the order.  Disappointed. I should have called the order in.  Slower and not as efficient, but the inside sales crew is very helpful and accurate."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gary Tompkins",
          "Nb_Reviews": 1,
          "Date": "2022-01-31T18:15:53.000Z",
          "Titre": "Website Speed",
          "Contenu": "For decades I have been relying on Mouser to provide most of the electronic components used in our business. While I still think you have the best pricing and customer service in the industry, over the past year your website has been slow to the point I've taken business elsewhere.  You are by far my preferred supplier but I do not have the time to wait up to 5 minutes for a page to load each time another filter is selected.I have no idea what happened, your site used to be just as fast as any other. I've checked on my end and found nothing. I figured it would correct itself sooner or later but that isn't happening, thus this review."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "AK",
          "Nb_Reviews": 1,
          "Date": "2021-03-13T17:23:03.000Z",
          "Titre": "Mouser was at one time the go to place, but not anymore!",
          "Contenu": "They were at one time the go to place. Not anymore.Their services has really slipped over the last few years. I know as I have placed dozens of orders from them. Its become common now for them to be late on our orders - no matter if the items are in stock or of we order several weeks in advance of the date we tell them we need it by. We're trying to run a company, I'm not sure what Mouser is trying to do. I have started ordering from their competitor which starts with the letter D and the level of service is night and day."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 2,
          "Date": "2020-06-29T19:11:16.000Z",
          "Titre": "Quantities wrongly increased during checkout",
          "Contenu": "I had a long order, during checkout, it increased the quantities by a multiple (1 to 2, 10 to 20, etc.), when I would correct the quantities, during the next checkout attempt, it increased by another multiple (1 to 3, 10 to 30, etc.). After a few days it seemed to straighten out so I could check out with correct quantities."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Paul Margolis",
          "Nb_Reviews": 2,
          "Date": "2021-04-11T16:54:52.000Z",
          "Titre": "Best Electronics Store but Worst Interface..Sad for Mouser and us",
          "Contenu": "I like that you have a normal charge for shipping. I could not stand using your miserable interface a moment longer, so I needed to just get the inductor I needed, And the shipping was $8 for a $20 order (which is absurd). Then I noticed the hidden page that had $3 as the shipping. Whew! I would buy a lot of stuff from you if you could make the hobbyiest items so I could find and see and order them. Theyare all buried in the profesional stuff.Please offer a better interface.Paul (It's probably the worst store interface on the internet)"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rahav Dor",
          "Nb_Reviews": 2,
          "Date": "2021-11-17T14:58:57.000Z",
          "Titre": "Shipping cost",
          "Contenu": "I'm a new customer. I made a deliberate effort to buy from you as a tribute to how long you have been serving the industry. I like your products and variety.However, I almost didn't buy from you at the end because of the shipping cost. In a world where everyone ships free this business model doesn't work any more.In my opinion you are losing a very large market segments of hobbyists and small startup companies to Amazon. Since I used your web site to search for the product I needed I didn't go ahead and buy it elsewhere, where I could get the shipping free of charge. But I'm not sure I'll return."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jon Juett",
          "Nb_Reviews": 1,
          "Date": "2021-04-21T17:48:03.000Z",
          "Titre": "The search ability of the web site…",
          "Contenu": "The search ability of the web site seems to not be working correctly. After long waits one gets a blank white screen. It took hours to assemble this small order. I had to go back through old orders from 2015 to find where I had ordered the component previously then reorder it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Daniel Joffe",
          "Nb_Reviews": 1,
          "Date": "2018-10-24T13:44:55.000Z",
          "Titre": "2 is too pessimistic...but I was…",
          "Contenu": "2 is too pessimistic...but I was annoyed that there was \"nothing that could be done to speed up\" resolution of a shipping weight issue based on an error in the web-site. No time line could be given...would it be a day? would it be a week? The option of speaking directly to the persons who investigate such things was not presented, so if they're confused...the problem will linger."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2019-02-07T16:05:43.000Z",
          "Titre": "I'm a bit frustrated that it happened twice now?",
          "Contenu": "I'm a bit frustrated that two times in a row a particular fan #5912-255/2N is completely out of stock and none were on order? A 22 week lead time is UN-acceptable in my opinion. These fans in this size 25 x 25 x 8mm @ 5v, .4w with a tach wire should never be completely out of stock. Two should be the min that triggers an automatic re-order. They are just too inexpensive to be out all the time. 22 weeks to wait for an order to come in is ridiculous?"
        },
        {
          "Note": 2,
          "Lieu": "IL",
          "Pseudo": "M Yachad",
          "Nb_Reviews": 4,
          "Date": "2018-05-08T12:55:45.000Z",
          "Titre": "Staff do not understand English",
          "Contenu": "In spite of explaining CLEARLY in plain English to the Export Department clerk, that my order is a drop-shipment to a customer INSIDE the USA, he insisted that I am exporting the order, and refused to process it. He has a problem with understanding plain English, and negatively affects this customer's satisfaction with Mouser. Mouser subsequently cancelled my order, and I placed the identical order with Digikey, which Digikey shipped within 12 hours, with no problems."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Denver Reviewer",
          "Nb_Reviews": 2,
          "Date": "2015-10-05T04:25:40.000Z",
          "Titre": "Not the cleanest order process",
          "Contenu": "Was wondering what happened to my order.  Apparently id didn't get placed.  Most likely was due to the taxable/nontaxable checkbox.  Please streamline the order process.  Taxable/nontaxable can be set in the user profile with a default shown in the order that the customer can change per order.  Don't require a selection on each order.  Other companies (Amazon, McMaster etc) have simpler order processes.  Simplify yours!  Now have to pay premium shipping on my parts."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "DANIEL",
          "Nb_Reviews": 8,
          "Date": "2018-09-18T22:39:15.000Z",
          "Titre": "It's really a hassle to have to fill…",
          "Contenu": "It's really a hassle to have to fill out a tax exempt for each part number I order when the parts are all of the same type with different tips styles. It wouldn't take a Rocket Scientist to figure this out but it seems like Mouser doesn't have the right people to address this."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "DANIEL",
          "Nb_Reviews": 8,
          "Date": "2019-07-10T17:57:51.000Z",
          "Titre": "it's been over a year since I was told…",
          "Contenu": "it's been over a year since I was told the resale info would be in place. I still have to request a resale on items I buy that are similar. No other distributor is doing this and not sure why a company as large as Mouser doesn't have an IT dept that can figure this out."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kyle",
          "Nb_Reviews": 2,
          "Date": "2019-05-04T19:27:32.000Z",
          "Titre": "The website checkout process is…",
          "Contenu": "The website checkout process is terrible. I change my shipping and delivery address in the account settings and it changed it back to the old address during checkout. Also, there was an option for economy shipping that simply disappeared as I went to submit the order."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 3,
          "Date": "2020-11-02T19:59:06.000Z",
          "Titre": "On line ordering is far too difficult…",
          "Contenu": "On line ordering is far too difficult especially when trying to locate individual electrolytic capacitor values.Many other items are also very difficult to locate. Would be much simpler with the old paper catalog. Send me one if you have one!"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Peter Platt",
          "Nb_Reviews": 1,
          "Date": "2020-07-09T13:33:36.000Z",
          "Titre": "Unbelievable shipping charges",
          "Contenu": "I guess you can't argue about the choice and stock, but unless you will qualify for free shipping (over £30?) then don't bother. The cheapest uk shipping option offered is FedEx International Priority at £12 at the time of writing"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael Simmonds",
          "Nb_Reviews": 2,
          "Date": "2020-11-30T21:59:16.000Z",
          "Titre": "DigiKey has a much better site for searching",
          "Contenu": "DigiKey has a much better site for finding items.  Try searching for a certain size of potting box on the Mouser web site compared to DigiKey. We only use Mouser if DigiKey does not carry the item.Sorry to say this, but it is true."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James  Herring",
          "Nb_Reviews": 3,
          "Date": "2016-09-02T18:59:34.000Z",
          "Titre": "Very poor on line catalogue search.",
          "Contenu": "Today I was looking for a 4 circuit mini phone plug. Part# /Keyword did not recognize mini phone plug, phone plug, or even plug to get me to a place where I could do a better search. I have had the same problem with looking for electrolytic capacitors. I sometimes just give up or have to call directly and talk with a tech. Seems like the search could be improved!  Also I call and think I have my acct straightened out when next time I log in to order it doesn't recognize my user name or password and so I have to put in all of my information again, a real time waster for me!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ray Van De Walker",
          "Nb_Reviews": 1,
          "Date": "2016-08-04T18:41:56.000Z",
          "Titre": "Shipping costs more than parts",
          "Contenu": "A USPS parcel post option would have saved half the cost of the order.Also, I had to enter my changed address four times.  A \"shipping same as billing\" would have been helpful.  So would a system that just did what I told, instead of trying to be helpful."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "David",
          "Nb_Reviews": 31,
          "Date": "2021-03-22T15:57:57.000Z",
          "Titre": "From A1 service to pretty poor in a few weeks",
          "Contenu": "I've used Mouser as a UK customer for the last 8 years to supply most parts for my Amplifier overhaul business and they had been superb. Great stocks of quality parts coupled with really rapid shipping via Fedex meant orders were here within a 2 to 3 days and often beat UK suppliers.  Not any longer,  long delays in shipping the order out of the warehouse and on top of that Fedex now have serious delays with my current order stuck in Memphis for the last 4 days. Fail to understand how you did so well through a difficult year when most weren't and then just fall to pieces in the last couple of months. Will switch to Digikey for the next major order and see how they do for a while before coming back to Mouser."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Lord",
          "Nb_Reviews": 1,
          "Date": "2016-04-29T22:07:31.000Z",
          "Titre": "Online processing took six days, Digikey out the door the same day.",
          "Contenu": "We are spoiled, with Amazon and the like.  When one places an online order for a product in stock we expect it to be processed the same day.  In this case the order was placed and accepted Thursday and it wasn't until the following Tuesday that we were made aware that a mailing label was generated and we should expect the package a week later using USPS three day delivery.  The USPS did better and we got the package 8 days after we ordered it.  Definitely not instant gratification by a long shot.  We will try this again and see if this was a fluke or if this is the way Mouser Electronic values and processes online orders."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brad Whipple",
          "Nb_Reviews": 1,
          "Date": "2015-07-27T14:59:42.000Z",
          "Titre": "I need to print an invoice but shipping info not included",
          "Contenu": "Where the heck is the shipping info. I need to print an invoice since this is a company purchase and have very little concern for any cost other than what is charged to the card. The TOTAL price is what needs to be annotated by accounting"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "steven campbell",
          "Nb_Reviews": 1,
          "Date": "2018-09-21T21:03:36.000Z",
          "Titre": "I will be taking my business elsewhere…",
          "Contenu": "I will be taking my business elsewhere for products that we use in production but are automatically taxed by mouser for.  This is a real pain to have to fill out a form and send it in to get reimbursed for taxes."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nels",
          "Nb_Reviews": 1,
          "Date": "2015-09-08T17:32:42.000Z",
          "Titre": "Hard to get non-taxable accout setup",
          "Contenu": "Have followed instructions on 3 separate occasions to submit California sales tax exemption to Mouser.  They still ask e-mail me asking to send one to them and tell me to do the same thing I have done already."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alan Garren",
          "Nb_Reviews": 1,
          "Date": "2017-09-12T23:26:48.000Z",
          "Titre": "Bad Mouser shipping experience.",
          "Contenu": "I have used Mouser for well over 20 years, recently their shipping has started to get a little weird. The latest is I ordered 3 items last Thursday, 100 each, all in stock in the multiple thousand quantities. The order finally made shipping today, Tuesday. So much for there touted same day shipping. This happened the last time I ordered as well, I don't know what is happening but they are not getting things out the door in the promised fashion. They have been a good source of parts for me in the past, and I hope so in the future. But they need to get the shipping under control.This is my response to the reply from Mouser-I have been in touch with you regarding this order, needless to say I was underwhelmed by the response(s) I got. The result is this post."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brian C",
          "Nb_Reviews": 1,
          "Date": "2018-02-22T02:33:31.000Z",
          "Titre": "Be very careful what you purchase on…",
          "Contenu": "Be very careful what you purchase on their website, they don't clearly mark what a unit equals for the item you are purchasing.  For instance you are buying a 6ft stick of conduit with a unit price of 6 dollars, one would assume that is 6 dollars per 6 ft stick, with a 54 stick minimum, with no mention anywhere of per foot, so in reality, after I receive the item, I find out the unit equals per foot not per stick. So your shipment comes in with 9 sticks of conduit, not 54.  Very deceiving.  After acknowledgment from sales support that website is not clear at all, no RMA is offered because it was a drop shipped item, not stocked.  Tough luck.  Rep said he would see what the manufacturer might do about it, when this has nothing to do with them.  Im not holding my breath..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tony T",
          "Nb_Reviews": 4,
          "Date": "2019-08-21T01:40:56.000Z",
          "Titre": "I sent a message about a previous…",
          "Contenu": "I sent a message about a previous order..I received 2 different contradictory e-mails and it seams no one really read my request .. which is the reason I am re- ordering now."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sam",
          "Nb_Reviews": 1,
          "Date": "2021-03-23T05:11:56.000Z",
          "Titre": "I am located in Texas and I have…",
          "Contenu": "I am located in Texas and I have ordered from Mouser for about 20 years.  I have grown accustomed to ordering by 8 pm, having the order on a UPS truck that night, and having it show up by 10 the next morning via ground shipping.  My latest order has taken almost a week and it's not even ready for shipment yet.  What is going on?  Isn't the warehouse automated?  I work for a large research facility.  Over the years I have convinced co-workers to order through Mouser for last-minute things because stuff literally arrives the next morning.  My last orders have been very delayed, and I just discovered that the delay is on Mouser's end, not the shipper's or our purchasing dept.  I'm sorry, I can't order from y'all anymore until this gets sorted out.  We need updates on how this situation is progressing, and when packing times are expected to get back to normal."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Roy Rogers",
          "Nb_Reviews": 1,
          "Date": "2017-11-17T17:13:30.000Z",
          "Titre": "Pro  =  Pricing and Quantity   -    Cons listed below (long).....",
          "Contenu": "Pro  =  Pricing and Quantity - we are a small shop, can't order 100 / 1000 min of parts.   We like Mouser due to reasonable prices and allowed to order lower quantities.CONS = Pic RARELY matches part - that is very difficult to find parts...Most of my Digikey orders are result of can't find part on Mouser due to out of date or simply wrong part pic.    Part information from Data sheet does not match listed values or is entered incorrectly.  Digikey has much better part data, and way more fields you can search / sift through to find parts by certain data spec sheet values.   Mouser people are just not careful of how they enter data sheet values.   Sometimes they don't even get the part into the correct BROAD category, so you search for 10 minutes, and then realize it was in a different category...."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Chris J",
          "Nb_Reviews": 19,
          "Date": "2021-08-12T12:31:30.000Z",
          "Titre": "Component Rationing! - Is the war still on??",
          "Contenu": "Unfortunate that they have had to introduce a maximum order quantity for some lines, effectively limiting what you can buy, something that won't sit well with a lot of OEM's. I fully understand the need to limit stock at the current time, so that it isn't panic bought, or bought up and then offered for sale at a higher price on the grey market by brokers, however a manufacturer such as ourselves need to be able to order product in thousands just to be able to manufacture and keep their own staff employed. I'm not sure that cutting off the means to do that by limiting orders to 1000pcs of a line is the best way forward. When all of this mess with Chipageddon finally gets sorted out, customers will remember the businesses who helped them out and no longer show any loyalty to those who didn't. In the meantime, i'll leave Mouser to focus on what appears to have become the low volume, hobbyist market."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Frustrated",
          "Nb_Reviews": 1,
          "Date": "2016-04-21T20:34:49.000Z",
          "Titre": "Fix your website",
          "Contenu": "You need to fix the site. it will only allow finding or adding additional parts if you first return to the home page. Adding from the cart view always displays an error screen."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "john pettit",
          "Nb_Reviews": 1,
          "Date": "2017-09-26T19:45:01.000Z",
          "Titre": "order error flashes up so fast you …",
          "Contenu": "order error flashes up so fast you can't read it. and no further info provided, but since an order # is not achieved the order is submitted again to get it to go through"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brian Eicher",
          "Nb_Reviews": 1,
          "Date": "2021-02-24T23:50:49.000Z",
          "Titre": "Mouser rejected my card i had on file",
          "Contenu": "Mouser rejected my card i had on file - I have used this card before just fine - I had to delete the card on file and add it back as new. What a pain!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kyle sanders",
          "Nb_Reviews": 1,
          "Date": "2017-05-09T15:06:00.000Z",
          "Titre": "7.99 for shipping of a single switch",
          "Contenu": "7.99 for shipping of a single switch? You need to have a more economical option for those less fortunate and more sane. Total of 25 for a toggle switch is disgusting."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ken K",
          "Nb_Reviews": 1,
          "Date": "2015-07-27T18:04:15.000Z",
          "Titre": "Another missed shipment",
          "Contenu": "For most orders mouser has been great but this is the second time we placed a Next Day Air order before the deadline and the items didn't ship in the last 6 months.  There was no call or email letting us know the items wouldn't ship on time.  \r If Mouser is unable to fulfill shipments that are made before the 8pm deadline, maybe the deadline should be moved to an earlier time? When Mouser is unable to keep their deadlines, it puts us in a position where we are unable to keep promises to our clients which costs our reputation and hurts our bottom line.  \r We will be going back to Digikey for time sensitive orders as over the past 13 years they have only failed to make the deadline once.  They called us to let us know there was an issue shipping out the package and worked out a shipping solution that arrived the next day using courier service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Steven Veilleux/ SVT Audio LLC",
          "Nb_Reviews": 1,
          "Date": "2017-04-09T02:32:13.000Z",
          "Titre": "I don't care for your new web ordering page",
          "Contenu": "I've been ordering from Mouser for almost 15 years now and they are a great company with fast service but there new web ordering page is horrible. The navigation is awful. You are forced to  scroll endlessly. Also, after you order a part when you click on continue shopping, it kicks you out of the menu options you were in from the last part you ordered. You then have to start over.  This is very annoying, especially when you are ordering several parts in the same category. Your old website ordering was much better. All options were laid out from left to right. Now it takes me twice as much time to order the same items.  I order at least once a week from Mouser. You are my number one supplier but I've been using digikey and Newark more and more now because of your website. Please put it back the way it was. Please!!!!! Thanks for your time. Best regards, Steve Veilleux /SVT Audio LLC"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joshua Florian",
          "Nb_Reviews": 1,
          "Date": "2019-02-19T22:02:53.000Z",
          "Titre": "I've been a customer forever",
          "Contenu": "I've been a customer forever.  I don't know how you guys plan to compete with no catalog and insane overpricing as compared to the Ali crowd."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kelli Baxter",
          "Nb_Reviews": 1,
          "Date": "2017-06-27T16:45:20.000Z",
          "Titre": "I appreciate the price for the item …",
          "Contenu": "I appreciate the price for the item that I needed however, the shipping is very problematic.  I placed my order which I also paid for overnight shipping.  I called after the order was placed to confirm that it would get shipped out that day (since the items were in stock) so that I would receive the next.  I was told they ship out all the way until 8 pm and seeing as how it wasn't even noon it would go out.  I get a phone call today, the day that I am supposed to receive the items, stating that it didn't ship until today with no real explanation other than the warehouse may not have gotten to all the orders.  In my opinion if someone pays for overnight shipping and the product is available, then that order should be processed and sent out the day it was placed.  Yes, I was told I would receive a credit for the shipping but it doesn't change the fact that I don't have the items that I needed on the day I needed them."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Guy Lauten",
          "Nb_Reviews": 5,
          "Date": "2017-06-02T00:00:25.000Z",
          "Titre": "Big problem",
          "Contenu": "Big problem.  I got 1/8 Watt resistors when I ordered 1/2 Watt.  I got 1/2 Watt resistors when I ordered 2 Watt.  Something is very wrong."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tony Karavidas",
          "Nb_Reviews": 3,
          "Date": "2020-01-13T07:28:43.000Z",
          "Titre": "You have no mechanism to all me to…",
          "Contenu": "You have no mechanism to all me to modify or cancel and order, even if it's immediately after it was placed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jun Gong",
          "Nb_Reviews": 1,
          "Date": "2017-01-06T15:56:57.000Z",
          "Titre": "not able to create/recover my account",
          "Contenu": "I am not able to create/recover my account because I forgot my login information. Have to pay anonymously."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ed Rembold",
          "Nb_Reviews": 1,
          "Date": "2017-01-24T16:56:34.000Z",
          "Titre": "What happened to the price break at 200pcs for 1K resistors?",
          "Contenu": "All other resistor values that I checked have a price break at 200 pcs. except 1K. Whats up with that?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Richard Anderson",
          "Nb_Reviews": 2,
          "Date": "2019-10-22T21:09:24.000Z",
          "Titre": "When I need a part I can't buy 3000…",
          "Contenu": "When I need a part I can't buy 3000 just to get 6. I'm rtefering to part# 12129024"
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "Mohan Kumar",
          "Nb_Reviews": 1,
          "Date": "2017-07-18T06:58:06.000Z",
          "Titre": "Purchased 2 Nos",
          "Contenu": "Purchased 2 Nos. LPCXpresso board for LPC1769 with CMSIS-DAP probe. We received one board perfectly fine and second one with broken jummper. We rasied our concern and they said to replace it and wanted to scarp the brokeb jumper board and we did so. For these two boards we paid around Rs 2400 as customs duty and we informed they we wont pay another customs duty for replacement. Support without any knowledge said ok ok for all our concerns raised. But finally when the replacement board came customs again charged around Rs. 2600 again for which we fought to DHL and Mouser. None responded and we indrectly forced to pay and release the package from Customs. Finally when we received the replaced we again found the jumper was broken. When raised the concern to mouser their support initally said the person who handled the issue was on leave etc. and finally spoke to a gentlemen. He said if i want replacement i need to capture a picture of two broken boards keept side by side as proof. Thing is one the first time itself we striggle and proved the board was damaged with photos and showed proof that the time we received the courier and time we raised the concern etc. My great anger and displeasure is for Rs. 1662 board they made to to pay Rs. 5000 as customs and still we have got one undamged board. Mouser rocks how to frustrate customer and get out trouble."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "STEVEN SUNDGREN",
          "Nb_Reviews": 1,
          "Date": "2018-10-17T04:08:48.000Z",
          "Titre": "MOUSER",
          "Contenu": "LOT'S OF MERCHANDISE. FILTERS ON TRYING TO FIND SOMETHING--COULD BE BETTER."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Walter Scott",
          "Nb_Reviews": 1,
          "Date": "2016-01-09T21:28:18.000Z",
          "Titre": "2nd time having to order parts left out of initial order from a mouser project."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Cindie.watts",
          "Nb_Reviews": 1,
          "Date": "2020-07-22T20:13:30.000Z",
          "Titre": "I would appreciate a more rapid…",
          "Contenu": "I would appreciate a more rapid response to PO and receiving issues."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mike Waters",
          "Nb_Reviews": 2,
          "Date": "2018-01-19T05:30:27.000Z",
          "Titre": "It used to be much easier to place an …",
          "Contenu": "It used to be much easier to place an order. I'm too mad to explain."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Anderson",
          "Nb_Reviews": 1,
          "Date": "2016-08-01T00:05:04.000Z",
          "Titre": "Last order shorted 18% of resistors",
          "Contenu": "Good quality but they can not count. Check order when it arrives."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Derek Studt",
          "Nb_Reviews": 1,
          "Date": "2015-12-26T09:44:16.000Z",
          "Titre": "Terribly clunky search interface",
          "Contenu": "It took me 6 hours of using the search function on the Mouser website to order 23 items which I had a clear bill of materials for.  I've never been so frustrated with an online shopping cart system before this experience.  \r The entire website loads its pages as if it I were on a dial up connection in the late 90s.  To ensure it wasn't my 4 year old MBP running slow, I opened another tab to see if Google was loading slowly, and sure enough it was just the Mouser site.  I use this laptop everyday for audio recording/video editing and it does those jobs quite well with no noticeable slowdown of performance.\r After about an hour of trying to use the search function and narrowing the scope of my search, I realized that despite directly typing mouser.com into my browser, I hadn't even been on the full site.  I wan't on the mobile site either (at least I'm hoping it wasn't the mobile site, because that would be a terrible way to navigate the site on an iPhone or iPad).  After clicking the view full site button, my experience was marginally better until I kept getting messages trying to confirm I wasn't a robot, because apparently I was clicking through the website too fast.\r Had Mouser not had all the parts I needed, which I was unable to get elsewhere, I'd have made my purchase somewhere else.  \r I'm not the type of person who enjoys writing bad reviews...in fact, I regularly become a raving fan of any company that exceeds my expectations.  I'd love to see my experience somehow salvaged.  The ball is in your court to redeem my shopping experience.\r Thanks,\rDerek Studt"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert Green",
          "Nb_Reviews": 1,
          "Date": "2018-05-08T20:25:49.000Z",
          "Titre": "Back order items taking way too long…",
          "Contenu": "Back order items taking way too long you can do better"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "needing more info for exp rpt",
          "Nb_Reviews": 1,
          "Date": "2018-05-11T16:25:05.000Z",
          "Titre": "Why isn't the shipping cost on your…",
          "Contenu": "Why isn't the shipping cost on your invoice?"
        },
        {
          "Note": 2,
          "Lieu": "DO",
          "Pseudo": "GREGORIO ESTEVEZ",
          "Nb_Reviews": 2,
          "Date": "2017-07-04T02:33:09.000Z",
          "Titre": "LOT OF CANCELLED ORDERS",
          "Contenu": "LOT OF CANCELLED ORDERS, WITHOUT NOTIFICATIONS"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 2,
          "Date": "2017-12-24T03:03:50.000Z",
          "Titre": "Not enough stock",
          "Contenu": "Not enough stock of many items ie. resistors"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "russ carruth",
          "Nb_Reviews": 1,
          "Date": "2020-02-27T15:47:08.000Z",
          "Titre": "scheduling shipments is so NOT intuitive"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeremy Smith",
          "Nb_Reviews": 2,
          "Date": "2017-05-08T15:29:09.000Z",
          "Titre": "more expensive than other venders."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Hugo Untiveros",
          "Nb_Reviews": 1,
          "Date": "2019-10-14T19:21:09.000Z",
          "Titre": "No customer services at all."
        },
        {
          "Note": 2,
          "Lieu": "IL",
          "Pseudo": "israel ramot",
          "Nb_Reviews": 1,
          "Date": "2016-12-07T14:11:03.000Z",
          "Titre": "logging",
          "Contenu": "too complicated...the logging"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "russ ward",
          "Nb_Reviews": 1,
          "Date": "2016-12-07T03:19:08.000Z",
          "Titre": "slow slow",
          "Contenu": "really slow website"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nigel",
          "Nb_Reviews": 3,
          "Date": "2019-07-04T04:06:55.000Z",
          "Titre": "very expensive"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeff Caswell",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T17:37:55.000Z",
          "Titre": "Dislikes",
          "Contenu": "Dislikes: 1) you don’t sell old style power electrolytic capacitors for guitar amps, 2) you don’t sell vacuum tubes for guitar amps, 3) your search engine sucks! If you don’t put in the exact part number, nothing is returned. I made many copy errors when researching parts and then when trying to order them, I kept getting no results because of one wrong letter or number! 4) your auto-fill function for entering address during checkout doesn’t work properly. Overall your website is hard to use. I’d give your IT dept a C- at best."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Roger Powers",
          "Nb_Reviews": 2,
          "Date": "2023-10-13T18:10:04.000Z",
          "Titre": "Available parts and pricing are…",
          "Contenu": "Available parts and pricing are awesome.  Search engine needs drastic improvement. UPS shipping seems very high.  USPS mailing for just a few parts would be extremely more cost effective."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eric Archer",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T02:15:15.000Z",
          "Titre": "\"PLEASE CORRECT ANY ERRORS DISPLAYED\" but no errors are displayed",
          "Contenu": "I did not want to pay with PayPal but I had no choice because the system wasn't working right.  When I tried to pay with our credit card, which we use with Mouser regularly, the screen said \"PLEASE CORRECT ANY ERRORS DISPLAYED\" but there were no errors displayed.  This problem happens about 1 out of 4 times when I am trying to check out."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 2,
          "Date": "2022-12-12T18:50:27.000Z",
          "Titre": "Mouser# 863-LM2931AT-5.0G max voltage misleading",
          "Contenu": "On Mouser# 863-LM2931AT-5.0G Voltage Regulators, the specification table says \"Input Voltage, Max: 40 V\" , however the datasheet PDF says \"Over-Voltage Shutdown Threshold 26 to 40 V.It is mis-leading and disingenuous for the specification table to list 40 volts max when that just means that it will not be damaged by that voltage, but it will have shut down and will not operate at that voltage."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 3,
          "Date": "2023-07-10T23:04:45.000Z",
          "Titre": "Couldn't proceed on my phone",
          "Contenu": "Couldn't proceed on my phone (power was out). Said to correct an error when I got the the credit card, but didn't indicate what that could be. Filled out the identical info on my PC (when the power returned) and it went through. Missed the shipping deadline because of this."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Thomas Valone",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T06:27:33.000Z",
          "Titre": "Only 1 or 2 Cincon TRE25120 AC wall…",
          "Contenu": "Only 1 or 2 Cincon TRE25120 AC wall mount adapters available with 2.1mm barrel specs and then you don't reorder them for months."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Evan B",
          "Nb_Reviews": 1,
          "Date": "2023-06-18T01:43:18.000Z",
          "Titre": "Product Pictures Unclear",
          "Contenu": "Product pages for 576-298907-030/576-298907-040 are slightly confusing. Picture shows both fuse holder and cover, when part numbers are only for one of the components. However, customer service did rectify the situation by accepting a refund."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brent S.",
          "Nb_Reviews": 1,
          "Date": "2022-05-04T07:49:49.000Z",
          "Titre": "Paypal gateway wording issues",
          "Contenu": "When paying with paypal, the last screen on paypal the button to return to this site says \"continue to review order\" making it sound like the order has one last step before it is placed. That is not the case, it returns to the \"order received\" page with no warning or way to confirm placing the order."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "William Glaske",
          "Nb_Reviews": 2,
          "Date": "2023-03-01T21:24:21.000Z",
          "Titre": "Problem with ECAD Model download..  Purchasing the item was fine.",
          "Contenu": "Purchasing the item was fine.. But I could not manage the web site for the ECAD Model download.  The site recognized me and allowed me to sign in but that's as far as I was able to go.  I like the old - \"just click\" way better!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 2,
          "Date": "2022-04-16T18:04:24.000Z",
          "Titre": "Mouser is great and used to have the…",
          "Contenu": "Mouser is great and used to have the best electronic parts website there was. No longer - the site is slow and cranky, and doesn't automatically open to the sorting options like it used to.Go back to the old site!!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Roxanne Steen",
          "Nb_Reviews": 1,
          "Date": "2022-06-06T22:42:20.000Z",
          "Titre": "Poor customer service",
          "Contenu": "Great website.  Provides me with the information I need.Customer Service could improve.  Lots of changes recently.  Wanted to talk with an outside sales person and I was asked why I wanted to talk to one."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Barak",
          "Nb_Reviews": 2,
          "Date": "2022-07-19T06:20:08.000Z",
          "Titre": "in looking for solderless terminals for…",
          "Contenu": "in looking for solderless terminals for larger wire 8awg and 2awg the stock is bleak. I was forced to go to other distributors."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ron Purcell",
          "Nb_Reviews": 2,
          "Date": "2023-03-05T05:09:29.000Z",
          "Titre": "USPS postal shipping cost excessive",
          "Contenu": "USPS postal shipping cost needs to be reduced  to $4.99 to match other suppliers."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kim Vally",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T22:47:50.000Z",
          "Titre": "There is nowhere to include PO #",
          "Contenu": "There is no where to include PO #.  There used to be.  What happened to it?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Francisco Vivona",
          "Nb_Reviews": 1,
          "Date": "2022-05-19T15:00:53.000Z",
          "Titre": "2022 FLORIDA ANNUAL RESALE CERTIFICATE FOR SALES TAX",
          "Contenu": "I'M NOT SURE IF MY 2022 FLORIDA ANNUAL RESALE CERTIFICATE FOR SALES TAX WAS FILLED PROPERLY."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "McChiken",
          "Nb_Reviews": 1,
          "Date": "2021-10-25T00:36:29.000Z",
          "Titre": "You are great but..........",
          "Contenu": "You have stuff out of stock that Amazon has hundreds of . I bought some network resistors from you less than a year ago and 4 sizes are now 200pcs minimum . These arent special order you stock them . 35000 of one in stock and I cant buy a couple . You make it hard to do repairs or build projects when you do this . Other than that I do appreciate what you do carry . Just dont handicap us with huge quantities"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dave Felt",
          "Nb_Reviews": 3,
          "Date": "2021-09-29T02:36:25.000Z",
          "Titre": "Mouser has gotten so BAD",
          "Contenu": "Mouser has gotten so BAD, with the SEARCH function misbehaving many times, it is almost driving me to Digikey! Plus, having no catalog anymore (NOT EVEN ONE TO DOWNLOAD) makes it hard to buy now days. Mr. Buffet, you should reconsider your investment !!!  In the last 3 years, Mouser has become one of the places I DO NOT buy from anymore, if I can help it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rich Patonai",
          "Nb_Reviews": 1,
          "Date": "2022-01-04T18:41:13.000Z",
          "Titre": "Referring your repeat clients to DigiKey, Seriously??",
          "Contenu": "Mouser used to be most helpful.I called today looking for a difficult to find transistor, MJE16002.The technician told me that unfortunately Mouser does not distribute for MJE and referred me to Digikey..  Digikey had access to these transistors but only in a lot of 314. The tech then looked for a substitute and found BUL-49D but they were out of stock.  I searched go for that part and voila, they were on hand at Mouser. I’ve ordered them.Your techs need to take a little time to look for subs instead of being lazy and referring your clients to your competition."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dr Ken",
          "Nb_Reviews": 7,
          "Date": "2021-09-19T03:47:48.000Z",
          "Titre": "Mouser has by far the largest inventory…",
          "Contenu": "Mouser has by far the largest inventory of electronic items imaginable.  BUT, their new website design is beyond slow - it is painfully slow.  (The previous version of the website was much faster all around.)  Recommend you place your order when you have absolutely nothing else to do in the next hour."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Semanon",
          "Nb_Reviews": 1,
          "Date": "2021-03-17T06:58:57.000Z",
          "Titre": "Been weird lately",
          "Contenu": "Up to this point you've done great.  My last two orders were disappointing: 1) One of the bags was labeled correctly but did not contain any parts; 2) a part was labeled as available but then back ordered; 3) a lot of parts seem to be unavailable; 4) my last order took over three weeks to arrive.  Most of the delay was ay your facility.I hope this is just a COVID hiccup and you return to your previous 5-star service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "abell audio",
          "Nb_Reviews": 1,
          "Date": "2021-12-14T20:37:07.000Z",
          "Titre": "Once again there is no drop-down box to…",
          "Contenu": "Once again there is no drop-down box to select whether sales tax is to be charged on the payment pages. There used to be one and Mouser has our tax resale number. I have been in touch with the sales IT dept at Mouser about this but it is still not fixed......."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "RON ERLICH",
          "Nb_Reviews": 2,
          "Date": "2020-10-27T03:17:04.000Z",
          "Titre": "Hello Mouser,",
          "Contenu": "Hello Mouser,Our Corporation's Tax Exemption is on file (on your system),  compere it to the e-mail provided and stop ask for it every time, Additionally, if base on the email provided your \"app\" will automatically fill the rest of the forms (Corp. name address etc.) it will be nice.Please be advised that due to security reasons we prefer not to set account password or to create account.Stay safe,Regards,Ron"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Andrew Ferg",
          "Nb_Reviews": 4,
          "Date": "2020-07-02T18:09:08.000Z",
          "Titre": "Free Shipping Please!",
          "Contenu": "Quality & service are great. However, shipping is too slow and very expensive. Honestly, due to the shipping issues, I only buy from Mouser when I cannot find the parts I need on Amazon. I would prefer to buy from Mouser as I can always trust the quality of their components. I just wish they had free next day shipping like Amazon."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dr Ken",
          "Nb_Reviews": 7,
          "Date": "2018-11-04T15:37:00.000Z",
          "Titre": "S&H is Highway Robbery at its finest",
          "Contenu": "Charging $39+ for an order shipment that would easily fit into a USPS Medium Flat Rate Box five times over is highway robbery.  The total weight of this order is less than one pound.  No way will it cost $39+ to ship this order to me - it will probably be on the order of $6-$8 total.  Throw in shipping supplies and maybe the total comes to $10-$12.  Charging $39+ really is highway robbery."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Han Lee",
          "Nb_Reviews": 1,
          "Date": "2018-09-02T06:22:16.000Z",
          "Titre": "Needs a confidence when choosing an item",
          "Contenu": "Whenever I make a decision to buy, I always confuse and try to make sure if I'm buying a right pair. I have an experience that sometimes a staff at Mouser also confuses and sends a wrong one.If a product is a receptance or socket and there is a plug or pin for it, showing a proper product(s) that matches with the product would be very very helpful and it will make me easy to decide which two are a proper pair."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "BALA SUBRAMANYA",
          "Nb_Reviews": 2,
          "Date": "2017-12-14T20:10:59.000Z",
          "Titre": "I wanted to add one more part after …",
          "Contenu": "I wanted to add one more part after placing my Web Order No:      13281814 . but your executive during chat I was forced to cancel my Web Order No:      13281814 and i have placed a new order with additional part. i think this could be avoided by just adding the additional part by chat executive. this is what we do with Digikey. i havent faced any issue with Digikey like Mouser"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gary Riggott",
          "Nb_Reviews": 1,
          "Date": "2017-09-01T18:55:46.000Z",
          "Titre": "shipping charge not shown on order",
          "Contenu": "Hi-I'm not that dissatisfied.The order form that I received when I placed my order does not show the shipping charge.  The merchandise total=sales order total of $14.62, but shipping ($7.99 in this case) is not shown.  you guys should fix the form.Order #  12684494 If it looks different to you, then I can show you the pdf that I received.thanks,Gary"
        },
        {
          "Note": 3,
          "Lieu": "CL",
          "Pseudo": "Caleb Whiting",
          "Nb_Reviews": 1,
          "Date": "2018-02-07T20:59:25.000Z",
          "Titre": "Parametric search is annoying.",
          "Contenu": "The ordering experience is very nice.  No complaints.Customer service is very good.  No friction there!The parametric search is really annoying.  I miss the ability to enter a range of values like DigiKey and the units comprehension in Octopart.If it weren't for these two things there's a good chance I'd order exclusively on Mouser."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mike B",
          "Nb_Reviews": 1,
          "Date": "2015-11-23T03:01:07.000Z",
          "Titre": "good but could be more accurate",
          "Contenu": "Every Order I place for capacitors has been in error.  There are at least 5 to 7 items missing from every order or the wrong value.  the error is monetarily small so not worth the time to complain.  But it is frustrating when I am installing parts in my projects.  Orders should be checked by different people for accuracy.\rYour customers deserve to get the correct parts.\r Thanks\rMike"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "someone",
          "Nb_Reviews": 2,
          "Date": "2015-11-28T21:21:33.722Z",
          "Titre": "Please update your the section of your website that deals with account information",
          "Contenu": "Every time I went to checkout the phone number associated with my shipping address was not correct.  When you click 'update shipping address' there is no option for editing the phone number associated with that address.  Same with billing address.  If you update contact phone it auto populates the billing address phone when you checkout.  Not the case for shipping address."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shrinath",
          "Nb_Reviews": 1,
          "Date": "2018-03-02T14:47:17.000Z",
          "Titre": "shipping service not as mentioned while selection",
          "Contenu": "I selected 2nd day air on thursday so that i can have the part on saturday. Now it shows the part will be here only on monday. It seems the shipped should have selected 2nd day air saturday delivery and it was selected 2nd day air regular and hence it is delivered Monday. I am paying extra money and getting it delivered in the regular time of 4 or 5 days. Will my extra money be returned back? or will someone be able to interfere the shipment and have it delivered tomorrow."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kinsey Fobes",
          "Nb_Reviews": 2,
          "Date": "2015-10-21T19:50:24.000Z",
          "Titre": "Just switched from Digikey",
          "Contenu": "Digikey had a major SNAFU yesterday and I didn't get me parts I needed today, so I wanted to try Mouser.\r I found the BOM tool very cumbersome to use, I ended up having to import multiple times because I couldn't figure out how to delete a back ordered item.  Plus the additional step of having to select output fields was just an unnecessary step in my opinion."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rey",
          "Nb_Reviews": 1,
          "Date": "2017-11-25T07:08:31.000Z",
          "Titre": "Poor processing time, delayed a day before shipping is processed.",
          "Contenu": "It amazes me how I can order something over the weekend and pay for Priority mail and still takes 4 days to get to TN from TX, one time, it took about 7 days with said shipping. I have better luck with other sites when it comes to shipping. My biggest gripe about his company, considering I order roughly $50 a week form them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 4,
          "Date": "2017-08-24T00:37:06.000Z",
          "Titre": "Order process went OK except for …",
          "Contenu": "Order process went OK except for essential information (cost) \"falls off the right edge of the screen, and I can't scroll to see it.  Stop writing apps for widescreen!  That is for watching movies in a theater, not doing business.Using old-fashioned paper catalog is easier.  That's how this order was determined."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "RuennChiou Li",
          "Nb_Reviews": 3,
          "Date": "2016-09-26T16:26:28.000Z",
          "Titre": "placing an order",
          "Contenu": "there is no way that I could figure out, how to modify or cancel and order placed but the order was on a pending hold for a tax certificate.  It just sits there until I submit a tax certificate.   But I had decided not to submit the tax certificate and simply wanted to modify the order and pay the sales tax. Therefore, I just let that order stand in \"pending mode\"  and then went back to the cart and placed a new identical order, but with sales tax added."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Biff",
          "Nb_Reviews": 1,
          "Date": "2018-04-23T04:47:44.000Z",
          "Titre": "FIx your search engine already",
          "Contenu": "FIx your search engine already! When searching for parts, you should be able to eliminate items that are not in stock instead of forcing people to filter though everything. This goes for other categories as well! This makes it difficult to get the best part for the best price, but maybe you guys like it that way :P"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "george bennett optimal motion",
          "Nb_Reviews": 1,
          "Date": "2017-02-14T03:33:52.000Z",
          "Titre": "Clumsy ordering multiple values of 1 part - carts duplicated",
          "Contenu": "I like the saved cart and project features in general.  They help track separate projects.  I find, though, that ordering multiple resistor values in one sitting or capacitor values requires 3 or 4 filter resets instead of just changing the value and auto-filtering.Coming back to the cart is a problem - it's too easy to duplicate the parts quantities and have to re-edit the list.  There are warnings about this, so Mouser is aware.  It would be better if it was fixed instead."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kevin Davis",
          "Nb_Reviews": 1,
          "Date": "2019-10-03T21:29:10.000Z",
          "Titre": "Great item availability, excessive shipping cost",
          "Contenu": "Item I wanted, 2 electrolytic capacitors, were in stock with the required specs. No minimum purchase quantity required.  Great.  But the shipping charge was $7.99!  These capacitors only weigh less than an ounce each, and would fit in a very small box.  The shipping cost seems excessive."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark Hansen",
          "Nb_Reviews": 1,
          "Date": "2016-01-31T23:49:09.067Z",
          "Titre": "Incorrect order total on order invoice",
          "Contenu": "While I was placing my order, I saw that it included shipping and tax in the total. After the order was placed, I tried to print an invoice for my records, but the printed order did not include either of these values, and so was no the correct total.\r I'm not sure what the hold-up is. You should know whether or not these items are in stock, what they cost, what the shipping will be and what the taxes will be - you showed me all of these when you asked for my payment after all."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Timothy Huggins",
          "Nb_Reviews": 1,
          "Date": "2015-11-19T14:58:43.000Z",
          "Titre": "Printing an invoice?",
          "Contenu": "I finalized my purchase, screen says my \"order is now complete\", but when I look at the print view it does not show the shipping charges or the final total... What gives?    If it is final, then the print view should show all the charges and I should be able to print an invoice!  ...not just part of an invoice."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Martin Sing",
          "Nb_Reviews": 1,
          "Date": "2020-11-09T18:39:37.000Z",
          "Titre": "Faster \"quick order\" process",
          "Contenu": "Please make it easier to just go to the quick order screen to order parts. Maybe on your main menu page, list a \"quick order\" icon (you used to have this). Not all of us need to set up a project, share our parts list with others, etc., etc."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ryan Stewart",
          "Nb_Reviews": 1,
          "Date": "2020-02-29T15:43:44.000Z",
          "Titre": "Great selection, some unexpected order/shipping delays",
          "Contenu": "I just ordered my third order, I couldn't find my part anywhere else. The firs time, it came within a few days but for SOME REASON my last order took a MONTH to get here if not more. I'm really hoping the order I just placed gets here in a timely manner."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mike Newberry",
          "Nb_Reviews": 2,
          "Date": "2017-11-01T18:07:54.000Z",
          "Titre": "I understand \"ground shipping\" but $8 …",
          "Contenu": "I understand \"ground shipping\" but $8 is too much. Thar rate adds almost a $1 to each of my parts that I ordered that cost about a $1 each. doubled my cost. I thought you had a GROUND rate of $3.99.That would help in this case. High shipping is on reason I chose other providers."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "patrick holland",
          "Nb_Reviews": 1,
          "Date": "2020-08-13T22:15:18.000Z",
          "Titre": "my error…",
          "Contenu": "2 items I ordered never showed up at check out? 1uf and .33uf mkp capacitors. your website really needs to be redone it is hard to use!!!P HollandMy error..items were shipped.Sorry. Mouser is the best source around for electronics supplies.PHHolland"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul Meadows",
          "Nb_Reviews": 1,
          "Date": "2018-04-12T16:28:27.000Z",
          "Titre": "I just printed my order",
          "Contenu": "I just printed my order - I'm being charged for tax and shipping which does not show up on the downloadable or printable order.  Why not???? This is useless unless it shows the entire cost! Please fix this or at least provide the option to print the entire invoice."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alan Rutz",
          "Nb_Reviews": 2,
          "Date": "2016-09-18T01:04:20.000Z",
          "Titre": "Higher price, higher shipping cost",
          "Contenu": "Price cheaper at at least 3 other vendors... and I am especially upset with the high shipping costs... for these 2 items, Mouser could have shipped insured and tracked USPS for $4.50, but charged me Priority rates ($8)... keep going, and I will be a \"past Customer\"..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael B.",
          "Nb_Reviews": 1,
          "Date": "2017-11-06T17:23:21.000Z",
          "Titre": "Ordering OK but corrupt account data.",
          "Contenu": "The ordering process is very nice and I received my initial confirmation email with everything correct but I just received a second email that has my office address as one that I haven't used in over 10 years!  Your various databases are not synced with each other."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Reality Check",
          "Nb_Reviews": 1,
          "Date": "2020-11-19T23:21:30.000Z",
          "Titre": "Shipping wayyyyy too much",
          "Contenu": "Does Mouser usually have what I need? Usually. Sometimes.  These are the days of Amazon etc and mass shipping worldwide. Mouser, continually, for decades, charges 20~40% above the norm for shipping.  Especially for a few light items."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Andrew Batty",
          "Nb_Reviews": 2,
          "Date": "2020-10-24T19:47:45.000Z",
          "Titre": "Check out was stubborn",
          "Contenu": "Check out was stubborn? No Ca resale # on file? Yes I have a CA Resale # with Mouser, why can we NOT use it?Also last order came damaged, it was package lousy the long chip holder came bent in ? I have never seen this happenAndrew"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Howard Wick",
          "Nb_Reviews": 1,
          "Date": "2015-10-25T10:50:40.397Z",
          "Titre": "Customer Review",
          "Contenu": "Would like a way to find new part number from old part number & not have to find the part in the catalog. Great parts & great prices & prompt shipping, but then they always have for me. I will be a return customer without any doubt. Keep up the great work."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2015-10-22T21:44:38.000Z",
          "Titre": "Shipping..we need real numbers",
          "Contenu": "We as the consumer needs to know what our shipping cost is before it ships.  If it is an estimate, it needs to be +/- 10% to be considered an estimate.  Then we can compare shippers.  This can be done and this is your business.  It must be possible.  Thank you."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2016-02-01T07:12:22.732Z",
          "Titre": "Pricing, menus and component filters",
          "Contenu": "Good pricing and easy menus but component filtering & compare needs more work because the filters don't reset like they should and the compare function compares more than what's selected. Overall best experience for getting the right parts. Thanks"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Karen",
          "Nb_Reviews": 1,
          "Date": "2015-08-21T19:26:55.000Z",
          "Titre": "orders on 8/20 and 8/21",
          "Contenu": "I found you cart options and merging to be very bad and confusing.  I could merge carts but it would loose data sometimes, ie my customer reference and if I had chosen mouser reel I would have to confirm that you did not revert to cut tape on my final order."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Lundgren",
          "Nb_Reviews": 2,
          "Date": "2017-04-18T01:22:38.000Z",
          "Titre": "I have viewed the Mouser catalog pages …",
          "Contenu": "I have viewed the Mouser catalog pages on my Android phone using Chrome, and it is not possible to see the bottom (maybe ten percent) of each page, which may have important information.  Something else covers up the page.  Please fix this."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James Agans",
          "Nb_Reviews": 2,
          "Date": "2018-05-06T19:50:44.000Z",
          "Titre": "Can you add a way that recommended…",
          "Contenu": "Can you add a way that recommended substitutes pop up with the item we entered? Also, A secret Question or two to get us both our username and PW would really help a lot for airheads like me. Thank You For taking my suggestions."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Timothy Ressel",
          "Nb_Reviews": 2,
          "Date": "2015-06-22T23:58:32.000Z",
          "Titre": "Parts availability a real issue",
          "Contenu": "You policy of letting stock on a part go to zero before reordering is causing me major upset. Folks like you were forecasting and ordering based on trends 30 years ago. Why can't you?\r Part: 450-4760\rLead time: 17 weeks!!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "RC Marks",
          "Nb_Reviews": 2,
          "Date": "2018-06-30T19:49:19.000Z",
          "Titre": "Your search engine needs revision…",
          "Contenu": "Your search engine needs revision badly!  Indeed, I nearly went with another vendor until I figured out a way around your search engine.  Finding the manufacturer part number off the other vendors site, I was able to find the desired parts on your system and, at a better price, hence my order.I tried searching for my parts using parameters value/rating/package configuration, etc., and was unable to find what I was looking for.  This, is the problem with you search engine.I prefer Mouser to other online vendors! However, it is a PIA to not find what I am searching for using your system, forcing me to research a specific part before attempting to find (and order) it in your system."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "jjn",
          "Nb_Reviews": 1,
          "Date": "2021-04-16T08:15:13.000Z",
          "Titre": "You're website seems very slow.",
          "Contenu": "You're website seems very slow.I was logged in at 0100 PDT, so maybe you're doing maintenance, but it was crazy slowGood shipping and service, but the website needs a speed bump"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steve Fish",
          "Nb_Reviews": 1,
          "Date": "2017-08-25T11:34:15.000Z",
          "Titre": "Enjoy profiting off the shipping costs.",
          "Contenu": "It was easy to find what I wanted (thanks to my source's helpful BOM), and you had everything in stock, but $8 shipping on a small handful of parts - effectively doubling the cost of the order - is just ridiculous."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Frank Young",
          "Nb_Reviews": 2,
          "Date": "2019-07-30T16:42:29.000Z",
          "Titre": "Mouser is not shipping items that can…",
          "Contenu": "Mouser is not shipping items that can legitimately be shipped USPS ground. DigiKey will ship the item 860-4G USPS, and USPS says it is ok to ship it ground. I get poor service from UPS, and FedEx in my area."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jody DiLorenzo",
          "Nb_Reviews": 1,
          "Date": "2017-11-08T16:11:01.000Z",
          "Titre": "I would've given you 5 stars",
          "Contenu": "I would've given you 5 stars, but when I went to print my order, it didn't show my TOTAL (merchandise + shipping).  It only showed my merchandise total.This would be understandable if the shipping hadn't been calculated yet because of weight, etc... However, on previous pages the shipping cost was already calculated and given for various shipment methods.This value could've been easily displayed on the web-order print summary.  I had to wait for the email to come showing the shipment amount again (so I could be reminded of what that value was).[Interesting... even in my verification email you didn't calculate an ORDER TOTAL for me to put in my checkbook register].-Jody"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JeffC",
          "Nb_Reviews": 1,
          "Date": "2016-07-09T19:47:55.000Z",
          "Titre": "Why are you wasting my time?",
          "Contenu": "Why do you require me to fill out all of my personal info when PayPal provides that info to you automatically? You clearly place no value on my time and as a customer, that makes me never want to shop here again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Wayfinder",
          "Nb_Reviews": 1,
          "Date": "2016-05-11T06:25:49.000Z",
          "Titre": "Need better shipping variety",
          "Contenu": "Not all orders need to be shipped priority.  Paying $8 shipping for a $4 item makes no sense.   To facilitate better checkout procedure and encourage more sales, USPS standard ground shipping should be available."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Clark",
          "Nb_Reviews": 1,
          "Date": "2022-03-09T17:50:34.000Z",
          "Titre": "We wanted to buy (15) of line item 1-…",
          "Contenu": "We wanted to buy (15) of line item 1- but there is a min.max of (1) / month/customer.  Hard to qualify an R&D project with these  restrictions !"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "kirit patel",
          "Nb_Reviews": 2,
          "Date": "2017-10-17T20:15:24.000Z",
          "Titre": "Price was good but GND shipping prices …",
          "Contenu": "Price was good but GND shipping prices a bit high. The weight is under 1 lbs; the price paid is over $1400.It would be great if free shipping were to be offered on purchase over $1000!Thank You."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patricia Merritt",
          "Nb_Reviews": 1,
          "Date": "2020-12-15T21:45:05.000Z",
          "Titre": "You would get a better review from me…",
          "Contenu": "You would get a better review from me if you didn't take months and months with orders, as you did recently.  However you sell good products, so I gave you 3 stars as average"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "richard medero",
          "Nb_Reviews": 1,
          "Date": "2018-05-21T16:26:42.000Z",
          "Titre": "Slower on shipping than Digikey",
          "Contenu": "Slower on shipping than Digikey, but I decided to use you this time due to easy of checkout with PayPal.  Oder placed Thursday and still no indication that usps has the ithems.  order # 14208141"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bryan Pasquale",
          "Nb_Reviews": 1,
          "Date": "2017-09-07T23:28:30.000Z",
          "Titre": "Add sorting to more columns when filtering a part search",
          "Contenu": "Your part search could be better if you included 'sorting' features for more columns than availability.  I typically like to sort by price and certain specs too as Digi-Key allows.Bryan"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Watts",
          "Nb_Reviews": 1,
          "Date": "2020-04-14T23:06:16.000Z",
          "Titre": "Your website is too slow",
          "Contenu": "Your website is too slow.  I love Mouser.  I love the functionality of your website.  But it is always VERY slow.  It would seem that more investment in your data center is in order."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "matthew arthur",
          "Nb_Reviews": 1,
          "Date": "2018-09-09T05:30:14.000Z",
          "Titre": "I was unable to checkout with my order…",
          "Contenu": "I was unable to checkout with my order for several days. I also experienced a bug where trying to add a saved project to my cart added a different project, usually the last one I had opened."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steven Phillips",
          "Nb_Reviews": 1,
          "Date": "2020-10-28T13:40:41.000Z",
          "Titre": "Mouser is overall a great provider to…",
          "Contenu": "Mouser is overall a great provider to find connectors and terminals, but navigating their site and being able to easily find products can use some work. Two of the main issues I find with the site is pictures of products are not accurate, up to date, or sometimes just missing. Having accurate pictures of the product can go a long way in helping customers to identify the correct part for ordering. The second main issue is that on connector product pages, there should be links to other items used with the connector, such as terminals and seals. This would make it much more simple for the customer to find the terminals and seals for the desired connector. I end up ordering a lot of parts from other companies because sometimes it is too difficult, or takes too long, to find all of the supplemental parts needed with a connector."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eric Hogan",
          "Nb_Reviews": 2,
          "Date": "2017-09-06T14:15:13.000Z",
          "Titre": "Pls add the shipping to the invoice",
          "Contenu": "Pls add the shipping to the invoice.  When i download the PDF, it lists the total of items only.  doesnt show the shipping and the grand total.  i need this for my records/auditing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "NEIL HENRY",
          "Nb_Reviews": 3,
          "Date": "2018-08-24T16:27:56.000Z",
          "Titre": "Online ordering always problems with…",
          "Contenu": "Online ordering always problems with back orders and not getting parts recommendations based on Specs...vexing and time consuming. And or cannot find parts but is at DIGI-KEY..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cassandra Lloyd",
          "Nb_Reviews": 1,
          "Date": "2019-07-16T15:46:52.000Z",
          "Titre": "I DO NOT LIKE HAVING TO HOVER OVER…",
          "Contenu": "I DO NOT LIKE HAVING TO HOVER OVER \"ACCOUNT & ORDERS\" TO LOG IN AND OUT. SOMETIMES AFTER A LONG DAY I BECOME LOGGED OUT AND IT USED TO BE CLEAR ON THE SCREEN."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Andrew Ferg",
          "Nb_Reviews": 4,
          "Date": "2021-10-25T16:18:43.000Z",
          "Titre": "Slow Expensive Shipping",
          "Contenu": "Excellent quality, but shipping is too slow and way too expensive. More through-hole active devices for prototyping would also be an improvement."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Doug Salisbury",
          "Nb_Reviews": 3,
          "Date": "2017-08-04T20:53:32.000Z",
          "Titre": "Parts I need but can you just add a …",
          "Contenu": "Parts I need but can you just add a \"same as the last 3 pages i filled out\" button. It would really make stuff easier. How many times do I need to type the same thing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Hand",
          "Nb_Reviews": 1,
          "Date": "2017-05-28T00:24:04.000Z",
          "Titre": "What in the world is this \"Action …",
          "Contenu": "What in the world is this \"Action Required\" \"Answer Software Questions\" nonsense. Why are you wasting my time with questions that are none of your business?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Boyles",
          "Nb_Reviews": 1,
          "Date": "2020-10-08T17:43:47.000Z",
          "Titre": "I often have to spread my orders out…",
          "Contenu": "I often have to spread my orders out amongst multiple suppliers because Mouser either does not have the common item listed, or the price is ridiculously high. For example, Today's order was for relays I was forced to purchase elsewhere because they are not even in your catalog.Additionally, the price was almost 25% higher here than there for one of the other products which I purchased.However, the item I DID purchase here, was well priced and I like the low MOQ.Something that would be VERY beneficial as a customer is if you had a HIGHLIGHTED button that presented ALL available alternative components for a given item... that I do not have to go hunting for. This is EXTREMELY important for End of Life items. Not only would it save me time trying to track down those alternatives, it would make it easy for customers to find that product and thereby increase your sales."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tigran Avemian",
          "Nb_Reviews": 1,
          "Date": "2016-07-25T12:26:13.000Z",
          "Titre": "Needs improvement",
          "Contenu": "1. Pictures of components at the invoice will be helpful2. It should worn that the same item was already purchased (if twise)or search option at th invoice  will be helpful"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Narlin Beaty",
          "Nb_Reviews": 1,
          "Date": "2019-10-16T11:38:42.000Z",
          "Titre": "I updated my email on the acct",
          "Contenu": "I updated my email on the acct, but you still sent my confirmation to the old email, which means that I won't get the confirmation.  Computer programming error?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Roadshark",
          "Nb_Reviews": 1,
          "Date": "2018-11-02T17:13:58.000Z",
          "Titre": "No Ground Shipping Estimate",
          "Contenu": "Didn't show me an estimate of when ground shipment would arrive. I had to go with shipping by air to make sure ai receiver the parts when I needed them.."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "S. Walker",
          "Nb_Reviews": 1,
          "Date": "2021-02-09T19:24:45.000Z",
          "Titre": "Shipping Costs to High",
          "Contenu": "I liked it better when you had a lower shipping cost option.  Even if it took a week.  $8 bucks an order is steep for the small project guys."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eric Grasshoff",
          "Nb_Reviews": 1,
          "Date": "2022-02-26T01:13:25.000Z",
          "Titre": "Whay are the shipping charges so high",
          "Contenu": "Whay are the shipping charges so high, same price for USPS Priority Mail, all 2-Day Air and all ground. Very odd.Eric"
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "VAISHALI GOKHALE",
          "Nb_Reviews": 1,
          "Date": "2017-07-08T11:12:40.000Z",
          "Titre": "We are your regular customer",
          "Contenu": "We are your regular customer. But we prefer the shipments through our nominated carrier.  We are adding same in note.  But cannot be handed over in time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John V. Gallagher",
          "Nb_Reviews": 1,
          "Date": "2020-01-21T09:21:03.000Z",
          "Titre": "First time order with Mouser",
          "Contenu": "First time order with Mouser. Web page works well and I was able to identify the exact components I needed to order. These specific super capacitors are not available from eBay, Amazon  or All Electronics. I was able to place my first order.However, all was not smooth. Your site kicked me off and said my computer was not connected with the Internet. Not so as I opened another page that showed I was still connected. I had to repeat my registration and finally got through. Thankfully, my order specifications were saved and after registration, I continued to place my order. Second, I tried to print my order after completion of the process using the \"Print Order\" link at the top of the invoice. It opened another window and printed out my order WITHOUT the complete totals that included the shipping and tax. I used a feature on my computer to get a complete invoice printout.I look forward to your emails and to shop for components on your site from time to time. Thanks.  John"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Andrew Ferg",
          "Nb_Reviews": 4,
          "Date": "2019-07-19T04:27:09.000Z",
          "Titre": "Through hole please!",
          "Contenu": "Service is excellent, but shipping is too expensive and they need to stock more through hole and obsolete anologue items for prototyping."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "krlex",
          "Nb_Reviews": 5,
          "Date": "2017-12-04T04:50:18.000Z",
          "Titre": "Cumbersome checkout workflow",
          "Contenu": "They offer USPS First class for an economic shipment option, but it is not available when you check out. Check out workflow is cumbersome."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joseph Gilmore",
          "Nb_Reviews": 3,
          "Date": "2017-09-25T18:46:46.000Z",
          "Titre": "You REALLY should consider an envelope …",
          "Contenu": "You REALLY should consider an envelope and a USPS stamp for orders like this. Paying $7.99 for postage on an $8.00 order seems a bit much."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "THOMAS HAUFF",
          "Nb_Reviews": 1,
          "Date": "2019-11-16T20:10:06.000Z",
          "Titre": "It's a great site -- shipping is too high...",
          "Contenu": "It's a great site and good to find many parts -- but wow...shipping is half again the cost of what I bought! Seems excessive..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "GREGORY FRANK",
          "Nb_Reviews": 1,
          "Date": "2018-03-21T16:06:19.000Z",
          "Titre": "I ordered 60 of p.n",
          "Contenu": "I ordered 60 of p.n. 66181-1I needed 58 pcs for my project and ordered 2 extras.the order I received had 57 pcs. in it.thank you."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carroll Dase",
          "Nb_Reviews": 1,
          "Date": "2020-07-15T19:23:03.000Z",
          "Titre": "What happened to shipping same day?",
          "Contenu": "Hi. Not trying to be super critical. But I've noticed the last several orders that I have placed... I place the order several hours before 7pm. Sometimes they ship out that day and sometimes they don't.  You are claiming same day shipping, but it only happens about 10% of the time. Last year my orders ALWAYS showed up the next day (San Antonio). Now, they always show up 2 days later. You guys are great and have lots of stuff in stock. But getting stuff the next day with ground shipping makes you guys my first goto for parts. Now that's not happening anymore. Your thoughts? Will the shipping thing get fixed anytime soon?  If this is a COVID thing, why don't you change your shipping claim accordingly?  The little time ticker at the top of your site says, \"Order in next xx:xx hours to ship today\".  If you changed it to \"Until this COVID thing clears up, we are trying to ship same day, but most orders will at least go out next day\", that would be much more clear!  Thanks!  Keep up the good work.  I am thankful you guys are in Texas!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "LouieG",
          "Nb_Reviews": 1,
          "Date": "2018-08-05T04:28:26.000Z",
          "Titre": "Could not use PayPal",
          "Contenu": "Could not use PayPal. Wanted credit card. Quite annoying. PayPal account was just used with mouser last week successfully."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "david barden",
          "Nb_Reviews": 1,
          "Date": "2016-03-16T18:33:11.000Z",
          "Titre": "would be nice to know (ala amazon) how soon my order will be processed, today, tomorrow or?.",
          "Contenu": "otherwise excellent site and experience.  no complaints.  unless it takes 5 days to get my next day shipping order.   ;^)"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Daniel S",
          "Nb_Reviews": 1,
          "Date": "2021-08-14T00:49:56.000Z",
          "Titre": "Good Prices but Search & Navigation is a problem.",
          "Contenu": "Good Prices. Nice cart features. Bad search engine. It seems filter issues are the root of this."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 2,
          "Date": "2018-01-06T07:26:17.000Z",
          "Titre": "Unable to find the resistors that I needed",
          "Contenu": "Unable to find the resistors that I need for a project and had to settle for a value that \"may\" work."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robin Plance",
          "Nb_Reviews": 1,
          "Date": "2019-06-17T21:49:34.000Z",
          "Titre": "As of right now you have done an…",
          "Contenu": "As of right now you have done an average job.Once I receive my order I will adjust accordingly.Thank you"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeffrey Birt",
          "Nb_Reviews": 1,
          "Date": "2021-03-25T21:48:59.000Z",
          "Titre": "The shipping delays are killing me",
          "Contenu": "The shipping delays are killing me. Taking a week+ to pack and ship an order is not good service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Sullivan",
          "Nb_Reviews": 1,
          "Date": "2022-01-04T21:09:10.000Z",
          "Titre": "Ordering online is WAYYY  TOO…",
          "Contenu": "Ordering online is WAYYY  TOO complicated, difficult, and a pain!!!!  Have a nice day."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "LARRY NORWOOD",
          "Nb_Reviews": 1,
          "Date": "2019-10-15T20:05:06.000Z",
          "Titre": "Suggestion",
          "Contenu": "Suggestion: there should be a way to allow scheduling of order from your website when placing order."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Production",
          "Nb_Reviews": 1,
          "Date": "2015-06-15T17:05:29.852Z",
          "Titre": "Backorders have been more frequent",
          "Contenu": "More numerous backorders and longer lead times until backorders are shipped have become more commonplace."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JEFF MITCHELL",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T21:43:54.000Z",
          "Titre": "Website was very slow today but",
          "Contenu": "Website was very slow today but, overall easy to use. i would recommend mouser"
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Smog Frog",
          "Nb_Reviews": 2,
          "Date": "2023-10-11T10:49:05.000Z",
          "Titre": "Fast Delivery",
          "Contenu": "Fast DeliveryIt took only 2 days for us to receive some of the components we were searching for. The quality of what we ordered is also very amazing.Unfortunately, not all of what we need is available immediately so we still need to keep searching further."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kirk Kerekes",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T16:49:02.000Z",
          "Titre": "You should accept Apple Pay",
          "Contenu": "You should accept Apple Pay. It reduces your liability compared to credit cards, while making your customers feel safer.Simply contact your payment provider to start accepting Apple Pay. If you want to accept Apple Pay on your website or in your app, visit Apple Pay for developers.Here is a list of payment platforms that support Apple Pay:BigCommerce GoDaddy IBM Miva neto Salesforce Shopify Squarespace Symphony Commerce Volition Wix WooCommerce"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nafis Ahmad",
          "Nb_Reviews": 3,
          "Date": "2023-02-25T02:12:18.000Z",
          "Titre": "Mouser high shipping cost.",
          "Contenu": "It is easy to order parts through Mouser and check component specifications. However, when the same parts are available at Digikey, we order from them because their shipping cost is considerably lower than Mouser. And that is comparing apples to apples. When we say Digikey shipping cost is lower than Mouser, it is day and night difference."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Giuseppe",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T20:59:20.000Z",
          "Titre": "I like the way to order and the…",
          "Contenu": "I like the way to order and the delivery time however I got a canceled order that was never refund. I get this :Dear Valued Customer,The following item on your Purchase Order 27946004 has been cancelled. The item listed has been discontinued and is no longer available. If your order was prepaid, your refund is being processed. Refund was never happen. I sent 3 reminder via email and I never get an answerUpdate on 31.05.2023Mouser has contact me and apologize for the issue I have received the refund of cancelled order.Thank you very much"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Melson",
          "Nb_Reviews": 5,
          "Date": "2022-06-12T20:48:33.000Z",
          "Titre": "Very satisfying online shopping experience.",
          "Contenu": "I like very much that you provide COMPLETE information about your products, including important details like physical size, mounting configuration, and so on. I never like it when shipping costs more than the product, but I understand. As a hobbyist who usually needs only one or a few parts, this happens to me regularly. Not your fault at all. Note that I am NOT suggesting that you raise your prices!  ;)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Johnny Hanley",
          "Nb_Reviews": 1,
          "Date": "2022-06-09T08:34:15.000Z",
          "Titre": "Shopping was okay but when it was time…",
          "Contenu": "Shopping was okay but when it was time for checkout could be quicker. For those of us that use PayPal, it would be faster and easier to select PayPal for our payment. All the payment and shipping information is taking care of. No need to fill in our name ,home address, and shipping address."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Art Sypen",
          "Nb_Reviews": 1,
          "Date": "2022-07-01T15:58:15.000Z",
          "Titre": "Good inventory of parts",
          "Contenu": "Good inventory of parts. Served most of my needs for prototype parts. I will have to make a separate order for a battery clip from Adam Tec.  Please note that the description on Mouser part 556-ATTINY85-20SFR is incorrect as the part is only available in 8KB flash memory."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Rubel",
          "Nb_Reviews": 2,
          "Date": "2022-06-14T21:45:06.000Z",
          "Titre": "4 (not 5) because no \"My List\"",
          "Contenu": "I would give you a 5, except that unlike your competitor, Digikey, you have not implemented a 'My List' function, where I can save my favorite parts for future orders.... please do, it is VERY handy and would make you my primary again, dropping them to my 2nd-choice."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William Evans",
          "Nb_Reviews": 1,
          "Date": "2022-05-05T23:23:03.000Z",
          "Titre": "I was very pleased to talk with a…",
          "Contenu": "I was very pleased to talk with a technician who helped diagnose my problem andthe Mouser website all for an order that totaled less than $15–half of which was shipping and handlingthank you very much to the technician."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Timothy",
          "Nb_Reviews": 3,
          "Date": "2022-06-30T21:45:37.000Z",
          "Titre": "Nice to find the parts I need in stock",
          "Contenu": "Nice to find the parts I need in stock, especially in these troubled times. Wish there were more USPS options. I ordered a couple of ounces of product that could have gone USPS 1st class for about $3 dollars, but paid $8, because that was the lowest price available. Every penny matters currently..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Fortner",
          "Nb_Reviews": 2,
          "Date": "2022-10-26T15:01:30.000Z",
          "Titre": "Two years of good service",
          "Contenu": "Of orders placed in the last two years, you only had a mistake on one.  I received some wrong parts and discarded them to order again.Digikey has made 4 mistakes in the same time, one of them costing me months on a project.Your service has been excellent!  Keep up the good work!    Mike Fortner"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pat Sheehan",
          "Nb_Reviews": 1,
          "Date": "2022-10-28T08:01:28.000Z",
          "Titre": "I am purchasing",
          "Contenu": "I am purchasing, however, the Corporate card in under our CEOs name.   Hopefully you will send me shipping updates as well as the card holder,"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dylan",
          "Nb_Reviews": 1,
          "Date": "2022-05-28T06:53:08.000Z",
          "Titre": "Mouser is a Reliable Resource",
          "Contenu": "Mouser is a reliable resource for purchasing electronic components.Wishful thinking: It would be neat if I could enter my shopping list and the website would spit out a list of components to add to cart."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shawn Wallace",
          "Nb_Reviews": 2,
          "Date": "2022-06-18T17:53:12.000Z",
          "Titre": "I think you are doing awesome but I had…",
          "Contenu": "I think you are doing awesome but I had input info more than necesary. easy to find and order parts,print and download options function."
        },
        {
          "Note": 4,
          "Lieu": "IE",
          "Pseudo": "David McCarthy",
          "Nb_Reviews": 2,
          "Date": "2023-08-13T20:58:26.000Z",
          "Titre": "Positive Experience",
          "Contenu": "Purchased some components from this company. Easy to use website and delivery was on point."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stan",
          "Nb_Reviews": 2,
          "Date": "2022-06-16T18:36:45.000Z",
          "Titre": "Surprised that many items are not allowed for Resale!",
          "Contenu": "It's easy enough to find parts and complete orders. My gripe is that there are many items that Mouser finds taxable as they're being shipped to California. When we place an order and are told one line will have tax added (on an line we're reselling), I call Mouser and am told they can't do anything about it, BUT, when we're billed we can call their tax department to have it reversed. We shouldn't have to jump through this hoop!  It slows down ordering, makes problems for our accounting department. Mouser also probably loses sales over it. Granted, Mouser sells lots of items that that companies or individuals may purchase for personal use and say they're for resale, and I imagine Mouser may have been tested, or audited by CA to make sure they're collecting CA sales tax.I think CA is not the only state that collects sales tax from out of state sellers. How does/should a customer notify Mouser if part of a purchase is taxable? Mouser should add a tick box (or some such) to the shopping cart for items that customers could say they should pay tax on that line item. We have a Resale Cert, and it's on file with Mouser. Up until recently were never asked if all or part of an order was for resale. Mouser just assumed it was."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "unfortunately fortunately",
          "Nb_Reviews": 2,
          "Date": "2022-11-28T21:47:03.000Z",
          "Titre": "Insane shipping cost",
          "Contenu": "Shipping was WAY to expensive for 2 tiny items (less than 6mm in size) that cost 33 cents each. Ended up being over 8 dollars! Other than that, products are good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "J Tidwell",
          "Nb_Reviews": 2,
          "Date": "2023-02-28T19:47:09.000Z",
          "Titre": "Better available parts than a year ago",
          "Contenu": "Better available parts than a year ago. hopefully Mouser will get back to 5 star service, post-COVID."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Stevens",
          "Nb_Reviews": 1,
          "Date": "2022-10-19T02:49:18.000Z",
          "Titre": "Easy parts ordering",
          "Contenu": "When I check \"continue shopping\" my curser should move to the \"part#/keyword\" box instead of freezing where it is.  Why leave it on the part I just ordered?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Clark",
          "Nb_Reviews": 2,
          "Date": "2022-07-03T05:20:11.000Z",
          "Titre": "It would be helpful to select Pay Pal…",
          "Contenu": "It would be helpful to select Pay Pal before wasting time filling out all your name and address info."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris Blarsky",
          "Nb_Reviews": 1,
          "Date": "2022-12-04T20:31:48.000Z",
          "Titre": "Missing a part in my last order",
          "Contenu": "Missing a part in my last order, but other than that you guys are doing a great job."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gary Raines",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T15:39:52.000Z",
          "Titre": "I like to have never gotten to pay for…",
          "Contenu": "I like to have never gotten to pay for these fans.  Ordering was easy.  Thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LEARLINE ROMINE",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T00:50:28.000Z",
          "Titre": "EVERYTHING WORK CONSISTENTLY FAST",
          "Contenu": "EVERYTHING WORK CONSISTENTLY FAST. SHIPPING IS HIGH."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Isam Shakour",
          "Nb_Reviews": 2,
          "Date": "2022-11-16T00:57:31.000Z",
          "Titre": "Good service",
          "Contenu": "Good service, but your prices is higher than the competitors"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Robert Jones",
          "Nb_Reviews": 5,
          "Date": "2022-08-22T16:14:15.000Z",
          "Titre": "I've recently started using mouser…",
          "Contenu": "I've recently started using mouser electronics to outsource components as their inventory is vast and easy to navigate."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "nickson",
          "Nb_Reviews": 3,
          "Date": "2023-06-01T07:29:37.000Z",
          "Titre": "Order process is simple and precise"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Boyd Collings",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T06:03:23.000Z",
          "Titre": "perfect for my needs",
          "Contenu": "perfect for my needs. wish you were located in a blue state."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cindy Wayne",
          "Nb_Reviews": 1,
          "Date": "2022-03-24T21:39:11.000Z",
          "Titre": "Nice to be able to do this online but…",
          "Contenu": "Nice to be able to do this online but your website is excruciatingly slow. Also, you need to have the choice for use of own carrier account to be in the first choices not at checkout.  You have to go all the way back to the beginning if you don't pick the carrier and the instructions are not detailed enough to explain whatever carrier is default on website that's the choice given at checkout."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Duluth Rack and Rail",
          "Nb_Reviews": 2,
          "Date": "2022-03-16T14:28:18.000Z",
          "Titre": "Wonderful store and selection but some packaging issues",
          "Contenu": "Wonderful store and selection. My only complaint is that sometimes the items are not packaged very securely or safely. I order 60\" aluminum rack rails (Ts-600) and sometimes there is no cushion on the ends, so the ends get damaged. Occasionally, the end caps of the mailing tube have come off altogether and the rails have clearly slid out and hit the floor or ground, damaging the ends."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jimmy Burrell",
          "Nb_Reviews": 1,
          "Date": "2022-04-05T02:17:49.000Z",
          "Titre": "Great selection and variety",
          "Contenu": "Great selection and variety. You have stuff I can't get from digikey *or* they want to ship it from multiple sources.Where you could do better though is with your database parametric search times and add-to-cart selections. They take forever and ever. I am a recently retired I.T. manager and dev lead. I routinely optimized databases with millions and millions of records. It can be done. Trust me when I say it *is* costing you money. More than you think too.Jimmy..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Terry Hanna",
          "Nb_Reviews": 1,
          "Date": "2022-03-22T19:20:18.000Z",
          "Titre": "Everything is good - except PO number field",
          "Contenu": "Everything is good, however, there is one major problem.  You need to make the field to add the customer's PO number more visible.  If we don't have a PO number on the packing slip, creates problems in receiving and accounting.  I never did find it on my order - put a note in the note field asking for the PO number to be put on the packing slip."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pentad Design",
          "Nb_Reviews": 6,
          "Date": "2022-01-05T22:43:30.000Z",
          "Titre": "99%of the time you're doing great and…",
          "Contenu": "99%of the time you're doing great and you have the parts I need or can tell me backorder dates which I can't get from DK.Thanks for all you do and to all your terrific staff! Glitch today when trying to get an order to complete online -so I'm hoping that I did not wind up with a duplicate order - pls check P.O. number 202112-9956 for Pentad Design - there should not be two of them!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Denette Widmar",
          "Nb_Reviews": 1,
          "Date": "2021-10-14T19:20:59.000Z",
          "Titre": "Your site is extremely user friendly",
          "Contenu": "Your site is extremely user friendly!  Very nice to see-for a change!  Curious of one thing, Ohio CAT (or perhaps we are under Ohio Machinery Co) has an account with your company, but I was still asked for payment.  Is there something I need to do in the future to be able to \"charge\" to our account?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Keller",
          "Nb_Reviews": 1,
          "Date": "2021-08-03T18:59:47.000Z",
          "Titre": "Happy doing business with",
          "Contenu": "Happy doing business with, one small issue. I'll hold off ordering when there is an item on backorder. Only to find when that item becomes available then something else goes to backorder. Is there a option I can select to get an email when a backordered item becomes available on a project order before something else goes to backorder."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Barry Watts",
          "Nb_Reviews": 6,
          "Date": "2022-01-08T07:34:00.000Z",
          "Titre": "I wish I could order small quantities, otherwise GREAT CO",
          "Contenu": "I wish I could order small quantities of Wima film capacitors, I spend too much time finding substitutes. Live in Grand Prairie, could almost throw a baseball for you to catch. I hear that your are a good Employer, that's great as I work at Lockheed in Test Engineering."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lorne Hinz",
          "Nb_Reviews": 1,
          "Date": "2021-05-20T17:03:28.000Z",
          "Titre": "I would like product sort to be able to…",
          "Contenu": "I would like product sort to be able to select multiple lines. Example I don't care if capacitor is 25 or 50 volts so let me select both. I put components in my cart as I am working on my design. I would like to be able to sort my cart or project to say put all the capacitors in order by value, than all the resistors in order by value, etc so I can scan down my project to see that non are missed or duplicate ordered."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris Nehren",
          "Nb_Reviews": 2,
          "Date": "2021-05-12T13:52:23.000Z",
          "Titre": "Please save my info to make checkout faster!",
          "Contenu": "I find myself coming back to Mouser again and again because of the great selection and the smooth shopping experience. That said, it'd be lovely if I could save my settings to reduce the number of steps to place an order. Amazon's 1-click patent has expired, so I can't think of any legal reasons to forego implementing such a feature."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris Nehren",
          "Nb_Reviews": 2,
          "Date": "2021-05-06T13:54:39.000Z",
          "Titre": "Fast and easy, would like Apple Pay",
          "Contenu": "Shopping on Mouser is pretty convenient; they provide the level of information that I expect when buying technical equipment. Turnaround is quick, and I haven't had any issues. Everything is quite smooth.I would like to be able to use Apple Pay, though. It's more secure and convenient, and besides that I get more cash back."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ronald Shapiro",
          "Nb_Reviews": 1,
          "Date": "2021-06-18T16:33:34.000Z",
          "Titre": "The only thing I find VERY annoying is…",
          "Contenu": "The only thing I find VERY annoying is your programming of the carts: when there is more than one it takes me a while to figure out how to change which is active. When you see the list, you can pick one to make it active, but if you don't remember what is in that cart and open it to see, there does not seem to be a way to make it active from within the cart itself. I think this is very dumb, or the product of lazy programmers!.YOU SHOULD BE ABLE TO MAKE A CART ACTIVE WITHIN SAID CART!. Maybe this is possible, but it is certainly not obvious."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim C",
          "Nb_Reviews": 2,
          "Date": "2020-01-22T19:39:30.000Z",
          "Titre": "Your web site search engine",
          "Contenu": "Your web site search engine is too complicated at times.Also it dose not return ALL items you carry at times for a particular search.  For instance Search for panel mount fuse holders returned only 6 or so and did not include the actual one I ordered.  After finding the brand/part number on Google and entering that part number produced the item in your search."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "GEORGE M  OP Kansas",
          "Nb_Reviews": 1,
          "Date": "2020-05-19T12:58:01.000Z",
          "Titre": "Appreciate the very wide selection of…",
          "Contenu": "Appreciate the very wide selection of parts with many choices for each, and very competative prices.  \"Back-Order\" Parts: How long will it take? (It would be nice to have a time frame estimate of arrival for each back-ordered parts to arrive. Alternate  available selections would be considered if backlog is too long.)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mr. Amalfi",
          "Nb_Reviews": 1,
          "Date": "2019-01-16T18:17:53.000Z",
          "Titre": "Always GREAT Service, BUT",
          "Contenu": "Hello, Just one point to make regarding my last order. The App asks for a 'Billing Address' and a 'Shipping Address', which is just great. HOWEVER, the next box comes back with a \"...you will receive an email....\" and the email is the *BILLING ADDRESS*, not the shipping address. To me, upon shipment either both parties should be notified, OR, the person receiving the order should be notified."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joyce Segal",
          "Nb_Reviews": 4,
          "Date": "2019-02-26T09:16:26.000Z",
          "Titre": "Best thing about mouser is rapid order…",
          "Contenu": "Best thing about mouser is rapid order fulfillment. The web sight is easy to use and has good features BOM etc...One problem is that the component library options are limited. I use ExpressPCB and the component library is DigiKey exclusive so many components have to be created. It would be great if ExpressPCB could be included in the CAD library support."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DAVID HOGG",
          "Nb_Reviews": 2,
          "Date": "2018-10-29T06:29:41.000Z",
          "Titre": "Your Security certification on your…",
          "Contenu": "Your Security certification on your order site has expired - and my browser would NOT allow me to create an Online account..... but the order went through it appears -  since I already have a Net 30 account with you...Thanks - David Hogg - NEMCO Controls, Inc.  10-29-2018David HoggNEMCO Controls, Inc.10-28-2018 . .    you already have my sales tax exemption on file..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 1,
          "Date": "2021-02-05T14:33:14.000Z",
          "Titre": "I love Mouser but....",
          "Contenu": "First I want to say you guys are my favorite place to shop. The inventory is large, shipping cost is reasonable and fast. Parts prices are mostly reasonable also, but customer service is a big zero. I order pretty regularly and on one occasion had a problem with my order. I contacted customer service and they responded immediately to see what the problem was. I explained my issue with this particular order and waited for a response, which I never got. Oh well, hopefully next time there's a problem customer service will be more helpful. Cheers, Thomas"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ernest Eiting",
          "Nb_Reviews": 11,
          "Date": "2018-06-15T00:46:52.000Z",
          "Titre": "Excessive shipping cost",
          "Contenu": "Shipping cost is excessive!  First Class Mail for less than 16 oz should be a dollar or two.  I was charged $7.99 for service I neither want nor need.  No option is provided to request an alternative.  If you have a \"policy\" (a policy is required when there is actually no good reason for an action) then it should be stated.  Other than that, and a time-wasting backorder, things are fine.  Thanks."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Skinner, Organ Transplant, LLC",
          "Nb_Reviews": 3,
          "Date": "2018-05-13T21:36:39.000Z",
          "Titre": "Internet ordering problem...",
          "Contenu": "Tried to place an order via internet - refuses to accept the order displaying message 'Your order cannot be processed...tax exemption certificate', but the existing certificate Mouse has on file doesn't expire for two more years???  Why should I have to create a new certificate when there is a perfectly good one on file already?  Gave up on placing internet order.  Will directly with a live human tomorrow."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Cullins",
          "Nb_Reviews": 3,
          "Date": "2018-05-27T15:54:47.000Z",
          "Titre": "Mouser review",
          "Contenu": "I just placed an order for just over $2.00 it cost me just over $5.00 so ship it.That is the only problem I have, I know there isn't much you can do about that but it is frustrating to me. If ordered larger orders that would fall back in line. You stock most of what I need, shipping is prompt and parts well backed. I found your customer service very good when I needed it.Thank you for a job well done.James Cullins"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "J.W. Wooten",
          "Nb_Reviews": 1,
          "Date": "2021-10-01T17:39:19.000Z",
          "Titre": "Small item searching",
          "Contenu": "Expectedly, searching for a small (toggle switch legend face plate) was arduous.  The items are small and, if price is part of a vendors philosophy, they must be relatively inexpensive.  I found them at other vendor sites (one found it necessary to add a \"$5.00 handling fee\" to the total cost!) but the entire process at this site went smoothly and timely.  I would add something that you should consider  (along with several otrhers); if it is possible, add the USPS to shipping alternatives. Often, timing is not critical, and with small items or quantities, they are extremely price competitive.  Thank you. J.W. Wooten"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Juan Balzan",
          "Nb_Reviews": 6,
          "Date": "2021-12-17T21:44:04.000Z",
          "Titre": "We find this company one of the best to…",
          "Contenu": "We find this company one of the best to buy our electronics components at a very good price. However, it feels very bad to buy products from here many times and there is a loyalty program that might offer free shipping at least."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "chris",
          "Nb_Reviews": 1,
          "Date": "2019-06-29T17:39:15.000Z",
          "Titre": "the best of the few suppliers in…",
          "Contenu": "the best of the few suppliers in electronics components out there, based on recent IC's and PIC's from Digikey that just did not work and the overpriced Oddwires supplier, mouser parts have not failed me yet. too bad other guys you're overpriced and have poor quality, perhaps you could look to Mouser to improve....."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "SirCut",
          "Nb_Reviews": 1,
          "Date": "2017-07-20T00:52:57.000Z",
          "Titre": "I shop here as Mouser makes small …",
          "Contenu": "I shop here as Mouser makes small quantities available (unlike digikey). However, Digikey now allows search (prioritized by price) with an entered quantity (e.g. 100 or 1000 units). This is good as we are prototyping with one or three units but hope to sell finished deices in 100's or 1000's of units. Please keep up and implement search on price for \"N\" units. Good job and thanks.."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Larry HUsemann",
          "Nb_Reviews": 1,
          "Date": "2018-09-11T04:06:49.000Z",
          "Titre": "This was my first time buying from…",
          "Contenu": "This was my first time buying from Mouser.  The search function was excellent in finding the desired items and the \"buy\" and checkout processes  were also straightforward and trouble free..  The \"compare items\" function was handy although several items I had unchecked prior to a subsequent compare still appeared in the comparison presentation... I suspect user error.  Mouser will now be my first go-to source for electronic parts.Larry Husemann"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jose Imenez",
          "Nb_Reviews": 1,
          "Date": "2017-02-02T16:40:12.000Z",
          "Titre": "Paypal or the like",
          "Contenu": "This is 2017. You guys need to accept Paypal or the like. it a pain hunting for CC at the last minute plus start an account . if anything an account is a pain to open and a privacy risk.  I buy $35000 /month and typically will avoid suppliers that do not offer google pay or paypal. You guys happen to have the product but buying it is a pain. At least guest checkout! Otherwise love the online catalog."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Slover",
          "Nb_Reviews": 1,
          "Date": "2018-02-04T06:14:27.000Z",
          "Titre": "Watch the shopping cart totals.",
          "Contenu": "I like everything with this company, till I used the save project feature in the shopping cart.  Some type of error, as it was doubling my order for everything.  I never hit the back button.  Manually retyped the quantities, and it did it again.  I just will not use that feature again.  Never had a problem before when not saving a project."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "texaschandler",
          "Nb_Reviews": 1,
          "Date": "2016-04-14T03:36:39.000Z",
          "Titre": "Great site and interface, shipping could be cheaper...",
          "Contenu": "Shipping is fast and there is a great assortment of products to fit almost everyone's needs, but I think shipping could be cheaper. I needed two capacitors to fix a power supply and the order total was less than $1, until they charge $7.99 to ship two capacitors. Keep in mind I am less than an hour away from their warehouse. This time I just went to Radio Shack and got the two pieces I needed..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DAVID MCMASTER",
          "Nb_Reviews": 1,
          "Date": "2021-10-09T13:23:50.000Z",
          "Titre": "Great shipping and product",
          "Contenu": "Great shipping and product. My purchase order # 23182384 was received in a timely fashion and no damage to package.but, of the 20 0431167281 clamp on ferrites, one of the internal media was missing, just the empty plastic snap shell."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Damian Lakatos",
          "Nb_Reviews": 4,
          "Date": "2017-10-16T16:29:45.000Z",
          "Titre": "Seem to work easier this time when …",
          "Contenu": "Seem to work easier this time when looking for a particular part. sometimes it can be a nightmare, as heading do not always seem right, but today was a better. The search works pretty good as long as you know that the particular item may be listed as multiple pinouts/headings, which are not always right.  Its getting better though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Damian Lakatos",
          "Nb_Reviews": 4,
          "Date": "2017-05-11T02:25:43.000Z",
          "Titre": "Photos of product-",
          "Contenu": "I really wish you'd have the actual product photos posted, not just a representative photo. Sometimes this really is important to know exactly what a product is going to look like prior to ordering.  Automation Direct has started doing that, and it's really nice.  It may be time for an upgrade to your website. While  Damian"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thor",
          "Nb_Reviews": 5,
          "Date": "2020-12-17T07:04:15.000Z",
          "Titre": "Great selection, low prices, genuine components, but shipping is a bit pricy",
          "Contenu": "It would be nice if you offered a cheaper economy shipping option, such as third-class mail. In many cases I'd rather wait a few extra days and save the expense of first-class shipping.Right now it's a toss-up between you and Arrow over which is cheaper."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eric jones",
          "Nb_Reviews": 1,
          "Date": "2017-06-15T04:55:02.000Z",
          "Titre": "Shipping cost can be more dependent on …",
          "Contenu": "Shipping cost can be more dependent on order cost or order size. $4.99 shipping for a $2.50 order containing 5 DIP chips is a bit much, but it's still $4.99 when placing an $80 order with a few hundred parts. It would be nice to see a more reasonable shipping cost assessment for really small orders.Thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim Coupal",
          "Nb_Reviews": 1,
          "Date": "2017-01-09T22:38:39.000Z",
          "Titre": "Unsecured ordering",
          "Contenu": "When paying with a credit card, the page is not flipped to secure http which means your credit card information is transmitted in clear text (along with the CVV).  Happily they offer Paypal as well.  I'm happy they have the part I needed at a good price, but I would not pay with a credit card from this site."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ryan Bohm",
          "Nb_Reviews": 1,
          "Date": "2017-10-11T05:59:45.000Z",
          "Titre": "Want add to cart without forcing to choose what's next",
          "Contenu": "I really don't like the option that comes up with every single cart-add to either continue shopping or go to the cart. It's an extra click with every item added. Let me set an option for the session or in my user preferences, but don't make me choose this with every item added!Thanks,ryan"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bryan Butler",
          "Nb_Reviews": 1,
          "Date": "2020-06-13T15:11:32.000Z",
          "Titre": "You've changed your search function…",
          "Contenu": "You've changed your search function recently, and I do not like the changes. It seems to be much slower to respond. I also despise the \"show more\" button. I always want to see all the results. Don't hide most of them under \"show more\"."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Austin",
          "Nb_Reviews": 1,
          "Date": "2019-01-02T17:27:57.000Z",
          "Titre": "Maybe if i'm ordering all through-hole…",
          "Contenu": "Maybe if i'm ordering all through-hole components and for some reason one or two of them are surface mount, someone should/could verify if I meant to buy surface mount. Overall i love the website and find it easy to use and order. I will always come to mouser for part that I need."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Aaaa Chooo",
          "Nb_Reviews": 1,
          "Date": "2017-04-07T22:48:05.000Z",
          "Titre": "Mouser canada  grrrrr. But nice lady when i called fixed it",
          "Contenu": "Bought from mouser canada and had to pay duty since it was brought in from usa. So a $100 part cost me 200+. Called to find out what was goin on and talked with nice lady that helped me correct this issue a bit.  However they need to add more in way of shipping as my part was loose and rattled around."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Paris",
          "Nb_Reviews": 1,
          "Date": "2021-08-22T00:04:22.000Z",
          "Titre": "I have been a Mouser customer for…",
          "Contenu": "I have been a Mouser customer for decades, since the 1990s at the least. Every time I return to Mouser to buy parts, it refuses to recognize my login. I now have 4-6 of them at Mouser because of this issue. Please FIX this..."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "Tetsuyuki Kamiya",
          "Nb_Reviews": 1,
          "Date": "2016-06-19T00:20:09.000Z",
          "Titre": "Thank you your services as always. Please help us this time too",
          "Contenu": "Hello, Thank you so much for your services as always. This time also we have to get them as our order #10481273 by 6/22 in Japan. I would like to ask you to change it shipping method to any earlier service at USP or DHL for Japan if you can. Please advice and help us.  Thanks in advance,Tetsuyuki Kamiya"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2019-06-12T21:37:43.000Z",
          "Titre": "Like the new project access format",
          "Contenu": "Like the new project access format. A nice touch would be the ability to see the Quick View information (the pop-up you have when in the Projects list) at the Submit Order page to be able to do a last minute triple-check on parts right before clicking Submit Order. Thanks!"
        },
        {
          "Note": 4,
          "Lieu": "FJ",
          "Pseudo": "Mike Dorsett",
          "Nb_Reviews": 1,
          "Date": "2021-10-06T02:23:10.000Z",
          "Titre": "few short-commings",
          "Contenu": "generally expensive on:-hook up wireno stock / poor stock levels:Electro mechanical - hardware - nuts and boltsOtherwise pretty good.DHL is best for international shipping - this option tends to be hidden."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Mann",
          "Nb_Reviews": 1,
          "Date": "2021-08-09T00:18:26.000Z",
          "Titre": "I usually order my parts from DigiKey…",
          "Contenu": "I usually order my parts from DigiKey because of their exceptional parts search engine. Today I ordered this part from you because Digikey didn't have it. I'll check out your search engine for my next order."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MisterAlias",
          "Nb_Reviews": 1,
          "Date": "2019-05-01T02:35:21.000Z",
          "Titre": "The only reason I did not give 5 starts…",
          "Contenu": "The only reason I did not give 5 starts is because a multitude of different parts have the same picture depicting them.  Where it may seem redundant, physical pictures verify the part is correct, rather than assuming the duplicated picture is placed correctly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Bostic",
          "Nb_Reviews": 1,
          "Date": "2022-03-28T03:03:09.000Z",
          "Titre": "Mouser customer service is always…",
          "Contenu": "Mouser customer service is always great. I would like to say that if you are going to ration parts it should be in even multiples. A lot of the parts that I use are used in pairs."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marc Martinez",
          "Nb_Reviews": 2,
          "Date": "2017-08-02T14:19:02.000Z",
          "Titre": "I am having a great experience with …",
          "Contenu": "I am having a great experience with your website. I would move it up to a 5 star if i could down load the invoice to an excel format so that i could easily enter into my system for pricing. at this time i have to manually enter all of the pricing. regards, Marc"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "STEPHEN MCCONNELL",
          "Nb_Reviews": 3,
          "Date": "2020-12-14T13:09:30.000Z",
          "Titre": "Navigation a bit tricky, but overall a satisfactory experience.",
          "Contenu": "Navigation a bit tricky, but likely due to massive SKUs. Shipping a bit costly, a flat fee of $5 for 10 items or less would be better. Overall tho, pleased with site performance and product availability. Thank you very much."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Garrett",
          "Nb_Reviews": 1,
          "Date": "2017-04-06T18:31:04.000Z",
          "Titre": "Had difficulty with generation of …",
          "Contenu": "Had difficulty with generation of orders being separate, spent a lot of time trying to figure out how to combine.  Would like to see if I generate a project to have it pile up in one area prior to checkout as I had changes to make to it as I was building it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ron C Slawek",
          "Nb_Reviews": 1,
          "Date": "2020-08-14T20:07:57.000Z",
          "Titre": "I love you all more than Digikey",
          "Contenu": "I love you all more than Digikey. I wish your packers would place a small plug into small strips of IC's instead of gooey plastic tape. They sometime mutilate the plastic tubes. Otherwise, all good. A cookie would be nice."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Roger Watkins",
          "Nb_Reviews": 2,
          "Date": "2017-03-07T05:45:34.000Z",
          "Titre": "MUCH IMPROVED!!!!!! Thanks!",
          "Contenu": "The search feature and your selection has greatly improved over the past 20 years, and was very noticeably improved in the last couple of years.  You have also managed to keep your prices competitive in the process.  Thank you and keep up the good work!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patti Drenning",
          "Nb_Reviews": 1,
          "Date": "2017-08-01T16:59:13.000Z",
          "Titre": "Website is great and shipping is fast",
          "Contenu": "Website is great and shipping is fast.  One thing - be easier to add customer part number / names in the beginning when I am actually ordering the part.  It is a pain to have to stop and go to the cart and put in my part number each time. More work."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Heidi Lewis",
          "Nb_Reviews": 1,
          "Date": "2018-07-06T20:00:48.000Z",
          "Titre": "Love the new \"schedule\" feature",
          "Contenu": "Love the new \"schedule\" feature.  However, the schedule does not show up on the printed document. Other than that, scheduling releases was simple.  Great job.  Thanks go to Rebecca Daily for letting me know about that added feature."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "J Giles",
          "Nb_Reviews": 3,
          "Date": "2016-07-07T14:00:55.000Z",
          "Titre": "Difficulty in matching mating parts",
          "Contenu": "I had to contact sales and get a tech assistance to verify a relay and the plug-in base I selected would match. They did not, but the tech was able to give me the correct one. There should be a correct one suggested along with the part I want."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joseph Connolly",
          "Nb_Reviews": 1,
          "Date": "2020-10-07T13:48:36.000Z",
          "Titre": "Mouser has been a consistent supplier…",
          "Contenu": "Mouser has been a consistent supplier of electronic parts.Delivery is on time, fresh date codes, reliable products and pricing is competitive. The only negative is that many times parts are 'backordered'."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Becky-Lee Koenig",
          "Nb_Reviews": 1,
          "Date": "2018-10-11T14:46:03.000Z",
          "Titre": "I think that Mouser does a great job",
          "Contenu": "I think that Mouser does a great job. The only thing that I would say needs some help is getting back to the customers quicker. I find that sometimes it takes a long time for customer service to get back to you if there is an issue."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Martin",
          "Nb_Reviews": 1,
          "Date": "2019-12-24T18:59:50.000Z",
          "Titre": "Shipping Mix Up",
          "Contenu": "The shipping label on my last shipment didn't include my name so Fedex Office opened the package to look for my name on the invoice, and even though I got the package, I wasn't very happy that they had opened it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marc Lavigne",
          "Nb_Reviews": 3,
          "Date": "2020-04-17T16:08:28.000Z",
          "Titre": "Good source of parts but I'd prefer a…",
          "Contenu": "Good source of parts but I'd prefer a larger selection. I do appreciate the ability to order small quantities. Website navigation is poor, takes too long to sort/filter for parts. Take a lesson from Digi-Key."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Cowan",
          "Nb_Reviews": 1,
          "Date": "2018-08-29T19:24:14.000Z",
          "Titre": "Easy Website but please add PayPal",
          "Contenu": "Easy website, thousands of products.  Would like to see PayPal as a payment option.  I run an ebay store and a website that takes payments by PayPal so being able to pay from my PayPal account makes accounting a lot easier."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "BH",
          "Nb_Reviews": 3,
          "Date": "2017-07-21T16:46:46.000Z",
          "Titre": "Mouser packaging is superior to DigiKey",
          "Contenu": "I like the fact that the Mouser puts a barcode with the manufacturer part number on each bag. This speeds up the handling once we receive them. DigiKey only places some barcode internal to them, so we have to type part numbers manually. For that reason, I only order from DigiKey if Mouser doesn't have the part.I would love if you introduced something like a wish list of parts associated with my account. I often research parts and want to have the list of the promising ones on hand. And when I'm reviewing the cart, I'd like o be able to move parts ( for example the backordered ones) to the wish list.Another point of improvement would be the speed of searches."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 2,
          "Date": "2018-01-11T20:00:46.000Z",
          "Titre": "Mouser has been my \"go to\" source for …",
          "Contenu": "Mouser has been my \"go to\" source for projects as their selection of in stock items continues to bring me back time and again. the service is excellent and \"order\" to \"door\" is always quick!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Hamilton",
          "Nb_Reviews": 1,
          "Date": "2020-02-28T20:54:52.000Z",
          "Titre": "DigiKey still has a better search…",
          "Contenu": "DigiKey still has a better search engine, buy you typically have better prices.  But believe it or not, I am finding some deals on electronic components on Amazon with free shipping and 1 or 2 day delivery."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Fred",
          "Nb_Reviews": 5,
          "Date": "2017-02-10T22:36:02.000Z",
          "Titre": "Very good; suggestion for web page action when choosing components",
          "Contenu": "Good, but easier \"reset\" of all params while remaining in \"resistors\" or \"capacitors\".  Simple \"reset all\", without exiting from the major area such as caps or resistors. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gary Donovan",
          "Nb_Reviews": 1,
          "Date": "2018-03-06T21:53:01.000Z",
          "Titre": "The Navigation...",
          "Contenu": "The Navigation...It's hard for me to find things sometimes.I'm old school and I miss being able to view your inventory as If I'm looking through the catalog. I couldn't find that option anymore."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dave Doyle",
          "Nb_Reviews": 2,
          "Date": "2021-02-05T02:20:55.000Z",
          "Titre": "Improved website.",
          "Contenu": "Last time I was on your website....some years ago..., I was very disappointed with the experience. Now that you have improved the search parameters, I expect to do more business with you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mr Louis Zimmerman",
          "Nb_Reviews": 2,
          "Date": "2022-02-22T19:17:57.000Z",
          "Titre": "a good review",
          "Contenu": "Ive been dealing with you,both professionally and as a Ham Radio Operator, for too many years to remember I have ALWAYS been satisfied with your service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chuck Huber",
          "Nb_Reviews": 1,
          "Date": "2018-02-07T19:55:38.000Z",
          "Titre": "Enhancement Request",
          "Contenu": "Good work on the web site.I would, however, like to be able to search by my part number.  Is there a way you could include matches against customer part numbers in the search result set?Thanks,    - Chuck"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Lundgren",
          "Nb_Reviews": 2,
          "Date": "2017-07-19T18:03:38.000Z",
          "Titre": "When we make choices in the filters",
          "Contenu": "When we make choices in the filters, we choose and then have to scroll down through hundreds of more choices to get to the next one.  Can a collapse button be added so it doesn't take so long?  thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dave Allen",
          "Nb_Reviews": 1,
          "Date": "2019-02-16T00:39:24.000Z",
          "Titre": "My main wish is that when I select…",
          "Contenu": "My main wish is that when I select \"ship complete\" for an order with backordered items, that I would be able to edit and add to or change my order while it is being held waiting for shipment."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephen Holland",
          "Nb_Reviews": 2,
          "Date": "2019-06-18T03:18:50.000Z",
          "Titre": "It astounds me still that I can get…",
          "Contenu": "It astounds me still that I can get small orders shipped efficienntly for reasonable prices.  The order today was to repair a classic amateur radio transceiver (a TenTec Argossy II) and to build a backup power supply for my AT&T high speed internet/VOIP modem. The ability to order small quantity prototype quantities for hobbiest and repair markets is a huge service that I really appreciate.   The only reason for 4 stars instead of 5 is the search engine continues to be a problem.  DigiKey has a better search engine, but you know that. My son went into electrical engineering, perhaps in part due to the magic of being able to order smal parts to use to repair cosumer electronics, that I have done from time to time.  Best regards,SteveKD4TTC"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrew Talkowski",
          "Nb_Reviews": 2,
          "Date": "2021-06-19T04:45:14.000Z",
          "Titre": "I like your search engine for parts .",
          "Contenu": "I like your search engine for parts .. it narrows down the list of bewildering size to the items that I can then choose from. Much better than others sites I tried. Thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Darrough",
          "Nb_Reviews": 6,
          "Date": "2021-09-14T21:18:00.000Z",
          "Titre": "I have liked Mouser for many years",
          "Contenu": "I have liked Mouser for many years. The only thing I do NOT like is how much the toroids cost me. But that does not have any bearing on my high opinion of Mouser."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Christopher",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T18:35:32.000Z",
          "Titre": "I've ordered several times",
          "Contenu": "I've ordered several times, maybe 6-8 times in a year.  I buy stuff for our corporate lab and my hobbies at home.  Shipping is always fast, items are in stock, shipping charges are genuine, items are name brand and not cheap, fake knock-offs.      Mouser saves me a lot of stress."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MARK J",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T07:45:46.000Z",
          "Titre": "I like your fast shipping",
          "Contenu": "I like your fast shipping! As a novice repairing my vintage stereo equipment it would be great to have access to easily searchable charts for equivalent outdated or NLA components."
        },
        {
          "Note": 5,
          "Lieu": "HR",
          "Pseudo": "David Zovko",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T15:12:00.000Z",
          "Titre": "Great source for electronic components",
          "Contenu": "Great source for electronic components. Simple to order and reasonable free shipping threshold. Buyer for 10+ years."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JimC",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T21:20:31.000Z",
          "Titre": "Easy site to use",
          "Contenu": "Easy site to use, helpful notes about related items shown.  Would like to see at link to graphic catalog type page to quickly see other items in the same family.."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bells CB",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T00:51:00.000Z",
          "Titre": "I came and was able to locate my Caps easy",
          "Contenu": "I came and was able to locate my capacitor type very quickly and , checkout was a breeze...I was happy to see 2 day shipping options, the whole reason I started my quest on Amazon was to get them quick, they couldn't do better than a week for no name caps, with Mouser I got Vishay caps and 2-day quick. Thanks Mouser."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Randall Williams",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T19:49:33.000Z",
          "Titre": "Mouser Order NOV 13 2023",
          "Contenu": "The order I placed today is one of if not the most voluminous ones I've ever placed with Mouser.  There were no issues with the website timing out, which was extremely helpful during cross checking of my merchandise needs to entries placed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "greg kinsley",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T17:55:51.000Z",
          "Titre": "Your level of timely service matters to…",
          "Contenu": "Your level of timely service matters to us and our awaiting customers. We have seen improvements that make you the first-stop for parts sourcing over the previous leading vendor, congratulations and we Thank You and your Teams for the great work!! \"the Circuit Board Repair Team\""
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JR",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T01:20:56.000Z",
          "Titre": "I liked when things are in stock",
          "Contenu": "I liked when things are in stock. I dislike when there is a huge minimum quantity, that makes it impossible to experiment, unless you are a fortune 500 company.But, you ALSO have a responsibility to stay in businessfor all stake holders involved."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Baber",
          "Nb_Reviews": 2,
          "Date": "2023-11-12T20:24:34.000Z",
          "Titre": "As a private consumer",
          "Contenu": "As a private consumer, I've made numerous purchases from Mouser over the years. Since May 2022, 17 in fact. Most of the time, it has been Aptiv connectors and terminals which I needed for rebuilding wire harnesses for my Chevrolet truck. Mouser has never got an order wrong. Shipping has always been same day (unless I ordered on a Friday which understandably is not picked and shipped til Monday or Tuesday, I forget which). I've literally watched (through their website) an order be picked and prepared for shipment. Quite impressive how efficient they are. I also thought one of my orders was misdelivered because UPS said it was delivered yet it was not at my doorstep. I called them up and they were going to ship me out another one on them. Turns out, UPS guy marked it as delivered to avoid cut off time. He showed up to my home about an hour or so later with the package. I immediately called Mouser and told them what happened, and to cancel the replacement order. They did without difficulty. Man, this company is excellent. I just love ordering from them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick McInnis",
          "Nb_Reviews": 6,
          "Date": "2023-12-05T22:59:34.000Z",
          "Titre": "I love Mouser",
          "Contenu": "I love Mouser.  I am a DIYer and Mouser appreciates my orders.No one does as good a job as MOUSER!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Louis Agger",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T23:25:20.000Z",
          "Titre": "Simple as Pie",
          "Contenu": "Everything I needed was in stock and I was pleasantly surprised to be able to have my order within two days.  I needed it soon, so that pleased me.  The site was a little tricky using it for the first time to look up and order 5 different items, but I figured it out. Creating the account was simple. The checkout was simple and quick.  I'm glad I found you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Noah",
          "Nb_Reviews": 3,
          "Date": "2023-11-07T21:29:05.000Z",
          "Titre": "Company That Stands by Their Product",
          "Contenu": "There was a delay in processing my first ever order, which is understandable. They shipped it out next day air free because of the delay. That's good service. Definitely using them in the future."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "rog b",
          "Nb_Reviews": 7,
          "Date": "2023-11-24T14:20:10.000Z",
          "Titre": "Ordered on Wednesday, arrived today",
          "Contenu": "Ordered on Wednesday, arrived from Texas today,  no customs delays. Well done Mouser and well done Fedex."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T19:44:32.000Z",
          "Titre": "First order to date",
          "Contenu": "First order to date. Website works very well. Good prices on most items. Easy to download data sheets."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Anders",
          "Nb_Reviews": 13,
          "Date": "2023-10-05T10:39:53.000Z",
          "Titre": "Fast despatch, great prices",
          "Contenu": "I've been amazed at the stock held. You work through a list of componets for your circuit and everything is in stock and at a good price.  And when you're prototyping, you can order one or two units. Fast delivery to UK too, with the order generally arriving within two days of despatch."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter T. Miller",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T12:17:08.000Z",
          "Titre": "Best parts search engine + details",
          "Contenu": "Best parts search engine, Quick access to data sheet, 95%+ best pricing, fast shipping (with the little clock that shows how long I have if I want it shipped that day.) easy ability to report errors (\"See an Error?\") great back-order options"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Elliott Coe",
          "Nb_Reviews": 33,
          "Date": "2023-10-09T12:23:57.000Z",
          "Titre": "Very fast delivery",
          "Contenu": "Very fast delivery! Postage is a bit high at £12, so you have to spend a minimum of £33 to get free delivery, but the products come within a week from Texas! Very nicely packaged and will definitely order again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Manganaro",
          "Nb_Reviews": 2,
          "Date": "2023-11-23T20:34:08.000Z",
          "Titre": "All components were in stock & of Great Quality",
          "Contenu": "All components were in stock. Love the fast shipping and accuracy of the orders. Mouser is the best !!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Hughes",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T04:03:27.000Z",
          "Titre": "Mouser support has been great",
          "Contenu": "Mouser support has been great.  Every time I make contact, whether for sales or when searching for a parts equivalent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gerald Hester",
          "Nb_Reviews": 6,
          "Date": "2023-02-08T00:29:05.000Z",
          "Titre": "Mouser is still doing a wonderful job…",
          "Contenu": "Mouser is still doing a wonderful job in all areas of distributing electronic parts. All part info available to assist with part selection, good stock of parts, terrific website and user interface, and someone always answers the phone and whatever needs to be handled that person handles it right then without passing me off to someone else. Everything about how a company operates comes from the person at the very top. Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Don Smith",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T18:00:46.000Z",
          "Titre": "Parts were easy to find on website with…",
          "Contenu": "Parts were easy to find on website with quantity pricing given with product descriptions. Checkout was easy with PayPal and no need to set up on account for a small purchase. Pricing and ease of process was competitive with Amazon ... something that is not always easy to do. Thanks and I look forward to getting my parts quickly!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MATT",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T17:04:20.000Z",
          "Titre": "I've been buying from Mouser for years",
          "Contenu": "I've been buying from Mouser for years. They ship SUPER fast and usually have what I'm looking for. I'm fairly close to them so my orders typically get to me the next day!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "C M Wellheuser",
          "Nb_Reviews": 1,
          "Date": "2023-04-08T18:10:12.000Z",
          "Titre": "Mouser rocks!",
          "Contenu": "Component selection, availability and pricing is excellent, and shipping costs are very reasonable.  Search tools and filters work really well to narrow down choices, and having datasheets on everything available right there is so helpful.  Ability to order single components is key for hobby guys and prototyping.  And I don't recall ever having any errors on an order.  Keep up the good work, you guys are doing everything right."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Gilchrist",
          "Nb_Reviews": 1,
          "Date": "2022-12-12T19:29:50.000Z",
          "Titre": "Awesome customer service!",
          "Contenu": "Great website for finding any part I need. Also, on the few occasions that I've had needed to call customer support (including today), the phone gets answered by a human straight away who doesn't have to transfer me 5 times to get things solved...no need to wade through dozens of frustrating menus to only end up with some automated recording that your call is very important to you etc."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leon Edwards",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T22:10:01.000Z",
          "Titre": "The three people that I spoke to from…",
          "Contenu": "The three people that I spoke to from start to finish that helped me get the right product I needed, ordered, shipped and delivered to my home were great. They were all very gracious, patient and showed such concern while helping me. I would tell anyone that Mouser Electronics is the best !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Denis Bourdeau",
          "Nb_Reviews": 2,
          "Date": "2023-08-13T00:50:24.000Z",
          "Titre": "Best on-line and easy search and ordering.",
          "Contenu": "MOUSER has always had a great on-line ordering website.  Have been loyal customer for years and have only seen improvement.  Hardly ever consider those other electronic-products/components firms since MOUSER is so easy to use and very reasonable shipment."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Clayton",
          "Nb_Reviews": 2,
          "Date": "2023-03-21T20:23:54.000Z",
          "Titre": "If they don't have it, it may not exist",
          "Contenu": "Considering that Mouser likely has millions of items most of them very small like resistors, they have a fantastic online system and in most cases are willing to sell smaller quantities. For small shops like mine, this is a fantastic thing. It would be cost prohibitive if these folks took the COSTCO approach to retail and I'd have to give it up."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Allen Cunningham",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T14:45:20.000Z",
          "Titre": "First order was prompt",
          "Contenu": "First order was prompt, the packaging was first rate.The site navigation went well, certainly better thanDigi-Key."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "GUY WALSH",
          "Nb_Reviews": 8,
          "Date": "2023-06-29T20:36:30.000Z",
          "Titre": "Telescope Encoders AMT103",
          "Contenu": "Although I only bought a small consignments they were delivered fast and with free postage. Will use again, only found them while researching encoders for my telescope, bought them for a fraction of what and astronomy shop sell them for!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Harrises",
          "Nb_Reviews": 1,
          "Date": "2022-09-01T00:11:18.000Z",
          "Titre": "Great inventory, prices, and support",
          "Contenu": "Always better inventory and better prices than other distributors.  Unbelievably fantastic support.  Your staff picks up the phone within three rings and there is no maze of buttons to press in order to speak to an actual person.  Pretty amazing.  I had a quick question today and Jessica was extremely helpful.  I don't know how you do it, but keep doing what you're doing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carroll",
          "Nb_Reviews": 3,
          "Date": "2023-07-04T07:30:43.000Z",
          "Titre": "Great source for electronic components - Mouser",
          "Contenu": "It took some time to learn how to use the product filters and use the Project tools but was able to find 95% of the components I needed to work on my small amateur radio project.  I may have spent less money using another company but I like the quality of the products offered.  Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rahav Dor",
          "Nb_Reviews": 2,
          "Date": "2023-06-25T22:07:01.000Z",
          "Titre": "Superior shopping experience and inventory at hand",
          "Contenu": "I love to see that you have inventory available at hand. Awesome job. This makes me want to buy more from you, so you can keep up this investment.Your website is easy to navigate. Manufacturer product codes are correct and it is easy to locate items. It was great to see that you are connected to modern payment terms. I love the report error link."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edward Stoneham",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T19:58:20.000Z",
          "Titre": "Good job!",
          "Contenu": "I like the ease with which parts can be shipped to our manufacturers in Taiwan and the no-added-cost shipments. Also, it is helpful seeing estimated restocking dates and quantities for parts that are either low in stock or out of stock. In addition, Mouser frequently has parts in stock that are not available elsewhere - keeping the pipeline flowing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Caryn Turrieta",
          "Nb_Reviews": 1,
          "Date": "2022-11-28T08:04:56.000Z",
          "Titre": "Mouser makes it very easy to place…",
          "Contenu": "Mouser makes it very easy to place orders online.  However, there is one request that I would like to make.  It would be extremely helpful if the online purchasing experience could be upgraded by adding the ability to provide tax status of orders by line item.  Most of my orders are for engineering and are taxable, but a few are for resale (no tax)."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harry P.",
          "Nb_Reviews": 2,
          "Date": "2022-11-02T20:38:07.000Z",
          "Titre": "Easy Site to Navigate and Search for Products That Were Not Available on Other Sites",
          "Contenu": "Easy process to register, create BOM list and place order.  The Mouser site seems to have more available products and quantities than other sites.  When I searched other sites for the availability of products, the newer released products were not available yet or older products were discontinued or limited in quantities or out of stock."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leo Jubinville",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T16:48:37.000Z",
          "Titre": "Great Experience!",
          "Contenu": "I typically find what I am looking for in parts.  Service is always terrific.  I generally will get the parts within a day or two.  It is like having my own stockroom within my grasp, which is great for a small consulting business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave Mandelbaum",
          "Nb_Reviews": 3,
          "Date": "2022-09-03T01:05:10.000Z",
          "Titre": "the only negative is the website pop-up…",
          "Contenu": "the only negative is the website pop-up for continue shopping and view cart.  that is unnecessary and slows down the ordering procedure.  when one hits the \"buy\" button the cursor should return to the part number entry position, the way it was a long time ago.  that would GREATLY improve the buying experience on the site and save a lot of time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JG",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T21:30:21.000Z",
          "Titre": "All the items you carry !",
          "Contenu": "All the items you carry !Easy to find parts i need.PRICE ! And no minimum order!!THANK YOU MOUSER!!!And Happy Hollidays to ALL !!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gary Grijalva",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T17:42:00.000Z",
          "Titre": "Easy purchase setup that is nice for…",
          "Contenu": "Easy purchase setup that is nice for me. Thankfully I found a group chat on the necessary repair with my ribbon cable being the issue. Glad you are in the states for a hopefully for easy shipping although this California weather is affecting so many things. Stay safe and thanks again. Gary"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "DeltaGen",
          "Nb_Reviews": 5,
          "Date": "2023-01-10T21:27:12.000Z",
          "Titre": "Super easy to find what you need",
          "Contenu": "I was able to easily find the components I needed via their website and filtering down what I needed, and placed my order. Order had shipped by the end of the day, and was at my doorstep 2 days later.I was impressed, but it doesn't stop there. I needed a few more components, and again was able to easily filter down through the website to find exactly what I needed. Placed the order, and AGAIN, within 2 days, they were at my door. Absolutely FANTASTIC!!! Will definitely be coming back when I inevitably need more components for my projects."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim Oakley",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T17:15:15.000Z",
          "Titre": "1 able to find exact part",
          "Contenu": "1 able to find exact part2 checkout was orderly, billing, then shipping info.3 payment options are great,          plus no \"fake 2 factor ID (marketing)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ethan",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T01:55:24.000Z",
          "Titre": "I've been buying from Mouser for over…",
          "Contenu": "I've been buying from Mouser for over 30 years.  I've read some recent reviews which left me puzzled as to why somebody would report negatively and I left my opinion.I have nothing bad to say at all about Mouser."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael W.",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T18:47:19.000Z",
          "Titre": "I appreciate the choice of having better stock",
          "Contenu": "I appreciate the choice of having a lower cost for just a few small items.Also you had the capacitors I needed. You seem to be better stocked for electronics components.Lately Digikey seems to have less supplies.ThanksMike"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PFL",
          "Nb_Reviews": 1,
          "Date": "2022-09-21T03:52:59.000Z",
          "Titre": "Mouser is still easy to order from.",
          "Contenu": "Mouser is still easy to order from. This is in contrast to other companies which ONCE were, but now either do not ship small orders, or the process is too difficult or confusing to use. I like the Paypal option.Seems to be one of the last places which will ship small orders."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gordon Ferris",
          "Nb_Reviews": 1,
          "Date": "2023-01-27T00:42:12.000Z",
          "Titre": "excellent shipping speed, easy to find product",
          "Contenu": "I quickly found the part number that I had previously ordered.  It was in-stock, and I was able to quickly order it.  Especially important was being able to arrange for a delivery tomorrow, even though I placed the order about 4:30pm today Mansfield, Texas time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Mondok",
          "Nb_Reviews": 1,
          "Date": "2023-05-21T22:38:03.000Z",
          "Titre": "Quick & Easy",
          "Contenu": "Good search tools.  Simple to order once part number is known.  Saves time compared to competing vendors.  Excellent choice of items, large inventory."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Mundt",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T17:15:45.000Z",
          "Titre": "The Best place!",
          "Contenu": "Your web site and selection are great and it's all in stock.  Although I don't need to order too often any more, Mouser is my \"Go To\" electronics parts store.  Thanks to all your staff.  Paul M."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Royce",
          "Nb_Reviews": 1,
          "Date": "2023-01-09T20:55:49.000Z",
          "Titre": "Exceptional service",
          "Contenu": "A while back I had put in an order that wasn't being fulfilled because there was always one or more part that was out of stock. I called, and Sandy and Neil both helped me find replacements for each item in my BOM. They were incredibly helpful and I still think about that, a year or so later. Thanks again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles EHRMAN",
          "Nb_Reviews": 1,
          "Date": "2022-11-08T02:55:46.000Z",
          "Titre": "I talked to the Chat agent Elaina",
          "Contenu": "I talked to the Chat agent Elaina. I described what I needed. I was referred to Julio in Tech Service. The info was reviewed and I was referred to the appropriate group. Pankaj reviewed the info and said the quote would be sent to me.I received the quote today and I ordered the part.I am an individual, not a corporate customer, so I appreciate the extremely courteous service from the three levels of your Tech service I talked to."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bootman",
          "Nb_Reviews": 2,
          "Date": "2023-03-27T00:37:02.000Z",
          "Titre": "Long Time Partnership",
          "Contenu": "I have been using Mouser for at least 20 years and I have never been disappointed. I've one order in all that time that was fouled up and Mouser immediately made it right.To Management:Keep doing what you're doing.  Resist the urge to change things. If it ain't broke don't fix it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David MacKinnon",
          "Nb_Reviews": 1,
          "Date": "2023-01-24T18:27:57.000Z",
          "Titre": "Most components are easy to find and to…",
          "Contenu": "Most components are easy to find and to determine cost and availability.  I'm a small business building and repairing vacuum tube amplifiers. I appreciate being able to buy one part or 100 parts.Thank you,Dave"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrea Leon",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T19:05:36.000Z",
          "Titre": "Thank you for existing!!!",
          "Contenu": "Thank you for existing!!!! You’ve made it possible for me to rebuild my truck. Can’t wait to finish it. Thank for your products and your service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ronda Snyder",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T19:18:24.000Z",
          "Titre": "Very easy to order the parts needed",
          "Contenu": "Very easy to order the parts needed.  Convenient ordering process and the material was in stock."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Smith Nash",
          "Nb_Reviews": 1,
          "Date": "2022-08-13T17:23:23.000Z",
          "Titre": "I rely on Mouser",
          "Contenu": "Mouser is my primary source for parts in older, vintage, and antique electronics.  I know there are other, niche market suppliers but I rely on Mouser to get the most for my investments as well as my customer's.  I'm very happy with the selection of available, through-hole and axial lead parts.  Point-to-Point wiring is an artform and thus isn't suited for SMD where long leads and basic aesthetics are important to me and my customers.  Many desire as-close-to-original as can be obtained with modern components without restuffing capacitor cans and Bumble Bee casings.  Mouser is my go-to source for vintage components and I hope they continue supporting the vintage and antiques market."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kim Herron",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T18:12:57.000Z",
          "Titre": "Great as Always",
          "Contenu": "Always have what I need and the shipping is great.  Nice to be able to pay with Paypal  That's my biggest thing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zorlac Jones",
          "Nb_Reviews": 2,
          "Date": "2023-10-18T07:43:46.000Z",
          "Titre": "Mouser had all the parts with no tariff fees.",
          "Contenu": "Mouser had all the parts I needed and you didn't charge the tariff fees that DigiKey wanted for the same parts! DK was a buck less for shipping but the tariff fees killed them. You win, Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Anderson",
          "Nb_Reviews": 2,
          "Date": "2023-05-19T21:40:57.000Z",
          "Titre": "Mouser is our go to for electrical…",
          "Contenu": "Mouser is our go to for electrical items, don't change a thing because we are your biggest fan out here in the repair business sector. Thanks again for having what we needed. Kenworth"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marsha Meyer",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T22:45:57.000Z",
          "Titre": "Online ordering is super easy",
          "Contenu": "Online ordering is super easy.  Mouser is the first place we go to because of parts availability, 2-day shipping and great customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William West",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T07:01:43.000Z",
          "Titre": "You are far better than DigiKey",
          "Contenu": "You are far better than DigiKey. I have purchased with them before but your choice of passives are better suited to my repairs. I repair vintage computers and I believe you are the best place for my components"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roger Scheidler",
          "Nb_Reviews": 1,
          "Date": "2022-11-17T23:29:21.000Z",
          "Titre": "Your site is SUPER user freindly",
          "Contenu": "Your site is SUPER user freindly. A person doesn't have to dink around to find, confirm and place an order. Graphics are clear and intelligible. Your IT developers really have earned their keep."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harry Tapp",
          "Nb_Reviews": 1,
          "Date": "2022-10-01T01:45:25.000Z",
          "Titre": "I'm having a problem with my previous…",
          "Contenu": "I'm having a problem with my previous order. I sent a reply to that order confirmation with the problem and have yet to hear back. One part of that order [16v 100uF] had a high ESR and intended to order all parts as low ESR. I noticed on the shipping invoice that two parts of the order were low \"impedance\" [ESR] and the one was \"general purpose\" electrolytic capacitors. This is likely due to confusion in the order sheet parts selection platform. [I thought I was selecting low ESR parts on ALL the parts.]I found the parts today in their lists from a different manufacturer [Panasonic, I previously ordered Rubycon] in confirmed low ESR. I was hoping that to solve the problem they would at least forgo the shipping cost on this new order to get the right parts. $7.99 shipping for a small blister pack of components across a couple of states seems quite exorbitant. To have to pay that cost again to get the right parts is extremely disappointing."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Alvaro Hermida",
          "Nb_Reviews": 9,
          "Date": "2023-08-11T00:01:45.000Z",
          "Titre": "The best place to buy electronic components.",
          "Contenu": "The best place to buy electronic components.Mouser is a place where I buy without fear. It offers DDP incoterms to buy with peace of mind from Europe, trusting that the Treasury and customs will receive what corresponds to them, without hassles or conflicts.Huge catalog, including the latest products the same day they hit the market, and always genuine products. Sometimes you can even buy engineering samples from Mouser.Makers and entrepreneurs love Crowdsupply (of course), and Mouser stocks many of their products, becoming the safest way to buy them.Delivery to Spain usually takes two or three days, via Fedex. Never ever had any problem on customs, thanks to Mouser's honesty respecting the DDP incoterms.Of course, after several dozens orders, there have been a few minor issues with some product, and Mouser have always resolved them quickly and professionally, after relaxed communication with competent and polite humans whose office is physically located in Spain (so far from the sad experience with their Thief River neighbors...).###El mejor sitio para comprar componentes electrónicos.Un lugar donde puedo comprar tranquilo. Ofrece incoterms DDP para comprar con tranquilidad desde Europa, sabiendo que Hacienda y aduanas recibirán lo que les corresponde, sin líos ni conflictos.Muchísimos productos, siempre originales. Entrega habitualmente en dos o tres días, vía Fedex.En un par de ocasiones surgieron problemillas con un producto, y siempre las han resuelto con rapidez y educación (al contrario que la experiencia con sus vecinos de Thief River)."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Nuss",
          "Nb_Reviews": 2,
          "Date": "2023-06-27T09:26:54.000Z",
          "Titre": "Having data sheet to see exact…",
          "Contenu": "Having data sheet to see exact measurements of item- VERY important.  Web site works!  Useful selection of quality grounding bars!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "W Mike Berke",
          "Nb_Reviews": 1,
          "Date": "2023-07-01T01:42:53.000Z",
          "Titre": "I found the module I was looking for…",
          "Contenu": "I found the module I was looking for right away at Findchips.com and clicked into Mouser because I have an account with you and boom, the modules (2) will be arriving in a couple of days.  That is super helpful and timely.  Thank you.  -Mike-"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jurijs",
          "Nb_Reviews": 2,
          "Date": "2023-05-10T00:35:16.000Z",
          "Titre": "I think it's a great web store",
          "Contenu": "I think it's a great web store. I was able to find almost all the details that I need. Some of the prices are too high. but much more can be found at a great price and fast delivery. And I really like that they made sure that we could immediately download the footprint for the printed circuit board from the page. I have only positive feelings for them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ismail",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T22:18:43.000Z",
          "Titre": "Accurate & on time",
          "Contenu": "Always accurate, always on time, always helpful. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Dotson",
          "Nb_Reviews": 4,
          "Date": "2023-06-27T20:59:45.000Z",
          "Titre": "Super prompt shipping",
          "Contenu": "Super prompt shipping. QC on large orders is excellent. There were no mistakes on a recent order with 102 line items!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Philip Pottier",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T20:35:46.000Z",
          "Titre": "My Mouser Experience",
          "Contenu": "I am impressed with the ease of selecting parts, placing an order, and promptly receiving the order with everything exactly that I ordered.In a time of supply chain issues and general confusion, it is great to deal with Mouser!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Isaac Flaum",
          "Nb_Reviews": 1,
          "Date": "2022-10-29T05:03:36.000Z",
          "Titre": "Simply the best",
          "Contenu": "Excellent website design. Quick and easy to find parts for projects - fast shipping and professional customer service. I try to source all my parts from Mouser whenever possible."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cliff in Atlanta",
          "Nb_Reviews": 2,
          "Date": "2023-05-08T01:04:55.000Z",
          "Titre": "The website tools very helpful",
          "Contenu": "The website tools are very helpful when planning a project. The search parameters and layout is perfect for my needs. No need to shop around when everything I need is here and the prices are reasonable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JoJo",
          "Nb_Reviews": 2,
          "Date": "2023-06-14T12:50:49.000Z",
          "Titre": "Mouser is the Best!",
          "Contenu": "Mouser is the best. I’ve been purchasing from Mouser since 2019 and have no complaints. Their prices are good and they do not charge a “handling” fee as one pf their competitors does. Mouser is my first choice when I need electronic parts."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Max",
          "Nb_Reviews": 3,
          "Date": "2022-10-21T01:09:42.000Z",
          "Titre": "Easy Order Navigation - Low Cost Shipping Options!",
          "Contenu": "Very easy to navigate my orders, my carts, and place an order.   You offer a low-cost shipping option (US Mail, $3.50) which enables me to spend more money on parts from Mouser and less money on shipping!  THANK YOU."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kenneth Grizzell",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T01:26:03.000Z",
          "Titre": "It was so easy to set up my account",
          "Contenu": "It was so easy to set up my account. You had the parts I needed and your web page made it quick and easy to find. I used to use your company when I worked for NCR years ago and always thought your service was greaat. Ken G."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Mrazik",
          "Nb_Reviews": 1,
          "Date": "2023-01-09T19:09:06.000Z",
          "Titre": "Always pleased with Mouser",
          "Contenu": "Always pleased with Mouser. Website is easy to use. Shipping is always very prompt. Numerous selections are usually available. Illustrations are good. Prices are reasonable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roger Gault",
          "Nb_Reviews": 1,
          "Date": "2022-08-27T06:13:11.000Z",
          "Titre": "All Aspects of this Company Are Grea",
          "Contenu": "The website is super easy to use.  The prices are reasonable.  Delivery is sometimes faster than the short times they promise.  Never had a problem with an order.  What's not to like."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Hummel",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T22:16:23.000Z",
          "Titre": "I created two orders",
          "Contenu": "I created two orders. Then realized I should have combined them. I chatted with someone and they cancelled my orders, and I reordered all under one order. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Radman",
          "Nb_Reviews": 1,
          "Date": "2023-04-25T18:35:01.000Z",
          "Titre": "Mouser has been great!..",
          "Contenu": "Mouser has been great!... even upgraded my recent shipment speed for no additional charge.  I will definitely repeat."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Weise Auto weise",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T22:13:21.000Z",
          "Titre": "Had to call for certain information",
          "Contenu": "Had to call for certain information.  They were very helpful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Pagano",
          "Nb_Reviews": 2,
          "Date": "2023-03-31T14:12:02.000Z",
          "Titre": "HIGH SOCIETY",
          "Contenu": "Prices are high.. but so is the availability and quality. A coupon code or slight discount for loyal customers would be nice.."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 2,
          "Date": "2023-08-28T01:30:39.000Z",
          "Titre": "Good customer service, item selection and website",
          "Contenu": "Website works well.  Item selection matched what needed for Prius component, although disappointed with backorder delay.  Customer Chat Service Representative was prompt and answered my questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott R",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T15:54:39.000Z",
          "Titre": "Easy to find what I wanted",
          "Contenu": "Easy to find what I wanted, easy to order, prompt, efficient, professional and inferred very friendly. Thank you and keep up the good work!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Anderson",
          "Nb_Reviews": 2,
          "Date": "2023-04-19T23:13:23.000Z",
          "Titre": "Always have the items we are presently…",
          "Contenu": "Always have the items we are presently using in diesel repair, thank you for helping us help all of you to move Americas Freight. Have a good one"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "zachary greenman",
          "Nb_Reviews": 1,
          "Date": "2022-10-14T22:26:14.000Z",
          "Titre": "I love the straight forward ordering…",
          "Contenu": "I love the straight forward ordering process for an item that is backordered. From getting a quote to placing the order it is seemless."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Animal Reproduction Systems, Inc.",
          "Nb_Reviews": 13,
          "Date": "2022-11-03T19:36:08.000Z",
          "Titre": "Website is very easy to navigate",
          "Contenu": "Website is very easy to navigate.  Helpful to have stock quantities posted so I can see if what I need is available."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Hubacher",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T19:00:52.000Z",
          "Titre": "Reliable service in all respects",
          "Contenu": "Reliable service in all respects.  Thank you very much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eng. Anibal",
          "Nb_Reviews": 2,
          "Date": "2022-12-05T09:08:56.000Z",
          "Titre": "Excellent experience, simple and fast shipping",
          "Contenu": "Navigating Mouser's site is simple and easy to find any component plus a great and fast shipping options.Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Smith Brothers Services",
          "Nb_Reviews": 6,
          "Date": "2023-06-23T20:13:20.000Z",
          "Titre": "I am a long time customer because you…",
          "Contenu": "I am a long time customer because you have it, and get it out fast, at a reasonable price. NEVER a problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Werner",
          "Nb_Reviews": 3,
          "Date": "2022-09-28T19:56:28.000Z",
          "Titre": "Very easy website to search",
          "Contenu": "Very easy website to search, lots of stocked items.  Always my first choice for small electronic components."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel S.",
          "Nb_Reviews": 1,
          "Date": "2022-10-18T19:48:02.000Z",
          "Titre": "BOM tool works well",
          "Contenu": "This was my first time using the BOM upload tool.  Worked perfectly and will be using it in the future for larger projects."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gail",
          "Nb_Reviews": 1,
          "Date": "2022-11-09T23:38:33.000Z",
          "Titre": "Split my shipments",
          "Contenu": "I had the option of having multiples shipments since 2/10 are backordered.  It's quick and easy to find items.  The only thing that might help is having an ETA for the backordered items."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Flint",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T03:37:38.000Z",
          "Titre": "Search box quick and accurate",
          "Contenu": "I had the part numbers and the search window took me right to correct part.  Fast and easy.  Shipping reasonable for order."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Heisserman",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T19:45:29.000Z",
          "Titre": "easy to use",
          "Contenu": "easy to use, products have always been as promised."
        },
        {
          "Note": 5,
          "Lieu": "VE",
          "Pseudo": "Jesus Pacheco",
          "Nb_Reviews": 2,
          "Date": "2022-09-12T16:07:55.000Z",
          "Titre": "You are doing a great job",
          "Contenu": "You are doing a great job. The support experience is very well and the whole purchasing process is very fast and friendly. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harris Gates",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T23:07:08.000Z",
          "Titre": "Site is easy to use and you can…",
          "Contenu": "Site is easy to use and you can ACTUALLY FIND the continue shopping button without conducting  full blown search."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Minck",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T22:28:27.000Z",
          "Titre": "Easy to order and checkout",
          "Contenu": "Easy to order and checkout. Great selection of parts"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RON COMSTOCK",
          "Nb_Reviews": 3,
          "Date": "2023-07-04T03:06:28.000Z",
          "Titre": "Really great service",
          "Contenu": "Really great service, A tech helped me find what I needeed while the sales girl stayed on the line to help complete my order.This is the place for electronic parts in the USA."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Mangione",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T19:07:02.000Z",
          "Titre": "Spoke to Paul",
          "Contenu": "Spoke to Paul, technical Dept. To research part. Great response, patient. Good job, Paul"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Engineer  some company",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T21:04:40.000Z",
          "Titre": "The part I needed was in inventory and…",
          "Contenu": "The part I needed was in inventory and available.  I placed an order and should have my parts tomorrow."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dean Marcott",
          "Nb_Reviews": 4,
          "Date": "2023-05-21T04:12:22.000Z",
          "Titre": "Will ship in small quantiles",
          "Contenu": "Great selection of products. Great price and will ship in small quantities without handling charges."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dennis Piskula",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T02:58:01.000Z",
          "Titre": "ON time and no problems!!!"
        }
      ]
    }
  ]
}